[{"title": "Relationship Manager", "text": "Pros Its a great work environment. Everyone is incredibly friendly, even though its a huge office with multiple products and departments in it (NYC). The work is really autonomous - my manager checks in on me but is not breathing down my back. You're told what you need to accomplish by the end of the year/quarter, and you're left to do it. Of course, you're surrounded by people who are happy to help. There is a great work/life balance. 20 days off per year, unlimited sick days, and no stigma around using them. We go out as a team for drinks or volunteer quite frequently, so you really do get to know everyone around you. Cons you work from 8:30-6:00, technically you have a hour long lunch but everyone eats at their desk, so it's a 9 1/2 hour day. There is a hierarchy of products. If you work for one of the smaller products within acuris you're not always prioritized and pushed to the sideline, which is incredibly frustrating. Advice to Management treat all products, and their respective employees, equally! by putting products in competition with one another and giving resources to only the top products you're creating a downward spiral for the smaller teams.", "rating": 5, "pros": "Its a great work environment. Everyone is incredibly friendly, even though its a huge office with multiple products and departments in it (NYC).", "cons": "you work from 8:30-6:00, technically you have a hour long lunch but everyone eats at their desk, so it's a 9 1/2 hour day.", "advice": "treat all products, and their respective employees, equally! by putting products in competition with one another and giving resources to only the top products you're creating a downward spiral for the smaller teams."}, {"title": "Mergermarket", "text": "Pros Good place to train as financial journalist Cons Terrible management culture full stop Advice to Management Clean house", "rating": 3, "pros": "Good place to train as financial journalist", "cons": "Terrible management culture full stop", "advice": "Clean house"}, {"title": "Solid education in the markets", "text": "Pros Dentire has a solid core team with a deep knowledge base Cons The business model, including the publishing of quasi nonpublic info can feel dodgy", "rating": 3, "pros": "Dentire has a solid core team with a deep knowledge base", "cons": "The business model, including the publishing of quasi nonpublic info can feel dodgy", "advice": null}, {"title": "Account Director", "text": "Pros Great work life balance Travel Good commission plan Cons I dont have a cons yet,", "rating": 5, "pros": "Great work life balance", "cons": "I dont have a cons yet,", "advice": null}, {"title": "good company", "text": "Pros flexible work time and friendly staff Cons travel and have to work long hour some times", "rating": 5, "pros": "flexible work time and friendly staff", "cons": "travel and have to work long hour some times", "advice": null}, {"title": "Great Place to work", "text": "Pros Staff are all friendly and supportive. Great place to learn and get some real hands on experience. Cons Pay could be better and some depending on the time of the year it can be super busy which requires putting in extra hours. Advice to Management Get more involved and give provide better project management.", "rating": 5, "pros": "Staff are all friendly and supportive. Great place to learn and get some real hands on experience.", "cons": "Pay could be better and some depending on the time of the year it can be super busy which requires putting in extra hours.", "advice": "Get more involved and give provide better project management."}, {"title": "Great company", "text": "Pros Flat structure, very entrepreneurial atmosphere Cons There are no obvious cons in working here.", "rating": 5, "pros": "Flat structure, very entrepreneurial atmosphere", "cons": "There are no obvious cons in working here.", "advice": null}, {"title": "Great Company", "text": "Pros Enjoyable atmosphere where the managers let you take the ball and run with it. Cons Allow employees to travel to other offices more often.", "rating": 5, "pros": "Enjoyable atmosphere where the managers let you take the ball and run with it.", "cons": "Allow employees to travel to other offices more often.", "advice": null}, {"title": "Analyst", "text": "Pros Laid back environment. People are very nice there Cons Not much room for career advancement", "rating": 3, "pros": "Laid back environment. People are very nice there", "cons": "Not much room for career advancement", "advice": null}, {"title": "A good company", "text": "Pros Smart, dedicated staff that is focused on breaking news and providing proprietary market information and analysis to a sophisticated readership. It's a nice place to work. Cons It's a wonky financial news service that won't be a good fit for journalists looking to write long features. M&A is the name of the game here. Advice to Management Pay employees better.", "rating": 5, "pros": "Smart, dedicated staff that is focused on breaking news and providing proprietary market information and analysis to a sophisticated readership. It's a nice place to work.", "cons": "It's a wonky financial news service that won't be a good fit for journalists looking to write long features. M&A is the name of the game here.", "advice": "Pay employees better."}, {"title": "Account Executive", "text": "Pros Great culture, opportunity for advancement, energetic environment, mentoring, conveniently located right off the 1/2/3 line Cons lower pay compared to rest of the industry. Most of the major players already have the product so you have to rely on renewals for large portion of your book of business. Advice to Management Don't let BC Partners ruin the great environment and culture you built over the years. Growth is important, as is product innovation, but don't let the pressure of their targets transfer down to the teams.", "rating": 5, "pros": "Great culture, opportunity for advancement, energetic environment, mentoring, conveniently located right off the 1/2/3 line", "cons": "lower pay compared to rest of the industry. Most of the major players already have the product so you have to rely on renewals for large portion of your book of business.", "advice": "Don't let BC Partners ruin the great environment and culture you built over the years. Growth is important, as is product innovation, but don't let the pressure of their targets transfer down to the teams."}, {"title": "Mergermarket overall review", "text": "Pros Mergermarket was a great place to work. Very close-knit and was able to actually meet and speak with upper-level management. Young, fun, supportive employees/team members. Nice office and roof terrace in the building. Cons Needs a little bit more improvement on organization and decision-making from upper-level staff. Really don't have much complaints about this company. Advice to Management Keep interacting with your staff and fostering a very collaborative, close-knit environment. As said, not much I disliked about Mergermarket. Excited to see how they expand/improve in coming years.", "rating": 5, "pros": "Mergermarket was a great place to work. Very close-knit and was able to actually meet and speak with upper-level management. Young, fun, supportive employees/team members. Nice office and roof terrace in the building.", "cons": "Needs a little bit more improvement on organization and decision-making from upper-level staff. Really don't have much complaints about this company.", "advice": "Keep interacting with your staff and fostering a very collaborative, close-knit environment. As said, not much I disliked about Mergermarket. Excited to see how they expand/improve in coming years."}, {"title": "Liked the company environment", "text": "Pros Pretty laid back. Editors were very supportive. Nice to have 20 days off per year. Cons More opportunities to move up. Advice to Management If you want to keep talent you need to create career opportunities.", "rating": 5, "pros": "Pretty laid back. Editors were very supportive. Nice to have 20 days off per year.", "cons": "More opportunities to move up.", "advice": "If you want to keep talent you need to create career opportunities."}, {"title": "Good experience", "text": "Pros Worked under a few motivated and helpful editors. Cons Very strict about story count. Advice to Management Focus more on quality over quantity.", "rating": 5, "pros": "Worked under a few motivated and helpful editors.", "cons": "Very strict about story count.", "advice": "Focus more on quality over quantity."}, {"title": "Editorial Intern", "text": "Pros Positive office atmosphere. Plenty of opportunity to meet and network with staff from sister publications. Good chance to learn the industry. Cons Goals and expectations were not always clear. There was a lack of clarity in the editorial structure. It was not always clear who to approach with questions. Side projects were presented on an ad hoc basis, and often pushed aside soon after. Advice to Management Provide clearer feedback on goals and importance of specific tasks. The level of freedom to explore the opportunities of the position was pleasant, but at times it was difficult to tell when progress was being made.", "rating": 3, "pros": "Positive office atmosphere. Plenty of opportunity to meet and network with staff from sister publications. Good chance to learn the industry.", "cons": "Goals and expectations were not always clear. There was a lack of clarity in the editorial structure. It was not always clear who to approach with questions. Side projects were presented on an ad hoc basis, and often pushed aside soon after.", "advice": "Provide clearer feedback on goals and importance of specific tasks. The level of freedom to explore the opportunities of the position was pleasant, but at times it was difficult to tell when progress was being made."}, {"title": "Awful place to work", "text": "Pros The bathrooms always had toilet paper. Cons Working at Mergermarket drove me out of journalism. The management uses abuse and scare tactics to keep their employees in line. They also have no idea about what is currently going on in the world of finance. Their story ideas are dumb and their requests of journalists are even dumber. Advice to Management Learn how to be a manager.", "rating": 1, "pros": "The bathrooms always had toilet paper.", "cons": "Working at Mergermarket drove me out of journalism. The management uses abuse and scare tactics to keep their employees in line. They also have no idea about what is currently going on in the world of finance. Their story ideas are dumb and their requests of journalists are even dumber.", "advice": "Learn how to be a manager."}, {"title": "It's a job", "text": "Pros They give you 20 vacation days. If you want to be a journalist maybe this is a good company to start in. If you want to do anything else it won't be. Cons it is a very boring place to work if you don't wish you were working in finance and are not a journalist. The CRMs all seem to have a blast too but for them the job seems more like extended college.", "rating": 3, "pros": "They give you 20 vacation days. If you want to be a journalist maybe this is a good company to start in. If you want to do anything else it won't be.", "cons": "it is a very boring place to work if you don't wish you were working in finance and are not a journalist. The CRMs all seem to have a blast too but for them the job seems more like extended college.", "advice": null}, {"title": "Great place to start your career", "text": "Pros Great products with loyal customer base. Office environment is young with a great work life balance. Great place to start your career. Cons Salaries are on the low end of the scale. Not much upward mobility or career path. Opportunities are limited which leads talented employees to leave. Advice to Management Talented employees need opportunities to progress. With additional competition in the market there are more opportunities than ever for folks to move on..", "rating": 5, "pros": "Great products with loyal customer base. Office environment is young with a great work life balance. Great place to start your career.", "cons": "Salaries are on the low end of the scale. Not much upward mobility or career path. Opportunities are limited which leads talented employees to leave.", "advice": "Talented employees need opportunities to progress. With additional competition in the market there are more opportunities than ever for folks to move on.."}, {"title": "Research Analyst", "text": "Pros The Research Analyst position at Mergermarket is a great place to start a career. It provides great exposure to a wide variety of financial topics and it has a great culture with good work/life balance. The office is also very nice, spacious and enjoyable to work in. Cons Mergermarket is not the place for a long-term career, and the pay is well below industry average. However, Mergermarket does own several products, providing numerous career opportunities, although all pay relatively low.", "rating": 3, "pros": "The Research Analyst position at Mergermarket is a great place to start a career. It provides great exposure to a wide variety of financial topics and it has a great culture with good work/life balance. The office is also very nice, spacious and enjoyable to work in.", "cons": "Mergermarket is not the place for a long-term career, and the pay is well below industry average. However, Mergermarket does own several products, providing numerous career opportunities, although all pay relatively low.", "advice": null}, {"title": "reporter", "text": "Pros 20 days vacation, great benefits Cons Throughout my time at Mergermarket I wondered what on Earth senior management's job was. All these people seemed to do was travel around the world for no apparent reason. When they were actually in the office (rarely), all they did was give irrelevant and/or conflicting orders just to look busy. They also seemed to love coming up with new products out of the blue without hiring additional personnel, which means all that extra work got dumped on the reporters. BC Partners, the private equity owner, could save so much money if it simply realized this! They could reinvest this money into paying decent salaries to the reporters who are the ones carrying the company forward. Advice to Management Hire more reporters, especially if you want to expand your product portfolio. Downsize the number of \"global\" editors instead of allowing them to live the jet-set life. You could also downsize the number of so-called \"senior editors,\" most of which are just lounging around the office doing absolutely no productive work.", "rating": 3, "pros": "20 days vacation, great benefits", "cons": "Throughout my time at Mergermarket I wondered what on Earth senior management's job was. All these people seemed to do was travel around the world for no apparent reason. When they were actually in the office (rarely), all they did was give irrelevant and/or conflicting orders just to look busy. They also seemed to love coming up with new products out of the blue without hiring additional personnel, which means all that extra work got dumped on the reporters. BC Partners, the private equity owner, could save so much money if it simply realized this! They could reinvest this money into paying decent salaries to the reporters who are the ones carrying the company forward.", "advice": "Hire more reporters, especially if you want to expand your product portfolio. Downsize the number of \"global\" editors instead of allowing them to live the jet-set life. You could also downsize the number of so-called \"senior editors,\" most of which are just lounging around the office doing absolutely no productive work."}, {"title": "Great Company to Start a Career", "text": "Pros Good work experience in dealing with C-Level executives and learning about financial markets Cons Processes lack flexibility or much ambition Advice to Management incentivize your team memebrs good behavior", "rating": 5, "pros": "Good work experience in dealing with C-Level executives and learning about financial markets", "cons": "Processes lack flexibility or much ambition", "advice": "incentivize your team memebrs good behavior"}, {"title": "General", "text": "Pros The company offers flexible working environment; generous holidays, pretty good with visa and greencard sponsorship. Most people who work there are friendly and pleasant to hang out with. Cons The company provides very limited trainings and lack of career progression. The pay is very average. The company has very incapable middle managers who become managers not because they are good but because they are with the company long enough.", "rating": 3, "pros": "The company offers flexible working environment; generous holidays, pretty good with visa and greencard sponsorship. Most people who work there are friendly and pleasant to hang out with.", "cons": "The company provides very limited trainings and lack of career progression. The pay is very average. The company has very incapable middle managers who become managers not because they are good but because they are with the company long enough.", "advice": null}, {"title": "Startup myth has persisted", "text": "Pros This is a company that has traded for a long time on its startup origins, cultivating the myth that it is a relaxed, non-hierarchical, people-friendly place to work with impeccable journalism ethics, etc. If you can look beyond that myth, you simply find a midsize corporation looking to get larger, with typical priorities: first shareholders, then customers, then employees. It provides enough benefits and flexibility to get away with paying below market salaries, and tries to generally obey HR law and produce accurate content. There are lots of good eggs, and a few bad ones, but the pros and cons come down to the same element. It is a corporate place, and the good (corporate health benefits) comes with the bad (top-down policies, sexism, etc). Cons That said, there are a lot of things that this company probably does worse than others. Salaries are moderately to severely below market and raises are practically nonexistent, even for promotions (0%-1.5% annual raises, up to 4%-5% if you're lucky for a big promotion). Health benefits are pretty good but employee contributions to monthly premiums and deductibles are on the high side. Flexibility depends entirely on the manager and there are many that allow it, and some that don't. Training for new people is inadequate and those who don't catch on are often not helped - sometimes they are and this also depends on whether their manager notices and/or has time to do training. There isn't much room for advancement for most employees, and I have heard it is even worse for women. The atmosphere seems pretty neutral but if you take a closer look, the work environment does seem to favor white males. Advice to Management I believe management is aware of most of what is written in this review and others. If they choose to take action, they will, but so far they have not.", "rating": 3, "pros": "This is a company that has traded for a long time on its startup origins, cultivating the myth that it is a relaxed, non-hierarchical, people-friendly place to work with impeccable journalism ethics, etc. If you can look beyond that myth, you simply find a midsize corporation looking to get larger, with typical priorities: first shareholders, then customers, then employees. It provides enough benefits and flexibility to get away with paying below market salaries, and tries to generally obey HR law and produce accurate content. There are lots of good eggs, and a few bad ones, but the pros and cons come down to the same element. It is a corporate place, and the good (corporate health benefits) comes with the bad (top-down policies, sexism, etc).", "cons": "That said, there are a lot of things that this company probably does worse than others. Salaries are moderately to severely below market and raises are practically nonexistent, even for promotions (0%-1.5% annual raises, up to 4%-5% if you're lucky for a big promotion). Health benefits are pretty good but employee contributions to monthly premiums and deductibles are on the high side. Flexibility depends entirely on the manager and there are many that allow it, and some that don't. Training for new people is inadequate and those who don't catch on are often not helped - sometimes they are and this also depends on whether their manager notices and/or has time to do training. There isn't much room for advancement for most employees, and I have heard it is even worse for women. The atmosphere seems pretty neutral but if you take a closer look, the work environment does seem to favor white males.", "advice": "I believe management is aware of most of what is written in this review and others. If they choose to take action, they will, but so far they have not."}, {"title": "This firm does not reward smart people who work hard and produce quality content", "text": "Pros Despite the firm's issues, it does have a handful of very smart employees who are fun to be around. Unfortunately, there isn't much to say beyond that. Cons Since being sold to private equity, the culture changed drastically. The focus of the content went from quality to quantity. If you want to be challenged intellectually and to work on interesting things, this is not the place to go. Pay is pretty weak and bonuses may as well be non-existent. Pay bumps are either 0% or 2% annually. So, you're essentially taking a pay cut to work there year-after-year when you factor in the rising cost of living. If I could give zero stars under \"Compensation & Benefits,\" I absolutely would. There is little-to-no upward mobility at all and the variety of work is extremely limited and became less and less interesting and stimulating in my time with the company. There is virtually no reward for doing challenging and thought provoking work - you will not be paid better than your peers who do next to nothing to get by. Unless you enjoy writing the exact same type of story, day-in and day-out, I'd stay far away from this place. Last, but not least, being behind a pay wall makes it challenging to exit to another publication. If for no other reason than no one can ever actually see your stories. Advice to Management Unless your goal is to run the about.com of M&A news, you'll have to better reward the intelligent people that do good work. Otherwise, you're going to be left with robots who couldn't build sources if their lives depended on it.", "rating": 1, "pros": "Despite the firm's issues, it does have a handful of very smart employees who are fun to be around. Unfortunately, there isn't much to say beyond that.", "cons": "Since being sold to private equity, the culture changed drastically. The focus of the content went from quality to quantity. If you want to be challenged intellectually and to work on interesting things, this is not the place to go.", "advice": "Unless your goal is to run the about.com of M&A news, you'll have to better reward the intelligent people that do good work. Otherwise, you're going to be left with robots who couldn't build sources if their lives depended on it."}, {"title": "A Sinking Ship, Get Off It While You Still Can", "text": "Pros 20 vacation days off, mostly. Oh, and when you leave work, you weren't really expected to answer e-mails. They used to have good people and good middle management. Used to. Cons The reason they *used* to have good people and good middle management is because they forced them out in a bizarre power struggle originating at the top after the private equity firm bought the company. Now instead of a poorly-paying article mill (virtually every story is just plugging in quotes or facts into a standard format, obtained by cold calling companies) with good people you can hang out with on the day-to-day, it's a poorly-paying article mill filled with gossip, paranoia, suspicion, and condescension. In my last year of working there, we had a company-wide meeting to discuss the acquisition by the private equity firm. Initially there was hope that the PE firm would help the employees out, so a brave colleague of mine asked if there would be a market check for employee salaries. The CEO replied that there had been a market check already, at which everyone literally burst out laughing. That's right – it's the kind of company that likes to urinate on your head and tell you it's raining. The company has had immense turnover in the past year and a half (approaching 40%), which I suppose is good for the junior people as the only way promotions were (rarely) handed out was because the person above you quit or died. No merit rewards here, kids. The only senior people left are desperately looking for a way out, while the junior people are asking the senior people why no one told them it would be that bad. Which is sad, because it used to be a great place to get a serious start in financial journalism. Sure, the pay was crap, but no one else was willing to take a chance on you. Little did you know, upon starting out, that the pay was crap and would remain crap. Until the day I quit, at which point they jumped to offer me a raise, despite me begging for one repeatedly and consistently being turned down while I was there. But by then, of course, it was way too little, way too late. Oh, and the website looks like it's from 1997. They've been \"planning to upgrade it\" every year, but they're still convinced \"everyone reads the site on their Blackberries.\" As if you still know anyone who has a Blackberry. Advice to Management Quit. For the good of the company, quit. That way the people underneath you can be promoted, and they'll probably have a better shot at running things, too.", "rating": 1, "pros": "20 vacation days off, mostly. Oh, and when you leave work, you weren't really expected to answer e-mails. They used to have good people and good middle management. Used to.", "cons": "The reason they *used* to have good people and good middle management is because they forced them out in a bizarre power struggle originating at the top after the private equity firm bought the company. Now instead of a poorly-paying article mill (virtually every story is just plugging in quotes or facts into a standard format, obtained by cold calling companies) with good people you can hang out with on the day-to-day, it's a poorly-paying article mill filled with gossip, paranoia, suspicion, and condescension.", "advice": "Quit. For the good of the company, quit. That way the people underneath you can be promoted, and they'll probably have a better shot at running things, too."}, {"title": "Sophisticated news service", "text": "Pros Learn and write about startups and Fortune 500 enterprises Investigative journalism techniques often employed Nice work-life balance Interesting and worldly colleagues Opportunities to travel and work internationally Cons Salaries are lower than those of competitors Bonuses are modest The Financial Times Group sold Mergermarket in early 2014 so lost a great owner and news partner New owner is a private equity firm and it is unclear when or to whom Mergermarket will be sold again. Advice to Management Mergermarket puts out a great product thanks to the hard work of a lot of smart, dedicated people. Top-to-bottom, the company has many stellar workers. I enjoy working here.", "rating": 5, "pros": "Learn and write about startups and Fortune 500 enterprises", "cons": "Salaries are lower than those of competitors", "advice": "Mergermarket puts out a great product thanks to the hard work of a lot of smart, dedicated people. Top-to-bottom, the company has many stellar workers. I enjoy working here."}, {"title": "A total mess-avoid", "text": "Pros 20 days off a year Cons Management is almost comically incompetent and runs the company like a high school clique. All of senior management are lifers with little to no experience outside the company. The whole place is disorganized, policies change arbitrarily from month to month, there is no vision. Promotions are based only on being friends with management. Because of that, the whole structure is very top heavy, with many superfluous editorial positions. Many of the editors have no clue what they are doing. At the same time there is no growth opportunity for new hires. Turn over is very high and watching every talented reporter that joins become disillusioned and leave within a year or so is demoralizing. Pay is lower than at other publications and raises are tiny, below cost of living increases. Technology is out of date even though it is an online only company. They have not invested in the website or done any updates in years because management will do anything to cut costs and corners. Emphasis is on quantity and not quality, it is a content farm more than anything.", "rating": 1, "pros": "20 days off a year", "cons": "Management is almost comically incompetent and runs the company like a high school clique. All of senior management are lifers with little to no experience outside the company. The whole place is disorganized, policies change arbitrarily from month to month, there is no vision.", "advice": null}, {"title": "Please don't make the same mistake I made by working here", "text": "Pros 20 days off per year, Cons The company has no boundaries, which is trickling down from the very top. Basically, everyone knows each other's business and gossip runs rampant. There are also very strange people who work here, which make it an impossible situation, especially since it is pretty much everyone. The ones who are not like that just get super depressed and become a shell of their former selves, which is what happened to me. I could barely make it a day without having some type of a breakdown. Very dysfunctional corporate culture that has bullying and is like a lunatic asylum. They have a lot of lawsuits and issues with all types of harassment. It is a bullying culture with very unhealthy, unhappy people who are guaranteed to make your life hell. The company has a no-training policy, even with people who have no experience doing what they are doing. By week 2, you are told that you should know everything. Journalists are graded on every move they make and it's like high school but much, much worse. Some of the people in management have severe problems with mental health and are still in charge of a lot of people, and HR is extremely biased and unhelpful. They always take the side of the higher-up. You will be abused, and you will regret taking the job. I can promise you that. Advice to Management I honestly think it's hopeless at this point. The company would need a complete and total overhaul of management.", "rating": 1, "pros": "20 days off per year,", "cons": "The company has no boundaries, which is trickling down from the very top. Basically, everyone knows each other's business and gossip runs rampant. There are also very strange people who work here, which make it an impossible situation, especially since it is pretty much everyone. The ones who are not like that just get super depressed and become a shell of their former selves, which is what happened to me. I could barely make it a day without having some type of a breakdown. Very dysfunctional corporate culture that has bullying and is like a lunatic asylum. They have a lot of lawsuits and issues with all types of harassment. It is a bullying culture with very unhealthy, unhappy people who are guaranteed to make your life hell. The company has a no-training policy, even with people who have no experience doing what they are doing. By week 2, you are told that you should know everything.", "advice": "I honestly think it's hopeless at this point. The company would need a complete and total overhaul of management."}, {"title": "Totally random and unfair promotions, bad management who are highly overpaid", "text": "Pros Nice people work there, intelligent and young spirited so quite a social place Cons The management are all people who worked their way up with no formal Management training and no clue how to handle their employees. There is no decent or real training in place and no fair system of credit or recognising talent rather than just exploiting it Advice to Management Get some proper training in place, start seeing and rewarding the real People doing the work and not just lining your own pockets", "rating": 3, "pros": "Nice people work there, intelligent and young spirited so quite a social place", "cons": "The management are all people who worked their way up with no formal", "advice": "Get some proper training in place, start seeing and rewarding the real"}, {"title": "Lots of learning, fast-paced environment, lack of growth opportunities", "text": "Pros Team members are great. Worked with intelligent, driven people who were inspirational. Improved skills, got a lot of contacts. Excellent place to learn financial healthcare environment. Cons Work/life balance very poor. Regularly worked 10+ hour days and the weekends. Not a chance to go mingle at conferences, make connections, work on different things. Felt like a an article mill. Low morale. Advice to Management Raise pay for all reporters. Make a clear path for career advancement. Act like you at least care about all products.", "rating": 3, "pros": "Team members are great. Worked with intelligent, driven people who were inspirational. Improved skills, got a lot of contacts. Excellent place to learn financial healthcare environment.", "cons": "Work/life balance very poor. Regularly worked 10+ hour days and the weekends. Not a chance to go mingle at conferences, make connections, work on different things. Felt like a an article mill. Low morale.", "advice": "Raise pay for all reporters. Make a clear path for career advancement. Act like you at least care about all products."}, {"title": "Great place to start", "text": "Pros Culture is young, laid-back, and cool. Cons Long hours, high turnover rate, and not as well perceived as some competitors.", "rating": 5, "pros": "Culture is young, laid-back, and cool.", "cons": "Long hours, high turnover rate, and not as well perceived as some competitors.", "advice": null}, {"title": "Do more with less mentality", "text": "Pros Nice office in west Soho Cons pay here is lower than the norm; too many cliques; half the people here tend to be cold and don't seem to have basic manners; no upward mobility; lack of empathy from supervisors Advice to Management Do a better job of addressing work-life issues = we're an internet-based company...allow people more flexibility to work from home. Dump the fish and foosball tables...that's just bending to the whim of a handful of people; place better people in management positions", "rating": 3, "pros": "Nice office in west Soho", "cons": "pay here is lower than the norm; too many cliques; half the people here tend to be cold and don't seem to have basic manners; no upward mobility; lack of empathy from supervisors", "advice": "Do a better job of addressing work-life issues = we're an internet-based company...allow people more flexibility to work from home. Dump the fish and foosball tables...that's just bending to the whim of a handful of people; place better people in management positions"}, {"title": "Great Experience", "text": "Pros - Laid-back but professional at the same time - Fun coworkers - Strong support from fellow coworkers - Intellectually stimulating - Interesting niche company with great potential Cons - Strong division among the different product groups Advice to Management - Build more legitimacy in the financial services sector - Seek collaborations with industry leading firms - Hire more experienced/older individuals (currently very young employees with high turnover rate) - Company needs to learn to bring together the different products to provide a valuable service instead of having everything separated", "rating": 5, "pros": "- Laid-back but professional at the same time", "cons": "- Strong division among the different product groups", "advice": "- Build more legitimacy in the financial services sector"}, {"title": "Senior Client Relationship Manager", "text": "Pros - great culture work/life balance - smart nice people - Nice senior management Cons - technology is lacking - continued training is non-existent -salaries below market Advice to Management more training to develop additional skills", "rating": 5, "pros": "- great culture work/life balance", "cons": "- technology is lacking", "advice": "more training to develop additional skills"}, {"title": "Friendly coworkers", "text": "Pros Friendly work environment, new office, great work-life balance Cons not enough professional development, does not pay industry compensation, Advice to Management pay people more to reduce turnover and offer more career advance", "rating": 3, "pros": "Friendly work environment, new office, great work-life balance", "cons": "not enough professional development, does not pay industry compensation,", "advice": "pay people more to reduce turnover and offer more career advance"}, {"title": "Good experience", "text": "Pros A good business very loyal to its employees and customers. Still has a start up feel. Cons Not very analytical - staff often get promoted on likability vs talent. Has not adjusted to its size by implementing strong management functions. Advice to Management More systems in place to ensure quality checks.", "rating": 5, "pros": "A good business very loyal to its employees and customers. Still has a start up feel.", "cons": "Not very analytical - staff often get promoted on likability vs talent. Has not adjusted to its size by implementing strong management functions.", "advice": "More systems in place to ensure quality checks."}, {"title": "Good start for financial news reporting career", "text": "Pros Very flexible work-life bonus more than average newsrooms, travel to conferences almost as much as you like, casual office environment, vibrant staff, great bonuses and benefits including 20 prorated vacation days, only work Monday-Friday, can move up quickly if you work hard and make yourself standout with great ideas as management often changes in 2 years (few people are lifers) Cons Lack of reporters with senior experience, too many entry-level reporters, very gossipy, raises are abysmal, often will promote with no extra pay at the time of promotion, like to get more work out of you for less pay, promotes based on likability and not experience,", "rating": 5, "pros": "Very flexible work-life bonus more than average newsrooms, travel to conferences almost as much as you like, casual office environment, vibrant staff, great bonuses and benefits including 20 prorated vacation days, only work Monday-Friday, can move up quickly if you work hard and make yourself standout with great ideas as management often changes in 2 years (few people are lifers)", "cons": "Lack of reporters with senior experience, too many entry-level reporters, very gossipy, raises are abysmal, often will promote with no extra pay at the time of promotion, like to get more work out of you for less pay, promotes based on likability and not experience,", "advice": null}, {"title": "Client Relations Manager", "text": "Pros The team is very young, mostly fresh grads from college. Great opportunity to interact with senior management of major advisory firms. They also have headquarters and offices around the globe, and they encourage teams across continents to visit each other and share knowledge. Opportunities to grown internally as reporter/sales. Monthly travel to different territories to visit clients are necessary but manageable. Cons I worked at a small office, so only got to see the rest of my team only 2 or 3 times a year for a short week each time. Not much of opportunity to get promoted if you are not willing to relocate. Advice to Management Too many weekly meetings, quite repetitive.", "rating": 3, "pros": "The team is very young, mostly fresh grads from college. Great opportunity to interact with senior management of major advisory firms. They also have headquarters and offices around the globe, and they encourage teams across continents to visit each other and share knowledge. Opportunities to grown internally as reporter/sales. Monthly travel to different territories to visit clients are necessary but manageable.", "cons": "I worked at a small office, so only got to see the rest of my team only 2 or 3 times a year for a short week each time. Not much of opportunity to get promoted if you are not willing to relocate.", "advice": "Too many weekly meetings, quite repetitive."}, {"title": "It's a vibrant and entrepreneurial company that empowers employees", "text": "Pros The working environment and management is encouraging and spirited to encourage employees to strive for high standard works and results. Cons The organization structure is a bit flat and does not have much of a defined hierachy to ensure a clear career path and development for employees.", "rating": 3, "pros": "The working environment and management is encouraging and spirited to encourage employees to strive for high standard works and results.", "cons": "The organization structure is a bit flat and does not have much of a defined hierachy to ensure a clear career path and development for employees.", "advice": null}, {"title": "Senior Sales", "text": "Pros Great place to work at. Cons Being on the west coast we only have a small office. Advice to Management Work hard and make sales.", "rating": 5, "pros": "Great place to work at.", "cons": "Being on the west coast we only have a small office.", "advice": "Work hard and make sales."}, {"title": "Great corporate culture", "text": "Pros friendly and helpful work environment with growth opportunities Cons base salary is not that impressive and compensation incentive is decent. Advice to Management should focus more on employees' work performance rather than sociability and personality", "rating": 3, "pros": "friendly and helpful work environment with growth opportunities", "cons": "base salary is not that impressive and compensation incentive is decent.", "advice": "should focus more on employees' work performance rather than sociability and personality"}, {"title": "Great Place To Work", "text": "Pros fun, great startup vibe, energetic and committed employees. great christmas parties and a fun place to do work. provides good exposure to larger parent company. Cons not top of the technology game but working on it, internal politics but not more or less than anywhere else. Advice to Management build technology into a core competency beyond simply serving the content delivery. continue to hire great people at whatever cost. protect your culture.", "rating": 5, "pros": "fun, great startup vibe, energetic and committed employees. great christmas parties and a fun place to do work. provides good exposure to larger parent company.", "cons": "not top of the technology game but working on it, internal politics but not more or less than anywhere else.", "advice": "build technology into a core competency beyond simply serving the content delivery. continue to hire great people at whatever cost. protect your culture."}, {"title": "Excellent place to start out in professional media/finance; little room to advance in any real way.", "text": "Pros Lots of fun young people from all over the world. Great incubator for journalistic talent Challenging work assignments Cons Little opportunity to advance in an extremely flat organizational structure Office is a bit run down Work can be very high pressure in a deadline-oriented work environment Advice to Management Enable greater for collaboration between business units to create more unity within the company. Bump salaries a bit to discourage high turnover of entry-level journos.", "rating": 5, "pros": "Lots of fun young people from all over the world.", "cons": "Little opportunity to advance in an extremely flat organizational structure", "advice": "Enable greater for collaboration between business units to create more unity within the company."}, {"title": "Good people, but limited opportunities", "text": "Pros People are great to work with and most of them are very good at their job. The firm fosters an enterprenuerial spirit if you think you can add some value. Management is solid, nothing spectacular, but the keep the ship running. Cons Growth is very limited as is pay. Some decision making is questionable by management. Good stepping stone to other opportunities, otherwise it'll be the same job for a very long time. Advice to Management Really assess who you want leading and make employees all feel on the same footing. Remember to keep the culture positive.", "rating": 5, "pros": "People are great to work with and most of them are very good at their job. The firm fosters an enterprenuerial spirit if you think you can add some value. Management is solid, nothing spectacular, but the keep the ship running.", "cons": "Growth is very limited as is pay. Some decision making is questionable by management. Good stepping stone to other opportunities, otherwise it'll be the same job for a very long time.", "advice": "Really assess who you want leading and make employees all feel on the same footing. Remember to keep the culture positive."}, {"title": "Mergermarket is one finance information company that will weather the current economic storm.", "text": "Pros Mergermarket provides opportunities to peek into the machinations of the finance markets in a way few other companies can afford. Its products are aimed at helping professionals working at M&A banks, private equity funds, hedge funds, corporates and law firms to see proprietary intelligence about their respective markets. Working for Mergermarket exposes an individual to a wide range of interrelated functions and allows a person to cooperate with a variety of job roles. Senior editors regularly appear as talking heads on major news networks and those same people are a phone call away whenever a question or issue comes up. Cons As with any information company selling to the finance world, the market for Mergermarket's products is currently soft. Many of Mergermarket's clients and prospects have been seriously affected by the current market environment. Advice to Management Senior management needs to ensure that products are delivered in a way that maximize value for clients. They also need to make sure that CRM software is efficient (currently it's a disaster).", "rating": 3, "pros": "Mergermarket provides opportunities to peek into the machinations of the finance markets in a way few other companies can afford. Its products are aimed at helping professionals working at M&A banks, private equity funds, hedge funds, corporates and law firms to see proprietary intelligence about their respective markets.", "cons": "As with any information company selling to the finance world, the market for Mergermarket's products is currently soft. Many of Mergermarket's clients and prospects have been seriously affected by the current market environment.", "advice": "Senior management needs to ensure that products are delivered in a way that maximize value for clients. They also need to make sure that CRM software is efficient (currently it's a disaster)."}, {"title": "Easy-going and friendly", "text": "Pros - People from all over the world makes for interesting workplace - Good humour throughout the office - Quick progression - Flexible working style Cons - Sometimes not challenging enough - Long hours generally and even longer at the end of each financial quarter", "rating": 5, "pros": "- People from all over the world makes for interesting workplace", "cons": "- Sometimes not challenging enough", "advice": null}, {"title": "Not recommended", "text": "Pros Good salary Office is in a good location Cons People aren't friendly Management aren't very visible", "rating": 3, "pros": "Good salary", "cons": "People aren't friendly", "advice": null}, {"title": "reporter", "text": "Pros laid back atmosphere, not a bad salary considering you're in a struggling industry, Cons Lack of brand recognition, limited readership, lack of vision in senior leadership and being owned by PE is not great, although it could be a lot worse Advice to Management Please integrate the company across the products", "rating": 3, "pros": "laid back atmosphere, not a bad salary considering you're in a struggling industry,", "cons": "Lack of brand recognition, limited readership, lack of vision in senior leadership and being owned by PE is not great, although it could be a lot worse", "advice": "Please integrate the company across the products"}, {"title": "Chaotic and mismanged, but good opportunities for the best", "text": "Pros For journalism, the pay, conditions and security are great. It's typical to start on £30k to £35k in London, and depending on your product you will likely get an added annual bonus of a few grand. The company has a very nice London headquarters next to the Thames with an amazing roof terrace, and some very inspiring editors in a select few of their products. It has offices around the world, and opportunities to travel, or for an international secondment, are great. Cons Management in many cases is utterly chaotic and internal communication poor. You end up feeling like the company has no strategy. It felt like many in senior management were pretty clueless about what the products they managed actually did. The company relies heavily on the fact that it faces minimal competition in most of its highly niche business news markets, which is a situation that allows it to be half-assed and still prosper. Once it a few strong rivals start challenging it in its core product markets, it'll have to get serious.", "rating": 3, "pros": "For journalism, the pay, conditions and security are great. It's typical to start on £30k to £35k in London, and depending on your product you will likely get an added annual bonus of a few grand.", "cons": "Management in many cases is utterly chaotic and internal communication poor. You end up feeling like the company has no strategy. It felt like many in senior management were pretty clueless about what the products they managed actually did.", "advice": null}, {"title": "Great career prospects, excellent working environment", "text": "Pros The MM Group is a great company to work for. There are great career prospects, possibility of flexible working hours and generally a friendly working environment. I have seen this company growing throughout the years and my career has grown with it. Impressively, the HR team has grown and become more professional, providing more supports to employees. Cons People should stop gossiping so much and focus on what they can actually achieve. Advice to Management More investments might be needed to retain talents, especially in the editorial team. Technology should be added quicker to old websites to avoid loosing revenues. New acquired companies should be integrated better/quicker to align to the MM culture..", "rating": 5, "pros": "The MM Group is a great company to work for. There are great career prospects, possibility of flexible working hours and generally a friendly working environment. I have seen this company growing throughout the years and my career has grown with it. Impressively, the HR team has grown and become more professional, providing more supports to employees.", "cons": "People should stop gossiping so much and focus on what they can actually achieve.", "advice": "More investments might be needed to retain talents, especially in the editorial team. Technology should be added quicker to old websites to avoid loosing revenues."}, {"title": "Good as first job", "text": "Pros Great company to start career Cons Low salary and repetitive work", "rating": 3, "pros": "Great company to start career", "cons": "Low salary and repetitive work", "advice": null}, {"title": "Below average", "text": "Pros + relaxed style + city location + 9-6 just few people are staying longer That's it not too many positive aspect of working at Mergermarket Cons - basic salaries across all teams and products is a joke when comparing with costs of living in London. The only people who are earning good money are sales manager who are treasured by management. Amount of money that is spent on sales team entertainment, bonuses, lunches etc is outrageous. No one from the top management is taking into consideration that product is created by editorial, research, product dev and clients are maintained by CRMs. Rewards only goes to sales. - Poor management and career progression it has to go hand in hand. Senior managers are in the company for many years and for many of them MM was first company which results in limited professional capabilities of them and aversion to change and ambitious people. I've seen so many good people leaving because of the indimidation they experienced from senior managers and lack of progression, developments and frustration. There is absolutely no willingness to keep good people because aboard, as it would be related with increased costs on salaries. - It is financial information provider employeeing more than 1000 people globally but it has not any corporate structure, organisation or drive for professionalism. - Equality employer when it comes to hiring gay people but lacks on treating people from different teams with equal consideration. Constant gossip and suspicious relationships between female and male senior employees. - Please also have in mind that reviews related with Product development team should be treated separately. PD department has very little in common with rest of the company. - After probation period, no trainings to develop knowledge or skills. - Low bonuses and all other extra benefits require employee financial participation. - As company is owned by a private equity now, there had been a lot of squeezing on salary increase and bonuses. There was also strategy to improve company image outside, therefore be careful about over enthusiastic reviews here. Advice to Management - Advice was given by hundreds of employees who circulated through the company over the last years, never ever considered or drew conclusion.", "rating": 1, "pros": "+ relaxed style", "cons": "- basic salaries across all teams and products is a joke when comparing with costs of living in London. The only people who are earning good money are sales manager who are treasured by management. Amount of money that is spent on sales team entertainment, bonuses, lunches etc is outrageous. No one from the top management is taking into consideration that product is created by editorial, research, product dev and clients are maintained by CRMs. Rewards only goes to sales.", "advice": "- Advice was given by hundreds of employees who circulated through the company over the last years, never ever considered or drew conclusion."}, {"title": "Good workplace with great challenges in product development", "text": "Pros Casual yet professional. Current technology - Go, NodeJS, MongoDB, Elasticsearch, RabbitMQ, micro-services architecture, continuous delivery. Friendly atmosphere. Strong focus on culture. Open technically for innovation. Proper hack-days (10% time). Good equipment, tools and software provided. Cons At times there is too much going on - too many competing demands. Developers have to support their services in production which can be challenging to manage against other new products being developed. Advice to Management Keep up recruiting the best talent. Continue providing this positive and friendly atmosphere. Review expectations on how much work can be done in parallel.", "rating": 5, "pros": "Casual yet professional.", "cons": "At times there is too much going on - too many competing demands.", "advice": "Keep up recruiting the best talent. Continue providing this positive and friendly atmosphere."}, {"title": "good culture", "text": "Pros Amazing people, flexible working environment Cons Tight travel budgets, limited internal training", "rating": 5, "pros": "Amazing people, flexible working environment", "cons": "Tight travel budgets, limited internal training", "advice": null}, {"title": "No long-term career opportunity", "text": "Pros - Nice office with modern technology, helpful and quick IT department - Lots of young and nice, international people in the office - Private insurance - Relaxed work environment, barely any deadlines etc - International offices Cons - Extreme favoritism: different rules apply to different people depending on how much the manager likes them. You will find that some individuals work harder than others but there is no correlation to the promotions. If your managers like you, you can have a good time at MM and get promoted quickly. How to make the managers like you: Go out and drink with them every week, If you are a female, read up on the mergermarket lawsuits to find out what some other females do to get ahead but I guarantee you won’t like it. - Spying : Most managers have their spies who will act like they are your friends but will report everything you do back to the managers. - Backstabbing: Another way to get promoted. For some reason people make a good impression on managers by backstabbing colleagues and spreading lies about them. The managers won’t bother fact checking to see if rumors are true. - Long hours: Working hours are 9 am or 8.30 am to 6pm. Every single day. No chance to leave at 5 even if there is absolutely nothing left to do for the day. After 4pm you will see a lot of people shopping online cause they are done with their work but are not allowed to leave. - No career development: Unless you work as a journalist or developer there are almost no new skills you will develop. If at all you become worse than before because some of the work is so monotonous that you might turn into a vegetable and make you unmotivated. Also no educational opportunities, no interesting workshops or courses etc . There are also barely any opportunities for promotion internally. - Unprofessional: The company is generally pretty unprofessional and do things as they go along. - Office Politics: Lots of gossiping, drama, affairs, backstabbing but also laughter. Can be entertaining actually, especially since the work is so monotonous. Advice to Management Stop promoting people based on how much you like them, this is not high-school", "rating": 3, "pros": "- Nice office with modern technology, helpful and quick IT department", "cons": "- Extreme favoritism: different rules apply to different people depending on how much the manager likes them. You will find that some individuals work harder than others but there is no correlation to the promotions. If your managers like you, you can have a good time at MM and get promoted quickly. How to make the managers like you: Go out and drink with them every week, If you are a female, read up on the mergermarket lawsuits to find out what some other females do to get ahead but I guarantee you won’t like it.", "advice": "Stop promoting people based on how much you like them, this is not high-school"}, {"title": "Great people undermined by bad management.", "text": "Pros Good group of developers and analysts Social culture Hack days, 10% time Beer Fridays Cons Unnecessary management layers such as \"delivery managers\" Team leads spend all their time in meetings Developers forced to be on-call, compensation for out-of-hours work is a joke Node.js is terrible for long-term development projects \"Agile\" with a big A Work not very challenging Pay raises are infrequent and sometimes insulting Unclear path for career growth Advice to Management Stop hiring delivery managers and ask yourself how you can empower team leads. You have great people and you should be doing everything you can to retain them, so start checking in more with your developers. Do a better job of managing the business's expectations of PD, not forwarding all the pressure straight to the development teams. Managing downward only suggests you don't know what you're doing.", "rating": 3, "pros": "Good group of developers and analysts", "cons": "Unnecessary management layers such as \"delivery managers\"", "advice": "Stop hiring delivery managers and ask yourself how you can empower team leads. You have great people and you should be doing everything you can to retain them, so start checking in more with your developers. Do a better job of managing the business's expectations of PD, not forwarding all the pressure straight to the development teams. Managing downward only suggests you don't know what you're doing."}, {"title": "Meh", "text": "Pros Good mix of people in the company Free beer Good manager in my section. Cons Very little training when starting Not much career progression There is one company in the group that has been seeing a lot of problems over the past 1 1/2 years because of bad manager who is disruptive to his own team and to the wider newsroom. If people haven't left, then he's tossed them out for not being one of \"his people.\" People who've staid are either trying to get out or have left without other jobs to go to. It's really caused a talent drain there and affected overall morale on the company. Too bad, because it was earlier a very good publication. Advice to Management Treat staff better and address the problems that are looking at you in the face.", "rating": 3, "pros": "Good mix of people in the company", "cons": "Very little training when starting", "advice": "Treat staff better and address the problems that are looking at you in the face."}, {"title": "MergerMarket Group", "text": "Pros A fairly good work environment, good benefits, review process etc. Mediocre star rating is based hampered by specific company in group. Cons relatively low wages. Acquired companies keep management in place and are separate, so each company has a different management style. Advice to Management more emphasis on integration", "rating": 3, "pros": "A fairly good work environment, good benefits, review process etc. Mediocre star rating is based hampered by specific company in group.", "cons": "relatively low wages. Acquired companies keep management in place and are separate, so each company has a different management style.", "advice": "more emphasis on integration"}, {"title": "Great place to work, especially in the Tech dept", "text": "Pros I work in the Product Development team, which has had a huge transformation in the last two years. Developers now have a lot of (but not complete) autonomy in choosing how they work. Tech stack is primarily Node.js (JavaScript), which can be both frustrating and fun, depending on whom you talk to. Office atmosphere is fun - pool table, beers, 10% time to work on whatever you want. Great bunch of people in all disciplines - clearly the company's biggest asset. Cons Communication from higher up is usually too little, too late. Even though the technology in the Product Development dept is top-notch, developers overall often do not have sight of the bigger goals they're working towards. For such a progressive company, working from home is not encouraged. Teams are too contractor/consultant heavy. Advice to Management Make the development teams work closer to business or end users. Be more transparent and timely in communication. Reward talent and commitment. Be more flexible about work-from-home arrangements.", "rating": 5, "pros": "I work in the Product Development team, which has had a huge transformation in the last two years.", "cons": "Communication from higher up is usually too little, too late.", "advice": "Make the development teams work closer to business or end users."}, {"title": "Fun and forward-thinking Product Development team", "text": "Pros Very willing to put time, money and effort into trying new things and following best practices. Hugely supportive of all staff members, both permanent and contract. Work is fun, and doesn't get in the way of home life Cons Not a very exciting domain. Different parts of the company feel very separate from one another, despite efforts to combat this. Advice to Management Look for more ways to bring the whole company/companies together (on a personnel level)", "rating": 5, "pros": "Very willing to put time, money and effort into trying new things and following best practices.", "cons": "Not a very exciting domain.", "advice": "Look for more ways to bring the whole company/companies together (on a personnel level)"}, {"title": "Great culture, good prospects", "text": "Pros Young, energetic workplace and good long term prospects as the company is growing Cons Only for the self motivated Advice to Management faster decisions and strike balance between loyalty and meritocracy", "rating": 5, "pros": "Young, energetic workplace and good long term prospects as the company is growing", "cons": "Only for the self motivated", "advice": "faster decisions and strike balance between loyalty and meritocracy"}, {"title": "Great group to work for", "text": "Pros Team ethics, benefits, prospects, wages Cons Tends to be over reliant on contractors", "rating": 5, "pros": "Team ethics, benefits, prospects, wages", "cons": "Tends to be over reliant on contractors", "advice": null}, {"title": "Solid Product Development team, striving to improve", "text": "Pros I can only really speak as a software developer within the Product Development team. - Great developers, with great attitudes, who mostly want to improve everything they do. All happy to help and work with you on problems large or small. The people are the biggest benefit at Mergermarket PD. - Exciting platform to develop on: Docker microservices in Amazons ECS - Forward thinking; willingness to experiment with new techniques (i.e. continuous delivery) and use them between teams. - 10% time for innovation and professional development. - An appreciative and engaged business who love what we're doing. Cons - Don't like NodeJS? Not much else going on in PD (but set to change) - And, that said, JS isn't the most fun language to use. - Can be slightly regressive in managing projects - every team 'must' have a QA, a BA etc. - Still feels a bit 'choppy' with respect to settling down on a model of how to produce software.", "rating": 5, "pros": "I can only really speak as a software developer within the Product Development team.", "cons": "- Don't like NodeJS? Not much else going on in PD (but set to change)", "advice": null}, {"title": "A real transformation!", "text": "Pros Software Development team has gone through significant transformation over the last few years, and as a result is like working for a new company. A fresh look at the tech stack, architecture and process. Currently working on green-field projects and rebuilding core-products which provides exposure to new tech and building services from the ground up with micro-services. Strong emphasis on quality and automation of both test and build pipeline. A friendly atmosphere where collaboration within and outside of your team is encouraged. A relaxed working environment with a ‘start-up feel’ (e.g. Friday beers/pool table/bean bags) with the benefit of working for a well established successful organisation. Cons Nothing major worth mentioning here Advice to Management Maintain commitment to 10% time allowing the team innovate beyond what they do in their day jobs.", "rating": 5, "pros": "Software Development team has gone through significant transformation over the last few years, and as a result is like working for a new company. A fresh look at the tech stack, architecture and process.", "cons": "Nothing major worth mentioning here", "advice": "Maintain commitment to 10% time allowing the team innovate beyond what they do in their day jobs."}, {"title": "Mergermarket", "text": "Pros An energetic, entrepreneurial culture Growth focused strategy Great products Good team rapport Nice office environment flat management structure quick decision making openness to ideas Cons long working hours and presentee-ism somewhat old-school management techiques not enough toilets lack of progression with senior positions held long term reluctance to adopt technology.", "rating": 5, "pros": "An energetic, entrepreneurial culture", "cons": "long working hours and presentee-ism", "advice": null}, {"title": "Mixed Reaction", "text": "Pros Good work culture overall with friendly people Latest technologies are in use Good rapport and helping nature among the team members Cons Long working hours Higher management partial towards their favourite employees No flexibility to work from home but allowed if he/she is favourite for the higher management Appraisal and Bonus are mysteries", "rating": 3, "pros": "Good work culture overall with friendly people", "cons": "Long working hours", "advice": null}, {"title": "So much change for the better over the last few years..", "text": "Pros Over the last few years we, as a software development team, have transformed as a department. We used to have four week release cycles, now we deploy code to production 10s of times a day! Innovation is encouraged, and we enjoy 10% time to learn new things. Our recruitment process has been refined over the last few years, and we have a team full of talent. The office environment is relaxed and fun. The people are great and the pool table and two beer fridges are significant factors too! Cons The domain isn't always the most exciting, and we're in a different office to the rest of the business, which can leave us sometimes feeling a little disconnected.", "rating": 5, "pros": "Over the last few years we, as a software development team, have transformed as a department. We used to have four week release cycles, now we deploy code to production 10s of times a day! Innovation is encouraged, and we enjoy 10% time to learn new things.", "cons": "The domain isn't always the most exciting, and we're in a different office to the rest of the business, which can leave us sometimes feeling a little disconnected.", "advice": null}, {"title": "Good company", "text": "Pros Friendly staff and conditions, good working environment, pleasant office and encouragement from all corners. top management very staff friendly and approachable Cons Some training of staff unprofessional. At times there were items published that would have been actionable. This was not a regualr occurance, however but some extra training should be introduced. Advice to Management Better training needed tocompliment what is a VERY GOOD PRODUCT THAT SEEMS TO BE CREATING A NICHE FOR ITSELF INT HE MARKET.", "rating": 5, "pros": "Friendly staff and conditions, good working environment, pleasant office and encouragement from all corners. top management very staff friendly and approachable", "cons": "Some training of staff unprofessional. At times there were items published that would have been actionable. This was not a regualr occurance, however but some extra training should be introduced.", "advice": "Better training needed tocompliment what is a VERY GOOD PRODUCT THAT SEEMS TO BE CREATING A NICHE FOR ITSELF INT HE MARKET."}, {"title": "Boys club is still as a management after all of these scandals???", "text": "Pros Good looking girls and low-esteem boys club. Sounds familiar? Cons Bought new companies by the owner, private equity, to make the asset fatter to sell this off. However, the brand has been damaged by so many scandals. What do you expect if you found their track record of professionalism(?) on so many rough nights???? Advice to Management Talk to head hunters. You will find it would be harder as you get senior role at this firm. The reputation is gone. Just google it.", "rating": 1, "pros": "Good looking girls and low-esteem boys club. Sounds familiar?", "cons": "Bought new companies by the owner, private equity, to make the asset fatter to sell this off. However, the brand has been damaged by so many scandals. What do you expect if you found their track record of professionalism(?) on so many rough nights????", "advice": "Talk to head hunters. You will find it would be harder as you get senior role at this firm. The reputation is gone. Just google it."}, {"title": "research team", "text": "Pros work-life balance. The teammates are very friendly. Cons Lack the training system. The career path is not clear and narrow.", "rating": 3, "pros": "work-life balance. The teammates are very friendly.", "cons": "Lack the training system. The career path is not clear and narrow.", "advice": null}, {"title": "Brilliant!", "text": "Pros The staff are great and the workplace is awesome! What we work on is very interesting and enjoyable. Highly recommend anyone to work here. Cons Haven't experienced anything negative as of yet.", "rating": 5, "pros": "The staff are great and the workplace is awesome! What we work on is very interesting and enjoyable. Highly recommend anyone to work here.", "cons": "Haven't experienced anything negative as of yet.", "advice": null}, {"title": "Very talented IT team to learn from, and a great environment!", "text": "Pros Great bunch of people to work with from a range of backgrounds, good opportunity to learn in a relaxed environment, focus on quality is very high with automation of everything a key principle working in a largely greenfield microservice environment. Also working towards Continuous Deployment. Great office location, with a pool table and team drinks every friday Cons The domain of the products is very dry, and the rationale for what we're working on is not always clear. Advice to Management Give the team more time to experiment and innovate! Lack of ownership in the service layer needs to be sorted.", "rating": 5, "pros": "Great bunch of people to work with from a range of backgrounds, good opportunity to learn in a relaxed environment, focus on quality is very high with automation of everything a key principle working in a largely greenfield microservice environment. Also working towards Continuous Deployment. Great office location, with a pool table and team drinks every friday", "cons": "The domain of the products is very dry, and the rationale for what we're working on is not always clear.", "advice": "Give the team more time to experiment and innovate! Lack of ownership in the service layer needs to be sorted."}, {"title": "Enjoying My Role", "text": "Pros Within MMG’s Product Development team – there is a dynamic, start-up-like environment, with an informal, frank and open culture. I like the flexibility and autonomy in my role. Great work-life balance, flexibility, Nice city office, with a young team of Techies. Decent benefit package. Bonus for exceptional employees can compensate average salaries Cons There will be cons in any workplace. My experience here has been positive so far…", "rating": 5, "pros": "Within MMG’s Product Development team – there is a dynamic, start-up-like environment, with an informal, frank and open culture. I like the flexibility and autonomy in my role. Great work-life balance, flexibility, Nice city office, with a young team of Techies. Decent benefit package. Bonus for exceptional employees can compensate average salaries", "cons": "There will be cons in any workplace. My experience here has been positive so far…", "advice": null}, {"title": "average", "text": "Pros flexible hours; generally good colleagues Cons poor management; lack of job security", "rating": 3, "pros": "flexible hours; generally good colleagues", "cons": "poor management; lack of job security", "advice": null}, {"title": "DO NOT WORK HERE", "text": "Pros Owned by respected news outlet (Mergermarket) Pays well Modern central London office Dedicated, skilled colleagues Opportunities to move from InfraNews - if you survive survive bullying/don't threaten management Cons Bullying. Discriminatory, hostile environment. Zero innovation. Management takes credit for your work. Micro managing, harassment, abuse. Advice to Management Quit.", "rating": 1, "pros": "Owned by respected news outlet (Mergermarket)", "cons": "Bullying.", "advice": "Quit."}, {"title": "Analyst", "text": "Pros Good knowledge of the M&A activity around the world and the role will give you the possibility to enhance your reporting skills Cons There are few chances to pursue a remunerative career within the company and additionally the corporate strategy is not really clear Advice to Management More internal projects that could led to innovate the offer", "rating": 5, "pros": "Good knowledge of the M&A activity around the world and the role will give you the possibility to enhance your reporting skills", "cons": "There are few chances to pursue a remunerative career within the company and additionally the corporate strategy is not really clear", "advice": "More internal projects that could led to innovate the offer"}, {"title": "Suited for beginners", "text": "Pros Exposure to global workforce, learning in M&A, self-starting approach Cons Manager-driven process, hierarchical, poor HR policy implementation, bad pay masters, covert racism", "rating": 3, "pros": "Exposure to global workforce, learning in M&A, self-starting approach", "cons": "Manager-driven process, hierarchical, poor HR policy implementation, bad pay masters, covert racism", "advice": null}, {"title": "Fun and nimble, but", "text": "Pros Fun, young culture. Opportunities to travel and to take on a lot of responsibility if you are a solid performer. Yearly bonus if your product is selling. Fewer layers of management than most news organisations. Growing company with solid business model Cons Strong sales culture that has zero interest in audience engagement or quality journalism, obsession with 'new business' breeds short-term thinking, not enough investment in platforms, a little around the margins but no hint of real innovation. Tight on resourcing in editorial teams, this is now much more noticeable now that the company is being dressed up for sale, most likely to another private equity firm. Advice to Management Be awesome if you took some decisions to improve the platforms, even if it meant you didn't walk away with such a big payout when the company is sold. You could pay your junior journalists a little more - it wouldn't kill the bottom line.", "rating": 3, "pros": "Fun, young culture. Opportunities to travel and to take on a lot of responsibility if you are a solid performer. Yearly bonus if your product is selling. Fewer layers of management than most news organisations. Growing company with solid business model", "cons": "Strong sales culture that has zero interest in audience engagement or quality journalism, obsession with 'new business' breeds short-term thinking, not enough investment in platforms, a little around the margins but no hint of real innovation. Tight on resourcing in editorial teams, this is now much more noticeable now that the company is being dressed up for sale, most likely to another private equity firm.", "advice": "Be awesome if you took some decisions to improve the platforms, even if it meant you didn't walk away with such a big payout when the company is sold. You could pay your junior journalists a little more - it wouldn't kill the bottom line."}, {"title": "good company", "text": "Pros flexible, people are nice, but it depends on regional office, overall not bad, good environment - Cons turnover rate is a bit high,", "rating": 3, "pros": "flexible, people are nice, but it depends on regional office, overall not bad, good environment -", "cons": "turnover rate is a bit high,", "advice": null}, {"title": "Analyst", "text": "Pros Friendly office, good social scene, accommodating company for allowing employees to keep their current job and move abroad, work-life balance is good. Cons No real job progression, doesn't pay as much as the competitor companies, the job isn't always the most intellectually stimulating.", "rating": 3, "pros": "Friendly office, good social scene, accommodating company for allowing employees to keep their current job and move abroad, work-life balance is good.", "cons": "No real job progression, doesn't pay as much as the competitor companies, the job isn't always the most intellectually stimulating.", "advice": null}, {"title": "Mergermarket", "text": "Pros Mergermarket is a huge company which specialises in financial information. It is comparable with Thomson Reuters (who I have also worked for), although it is better organised. As with any large company, there are opportunities to progress if you wish. The company pension is good as Mergermarket doubles whatever contribution the employee makes. Working in a large open-plan office does offer the opportunity of engaging with other members of staff. As you would expect, the company is fairly diverse and international. Cons The downside of working in such an environment is the frequent noise and distraction caused by co-workers. The lack of variety in the nature of our work can occasionally become monotonous. Employees are expected to work from 09.00 to 18.00, which can be a long day when add on the commuting time. Advice to Management I would advise the management to ask employees to consider their co-workers more. Frequently there are loud conversations which can be a real distraction when you are trying to concentrate.", "rating": 3, "pros": "Mergermarket is a huge company which specialises in financial information. It is comparable with Thomson Reuters (who I have also worked for), although it is better organised. As with any large company, there are opportunities to progress if you wish. The company pension is good as Mergermarket doubles whatever contribution the employee makes. Working in a large open-plan office does offer the opportunity of engaging with other members of staff. As you would expect, the company is fairly diverse and international.", "cons": "The downside of working in such an environment is the frequent noise and distraction caused by co-workers. The lack of variety in the nature of our work can occasionally become monotonous. Employees are expected to work from 09.00 to 18.00, which can be a long day when add on the commuting time.", "advice": "I would advise the management to ask employees to consider their co-workers more. Frequently there are loud conversations which can be a real distraction when you are trying to concentrate."}, {"title": "Good company", "text": "Pros Good company to work for, quite flexible in terms of working hours Cons not much opportunity for career progression", "rating": 3, "pros": "Good company to work for, quite flexible in terms of working hours", "cons": "not much opportunity for career progression", "advice": null}, {"title": "Sweatshop", "text": "Pros Can't think of any Pros Cons Very high turnover. Very sweatshop-like feel in the London offices. It is not a results-driven environment and management only care about how much time you do at your desk. There is absolutely no incentive to go beyond your role and no prospects of career progression. Upper management is very bloaky and many of the men at C-level go through life like they're casting for an episode of Mad Men. Advice to Management Set defined career tracks and incentivise employees.", "rating": 1, "pros": "Can't think of any Pros", "cons": "Very high turnover. Very sweatshop-like feel in the London offices. It is not a results-driven environment and management only care about how much time you do at your desk. There is absolutely no incentive to go beyond your role and no prospects of career progression. Upper management is very bloaky and many of the men at C-level go through life like they're casting for an episode of Mad Men.", "advice": "Set defined career tracks and incentivise employees."}, {"title": "Great place for talent to grow", "text": "Pros I would recommend this company to anyone with ambition and talent. Although it has now reached a fair size, it has maintained a start up 'feel' in a lot of ways, including the speed you can progress if you are really driven. For those who want to strike a good work/life balance, some roles can be quite flexible. The atmosphere is friendly, senior management very approachable and workplace politics limited. Cons There will be cons in any workplace. My experience here has been positive. Advice to Management Senior management have always listened to new ideas. This must continue even as the company grows. At the same time, Mergermarket must also make sure new joiners really understand the company's ethos. If they are not properly inducted the workforce starts to feel polarised as some feel part of the company's roots and others don't. Keep an eye on the male/female balance in very senior roles. This has always been a good workplace for women to get ahead and it's important that doesn't change.", "rating": 5, "pros": "I would recommend this company to anyone with ambition and talent. Although it has now reached a fair size, it has maintained a start up 'feel' in a lot of ways, including the speed you can progress if you are really driven. For those who want to strike a good work/life balance, some roles can be quite flexible. The atmosphere is friendly, senior management very approachable and workplace politics limited.", "cons": "There will be cons in any workplace. My experience here has been positive.", "advice": "Senior management have always listened to new ideas. This must continue even as the company grows. At the same time, Mergermarket must also make sure new joiners really understand the company's ethos. If they are not properly inducted the workforce starts to feel polarised as some feel part of the company's roots and others don't."}, {"title": "New Joiner", "text": "Pros Pantry and facilities in Hong Kong office is excellent. It is really a good place for the staff to rest a bit during lunch or break time. Cons Washroom for ladies is not enough Advice to Management N/A", "rating": 5, "pros": "Pantry and facilities in Hong Kong office is excellent. It is really a good place for the staff to rest a bit during lunch or break time.", "cons": "Washroom for ladies is not enough", "advice": "N/A"}, {"title": "Energetic and flexible environment", "text": "Pros An open and energetic culture. People are direct and generally friendly. Company is flexible to accommodate my needs. Cons A growing company so work is quite demanding yet challenging", "rating": 5, "pros": "An open and energetic culture. People are direct and generally friendly. Company is flexible to accommodate my needs.", "cons": "A growing company so work is quite demanding yet challenging", "advice": null}, {"title": "Awesome office and culture; this place is what you make of it", "text": "Pros First of all, the London office is amazing. It's very media and has half an acre of roof terrace overlooking the Thames. In the summer the staff do more than just eat their lunch out there, you'll often see them holding meetings in the sun too. But this place is not just about the office, the culture of the business continues to evolve. Management are still situated (literally) in the heart of the open plan offices around the world. There are no separate offices here, and they meet, lunch & drink with staff as often as they can. Many a junior has fast-tracked to mid- or senior management over the years, and those who show the initiative are recognised and rewarded. Cons The fridges get emptied every Friday afternoon, which means you need to remember to grab that bacon you bought for your Saturday morning sarnie. Oh, and there is no express lift to the 4th floor so you occasionally have to share the lift with the lawyers on the floors below. Advice to Management Remain on the lookout for fresh talent.", "rating": 5, "pros": "First of all, the London office is amazing. It's very media and has half an acre of roof terrace overlooking the Thames. In the summer the staff do more than just eat their lunch out there, you'll often see them holding meetings in the sun too.", "cons": "The fridges get emptied every Friday afternoon, which means you need to remember to grab that bacon you bought for your Saturday morning sarnie. Oh, and there is no express lift to the 4th floor so you occasionally have to share the lift with the lawyers on the floors below.", "advice": "Remain on the lookout for fresh talent."}, {"title": "Great work environment that suits self-starters", "text": "Pros Great work-life balance, flexibility and autonomy to shape your role if you take ownership of and grow within the company. Nice city office, with a multicultural and young team. Good benefits package. Bonus for exceptional employees can compensate average salaries Cons some roles might mean employees feel stuck in their career progression, but there is room to transfer to other regions and/or products within the group, sales oriented view often means lack of long-term thinking. Some managers lack communication skills although this has been addressed recently Advice to Management Listen to all business areas equally - IT, sales, editorial, etc - to make sure everyone feels respected and heard. Invest in IT Infrastructure and training", "rating": 5, "pros": "Great work-life balance, flexibility and autonomy to shape your role if you take ownership of and grow within the company. Nice city office, with a multicultural and young team. Good benefits package. Bonus for exceptional employees can compensate average salaries", "cons": "some roles might mean employees feel stuck in their career progression, but there is room to transfer to other regions and/or products within the group, sales oriented view often means lack of long-term thinking. Some managers lack communication skills although this has been addressed recently", "advice": "Listen to all business areas equally - IT, sales, editorial, etc - to make sure everyone feels respected and heard. Invest in IT Infrastructure and training"}, {"title": "Fast paced world of M&A", "text": "Pros MM has a positive, energetic vibe that drive people to succeed. Top down management style with flat management structure allows for easy communication between all levels of management. Global/regional roles that promote business development and easy to navigate internal processes Unlike large corporates and due to the flat management structure, new ideas, products and concepts are acted upon quickly with a open door policy at all levels - mainly driven from the CE, GenCom and senior management. Cons Due to flat management structure promotions within team are minimal but due to acquisition of organisations, roles are fast appearing to move laterally and up with speed. Advice to Management Continue to buy bolt on acquisitions to maximise value of a very strong and senior client base across multiple industries", "rating": 5, "pros": "MM has a positive, energetic vibe that drive people to succeed.", "cons": "Due to flat management structure promotions within team are minimal but due to acquisition of organisations, roles are fast appearing to move laterally and up with speed.", "advice": "Continue to buy bolt on acquisitions to maximise value of a very strong and senior client base across multiple industries"}, {"title": "Good place to stay.", "text": "Pros - Good work/life balance. - Energetic people - More career opportunities, especially for the graduates - Aggressive management, many ideas Cons - Keep acquisitions, a lot of uncertainties - Benefit can be better Advice to Management Treasure employees, invest more in long term", "rating": 3, "pros": "- Good work/life balance.", "cons": "- Keep acquisitions, a lot of uncertainties", "advice": "Treasure employees, invest more in long term"}, {"title": "Great Atmosphere", "text": "Pros Corporate company but with a start-up feel. Great like minded people and very little office politics. Cons Need more integrations between the teams Advice to Management Keep doing what you're doing", "rating": 5, "pros": "Corporate company but with a start-up feel. Great like minded people and very little office politics.", "cons": "Need more integrations between the teams", "advice": "Keep doing what you're doing"}, {"title": "Decent working environment, expanding rapidly", "text": "Pros - Company keep expanding in recent years, great potential to proceed career. - Company culture encourage employee to work independently, can manage your workload and time in your own style. - Good Work Life Balance Cons - Salary level is not bad, but not good enough to retain smart employees - Lots of uncertainty on the rapid expansion, might need to adopt structural changes in the future. Advice to Management Would be great if management can create a well organised career path advancement system in the company.", "rating": 3, "pros": "- Company keep expanding in recent years, great potential to proceed career.", "cons": "- Salary level is not bad, but not good enough to retain smart employees", "advice": "Would be great if management can create a well organised career path advancement system in the company."}, {"title": "Good opportunities, nice place to work", "text": "Pros There is a strong focus on quality content due to the digital subscription model rather than the usual advertising/editorial conflicts in traditional media organisations. There are worldwide offices. I benefitted from secondment opportunities. There are also lots of opportunities for journalists and editors to travel to conferences. The group has a track record of developing people and promoting from within the group. I started as a reporter and developed skills to work towards becoming an editor. The people are nice and you're trusted to get on with your job. Flexible working is possible. The London office has a nice roof terrace. Cons The current admin site is in need of an upgrade. This can be frustrating for reporters and editors. Advice to Management Put some resources towards upgrading the admin site for reporters and editors to upload articles. It would save money and editorial frustration!", "rating": 5, "pros": "There is a strong focus on quality content due to the digital subscription model rather than the usual advertising/editorial conflicts in traditional media organisations.", "cons": "The current admin site is in need of an upgrade. This can be frustrating for reporters and editors.", "advice": "Put some resources towards upgrading the admin site for reporters and editors to upload articles. It would save money and editorial frustration!"}, {"title": "Review", "text": "Pros Very flexible company and great environment. Cons Poor salary and progression is based on how popular you are. Advice to Management Management and employees have no relationship at all.", "rating": 3, "pros": "Very flexible company and great environment.", "cons": "Poor salary and progression is based on how popular you are.", "advice": "Management and employees have no relationship at all."}, {"title": "Acceptable", "text": "Pros No pressure, decent environment all around, I liked my colleagues, straight forward tasks Cons it was a new intern position so there wasn't much structure or interesting tasks. It wasn't delivering coffees, but I wasn't learning new skill-sets either.", "rating": 5, "pros": "No pressure, decent environment all around, I liked my colleagues, straight forward tasks", "cons": "it was a new intern position so there wasn't much structure or interesting tasks. It wasn't delivering coffees, but I wasn't learning new skill-sets either.", "advice": null}, {"title": "Great business, a few things to work on though", "text": "Pros The company have been through very rapid growth, from nothing to 1000+ employees in 15 years. They offer a stimulating and entrepreneurial environment to work in. Tend to promote from bottom up, offering great opportunities to grow from within the business, take on new responsibilities and move to new products or relocate to different offices. The product had been market leading for some time and is relatively easy to sell. The best thing about the business though is working with good people and the work hard / play hard culture Cons Lack of investment in infrastructure (particularly on the IT side - this has left all of the group products vulnerable to competition and has raised questions from loyal subscribers). In general there is a short-termist outlook and revenue today is always prioritised over spending on long-term projects. Related to that, sales is prioritised above all else, leading to the content producing (research & editorial) functions feeling undervalued and unloved. Undoubtedly and perhaps inevitably, the culture has become diluted with growth - there is no longer the 'all in it together' mentality. Some nepotism still exists, particularly around promotions. Poor top-down communication which I believe they are trying to address but has always been poor in the organistation. Advice to Management Need to look beyond the next sale / capital event, and instead do what is right for the long-term health of the business. More diversity in senior management required.", "rating": 5, "pros": "The company have been through very rapid growth, from nothing to 1000+ employees in 15 years. They offer a stimulating and entrepreneurial environment to work in. Tend to promote from bottom up, offering great opportunities to grow from within the business, take on new responsibilities and move to new products or relocate to different offices. The product had been market leading for some time and is relatively easy to sell. The best thing about the business though is working with good people and the work hard / play hard culture", "cons": "Lack of investment in infrastructure (particularly on the IT side - this has left all of the group products vulnerable to competition and has raised questions from loyal subscribers). In general there is a short-termist outlook and revenue today is always prioritised over spending on long-term projects. Related to that, sales is prioritised above all else, leading to the content producing (research & editorial) functions feeling undervalued and unloved. Undoubtedly and perhaps inevitably, the culture has become diluted with growth - there is no longer the 'all in it together' mentality. Some nepotism still exists, particularly around promotions. Poor top-down communication which I believe they are trying to address but has always been poor in the organistation.", "advice": "Need to look beyond the next sale / capital event, and instead do what is right for the long-term health of the business. More diversity in senior management required."}, {"title": "Sinking Ship, with no future", "text": "Pros Work life balance, but this will become obsolete because of your working environment. Cons I will try and go through all departments and give you an insight regarding the working environment, type of work, Salary (true value) and management. Wealthmonitor “wm”. Your yearly starting salary at wm will be 19K, there is no negotiations (Although I must say they might have increased in to 20K starting, not sure, but thought it…). They haven’t changed this starting salary since the company was founded, so you can imagine the kind of attitude this company has regarding salary. Your salary will then increase to 20K once you pass your probation, always expect a 500-1000 pound yearly increase otherwise you will become very disappointed. However, if you work very hardf putting in more hours and actually add real value, then and only then could you expect 1000-1500 pound increase. Yearly bonus could be 1K-2K. The actual work you do is basic research and basic data entry, without any exaggeration you will become a vegetable if you do this job for to long. They basically want you to go through open sources and find a specific persons telephone number, address, interests and family members. You then also calculate how much the person will get if they sell of their stake in the company. It’s a very unscientific calculation based on the companies revenue, this is not analysis you will take the companies revenue and then based on a industry multiple calculate the value, A*B. This is basically the kind of job that you will start hating after 3-6 months, there is literally no career progression within the team, no ad hoc work that you can do on the side, and no training. The work I described is what you will be doing, everyday…. “IMPORTANT”, this department within mergermarket is most likely going to be outsourced very soon, they have stopped hiring when people leave and only hire for languages that the outsourcing company can’t deal with. Mergermarket (mergermarket product), has two positions which they hire for, the Research Analysts but then also the Deal Researcher, I will try and go over each subject for both. Analyst: Your yearly starting salary will be 21K and then increase to 22K when you pass your probation. Or you will just start on 22K, it all depends on the day and the mood of the manager, there is no real policy just as long as its not above 22K. There is no negotiations here you accept or decline its that simple. You can expect a 1K yearly increase as standard, could be less. In this department, if you work your long hours and and actually add value you expect a 2K increase. It is very rarely that you will get a increase over 2k, more or less never happens. Yearly bonus could be 2K-4K. Managers has made policy of lying to their employees regarding salary to try and keep individuals motivated, promising higher increases next year but always fail to deliver. Deal Researcher: Your starting salary will be 20K (they might have increased it to 21K). Same here no negotiations. Yearly increase will be £500 pounds to 1K. If you work very hard and actually add value, well then its still the same amount. Yearly bonus could be 500 punds-1K. For the Research Analyst position, your role will involve going through M&A transactions and copy paste relevant information from press releases. If there is a deal value you will add it if not, there will be no analysis to try and evaluate the company. In terms of financials you will look at the companies annual report and copy paste their revenue, EBIT, EBITDA and profit. And then for companies that provide a deal value calculate their net debt. Very simple work. On a quarterly basis you will also work on mergermarkets press releases, you will not write anything just add numbers from the database into templates. Again here this is not analysis, you will only look at trends and calculate simple percentage increases or decreases or market share. For the Deal Researcher, your job will ONLY involve findings names for the M&A transactions advisor's. And if you want to write the comments to the quarterly reports. Debtwire, Your starting salary will be 28K if you gain a permanent role, could be higher, there has been cases of a starting salary up to 32K depending on experience. Here it all depends on how desperate they think you are. Salary increases depends a lot on the managers mood, generally 2-4K, but mostly 2K per year. Yearly bonus could be 3K-5K. You could probably negotiate a bit, but don’t try to hard, this is a company where they generally only look at salary so if you are asking for to much then they will take someone who has less experience and asking for a lower salary. “Important”, this is a department in Mergermarket Group, that recently had 6 employees leave all at the same time because they were so unhappy with their working environment. So you can imagine how bad it really is. The manager mistreated and bullied everyone in the team so they resigned and some even left without having another job. They generally take a lot of employees on a contract to keep salaries low, avoid providing benefits and to fire them without legal consequences. If you do a good job they will probably try and keep you on a contract as long as they can to keep costs down. CRM, Starting salary is 25K, same here no negotiation you accept or decline. Yearly increase is normally 500 pounds, with yearly bonus of 3K-8K. The actual work is simple client relations manager. You will give the users training on how to use the database and that’s basically it. This is not sales. You will work close with the sales department and will have to do more or less what they tell you to do. The positive with this is that you are generally allowed to work without interference from managers and other colleagues. However, the job becomes very boring after a while, only individuals that are very demotivated would survive in this job. Normally people leave after 1 year. In general all positions in mergermarket is a maximum 1 year job, and the company knows this so they would rather see you leave to hiring someone with a lower salary then keep talent in the company. That is why their turnover is extremely high, if you join you will find that there are leaving drinks every month for someone. People leave as soon as they have some experience on their CV that they can use to apply for other jobs. Editorial, starting salary is normally 24K for someone with low experience, and they will keep this against you to maybe even offer a lower salary. Increases could be 2-3K depending on performance with a yearly bonus of 2K-5K. This is a sweatshop and employees are treated like cattle in a sink or swim environment, without meaningful training or discipline where favouritism seems to be the fastest track to promotion. The Managers in Mergarmarket Group is a mix bunch, some actually have knowledge and will treat you with the respect you deserve. But the majority are just clueless individuals that have been in the company since they started their career and have no idea about anything else except what they have learned in mergermarket. So basically nothing…. There has been several cases of bullying because the manager doesn't like the person and also spying, to check when you leave on breaks and come back. The manager has also asked other colleagues to spy to get information about a employee. But don’t worry you wont get fired, but you will hate your working environment so much that you either resign out of frustration or become very depressed. HR is a joke they have no say in anything and only do what upper management tells them to do. Bullying and mistreating employees is extremely common, it’s a very sad and grey working environment to be in and if you join, start looking for a exit from day one. Be aware of this company, you will become very demotivated and at some point feel stuck and very depressed if you cant find something else. The company doesn't care about their employees its basically a sweat shop where you come in and do the job, (that a monkey could do) to then leave at 6pm sharp. Very important to understand is your experience will not be relevant for investment banking or credit analysis or any other “real” financial services job, and the M&A knowledge you gain is very basic and wont be relevant at any job. You will not gain any transferable skills, so you will have to exaggerate a lot on your CV to be able to get a better paying job. There will be no training involved at all except the things you will need to know to do your job. Advice to Management Be honest with new hires, there is no real future in this company.", "rating": 1, "pros": "Work life balance, but this will become obsolete because of your working environment.", "cons": "I will try and go through all departments and give you an insight regarding the working environment, type of work, Salary (true value) and management.", "advice": "Be honest with new hires, there is no real future in this company."}, {"title": "Analyst", "text": "Pros Work life balance. Good place to start. People are chilled and friendly. Cons Poor management and lack of foresight. Not much career prospect. Advice to Management Provide a better incentive scheme", "rating": 3, "pros": "Work life balance. Good place to start. People are chilled and friendly.", "cons": "Poor management and lack of foresight. Not much career prospect.", "advice": "Provide a better incentive scheme"}, {"title": "reporter", "text": "Pros Great work / life balance, 20 days of vacation days, potential overseas travel opportunities Cons It's more about the quantity of the article more than the quality. Not all, but some managers are just so incompetent making me question why the company is not letting the person go even when each and every reporter is leaving the regional bureau because of his or her tyrant behavior. I guess the company just thinks each reporter is disposable. Pay is also below industry average. Low pay bumps. Advice to Management Many leave feeling the lack of career progression. Please respect reporters.", "rating": 3, "pros": "Great work / life balance, 20 days of vacation days, potential overseas travel opportunities", "cons": "It's more about the quantity of the article more than the quality. Not all, but some managers are just so incompetent making me question why the company is not letting the person go even when each and every reporter is leaving the regional bureau because of his or her tyrant behavior. I guess the company just thinks each reporter is disposable. Pay is also below industry average. Low pay bumps.", "advice": "Many leave feeling the lack of career progression. Please respect reporters."}, {"title": "short sighted management, why BC partners still keeps them?", "text": "Pros After staying there for oner/two years you became very atractive for all major banks or media organisations. Huge rotation causes you end up having friends working for all the major financial servicess companies Cons Where do I start... -brown-nosing is required to survive and get promoted -clicks and frathernities -management represents very low moral values and is lazy, they are not a good raw model therefore they don't get respected and create fear relationship between them and employees -management has no leadership skills, no ideas how to motivate staff - lots of office romances - lots of promotions through bed - lack of structure, very chaotic - lots of drinking inside and outside of the office - crazy dangerous staff parties with animalistic games - I would do everything to prevent my woman from working at mergermarket, most of the man working ther are dirty, general attitude is to look at women like at meat - mini promotions are available to brown-nosers in fact there is no real career growth potencial - too intelligent people usually being treated with no respect by management - no permission to question anything at any time - slightly racist - preference for white public school boys who are tall, if you are one of those you will have an easy life there, also good looking girls who are not too ambitious will have an OK life as long as they agree to have affairs with the management -if you are not private school tall boy you will be paid 40% less -relativley long working hours -minimal wage increses for rebelious people who criticise the office culture or managerial decisions -sometimes stressful -lots of horrible totaltarian managers who get pleaure from destroying people. I don't understand why BC partners keeps them, it could be very dangerous for the company reputation and costly as there might be several court cases in the near future Advice to Management start your own sit-com showing your day to day life, what you do is so grotesque and corrupted that it could became the most popular tv show that could generate more profit than subscriptions", "rating": 1, "pros": "After staying there for oner/two years you became very atractive for all major banks or media organisations. Huge rotation causes you end up having friends working for all the major financial servicess companies", "cons": "Where do I start...", "advice": "start your own sit-com showing your day to day life, what you do is so grotesque and corrupted that it could became the most popular tv show that could generate more profit than subscriptions"}, {"title": "High turnover", "text": "Pros - young age group - seems like college all over again - lots of company sponsored drinks + parties (at least once a quarter!) Cons - not much career upside - people who get promoted are part of a 'frat\" club - even if you're underperforming, so long as you're part of the \"frat\" club, you can have a good pay Advice to Management New management team / less bias please", "rating": 3, "pros": "- young age group", "cons": "- not much career upside", "advice": "New management team / less bias please"}, {"title": "CRM", "text": "Pros - Flexible working environment & excellent work life balance - Decent package for the amount of work that is required (holidays, salary & bonuses, etc.), although other media companies definitely pays more - Nice & young colleagues across all offices - Good learning experience & exposure to a wide array of clients; not bad as a starting point of a career Cons - Very short learning curve; once you've been at the role for about a year or so you feel stagnant. One can almost cruise in auto-pilot and could do the job while asleep after a while. - Company lacks ambition and vision; management solely cares about booking in revenue & makes little to no effort in product development / diversifying product offers through innovative solutions. - Company's approach to client feedback is not resonating with the clients; it's more BS-ing your way out of problems rather than actual problem solving - An extremely \"crony\" culture: the closer you are with the management, the more luck you have in career advancement & promotions Advice to Management - Think of better ways to innovate & inspire colleagues across the firm - More clear pathway for career growth", "rating": 3, "pros": "- Flexible working environment & excellent work life balance", "cons": "- Very short learning curve; once you've been at the role for about a year or so you feel stagnant. One can almost cruise in auto-pilot and could do the job while asleep after a while.", "advice": "- Think of better ways to innovate & inspire colleagues across the firm"}, {"title": "Reporter", "text": "Pros Chilled and friendly , good company culture, nice office location in the city , lovely roof terrace Cons Poor management and lack of foresight sometimes; also been known for stinginess and prioritising sales part of the business over editorial.", "rating": 3, "pros": "Chilled and friendly , good company culture, nice office location in the city , lovely roof terrace", "cons": "Poor management and lack of foresight sometimes; also been known for stinginess and prioritising sales part of the business over editorial.", "advice": null}, {"title": "Account Executive", "text": "Pros Good work life style balance Cons Poor retention rate, too much turnover, poor internal project management", "rating": 3, "pros": "Good work life style balance", "cons": "Poor retention rate, too much turnover, poor internal project management", "advice": null}, {"title": "Gossip, paranoia, conniving tactics, managers sued for sex harassment", "text": "Pros Look at the headline and try to find some pro. Actually I can't find any. Cons First of all check in any search engine the following: mergermarket sex harassment and after mergermarket moody’s. You will have an idea about the management's ethics, professionalism and competence. Said that, let’s go through all the company’s departments and units. Wealthmonitor “wm”. The actual work you do is basic research and basic data entry, without any exaggeration you will become a vegetable if you do this job for to long. They basically want you to go through open sources and find a specific persons telephone number, address, interests and family members (Stocking people….). You then also calculate how much the person will get if they sell of their stake in the company. It’s a very unscientific calculation based on the companies revenue, this is not analysis you will take the companies revenue and then based on a industry multiple calculate the value, A*B. This is basically the kind of job that you will start hating after 3-6 months, there is literally no career progression within the team, no ad-hoc work that you can do on the side, and no training. The work I described is what you will be doing, everyday…. Mergermarket (mm) has two positions which they hire for, the Research Analysts but then also the Deal Researcher. For the Research Analyst position, your role will involve going though M&A transactions and copy paste relevant information from press releases. If there is a deal value you will add it if not, there will be no analysis to try and evaluate the company. In terms of financials you will look at the companies annual report and copy paste their revenue, EBIT, EBITDA and profit. And then for companies that provide a deal value calculate their net debt. Very simple work. On a quarterly basis you will also work on mergermarkets press releases, you will not write anything just add numbers from the database into templates. Again here this is not analysis, you will only look at trends and calculate simple percentage increases or decreases or market share. For the Deal Researcher, your job will ONLY involve findings names for the M&A transactions advisors. And if you want, write the comments to the quarterly reports. Debtwire: this is a department in Mergermarket Group, that recently had 6 employees leave all at the same time because they were so unhappy with their working environment. So you can imagine how bad it really is. The manager mistreated and bullied everyone in the team so they resigned and some even left without having another job. They generally take a lot of employees on a contract to keep salaries low, avoid providing benefits and to fire them without legal consequences. If you do a good job they will probably try and keep you on a contract as long as they can to keep costs down. CRM: the actual work is simple client relations manager. You will give the users training on how to use the database and that’s basically it. This is not sales. You will work close with the sales department and will have to do more or less what they tell you to do. The positive with this is that you are generally allowed to work without interference from managers and other colleagues. However, the job becomes very boring after a while. People leave as soon as they have some experience on their CV that they can use to apply for other jobs. Editorial: this is a sweatshop and employees are treated like cattle in a sink or svim enviroment, without meaningful training or discipline where favouritism seems to be the fastest track to promotion. The majority of managers in Mergarmarket are just clueless individuals that have been in the company since they started their career and have no idea about anything else except what they have learned in mergermarket. So basically nothing…. There has been several cases of bullying because the manager don't like the person and also spying, to check when you leave on breaks and come back. The manager has also asked other colleagues to spy to get information about a employee. HR is a joke they have no say in anything and only do what upper management tells them to do. Bullying and mistreating employees is extremely common, it’s a very sad and grey working environment to be in and if you join, start looking for a exit from day one. Very important to understand is your experience will not be relevant for investment banking or credit analysis or any other “real” financial services job, and the M&A knowledge you gain is very basic and wont be relevant at any job. You will not gain any transferable skills, so you will have to exaggerate or lie on your CV to be able to get a better paying job. There will be no training involved at all except the things you will need to know to do your job. Advice to Management Would they listen to any advice? I seriously doubt.", "rating": 1, "pros": "Look at the headline and try to find some pro. Actually I can't find any.", "cons": "First of all check in any search engine the following: mergermarket sex harassment and after mergermarket moody’s. You will have an idea about the management's ethics, professionalism and competence.", "advice": "Would they listen to any advice? I seriously doubt."}, {"title": "Worked there for several years as a Financial Analyst", "text": "Pros It might be good place to start working if u dont have any other offers. This is the only good thing i can say about the company.P.S work ours 9 to 6, nearly everyone leaves at six. Cons U dont really learn much there, its just another data providing company and just maybe 10% of the info/news is valuable, the rest is just public information and junk, copy/paste from bloomberg. Turnover is high for analysts. As soon as people join they are looking for something else. I cant say much about reporters or journalists but I knew few of them and they also left company cos working environment wasnt good for them. Database and technology the company uses is ancient. Even i had a difficulty finding info on our database. Advice to Management Management doenst care about people or their opinion. Few guys just sitting at the top and supporting each other and thats about it.", "rating": 1, "pros": "It might be good place to start working if u dont have any other offers. This is the only good thing i can say about the company.P.S work ours 9 to 6, nearly everyone leaves at six.", "cons": "U dont really learn much there, its just another data providing company and just maybe 10% of the info/news is valuable, the rest is just public information and junk, copy/paste from bloomberg. Turnover is high for analysts. As soon as people join they are looking for something else. I cant say much about reporters or journalists but I knew few of them and they also left company cos working environment wasnt good for them. Database and technology the company uses is ancient. Even i had a difficulty finding info on our database.", "advice": "Management doenst care about people or their opinion. Few guys just sitting at the top and supporting each other and thats about it."}, {"title": "Great place to start your career in Finance", "text": "Pros I worked within the M&A Research Department at their London Head Office as Analyst. Started off with £22,000 base salary + £2,200 annual bonus, I then left the company earning £27,000 base salary + about £5,500 annual bonus after 3 years. The bonus was always rising from the first year. So it was a great experience for me. The reason for that is because I was promoted very quickly to Senior Analyst after just a year. The competition for promotion was tight and for a good reason too. I have seen many dead woods in the team complaining how bad they had been paid. But to be fair, they deserved to be where they were. I would have sacked the lot of them. The most important thing was that I've learned a lot about M&A and towards the end of my career there I became focused on the Leveraged Buyout market. Skills/knowledge I have gained from my job there: Analytics, LBO financing structures, enterprise valuation, IPO processes, and many more. I did really make the most of my time there, which then helped me to land a really good job in the City. Cons Not assertive enough to the dead woods in the team. That makes it unfair for people like me who were committed to the job and actually interested in taking the team forward. The learning curve will plateau in about 2.5 years, will be sooner if you are not promoted to Senior Analyst/Reviewer role in which you could be taking on product development responsibilities. Beyond that you can't get promoted. But then you'll have enough to talk about in your interview for a job in the City. Advice to Management Stick and carrot policy needs to be very clear. Rewards for doing well, and official warning/sacking for the dead woods", "rating": 5, "pros": "I worked within the M&A Research Department at their London Head Office as Analyst. Started off with £22,000 base salary + £2,200 annual bonus, I then left the company earning £27,000 base salary + about £5,500 annual bonus after 3 years. The bonus was always rising from the first year. So it was a great experience for me. The reason for that is because I was promoted very quickly to Senior Analyst after just a year. The competition for promotion was tight and for a good reason too. I have seen many dead woods in the team complaining how bad they had been paid. But to be fair, they deserved to be where they were. I would have sacked the lot of them.", "cons": "Not assertive enough to the dead woods in the team. That makes it unfair for people like me who were committed to the job and actually interested in taking the team forward.", "advice": "Stick and carrot policy needs to be very clear. Rewards for doing well, and official warning/sacking for the dead woods"}, {"title": "Intern", "text": "Pros Very friendly colleague and working environment Cons Limited growth opportunities within company", "rating": 3, "pros": "Very friendly colleague and working environment", "cons": "Limited growth opportunities within company", "advice": null}, {"title": "Exploitative, culture of fear, grossly incompetent management.", "text": "Pros Good working hours. Low level colleagues. Cons High staff turnover, exploiting the often desperate pan EU workforce. Management are lifers who have 'earned' their positions due to being the poorest standard employees thus not picked up by other companies. Culture of bullying and fear is utilised to keep the usually smarter lower level employees in line. Advice to Management Be afraid as no one else will employ you.", "rating": 1, "pros": "Good working hours. Low level colleagues.", "cons": "High staff turnover, exploiting the often desperate pan EU workforce. Management are lifers who have 'earned' their positions due to being the poorest standard employees thus not picked up by other companies. Culture of bullying and fear is utilised to keep the usually smarter lower level employees in line.", "advice": "Be afraid as no one else will employ you."}, {"title": "Moving forward", "text": "Pros Great people to work with mixed backgrounds who are a good laugh There have been a lot of changes in the past year but its moving in the right direction Cons So much depends on who your manager is, you could be unlucky The opportunities are not available easily for all Advice to Management Listen to the 'little people'", "rating": 5, "pros": "Great people to work with mixed backgrounds who are a good laugh", "cons": "So much depends on who your manager is, you could be unlucky", "advice": "Listen to the 'little people'"}, {"title": "Analyst", "text": "Pros Dynamic environment and friendly environment Cons Not much potential for career progression", "rating": 3, "pros": "Dynamic environment and friendly environment", "cons": "Not much potential for career progression", "advice": null}, {"title": "Do yourself a favor and stay away.", "text": "Pros Very difficult to actually say anything positive about this company. Its a very depressing environment to be in. But I guess that you will be able to make friends as everyone is in the same boat. Cons Company was recently bought by a Private Equity firm, which for some people was seen as something positive. Basically employees were hoping for some change. The sad reality is that things just got worse. Bonuses went down, Job security decreased and management got nervous which in turn went out on employees. If you have any other offer or if you are able to get a job anywhere else. Do not hesitate to take it, Because as much as you are hoping that Mergermarket will be your stepping stone to finance services, I assure you it will not be. You will be working in a company where 98% are hoping to leave. Many employees are depressed due to the fact that they are unable to get another job with the experience they have from Mergermarket. All the intelligent individuals have already left. Advice to Management Stop employing.", "rating": 1, "pros": "Very difficult to actually say anything positive about this company. Its a very depressing environment to be in. But I guess that you will be able to make friends as everyone is in the same boat.", "cons": "Company was recently bought by a Private Equity firm, which for some people was seen as something positive. Basically employees were hoping for some change. The sad reality is that things just got worse. Bonuses went down, Job security decreased and management got nervous which in turn went out on employees.", "advice": "Stop employing."}, {"title": "I work for Mergermarket more than 8 years", "text": "Pros Good mix with people from different cultures. Learn a lot of things from customers. Flexible work mode, independent life Cons No or lacking career promotion path Advice to Management Open communication with employees. More encouragement", "rating": 5, "pros": "Good mix with people from different cultures. Learn a lot of things from customers.", "cons": "No or lacking career promotion path", "advice": "Open communication with employees. More encouragement"}, {"title": "Great team - good news training", "text": "Pros Colourful international team. There is good training on the City and business journalism. Promotions can come up quite quickly. There are chances to move jobs abroad. Some people go on to work in TV or national newspapers. Gives a year end cash bonus. Cons You have to be quite independent and prepared for cheapish hotels when it comes to travelling.", "rating": 5, "pros": "Colourful international team. There is good training on the City and business journalism. Promotions can come up quite quickly. There are chances to move jobs abroad. Some people go on to work in TV or national newspapers. Gives a year end cash bonus.", "cons": "You have to be quite independent and prepared for cheapish hotels when it comes to travelling.", "advice": null}, {"title": "Good start for 6 months maximum", "text": "Pros Good work/life balance. Perfect to learn about M&A Research. Cons Low salary and almost no opportunities for advancement. Advice to Management Increase the training sessions and the salary", "rating": 3, "pros": "Good work/life balance. Perfect to learn about M&A Research.", "cons": "Low salary and almost no opportunities for advancement.", "advice": "Increase the training sessions and the salary"}, {"title": "quite good work-life balance.", "text": "Pros young and nice co-workers with diverse backgrounds. a very good company for startups. Cons turnover rate is \"amazingly\" high, and their management team is too young and unexperienced.", "rating": 3, "pros": "young and nice co-workers with diverse backgrounds. a very good company for startups.", "cons": "turnover rate is \"amazingly\" high, and their management team is too young and unexperienced.", "advice": null}, {"title": "Good work/life balance, but..... lacking in the compensation", "text": "Pros A great deal of flexibility and fun, energetic young colleagues go a long way. There is also definitely a sense that the company is growing and will continue to evolve and change in potentially exciting ways. Cons The compensation is not quite up to industry standard. But on balance, this is in many ways mitigated by a notable degree of flexibility and freedom to travel. Advice to Management Reward the employees who stand out and remain loyal with more competitive salaries. This will lead to higher retention and happier staff who will gladly go the extra mile.", "rating": 5, "pros": "A great deal of flexibility and fun, energetic young colleagues go a long way. There is also definitely a sense that the company is growing and will continue to evolve and change in potentially exciting ways.", "cons": "The compensation is not quite up to industry standard. But on balance, this is in many ways mitigated by a notable degree of flexibility and freedom to travel.", "advice": "Reward the employees who stand out and remain loyal with more competitive salaries. This will lead to higher retention and happier staff who will gladly go the extra mile."}, {"title": "Poor management; no incentives", "text": "Pros work life balance. you can even work from home get to meet many interesting people if you are a reporter Cons the management is probably the worst; there is no room for promotion, it's a very flat structure. Receive farewell emails every day. The company is still using the same system as 10 years ago, its app is a joke. The pay is below average. Advice to Management Listen to your employees and invest on IT", "rating": 1, "pros": "work life balance.", "cons": "the management is probably the worst; there is no room for promotion, it's a very flat structure.", "advice": "Listen to your employees and invest on IT"}, {"title": "One of the worst companies to work for in London", "text": "Pros Leave at 6pm and colleagues. The rest feels like a prison. Cons Salary, training, management, the office culture is extremely bad, bullying, harassement, spying. Good Luck is you accept a poisition at this company, Advice to Management There is no hope, be honest with candidates before they accept the job.", "rating": 1, "pros": "Leave at 6pm and colleagues. The rest feels like a prison.", "cons": "Salary, training, management, the office culture is extremely bad, bullying, harassement, spying. Good Luck is you accept a poisition at this company,", "advice": "There is no hope, be honest with candidates before they accept the job."}, {"title": "Uncompetitive compensation, zero upward mobility and high turnover", "text": "Pros Best thing about working there was the people. It's like being at university - the friends you make there stay with you for life. Cons Everything else apart from the colleagues you consider \"friends\". Very poor management and guidance. Massive turnover rate. Sales focused rather than content focused. Technologically backwards. Horrible compensation and bonus. Absolute lack of upward mobility. Useless strategic initiatives that are not well thought out or market tested. No quality control on existing products. \"Borrows\" from competitors. The list goes on... Advice to Management Get rid of the unproductive upper echelon of \"management\" and use that budget to bring better people onboard by simply paying them more.", "rating": 1, "pros": "Best thing about working there was the people. It's like being at university - the friends you make there stay with you for life.", "cons": "Everything else apart from the colleagues you consider \"friends\". Very poor management and guidance. Massive turnover rate. Sales focused rather than content focused. Technologically backwards. Horrible compensation and bonus. Absolute lack of upward mobility. Useless strategic initiatives that are not well thought out or market tested. No quality control on existing products. \"Borrows\" from competitors. The list goes on...", "advice": "Get rid of the unproductive upper echelon of \"management\" and use that budget to bring better people onboard by simply paying them more."}, {"title": "good work/life balance but boring job", "text": "Pros location, people (more or less fine), diversity, relaxed Cons slow progression, lack of investment into IT system and people Advice to Management did you hear something about \"motivating personnel techniques\"?", "rating": 3, "pros": "location, people (more or less fine), diversity, relaxed", "cons": "slow progression, lack of investment into IT system and people", "advice": "did you hear something about \"motivating personnel techniques\"?"}, {"title": "Not a place for real journalism, with bad management", "text": "Pros Good amount of holiday time; various offices internationally; when one's own manager is unapproachable, at least not all managers are awful, so one can try to go to another manager with a problem to get their support when there is a problem (this really isn't a pro, but there is a 20 word minimum here) Cons Poor base salary, huge focus on cutting costs rather than assessing what investments could make the company money. Unskilled and volatile managers. For those interested to be journalists, stay away from MM. The stories only go out to subscribers, not for public consumption. The stories are extremely repetitive; each person the journalist interviews is asked the exact same questions and stories are only written if they answer specific things. It is like being in a call center, cold calling people to get info from them that they don't want to give. It's data collection more than journalism, and one cannot decipher which journalist has written which story because they all look the same. Boring style, boring headlines. Poor feedback from managers. A lot of criticism. Advice to Management Learn the trade for what you expect of your own staff", "rating": 3, "pros": "Good amount of holiday time; various offices internationally; when one's own manager is unapproachable, at least not all managers are awful, so one can try to go to another manager with a problem to get their support when there is a problem (this really isn't a pro, but there is a 20 word minimum here)", "cons": "Poor base salary, huge focus on cutting costs rather than assessing what investments could make the company money. Unskilled and volatile managers. For those interested to be journalists, stay away from MM. The stories only go out to subscribers, not for public consumption. The stories are extremely repetitive; each person the journalist interviews is asked the exact same questions and stories are only written if they answer specific things. It is like being in a call center, cold calling people to get info from them that they don't want to give. It's data collection more than journalism, and one cannot decipher which journalist has written which story because they all look the same. Boring style, boring headlines. Poor feedback from managers. A lot of criticism.", "advice": "Learn the trade for what you expect of your own staff"}, {"title": "Very social, not always as professional and meritocratic as I would've liked.", "text": "Pros Location, benefits, \"open-planness\", friendliness, minimum paper-work. Cons Senior management is a closed shop of English (mostly) private school types, only caring about the quarterly results (i.e. their bonuses). Advice to Management Have more of a longer-term vision on the business, spot and promote talent within the company.", "rating": 3, "pros": "Location, benefits, \"open-planness\", friendliness, minimum paper-work.", "cons": "Senior management is a closed shop of English (mostly) private school types, only caring about the quarterly results (i.e. their bonuses).", "advice": "Have more of a longer-term vision on the business, spot and promote talent within the company."}, {"title": "Great place to learn about M&A and corporate finance. Excellent location and good benefits", "text": "Pros The atmosphere is dynamic, collegiate and goal-oriented. The people are smart and fun to work with. Product ideas are very welcome. Cons Certain editors can be overbearing and prone to bullying. Salaries are low and bonuses are increasingly non-existent Advice to Management Rein in the difficult editors. You're losing talent faster than you realise", "rating": 5, "pros": "The atmosphere is dynamic, collegiate and goal-oriented. The people are smart and fun to work with. Product ideas are very welcome.", "cons": "Certain editors can be overbearing and prone to bullying. Salaries are low and bonuses are increasingly non-existent", "advice": "Rein in the difficult editors. You're losing talent faster than you realise"}, {"title": "bad experience with management and the company in general", "text": "Pros Location location location... I do not see anything else. Cons Long hours. Minimum holidays and benefits. Advice to Management sort this out and be generous with employees", "rating": 3, "pros": "Location location location... I do not see anything else.", "cons": "Long hours. Minimum holidays and benefits.", "advice": "sort this out and be generous with employees"}, {"title": "OK pay but management seems clueless", "text": "Pros Lets you work on certain industries to build up your credibility Cons Company is not transparent; you never get a clear picture of what is going on. Certain members of upper management clearly clueless as to what middle management is doing. Too focused on churning reports. Advice to Management Appreciate and give reporters better welfare and benefits", "rating": 3, "pros": "Lets you work on certain industries to build up your credibility", "cons": "Company is not transparent; you never get a clear picture of what is going on. Certain members of upper management clearly clueless as to what middle management is doing. Too focused on churning reports.", "advice": "Appreciate and give reporters better welfare and benefits"}, {"title": "Places lots of fear on the employee", "text": "Pros Work life balance and great co-workers. No need to working during weekends. Cons Managers love to use fear to push employees to work harder. Lots of politics from upper management. Management are inexperienced and expects employees to do things that they cannot even do themselves. People in research are often under paid. Advice to Management Try to treat your employees more fairly, don't use fear to manage employees and expect them to do things you cannot do yourself. Maybe this will help with the extremely high turnover. Try to pay market wage to employees and give more respect to Asian employees.", "rating": 3, "pros": "Work life balance and great co-workers. No need to working during weekends.", "cons": "Managers love to use fear to push employees to work harder. Lots of politics from upper management. Management are inexperienced and expects employees to do things that they cannot even do themselves.", "advice": "Try to treat your employees more fairly, don't use fear to manage employees and expect them to do things you cannot do yourself. Maybe this will help with the extremely high turnover."}, {"title": "Editorial", "text": "Pros -It is a Good company to start your career in the news media. Many journalists eventually step up to top-tier publications. Cons -Lack of variety in stories. -Continuous pressure to write original contents.", "rating": 3, "pros": "-It is a Good company to start your career in the news media. Many journalists eventually step up to top-tier publications.", "cons": "-Lack of variety in stories.", "advice": null}, {"title": "Good entry level Job", "text": "Pros Nice environment, nice people. Relax workplace Cons Salary below industry peers and below similar jobs in the banking industry Advice to Management None", "rating": 3, "pros": "Nice environment, nice people. Relax workplace", "cons": "Salary below industry peers and below similar jobs in the banking industry", "advice": "None"}, {"title": "Pay peanuts and get monkeys", "text": "Pros The work life balance is good (the office is empty by 6 o'clock). Cons No education support, pay, limp atmosphere, limited human capital. Advice to Management Harness the drive of upwardly mobile employees before they get frustrated and leave.", "rating": 1, "pros": "The work life balance is good (the office is empty by 6 o'clock).", "cons": "No education support, pay, limp atmosphere, limited human capital.", "advice": "Harness the drive of upwardly mobile employees before they get frustrated and leave."}, {"title": "Boy culture", "text": "Pros - Laid back, short hours Cons - career progression reserved to the ones who network best internally - low base salaries - not much learning happening - drunk salespeople Advice to Management Replace half the current sales force and recruit strong motivated and smart people externally", "rating": 1, "pros": "- Laid back, short hours", "cons": "- career progression reserved to the ones who network best internally", "advice": "Replace half the current sales force and recruit strong motivated and smart people externally"}, {"title": "employee", "text": "Pros work life balance. U come earlier than your boss and leave after your bosses. Cons No management experience among bunches of average British intelligent. Either charming girls or kissing their asses will have happy lives regardless evaluation chart. Otherwise treat you as a high school kids and no respect on your professionalism. The managers don't care or less why so many left the firm Advice to Management Please understand why so many left. Please respect Asian workers as it seems to have a big gap.", "rating": 1, "pros": "work life balance. U come earlier than your boss and leave after your bosses.", "cons": "No management experience among bunches of average British intelligent. Either charming girls or kissing their asses will have happy lives regardless evaluation chart. Otherwise treat you as a high school kids and no respect on your professionalism. The managers don't care or less why so many left the firm", "advice": "Please understand why so many left. Please respect Asian workers as it seems to have a big gap."}, {"title": "Nothing to do with journalism, more of a \"subscription only\"/politically correct private publication", "text": "Pros - You will get published - You will practice interview skills - Good benefits - Potential travel opportunities Cons - Terrible management- no place for human contact at all - Very bad working environment (400 journalists in one large room) - Terrible communication (everything is done through msn which is inefficient and unpersonnal) - Inefficient grading and evaluating system- high pressure on employees, no trust in their work and use of fear and threats to be fired - Quantity over quality- it's NOT about the quality of your article, just about how many you manage to publish to reach the required quotas Advice to Management I think the evaluating system should be reformed as it doesn't take in account the differences between the various markets. There's no need to use fear with employees and personal human contact should definitively replace the awkward mail/msn communications with people who are sitting right next to you. Employees are not respected and treated like children most of the time.", "rating": 1, "pros": "- You will get published", "cons": "- Terrible management- no place for human contact at all", "advice": "I think the evaluating system should be reformed as it doesn't take in account the differences between the various markets. There's no need to use fear with employees and personal human contact should definitively replace the awkward mail/msn communications with people who are sitting right next to you. Employees are not respected and treated like children most of the time."}, {"title": "OK", "text": "Pros working environment is multi-national, and relaxed and staff here are quite yonung. Cons I really don not konw; besides Advice to Management no advice could be given for the time being", "rating": 3, "pros": "working environment is multi-national, and relaxed and staff here are quite yonung.", "cons": "I really don not konw; besides", "advice": "no advice could be given for the time being"}, {"title": "Making a success of Digital Journalism.", "text": "Pros It has made a success from nothing in the last 10 years, and there is not reason this should slow down in the next 10 years. Work/Life balance flexible, and innovation encouraged. Cons Scruffy offices with a bit of a lack of breakout space. Financial information is never going to be \"sexy\" as a business. Advice to Management Believe in the company and the staff. This is the beginning, there is no reason that we can;t be to the information business what amazon is to the retail business.", "rating": 5, "pros": "It has made a success from nothing in the last 10 years, and there is not reason this should slow down in the next 10 years. Work/Life balance flexible, and innovation encouraged.", "cons": "Scruffy offices with a bit of a lack of breakout space. Financial information is never going to be \"sexy\" as a business.", "advice": "Believe in the company and the staff. This is the beginning, there is no reason that we can;t be to the information business what amazon is to the retail business."}, {"title": "You will love it if you want to be treated like a child; no career growth whatsoever", "text": "Pros Work/Life balance is one of the best; You will meet some great colleagues throughout the entire company; OK seasonal parties; Cons Middle and upper management folks are inexperienced and sometimes seem unsure what their goals are; much of what is done based on trial and error; communication issues occur often; research division of main product lacks respect from the company and overall lacks genuine leadership; leadership based on placing fear on employees; awful place for growth; no formal training; very political Advice to Management Make sure the managers actually do some work; place less fear on employees; give the employees training to make sure they are doing their job properly; less blame, more growth", "rating": 3, "pros": "Work/Life balance is one of the best; You will meet some great colleagues throughout the entire company; OK seasonal parties;", "cons": "Middle and upper management folks are inexperienced and sometimes seem unsure what their goals are; much of what is done based on trial and error; communication issues occur often; research division of main product lacks respect from the company and overall lacks genuine leadership; leadership based on placing fear on employees; awful place for growth; no formal training; very political", "advice": "Make sure the managers actually do some work; place less fear on employees; give the employees training to make sure they are doing their job properly; less blame, more growth"}, {"title": "Thriving and unstoppable growth", "text": "Pros Young and ambitious, the business mushroomed out of nowhere and seems to be heading far. Management is under 40 and that gives one the hope that working hard may take one far. Cons As it started from scratch at the beginning of the century, it has grown a lot and it could look understaffed at the helm, as the business increases faster than management can keep up to. Advice to Management Keep on doing the same and aim high. The management knows how to make things work and decuplicate business, while hedging against financial crises.", "rating": 5, "pros": "Young and ambitious, the business mushroomed out of nowhere and seems to be heading far. Management is under 40 and that gives one the hope that working hard may take one far.", "cons": "As it started from scratch at the beginning of the century, it has grown a lot and it could look understaffed at the helm, as the business increases faster than management can keep up to.", "advice": "Keep on doing the same and aim high. The management knows how to make things work and decuplicate business, while hedging against financial crises."}, {"title": "Best place to work for a mother", "text": "Pros Stable, good working life balnce, people are nice and understanding,independently work so can schedule your own time well Cons No career progress Not much challenge No reputation Advice to Management They should know how to manage people as it's a young company", "rating": 3, "pros": "Stable, good working life balnce, people are nice and understanding,independently work so can schedule your own time well", "cons": "No career progress", "advice": "They should know how to manage people as it's a young company"}, {"title": "It's not bad", "text": "Pros You would have enough freedom at your production. The work-life balance is ideal. There are benefits to claim if you know how. Cons The measurement of your performance is random. After a period of time, your passion for career development will also go random. Advice to Management If you set a goal, then please be determined to make it happened. The future belongs to those who see it before or more clearly than their competitors.", "rating": 3, "pros": "You would have enough freedom at your production.", "cons": "The measurement of your performance is random. After a period of time, your passion for career development will also go random.", "advice": "If you set a goal, then please be determined to make it happened."}, {"title": "Financial Analyst", "text": "Pros work and life balance very well. Cons the salary is not competitive at all...", "rating": 5, "pros": "work and life balance very well.", "cons": "the salary is not competitive at all...", "advice": null}, {"title": "Blah", "text": "Pros the benefits are not that bad Cons the pay could be better", "rating": 3, "pros": "the benefits are not that bad", "cons": "the pay could be better", "advice": null}, {"title": "Mergermarket a financially rewarding but ethically challenging place for journalists", "text": "Pros Mergermarket embraces helpful employee-friendly options such as telecommuting. Pay and benefits are comparable to or better than similar employers, and the niche business model seems considerably more sound than the traditional models of general news media outlets. (To my knowledge, MM has never had to conduct employee layoffs.) Cons Potential for career advancement is somewhat limited, although willingness to move geographically (particularly to emerging international markets) can expand those opportunities. Also, the nature of the job can sometimes conflict with the ideals/values that often attract people to journalism (e.g. desire to cause some social good through reporting). Instead, the role of the Mergermarket reporter is to originate leads for investment bankers, essentially. Advice to Management A stronger collaboration with the Financial Times (parent company) and opportunity for MM reporters to contribute to or correspond with the Financial Times would be a nice incentive to keep MM journalists motivated and also perhaps recruit new journalists to MM.", "rating": 5, "pros": "Mergermarket embraces helpful employee-friendly options such as telecommuting. Pay and benefits are comparable to or better than similar employers, and the niche business model seems considerably more sound than the traditional models of general news media outlets. (To my knowledge, MM has never had to conduct employee layoffs.)", "cons": "Potential for career advancement is somewhat limited, although willingness to move geographically (particularly to emerging international markets) can expand those opportunities. Also, the nature of the job can sometimes conflict with the ideals/values that often attract people to journalism (e.g. desire to cause some social good through reporting). Instead, the role of the Mergermarket reporter is to originate leads for investment bankers, essentially.", "advice": "A stronger collaboration with the Financial Times (parent company) and opportunity for MM reporters to contribute to or correspond with the Financial Times would be a nice incentive to keep MM journalists motivated and also perhaps recruit new journalists to MM."}, {"title": "Good overall, managers lack direction and perspectives at times", "text": "Pros 1) flexible working hours 2) amazing work from home policy (certain departments like IT) 3) promote from within (limited roles only) Cons 1) inexperienced managers 2) communication breakdown 3) lack structure 4) low tech Advice to Management cherish talents", "rating": 5, "pros": "1) flexible working hours", "cons": "1) inexperienced managers", "advice": "cherish talents"}, {"title": "Very good place to work for. Things have changed though", "text": "Pros Lots to learn Great atmosphere Smart colleagues Cons If you're not part-of-the-circle you can forget about any promotion Advice to Management Try to regain some of the early days feeling and drive", "rating": 5, "pros": "Lots to learn", "cons": "If you're not part-of-the-circle you can forget about any promotion", "advice": "Try to regain some of the early days feeling and drive"}, {"title": "lots of potential", "text": "Pros Strong entrepreneurial culture. Relaxed atmosphere. Work hard and play hard. Compensation rewards success and new ideas are quickly implemented most of the time Cons Politicized management process. Poor communication. Not enough focus on creating professional journalists. Infrastructure is weak in terms of development and communication Advice to Management See above", "rating": 5, "pros": "Strong entrepreneurial culture. Relaxed atmosphere. Work hard and play hard. Compensation rewards success and new ideas are quickly implemented most of the time", "cons": "Politicized management process. Poor communication. Not enough focus on creating professional journalists. Infrastructure is weak in terms of development and communication", "advice": "See above"}, {"title": "A good environment with young co-workers", "text": "Pros It is a good way to get familiar with the M&A business and you can get valuable contacts with your work. The team is full of young internationals and it is a very friendly environment with some nice and direct managers. Cons I consider myself underpaid for the job i am doing and for the value and revenue we generate. There is few options to get promoted as the structure is very flat. Advice to Management I would revise the salary strategy as the low salaries expose the company to a high risk that some of the key members of staff could have enough and leave the company.", "rating": 5, "pros": "It is a good way to get familiar with the M&A business and you can get valuable contacts with your work. The team is full of young internationals and it is a very friendly environment with some nice and direct managers.", "cons": "I consider myself underpaid for the job i am doing and for the value and revenue we generate. There is few options to get promoted as the structure is very flat.", "advice": "I would revise the salary strategy as the low salaries expose the company to a high risk that some of the key members of staff could have enough and leave the company."}]