[{"title": "Couldn't be happier", "text": "Pros • Mindful, respectful, and energetic leadership • Open, consistent, and very transparent communication across teams and leadership •  Killer office parties • Team diversity • Remote work flexibility • Trust in employees • Growth, growth, growth • Dog-Friendly Cons • As the team grows, more structure will need to be set in place. However, leadership has done a great job in making the smooth transition.", "rating": 5, "pros": "• Mindful, respectful, and energetic leadership • Open, consistent, and very transparent communication across teams and leadership •  Killer office parties • Team diversity • Remote work flexibility • Trust in employees • Growth, growth, growth • Dog-Friendly", "cons": "• As the team grows, more structure will need to be set in place. However, leadership has done a great job in making the smooth transition.", "advice": null}, {"title": "Best Job I've Ever Had", "text": "Pros I love working here. Lots of upside and upwards mobility. The team is great. Cons Same cons of working at any other Series A startup. Advice to Management Don't get too corporate on us!", "rating": 5, "pros": "I love working here. Lots of upside and upwards mobility. The team is great.", "cons": "Same cons of working at any other Series A startup.", "advice": "Don't get too corporate on us!"}, {"title": "A Great Summer Internship Experience", "text": "Pros - Great comradery amongst team - Openness to working remotely - Willingness to teach and answer questions Cons - Working remotely when you could be in their exciting New York office Advice to Management Your support system for interns is rare and valuable, please keep doing what you're doing for your interns as you grow more and more successful.", "rating": 5, "pros": "- Great comradery amongst team", "cons": "- Working remotely when you could be in their exciting New York office", "advice": "Your support system for interns is rare and valuable, please keep doing what you're doing for your interns as you grow more and more successful."}, {"title": "Work Hard & Play Hard", "text": "Pros *Great team culture *Everyone feels part of the businesses. It is clear how we are impacting the businesses with what we are doing. *Put the users first. *Fast paced work enviornment Cons *High expectations *Startups have their ups and their downs. Be prepared for that. Advice to Management Don't turn corporate. What you are doing is great.", "rating": 5, "pros": "*Great team culture", "cons": "*High expectations", "advice": "Don't turn corporate. What you are doing is great."}, {"title": "Work hard, love every minute of it", "text": "Pros The \"team\" that more closely resembles a friend group. High energy work environment. Fast-pace. Rapidly growing. Relaxed work environment. Always feeling like you are making an impact. Good beer. Cons Low security work with a startup. If you can't handle the heat, get out of the kitchen.", "rating": 5, "pros": "The \"team\" that more closely resembles a friend group. High energy work environment. Fast-pace. Rapidly growing. Relaxed work environment. Always feeling like you are making an impact. Good beer.", "cons": "Low security work with a startup. If you can't handle the heat, get out of the kitchen.", "advice": null}]