[{"title": "Horrible", "text": "Pros Great coworkers. Dress code you can wear anything you want. Environment is pretty relaxing. The working condition is pretty leisure. Cons Horrible management and horrible pay. Management likes to talk badly behind your back. They don't care for your opinions and the pay is low.", "rating": 3, "pros": "Great coworkers. Dress code you can wear anything you want. Environment is pretty relaxing. The working condition is pretty leisure.", "cons": "Horrible management and horrible pay. Management likes to talk badly behind your back. They don't care for your opinions and the pay is low.", "advice": null}, {"title": "Unhappy Gossip Girl", "text": "Pros Alloy produces fun and exciting content for the youth market. They produce Gossip Girl, Sisterhood of the Traveling Pants and several other top youth brands. Cons The business lacks structure and upper management does not nurture its employees to help grow the business. There is no such thing as a ramp up period here. Depending on your role, you may not get training or any support to get up to speed and do your necessary tasks. Feedback is not taken well. Advice to Management Either learn how to take feedback from your employees (including the little guys) or hire management who will be more hands on and put clear, defined business rules in place. Communication is poor and the culture needs a lot of work as well.", "rating": 3, "pros": "Alloy produces fun and exciting content for the youth market. They produce Gossip Girl, Sisterhood of the Traveling Pants and several other top youth brands.", "cons": "The business lacks structure and upper management does not nurture its employees to help grow the business. There is no such thing as a ramp up period here. Depending on your role, you may not get training or any support to get up to speed and do your necessary tasks. Feedback is not taken well.", "advice": "Either learn how to take feedback from your employees (including the little guys) or hire management who will be more hands on and put clear, defined business rules in place. Communication is poor and the culture needs a lot of work as well."}]