[{"title": "HHA", "text": "Pros Free to choose hrs and cases Cons 1099 tax structure can be a deterrent Advice to Management Go straight pay.I would offer training for certifications", "rating": 3, "pros": "Free to choose hrs and cases", "cons": "1099 tax structure can be a deterrent", "advice": "Go straight pay.I would offer training for certifications"}, {"title": "ok", "text": "Pros Great People to work with Cons Un organized schedule planning and work performance requirements", "rating": 3, "pros": "Great People to work with", "cons": "Un organized schedule planning and work performance requirements", "advice": null}, {"title": "Found this to be a great place", "text": "Pros A lot of flexibility and resources. Cons There weren't any cons to share.", "rating": 5, "pros": "A lot of flexibility and resources.", "cons": "There weren't any cons to share.", "advice": null}, {"title": "Meh", "text": "Pros -Pretty easy job -Flexible Scheduling -Breakroom is cool -Discount is good -Cool people working Cons - Management is terrible. - It's nearly impossible to move up - They fire their employees very often over the smallest things Advice to Management Learn to appreciate your GOOD employees instead of calling them out for the smallest details and then just terminating them.", "rating": 3, "pros": "-Pretty easy job", "cons": "- Management is terrible.", "advice": "Learn to appreciate your GOOD employees instead of calling them out for the smallest details and then just terminating them."}, {"title": "Flexable schedules", "text": "Pros Team building events for employees. Small environment. Cons No room for advancements. Long term employees. Advice to Management None", "rating": 5, "pros": "Team building events for employees. Small environment.", "cons": "No room for advancements. Long term employees.", "advice": "None"}, {"title": "Good company to work with", "text": "Pros The work culture is good Cons i don't have anything to say Advice to Management good management. continue doing good work", "rating": 5, "pros": "The work culture is good", "cons": "i don't have anything to say", "advice": "good management. continue doing good work"}, {"title": "Arcadia", "text": "Pros Great learning and development opportunities for progression Cons targets are hard to get sometimes and are bonused", "rating": 5, "pros": "Great learning and development opportunities for progression", "cons": "targets are hard to get sometimes and are bonused", "advice": null}, {"title": "Great company lots of possibilites to develop", "text": "Pros - Career Development - Great staff benefits (Sample sales, discount, amazing head office refit) - Great learning and development opportunities - Great company culture Cons - Lots of company changes to streamline the business has meant a lot of changes internally that will hopefully result in a better working module. Advice to Management Great opportunities to grow and develop your career.", "rating": 5, "pros": "- Career Development", "cons": "- Lots of company changes to streamline the business has meant a lot of changes internally that will hopefully result in a better working module.", "advice": "Great opportunities to grow and develop your career."}, {"title": "Great experience but limited progression", "text": "Pros 25% discount on all brands, great exposure to fast-paced environment, looks good on CV Cons Poor management and progression is not prioritised/thought of as important Advice to Management Give more feedback and have regular 1:1s with line manager", "rating": 3, "pros": "25% discount on all brands, great exposure to fast-paced environment, looks good on CV", "cons": "Poor management and progression is not prioritised/thought of as important", "advice": "Give more feedback and have regular 1:1s with line manager"}, {"title": "Sales Advisor", "text": "Pros Good training and good amount of breaks Cons Low hourly contracts and having to use a credit store card to get your staff discount across the Arcadia range.", "rating": 5, "pros": "Good training and good amount of breaks", "cons": "Low hourly contracts and having to use a credit store card to get your staff discount across the Arcadia range.", "advice": null}, {"title": "Space to grow is limited. Competitive & Slow", "text": "Pros Processes are quite slow but there are the resources to start new projects and way of working if you are full of ideas. Cons Processes are extremely slow, many layers before getting things signed off, lots of politics and old-school leadership.", "rating": 3, "pros": "Processes are quite slow but there are the resources to start new projects and way of working if you are full of ideas.", "cons": "Processes are extremely slow, many layers before getting things signed off, lots of politics and old-school leadership.", "advice": null}, {"title": "First time", "text": "Pros Fair discounts Great for school leavers Can be fairly flexible in their working hours Overtime Cons Structure of who is who in store sometimes unclear but if fairness there was some reshuffling going on in the store Long hours for little pay", "rating": 3, "pros": "Fair discounts", "cons": "Structure of who is who in store sometimes unclear but if fairness there was some reshuffling going on in the store", "advice": null}, {"title": "Senior Marketing Manager", "text": "Pros the people are amazing, good environment, good facilities Cons very demanding, lack of strategy", "rating": 5, "pros": "the people are amazing, good environment, good facilities", "cons": "very demanding, lack of strategy", "advice": null}, {"title": "Sales advisor", "text": "Pros Discount, friendly staff, flexible working hours Cons Minimum wage for long hours", "rating": 5, "pros": "Discount, friendly staff, flexible working hours", "cons": "Minimum wage for long hours", "advice": null}, {"title": "Spain & Gibraltar Loss Prevention Manager", "text": "Pros We have a great team spirit, professional training, customer service and safety Cons About online Loss Prevention, the company is not updated in the latest techniques. Advice to Management How to make your team reach beyond what they can think they can get? With example!", "rating": 5, "pros": "We have a great team spirit, professional training, customer service and safety", "cons": "About online Loss Prevention, the company is not updated in the latest techniques.", "advice": "How to make your team reach beyond what they can think they can get? With example!"}, {"title": "Maa", "text": "Pros Free clothes fun job samples sales Cons Wages, progression is slow, quite stressful", "rating": 3, "pros": "Free clothes fun job samples sales", "cons": "Wages, progression is slow, quite stressful", "advice": null}, {"title": "Great Company to work for", "text": "Pros Had a brilliant time working for arcadia. Cons Progression is slow to begin with", "rating": 5, "pros": "Had a brilliant time working for arcadia.", "cons": "Progression is slow to begin with", "advice": null}, {"title": "Sales advisor Outfit 4hrs", "text": "Pros Wide variety of clothing Small shifts make a great first job A lot of opportunities to progress Keen to train Clear training programmes/refreshers 70% off uniform Further unlimited 25% off Reliable payroll Cons Far away stock rooms meant it wasn’t easy to check Frequent sales: promotions which are hard maintenance Early stock check mornings Booking holidays often awkward and took a long time to hear back Advice to Management Improve holiday applications", "rating": 5, "pros": "Wide variety of clothing", "cons": "Far away stock rooms meant it wasn’t easy to check", "advice": "Improve holiday applications"}, {"title": "Not a terrible tech job...", "text": "Pros Good salary, relaxed workplace, good choice of benefits. Cons Not much there in terms of culture.", "rating": 3, "pros": "Good salary, relaxed workplace, good choice of benefits.", "cons": "Not much there in terms of culture.", "advice": null}, {"title": "Overview", "text": "Pros Friendly work environment. 25% discount at all Arcadia brands. Clear and structured path of progression within your role. Good training provided. Cons Very fast-paced. Starting salaries not very high.", "rating": 3, "pros": "Friendly work environment.", "cons": "Very fast-paced.", "advice": null}, {"title": "Welcome to customer care hell", "text": "Pros Good way to get foot in CC Cons Being controlled like a prisoner Advice to Management See your staff as assets and not as disposables", "rating": 1, "pros": "Good way to get foot in CC", "cons": "Being controlled like a prisoner", "advice": "See your staff as assets and not as disposables"}, {"title": "Customer service advisor", "text": "Pros Great working environment Cons There were no cons working for Arcadia Advice to Management keep up the hard work", "rating": 5, "pros": "Great working environment", "cons": "There were no cons working for Arcadia", "advice": "keep up the hard work"}, {"title": "Customer Care Advisor", "text": "Pros Progression to other roles and different departments is common In depth training programme Lots of organised theme days/charity events Cons Unsociable working environment Lack of support from managers, including no respect for the customer care role by everyone in the department Advisors are treated like children and just a number. Advice to Management Policy in place when customers are rude and aggressive is obscene and being abused shouldn't be tolerated, instead of having 3 warnings. Get to know the staff, treat them like human beings and take an interest in their goals, problems and maybe even their name.", "rating": 3, "pros": "Progression to other roles and different departments is common", "cons": "Unsociable working environment", "advice": "Policy in place when customers are rude and aggressive is obscene and being abused shouldn't be tolerated, instead of having 3 warnings."}, {"title": "Maniac", "text": "Pros team work, canteen and lockers, 2 break Cons Bad management and power abuse, had to pay for the uniform", "rating": 3, "pros": "team work, canteen and lockers, 2 break", "cons": "Bad management and power abuse, had to pay for the uniform", "advice": null}, {"title": "Arcadia", "text": "Pros Atmosphere, Actual Role, Products Progression reviews Cons Small discount Small salary for London", "rating": 5, "pros": "Atmosphere, Actual Role, Products Progression reviews", "cons": "Small discount", "advice": null}, {"title": "Very good place to enter the work force", "text": "Pros company discounts of 25% throughout Arcadia group uniform allowance renewed every 3 months staff activities during Christmas etc Cons shortage of staff on some occasions Advice to Management ensure enough staff are booked for each shift.", "rating": 5, "pros": "company discounts of 25% throughout Arcadia group", "cons": "shortage of staff on some occasions", "advice": "ensure enough staff are booked for each shift."}, {"title": "Good", "text": "Pros It was very nice working there, good perks Cons not flexiable and didnt give enough pay", "rating": 5, "pros": "It was very nice working there, good perks", "cons": "not flexiable and didnt give enough pay", "advice": null}, {"title": "Good Company to Work for", "text": "Pros Fun environment Friendly staff Staff Discount and Uniform Cons Not Flexible with hours Bad Communication", "rating": 5, "pros": "Fun environment", "cons": "Not Flexible with hours", "advice": null}, {"title": "Do not stay too long", "text": "Pros Recognised company and some experienced, nice people to learn from Cons Salary, \"management, training/ppd, the list goes on! Advice to Management Break the old patterns that obviously do not work", "rating": 3, "pros": "Recognised company and some experienced, nice people to learn from", "cons": "Salary, \"management, training/ppd, the list goes on!", "advice": "Break the old patterns that obviously do not work"}, {"title": "Chaotic Management - IT Department", "text": "Pros Location Intelligent workforce Salary Good tool stack Cons On my first day I was dumped at my desk without even being shown where the toilets were. I didn't see my line manager for weeks. This was a trend that was to continue. The teams do not engage each other, there is no vision nor strategy, merely individuals fire fighting a busy workload. Most of the department work in silence. Advice to Management Get down from your ivory towers. Communication needs to be addressed.", "rating": 1, "pros": "Location", "cons": "On my first day I was dumped at my desk without even being shown where the toilets were. I didn't see my line manager for weeks. This was a trend that was to continue.", "advice": "Get down from your ivory towers. Communication needs to be addressed."}, {"title": "good development", "text": "Pros Good development programs and training, Amazing office space and fun people to work with. Also great social aspect Cons Long hours, progression often lengthy, a lot of competition", "rating": 5, "pros": "Good development programs and training, Amazing office space and fun people to work with. Also great social aspect", "cons": "Long hours, progression often lengthy, a lot of competition", "advice": null}, {"title": "Merchandise Assistant", "text": "Pros Great work life balance Great team to work along side Cons Hard for career progression Managers considers themselves to be superior", "rating": 3, "pros": "Great work life balance", "cons": "Hard for career progression", "advice": null}, {"title": "WORST JOB EVER", "text": "Pros None none none none none Cons Where do I even start... I worked at Arcadia for 6 months part time and I can confirm that it is the most hideous, demeaning, disgusting, unacceptable, atrocious and despicable place to work at. Firstly, the management are rude and unhelpful when you are in need of any assistance. Certain individuals seem to go out of their way to make your life a misery whilst you are there. When you are in need of any help, you are told to call the \"support line\"- and you are connected to a manger who is SUPPOSED to advise you on what to do next. However, most of the time you are asked to check your procedure manuals, which requires you to waste even more time and half the time your queries are not even covered in the manuals you are given. Additionally, the training is below mediocre. This is because it provides insufficient guidance to carry out your job, and once you leave training, you are thrown into the job without any further assistance. Ultimately, the training is of a very low standard. On top of this, you are advised to wear \"smart clothing\", and are told off if you do not adhere to this. BUT, when it is A MEMBER OF MANAGEMENT wearing CROP TOPS AND SANDALS, no one says anything to them. You are expected to be at work bang on time, which is absolutely fine, but when the mangy computers are not working, and you sign in 1 minute late because of it, a manager had the nerve to ask me why i signed in 1 minute late. 1 minute. A single minute. His exact words were- \"Was there anything significant about this day, why did you sign in late?\" After I explained about the dodgy computers, he went ahead and wrote me a LETTER OF CONCERN regarding my lateness. Concerned about what? Your bacterial infested computers? Talking of computers, the office allegedly underwent a \"deep clean\" where they apparently cleaned and disinfected the computers. This involved a team of cleaners coming in and scrubbing the computers/keyboards/mouses etc. After instructing everyone to move to the cleaned computers, I sat down at a computer which had allegedly been cleaned. I sat down, loaded up my system, and decided to inspect to what extent the equipment had been cleaned. All I did was rotated my mouse upside down. On the bottom of my mouse was a murky black substance. I felt sick. I was disgusted. Shocked. I felt absolutely violated. IF you are going to clean something, pls do it properly. The company is not flexible in terms of time off, if you require a day off, they usually say tough because 99.99999999% of the time you arent going to get it. When booking days off, you will have to select random days because you have to take what you can get. If it is an emergency, they will make you do a shift swap, so you will have to make up the hours by working somebody else's shift. The customers are rude and make you feel like rubbish. Depression hits you when you walk into the building. You will be counting the minutes until you can leave. In fact, you will be praying to be sent to prison because it seems like a lighter sentence than Arcadia. They ask you to hit targets which are impossible, and if you do not hit these they keep calling you into meetings which results ultimately in dismissal if you cannot carry these out. Employee turnover rate is a joke, nobody stays here for long, for a good reason. You are shouted at for TAlkiNg to Your colleAgues, but when the managers are having mothers meetings, no one says anything. Its quite rude tbh. Discount is rubbish. The Point of sale card you are given has too many catches e,.g. you have to pay on a card with your name on it, only 10% on shoes because they are made by a separate company- I'd rather clean toilets than work here anymore to be honest. Advice to Management Shut the company down", "rating": 1, "pros": "None none none none none", "cons": "Where do I even start... I worked at Arcadia for 6 months part time and I can confirm that it is the most hideous, demeaning, disgusting, unacceptable, atrocious and despicable place to work at.", "advice": "Shut the company down"}, {"title": "I worked at Arcadia full-time", "text": "Pros Training, career progression, learning best practive Cons High pressure, results driven, work life balance", "rating": 5, "pros": "Training, career progression, learning best practive", "cons": "High pressure, results driven, work life balance", "advice": null}, {"title": "Worst company I've ever worked for", "text": "Pros No pros to this place, some people are OK. Meh Cons Everything, terrible management understaffed just everything Advice to Management Quit", "rating": 1, "pros": "No pros to this place, some people are OK. Meh", "cons": "Everything, terrible management understaffed just everything", "advice": "Quit"}, {"title": "Avoid!!!", "text": "Pros Holiday entitlement & HR incentives. Cons Company has gone down hill for the past few years, no progression,no pay rises,no bonuses! Too much office politics! They would rather hire anyone external and pay more than hire the right person internally with business knowledge.", "rating": 1, "pros": "Holiday entitlement & HR incentives.", "cons": "Company has gone down hill for the past few years, no progression,no pay rises,no bonuses! Too much office politics! They would rather hire anyone external and pay more than hire the right person internally with business knowledge.", "advice": null}, {"title": "Fantastic place to work. Particularly within Procurement!", "text": "Pros Endless opportunities to positively improve the business. Great CEO. A good level of senior exposure. Top class perks and working environment. Awesome people and social communities. A creative and fun environment. Very commercially aware at the top. Cons A reluctance for process. Lack of delegation of authority around financial sign off. Unclear business strategies resulting in ever changing focuses. Difficult to collate information due to out of date IT systems. Bonus schemes which are never pay out :-( Advice to Management Empower your people. Clearer accountability and communication plans for all levels within the business. Seek out more control through basic process and governance. More trust and responsibility should be given to management. Implement a better bonus scheme to recognise individual performance and continue to incentivise them.", "rating": 5, "pros": "Endless opportunities to positively improve the business.", "cons": "A reluctance for process.", "advice": "Empower your people. Clearer accountability and communication plans for all levels within the business. Seek out more control through basic process and governance. More trust and responsibility should be given to management. Implement a better bonus scheme to recognise individual performance and continue to incentivise them."}, {"title": "Great for training if you can handle the pressure", "text": "Pros Training, career progression, learning best practive Cons High pressure, results driven, work life balance", "rating": 5, "pros": "Training, career progression, learning best practive", "cons": "High pressure, results driven, work life balance", "advice": null}, {"title": "prison sentence x", "text": "Pros - 25% discount off the Arcadia brands - staff sale honestly think i'm just here for the discount tbh lmao Cons lmao where to start... - pulled into meetings for the PETTIEST things - training was just having 100s of booklets given to you and you're expected to learn everything within a week before you're thrown onto the floor. - wrap/admin time? don't even bother, you'll get a call within 30 seconds to tell you to go back on calls. - recorded conversations for not adhering to your schedule. is it my fault that i had a customer screaming at me which caused me to go 5 minutes over my break? - they see you as a number, not a human. - team managers will roll their eyes when you call them for support/advice. - we're asked to do calls then eventually you get trained on emails & social but even then we still get the same low income. - the HIGHEST staff turn over. - no praise when you're achieving targets. maybe you'll get a 15 minute performance voucher now & again but when you go to use it you're not allowed as we're too busy. - stupid policies & procedures that we have to follow that does not help our situation when we want to help frustrated customers. - all staff members higher than a customer care advisor will treat you like you're their school children. - you will get marked down for literally ANYTHING on a call. - team leaders/managers can come in wearing short skirts, cleavage out, revealing clothes BUT if we wanted to come in wearing a vest top you'd get pulled up because we're \"showing too much skin\" - you're expected to come in early to compete your follow ups, unpaid of course. - got a customer shouting @ you saying they demand to speak to a manager? don't waste your breath asking your manager, they'll tell you to deal with it. - shift pattern is awful. one week you will have to work 6 days in a row. you will be mentally & physically drained by the time it comes to your day off. - coats/jackets cannot be worn. it could be -247282 degrees & they'll tell you \"it'll get warm soon\" - you're entitled to 28 days holiday but no availability to book them off. please tell your daughters, uncles, nieces, grandchildren to stay away from this place. soon as you walk through the double doors you will be hit with depression. honestly the pay is not work it, hence why i'm leaving next week. to anyone that is still serving time in prison (arcadia customer service) i pray you all make it out alive. Advice to Management advice to management? well just read my cons, hopefully you'll start treating your staff as human beings instead x", "rating": 1, "pros": "- 25% discount off the Arcadia brands", "cons": "lmao where to start...", "advice": "advice to management? well just read my cons, hopefully you'll start treating your staff as human beings instead x"}, {"title": "Finance Analyst", "text": "Pros As a Finance Analyst you get a good breadth of experience as well as the ability to move across brands through the rotation. Cons The progression can feel quite slow as you are not in charge of when you will move brands. Depending on the role by the end of the third year the work may not be challenging enough", "rating": 5, "pros": "As a Finance Analyst you get a good breadth of experience as well as the ability to move across brands through the rotation.", "cons": "The progression can feel quite slow as you are not in charge of when you will move brands. Depending on the role by the end of the third year the work may not be challenging enough", "advice": null}, {"title": "Political", "text": "Pros Good benefits package, pop up shops & extra annual leave and early finishes when there's an event. Cons It is a political minefield. Management are always looking for someone to blame rather than fixing the problems. This comes from the top down and will not be fixed any time soon. All the good employees leave, staff turnover is very high.", "rating": 1, "pros": "Good benefits package, pop up shops & extra annual leave and early finishes when there's an event.", "cons": "It is a political minefield. Management are always looking for someone to blame rather than fixing the problems. This comes from the top down and will not be fixed any time soon. All the good employees leave, staff turnover is very high.", "advice": null}, {"title": "Going the way of BHS", "text": "Pros Staff discount if it's your thing Some gems in the staff Cons IT systems are at least 20 years out of date Chronically underfunded and under invested Staff not in Head Office London are on poor wages If immediate cash benefits cannot be taken then long term decisions aren't considered Expenses are scrutinised to a completely disproportionate level Buildings crumbling Slow to respond to societal changes such as digital/tech but quick to respond to fads Advice to Management Think and plan first before taking strategic business decisions that will inevitably have adverse effects on archaic IT and logistical infrastructure.", "rating": 1, "pros": "Staff discount if it's your thing", "cons": "IT systems are at least 20 years out of date", "advice": "Think and plan first before taking strategic business decisions that will inevitably have adverse effects on archaic IT and logistical infrastructure."}, {"title": "Good solid employer", "text": "Pros Working hours, discount, remuneration, ability to have ideas heard. Cons Red tape. Sign off required at very top level, therefore slow. Advice to Management Empower senior management", "rating": 5, "pros": "Working hours, discount, remuneration, ability to have ideas heard.", "cons": "Red tape. Sign off required at very top level, therefore slow.", "advice": "Empower senior management"}, {"title": "sales", "text": "Pros very strong culture and fun place to work - lots of young and fashionable people with informal ways of working Cons can feel a bit chaotic and some of the brands not invested in as much as topshop which means stores like the one I work in are very tired Advice to Management invest in the brands that are not are trying hard and have their special place in local high streets - not just about topshop!", "rating": 5, "pros": "very strong culture and fun place to work - lots of young and fashionable people with informal ways of working", "cons": "can feel a bit chaotic and some of the brands not invested in as much as topshop which means stores like the one I work in are very tired", "advice": "invest in the brands that are not are trying hard and have their special place in local high streets - not just about topshop!"}, {"title": "Assistant", "text": "Pros Responsibility, development, team and career opportunities Cons Team management and treatment of internal team", "rating": 5, "pros": "Responsibility, development, team and career opportunities", "cons": "Team management and treatment of internal team", "advice": null}, {"title": "Very Stressful", "text": "Pros Discount is 25 % and 60% uniform allowance Cons Lots of unrealistic targets with Order In Store / E-receipts Very stressful due to payroll cuts - More work but less staff I have had my payroll cut three years in a row Definitely avoid Advice to Management Listen to the store management teams especially as they are so stressed.", "rating": 3, "pros": "Discount is 25 % and 60% uniform allowance", "cons": "Lots of unrealistic targets with Order In Store / E-receipts", "advice": "Listen to the store management teams especially as they are so stressed."}, {"title": "No progression and unsupportive management - avoid!", "text": "Pros 25% discount on clothing across all brands and access to sample sales. Overtime also available if you work in customer care which is great if you want the extra pennies. Cons I worked in Customer Care for nearly 2 years as both an advisor and analyst and both experiences had a negative impact on me mentally and emotionally. Management don't care about the wellbeing of colleagues they should have a duty of care to and there's a clear hierarchy in place with little progression. You are also poorly paid for a very demanding and challenging role. Company also doesn't care about their customers and only the wider business. Advice to Management Value your employees more and support them! Care more about your customers than the business.", "rating": 1, "pros": "25% discount on clothing across all brands and access to sample sales. Overtime also available if you work in customer care which is great if you want the extra pennies.", "cons": "I worked in Customer Care for nearly 2 years as both an advisor and analyst and both experiences had a negative impact on me mentally and emotionally.", "advice": "Value your employees more and support them! Care more about your customers than the business."}, {"title": "Looks good on CV but don't stay too long", "text": "Pros Good benefits Good Social opportunities (Christmas parties etc) Good company to have on CV Cons Not much room for progression Don't reward you for being a loyal employee - you get more money coming in from another company rather than being promoted. Never get praise for good work Advice to Management Reward loyal employee's and make them know they are doing a good job - don't just wait for the yearly appraisal or when they hand in their notice.", "rating": 3, "pros": "Good benefits", "cons": "Not much room for progression", "advice": "Reward loyal employee's and make them know they are doing a good job - don't just wait for the yearly appraisal or when they hand in their notice."}, {"title": "Not good enough", "text": "Pros I quite like the actual work I cannot find 20 pro words for this company. Sorry. Cons Mentally battered constant dismissal threats constantly told you're not good enough anxiety stress headache frustration worthless useless office humiliation Advice to Management I really quite enjoy the actual work but the army of people ripping it to bits is just too much. Constantly being told you're not good enough and your contract will be ended. Little support as after the 12 weeks probation you are expected to be as knowledgeable as people who have been there years and if you're not then you constantly get reminded that the 'they can do it' and you can't. Office humiliation as your stats are group emailed every 2hours, not daring to check emails as you have no time to read them. Pulled for a meeting for the pettiest of things like going for your break a few minutes late but returning at the correct time = record of conversation for not adhering to your schedule, serious issue, very serious, could result in being put on a report an constantly extra scrutinised for any tiny thing that you might get wrong. Put under so much pressure to be as knowledgeable because you've had the training you should know that! This is making me ill, sick with worry, deflated as I am never good enough, being told that 'the majority of your work is bad' put under the microscope, passed to another manager to see if they make the decision to end your contract. Very kind of face fits environment. Tears, stress, mentally drained. When I started there was an influx of approximately 40 trainees - there are 4 left - surely the issue is with the training... Or the unrealistic targets hammered home to you... I was asked by a manager \"do you think you're a bit slow?\" how disgusting is that!?!?! I'm on my way out because they just will not give you a break, it's very harsh. It saddens me that I am just a number. I would like to see a mental health professional in there to support the advisors, there would be a queue a mile long...", "rating": 1, "pros": "I quite like the actual work I cannot find 20 pro words for this company. Sorry.", "cons": "Mentally battered constant dismissal threats constantly told you're not good enough anxiety stress headache frustration worthless useless office humiliation", "advice": "I really quite enjoy the actual work but the army of people ripping it to bits is just too much. Constantly being told you're not good enough and your contract will be ended. Little support as after the 12 weeks probation you are expected to be as knowledgeable as people who have been there years and if you're not then you constantly get reminded that the 'they can do it' and you can't. Office humiliation as your stats are group emailed every 2hours, not daring to check emails as you have no time to read them. Pulled for a meeting for the pettiest of things like going for your break a few minutes late but returning at the correct time = record of conversation for not adhering to your schedule, serious issue, very serious, could result in being put on a report an constantly extra scrutinised for any tiny thing that you might get wrong. Put under so much pressure to be as knowledgeable because you've had the training you should know that! This is making me ill, sick with worry, deflated as I am never good enough, being told that 'the majority of your work is bad' put under the microscope, passed to another manager to see if they make the decision to end your contract. Very kind of face fits environment. Tears, stress, mentally drained. When I started there was an influx of approximately 40 trainees - there are 4 left - surely the issue is with the training... Or the unrealistic targets hammered home to you... I was asked by a manager \"do you think you're a bit slow?\" how disgusting is that!?!?!"}, {"title": "Wasteful and lack of diversity", "text": "Pros I worked for BHS while it was still part of Arcadia. The people who worked at Head Office were great and very hard working, considering everyone knew that ship was sinking. Cons Excessive sampling and waste. At factories expense. Questionable sourcing methods Stealing ideas from designers and smaller companies Asking factories to copy products from competitors rubbish salary, not much room for progression No room for creativity. Just recycling the same old ideas over and over again at the demand of senior management So much money spent on trips to New York to copy US retaillers, as well as the amount of samples bought to rip off Everyone to afraid to address the issues incase PG had a tantrum. It's no surprise that BHS couldn't handle much more. Advice to Management Don't be afraid to question the status quo and ask yourself if your part of the problem too!", "rating": 3, "pros": "I worked for BHS while it was still part of Arcadia. The people who worked at Head Office were great and very hard working, considering everyone knew that ship was sinking.", "cons": "Excessive sampling and waste. At factories expense.", "advice": "Don't be afraid to question the status quo and ask yourself if your part of the problem too!"}, {"title": "Pros and cons for London office", "text": "Pros - Staff discount and sample sales - Perks such as seasonal parties, competitions, freebies from food/drink brands - Nice offices with bar, pizza, beauty etc. - Good for the CV when moving on to a new role - Great colleagues - Never expected to work past contracted hours Cons - Management does not always encourage progression and people actively stopped - Expected to take on extra responsibilities to cover vacancies - Salary - difficult to get a pay rise even after long term commitment - Lack of pay transparency - same roles were offered different salaries Advice to Management Reward employees more, give them chance to express their views", "rating": 3, "pros": "- Staff discount and sample sales", "cons": "- Management does not always encourage progression and people actively stopped", "advice": "Reward employees more, give them chance to express their views"}, {"title": "DO NOT APPLY!!!!!!!", "text": "Pros None none none none none Cons Worked there just over a year as a customer service advisor, they are so incompetent it is unreal, no professionalism, empathy, management was the WORST. They pull u in a investigation every other day for arriving 8 seconds late. YES PEOPLE 8 SECONDS. They see you as another number and not a human. At the time I left everyone was leaving im surprised there still in business tbh. Please dont apply here if u want any sanity in your life as this place lacks morals and only lets those progress who they WANT not who is worthy. Absolute disgrace never ever will I get that year back worst time of my life!!!! Advice to Management LISTEN- JUST LISTEN to your employees and respect there needs, dont use them according to your own suitability. Disgrace of a company", "rating": 1, "pros": "None none none none none", "cons": "Worked there just over a year as a customer service advisor, they are so incompetent it is unreal, no professionalism, empathy, management was the WORST. They pull u in a investigation every other day for arriving 8 seconds late. YES PEOPLE 8 SECONDS. They see you as another number and not a human. At the time I left everyone was leaving im surprised there still in business tbh. Please dont apply here if u want any sanity in your life as this place lacks morals and only lets those progress who they WANT not who is worthy. Absolute disgrace never ever will I get that year back worst time of my life!!!!", "advice": "LISTEN- JUST LISTEN to your employees and respect there needs, dont use them according to your own suitability. Disgrace of a company"}, {"title": "As good as it gets for retail industry", "text": "Pros - 25% staff discount (even on sale!) - nice new office - amazing christmas parties - 3pm finishes in throughout july & august - 5pm finish - Sample sales and chuck out samples Cons - No room for progression, only able to move up if the structure allows it - 25% discount isn't as much as asos or river island - old fashioned in work hours, no flexi time - very old technology", "rating": 3, "pros": "- 25% staff discount (even on sale!)", "cons": "- No room for progression, only able to move up if the structure allows it", "advice": null}, {"title": "Worked at HQ", "text": "Pros Large company, structure, well established, worked with great people, treats were good Cons Some archaic processes and not forward thinking, really old technology and not given the right technology/tools to be able to do your job. Not great pay and if you start at the bottom, measly pay rises and you could be promoted to doing your last boss' job but be earning 10-20k less. Nothing happens without sign off from CEO or SPG. Advice to Management Improve technology and revise the pay structure", "rating": 3, "pros": "Large company, structure, well established, worked with great people, treats were good", "cons": "Some archaic processes and not forward thinking, really old technology and not given the right technology/tools to be able to do your job. Not great pay and if you start at the bottom, measly pay rises and you could be promoted to doing your last boss' job but be earning 10-20k less. Nothing happens without sign off from CEO or SPG.", "advice": "Improve technology and revise the pay structure"}, {"title": "Not the best place to work", "text": "Pros No pros at all Cons bad management really bad no guidance no support and no prospects im surprised i lasted a year Advice to Management get management who know what the staff are doing and care what the staff want", "rating": 1, "pros": "No pros at all", "cons": "bad management really bad no guidance no support and no prospects im surprised i lasted a year", "advice": "get management who know what the staff are doing and care what the staff want"}, {"title": "Not the place it used to be.", "text": "Pros 25% staff discount across the group, 60% off uniform purchases. Lots of responsibility and a fair amount of leeway in how you run your store. Some great people, especially in stores with looked after teams. Cons Targets are unrealistic, too much emphasis on store cards. Lack of investment in existing store estate, especially if you don't work for Topshop, leaking roofs broken aircon and heating, damp are par for the course in older stores. Progression opportunities are limited, job security is a thing of the past. Your team aren't particularly well paid, minimum wage rates are the norm and your team leaders are very badly rewarded. Advice to Management Starting actually doing something positive with the feedback from store teams, no point asking our view and then not doing anything or fobbing us off.", "rating": 3, "pros": "25% staff discount across the group, 60% off uniform purchases. Lots of responsibility and a fair amount of leeway in how you run your store. Some great people, especially in stores with looked after teams.", "cons": "Targets are unrealistic, too much emphasis on store cards. Lack of investment in existing store estate, especially if you don't work for Topshop, leaking roofs broken aircon and heating, damp are par for the course in older stores. Progression opportunities are limited, job security is a thing of the past. Your team aren't particularly well paid, minimum wage rates are the norm and your team leaders are very badly rewarded.", "advice": "Starting actually doing something positive with the feedback from store teams, no point asking our view and then not doing anything or fobbing us off."}, {"title": "Good Employer", "text": "Pros Great discount and career development. Cons There could perhaps be better flexible working.", "rating": 5, "pros": "Great discount and career development.", "cons": "There could perhaps be better flexible working.", "advice": null}, {"title": "good first job", "text": "Pros shift work whilst at school still Cons not much career progression - however this is situational", "rating": 3, "pros": "shift work whilst at school still", "cons": "not much career progression - however this is situational", "advice": null}, {"title": "Customer service advisor, Leeds", "text": "Pros * Sample Sale * Nice customer Care Advisors * Nothing really positive about arcadia * Complaining customers * And beig spoke down to like a child, if you liked high school, then you will deffo fit in here. Cons * Only room for improvement if your face fits. * Impossible targets. E.g 18 emails an hour. 350 second hold time for the week. If you don't hit the targets, your pay is not increased. * Can't be a minute late arriving to work, from lunch or going to the toilet. IF you are you will have 22p deducted off your wage, and it will go against you and probably to an investigation. *High turn over of staff, if you dont hit the targets they dont help therefore alot of people get sacked. *if your call goes on after your shift has finished, you will not be paid any extra. but if you are a minute later you then get taken into a room to be told you are taking money off the company. * You're only known as a number. *Members of management arent helpful or caring or sympathetic. * you can only book holidays a month in advance, if its not available you cant have the holiday. If you dont take your holidays through out the year, you dont get paid them. * Staff discount card is on a store card, which can affect your credit rating. * Based in harehills where people are shot and stabbed all the time. * You are charged £5 to owner a locker, if you dont have a locker you have to leave your belongings in the open cloak room to be stolen. * You only matter if you are important Advice to Management * be a bit more leniant * More sympathetic. * Don't take someone in to a 3 hour investigation for x2 minute lateness and accuse them of taking money off the company, when you don't pay employees any extra for staying after thre shift. * Get to know your staff that do all the ground work a bit more. * Show people with respect * Dont make it one rule for advisors and another rule for seniors and managagement, * look beyond people, and dont judge people because they hsvent got the latest LV bag.", "rating": 1, "pros": "* Sample Sale", "cons": "* Only room for improvement if your face fits.", "advice": "* be a bit more leniant"}, {"title": "No no no don't apply", "text": "Pros They have magazines in the break room sometimes that's about it Someone hated it so much they left some brown matter on the toilet floor if you understand what I'm trying to say Cons Awful management team managers would roll her eyes or ignore staff if they asked for help. You will never get a manager to take a call even if you have someone screaming at you. Staff are so cliquey and unfriendly It says a lot when one day they say there is an incentive for whoever has the quickest AHT and that the prize is they can leave an hour early. You'll never see people run faster out of work it's like a stampede. some staff members were told to go home when the big boss paid a visit because they didn't look smart enoughdespite wearing their normal clothes. Staff discount is a credit card so people end up in a job they hate paying it off Advice to Management Retrain team leaders and maybe do a course teaching them soft skills!", "rating": 1, "pros": "They have magazines in the break room sometimes that's about it", "cons": "Awful management team managers would roll her eyes or ignore staff if they asked for help.", "advice": "Retrain team leaders and maybe do a course teaching them soft skills!"}, {"title": "Great development and atmosphere, only frustration comes from upper levels and admin.", "text": "Pros Great people and great atmosphere. Good perks on uniform allowance and holidays. Cons Offer a 25% staff discount but only in the form of a credit card if you pass the mandatory credit application. A perk should be a perk, not a way for the company to claw money back from you through interest payments. Plus, problems with the card can be very difficult to resolve and involve lots of fruitless phone tag between NewDay and HR.", "rating": 5, "pros": "Great people and great atmosphere. Good perks on uniform allowance and holidays.", "cons": "Offer a 25% staff discount but only in the form of a credit card if you pass the mandatory credit application. A perk should be a perk, not a way for the company to claw money back from you through interest payments. Plus, problems with the card can be very difficult to resolve and involve lots of fruitless phone tag between NewDay and HR.", "advice": null}, {"title": "Creative Director", "text": "Pros Fast paced Energetic Fashion focused Team focused Detailed Passionate Fun Cons Can be a little too detailed Advice to Management Be creative Be Strong Have resilience Be People focused", "rating": 5, "pros": "Fast paced Energetic Fashion focused Team focused Detailed Passionate Fun", "cons": "Can be a little too detailed", "advice": "Be creative Be Strong Have resilience Be People focused"}, {"title": "Deputy Manager", "text": "Pros Great development programmes which set me up for success in my career. A happy place to work where I made lifelong friends Cons Product could be improved in some brands, career progression was a challenge as roles stay filled for a long time Advice to Management Continue to focus on the development of your teams and creating a positive and happy environment for them to work in", "rating": 5, "pros": "Great development programmes which set me up for success in my career. A happy place to work where I made lifelong friends", "cons": "Product could be improved in some brands, career progression was a challenge as roles stay filled for a long time", "advice": "Continue to focus on the development of your teams and creating a positive and happy environment for them to work in"}, {"title": "Fun Environment", "text": "Pros As a student summer job this was great as a lot of the other employees are in the same position as you. Working in the Flagship store we get weekly DJs and the discount is decent. Shifts are easily swappable, some managers fairly laid back. Cons Working in any retail job is hard, being in the busiest place in the UK makes it that much more tiring. If you're just there for the summer, its difficult to hold the attitude that managers expect you to have. Advice to Management Acknowledge that retail is not the epitome of every employees life and that for some it is just temporary. Provide more perks for employees reaching targets.", "rating": 5, "pros": "As a student summer job this was great as a lot of the other employees are in the same position as you. Working in the Flagship store we get weekly DJs and the discount is decent. Shifts are easily swappable, some managers fairly laid back.", "cons": "Working in any retail job is hard, being in the busiest place in the UK makes it that much more tiring. If you're just there for the summer, its difficult to hold the attitude that managers expect you to have.", "advice": "Acknowledge that retail is not the epitome of every employees life and that for some it is just temporary. Provide more perks for employees reaching targets."}, {"title": "A complete let down", "text": "Pros Nice office space to work in with a great canteen Sample sales and chuck outs Some workshops to attend Big company to work for on your CV Cons Lack of training Horrible hierarchical culture Lack of team spirit as everyone is in it for themselves, no sense of involvement Spoken too like children on a daily basis and made to feel patronised No progression or development unless you've been there for years This company is like a school Advice to Management Treat staff better and interact with subordinates rather than treating them as your slaves Allow progression based on skills and hard work instead of the time span of contract", "rating": 1, "pros": "Nice office space to work in with a great canteen", "cons": "Lack of training", "advice": "Treat staff better and interact with subordinates rather than treating them as your slaves"}, {"title": "Customer Care", "text": "Pros Work alone, sticking to own targets, friendly floor staff, help available when required. Cons Break times vary meaning you are on your breaks alone, shift work.", "rating": 5, "pros": "Work alone, sticking to own targets, friendly floor staff, help available when required.", "cons": "Break times vary meaning you are on your breaks alone, shift work.", "advice": null}, {"title": "good", "text": "Pros rewarding,travel to different sites, room to progress Cons management, working hours,location,not family friendly,", "rating": 5, "pros": "rewarding,travel to different sites, room to progress", "cons": "management, working hours,location,not family friendly,", "advice": null}, {"title": "Excellent company. Lots of self development opportunities.", "text": "Pros You can go as far as you want to take yourself with this company as they have competencies for you to work through. If the positions aren't in your branch they will look into other branches or other brands to help you advance. The give you regular uniform allowance and 25% staff discount. Cons You need to be flexible with your hours as with any retail position. You will be expected to work weekends and possibly evenings depending on your store. Advice to Management Praise your staff when they work hard. :-)", "rating": 5, "pros": "You can go as far as you want to take yourself with this company as they have competencies for you to work through. If the positions aren't in your branch they will look into other branches or other brands to help you advance. The give you regular uniform allowance and 25% staff discount.", "cons": "You need to be flexible with your hours as with any retail position. You will be expected to work weekends and possibly evenings depending on your store.", "advice": "Praise your staff when they work hard. :-)"}, {"title": "Business analyst", "text": "Pros Lots of passion in the company, people are enthusiastic and want to succeed across all functions, big projects and areas of growth in the business Cons Under resourced, can be political and is too easy to be bogged down in unnecessary process rather than simply getting things done Advice to Management Remove some of the red tape, flatten the hierarchical structure and promote a or accessible culture. Recruit more staff to ease the pressure and effect more change", "rating": 5, "pros": "Lots of passion in the company, people are enthusiastic and want to succeed across all functions, big projects and areas of growth in the business", "cons": "Under resourced, can be political and is too easy to be bogged down in unnecessary process rather than simply getting things done", "advice": "Remove some of the red tape, flatten the hierarchical structure and promote a or accessible culture. Recruit more staff to ease the pressure and effect more change"}, {"title": "Awful place to work", "text": "Pros Nice coffe room and canteen Flexible hours Staff discounts Cons False promises for career prospects Don't pay you properly especially over time hours (a number of us still chasing our pay!) Poor management of teams Too many tasks for a low wage See workers as just numbers High staff turnover Advice to Management Listen to workers and stop hiring people to use for certain periods with false promises of progressing further in the company.", "rating": 1, "pros": "Nice coffe room and canteen", "cons": "False promises for career prospects", "advice": "Listen to workers and stop hiring people to use for certain periods with false promises of progressing further in the company."}, {"title": "Worst Place Ever.", "text": "Pros Staff Discount which you can only get by taking out credit with them. Cons Work environment No progression Horrible passive/aggressive management. Advice to Management Treat staff with resepect so there wouldn't be such a high staff turnover.", "rating": 1, "pros": "Staff Discount which you can only get by taking out credit with them.", "cons": "Work environment", "advice": "Treat staff with resepect so there wouldn't be such a high staff turnover."}, {"title": "I wouldn't go back", "text": "Pros Size of company, people, office ,CV Cons salary and job prospects management", "rating": 3, "pros": "Size of company, people, office ,CV", "cons": "salary and job prospects", "advice": null}, {"title": "challenging", "text": "Pros good benefits, opportunities exist Cons very political with long serving staff making change slow", "rating": 3, "pros": "good benefits, opportunities exist", "cons": "very political with long serving staff making change slow", "advice": null}, {"title": "Poor Wages. Awful Working Enviroment", "text": "Pros High level of professionalism and dedication among management and directors. Cons Extremely poor wages - completely out of touch with reality of today's UK and London cost of living (hence the high employee turnover). Toxic working atmosphere. Lack of 'real' benefits for an organization of its size.", "rating": 3, "pros": "High level of professionalism and dedication among management and directors.", "cons": "Extremely poor wages - completely out of touch with reality of today's UK and London cost of living (hence the high employee turnover). Toxic working atmosphere. Lack of 'real' benefits for an organization of its size.", "advice": null}, {"title": "Assistant", "text": "Pros Nice HR team and a reasonable head office to work in, good sample sales and discount across all brands inc Topman and Topshop. Good staff benefits Cons No one happy to help you, everyone just gets on with their own work, no real team work going on, tall hierarchical structure, hard to move up and progress - takes a few years to get anywhere decent. Everyone's scared of the management. Advice to Management Be nicer to staff and less intimidating. More room for growth for staff and spend more on training. Update the 90's IT systems", "rating": 3, "pros": "Nice HR team and a reasonable head office to work in, good sample sales and discount across all brands inc Topman and Topshop. Good staff benefits", "cons": "No one happy to help you, everyone just gets on with their own work, no real team work going on, tall hierarchical structure, hard to move up and progress - takes a few years to get anywhere decent. Everyone's scared of the management.", "advice": "Be nicer to staff and less intimidating. More room for growth for staff and spend more on training. Update the 90's IT systems"}, {"title": "Chaotic", "text": "Pros Great brands, friendly, sociable, especially menswear brand Burton. Good opportunities to learn different aspects of the business not just limited to your role. Cons Burton: chaotic! Management has everyone running around trying to get things done. Lacks structure and organisation. Meetings never start on time, no respect for other people's time or workload. High turnover, little reward for work done Advice to Management Organise. Prioritise. Make sure the infrastructure works before trying to do everything. Don't arrange meetings unless you can stick to them. Invite everyone you want to attend and question if they are not present. Value your employees", "rating": 3, "pros": "Great brands, friendly, sociable, especially menswear brand Burton. Good opportunities to learn different aspects of the business not just limited to your role.", "cons": "Burton: chaotic! Management has everyone running around trying to get things done. Lacks structure and organisation. Meetings never start on time, no respect for other people's time or workload. High turnover, little reward for work done", "advice": "Organise. Prioritise. Make sure the infrastructure works before trying to do everything. Don't arrange meetings unless you can stick to them. Invite everyone you want to attend and question if they are not present. Value your employees"}, {"title": "Good for part-time work alongside studying", "text": "Pros The pay is fair compared to other retailers. Good staff discount across all of the Arcadia brands and good management (where I work). Its a good job to have whilst studying as there are contracts available that are just for weekends. Cons The pressure that the company puts the staff under to achieve a certain number of store cards every week. As well as this, staff are made to pester customers by asking them for their email and to fill in store feedback surveys. No incentives or bonuses for opening up store cards either. Advice to Management Start awarding your hard-working staff that open up store cards.", "rating": 5, "pros": "The pay is fair compared to other retailers. Good staff discount across all of the Arcadia brands and good management (where I work). Its a good job to have whilst studying as there are contracts available that are just for weekends.", "cons": "The pressure that the company puts the staff under to achieve a certain number of store cards every week. As well as this, staff are made to pester customers by asking them for their email and to fill in store feedback surveys. No incentives or bonuses for opening up store cards either.", "advice": "Start awarding your hard-working staff that open up store cards."}, {"title": "impersonnal", "text": "Pros Great for acquiring business acumen. As its a multi channel business it affords you many opportunities to work in other brands Cons Impersonal - you're just a number. Hard work and very ask orientated as opposed to customer service", "rating": 3, "pros": "Great for acquiring business acumen. As its a multi channel business it affords you many opportunities to work in other brands", "cons": "Impersonal - you're just a number. Hard work and very ask orientated as opposed to customer service", "advice": null}, {"title": "Great place to start your career", "text": "Pros Career progression was very-well structured and it was easy enough to progress. 25% discount off all brands and regular sample sales. Cons Could be a bit cut-throat, more about whether your face fits than whether you are any good at your job. Lots of favouritism Advice to Management Look after staff - more focus on wellbeing and work / life balance.", "rating": 3, "pros": "Career progression was very-well structured and it was easy enough to progress. 25% discount off all brands and regular sample sales.", "cons": "Could be a bit cut-throat, more about whether your face fits than whether you are any good at your job. Lots of favouritism", "advice": "Look after staff - more focus on wellbeing and work / life balance."}, {"title": "OK", "text": "Pros Fairly laid back, good graduate scheme, sample sales, looks great on CV, pay for qualifcation Dscount feels a bit stingey but sample sales make up for it New Head office is great Cons Money is acceptable as a graduate, but then fails to keep up with market rate Havng a good experience depends heavily on the team you are part of", "rating": 5, "pros": "Fairly laid back, good graduate scheme, sample sales, looks great on CV, pay for qualifcation", "cons": "Money is acceptable as a graduate, but then fails to keep up with market rate", "advice": null}, {"title": "so far", "text": "Pros Cool workplace, lots of perks, friendly and helpful colleagues, fast paced environment, training provided on the job and outside of the job Cons I have no downsides, it does get very busy and the workload is a lot but it's challenging, everyday is different and exciting Advice to Management Communication is key, ensure new starters receive proper training, not much else to comment on", "rating": 5, "pros": "Cool workplace, lots of perks, friendly and helpful colleagues, fast paced environment, training provided on the job and outside of the job", "cons": "I have no downsides, it does get very busy and the workload is a lot but it's challenging, everyday is different and exciting", "advice": "Communication is key, ensure new starters receive proper training, not much else to comment on"}, {"title": "Life at Arcadia", "text": "Pros Nice early Friday finishes in summer Cons Management out of touch with employees. Alot of favoritism, one rule for one and another for someone else Advice to Management Look after your hard working staff and recognize the contribution that they are making to the company", "rating": 3, "pros": "Nice early Friday finishes in summer", "cons": "Management out of touch with employees. Alot of favoritism, one rule for one and another for someone else", "advice": "Look after your hard working staff and recognize the contribution that they are making to the company"}, {"title": "Worser Politics than a US Election", "text": "Pros 25% Discount to Arcadia Brands Cons - Management are involved in such a high level of political games with teams and upper mgmt and directors. They are great at building walls - HUGE walls to keep people from communicating with each other - No communication - Outdated technology across the IT department - Takes months to get any type of request approved - Head office near Oxf Circus is a total dump, like from the 70's. Kitchen smells like someone died in it - their solution: put an air freshener in the kitchen. - No cutlery or fruit or any type of offerings for you to eat - Seriously Under resourced - people leave every week - The average turnaround of staff is like a month once they realise how bad it is - 200 people, 1 meeting room. And that meeting room can only be booked by a writing in a book (No digital booking through outlook - Are we in the 80's?) - No laptops for flexible working Advice to Management Replace yourselves with better people", "rating": 1, "pros": "25% Discount to Arcadia Brands", "cons": "- Management are involved in such a high level of political games with teams and upper mgmt and directors. They are great at building walls - HUGE walls to keep people from communicating with each other", "advice": "Replace yourselves with better people"}, {"title": "Merchandising", "text": "Pros Good hours and staff discount. Offices centrally located. Cons Uninspiring leadership, too many restrictive processes - no room for innovation Advice to Management Ditch PG", "rating": 3, "pros": "Good hours and staff discount. Offices centrally located.", "cons": "Uninspiring leadership, too many restrictive processes - no room for innovation", "advice": "Ditch PG"}, {"title": "Topman & Topshop Delivery representative", "text": "Pros great like minded team members relaxed and flexible work environment with lots of leisure's large work package of incentives - discounts, uniform etc training all the way progression schedule Cons can take a while to hear back from head office about authorising returns or verification or annual reports etc from second hand feedback from management ordering stationery and vinyls could be made easier the store I was in needed more space or a lift to the upper floor staff area as took a large chunk out of the processing time to get all the palets upstairs by carrying them across the shop floor whilst open and up narrow staircases which was strenuous and made extremely hot as had to be in top fashion wear as was being seen on shop floor, also had to keep the stock room door which lead straight into the staff lunch lounge open at all times which became disturbing for other employees sometimes. Tills would sometimes lock out", "rating": 5, "pros": "great like minded team members", "cons": "can take a while to hear back from head office about authorising returns or verification or annual reports etc from second hand feedback from management", "advice": null}, {"title": "Ok", "text": "Pros Good promotion and training opportunities Cons Salary isn't very high unfortunately Advice to Management Increase salary", "rating": 3, "pros": "Good promotion and training opportunities", "cons": "Salary isn't very high unfortunately", "advice": "Increase salary"}, {"title": "clerk", "text": "Pros access is near my place Cons very low paying job and poor management", "rating": 3, "pros": "access is near my place", "cons": "very low paying job and poor management", "advice": null}, {"title": "Rubbish senior management at head office", "text": "Pros Paid well for the role. Nice easy 9-5. No huge amount of pressure of get things done as long as it does not take months. Cons Since new senior management came last summer within IT there has been a downward spiral of morale. A lot of experienced people have left in one year, senior management are not bothered about existing IT team they have in place just the new team they are building. Senior management just give lies after lies when questioned. Advice to Management Learn to treat all employees equally and allow them to have proper training", "rating": 1, "pros": "Paid well for the role. Nice easy 9-5. No huge amount of pressure of get things done as long as it does not take months.", "cons": "Since new senior management came last summer within IT there has been a downward spiral of morale. A lot of experienced people have left in one year, senior management are not bothered about existing IT team they have in place just the new team they are building. Senior management just give lies after lies when questioned.", "advice": "Learn to treat all employees equally and allow them to have proper training"}, {"title": "Acadia baa", "text": "Pros A great to enter retail world: once in Arcadia you can work anywhere Cons no progression, really hard to get to next level people stay stuck in levels for years without promotion Advice to Management promote people and they will stay and on longer at the company and be more loyal", "rating": 3, "pros": "A great to enter retail world: once in Arcadia you can work anywhere", "cons": "no progression, really hard to get to next level people stay stuck in levels for years without promotion", "advice": "promote people and they will stay and on longer at the company and be more loyal"}, {"title": "Sales Associate", "text": "Pros -Flexible hours -Easy to dodge work Cons -Very corporate environement -More concerned with selling credit cards than any shop floor merch. Advice to Management Stop trying to get people into debt...", "rating": 3, "pros": "-Flexible hours", "cons": "-Very corporate environement", "advice": "Stop trying to get people into debt..."}, {"title": "Senior Sales Assistant", "text": "Pros arcadia is a well organised company with great admiration for their staff Cons little room to move up within the company due to not wishing to give the staff a pay rise", "rating": 5, "pros": "arcadia is a well organised company with great admiration for their staff", "cons": "little room to move up within the company due to not wishing to give the staff a pay rise", "advice": null}, {"title": "Sales Assistant role", "text": "Pros - understanding with university work - Salary raised abit each year after review Cons - no room for growth in my job role Advice to Management more training and opportunities for employees", "rating": 5, "pros": "- understanding with university work", "cons": "- no room for growth in my job role", "advice": "more training and opportunities for employees"}, {"title": "It was okay", "text": "Pros chance to work up the company great work enviroment apart from senior management, the people are great and often help each other with their tasks Cons horrible company to work for managers are often rude and disrespectful you are expected to do more than your specific job role Advice to Management Better senior team is needed in order to stop disrespectful behaviour. Stop expecting employees to carry out tasks that are beyond their specific job roles.", "rating": 3, "pros": "chance to work up the company", "cons": "horrible company to work for", "advice": "Better senior team is needed in order to stop disrespectful behaviour."}, {"title": "Customer Care", "text": "Pros Good experience within fashion industry Cons Poor management style and unhelpful", "rating": 3, "pros": "Good experience within fashion industry", "cons": "Poor management style and unhelpful", "advice": null}, {"title": "Group", "text": "Pros Great working environment, fun people to work with, amazing sample sales and benefits Cons No flexible working, sometimes long hours, Advice to Management Flexible working!", "rating": 5, "pros": "Great working environment, fun people to work with, amazing sample sales and benefits", "cons": "No flexible working, sometimes long hours,", "advice": "Flexible working!"}, {"title": "No appreciation for my of the staff", "text": "Pros Over time at a higher rate. Other then this there are no positives to working for Arcadia. If you are looking for experience it's ok. Cons They do not give you the pay increases even when you are meeting all your targets. Consistently pull you up for minor things such as being 1 minute over on break. Never praise staff only reprimand. Advice to Management Treat your staff like humans and with at least some decency.", "rating": 1, "pros": "Over time at a higher rate. Other then this there are no positives to working for Arcadia. If you are looking for experience it's ok.", "cons": "They do not give you the pay increases even when you are meeting all your targets.", "advice": "Treat your staff like humans and with at least some decency."}, {"title": "ARCADIA HEAD OFFICE", "text": "Pros Great name to have on your CV. Good discount at all Brands Cons No bonus No pay rises No support Advice to Management Look after your staff more and they will be more positive and therefore more productive", "rating": 3, "pros": "Great name to have on your CV.", "cons": "No bonus", "advice": "Look after your staff more and they will be more positive and therefore more productive"}, {"title": "Great Benefits", "text": "Pros Really good pay for a part time job, the benefits are great; discount, early finishes in the summer, time off at Christmas for shopping! Cons the office site in Leeds is in serious need of refurb", "rating": 5, "pros": "Really good pay for a part time job, the benefits are great; discount, early finishes in the summer, time off at Christmas for shopping!", "cons": "the office site in Leeds is in serious need of refurb", "advice": null}, {"title": "Sales Assistant", "text": "Pros Room for progression within company, was able to move around to different stores Cons Management favours people, not telling you when they changed your shifts,", "rating": 3, "pros": "Room for progression within company, was able to move around to different stores", "cons": "Management favours people, not telling you when they changed your shifts,", "advice": null}, {"title": "Low staff morale, little progression", "text": "Pros Good sample sales, subsidised canteen Cons Unfriendly work environment, ruthless management, lack of progression and insufficient training. Advice to Management Value your staff more", "rating": 1, "pros": "Good sample sales, subsidised canteen", "cons": "Unfriendly work environment, ruthless management, lack of progression and insufficient training.", "advice": "Value your staff more"}, {"title": "Contact Centre - Average at best", "text": "Pros There are few pros to the job, however the general working atmosphere between the \"normal staff\" is good, There are some managers who are very good and very knowledgeable and will do whatever they can to help, but they are few and far between. Staff discount on all arcadia brands is also very helpful. Christmas party is great, and social events outside of work are always good (albeit planned privately and not by the business as a whole) Cons Low salary Management delegate majority of tasks Majority of support is obtained from other advisors, rather than management Treated like schoolchildren Little recognition for good work Unrealistic targets The limited progression that is available is geared more towards those who are liked, rather than those suitable for the role Some of the staff higher up than a frontline advisor appear to have a bit of a 'god complex' and act as though they are superior and can be very hypocritical Admin time? Forget about it! Disciplinaries/record of conversations handed out for menial things Management have a very 'clique' and 'stick together' attitude Poor planning for potential business problems Ridiculous policies and procedures restrict the ability to help frustrated customers Even though the company turned a profit on a whole, no annual bonus was given to the staff last year. Advice to Management Listen to the frontline staff, and offer more opportunities. Stop hiding behind red tape and 'policy'", "rating": 3, "pros": "There are few pros to the job, however the general working atmosphere between the \"normal staff\" is good, There are some managers who are very good and very knowledgeable and will do whatever they can to help, but they are few and far between. Staff discount on all arcadia brands is also very helpful. Christmas party is great, and social events outside of work are always good (albeit planned privately and not by the business as a whole)", "cons": "Low salary", "advice": "Listen to the frontline staff, and offer more opportunities. Stop hiding behind red tape and 'policy'"}, {"title": "Good Company", "text": "Pros Relaxed atmosphere, flexi time and offers benefits. Good discount and study support schemes as well as staff sales. Good chances for progression Cons Poor pay, office politics, old systems, business structure is still from the 90's. Lack of investment in staff development and lack of direction. Advice to Management Invest more in loyal staff", "rating": 3, "pros": "Relaxed atmosphere, flexi time and offers benefits. Good discount and study support schemes as well as staff sales. Good chances for progression", "cons": "Poor pay, office politics, old systems, business structure is still from the 90's. Lack of investment in staff development and lack of direction.", "advice": "Invest more in loyal staff"}, {"title": "Great training, good company to start career", "text": "Pros Great training, fast paced, proactive and fun Christmas party. The company has a clear check list of what is required to make the next promotion, albeit very rigid. Cons Office politics, lack of diversity, under staffed (aside from the HR department). The company is supposed to have scholastic requirements however many employees have very little academic achievements.", "rating": 3, "pros": "Great training, fast paced, proactive and fun Christmas party.", "cons": "Office politics, lack of diversity, under staffed (aside from the HR department). The company is supposed to have scholastic requirements however many employees have very little academic achievements.", "advice": null}, {"title": "IMMATURE", "text": "Pros GREAT LOCATION, GREAT BRAND, GREAT PEOPLE Cons immature - no capability, stuck looking backwards", "rating": 3, "pros": "GREAT LOCATION, GREAT BRAND, GREAT PEOPLE", "cons": "immature - no capability, stuck looking backwards", "advice": null}, {"title": "Great learning", "text": "Pros huge amount of training and opportunities for development. The induction program ensures that everyone is up to date on company history and brand awareness, as well as training on the technical side of the job. Very fast-paced and a good place to throw yourself in the deep end as a graduate Cons A lot of office politics. As a large company, the hierarchy is quite strict and there are time restrictions on when you can get promoted, which means that you can be left feeling short changed a lot of the time as you end up doing a job a level higher for over a year without getting paid for it", "rating": 3, "pros": "huge amount of training and opportunities for development. The induction program ensures that everyone is up to date on company history and brand awareness, as well as training on the technical side of the job. Very fast-paced and a good place to throw yourself in the deep end as a graduate", "cons": "A lot of office politics. As a large company, the hierarchy is quite strict and there are time restrictions on when you can get promoted, which means that you can be left feeling short changed a lot of the time as you end up doing a job a level higher for over a year without getting paid for it", "advice": null}, {"title": "Good Company", "text": "Pros Great Team, good perks, working hours Cons Management decisions not always reasonable, slow processes", "rating": 3, "pros": "Great Team, good perks, working hours", "cons": "Management decisions not always reasonable, slow processes", "advice": null}, {"title": "Maa", "text": "Pros Work life balance is great Cons There are currently no cons", "rating": 5, "pros": "Work life balance is great", "cons": "There are currently no cons", "advice": null}, {"title": "For those with no ambition", "text": "Pros If you really lazy you can get away with doing nothing. Cons Poor wages, outdated offices, lots of incompetent and idle colleagues.", "rating": 3, "pros": "If you really lazy you can get away with doing nothing.", "cons": "Poor wages, outdated offices, lots of incompetent and idle colleagues.", "advice": null}, {"title": "Sales Advisor", "text": "Pros 25% staff discount in all Arcadia stores Cons Extra work not rewarded Under performing staff members not reprimanded Advice to Management Hire more experienced staff", "rating": 3, "pros": "25% staff discount in all Arcadia stores", "cons": "Extra work not rewarded", "advice": "Hire more experienced staff"}, {"title": "Customer Care", "text": "Pros Some advisors are friendly, and you get 25% staff discount, pretty much it Cons All you get in the calls are missing parcels and customers having difficulties requesting returns due to store not changing the parcel status - pretty much 90% of calls consist of these sort of queries. Management is poor; some of the team managers act like they're prestigious just because they're higher in the hierarchy than you when really all they do is sit on support line and to be quite honest, they don't even help and support because if you ever call through they always tell you to 'refer to the manual' instead of actually trying to help and 'support' you, as that is what 'support line' is for and make you sit there flipping through the manual while the customer is on hold for 10 minutes when it would've been much easier if they'd just give a direct answer. Also, managers leave it all down to the advisors, they sit there and tell us what to do when all they're bothered about is themselves and how their team looks; when the AHT is poor, they will blame the advisors and when the AHT is good they take credit for it. The atmosphere just seems dead most of the time, you can just see the look on advisors' faces waiting for it to be time to go home. Also think the training doesn't give you enough clarity on the policies of the company; you literally have 2 weeks of training then you're thrown onto the floor with the 10000 manuals you were expected to digest information from in the space of 2 weeks. Even if your shift started at 9 o'clock, you need to get there about 30 mins early just to get everything started up on the slow systems which frequently creates errors. You're also told to keep checking your emails for any kind of updates but NEVER have the time because you need to be on calls straight away; you literally have about 10 seconds between the end of a call and the next call that's about to come through. Advice to Management Try being fairer with your advisors and treat them as your fellow colleagues not servants, also should provide more support to advisors that need it, and you need to better the training honestly", "rating": 3, "pros": "Some advisors are friendly, and you get 25% staff discount, pretty much it", "cons": "All you get in the calls are missing parcels and customers having difficulties requesting returns due to store not changing the parcel status - pretty much 90% of calls consist of these sort of queries. Management is poor; some of the team managers act like they're prestigious just because they're higher in the hierarchy than you when really all they do is sit on support line and to be quite honest, they don't even help and support because if you ever call through they always tell you to 'refer to the manual' instead of actually trying to help and 'support' you, as that is what 'support line' is for and make you sit there flipping through the manual while the customer is on hold for 10 minutes when it would've been much easier if they'd just give a direct answer. Also, managers leave it all down to the advisors, they sit there and tell us what to do when all they're bothered about is themselves and how their team looks; when the AHT is poor, they will blame the advisors and when the AHT is good they take credit for it. The atmosphere just seems dead most of the time, you can just see the look on advisors' faces waiting for it to be time to go home. Also think the training doesn't give you enough clarity on the policies of the company; you literally have 2 weeks of training then you're thrown onto the floor with the 10000 manuals you were expected to digest information from in the space of 2 weeks. Even if your shift started at 9 o'clock, you need to get there about 30 mins early just to get everything started up on the slow systems which frequently creates errors. You're also told to keep checking your emails for any kind of updates but NEVER have the time because you need to be on calls straight away; you literally have about 10 seconds between the end of a call and the next call that's about to come through.", "advice": "Try being fairer with your advisors and treat them as your fellow colleagues not servants, also should provide more support to advisors that need it, and you need to better the training honestly"}, {"title": "Arcadia Merchandising Intern", "text": "Pros senior employees very happy to offer assistance and guidance First-hand experience during client meetings and opportunities to offer own opinion and make meaningful impact on products Cons A fair amount of time is committed to sorting out and filing stock Advice to Management provide a wider range of opportunities and greater responsibility", "rating": 5, "pros": "senior employees very happy to offer assistance and guidance", "cons": "A fair amount of time is committed to sorting out and filing stock", "advice": "provide a wider range of opportunities and greater responsibility"}, {"title": "Apathetic Outlook", "text": "Pros Staff Discount 25% off all brand - on top of sale items as well Season ticket loan great central london location Cons Not very sociable - no canteen for lunch have to eat whilst working at desk very low salary for a graduate position Very repetitive work - no variation Very bad training, you were taught awkwardly in classroom lessons which didnt translate to the on the job work you needed to do Advice to Management make sure line managers invest time in the graduate employees - my line manager basically ignored me completely. Improve training, have more team social events.", "rating": 3, "pros": "Staff Discount 25% off all brand - on top of sale items as well", "cons": "Not very sociable - no canteen for lunch have to eat whilst working at desk", "advice": "make sure line managers invest time in the graduate employees - my line manager basically ignored me completely. Improve training, have more team social events."}, {"title": "Sales Assistant", "text": "Pros There are good staff discounts across the company, and the company have connections where you can use the staff card in. Good staff partys. Cons As it is a big company, I have found that some managers only look out for themselves and do not really have you (part time employees) in their best interest and will only help if they benefit from it or if have a strong incentive. Would personally not like to do retail long-term.", "rating": 3, "pros": "There are good staff discounts across the company, and the company have connections where you can use the staff card in. Good staff partys.", "cons": "As it is a big company, I have found that some managers only look out for themselves and do not really have you (part time employees) in their best interest and will only help if they benefit from it or if have a strong incentive. Would personally not like to do retail long-term.", "advice": null}, {"title": "Good", "text": "Pros Co-workers were friendly and helpful. Cons Lower levels weren't given roles of any responsibility, so job could get tedious. Advice to Management Delegate more work and responsibility to staff. You do not have to keep responsibilities just to justify your title.", "rating": 3, "pros": "Co-workers were friendly and helpful.", "cons": "Lower levels weren't given roles of any responsibility, so job could get tedious.", "advice": "Delegate more work and responsibility to staff. You do not have to keep responsibilities just to justify your title."}, {"title": "Good work environment", "text": "Pros Dynamic place to work. There is always work to be found. It's a good place to work. Happy with it. Cons The night shifts can be a bit toilsome but other than that it's fine. Advice to Management none. It's all fine with me, No problems with the store management.", "rating": 3, "pros": "Dynamic place to work. There is always work to be found. It's a good place to work. Happy with it.", "cons": "The night shifts can be a bit toilsome but other than that it's fine.", "advice": "none. It's all fine with me, No problems with the store management."}, {"title": "Great atmosphere", "text": "Pros Great place to meet people Good for network Great if single Cons none so far . . . . .", "rating": 5, "pros": "Great place to meet people", "cons": "none so far . . . . .", "advice": null}, {"title": "Shoddy management", "text": "Pros Having a job, not much more to say. Maybe the sample sales and discount but I did not use either of them. Cons Lack of management Lack of support. I did not meet my manager or team for 3 weeks due to different shift patterns and sat on my own without any support or acknowledgement from ANYONE for the whole time. Very isolating job Advice to Management Work on your training - one week of a lot of pointless talking and slides/paperwork then a week on the phones is not the best way for everyone to learn. Too much info and not enough support. We lost 3 people during that first week. Also, make a point of introducing new starters to their teams instead of just sending them in Monday morning without a face to look out for. Very unnerving.", "rating": 3, "pros": "Having a job, not much more to say. Maybe the sample sales and discount but I did not use either of them.", "cons": "Lack of management", "advice": "Work on your training - one week of a lot of pointless talking and slides/paperwork then a week on the phones is not the best way for everyone to learn. Too much info and not enough support. We lost 3 people during that first week."}, {"title": "Good for a first step", "text": "Pros Good place to start your career or as a part time job Cons Benefits aren't great, no company bonuses for retail workers", "rating": 3, "pros": "Good place to start your career or as a part time job", "cons": "Benefits aren't great, no company bonuses for retail workers", "advice": null}, {"title": "STAY AWAY FROM CUSTOMER CARE", "text": "Pros None for me staff were friendly warm building friendly trainers you get a 25% discount of clothes and staff sale although Cons Poor training loads of system to learn given no time at all to learn them basically your taking complaints from people who have not had there parcels delivered 9 out of 10 calls is complaint not worth the very poor wages Advice to Management You got a very long way to go better longer training on your 20+ systems", "rating": 1, "pros": "None for me staff were friendly warm building friendly trainers you get a 25% discount of clothes and staff sale although", "cons": "Poor training loads of system to learn given no time at all to learn them basically your taking complaints from people who have not had there parcels delivered 9 out of 10 calls is complaint not worth the very poor wages", "advice": "You got a very long way to go better longer training on your 20+ systems"}, {"title": "Head Office Employee", "text": "Pros 25% discount across all brands. High-profile employer so looks good on your CV Cons The culture is to work you as hard as possible by telling you that you need to work harder & go 'above and beyond' but without paying you overtime. Will be in the bad books if you actually leave on time. They create the illusion that you can work up the company by getting promotions but this is rare when you start at the bottom. Advice to Management Focus more on the happiness of employees to reduce employee turnovers & give decent payrises!", "rating": 3, "pros": "25% discount across all brands. High-profile employer so looks good on your CV", "cons": "The culture is to work you as hard as possible by telling you that you need to work harder & go 'above and beyond' but without paying you overtime. Will be in the bad books if you actually leave on time. They create the illusion that you can work up the company by getting promotions but this is rare when you start at the bottom.", "advice": "Focus more on the happiness of employees to reduce employee turnovers & give decent payrises!"}, {"title": "Customer Care Advisor", "text": "Pros £1000 allowance for unsociable shift patterns (not worth it in my opinion). Cons Badly managed work place, poor salary. Not a fulfilling role, but I suppose that's the nature of call centre work?", "rating": 1, "pros": "£1000 allowance for unsociable shift patterns (not worth it in my opinion).", "cons": "Badly managed work place, poor salary. Not a fulfilling role, but I suppose that's the nature of call centre work?", "advice": null}, {"title": "Bad management", "text": "Pros 25% staff discount Good progression courses Cons Not an enjoyable place to work at all! Store Management teams are weak, lazy, have authority issues and will have meetings about having meetings. Labour turnover is insanely high because of bad management, meaning that a lot of time and money is wasted on training new individuals. You should make friends with the right people if you want to progress, but don't expect a pay rise, they are doing you a favour by promoting you. Advice to Management Quite often, in retail, the main demographic of your staff will be 16-24 year old students. Allow for a bit of flexibility in schedules and encourage a rewarding culture.", "rating": 3, "pros": "25% staff discount", "cons": "Not an enjoyable place to work at all!", "advice": "Quite often, in retail, the main demographic of your staff will be 16-24 year old students. Allow for a bit of flexibility in schedules and encourage a rewarding culture."}, {"title": "Soulless Customer Care in Leeds", "text": "Pros They offer 20 to 25% discounts in their stores. Fine if you are a fashion victim or a total moron who can't stop buying clothes. Otherwise the perk is pretty meaningless. Cons The training was two weeks long. Consisted of a weeks death by PowerPoint and the issue of about 12 print outs of each presentation. You were expected to lug this encyclopaedia around when you joined your team to refer to. There was then a weeks supervised live work on their system where you were instantly pitted against fellow trainees by the trainers monitoring your work load, & chalking it up on a white board, I kid you not. Most of the work consisted with dealing with missing parcels, either by phone or email. Take note here, you are expected to deal with 18 emails an hour when you end your so called \"training\" To give you an example of the quality of the management, Arcadia have a system for dealing with their gift cards called Chopin, the trainers called it \"Chopping\" atom splitters they are not. How ironic that a once iconic Leeds factory now houses cheap clothing manufactured in China and India. It is within this factory Arcadia have set up their Customer Care centre, a white painted, soulless gaol where everyone is either praying for home time or desperate for another job. Advice to Management Earn your salary, set up a worthwhile training program. Put some windows in.", "rating": 1, "pros": "They offer 20 to 25% discounts in their stores. Fine if you are a fashion victim or a total moron who can't stop buying clothes. Otherwise the perk is pretty meaningless.", "cons": "The training was two weeks long. Consisted of a weeks death by PowerPoint and the issue of about 12 print outs of each presentation. You were expected to lug this encyclopaedia around when you joined your team to refer to. There was then a weeks supervised live work on their system where you were instantly pitted against fellow trainees by the trainers monitoring your work load, & chalking it up on a white board, I kid you not.", "advice": "Earn your salary, set up a worthwhile training program. Put some windows in."}, {"title": "Intern, Arcadia", "text": "Pros Was given the opportunity to learn more about the department I was in and how complicated making changes and addressing issues in a company that size can be. Cons Weird strict corporate dress code, very impersonal, very corporate, not a collaborative culture, and everything is driven by the bottom line.", "rating": 3, "pros": "Was given the opportunity to learn more about the department I was in and how complicated making changes and addressing issues in a company that size can be.", "cons": "Weird strict corporate dress code, very impersonal, very corporate, not a collaborative culture, and everything is driven by the bottom line.", "advice": null}, {"title": "Not Bad...", "text": "Pros 25% Staff discount across the brands Pension plan Loads of great people Established company, helps with progression with other companies Cons Lack of real training, more learn as you go No real development opportunities", "rating": 3, "pros": "25% Staff discount across the brands", "cons": "Lack of real training, more learn as you go", "advice": null}, {"title": "Great company", "text": "Pros Friendly work place, excellent training. Very social atmosphere and high levels of interaction with management quite early on. No two days the same. Cons High pressure environment. Very deadline orientated and the level progression system can slow development down but also is good to know where you are versus others on the floor. Advice to Management Keep it up", "rating": 5, "pros": "Friendly work place, excellent training. Very social atmosphere and high levels of interaction with management quite early on. No two days the same.", "cons": "High pressure environment. Very deadline orientated and the level progression system can slow development down but also is good to know where you are versus others on the floor.", "advice": "Keep it up"}, {"title": "Sales Advisor", "text": "Pros Opportunity for staff discount in Topshop Dorothy Perkins Wallis Burton and Topman etc. Reputation of the company in UK Some fantastic co-workers Shifts were okay generally in length Good salary (hourly) for a student Cons Unachievable targets for store card sign ups, disciplinary actions if not reached. Unpleasant to see that some peoples CV's were discarded if they \"didn't look the part\". Constant pushing for email captures. Manager didn't even know my name and just quite rude in general. Rotas always up last minute. Staff discount card is actually a credit card, which is unlucky if you're a student working part time. No thanks ever received Advice to Management Sort the store managers out - they do not make you feel good about the hard work some people do put in Training of staff also needs to be addressed rather than being thrown in at the deep end! Recognise people who actually work hard. Easing of pressure with store cards and email captures", "rating": 3, "pros": "Opportunity for staff discount in Topshop Dorothy Perkins Wallis Burton and Topman etc.", "cons": "Unachievable targets for store card sign ups, disciplinary actions if not reached.", "advice": "Sort the store managers out - they do not make you feel good about the hard work some people do put in"}, {"title": "Sales Advisor", "text": "Pros 25% discount on topshop, wallis, topman, dorothy perkins and burton. 20% discount bhs. Uniform allowance, 60% of uniform up to your allowance depending on how high your salary is. Cons There's never any overtime. Pushed to do email captures. If you don't get enough email captures you have to have disciplinary action. Management in my area were two faced. A lot of pressure on finger spacing sometimes forcing you to stay beyond your finishing time. Advice to Management Change a lot.", "rating": 3, "pros": "25% discount on topshop, wallis, topman, dorothy perkins and burton. 20% discount bhs. Uniform allowance, 60% of uniform up to your allowance depending on how high your salary is.", "cons": "There's never any overtime. Pushed to do email captures. If you don't get enough email captures you have to have disciplinary action. Management in my area were two faced. A lot of pressure on finger spacing sometimes forcing you to stay beyond your finishing time.", "advice": "Change a lot."}, {"title": "Don't even apply", "text": "Pros 3pm finish on Fridays throughout July and August Discount Cons A very bizarre company culture; 'raising your profile' includes of sucking up to anyone and everyone No training is given; you are thrown in the deep end and expected to understand Advice to Management I hope with all the financial difficulties bhs is in they restructure top level management", "rating": 1, "pros": "3pm finish on Fridays throughout July and August", "cons": "A very bizarre company culture; 'raising your profile' includes of sucking up to anyone and everyone", "advice": "I hope with all the financial difficulties bhs is in they restructure top level management"}, {"title": "Sales Assistant", "text": "Pros Consistent hours, good pay, good opportunities to grow even for part-time workers. Cons Management can be ruthless when considering holidays, sick days.", "rating": 5, "pros": "Consistent hours, good pay, good opportunities to grow even for part-time workers.", "cons": "Management can be ruthless when considering holidays, sick days.", "advice": null}, {"title": "Average retail job, nothing special", "text": "Pros - Uniform (60% off) - The other employees in store. Cons - Very strict with discount and uniform. - Loyalty is not rewarded.", "rating": 3, "pros": "- Uniform (60% off)", "cons": "- Very strict with discount and uniform.", "advice": null}, {"title": "Great business to work with.", "text": "Pros Great Brand. Lots of opportunity to develop and progress. Brand know who they are and strong structure in place. Good product. Manage a business not a store. Cons Head office support has reduced in recent years. Less payroll to deliver same expectations. Salary and bonus changed. Senior management head count has reduced in recent years. Advice to Management Great for the single people, opportunities to progress are there if willing to relocate. Must be a good all rounder to survive and do well.", "rating": 5, "pros": "Great Brand. Lots of opportunity to develop and progress. Brand know who they are and strong structure in place. Good product. Manage a business not a store.", "cons": "Head office support has reduced in recent years. Less payroll to deliver same expectations. Salary and bonus changed. Senior management head count has reduced in recent years.", "advice": "Great for the single people, opportunities to progress are there if willing to relocate. Must be a good all rounder to survive and do well."}, {"title": "top level sales assistant", "text": "Pros 25% staff discount is the only perk Cons Cost cutting in staffing levels and pressure to meet ever increasing targets has made the job a nightmare. Senior management only concerned with self preservation. No matter how much you give it's never enough and you are expected to work through unpaid breaks and past the end of your shift without pay. Advice to Management Less pressure and more staff would make all the difference to your staff health and well being and company bottom line.", "rating": 1, "pros": "25% staff discount is the only perk", "cons": "Cost cutting in staffing levels and pressure to meet ever increasing targets has made the job a nightmare. Senior management only concerned with self preservation. No matter how much you give it's never enough and you are expected to work through unpaid breaks and past the end of your shift without pay.", "advice": "Less pressure and more staff would make all the difference to your staff health and well being and company bottom line."}, {"title": "Management use employees as human shields", "text": "Pros The people make the brand. Since working at the Arcadia brand I've been working at I have met some if the most passionate, caring and incredible people who are completely dedicated to making the brand a success. Cons Management take advantage of the passion of their staff and often don't even show the curtesy of learning their names. Advice to Management Communicate. 'Town Hall' meetings are not communication. They are 90 minutes of time wasted listening to people say little to nothing with regard to the questions that your hard working staff want answers to. Also, learn people's names! It should not be seen as beneath you to learn the names of the people you are working with on a daily basis. There are only 150 people in the office - know who they are.", "rating": 3, "pros": "The people make the brand. Since working at the Arcadia brand I've been working at I have met some if the most passionate, caring and incredible people who are completely dedicated to making the brand a success.", "cons": "Management take advantage of the passion of their staff and often don't even show the curtesy of learning their names.", "advice": "Communicate. 'Town Hall' meetings are not communication. They are 90 minutes of time wasted listening to people say little to nothing with regard to the questions that your hard working staff want answers to. Also, learn people's names! It should not be seen as beneath you to learn the names of the people you are working with on a daily basis. There are only 150 people in the office - know who they are."}, {"title": "Area Manager", "text": "Pros Salary package reasonable and focus on development has has been positive within the group though this has reduced in the last three years. Cons Business out of touch with consumers needs in many brands hence high level of store closures with many competitors developing a stronger high street and brand presence. High level of redundancy throughout the business with lowest statutory levels of redundancy pay & employees expected to work through full notice periods. Advice to Management Have a more strategic plan for brands beyond bricks v clicks re-alignment. Invest in more stock v current feast and famine approach.", "rating": 3, "pros": "Salary package reasonable and focus on development has has been positive within the group though this has reduced in the last three years.", "cons": "Business out of touch with consumers needs in many brands hence high level of store closures with many competitors developing a stronger high street and brand presence. High level of redundancy throughout the business with lowest statutory levels of redundancy pay & employees expected to work through full notice periods.", "advice": "Have a more strategic plan for brands beyond bricks v clicks re-alignment. Invest in more stock v current feast and famine approach."}, {"title": "Customer Advisor", "text": "Pros Friendly and small team, training Cons Selling credit card to customers, targeting certain ethnic minorities", "rating": 3, "pros": "Friendly and small team, training", "cons": "Selling credit card to customers, targeting certain ethnic minorities", "advice": null}, {"title": "Store manager", "text": "Pros Discounts on great product, workshops for managers to develop their skill base Cons Big company vision with no payroll to back the vision unless you work in Oxford circus Advice to Management Increase the payroll spend and you'll see better results on all KPI's", "rating": 1, "pros": "Discounts on great product, workshops for managers to develop their skill base", "cons": "Big company vision with no payroll to back the vision unless you work in Oxford circus", "advice": "Increase the payroll spend and you'll see better results on all KPI's"}, {"title": "Expect the un achievable, lots of back stabbing", "text": "Pros Uniform allowance Lieu time for bank hol working Invest in training if you're lucky Brand conferences once a year Can progress by jumping from brand to brand. Commercial focused Cons Expect too much from managers, unrealistic targets leaves you feeling constantly defeated and under attack! Completely political, actually know of people not getting jobs because their face 'didn't fit'. Company so big you never get to know people in head office. Try to give you lowest possible salary in the bracket. Advice to Management Get to know your managers. Don't be so elitist to ones working in smaller stores.", "rating": 3, "pros": "Uniform allowance", "cons": "Expect too much from managers, unrealistic targets leaves you feeling constantly defeated and under attack!", "advice": "Get to know your managers. Don't be so elitist to ones working in smaller stores."}, {"title": "Merchandising", "text": "Pros Fun, dynamic team who really know the market Cons Lack of structure in day to day role", "rating": 3, "pros": "Fun, dynamic team who really know the market", "cons": "Lack of structure in day to day role", "advice": null}, {"title": "Awful awful and awful, stay away from customer care", "text": "Pros Pros for me was the sample sale and work being less than a 5 minute drive away. This is probably the reason I was there for so long. (Just handed my notice) Cons Where do I begin Firstly the management lack any form of professionalism and treat the advisors like prisoners. Call after call and no time to actually resolve customers queries, as soon as we have off phone time we get a call through our headsets demanding us to take more calls. In the meantime the managers are in a huddle discussing what they want for lunch. There is minimum support and a very dismil attitude across the floor making almost every advisor miserable all wishing they had other jobs. The development opportunities are minimum and most \"senior advisors\" just kiss a lot of management bum and do the work they don't want to, as soon as its busy the seniors are treated like advisors and made to stay on calls whilst doing their managers work. The staff turn over is so high, I started 18 months ago and there are many 2 people left from my training group. Most people have left due to work feeling like a concentration camp where you have to rush to go to the toilet afraid Youl be pulled up in a meeting because you use too much \"personal time\". If you complain to HR or management they all stick together and find a way for it to go against you, I.e pulling up every instance of late you have ever had and saying because you have had that were not going to help you. The operation of the contact centre is so poor, they frequently mess up pay and holidays demanding you to work time back because of their errors. When Alda chain director comes to visit everyone is notified to look smart and all desk are spotless and the managers actually pretend to be professional. In reality it is nothing like that. Advice to Management care for the staff, be more supportive, don't preach to advisors then have your phones out and eat McDonald's.", "rating": 1, "pros": "Pros for me was the sample sale and work being less than a 5 minute drive away. This is probably the reason I was there for so long. (Just handed my notice)", "cons": "Where do I begin Firstly the management lack any form of professionalism and treat the advisors like prisoners. Call after call and no time to actually resolve customers queries, as soon as we have off phone time we get a call through our headsets demanding us to take more calls.", "advice": "care for the staff, be more supportive, don't preach to advisors then have your phones out and eat McDonald's."}, {"title": "Great Company", "text": "Pros I worked within Customer Service ' this was based in London but has now relocated to Leeds. Good benefits.. discount and most of all sample sales! Every day was a new challenge as the company is always introducing another collaboration or marketing offer so your always kept busy. Cons Basic pay is low.. a lot of extra hours needed to come away with a good salary. Stores hate Head Office and it's always a constant battle to get their support to resolve complaints Advice to Management Listen to your staff.. take on board their feedback and invest time and help develop their skills.", "rating": 5, "pros": "I worked within Customer Service ' this was based in London but has now relocated to Leeds.", "cons": "Basic pay is low.. a lot of extra hours needed to come away with a good salary.", "advice": "Listen to your staff.. take on board their feedback and invest time and help develop their skills."}, {"title": "Great company to work for", "text": "Pros There's loads of benefits working for a company like Arcadia as you get an insight into lots of different brands, and there's a wealth of knowledge. Offices are really fun to work in and there's always little perks to help make your week better! Cons It's very fast paced and sometimes it can get confusing as to who owns what with projects.", "rating": 5, "pros": "There's loads of benefits working for a company like Arcadia as you get an insight into lots of different brands, and there's a wealth of knowledge. Offices are really fun to work in and there's always little perks to help make your week better!", "cons": "It's very fast paced and sometimes it can get confusing as to who owns what with projects.", "advice": null}, {"title": "Friendly and welcoming staff!", "text": "Pros The discount is good- 25% but I waited nearly 3 months for mine. Management are friendly, some nicer than others. Cons Very busy store and mistakes can be made easily to its all about keeping on top of what your doing. Advice to Management Better incentives and notice of rotas.", "rating": 3, "pros": "The discount is good- 25% but I waited nearly 3 months for mine. Management are friendly, some nicer than others.", "cons": "Very busy store and mistakes can be made easily to its all about keeping on top of what your doing.", "advice": "Better incentives and notice of rotas."}, {"title": "Fun and positive experience.", "text": "Pros Strong (mainly) consistent leadership, good uniform allowance, pleasant environment (friendly staff), good development opportunities, time-off policies are very good as it holiday allowance. Cons Frequently underpaid- or pay discrepancies, apart from that everything was good. Advice to Management Payment of employees should be a priority as well as consistency with rota's (i.e without favouritism).", "rating": 5, "pros": "Strong (mainly) consistent leadership, good uniform allowance, pleasant environment (friendly staff), good development opportunities, time-off policies are very good as it holiday allowance.", "cons": "Frequently underpaid- or pay discrepancies, apart from that everything was good.", "advice": "Payment of employees should be a priority as well as consistency with rota's (i.e without favouritism)."}, {"title": "Great place to start out", "text": "Pros Great benefits and training, colleagues and many chances for progression. Managers try their hardest to satisfy everyone. Cons Hours vary a lot so some weeks you're hardly in then others you're in all the time.", "rating": 5, "pros": "Great benefits and training, colleagues and many chances for progression. Managers try their hardest to satisfy everyone.", "cons": "Hours vary a lot so some weeks you're hardly in then others you're in all the time.", "advice": null}, {"title": "OK as a starting point..", "text": "Pros -Good colleagues -Trying to become more fun. Payday breakfasts etc Cons -Slow progression. The company dont want to reward you for the effort you put in in terms of promotion -As a new starter they keep you on the starting salary for as long as possible, even though you will be expected to be the 'senior associate' you will both be in minimal pay -Some management have poor attitude/ afraid of change Advice to Management -Treat the people at the bottom better..without us where would you be? A little bit of acknowledgement goes a long way!", "rating": 3, "pros": "-Good colleagues", "cons": "-Slow progression. The company dont want to reward you for the effort you put in in terms of promotion", "advice": "-Treat the people at the bottom better..without us where would you be? A little bit of acknowledgement goes a long way!"}, {"title": "Pro's and cons, not good for long term.", "text": "Pros Customer focus, very good atmosphere with staff. Cons Pay-minimum wage. Huge focus on MasterCard sign ups, selling them is a big part of the job.", "rating": 3, "pros": "Customer focus, very good atmosphere with staff.", "cons": "Pay-minimum wage. Huge focus on MasterCard sign ups, selling them is a big part of the job.", "advice": null}, {"title": "Frighteningly Poor", "text": "Pros Great co-workers, some Management supportive and willing to help, good core knowledge of domestic and International retail practices, good for building core admin/office skills. Cons Virtually no real support, goals and targets hugely unrealistic but rigidly enforced. Climate of fear promoted by employer; no sense of Management ownership or backing, Customer Care Advisors very much targeted when and if targets are not met. Shoddily run throughout; little communication between departments, constant crises due to inadequate practice, poor quality goods, and lowest-common-denominator delivery services. Systems used are slow and prone to errors; custom-builds for client engines etc are riddled with workflow issues, and technical support to these slow and inefficient. Virtually impossible to progress within Customer Services beyond conventional Team Manager routes. Conventional rota used for full-time, non-night staff varies wildly over a space of seven weeks, and includes finishing at 9pm on weekends and weekdays on some weeks, making it extremely difficult for an employee's body-clock to adapt. Advice to Management Promote, hone, and take pride in your staff - ready them for further opportunities and more specialized roles as these become available. Conduct a full overhaul of practices used in the workplace - the massive majority of staff live in constant worry of being targeted or made redundant due to draconian targets with little support. Interface as fully as possible with other areas and departments - these appear secretive and veiled to the bulk of Advisors, with little opportunity to learn and understand why these links exist. There has been some progress on payment scales for specialist roles, but these are minor compared to competitors and offer little in the way of career progession.", "rating": 1, "pros": "Great co-workers, some Management supportive and willing to help, good core knowledge of domestic and International retail practices, good for building core admin/office skills.", "cons": "Virtually no real support, goals and targets hugely unrealistic but rigidly enforced. Climate of fear promoted by employer; no sense of Management ownership or backing, Customer Care Advisors very much targeted when and if targets are not met. Shoddily run throughout; little communication between departments, constant crises due to inadequate practice, poor quality goods, and lowest-common-denominator delivery services. Systems used are slow and prone to errors; custom-builds for client engines etc are riddled with workflow issues, and technical support to these slow and inefficient. Virtually impossible to progress within Customer Services beyond conventional Team Manager routes. Conventional rota used for full-time, non-night staff varies wildly over a space of seven weeks, and includes finishing at 9pm on weekends and weekdays on some weeks, making it extremely difficult for an employee's body-clock to adapt.", "advice": "Promote, hone, and take pride in your staff - ready them for further opportunities and more specialized roles as these become available. Conduct a full overhaul of practices used in the workplace - the massive majority of staff live in constant worry of being targeted or made redundant due to draconian targets with little support. Interface as fully as possible with other areas and departments - these appear secretive and veiled to the bulk of Advisors, with little opportunity to learn and understand why these links exist. There has been some progress on payment scales for specialist roles, but these are minor compared to competitors and offer little in the way of career progession."}, {"title": "Good starter job - not for lifetime though", "text": "Pros - discount on products - interesting work - busy Cons - certain type of staff you get there - backstabbing - unattainable targets on Store Cards Advice to Management Invest in your younger staff...although you may think they are not good for much, given the chance they will work hard and could be a good investment if you spend the time on them and believe in them.", "rating": 5, "pros": "- discount on products", "cons": "- certain type of staff you get there - backstabbing", "advice": "Invest in your younger staff...although you may think they are not good for much, given the chance they will work hard and could be a good investment if you spend the time on them and believe in them."}, {"title": "Could be better but could be worse too...", "text": "Pros Really good people work there. Almost everybody is helpful. I think the business goes well, makes us busy and I like the challanges to resolve problems and help to everyone. Cons Building is so old, the roof is leaked everywhere. When the sun is shining, temperature goes up so quickly. Equipments are very old too. Salary is very low, no bonuses, only a christmas dinner... There are opportunities to make career, but the company does not appreciate it with well deserved wage. The level of wage is the main reason why won't recommend this company to a friend. Unfortunately, the CEO and the head office management is selfish, I think only they want to fill their pocket with money, and do not care about anything else... Advice to Management Develop the working enviroment modern, useful things. Rise the wage. If business goes well give to people bonuses to feel they work well. I think you could expect more from the staff, if you appreciate their efforts...", "rating": 3, "pros": "Really good people work there. Almost everybody is helpful. I think the business goes well, makes us busy and I like the challanges to resolve problems and help to everyone.", "cons": "Building is so old, the roof is leaked everywhere. When the sun is shining, temperature goes up so quickly. Equipments are very old too. Salary is very low, no bonuses, only a christmas dinner... There are opportunities to make career, but the company does not appreciate it with well deserved wage. The level of wage is the main reason why won't recommend this company to a friend. Unfortunately, the CEO and the head office management is selfish, I think only they want to fill their pocket with money, and do not care about anything else...", "advice": "Develop the working enviroment modern, useful things. Rise the wage. If business goes well give to people bonuses to feel they work well. I think you could expect more from the staff, if you appreciate their efforts..."}, {"title": "Management are patronising, especially if you have more experience than them.", "text": "Pros Great for fitting around other commitments, which suited me fine. Some members of staff can be friendly, actually you could make a few good friends. Easy in terms of demands. Cons Staff are on the whole pretentious, judgmental and in larger environments rude. The work can be boring and mandate Management sit around and do nothing all day, well, besides from being patronizsng. Advice to Management Consider the personalities of those you employ, yet extroverts are great, and confidence is a must, but those two positives do not go hand in hand with rudeness and having a huge ego.", "rating": 3, "pros": "Great for fitting around other commitments, which suited me fine.", "cons": "Staff are on the whole pretentious, judgmental and in larger environments rude.", "advice": "Consider the personalities of those you employ, yet extroverts are great, and confidence is a must, but those two positives do not go hand in hand with rudeness and having a huge ego."}, {"title": "boring but with one good benefit of staff discount", "text": "Pros staff discount, the social side of it all Cons boring, not hard work, can get very monotonous Advice to Management increase holiday time for everyone especially top level and management", "rating": 3, "pros": "staff discount, the social side of it all", "cons": "boring, not hard work, can get very monotonous", "advice": "increase holiday time for everyone especially top level and management"}, {"title": "Standard experience with degrading management and a pay rate that will 'get you by'", "text": "Pros The atmosphere is very contagious, very enthusiastic. I have developed as a person, both pessimistic and optimistically. Cons The only development available will be the one you create. Extremely limited job. Poor pay. Advice to Management Constructively carry out their job effectively and professionally.", "rating": 3, "pros": "The atmosphere is very contagious, very enthusiastic. I have developed as a person, both pessimistic and optimistically.", "cons": "The only development available will be the one you create. Extremely limited job. Poor pay.", "advice": "Constructively carry out their job effectively and professionally."}, {"title": "Fantastic", "text": "Pros Great benefits, good social aspect Cons Shift times, although these can be changed Advice to Management None at all!", "rating": 5, "pros": "Great benefits, good social aspect", "cons": "Shift times, although these can be changed", "advice": "None at all!"}, {"title": "Sales associate", "text": "Pros Atmosphere, Staff, Uniform discount, Hours Cons Strict rules, No wifi in staff room Advice to Management Make it feel less commercial, more relaxed", "rating": 3, "pros": "Atmosphere, Staff, Uniform discount, Hours", "cons": "Strict rules, No wifi in staff room", "advice": "Make it feel less commercial, more relaxed"}, {"title": "good company", "text": "Pros multi brand discount scheme benefits all employees Cons varied levels of training amongst staff", "rating": 5, "pros": "multi brand discount scheme benefits all employees", "cons": "varied levels of training amongst staff", "advice": null}, {"title": "Unstructured, stores need better management and structure support.", "text": "Pros make some good friends (usually the older generation), good for experience but no more Cons training is awful there is no way to get higher without brown nosing (sorry for being vulgar) Advice to Management there needs to be some changes in the stores, people who work hard and show what they can do with all there experience get no where its all down to who you know and how friendly you are with the overall management, if you don't follow them and be there slave you get no where. Evans as a company are great but topshop and top man just want to look the part and not care about structural support. i worked as a admin so for topshop top man and evans, topshop expected me to be helping them and running there shop floors when they just sat in the office doing nothing and leaving me to run floors and get behind on my work then have the cheek to approach me and say why I'm not doing my job right and my answer to them was i was helping you out and they respond with OK. blunt answer no thank you noting, i have heard this from many stores since i have friends who work in other stores i have also had a friend who has now moved onto better things being a store manager in TKmax in leeds city which is 8/9 times the size of the store we worked at and the reason he moved was because they gave a job to a less experienced team leader to become a brand manager he is now on more money better job and has used his experience to better exercise. Bit of a rant but the company (stores not head office) need to ask staff members what they really think not send out \"have your say\" with motives like nights out, because we get told to put good things by the management because \"they wanna look the best\" not because they care what we think!!!", "rating": 3, "pros": "make some good friends (usually the older generation), good for experience but no more", "cons": "training is awful there is no way to get higher without brown nosing (sorry for being vulgar)", "advice": "there needs to be some changes in the stores, people who work hard and show what they can do with all there experience get no where its all down to who you know and how friendly you are with the overall management, if you don't follow them and be there slave you get no where. Evans as a company are great but topshop and top man just want to look the part and not care about structural support. i worked as a admin so for topshop top man and evans, topshop expected me to be helping them and running there shop floors when they just sat in the office doing nothing and leaving me to run floors and get behind on my work then have the cheek to approach me and say why I'm not doing my job right and my answer to them was i was helping you out and they respond with OK. blunt answer no thank you noting, i have heard this from many stores since i have friends who work in other stores i have also had a friend who has now moved onto better things being a store manager in TKmax in leeds city which is 8/9 times the size of the store we worked at and the reason he moved was because they gave a job to a less experienced team leader to become a brand manager he is now on more money better job and has used his experience to better exercise."}, {"title": "Arcadia Review", "text": "Pros Fashion retailing which is constantly changing and is exciting from store operations to buying and merchandising, finance etc etc. Cons Benefits such as pensions are now poorer (final salary now stopped) and the most recent scheme for staff is poor. The company frequently restructures different departments and when redundancies are made which have been frequent in recent years, redundancy is the minimum or just a tiny amount above the statutary level .", "rating": 3, "pros": "Fashion retailing which is constantly changing and is exciting from store operations to buying and merchandising, finance etc etc.", "cons": "Benefits such as pensions are now poorer (final salary now stopped) and the most recent scheme for staff is poor.", "advice": null}, {"title": "Don't make a career out of it", "text": "Pros Flexible. Loads of brands within the company, so you can transfer to different stores. Very good if your a student going to university, but wishing to stay in the company Cons You only progress if they want you to. Lack of pay rises and incentives. You'll be lucky to see a bonus", "rating": 3, "pros": "Flexible.", "cons": "You only progress if they want you to. Lack of pay rises and incentives. You'll be lucky to see a bonus", "advice": null}, {"title": "Ok for starting your career", "text": "Pros Great people, young all really nice to get along with Great discount Cons Pay is fairly average, and can be hard to get promoted within roles Advice to Management Make it easier for internal staff develop and better career development.", "rating": 3, "pros": "Great people, young all really nice to get along with", "cons": "Pay is fairly average, and can be hard to get promoted within roles", "advice": "Make it easier for internal staff develop and better career development."}, {"title": "Was great at the start but when made redundant they didn't look after staff", "text": "Pros Team envoirnment, great discount, great uniform Cons Had to ask for pay review or to move up a level, if you didn't ask if wasn't offered. Advice to Management Your staff work really hard for you, appreciate them a bit more", "rating": 3, "pros": "Team envoirnment, great discount, great uniform", "cons": "Had to ask for pay review or to move up a level, if you didn't ask if wasn't offered.", "advice": "Your staff work really hard for you, appreciate them a bit more"}, {"title": "Dream Job", "text": "Pros People, Industry, Freebies, Discount, Career Opportunities and Enjoyment, Environment Cons Pay is low especially for London", "rating": 5, "pros": "People, Industry, Freebies, Discount, Career Opportunities and Enjoyment, Environment", "cons": "Pay is low especially for London", "advice": null}, {"title": "Great company", "text": "Pros You get a great discount on clothes Cons The work hours are really long Advice to Management Bonus", "rating": 3, "pros": "You get a great discount on clothes", "cons": "The work hours are really long", "advice": "Bonus"}, {"title": "Solely focussed on selling credit during a time of economic downturn.", "text": "Pros - The staff and store managers I worked with were incredibly likeminded, supportive and friendly. Cons - Encourages 18 year old employees to apply for their arcadia advantage card which is in actual fact a credit card with a high interest rate. - Solely focussed on coaxing customers into taking out credit cards, many of which are young, naive or of low income members of the public that are not fully aware of all the information and responsibilities of taking out a store card. - Bully tactics from higher management in order to meet targets. - Worked into the evening one christmas eve preparing for launch of a boxing day sale whilst CEO Phillip Green was tweeting from his Yacht in the Bahamas with pop star Rhianna. - Never received any thanks. Advice to Management - STOP credit encouragement, it's irresponsible. - STOP bully tactics in order to achieve unachievable targets.", "rating": 1, "pros": "- The staff and store managers I worked with were incredibly likeminded, supportive and friendly.", "cons": "- Encourages 18 year old employees to apply for their arcadia advantage card which is in actual fact a credit card with a high interest rate.", "advice": "- STOP credit encouragement, it's irresponsible."}, {"title": "Boring and underpaid, too much pressure selling the credit card", "text": "Pros good training and development available Cons Boring, too much pressure on selling the credit card", "rating": 3, "pros": "good training and development available", "cons": "Boring, too much pressure on selling the credit card", "advice": null}, {"title": "Arcardia", "text": "Pros Great discounts in the high street Cons Very competitive can be difficult to progress", "rating": 5, "pros": "Great discounts in the high street", "cons": "Very competitive can be difficult to progress", "advice": null}, {"title": "managers don't respect you at all", "text": "Pros Big company, it's not likely to go bust Cons as it's a big company, they aren't concerned about keeping their staff", "rating": 3, "pros": "Big company, it's not likely to go bust", "cons": "as it's a big company, they aren't concerned about keeping their staff", "advice": null}, {"title": "look after your staff", "text": "Pros exposure, experiences, pride, exciting, included, honor Cons money, expectation on staff, lack of progression, repetitive Advice to Management look after your staff and reward them.", "rating": 3, "pros": "exposure, experiences, pride, exciting, included, honor", "cons": "money, expectation on staff, lack of progression, repetitive", "advice": "look after your staff and reward them."}, {"title": "Comfortable place to work, high pressure but can be fun", "text": "Pros OK Salary but no real increase in current climate Store discount Flexible reward package for high grade giving you the choice of benefits Cons Politics between competing brands within the group. Systems are dated in look and feel Pressure to keep costs down effects overall performance Advice to Management Look at bringing systems upto date, particularly in Creative Suite as this could prevent recruiting talented people.", "rating": 5, "pros": "OK Salary but no real increase in current climate", "cons": "Politics between competing brands within the group.", "advice": "Look at bringing systems upto date, particularly in Creative Suite as this could prevent recruiting talented people."}, {"title": "Interesting company to work for", "text": "Pros The 25% discount across all arcaidia brands The opportunity to double discount on special mega event days The ability to control your own learning for promotions Incentives for exceeding targets Cons The uniform allowance is really low and unfair for those who work less than 30 hours, consideiring it's meant to cover a 3 month period. Managers take their time to sign you off to a higher position, but give you duties to preform which are not in your job description :-/ Managers from different stores do different things... can be confusing when covering or doing overtime in different stores. Advice to Management Talk to staff on their level, not in a belittling way. Encourage staff to progress through the rans if they wish and sign them off in time.", "rating": 3, "pros": "The 25% discount across all arcaidia brands", "cons": "The uniform allowance is really low and unfair for those who work less than 30 hours, consideiring it's meant to cover a 3 month period.", "advice": "Talk to staff on their level, not in a belittling way. Encourage staff to progress through the rans if they wish and sign them off in time."}, {"title": "Varied experience", "text": "Pros relaxed atmosphere, opportunity to work in different areas of the business Cons companesation on the low side", "rating": 5, "pros": "relaxed atmosphere, opportunity to work in different areas of the business", "cons": "companesation on the low side", "advice": null}, {"title": "Great place to kick start a retail career", "text": "Pros Well known company that has many opportunities across the 7 brands. Big learning curve and many opportunities across different sized stores. Cons Relatively low pay, as per any retail career weekends are a norm. Payroll is run really tight so resources to deliver high service and relaxed/fair management scheduling do not happen. Advice to Management Simplify simplify simplify store goals and targets - too many. You will be able to deliver higher customer service and visual standards with more payroll.", "rating": 3, "pros": "Well known company that has many opportunities across the 7 brands. Big learning curve and many opportunities across different sized stores.", "cons": "Relatively low pay, as per any retail career weekends are a norm. Payroll is run really tight so resources to deliver high service and relaxed/fair management scheduling do not happen.", "advice": "Simplify simplify simplify store goals and targets - too many. You will be able to deliver higher customer service and visual standards with more payroll."}, {"title": "Arcadia group", "text": "Pros Excellent training and development. Clear and concise job expectations. A very well run company. Brill to work for!!! A range of brands to cover all fashion markets. Cons Hard to find negatives for Arcadia except that benefits are not wat they were pre recession. lower start of pay etc etc but I guess it's to be expected. Sir Phillip has to keep an eye on his profit. Advice to Management Perhaps look for more feedback on operations, area managers, regional controllers, stock package etc from top store managers and deputies.", "rating": 5, "pros": "Excellent training and development. Clear and concise job expectations.", "cons": "Hard to find negatives for Arcadia except that benefits are not wat they were pre recession. lower start of pay etc etc but I guess it's to be expected. Sir Phillip has to keep an eye on his profit.", "advice": "Perhaps look for more feedback on operations, area managers, regional controllers, stock package etc from top store managers and deputies."}]