[{"title": "This is a great place to work!", "text": "Pros I have come from a streak of very nice jobs over the last few years, but this place is still the best for lots of reasons. The people are very friendly, helpful and really good at their jobs. I think there's a great balance work/life balance and the work is challenging without being overly demanding. The overall culture is really nice. Cons The company is growing very fast and there many changes coming. New office, new people, new customers. Advice to Management Keep the company culture alive as we grow!", "rating": 5, "pros": "I have come from a streak of very nice jobs over the last few years, but this place is still the best for lots of reasons. The people are very friendly, helpful and really good at their jobs. I think there's a great balance work/life balance and the work is challenging without being overly demanding. The overall culture is really nice.", "cons": "The company is growing very fast and there many changes coming. New office, new people, new customers.", "advice": "Keep the company culture alive as we grow!"}, {"title": "Great company with awesome people", "text": "Pros Architrave got a really good process of choosing the right people to make the job done while keeping the good office spirit. It's always fun to get to the office in the morning, sit in the kitchen for the famous Rise and beans or play tennis table with everyone from the newest student to the CEO. The management is always very open with what's going on in all aspects so I had no surprises (at least not negative ones) and it's something that helps me feel calm and safe. Cons The office is getting really small for a number of employees but a new office is in the pipeline so I guess it will get better... Advice to Management Just keep what you're doing!!", "rating": 5, "pros": "Architrave got a really good process of choosing the right people to make the job done while keeping the good office spirit.", "cons": "The office is getting really small for a number of employees but a new office is in the pipeline so I guess it will get better...", "advice": "Just keep what you're doing!!"}, {"title": "Happy to be here", "text": "Pros - The company culture provides a space for transparent communications. - Everybody loves their job and are happy to help you on the way to where you want to be. - Work of the individuals are recognized and appreciated. - Management team is friendly and working hard to keep the work environment fun and comfortable for everyone. - Free German classes - Being a part of a rapidly growing business gives the employees a lot of motivation Cons - We need alternatives to table-tennis", "rating": 5, "pros": "- The company culture provides a space for transparent communications.", "cons": "- We need alternatives to table-tennis", "advice": null}, {"title": "Absolutely happy", "text": "Pros - very, very friendly, warm and open athmosphere within colleagues and chefs - flat hierarchy - flexible way do to working - big tolerance for individual needs - big appreciation for every single employee - always having time for some little jokes and laughter - very employee-close chefs like friends Cons I am sorry, but I can't come up with negative things around Architrave :) Advice to Management Go on like you did since started", "rating": 5, "pros": "- very, very friendly, warm and open athmosphere within colleagues and chefs", "cons": "I am sorry, but I can't come up with negative things around Architrave :)", "advice": "Go on like you did since started"}, {"title": "Great team spirit and very rewarding work", "text": "Pros + growing, internationally made up team of skilled, motivated and friendly people + flat hierarchies + very promising product, which is strongly shaped by own work and creativity + good compensation + monthly casual team events + high level of personal freedom + nice location, easily reachable by S-Bahn Cons - hardly any places for cheap lunch around the office Advice to Management The processes for inter-team communication seem a little undefined at the moment. It can be hard to grasp what the other teams are working on, and what the bigger picture outside of the own team is.", "rating": 5, "pros": "+ growing, internationally made up team of skilled, motivated and friendly people", "cons": "- hardly any places for cheap lunch around the office", "advice": "The processes for inter-team communication seem a little undefined at the moment. It can be hard to grasp what the other teams are working on, and what the bigger picture outside of the own team is."}, {"title": "A nice friendly environment to start your career with", "text": "Pros - A very friendly environment - Almost flat hierarchy - Good compensation offered - Nice location of the office - Fast growing company and hence free from conventional rigid structure Cons - Needs some improvement on setting up big database system involving state of the art tools of Data science", "rating": 5, "pros": "- A very friendly environment", "cons": "- Needs some improvement on setting up big database system involving state of the art tools of Data science", "advice": null}, {"title": "Growing, fun, competent and friendly", "text": "Pros - Competent and engaged people that know how to do it or how not to do it - Challenges are presented for the team to overcome it in an open-minded and inclusive way - Growing fast and healthy - Welcoming and friendly to newcomers - Daily outdoor breaks for table-tennis - Monthly/weekly meetings for sports, cultural events and parties - Accessible management team - Exciting technologies are being used to engineer new features Cons - Difficult to win table-tennis matches against the Support Team; damn they're good - The office in Berlin needs more color", "rating": 5, "pros": "- Competent and engaged people that know how to do it or how not to do it", "cons": "- Difficult to win table-tennis matches against the Support Team; damn they're good", "advice": null}, {"title": "Mit Spaß an der Zukunft arbeiten!", "text": "Pros - Großartige Mitarbeiter aus aller Welt, familiäres Miteinander - Faire Chefs, transparente Geschäftsführung - Super spannende Nische mit Zukunft (an der Schnittstelle zwischen Immobilien, Software, künstliche Intelligenz) - Schnell wachsendes und profitables Unternehmen mit vielen Chancen für die persönliche Entwicklung - Gute Work-Life-Balance möglich, selten werden Überstunden gemacht, Extraaufwand ist nicht selbstverständlich und findet Anerkennung Cons Es gibt immer viel zu tun, aber das ist eigentlich ein Pro.", "rating": 5, "pros": "- Großartige Mitarbeiter aus aller Welt, familiäres Miteinander", "cons": "Es gibt immer viel zu tun, aber das ist eigentlich ein Pro.", "advice": null}, {"title": "sehr gemischtes Team, entspannte Hierarchie", "text": "Pros alle kennen alle, Führungskräfte können Aufgaben gut abgeben und vertrauen den Entscheidungen ihrer Mitarbeiter Cons Büro wird recht warm im Sommer", "rating": 5, "pros": "alle kennen alle, Führungskräfte können Aufgaben gut abgeben und vertrauen den Entscheidungen ihrer Mitarbeiter", "cons": "Büro wird recht warm im Sommer", "advice": null}, {"title": "Super Arbeitgeber", "text": "Pros es werden schnelle Entscheidungen getroffen - TOP geht sehr auf die individuellen Wünsche der Arbeitnehmer ein tut viel für das Arbeitsklima, sei es in der Mittagspause gemeinsam Tischtennis spielen oder einmal im Monat gemeinsam was essen gehen man muss nicht lange auf Rückmeldungen warten und kann dadurch fließend weiterarbeiten Cons Ich habe nicht negatives zu berichten", "rating": 5, "pros": "es werden schnelle Entscheidungen getroffen - TOP", "cons": "Ich habe nicht negatives zu berichten", "advice": null}, {"title": "Start und Einarbeitung", "text": "Pros Ich wurde sehr nett im Team aufgenommen (tolle Begrüßung) Meine neuen Kollegen sind ausgesprochen freundlich und hilfsbereit. Die Einarbeitung ist sehr gut und umfangreich. Cons Da die Office Sprache Englisch ist, fällt es mir manchmal schwer alles genau zu verstehen. Das ist noch eine kleine Herausforderung für mich. Advice to Management Aktuell kann ich diesbezüglich noch keine Anmerkungen geben, dafür bin ich zu kurz dabei. Eventuell kann ich in der Zukunft einen Beitrag leisten.", "rating": 5, "pros": "Ich wurde sehr nett im Team aufgenommen (tolle Begrüßung)", "cons": "Da die Office Sprache Englisch ist, fällt es mir manchmal schwer alles genau zu verstehen.", "advice": "Aktuell kann ich diesbezüglich noch keine Anmerkungen geben, dafür bin ich zu kurz dabei."}, {"title": "Company-Berwertung", "text": "Pros Flache Hierarchien, sehr gut eingespieltes Team, familiäres Klima über die Abteilungen hinweg, work-live-balance gegeben, interessantes multikulturelles Team Cons Zu kleines Büro und der Standort ist nicht sehr zentral (Umzug in ein größeres, zentrales Büro ist allerdings bereits für kommendes Jahr geplant)", "rating": 5, "pros": "Flache Hierarchien, sehr gut eingespieltes Team, familiäres Klima über die Abteilungen hinweg, work-live-balance gegeben, interessantes multikulturelles Team", "cons": "Zu kleines Büro und der Standort ist nicht sehr zentral (Umzug in ein größeres, zentrales Büro ist allerdings bereits für kommendes Jahr geplant)", "advice": null}]