[{"title": "Love it!", "text": "Pros - Experienced leadership - Great people - Fun Cons Move offices a lot Advice to Management Keep up the great work!", "rating": 5, "pros": "- Experienced leadership", "cons": "Move offices a lot", "advice": "Keep up the great work!"}, {"title": "Bait and Switch, unethical management.", "text": "Pros Bi-weekly lunches, weekly bubble tea, work from home whenever you have a headache or haven't slept well, come in whenever you want, unlimited vacation days, casual work environment and truly nice team. Snacks, good working tools. Cons - Unethical management: They interview and hire people for one position and then have them perform tasks totally unrelated to the position they were hired for. - A lot of false promises are made: 1. Growth opportunities: No growth at all - management prefers to tire you out for you to leave, rather than promoting you. 2. B Corporate and 1% pledge: They claim on website to be a B-Corp and be part of the 1% pledge, which is not true at all, as they are not listed as B-Corp, nor do they follow the 1% pledge. 3. Sick days: You are not allowed to be sick. If you're sick, you're expected to work from home. - No respect of your free time: you have to be available over email and chat long after work hours, on weekends, holidays, sick days, and when you're off. - Personal issues are divulged publicly - Management has no vision and no idea where to head to, which causes a lot of misleading communication, contradictory instructions, worthless supervisions, too many needless meetings and waste of time. Lack of people skills, no aptitude for leading, at times even passive aggressive management style. The work-life-balance is bad - lot's of unpaid overtime. Salary inequality. Advice to Management Try to be honest and be what you preach (transparent, fair, ethical). Respect your employee's time, talent, work and value these. Stop misleading during job interviews.", "rating": 1, "pros": "Bi-weekly lunches, weekly bubble tea, work from home whenever you have a headache or haven't slept well, come in whenever you want, unlimited vacation days, casual work environment and truly nice team.", "cons": "- Unethical management: They interview and hire people for one position and then have them perform tasks totally unrelated to the position they were hired for.", "advice": "Try to be honest and be what you preach (transparent, fair, ethical). Respect your employee's time, talent, work and value these. Stop misleading during job interviews."}, {"title": "Excellent experience at up and coming start up", "text": "Pros - Close knit team - Fast paced environment - Interesting projects - Great support Cons - Still trying to find its footing as a new company", "rating": 5, "pros": "- Close knit team", "cons": "- Still trying to find its footing as a new company", "advice": null}, {"title": "Great place to work!", "text": "Pros - Supportive, positive work environment - Incredibly smart team - Interesting product - Snacks! Cons None. Why is there a word minimum for this section?", "rating": 5, "pros": "- Supportive, positive work environment", "cons": "None. Why is there a word minimum for this section?", "advice": null}, {"title": "Kind and Smart", "text": "Pros I have loved working with the team at B12. They are the kindest colleagues I have ever had the pleasure to work with and individuals on the team are insanely smart! The company has fantastic values where they care about growing a business in the right way with the right set of values. Cons Overall, it has been a pleasure to work here.", "rating": 5, "pros": "I have loved working with the team at B12. They are the kindest colleagues I have ever had the pleasure to work with and individuals on the team are insanely smart! The company has fantastic values where they care about growing a business in the right way with the right set of values.", "cons": "Overall, it has been a pleasure to work here.", "advice": null}]