[{"title": "Great product, fun and diverse", "text": "Pros -Great product with great potential for the US market -The company values diversity -Open collaborative environment -Travel opportunites to HQ in Berlin -New team with good growth internal opportunities -3 weeks vacation for the first year -100% vesting schedule Cons -Most development still is done in HQ/Berlin which can be challenging at times -Getting used to the European work culture in HQ Advice to Management Keep valuing people and push more user feedback into the product", "rating": 5, "pros": "-Great product with great potential for the US market", "cons": "-Most development still is done in HQ/Berlin which can be challenging at times", "advice": "Keep valuing people and push more user feedback into the product"}, {"title": "Great company", "text": "Pros I'm working in Babbel for a few months. I've had the best onboarding experience. They are taking care of people, culture is really good, flexible working hours, a lot of benefits, great environment, people from all over the world. And when you do something, you felt that you are making an impact. Cons Of course, each company has some things that don't work well. But when they realize that something is not good, they are working on that to fix it.", "rating": 5, "pros": "I'm working in Babbel for a few months. I've had the best onboarding experience.", "cons": "Of course, each company has some things that don't work well. But when they realize that something is not good, they are working on that to fix it.", "advice": null}, {"title": "Good culture", "text": "Pros Good people. Nice company culture Cons Low salary. Weak leadership and strategy.", "rating": 5, "pros": "Good people. Nice company culture", "cons": "Low salary. Weak leadership and strategy.", "advice": null}, {"title": "Used to be a good place to work", "text": "Pros Company benefits are good with 30 vacation days etc. Good place if you want to get by doing a minimum of work (might be different in the marketing department). Cons People on all levels used to care a lot about language learning and the product, now most people seem to be there only for the money. There is absolutely no performance culture. It is fine to not deliver and good performance is not rewarded.", "rating": 3, "pros": "Company benefits are good with 30 vacation days etc. Good place if you want to get by doing a minimum of work (might be different in the marketing department).", "cons": "People on all levels used to care a lot about language learning and the product, now most people seem to be there only for the money. There is absolutely no performance culture. It is fine to not deliver and good performance is not rewarded.", "advice": null}, {"title": "Bad (personal) experience", "text": "Pros babbel bike was nice because service is included Cons with the whole management from delivery hero coming in, the company culture went down", "rating": 3, "pros": "babbel bike was nice because service is included", "cons": "with the whole management from delivery hero coming in, the company culture went down", "advice": null}, {"title": "A well-balanced job if you are not looking for career growth", "text": "Pros Good care on stuff- Opportunities to test and learn by yourself. Employees are empowered to make decisions Cons Hard to be promoted and expect a quick growth which it is part of startup culture. Advice to Management Need to play the game with today's speed. Product innovation is the key", "rating": 5, "pros": "Good care on stuff- Opportunities to test and learn by yourself. Employees are empowered to make decisions", "cons": "Hard to be promoted and expect a quick growth which it is part of startup culture.", "advice": "Need to play the game with today's speed. Product innovation is the key"}, {"title": "Great atmosphere and colleagues. A company that is taking good care of its staff!", "text": "Pros Very nice working environment and team. A company that cares about its staff where you feel welcomed from the first day on. Flexible working hours and Good career opportunities as well. Cons I didn't find any yet...", "rating": 5, "pros": "Very nice working environment and team. A company that cares about its staff where you feel welcomed from the first day on. Flexible working hours and Good career opportunities as well.", "cons": "I didn't find any yet...", "advice": null}, {"title": "Senior manager", "text": "Pros Great working atmosphere, cool people. Most of the people are in their 30s, plenty of drinking opportunities or team events Cons Everything goes very slowly, the downside of this great and relaxed working atmosphere is that the level of dedication of people is quite low.", "rating": 5, "pros": "Great working atmosphere, cool people. Most of the people are in their 30s, plenty of drinking opportunities or team events", "cons": "Everything goes very slowly, the downside of this great and relaxed working atmosphere is that the level of dedication of people is quite low.", "advice": null}, {"title": "Good but definitely not great", "text": "Pros - Great idea for a product - language learning app. - Diverse and talented colleagues in a fast-paced working environment. - There are opportunities to be proactive, suggest, start and take ownership of projects. - Possibility to learn a lot in a short period of time. - Chances are often given to those who ask to switch roles in the company. - Flexible working hours, good work-life balance, home-office is allowed. - Christmas and summer parties, frequent team events, department off sites. - 30 paid vacation days per year. - Business English, German and Swedish classes are offered to the employees, as well as professional trainings. - Nice onboarding process for new joiners, approachable HR. - Babbel bikes for all and BVG tickets (only for those who live far from the office). - Coffee/tea, fruits, and soft drinks are offered free of charge. - Modern office with a canteen in a great location in Berlin-Mitte, close to Alexanderplatz. Cons - The company tries to be agile but fails. - Some processes still need to be developed. - Too many unnecessary meetings and micromanagement. - Career path is not clear, low salary. - Constant need to prove yourself to get promoted. Advice to Management - Invest in processes, trust your employees and reduce micromanagement. - Build and share a clear and fair career path and increase the salaries to attract talent and to keep current employees.", "rating": 5, "pros": "- Great idea for a product - language learning app.", "cons": "- The company tries to be agile but fails.", "advice": "- Invest in processes, trust your employees and reduce micromanagement."}, {"title": "A great place to work", "text": "Pros - Great atmosphere, friendly and helpful colleagues - Diversity is celebrated - Company events and initiatives, where you can learn what other departments are working on and build connections across teams (Welcome Day, Blind Coffee, Open Brown Bags, Job Shadowing etc.) - Many opportunities to learn, both in-house as well as attending various workshops and conferences - You get to contribute to delivering a great product Cons The onboarding could have been a little better structured, but it was compensated by giving ample time to adjust and slowly ease into the role. Advice to Management Keep up the good work on fostering employee satisfaction", "rating": 5, "pros": "- Great atmosphere, friendly and helpful colleagues", "cons": "The onboarding could have been a little better structured, but it was compensated by giving ample time to adjust and slowly ease into the role.", "advice": "Keep up the good work on fostering employee satisfaction"}, {"title": "A company with a purpose & a great international community", "text": "Pros Language learning: what a great product to work on A 'learning company' that walks the talk Smart and pleasant colleagues from all over the world Nice office in Mitte - without the attitude of Mitte Company still growing fast and lots to do Cons The company grew so fast over the last few years that the culture has yet to stabilise Quite a complex organisation with too many silos Limited career growth opportunities and not the best salaries in town Advice to Management Keep focus (too many projects are a distraction from the core, which is innovating the product) Improve cooperation between departments Create better compensation schemes & career progression paths", "rating": 5, "pros": "Language learning: what a great product to work on", "cons": "The company grew so fast over the last few years that the culture has yet to stabilise", "advice": "Keep focus (too many projects are a distraction from the core, which is innovating the product)"}, {"title": "Babbel 10 years old startup", "text": "Pros Good ambient to work, nice colleagues Cons Lack of perception of regional markets needs", "rating": 5, "pros": "Good ambient to work, nice colleagues", "cons": "Lack of perception of regional markets needs", "advice": null}, {"title": "What you see is not what you get", "text": "Pros You will work with amazing people and their company and friendship out of the firm is really to be valued! The new office location is convinient for commuters (it is close to U8 stop). You get a bike or BVG ticket but only if you live far enough from the office. Cons Wants to be an agile company but fails. Had the impression it got a lot more corporate and \"political\" in the months before I left which is semi-acceptable given the size but they still tryed to convince the employees that they are a \"start-up”. No workers council! Advice to Management 1. Take care of the technical-debt asap. 2. Don't forget that people are your most valable asset. 3. Promote internal employees rather than hire externals! This only makes old people leave and they go with a lot knowledge which is very valuable. 4. Pay at least avg market price!", "rating": 3, "pros": "You will work with amazing people and their company and friendship out of the firm is really to be valued!", "cons": "Wants to be an agile company but fails. Had the impression it got a lot more corporate and \"political\" in the months before I left which is semi-acceptable given the size but they still tryed to convince the employees that they are a \"start-up”.", "advice": "1. Take care of the technical-debt asap."}, {"title": "Great potential, great colleagues, louzy management, CEO micromanager", "text": "Pros Aspirational product, great colleagues, a lot of opportunities for experimentation and room to grow. Cons CEO is marketing (fog) micromanager (my way or the highway), investing in marketing initiatives and not in product. Very high output by certain teams and very low salaries for the effort and results. Maybe it is changing, but the company is hiring way to many people so I doubt it, and not restructuring obsolete salary-heavy departments/teams...", "rating": 3, "pros": "Aspirational product, great colleagues, a lot of opportunities for experimentation and room to grow.", "cons": "CEO is marketing (fog) micromanager (my way or the highway), investing in marketing initiatives and not in product. Very high output by certain teams and very low salaries for the effort and results. Maybe it is changing, but the company is hiring way to many people so I doubt it, and not restructuring obsolete salary-heavy departments/teams...", "advice": null}, {"title": "Nice people, international teams, challenging tasks", "text": "Pros + great atmosphere + good new on-boarding process + really nice, easy going colleagues and you want go out for a drink with them :) + awesome new office close to Rosa-Luxemburg Platz + appreciations of your job + academy where you can improve your soft skills Cons - sometimes there are to many changes", "rating": 5, "pros": "+ great atmosphere", "cons": "- sometimes there are to many changes", "advice": null}, {"title": "Lot of trust and freedom how you", "text": "Pros You got hired, because you were the best from the applicants for that job. Having said that, you have the trust of your manager, that you will be doing an awesome job. Your manager supports you being great in your field, you get authority and all the support you need to be successful. You have the freedom to do what you think is the best to do - because you are the expert of your field. You have deadlines and projects, you have to deliver - it is up to you, how you will do that, your manager is not telling you the how, but he is always there and available if you need his support. People are treated like adults. Culture is super colourful, 36+ nationalities are working together, 50% of the employees are international people. It is a great mix of different mindsets, backgrounds, cultures and religions. It is all about being open, accepting each other in a way we are. What matters is what is in your head, how good are you in your profession. The new office in Berlin Mitte is just awesome. Big space, 5 floors, everything is new - it feels very homy. Big windows, lots of light, lot of meeting rooms, lot of extra space if you don't want to work the entire day just at your desk. Great community room, huge kitchen on the 2nd floor. Cons We could be more flexible in working hours, currently the core working hours are between 11.00 am - 5.00 pm, we could reduce that time a bit. Advice to Management Just keep doing what you are doing: being present and available for all employees, being transparent on how Babbel is doing, giving great presentations from time to time, organising social and technical activities, like hackdays, etc. Being role models and great motivators for employees.", "rating": 5, "pros": "You got hired, because you were the best from the applicants for that job. Having said that, you have the trust of your manager, that you will be doing an awesome job. Your manager supports you being great in your field, you get authority and all the support you need to be successful. You have the freedom to do what you think is the best to do - because you are the expert of your field. You have deadlines and projects, you have to deliver - it is up to you, how you will do that, your manager is not telling you the how, but he is always there and available if you need his support. People are treated like adults.", "cons": "We could be more flexible in working hours, currently the core working hours are between 11.00 am - 5.00 pm, we could reduce that time a bit.", "advice": "Just keep doing what you are doing: being present and available for all employees, being transparent on how Babbel is doing, giving great presentations from time to time, organising social and technical activities, like hackdays, etc. Being role models and great motivators for employees."}, {"title": "Great atmosphere, nice people", "text": "Pros I was feeling welcome from day one, made friends and got to know my responsibilities and got trained for the job. I love my brand new Babbel bike and great new office location. Cons A little chaotic sometimes with the processes and workflow. Advice to Management Be more organised", "rating": 5, "pros": "I was feeling welcome from day one, made friends and got to know my responsibilities and got trained for the job. I love my brand new Babbel bike and great new office location.", "cons": "A little chaotic sometimes with the processes and workflow.", "advice": "Be more organised"}, {"title": "Do yourself a favour, stay away from this company", "text": "Pros great colleagues, true life friends Cons - unexperienced people with arrogant attitude - no product vision - no transparency Advice to Management reorganise product-engineering, ASAP", "rating": 3, "pros": "great colleagues, true life friends", "cons": "- unexperienced people with arrogant attitude", "advice": "reorganise product-engineering, ASAP"}, {"title": "Awesome 1st Impressions", "text": "Pros 1. Babbel make a real effort from day 1, you are welcomed into the team with a buddy system which means that you always have a go to point for any small questions 2. The staff seem to really enjoy working here, there is a pervasive friendly attitude and you are made to feel at home right away, including by the CEO who meets with you personally in the first few days 3. Babbel are doing language education really well, so you feel you are working in a socially useful company 4. The working culture is healthy, good hours with flexibility. Babbel have adopted the Swedish 6 hour working day, which is shown to increase productivity. Cons So far, the only real negative is the ancient elevator which could really do with some extra horsepower. Advice to Management My first impressions have been awesome, please keep this up", "rating": 5, "pros": "1. Babbel make a real effort from day 1, you are welcomed into the team with a buddy system which means that you always have a go to point for any small questions", "cons": "So far, the only real negative is the ancient elevator which could really do with some extra horsepower.", "advice": "My first impressions have been awesome, please keep this up"}, {"title": "Poor execution, leadership and direction", "text": "Pros - Babbel has a product that has a purpose (to teach people languages). - Easy working hours, no pressure whatsoever Cons - Poor leadership that focuses only on organisational issues all the time and forget to lead; - Especially in Product and Engineering, the company fails to deliver an exciting vision, direction and achievement; - Very little opportunity to learn if you have been around in tech companies for a little bit - Too many meetings, no clear decision makers, sloppy decisions. Everything is painful and slow! Advice to Management Stop focusing on risks, planning and alignment, start leading people by defining a good vision and direction; then, let people do their jobs!", "rating": 3, "pros": "- Babbel has a product that has a purpose (to teach people languages).", "cons": "- Poor leadership that focuses only on organisational issues all the time and forget to lead;", "advice": "Stop focusing on risks, planning and alignment, start leading people by defining a good vision and direction; then, let people do their jobs!"}, {"title": "Uncommited employees and management obsession", "text": "Pros - Well know company in Berlin - Flexible hours - Good infrastructure Cons - Uncommited employees (It's OK to not get the job done. People just don't care about not delivering what they were commited to do. This keep happening very often and nobody takes any action to solve it.) - They try to push you a \"company culture\" that actually doesn't exist (with welcome e-mails, welcome day, jammer, hackdays, blind lunchs), but in reality, the majority of people are too proud of themselves. They don't look at each other or they don't even say hi in the morning. - Management obsession (You can easily have 5 or 6 managers/supervisors) - Unhelpful HR (Don't expect anything from them. They just don't answer you. Do everything by yourself. This is very problematic when you don't speak German.) - Unprepared line managers (Technical people in management positions that have no ideia what they are doing) - Too much bureaucracy (You can't do anything without dozen of meetings. Even the simplest one.) - Meetings, meetings, meetings..", "rating": 3, "pros": "- Well know company in Berlin", "cons": "- Uncommited employees (It's OK to not get the job done. People just don't care about not delivering what they were commited to do. This keep happening very often and nobody takes any action to solve it.)", "advice": null}, {"title": "Lack of vision, Poorest management ever", "text": "Pros You can sit pretty, chill and no one will notice. Cons Lack of vision, Poor management, no professionalism. The company doesn't care about the employees", "rating": 1, "pros": "You can sit pretty, chill and no one will notice.", "cons": "Lack of vision, Poor management, no professionalism. The company doesn't care about the employees", "advice": null}, {"title": "nicest people ever", "text": "Pros amazing team, nice working hours, interesting challenges and responsibilities, good work-life-balance Cons still start-up like, some structures are missing Advice to Management more benefits", "rating": 5, "pros": "amazing team, nice working hours, interesting challenges and responsibilities, good work-life-balance", "cons": "still start-up like, some structures are missing", "advice": "more benefits"}, {"title": "Young, ambitious, international environment", "text": "Pros Very international, very young. The company feels like a big family. Meaningful work and lots of responsibility. Flexible working hours. Cons Process and organization change a lot, fast growth can sometimes seem chaotic.", "rating": 5, "pros": "Very international, very young. The company feels like a big family. Meaningful work and lots of responsibility. Flexible working hours.", "cons": "Process and organization change a lot, fast growth can sometimes seem chaotic.", "advice": null}, {"title": "Good place to lie low while you look for something better. Don't be conned by the \"personal development opportunities", "text": "Pros Well-known \"startup\" in Berlin. Intelligent people. Late start time (must be at work by 11am). Relaxed approach. Good place to lie low while you find something better. Good place if to stay if you're unambitious. Cons Monotonous work. Poor strategy - expectations fly in the face of previous results. No personal growth potential. NOT a startup. Unclear methods of calculating salary. No real guidance for new-starters. Very little attempt to engage employees in their work - would rather focus on providing you with a different kind of drink (a highlight was the introduction of Apfelschörle). Sad to see so many talented people wasted by having so many limitations put on them. Poor communication between departments. SO MANY spam emails from colleagues about Yoga... seriously guys, come on! Advice to Management The best ideas normally come from someone outside of your team - listen to the people you've employed. Enforcing a \"no holidays in January\" policy does nothing for morale.", "rating": 3, "pros": "Well-known \"startup\" in Berlin.", "cons": "Monotonous work.", "advice": "The best ideas normally come from someone outside of your team - listen to the people you've employed."}, {"title": "Tolle Arbeitsatmosphäre und großes Comittment bei Mitarbeitern und Management", "text": "Pros Schönes Produkt, internationale Arbeitsumgebung, sehr nette Kollegen, interessante Aufgaben, tolles Office in Mitte, werteorientierte Führung Cons Manchmal dauert die Umsetzung von neuen Prozessen etwas lange", "rating": 5, "pros": "Schönes Produkt, internationale Arbeitsumgebung, sehr nette Kollegen, interessante Aufgaben, tolles Office in Mitte, werteorientierte Führung", "cons": "Manchmal dauert die Umsetzung von neuen Prozessen etwas lange", "advice": null}, {"title": "Meaningful Product, Nice Team", "text": "Pros Sehr nette Kollegen Produkt Purpose Faire Arbeitszeiten Yoga Classes Fahrrad Cons Micromanagement - wenig Gestaltungsspielraum kein Home-Office Wenig Urlaub Advice to Management Traut euch mal neue Wege zu gehen. Gebt dem Team mehr Raum für Experimente.", "rating": 3, "pros": "Sehr nette Kollegen", "cons": "Micromanagement - wenig Gestaltungsspielraum", "advice": "Traut euch mal neue Wege zu gehen. Gebt dem Team mehr Raum für Experimente."}, {"title": "Flexibles Timing, unprofessionell, skrupellose Bereichsleiter", "text": "Pros Flexible Zeiteinteilung. Das ist alles! Flexible timings. That's it ! Cons Die meisten Leute sind nett. Einige Leute im höheren Management sind komplett unprofessionell, jedoch nicht alle! Man erkennt, dass es eine Katastrophe ist, wenn Leute in den Fünfzigern in einem Start-Up-Unternehmen im Management sitzen und neurotisch in allem sind, was ihr eigenes Feedback angeht, aber jüngeren Leuten in anderen Abteilungen überhaupt keine Bedeutung beigemessen wird. In einer Umgebung wie dieser ist kein Platz für Persönliches. Sie können sich unmöglich verhalten und machen, was sie wollen, nur weil sie „Leiter von XX “ sind. Man sollte auf skrupelloses Verhalten vorbereitet sein. Hinterm Rücken über jedermann herziehen ist ganz normal. Und das Schlimmste ist, dass die Leute, die für die Koordination zwischen den verschiedenen Teams verantwortlich sind, darüber Bescheid wissen und offensichtlich kein Problem damit haben. Es wird ausgenutzt, wenn man mit den Gehaltserwartungen in Berlin nicht vertraut ist. Nicht sehr gut für die eigene Weiterbildung, da sie Open Source Software verwenden und glauben, dass es der Hit ist. Die Arbeit für diese komischen Leuten macht keinen Spaß. Gesamt gesehen kein professionelles Arbeitsumfeld, eher eine persönliche Show für diese Oldies. Most colleagues are nice people. Some of the people at senior level are utterly unprofessional, Not all yet some. You know it's a disaster when people in their fifties are at senior level in a 'START UP' and are obsessive about their feedback in everything and dismissive of younger people in different departments. No Personal space is possible in an environment like this. They can get away with all of this unwanted behavior because of their title 'Head of XX'. Also be ready for unethical behavior. Talking bad about everyone behind his/her back, is common. Worst part is, people who are responsible for coordination between different teams know that kind of language is being used and are still 'OK' with it. They will take advantage of you, if you are not familiar with salary expectations in Berlin. Not good for career as they use open source software and think it's the end of the world. Work is not fun here under these specific people. Overall Not a professional working environment. More like a personal show for these oldies. Advice to Management Schaut euch die Abteilungsleiter genau an. Kein Wachstum (weder beruflich noch intellektuell oder in ethischer Hinsicht) ist möglich, wenn man unter einem von diesen Menschen arbeitet Take a good look at the heads of your departments. No growth (Professionally, Intellectually, Ethically) is possible under one of these people.", "rating": 1, "pros": "Flexible Zeiteinteilung. Das ist alles!", "cons": "Die meisten Leute sind nett.", "advice": "Schaut euch die Abteilungsleiter genau an. Kein Wachstum (weder beruflich noch intellektuell oder in ethischer Hinsicht) ist möglich, wenn man unter einem von diesen Menschen arbeitet"}, {"title": "Großartig", "text": "Pros Offenes Arbeitsumfeld, flexible Arbeitszeiten, Snacks, Club-Mate Open Work Enivorment, Flexible Timings, Snacks, Club Mate Cons Nicht viel Gelegenheiten zum Lernen, langsam mit Veröffentlichungen Less Opportunities to Learn, Slow to release", "rating": 5, "pros": "Offenes Arbeitsumfeld, flexible Arbeitszeiten, Snacks, Club-Mate", "cons": "Nicht viel Gelegenheiten zum Lernen, langsam mit Veröffentlichungen", "advice": null}, {"title": "Chaotisches Startup-Unternehmen wie jedes andere", "text": "Pros Ziemlich nette Mitarbeiter. Das Arbeitsgebiet (Spracherwerb) interessiert mich. Es gibt auch manchmal gute Partys. The people working in the company are quite nice. The field (language learning) interests me. They also make nice parties sometimes. Cons Der Führungsstil ist eher amateurhaft (typisch für Startups). Es werden Technologien wie C9C12 Open Source verwendet, aber auch uralte Sachen wie Ruby on Rails 2.x und MySQL. Das Produkt ist nur eines unter vielen - und deutlich schlechter als Rosetta Stone oder Duolingo. Im Endeffekt zahlen sie weniger als andere Startups in Berlin. The management of the company is quite amateur (typical of startups). The technologies used are open source, yet quite ancient, like Ruby on Rails 2.x and MySQL. The product itself is just one of many - and quite inferior to Rosetta Stone or Duolingo. For the bottom line, they pay less than other Berlin startups. Advice to Management Führungsschulungen, IT aufrüsten, marktübliche Gehaltssätze zahlen Get some leadership training, upgrade your IT, pay market salaries", "rating": 3, "pros": "Ziemlich nette Mitarbeiter. Das Arbeitsgebiet (Spracherwerb) interessiert mich. Es gibt auch manchmal gute Partys.", "cons": "Der Führungsstil ist eher amateurhaft (typisch für Startups). Es werden Technologien wie C9C12 Open Source verwendet, aber auch uralte Sachen wie Ruby on Rails 2.x und MySQL. Das Produkt ist nur eines unter vielen - und deutlich schlechter als Rosetta Stone oder Duolingo. Im Endeffekt zahlen sie weniger als andere Startups in Berlin.", "advice": "Führungsschulungen, IT aufrüsten, marktübliche Gehaltssätze zahlen"}]