[{"title": "An amazing company and a great place to work", "text": "Pros - The opportunities you get to develop yourself are excellent. Senior staff take a lot of time to give you feedback and help you improve your ways of working. The people you work with are very good at what they do and there are plenty of opportunities to learn from them. I find that I have developed rapidly since joining Baringa. - It's a great environment to develop your career. There are continuous opportunities to take on greater challenges and increase your responsibility within the firm. You can also get excellent career mentors at Baringa, who will challenge you and help you to push your career in the direction that you want to go. There are also four promotion rounds a year. - The social network and the support network you get at Baringa is incredible. We have an excellent work social life, with plenty of opportunities for fun. The teams that you work with also provide a lot of support to you make sure that you are getting the help you need to work well both off and on client site. - You can really shape the company with your own ideas and initiatives. Baringa is always on the look out for new opportunities, and if you have an area that you are passionate about or interested in Baringa is a great environment to pursue this. Cons - Baringa has been a bit slow to think 'global' as an organisation, despite now having offices in several countries (and continents!). Baringa is making progress in this area, but it should continue to think globally, in order to work effectively from an operational point of view and best serve its clients. Advice to Management Think globaly; operationally, as well as commercially.", "rating": 5, "pros": "- The opportunities you get to develop yourself are excellent. Senior staff take a lot of time to give you feedback and help you improve your ways of working. The people you work with are very good at what they do and there are plenty of opportunities to learn from them. I find that I have developed rapidly since joining Baringa.", "cons": "- Baringa has been a bit slow to think 'global' as an organisation, despite now having offices in several countries (and continents!). Baringa is making progress in this area, but it should continue to think globally, in order to work effectively from an operational point of view and best serve its clients.", "advice": "Think globaly; operationally, as well as commercially."}, {"title": "Awesome company", "text": "Pros super awesome work very interesting great team Cons hardworking long hours hardworking long hours hardworking long hours hardworking long hours", "rating": 5, "pros": "super awesome work very interesting great team", "cons": "hardworking long hours hardworking long hours hardworking long hours hardworking long hours", "advice": null}, {"title": "2yrs in Tech Transformation - So far so good", "text": "Pros - Very little 'dead wood': Full of smart people who know their onions and are deeply passionate about their chosen field. e.g. Our Technology Transformation team are, for the most part, pretty technical in their chosen fields. - Ability to take ownership: Baringa is still relatively small so the opportunity to build a proposition/capability, or have an idea and run with it, is very real. Partners will back you if you have present a credible case. - Genuinely collaborative: This comes out in two ways, firstly business units do collaborate to try and build the right project team for each engagement. Secondly, unlike some other consultancies I feel like I could ask colleagues for help if I needed some advice or was struggling on any particular engagement, and not have it held or used against me. People want to see you succeed and this overrides most of the personal ambition/politics/agendas I've experienced elsewhere. It also encourages people to speak up rather than soldier on into situations they may not know how to handle. - Work Life Balance: In the context of consulting, Baringa makes much more than a token effort to help with this. I know that senior management and partners actively take into account personal situations (e.g. getting married, having a baby, etc) when staffing a client and will not fling someone out to the Outer Hebrides with 24hrs notice. Combined with the perks available for when you do work out of town, this becomes quite a big differentiator to me Cons - If you are a generalist it can be a little tough to find your place when you are surrounded by SMEs everywhere you turn. Advice to Management Try and retain all the things that makes Baringa different, like the 1:10 Partner:Non-Partner ratio, Christmas cards from senior mgt, summer party, family ethos, etc, as Baringa grows", "rating": 5, "pros": "- Very little 'dead wood': Full of smart people who know their onions and are deeply passionate about their chosen field. e.g. Our Technology Transformation team are, for the most part, pretty technical in their chosen fields.", "cons": "- If you are a generalist it can be a little tough to find your place when you are surrounded by SMEs everywhere you turn.", "advice": "Try and retain all the things that makes Baringa different, like the 1:10 Partner:Non-Partner ratio, Christmas cards from senior mgt, summer party, family ethos, etc, as Baringa grows"}, {"title": "Baringa is genuinely a great company!", "text": "Pros - the people: smart, engaged, enthusiastic, driven & caring. your colleagues genuinely care about you. - 0 hierarchy. no one has a corner office, and you can talk to and approach everyone without raising eyebrows - not everything is perfect, but when something goes wrong, people - all the way up to partners - try very hard to make things right - the company is growing a lot, and despite huge client demand is looking very closely at who is brought in to join - it's still a fairly small firm, so if you want to, you can contribute and get a lot of responsibility from day 1 - 3 months promotion cycle (despite some people apparently not reading the employee handbook - it is a real thing, and it avoids the strange \"once per year promotion\" frenzy) and no quota on promotions (that in my experience encourages cutthroat behaviour) - parental leave, both for men & women, is actively encouraged - mental health issues are taken seriously and you can get access to a coach to get through difficult times, no questions asked - challenges that are brought up through the annual employee opinion survey and other channels are picked up on and worked on, e.g. initiatives to improve onboarding experience, return from parental leave, performance review process, corporate social responsibility program, etc. - knowledge management is taken seriously and exists as its own function, allowing the key resource of consultants (information) to be shared better than I have seen anywhere before - innovation in people management Cons - work-life balance, but that comes with the industry. if you want 9 to 5, don't go into consulting. but at least at baringa, people are trying very hard to make it work, and you do have a lot of freedom when you start working, when you go home (as long as the work's done), and no one's saying anything if you have to take care of personal business for half a day. it's always a challenge, but you can make it work. - few international opportunities - the workforce is very international, but diversity in terms of background would be great - there are almost entire teams that consist of only big4-consultants and could benefit from not only hiring through referrals - if you want to get rich quickly, baringa probably isn't the right place to start. salaries are okay, but not outstanding - staffing decisions aren't always very transparent, but if you speak up about what you want, what you don't want, my experience has been that it's taken into account as much as possible Advice to Management - encourage junior people actively to interact outside of their immediate current project, their team or business unit to get a broader view of the company, get to know a wider range of people and to have more channels of communication - manage expectations better - be honest about things like time to next promotion, what skills are required, time management, ... sometimes, consulting is hard, and it's better to know that up front", "rating": 5, "pros": "- the people: smart, engaged, enthusiastic, driven & caring. your colleagues genuinely care about you.", "cons": "- work-life balance, but that comes with the industry. if you want 9 to 5, don't go into consulting. but at least at baringa, people are trying very hard to make it work, and you do have a lot of freedom when you start working, when you go home (as long as the work's done), and no one's saying anything if you have to take care of personal business for half a day. it's always a challenge, but you can make it work.", "advice": "- encourage junior people actively to interact outside of their immediate current project, their team or business unit to get a broader view of the company, get to know a wider range of people and to have more channels of communication"}, {"title": "I wouldn't want to work in any other consultancy", "text": "Pros - Baringa genuinely has some of the best people in the industry. Although they now hire some graduates, the majority of new joiners have several years of consulting or industry experience - Fun and welcoming work environment - Opportunity to get involved in loads of internal work and to accelerate career - Very strong reputation amongst all clients. Cons - It is consulting, so projects can be tough at times - but the firm genuinely does as much as it can to make this manageable for individuals Advice to Management Keep doing what you're doing - and keep trying to be different as the firm gros", "rating": 5, "pros": "- Baringa genuinely has some of the best people in the industry. Although they now hire some graduates, the majority of new joiners have several years of consulting or industry experience", "cons": "- It is consulting, so projects can be tough at times - but the firm genuinely does as much as it can to make this manageable for individuals", "advice": "Keep doing what you're doing - and keep trying to be different as the firm gros"}, {"title": "Great company with and amazing culture", "text": "Pros Excellent culture and surrounded by highly capable people in a collaborative environment. Cons Sometimes too nice with their feedback on performance.", "rating": 5, "pros": "Excellent culture and surrounded by highly capable people in a collaborative environment.", "cons": "Sometimes too nice with their feedback on performance.", "advice": null}, {"title": "Recent joiner", "text": "Pros - nice / enthusiastic / smart colleagues - good learning opportunities - company genuinely cares about employees - company is growing Cons - Baringa brand fairly unknown - salary and benefits not on par with top consulting firms - office could be nicer. being spilt across two buildings not ideal - limited international opportunities - not that diverse in terms of nationalities Advice to Management Invest in building the Baringa brand and sending a clear and consistent message to clients. Hire software developers to build custom solutions. Diversify recruitment. Focusing on referrals does not promote diversity.", "rating": 5, "pros": "- nice / enthusiastic / smart colleagues", "cons": "- Baringa brand fairly unknown", "advice": "Invest in building the Baringa brand and sending a clear and consistent message to clients."}, {"title": "Not what you expect", "text": "Pros Lots of young, ambitious and collaborative people Cons You are brainwashed every day about “Baringa culture” and how great the company is. You either fit or you must pretend to fit, there is no way to get time for yourself; this kind of \"introverted\" behaviour raises eyebrows. Projects are usually short (10 weeks) and understaffed (somehow Baringa needs to be competitive against the big guys) so you end up working by yourself in random locations & definitely not on the most intellectually challenging tasks. There is a lot of talk around senior management listening and trying to improve working conditions but actually it reminds me of George Orwell's \"doublethink\": they can tell you they care about work/life balance but actually do nothing about it and set a terrible example themselves. Most of us joined because of the glassdoor reviews but what we found is quite different from what we expected. As the company expands I expect more and more reviews like this to be posted. Consider yourself warned. Advice to Management Stop pretending this is an NGO and start trying to actually improve working conditions for your employees.", "rating": 3, "pros": "Lots of young, ambitious and collaborative people", "cons": "You are brainwashed every day about “Baringa culture” and how great the company is. You either fit or you must pretend to fit, there is no way to get time for yourself; this kind of \"introverted\" behaviour raises eyebrows.", "advice": "Stop pretending this is an NGO and start trying to actually improve working conditions for your employees."}, {"title": "Consultant", "text": "Pros Really great company to work for and some of the smartest people I have ever had the pleasure of working alongside. Cons Out of town work was a bit of a killer", "rating": 5, "pros": "Really great company to work for and some of the smartest people I have ever had the pleasure of working alongside.", "cons": "Out of town work was a bit of a killer", "advice": null}, {"title": "Brighter Together?... Personally I’m Brighter Apart", "text": "Pros Good location and a number of good sizeable clients. Fairly flat structure that allows for seamless interaction with partners and juniors alike. Cons Being an “extra body” 98% of the time. Rarely are you involved with actual thoughtful work or something that is genuinely satisfying. Typically work is built around ludicrous deadlines or workloads. Repeatedly being told that it’s a good place to work - only to find that this process is not much more than a tick box exercise that is bought into, supported by pressure to leave a review on Glassdoor (in my first year I probably would have left a positive review too). Advice to Management Think about who is doing what, what skillset? Throwing bodies at a problem isn’t always the best solution.", "rating": 1, "pros": "Good location and a number of good sizeable clients. Fairly flat structure that allows for seamless interaction with partners and juniors alike.", "cons": "Being an “extra body” 98% of the time. Rarely are you involved with actual thoughtful work or something that is genuinely satisfying. Typically work is built around ludicrous deadlines or workloads.", "advice": "Think about who is doing what, what skillset?"}, {"title": "Not a Great Place to Work! Definitely Not!", "text": "Pros Bunch of very enthusiastic people - or so they seem! Cons Very cliquey culture. If you do not blend in - you will be forced to pretend to be a part of the mix and enjoy it. Asking for some alone time – is a crime and will be remembered. It will come out in your reviews! If you want to hold on to your individuality, and do projects which challenge you intellectually, this company is not for you. Most of the projects are one man bands - people dropped into client environments to project manage an ongoing initiatives. No strategic thinking, no value add, no intellectual indulgence - you just end up managing risk logs and project plans! Beware - if you are intellectually inclined. For those who want an easy life and still call it consulting - this is the right place for you! Favoritism is rampant, promotions go to people who learn the art of Brown nosing the decision makers, and feedback process is a joke! Feedback means - I will sit you down and tell you why you are completely useless! There is no positive reaffirmations, no words of encouragement, no development plans, just negativity in the name of feedback! Complete joke! Advice to Management The Baringa Bubble has burst. Please stop being in denial. Your leadership team is demoralising people. People are scared to speak out - as they know the consequences. They are even scared to say the truth in surveys - for fear of being identified. Your leadership team is vindictive - they single out people and take out their vengeance in creative ways! This has become a soul destroying place! Please wake up!", "rating": 1, "pros": "Bunch of very enthusiastic people - or so they seem!", "cons": "Very cliquey culture. If you do not blend in - you will be forced to pretend to be a part of the mix and enjoy it. Asking for some alone time – is a crime and will be remembered. It will come out in your reviews! If you want to hold on to your individuality, and do projects which challenge you intellectually, this company is not for you. Most of the projects are one man bands - people dropped into client environments to project manage an ongoing initiatives. No strategic thinking, no value add, no intellectual indulgence - you just end up managing risk logs and project plans! Beware - if you are intellectually inclined. For those who want an easy life and still call it consulting - this is the right place for you!", "advice": "The Baringa Bubble has burst. Please stop being in denial. Your leadership team is demoralising people. People are scared to speak out - as they know the consequences. They are even scared to say the truth in surveys - for fear of being identified. Your leadership team is vindictive - they single out people and take out their vengeance in creative ways! This has become a soul destroying place! Please wake up!"}, {"title": "Manager", "text": "Pros Excellent company to work for. Fantastic collaborative culture with extremely talented staff. Cons Like all consulting, projects can vary and travel can be tiring.", "rating": 5, "pros": "Excellent company to work for. Fantastic collaborative culture with extremely talented staff.", "cons": "Like all consulting, projects can vary and travel can be tiring.", "advice": null}, {"title": "A great place to work", "text": "Pros Incredibly smart and high-calibre colleagues Amazing client base -- all the key names you would hope to be working with are there Non-hierarchical structure Interesting and intellectually challenging projects Cons Can be long hours and intensive work, but that is the nature of Management Consulting Advice to Management Maintain the unique culture as the company grows", "rating": 5, "pros": "Incredibly smart and high-calibre colleagues", "cons": "Can be long hours and intensive work, but that is the nature of Management Consulting", "advice": "Maintain the unique culture as the company grows"}, {"title": "Good place to work, but losing focus on what really matters", "text": "Pros -Some really nice colleagues to work with -A healthy amount of social events, including a company weekend away in a nice resort, and a black tie party dinner -Relatively flat structure -Although the brand has little recognition, the marketing team is working hard on putting the name out there Cons -Too much emphasis on pushing the \"we are such a cool place to work\" message -New branding looks much less professional -Uneven new hire quality across different business units -Managers will not hesitate to throw you under the bus (but that's a standard in the industry) -While they pretend to care of your work life balance, the reality is very different and there is no regard for your time, private life, or prior commitments (again, an industry-wide issue). Advice to Management Focus on being (and looking like) a professional services firm. Our image should not be that of an NGO that is going to save the world, but rather of a consulting firm.", "rating": 3, "pros": "-Some really nice colleagues to work with", "cons": "-Too much emphasis on pushing the \"we are such a cool place to work\" message", "advice": "Focus on being (and looking like) a professional services firm. Our image should not be that of an NGO that is going to save the world, but rather of a consulting firm."}, {"title": "Like a glove?", "text": "Pros Baringa is full of positive energy and can-do attitude. The workforce is young, dynamic and keen. This is a company that could grow to a large company, and does indeed have those aspirations The management ask for input, and seem to really care, and they are really desperate to make sure you fit in... Cons High on Baringa's agenda is making sure you fit their mould. They are big fans of \"letting you have your say\" but ultimately if you disagree with the management diktat then they will find some clever words to force their perspective. Also high on the agenda is forced fun. Be prepared (again) to fit in, or die trying. Whilst summer parties, picnics and free lunches sound great on paper, socialising with 500 identikit consultants wears thin. Very quickly. Baringa's partners and employees are well meaning, they just don't really understand different points of view. The work life balance here is awful, and at times for no good reason. Be prepared for six month solo assignments in a far flung English towns with little to no support. You have been warned! Advice to Management There is more talent out there than just employing horsey ex public school Accenture clones. Please, please broaden your perspective. Oh and throwing your money around is not the only way to make your employees like you. Finally, all those tall tales of a family like atmosphere and a close knit community will fall by the wayside with your expansion plans. Before long all that will be left is yet another big beast consultancy firm with younger more dynamic companies snapping at Baringa's heels.", "rating": 3, "pros": "Baringa is full of positive energy and can-do attitude. The workforce is young, dynamic and keen. This is a company that could grow to a large company, and does indeed have those aspirations", "cons": "High on Baringa's agenda is making sure you fit their mould. They are big fans of \"letting you have your say\" but ultimately if you disagree with the management diktat then they will find some clever words to force their perspective.", "advice": "There is more talent out there than just employing horsey ex public school Accenture clones. Please, please broaden your perspective."}, {"title": "A great place to start my career", "text": "Pros A few key things stick out for me:  - A company of incredibly high caliber people  - A culture that promotes collaboration, inclusiveness and excellence  - High investment into learning and development, and knowledge management  - A strong reputation with clients  - An entrepreneurial attitude developing the company for the      future Cons 'What's Baringa?' - a question that gets asked occasionally, but more infrequenctly as we grow Advice to Management Keep us ahead of the curve, and work to prevent us becoming 'just another consultancy' as we grow", "rating": 5, "pros": "A few key things stick out for me:", "cons": "'What's Baringa?' - a question that gets asked occasionally, but more infrequenctly as we grow", "advice": "Keep us ahead of the curve, and work to prevent us becoming 'just another consultancy' as we grow"}, {"title": "Great place to work", "text": "Pros -Transparency of staffing, company performance and future strategy - Support from senior team members - like nothing I have experienced anywhere else - Compensation for out of town working and long commutes - Team socials and activities - Ability to discuss options for your next project - Variety of work - unlike larger consultancies, there are plenty of smaller projects covering extremely interesting areas; not just large implementation projects Cons Sometimes teams can be very small, which is a big difference if you are coming from a larger consultancy - especially if working out of town.", "rating": 5, "pros": "-Transparency of staffing, company performance and future strategy", "cons": "Sometimes teams can be very small, which is a big difference if you are coming from a larger consultancy - especially if working out of town.", "advice": null}, {"title": "The Best Career Choice I Made", "text": "Pros Having spent over 5 years in industry working for a Large Energy Retailer, I moved to Baringa 4.5 years ago; I'm not one for propaganda but Baringa is genuinely the best employer I have worked for. Very few of my projects have been short term (mostly 3-18 months), giving me an opportunity to build relationships and work on a variety of interesting and stimulating topics. As a result I have grown and learned more about my chosen industry, and pushed myself to become better than I would have been otherwise. So in general, I'm absolutely delighted by my day to day job satisfaction. What's distinct from other consultancies I have worked for is the culture - it genuinely feels like management know who I am and appreciate my contribution. Moreover I can think of several examples where management has given me or colleagues the room to focus on my personal life (children, sickness etc.) and have openly encouraged me to let the day to day take a back seat: this gives me sense that they business wants to build loyalty, trust and invest in me over the longer term. There is a real entrepreneurial spirit here. That shouldn't be confused with commercial ruthlessness. It's better characterised as giving people the freedom to try, to treat this as their own business, and to fail without recrimination. There's loads more that I'm sure other reviews have alluded to; company events, general social scene etc. Cons There are some odd policies around compensation for those who live outside London. Therefore whilst I still get paid more than my peers in other organisations, I find myself paid less than or equal to London based employees of Baringa who are of a lower grade. The culture is also a little London-centric in general, so those who are not based in the City can feel isolated.", "rating": 5, "pros": "Having spent over 5 years in industry working for a Large Energy Retailer, I moved to Baringa 4.5 years ago; I'm not one for propaganda but Baringa is genuinely the best employer I have worked for.", "cons": "There are some odd policies around compensation for those who live outside London. Therefore whilst I still get paid more than my peers in other organisations, I find myself paid less than or equal to London based employees of Baringa who are of a lower grade. The culture is also a little London-centric in general, so those who are not based in the City can feel isolated.", "advice": null}, {"title": "Manager", "text": "Pros - caring consultancy where every employee is treated as an individual - truly collaborative way of working with clients - opportunity to work with some of the best people in the industry to deliver real change to clients Cons - work/ life balance can be difficult to achieve in any consultancy and leadership don't always set the best example Advice to Management Ensure that each new business unit and geography has the Baringa culture running through it", "rating": 5, "pros": "- caring consultancy where every employee is treated as an individual", "cons": "- work/ life balance can be difficult to achieve in any consultancy and leadership don't always set the best example", "advice": "Ensure that each new business unit and geography has the Baringa culture running through it"}, {"title": "Great company....but....", "text": "Pros - A great place to work compared to other consulting firms, with some very smart people and fantastic projects - Socials and parties are second to none, to the point of sometimes being exhausting! - Clients absolutely love Baringa and on (most) projects you can feel the difference you are making to their business - Most of the senior leadership genuinely care about you and are open to new ideas Cons - Work life balance can be appalling, especially if your Partner / Director goes overboard trying to impress the client. The team then bears the brunt creating, formatting or polishing slides that may be thrown away, or the client doesn't care about. - The 3 month promotion cycle can be a double edged weapon. You may be denied one this time just because the next one is just around the corner... - Not as meritocratic as the senior leadership would like to think. Outstanding project delivery won't guarantee a promotion, being a Director / Partner's pet will. Advice to Management Act now on the feedback around work life balance. Baringa has a lot going for it so would be a shame to see it turn into just another factory of consultants.", "rating": 5, "pros": "- A great place to work compared to other consulting firms, with some very smart people and fantastic projects", "cons": "- Work life balance can be appalling, especially if your Partner / Director goes overboard trying to impress the client. The team then bears the brunt creating, formatting or polishing slides that may be thrown away, or the client doesn't care about.", "advice": "Act now on the feedback around work life balance. Baringa has a lot going for it so would be a shame to see it turn into just another factory of consultants."}, {"title": "Still a great place to work", "text": "Pros Being surrounded by great people, who really are the best at what they do. The client portfolio built through great delivery and results is impressive. You do not feel like a 'cog in the works'. Access to leadership is not an issue at all. You get a clear input to the roles you work on, helping ensure they tie in to your development needs Cons The promotion process can appear as slightly different across Business Units Advice to Management Continue providing the direct access and availability to everyone.", "rating": 5, "pros": "Being surrounded by great people, who really are the best at what they do.", "cons": "The promotion process can appear as slightly different across Business Units", "advice": "Continue providing the direct access and availability to everyone."}, {"title": "Incredible company with a really unique culture", "text": "Pros A true meritocracy with a real focus on supporting each and every employee. The leaders of the business are always accessible and proactively speak to employees about their thoughts on the business and how they can continue to improve it. The people and culture is incredible and unlike any other organisation I have experienced. Cons Work-life balance is always going to be a challenge in a consultancy, but the Partners have put everything in place to try and support individuals to manage their time appropriately. Advice to Management Protect the culture as the company grows. It is clear however that this is something that is at the forefront of the Partners minds which is great to see.", "rating": 5, "pros": "A true meritocracy with a real focus on supporting each and every employee. The leaders of the business are always accessible and proactively speak to employees about their thoughts on the business and how they can continue to improve it. The people and culture is incredible and unlike any other organisation I have experienced.", "cons": "Work-life balance is always going to be a challenge in a consultancy, but the Partners have put everything in place to try and support individuals to manage their time appropriately.", "advice": "Protect the culture as the company grows. It is clear however that this is something that is at the forefront of the Partners minds which is great to see."}, {"title": "Consistent overpromising equals consistent overworking", "text": "Pros - Great people - Flat structure - Appearance of meritocracy - Great events & socials - Family friendly initiatives Cons - Despite lip service, complete inability to manage work/life balance - Consistent overselling and mismanagement of scope - Overworked staff - Long hours are frequently overlooked ( > Big 4) - Limited influence on staffing Advice to Management Focus on your people and really listen to them", "rating": 3, "pros": "- Great people", "cons": "- Despite lip service, complete inability to manage work/life balance", "advice": "Focus on your people and really listen to them"}, {"title": "Not a good experience", "text": "Pros - Flat structure, approachable senior people and partners - Good benefits and career progression - Interesting projects and knowledgeable people - Some very friendly people Cons - Very stressful job with a lot of pressure coming from people who are very driven and ambitious - Despite the company boasting about work life balance, this in reality inaccurate for people working in certain teams with short and very demanding projects. - Many people are overworked but project managers and partners turn the blind eye Advice to Management Pay more attention to work life balance to avoid people burning out and leaving the company", "rating": 3, "pros": "- Flat structure, approachable senior people and partners", "cons": "- Very stressful job with a lot of pressure coming from people who are very driven and ambitious", "advice": "Pay more attention to work life balance to avoid people burning out and leaving the company"}, {"title": "A friendly company with a specialist focus", "text": "Pros Baringa has an emphasis on excellence and recognition of hard work. The company culture is quite open and positive, making it a nice place to work overall. Cons The work/life balance is not great with the management often not leading by example. The scope of projects seems to be fueled by change-management and implementation engagements, with limited opportunities elsewhere. Advice to Management With the work/life balance embedded in the company's stated values, the actions of the management group seem to be sending the opposite message. More consistency between values and leading by example would contribute to a more balanced company culture.", "rating": 3, "pros": "Baringa has an emphasis on excellence and recognition of hard work. The company culture is quite open and positive, making it a nice place to work overall.", "cons": "The work/life balance is not great with the management often not leading by example. The scope of projects seems to be fueled by change-management and implementation engagements, with limited opportunities elsewhere.", "advice": "With the work/life balance embedded in the company's stated values, the actions of the management group seem to be sending the opposite message. More consistency between values and leading by example would contribute to a more balanced company culture."}, {"title": "Fun Consulting", "text": "Pros Baringa actually supports work life balance, both with their policies and more importantly their culture. I feel like the senior management respects me and listens to my input on what roles I want to take on. Cons Often times, our roles can be out of town. Baringa does have great policies in place to help mitigate the impact, but it can be demanding sometimes.", "rating": 5, "pros": "Baringa actually supports work life balance, both with their policies and more importantly their culture. I feel like the senior management respects me and listens to my input on what roles I want to take on.", "cons": "Often times, our roles can be out of town. Baringa does have great policies in place to help mitigate the impact, but it can be demanding sometimes.", "advice": null}, {"title": "Baringa Partners", "text": "Pros Great corporate team and a great culture to boot! Cons None that I can think of.", "rating": 5, "pros": "Great corporate team and a great culture to boot!", "cons": "None that I can think of.", "advice": null}, {"title": "Supportive and Engaging Firm", "text": "Pros Respectful environment that enables you to develop your career and balance your personal life Cons Less structure than the big 4, can spend time on bench waiting for the right role", "rating": 5, "pros": "Respectful environment that enables you to develop your career and balance your personal life", "cons": "Less structure than the big 4, can spend time on bench waiting for the right role", "advice": null}, {"title": "A genuinely great place to work", "text": "Pros Great opportunities to progress your career working with a wide range of clients Ability to work within a team or by yourself Fully supported by the leadership team and encouraged to develop/stretch yourself Cons Difficulty in maintaining a work/life balance (more of a personal reflection than can be attributed to the company) Advice to Management Maintain the great diversity and mix of people that are recruited and ensure that the company keeps the same focus on culture and values as it increases in size", "rating": 5, "pros": "Great opportunities to progress your career working with a wide range of clients", "cons": "Difficulty in maintaining a work/life balance (more of a personal reflection than can be attributed to the company)", "advice": "Maintain the great diversity and mix of people that are recruited and ensure that the company keeps the same focus on culture and values as it increases in size"}, {"title": "New joiner", "text": "Pros Great company made by great people Baringa gives you the freedom to build your career by discussing roles and opportunities directly with employees Company's transparency Cons No real cons for now but induction was maybe a bit short (only half day), it would have been great to have something planned in the afternoon on the first day. Advice to Management Keep going!", "rating": 5, "pros": "Great company made by great people", "cons": "No real cons for now but induction was maybe a bit short (only half day), it would have been great to have something planned in the afternoon on the first day.", "advice": "Keep going!"}, {"title": "Joining Baringa - best career decision I've made by miles!", "text": "Pros Has a straight-forward business model that works - focused on people and clients. Open to ideas, getting more progressive as we grow. Strong core values. Getting better a creating innovative work life options for people whilst staying true to being a consulting business. Cons It's a really successful business, growing year on year (but not too quickly) - so lots of opportunity to get busy! Advice to Management Carry on keeping a close eye on the small things", "rating": 5, "pros": "Has a straight-forward business model that works - focused on people and clients. Open to ideas, getting more progressive as we grow. Strong core values. Getting better a creating innovative work life options for people whilst staying true to being a consulting business.", "cons": "It's a really successful business, growing year on year (but not too quickly) - so lots of opportunity to get busy!", "advice": "Carry on keeping a close eye on the small things"}, {"title": "Better than the big 4 and still room for improvement!", "text": "Pros Baringa is really about the people. At almost every level of seniority comes a culture of being open, approachable and really passionate about doing great work for the client and Baringa alike. Development of our career and ability to learn new skills or subject matter is always present and within reach. But it takes two to make it work and so whilst the opportunities are there to grow, its really up to the individual to push for it. Client projects are often platforms for new challenges and areas for growth, especially if the consulting team you work for is different. This really promotes a great diversity of characters and knowledge across different industries or specialties. Not every project is the same so you will rarely (never) get bored. Cons As many have already stated the culture is always changing, meaning it is sometimes hard to understand what it means be Baringa. Salary and promotion discussions are generally quite transparent but leaves the feeling that it depends more on time spent at the company rather than any other factor. Advice to Management Don't prioritise growth over quality with the acquisition of new hires. It's not because we have business opportunities that we simply have to fill with hires that look good on paper. Quality hires that fit the culture are so important.", "rating": 5, "pros": "Baringa is really about the people. At almost every level of seniority comes a culture of being open, approachable and really passionate about doing great work for the client and Baringa alike.", "cons": "As many have already stated the culture is always changing, meaning it is sometimes hard to understand what it means be Baringa.", "advice": "Don't prioritise growth over quality with the acquisition of new hires. It's not because we have business opportunities that we simply have to fill with hires that look good on paper. Quality hires that fit the culture are so important."}, {"title": "Excellent client delivery and a unique culture makes for a perfect partnership", "text": "Pros Wonderful balance between delivering an excellent client experience and a unique (and very collegiate) culture. With very little bureaucracy and an approachable leadership team, it creates a company that can maximize its time spent on the things that really matter. Known for its talent & culture, the working environment is both highly engaging as well as having a real fun element to it. The collective Baringa community puts in a lot of effort to ensure that the term 'company benefits' goes wider that simply pay + bonus...Company events for example are something that Baringa invest heavily in, making them truly unforgettable and seen as the high point of the year...also as they always include +1's and children, everyone really gets to know each other, making it less of an organisation and more of a family. All this sounds like Baringa is still a very small company, and that's the best bit...it's not...Baringa are now 500+ people, a healthy independent partnership, £100m+ revenue, with double digit growth each year...that combination is almost unique in the consulting industry, meaning not only is the culture amazing, the economics work and it's sustainable too! Cons No real cons to call out specifically, however it's still a Consultancy and therefore travel and work life balance are always a consideration for potential new joiners - Baringa works hard to ensure this is a healthy balance, plus with the Leadership Teams & Partners being very approachable, no problem is unsolvable. Advice to Management Keep the amazing collegiate culture - our growth, engagement and above all client experience are all benefitting from it!", "rating": 5, "pros": "Wonderful balance between delivering an excellent client experience and a unique (and very collegiate) culture. With very little bureaucracy and an approachable leadership team, it creates a company that can maximize its time spent on the things that really matter.", "cons": "No real cons to call out specifically, however it's still a Consultancy and therefore travel and work life balance are always a consideration for potential new joiners - Baringa works hard to ensure this is a healthy balance, plus with the Leadership Teams & Partners being very approachable, no problem is unsolvable.", "advice": "Keep the amazing collegiate culture - our growth, engagement and above all client experience are all benefitting from it!"}, {"title": "Baringa Partners Review", "text": "Pros Great culture Interesting projects and clients Opportunities to work across different industries Exciting and growing company Clear career progression Lots of training and development Cons There are not as many opportunities for international travel as there would be at some of the larger companies; however this is changing as the company expands Advice to Management To keep doing what you are doing! Very open and transparent communication, clear performance review processes and fair staffing process.", "rating": 5, "pros": "Great culture", "cons": "There are not as many opportunities for international travel as there would be at some of the larger companies; however this is changing as the company expands", "advice": "To keep doing what you are doing! Very open and transparent communication, clear performance review processes and fair staffing process."}, {"title": "Senior Consultant", "text": "Pros Great work culture Good career opportunities Recognition Good work life balance Interest groups for those that want to get involved Very social Cons Subject to project availability, may be put on projects not necessarily interested in Varying work load project to project (could be a pro too) Advice to Management Continue building / maintaining the culture Continue opportunities to network across the company / teams", "rating": 5, "pros": "Great work culture", "cons": "Subject to project availability, may be put on projects not necessarily interested in", "advice": "Continue building / maintaining the culture"}, {"title": "Super", "text": "Pros People, with passion for business-niche they are in, and consulting. Baringa succeeds in a rare combination of fun including get-away parties, and growing business-wise. Every 3 months there is a review if someone deserves promotion, so one does not have to wait for annual review. Cons Consulting is about flexibility, so hours can be demanding. And sorry, outside hours, cant think of any other con, I did really try. Advice to Management Keep balance between Baringa as is, and growth.", "rating": 5, "pros": "People, with passion for business-niche they are in, and consulting. Baringa succeeds in a rare combination of fun including get-away parties, and growing business-wise. Every 3 months there is a review if someone deserves promotion, so one does not have to wait for annual review.", "cons": "Consulting is about flexibility, so hours can be demanding. And sorry, outside hours, cant think of any other con, I did really try.", "advice": "Keep balance between Baringa as is, and growth."}, {"title": "The best management consultancy", "text": "Pros Work with the best people in the industry with some of the most interesting clients and projects underpinned by a unique culture Cons Consulting is a challenging environment but Baringa does what it can to make the job as trouble free as possible", "rating": 5, "pros": "Work with the best people in the industry with some of the most interesting clients and projects underpinned by a unique culture", "cons": "Consulting is a challenging environment but Baringa does what it can to make the job as trouble free as possible", "advice": null}, {"title": "Rapidly changing consultancy business", "text": "Pros Direct communication between junior members of staff and partners possible due to size Friendly working environment Good for early - career professionals due to small team size/ face time with clients/ high levels of responsibility Cons Decline in calibre of candidates at junior levels in some areas of the business Mismatch between 'official' company line on work life balance and reality on the ground Loosing original cultural distinctiveness (informality among colleagues, lack of bureaucracy/ hierarchy) as a result of rapid growth Advice to Management Slow growth ambitions and focus on enriching existing capabilities/ building links among employees and between junior senior staff members Encourage informal face to face communication between upper management (especially senior partners) and rest of the staff", "rating": 3, "pros": "Direct communication between junior members of staff and partners possible due to size", "cons": "Decline in calibre of candidates at junior levels in some areas of the business", "advice": "Slow growth ambitions and focus on enriching existing capabilities/ building links among employees and between junior senior staff members"}, {"title": "Interview and Recruitment Process", "text": "Pros The entire recruitment process was very slick and engaging; the interviews were numerous and rigorous as you would expect of a prestigious company that are serious about the quality of their employees (3 interview stages). The level of feedback, speed of response and engagement from Senior Leaders across the business unit within the recruitment process (The Partner himself rang me to offer the job) meant it was an easy decision to pick Baringa. I found their people focused culture incredibly genuine from all contact I had and didn't even see the other opportunities I had through to the end because I knew Baringa had something unique to offer. Cons The recruitment process had no cons in my opinion.", "rating": 5, "pros": "The entire recruitment process was very slick and engaging; the interviews were numerous and rigorous as you would expect of a prestigious company that are serious about the quality of their employees (3 interview stages).", "cons": "The recruitment process had no cons in my opinion.", "advice": null}, {"title": "As we grow, we are changing but mainly for the better", "text": "Pros - All the talk you read about corporate culture isn't just empty words. It's really something special and in my experience unique. When push comes to shove, it's what keeps me here. - For the most part, the people you work with are exceptionally talented - We try to be good with work-life balance, and in the context of the industry we do well - Exciting place to be. New offices, new geographies and new industries each year means that there's lots going on. I believe that nobody has \"missed the boat\" in terms of our most exciting years - they are ahead of us. Cons - Performance management is not particularly empirical. This leads to visibility issues - i.e. if you're not visible but still doing a great job, this may not be noticed as it should. - The pressure really ratchets up as people get more senior. You are expected to ace your client role, still find time to develop new clients and make a strong internal contribution too. Advice to Management - Keep focusing on the things that made us great. Our familiarity with each other is so important, and a we grow it's hard to keep this without enormous effort. - Make sure new joiners are integrated better, sooner. I can see it takes some new joiners a while to settle, particularly those who are not as naturally outgoing. - Bring back the transparency to the whole company about people leaving. I know that the new opinion by senior management is that this looks negative, but it's important to recognise people's contribution over the years when they leave. I used to really like knowing who was leaving, as it would give me a chance to say goodbye and with them well. Now you just realise you haven't seen someone in months and find out they left the firm and are not in fact on an our of town project.", "rating": 5, "pros": "- All the talk you read about corporate culture isn't just empty words. It's really something special and in my experience unique. When push comes to shove, it's what keeps me here.", "cons": "- Performance management is not particularly empirical. This leads to visibility issues - i.e. if you're not visible but still doing a great job, this may not be noticed as it should.", "advice": "- Keep focusing on the things that made us great. Our familiarity with each other is so important, and a we grow it's hard to keep this without enormous effort."}, {"title": "Senior Manager", "text": "Pros Strong culture and passionate people Cons Work life balance challenges and average remuneration/benefits", "rating": 5, "pros": "Strong culture and passionate people", "cons": "Work life balance challenges and average remuneration/benefits", "advice": null}, {"title": "Friendly place to work, though a bit smug", "text": "Pros The people are easy to work with, very collegiate atmosphere. Work life balance is monitored and is better than other consultancies - absolutely no \"face time\" here. We are growing quickly which gives good opportunities for promotion. Cons There is constant talk of how Baringa is \"a great place to work\", but we are complacent about this. In reality it's a nice place, much nicer than Big 4 consultancies, but we are not very progressive. We tend to match the best policies from our competitors rather than doing anything original. Promotions often based on time served, especially at more junior levels. Advice to Management Partners should challenge each others ideas now - too often an ill thought out initiative is brought in because of one passionate partner sponsor. Remove barriers to fast promotions where warranted, and accept slower promotion in other cases.", "rating": 5, "pros": "The people are easy to work with, very collegiate atmosphere. Work life balance is monitored and is better than other consultancies - absolutely no \"face time\" here. We are growing quickly which gives good opportunities for promotion.", "cons": "There is constant talk of how Baringa is \"a great place to work\", but we are complacent about this. In reality it's a nice place, much nicer than Big 4 consultancies, but we are not very progressive. We tend to match the best policies from our competitors rather than doing anything original.", "advice": "Partners should challenge each others ideas now - too often an ill thought out initiative is brought in because of one passionate partner sponsor."}, {"title": "Generally good", "text": "Pros Very very intelligent co workers (everyone seems to be ex-Oxbridge), friendly people, good social events Cons A bit cliquey, project preferences not always listened to (understandably given business constraints)", "rating": 3, "pros": "Very very intelligent co workers (everyone seems to be ex-Oxbridge), friendly people, good social events", "cons": "A bit cliquey, project preferences not always listened to (understandably given business constraints)", "advice": null}, {"title": "Good, but for how long?", "text": "Pros Fair and mostly politics-free workplace Promotions are considered four times per year and fairly assessed in my experience Partners nearly all competent, approachable and honest Free long weekend in the sun once per year, with partner/family invited! Nice offices, though continually in need of more space Cons Variable calibre of recruits between business units - would say that some are slightly comfortable being a little second rate, whereas others are excellent Leadership's focus on culture/core values can be quite laboured Personal development is not taken too seriously in the midst of project demands Company is growing fast and I have a feeling quality is being sacrificed to sustain this via referrals Fridays in the office can be like a zoo with everyone back from client sites - can be really hard to concentrate and get anything done. Advice to Management The company is currently growing fast - please resist pressure to scale back the generous perks that make Baringa stand out.", "rating": 5, "pros": "Fair and mostly politics-free workplace", "cons": "Variable calibre of recruits between business units - would say that some are slightly comfortable being a little second rate, whereas others are excellent", "advice": "The company is currently growing fast - please resist pressure to scale back the generous perks that make Baringa stand out."}, {"title": "I have been working at Baringa for one year", "text": "Pros Great culture - people aren't kidding when they talk about this Talented group of people in general Accessible senior management Cons Can be difficult to 'crack' into the groups of folks that have been around for a while Advice to Management Keep the culture going as much as possible as the company grows, and try and keep the management structure flat / accessible", "rating": 5, "pros": "Great culture - people aren't kidding when they talk about this", "cons": "Can be difficult to 'crack' into the groups of folks that have been around for a while", "advice": "Keep the culture going as much as possible as the company grows, and try and keep the management structure flat / accessible"}, {"title": "So far, so good....", "text": "Pros Started during February, but first impressions have been fantastic. The company genuinely makes a big effort to attract and keep talented people. It's consultancy so of course you are expected to work hard, but Baringa does their best to minimize the usual pain points of consultancy (e.g. travel) through out of town schemes. Compared to other consultancies, there seems to be a less competitive and more collaborative environment. Of course people want to progress and grow, but my read thus far is that people are also far more willing to help others progress and grow too! This is a refreshing change from most consultancies. Cons Not a 'con' per-se but the company is growing at a tremendous rate, it will be interesting to see whether they can keep the culture as it currently is (and in fairness, this is something that is monitored and they have initiatives in place to try and prevent the unique culture being lost). Advice to Management Nothing at the moment, seems to be a fantastic place to work.", "rating": 5, "pros": "Started during February, but first impressions have been fantastic. The company genuinely makes a big effort to attract and keep talented people. It's consultancy so of course you are expected to work hard, but Baringa does their best to minimize the usual pain points of consultancy (e.g. travel) through out of town schemes.", "cons": "Not a 'con' per-se but the company is growing at a tremendous rate, it will be interesting to see whether they can keep the culture as it currently is (and in fairness, this is something that is monitored and they have initiatives in place to try and prevent the unique culture being lost).", "advice": "Nothing at the moment, seems to be a fantastic place to work."}, {"title": "Great Place to Work", "text": "Pros Great culture in an environment where people want to truly improve clients and leave sustainable improvements in place. Fantastic staff. Cons Usual challenges with working as a consultant and needing to travel to wherever the clients are. This is however mitigated by a strong 3/4/5 policy. Advice to Management Keep up the great work and continue to drive the same culture that has been a success over the last 15 years.", "rating": 5, "pros": "Great culture in an environment where people want to truly improve clients and leave sustainable improvements in place. Fantastic staff.", "cons": "Usual challenges with working as a consultant and needing to travel to wherever the clients are. This is however mitigated by a strong 3/4/5 policy.", "advice": "Keep up the great work and continue to drive the same culture that has been a success over the last 15 years."}, {"title": "Great place to work", "text": "Pros Incredibly bright and motivated people to work with, great growth and prospects if you want to go the distance and aim for Partner Cons Growing very rapidly at the moment", "rating": 5, "pros": "Incredibly bright and motivated people to work with, great growth and prospects if you want to go the distance and aim for Partner", "cons": "Growing very rapidly at the moment", "advice": null}, {"title": "nice place to work", "text": "Pros competent and passioante environment with lots of interesting projecs Cons stressful and difficult to manage the workload", "rating": 5, "pros": "competent and passioante environment with lots of interesting projecs", "cons": "stressful and difficult to manage the workload", "advice": null}, {"title": "Great Place to Work", "text": "Pros Flat structure Meritocratic Good work life balance Cons If you are looking for the corporate experience it isn't the place for you", "rating": 5, "pros": "Flat structure", "cons": "If you are looking for the corporate experience it isn't the place for you", "advice": null}, {"title": "Great company with a real focus on culture and employees", "text": "Pros Focus on people, interesting and varied work, top tier clients and good compensation. While consulting work makes significant demands on lifestyle (in particular with significant amounts of travel), Baringa makes every effort to make this as manageable as possible. The leadership team are approachable and trustworthy with very little political behaviour compared to most other organisations . Cons Long hours and travel are an intrinsic part of consultancy work. Project resourcing process could be more transparent - this will get even more important as the company grows further. Cultural feel of the company has begun to suffer as a result of the fast growth rate. Advice to Management Keep up the focus on culture and core values. These are what makes the company special to work for and are vital to the company's ongoing success.", "rating": 5, "pros": "Focus on people, interesting and varied work, top tier clients and good compensation. While consulting work makes significant demands on lifestyle (in particular with significant amounts of travel), Baringa makes every effort to make this as manageable as possible. The leadership team are approachable and trustworthy with very little political behaviour compared to most other organisations .", "cons": "Long hours and travel are an intrinsic part of consultancy work. Project resourcing process could be more transparent - this will get even more important as the company grows further. Cultural feel of the company has begun to suffer as a result of the fast growth rate.", "advice": "Keep up the focus on culture and core values. These are what makes the company special to work for and are vital to the company's ongoing success."}, {"title": "Best Firm I've Ever Worked For", "text": "Pros An authentic bunch of people - you don't get the usual fakes and posturing You don't have to watch your back - we support one another We act in our long-term interests - willing to turn down client work when it's detrimental to our people Fast-growing - we'll be saying, I remember when Baringa was only 500 people! Cons It's a very engaging place to work - and like all consulting firms, can demand a lot of you Very little can be said as 'cons' - but Baringa is striving hard to become even better Advice to Management Keep doing what you're doing. Clients love it, employees love it and never believe you've 'arrived'", "rating": 5, "pros": "An authentic bunch of people - you don't get the usual fakes and posturing", "cons": "It's a very engaging place to work - and like all consulting firms, can demand a lot of you", "advice": "Keep doing what you're doing. Clients love it, employees love it and never believe you've 'arrived'"}, {"title": "Energy Advisory Practice", "text": "Pros Work alongside some of the best and brightest people in the industry. The hours can be long and pressurised environment but the work is very interesting and opportunity to form deep sector expertise. Cons Rapid growth of the company has challenged some of the working structures and strong focus on culture that the business had as a smaller organisation. Advice to Management Make sure sufficient structures are in place to prevent favouritism amongst senior management.", "rating": 5, "pros": "Work alongside some of the best and brightest people in the industry. The hours can be long and pressurised environment but the work is very interesting and opportunity to form deep sector expertise.", "cons": "Rapid growth of the company has challenged some of the working structures and strong focus on culture that the business had as a smaller organisation.", "advice": "Make sure sufficient structures are in place to prevent favouritism amongst senior management."}, {"title": "Walks the talk.", "text": "Pros All management consultancies seem to say the same words. My experience of Baringa is that the business had a genuine commitment to client delivery, quality of thought and the environment it creates for the people it hires. Cons Glassdoor requires me to type 20 words in this box in order to post the review. So that's what I need to do. The office is starting to feel small and needs to keep pace with growth. That's probably a good thing! Advice to Management Keep growing. Growth is healthy here. Hold on tight as you do, what you have built is amazing keep it that way.", "rating": 5, "pros": "All management consultancies seem to say the same words. My experience of Baringa is that the business had a genuine commitment to client delivery, quality of thought and the environment it creates for the people it hires.", "cons": "Glassdoor requires me to type 20 words in this box in order to post the review. So that's what I need to do. The office is starting to feel small and needs to keep pace with growth. That's probably a good thing!", "advice": "Keep growing. Growth is healthy here. Hold on tight as you do, what you have built is amazing keep it that way."}, {"title": "Consultant - Technology Transformation", "text": "Pros I've been at Baringa for 9 months now working in the Technology Transformation practice. There are great opportunities for progression and good support for junior staff such as myself. I joined Baringa with no consultancy experience, but had a very supportive network who even encouraged me to apply for a promotion within my first 6 months. Baringa works hard to promote diversity, which is particularly important in the technology sector. A very friendly, hard-working company. Cons Work-life balance is always a challenge in consulting, however junior recruits like me are encouraged not to work long hours unnecessarily. It can be tough to keep in touch with everyone whilst away on project, but a huge amount of effort is put into company events to help make everyone feel part of a team. Advice to Management Bear in mind those not coming from a consulting background.", "rating": 5, "pros": "I've been at Baringa for 9 months now working in the Technology Transformation practice. There are great opportunities for progression and good support for junior staff such as myself. I joined Baringa with no consultancy experience, but had a very supportive network who even encouraged me to apply for a promotion within my first 6 months. Baringa works hard to promote diversity, which is particularly important in the technology sector. A very friendly, hard-working company.", "cons": "Work-life balance is always a challenge in consulting, however junior recruits like me are encouraged not to work long hours unnecessarily. It can be tough to keep in touch with everyone whilst away on project, but a huge amount of effort is put into company events to help make everyone feel part of a team.", "advice": "Bear in mind those not coming from a consulting background."}, {"title": "Great place to work - Technology Transformation", "text": "Pros I've been here a little over a year now, having had no prior consultancy experience nor having worked for a medium sized company before. Pros: Great culture - tight-knit community feel, promotes healthy work/life balance, diverse, impressive calibre of staff and plenty of opportunities to make your mark. I work in Technology Transformation with a fantastic bunch of experienced professionals with a number of skills and competencies spread amongst the group. A good gender balance (unlike many Tech teams I've worked with in the past). Fantastic development opportunities - which is one of the key attractions for me personally. Cons Nothing significant springs to mind", "rating": 5, "pros": "I've been here a little over a year now, having had no prior consultancy experience nor having worked for a medium sized company before. Pros: Great culture - tight-knit community feel, promotes healthy work/life balance, diverse, impressive calibre of staff and plenty of opportunities to make your mark.", "cons": "Nothing significant springs to mind", "advice": null}, {"title": "Great company, genuine people", "text": "Pros Coming from a huge corporate company, Baringa was a big change in my career. However, I haven't regretted my decision to choose Baringa over one of the Big 4 who also offered me a job earlier in the year. The people at this company are second to none. Being ambitious, capable and unselfish is a common theme across Baringa. There is not a person who will not help you, be it personal or professional advice you seek. The compensation and benefits are very good, with career opportunities clearly laid on in front of you. The extent to which this company invests in its people, through training or company events to bring us all together, is totally different to anything I saw at my previous company (one of the tech consulting giants). Cons I'm struggling to find anything in this camp. The induction is typically very short (one day). This can be a barrier to really integrating with your starter group, which may be a problem where you know nobody at the company.", "rating": 5, "pros": "Coming from a huge corporate company, Baringa was a big change in my career. However, I haven't regretted my decision to choose Baringa over one of the Big 4 who also offered me a job earlier in the year.", "cons": "I'm struggling to find anything in this camp.", "advice": null}, {"title": "Wouldn't be anywhere else", "text": "Pros Baringa provides you the opportunity to work with motivated, high caliber individuals in an open, collaborative environment. The leadership stand out in their commitment to hiring the best people and supporting them through their careers - both personally and professionally. Having worked for a couple of other consulting firms, Baringa is the one firm that genuinely lives and breathes their values. Cons Working in a company with our growth rate comes with challenges around internal processes but these are proactively managed. Advice to Management Continue to focus on recruiting and supporting our fantastic consultants to make sure the values and culture grow with us.", "rating": 5, "pros": "Baringa provides you the opportunity to work with motivated, high caliber individuals in an open, collaborative environment. The leadership stand out in their commitment to hiring the best people and supporting them through their careers - both personally and professionally.", "cons": "Working in a company with our growth rate comes with challenges around internal processes but these are proactively managed.", "advice": "Continue to focus on recruiting and supporting our fantastic consultants to make sure the values and culture grow with us."}, {"title": "An inspiring and unique workplace!", "text": "Pros The recruitment process was efficient, set clear expectations, was professional and gave me a great impression of Baringa from the start which has never faded. Baringa is an inspiring place to work because it is full of intelligent, motivated people with a can-do attitude, who still maintain normal lives outside of work. Baringa have a reputation for quality work from people who really understand the industries we work in and genuinely work with the client to ensure practical solutions that deliver real benefits. Baringa has a very flat structure and you work alongside partners and senior people from day one. Everyone is very accessible, friendly and supportive. They encourage collaboration in everything from the development of propositions, company strategy through to sporting teams and social events. The promotion process is clear and quick and management support you to reach your goals. Joining Baringa was certainly the right decision, it's a unique environment and I enjoy coming to work! Cons Potentially work outside London but that’s part of consulting; need to maintain the unique culture as the company grows. Advice to Management Could provide more to facilitate the development of soft skills to support ongoing development.", "rating": 5, "pros": "The recruitment process was efficient, set clear expectations, was professional and gave me a great impression of Baringa from the start which has never faded.", "cons": "Potentially work outside London but that’s part of consulting; need to maintain the unique culture as the company grows.", "advice": "Could provide more to facilitate the development of soft skills to support ongoing development."}, {"title": "Still a Great Place to Work", "text": "Pros I've worked for Baringa for a significant chunk of my professional career, and having come from a Big-4/6 Global Consultancy previously, I can still safely say that I haven't come across a consulting company that's as good as Baringa. The work is interesting, our clients are as 'Blue Chip' as they come and you get to work with some of the best people in the industry. You really do work with your friends, rather than your colleagues - while this can also be said for pockets of the larger consulting houses, it's not true across the board. The senior leadership truly care about the individuals and maintaining the fantastic culture that Baringa has created over the last 15 years. Even thought the company has grown significantly, there's still scope for real ownership at the individual level, in terms of growing clients, capabilities and also helping to actually run and improve the company. I'm not sure there are too many other consultancies out there that are truly the same. The annual Baringa weekend away (with families) doesn't hurt either ;-) Cons Remember, it's still a consulting company! While we have fantastic and sometimes quite unique benefits, there's still the expectations of the client to meet - be that working away from home or long hours. However, the company does all it can to limit the negative impact of these aspects to consulting.", "rating": 5, "pros": "I've worked for Baringa for a significant chunk of my professional career, and having come from a Big-4/6 Global Consultancy previously, I can still safely say that I haven't come across a consulting company that's as good as Baringa. The work is interesting, our clients are as 'Blue Chip' as they come and you get to work with some of the best people in the industry. You really do work with your friends, rather than your colleagues - while this can also be said for pockets of the larger consulting houses, it's not true across the board. The senior leadership truly care about the individuals and maintaining the fantastic culture that Baringa has created over the last 15 years. Even thought the company has grown significantly, there's still scope for real ownership at the individual level, in terms of growing clients, capabilities and also helping to actually run and improve the company. I'm not sure there are too many other consultancies out there that are truly the same. The annual Baringa weekend away (with families) doesn't hurt either ;-)", "cons": "Remember, it's still a consulting company! While we have fantastic and sometimes quite unique benefits, there's still the expectations of the client to meet - be that working away from home or long hours. However, the company does all it can to limit the negative impact of these aspects to consulting.", "advice": null}, {"title": "Great Place for Consulting", "text": "Pros Exceptional consulting firm with a difference. A very family friendly environment with a senior leadership that listens and is genuinely interested in progressing your career. Cons Some feel that the speed of growth over the last couple of years have taken some of the original spirit away.", "rating": 5, "pros": "Exceptional consulting firm with a difference. A very family friendly environment with a senior leadership that listens and is genuinely interested in progressing your career.", "cons": "Some feel that the speed of growth over the last couple of years have taken some of the original spirit away.", "advice": null}, {"title": "Energy Retail Consulting - Consultancy with a Difference", "text": "Pros I started working at Baringa Partners 18 months ago, moving from a global management consultancy. The work here is genuinely very interesting and the exposure to clients is at a much more senior level than at the same grade with my previous employer. The culture is more collaborative and more personal than what you would experience at most large consultancies. Recruitment Process The recruitment process was slick and accommodating. I was still at my previous workplace when contacted by Baringa and the recruitment team were friendly and informative. I went through two rounds of interview - the first with a Manager and SM, the second with a Partner. Before I started the process, I had an informal chat with an Energy Retail Director and was offered a peer-to-peer chat, which was very useful and all helped make my decision to move. The Work Throughout my career I have worked with major utilities and energy companies, but the work at Baringa has definitely been higher profile and personally more rewarding. In the last year and a half I have been providing direct assurance reports to the client programme director and C-suite, being given mandate to act on the remedial actions suggested and drive the change within these organisations. Internally Baringa are also great at providing opportunities to drive initiatives that take the company forward and help drive strategy. In my case, this has included shaping the direct recruitment campaign, heading up internal BU comms or work to identify key energy trends and their consequences for us as a business. The amount of internal work you get involved with is up to you, but the opportunity is definitely there with Baringa should you want it, irrespective of seniority! Culture The people we work with here really do make the company. I have never been refused a request for help or assistance, be that from peers or Partners of the company - it truly is a collaborative place. Working directly with Partners on client and internal engagements gives you levels of visibility and access to senior management that would be alien at larger consultancies. And it's not all about work - every year the company organise several company events, BU events and a trip away where spouses/family are welcome too. These events are great and you sometimes get the feeling the entertainments team are always trying to out-do previous events, which is fantastic! Cons As the company grows, it is inevitable that the culture will have to adapt too, but in my time here, headcount has gone up considerably and still no sign of a negative shift! This is mostly a result of the recruitment policy which ensures we keep hiring talented people who fit the culture, but something to be aware of.", "rating": 5, "pros": "I started working at Baringa Partners 18 months ago, moving from a global management consultancy. The work here is genuinely very interesting and the exposure to clients is at a much more senior level than at the same grade with my previous employer. The culture is more collaborative and more personal than what you would experience at most large consultancies.", "cons": "As the company grows, it is inevitable that the culture will have to adapt too, but in my time here, headcount has gone up considerably and still no sign of a negative shift! This is mostly a result of the recruitment policy which ensures we keep hiring talented people who fit the culture, but something to be aware of.", "advice": null}, {"title": "Manager", "text": "Pros - Open and accessible management - Flexible working - Room for all styles and approaches, culturally the company is evolving to be an eclectic place - a huge differentiator in consulting! - Genuinely strong capabilities in a number of areas - Buoyant atmosphere and strong growth prospects as a business and for its employees Cons - Culture of employees and management insisting on 'positive' viewpoints, to the point of being disingenuous - Corporate, HR and support processes are underweight both from a system and resource perspective - Benefits package is generous but pension provision poor - Experience will vary across practice - the work in some areas, sold by some partners is arguably much more attractive to work on than others Advice to Management - Don't afraid to be critical occasionally - Address issues with pension provision - When it comes to corporate support for your consultants, think 'gold plated' and not 'quick fix'", "rating": 5, "pros": "- Open and accessible management", "cons": "- Culture of employees and management insisting on 'positive' viewpoints, to the point of being disingenuous", "advice": "- Don't afraid to be critical occasionally"}, {"title": "Learning and developing with the best in the industry whilst making great friends, having fun and getting well paid", "text": "Pros Culture, client portfolio, type of work, freedom to build things you are passionate about, competitive salary, excellent bonus structure rewarding long term performance, great non-financial benefits such as events. Cons Occasional lack of junior support for senior engagement roles due to lack of bench / high running utilisation levels. Low employer pension contribution (3%). Advice to Management Keep focusing on evolving our culture as we grow. Continue to be transparent around internal processes such as performance management, scheduling and executive decision making.", "rating": 5, "pros": "Culture, client portfolio, type of work, freedom to build things you are passionate about, competitive salary, excellent bonus structure rewarding long term performance, great non-financial benefits such as events.", "cons": "Occasional lack of junior support for senior engagement roles due to lack of bench / high running utilisation levels. Low employer pension contribution (3%).", "advice": "Keep focusing on evolving our culture as we grow. Continue to be transparent around internal processes such as performance management, scheduling and executive decision making."}, {"title": "Consultant", "text": "Pros Interesting work. Employees who are truly best in class. Culture that genuinely tries to get the best out of everyone and maximize opportunities for collaboration. Amazing parties. Cons As would be expect in consultancy, the work is demanding and high-pressured. Whilst management do make an effort to promote work-life balance, this isn't always achievable.", "rating": 5, "pros": "Interesting work. Employees who are truly best in class. Culture that genuinely tries to get the best out of everyone and maximize opportunities for collaboration. Amazing parties.", "cons": "As would be expect in consultancy, the work is demanding and high-pressured. Whilst management do make an effort to promote work-life balance, this isn't always achievable.", "advice": null}, {"title": "Fantastic first impressions, but the proof is in the projects (and culture, and values, and colleagues, and social life)", "text": "Pros A positive culture of hard work for real benefit engagements providing a challenge worthy of that culture. A management structure that is transparent and responsive as possible; anyone at any level will gladly talk to anyone else within the business. A passion amongst all colleagues for doing the best possible job for all parties, whatever the contract actually says. A commitment to work/life balance; colleagues, managers and partners all pitch in to ensure everyone has the right tools to successfully handle the difficulties of remote working and challenging engagements. An engaging interview process with interviewers who genuinely want to know the person, not just the CV. A growing company that continues to look for people who share the core values Cons Remote working, but this is really just part of the industry; to Baringa's credit, real care is taken to ensure those working away from home are adequately supported, and partners become personally involved to assist when difficulties do arise.", "rating": 5, "pros": "A positive culture of hard work for real benefit engagements providing a challenge worthy of that culture.", "cons": "Remote working, but this is really just part of the industry; to Baringa's credit, real care is taken to ensure those working away from home are adequately supported, and partners become personally involved to assist when difficulties do arise.", "advice": null}, {"title": "Baringa wins awards for a reason... It is a great place to work.", "text": "Pros - Everybody's opinions matter, regardless of seniority and time served - Everyone is empowered to drive internal change and there are loads of opportunities to get involved in internal initiatives and help drive continued success - Baringa employs some of very best consultants in the industry and this fuels high quality client deliveries - Baringa puts its people and its clients at the heart of everything it does and stands for - Promotions and career development are driven by the individuals and are entirely meritocratic - The Leadership really do lead by example and are genuine role-models Cons - Consulting can be a tough industry and the work we do with our clients is often challenging and difficult - Cannot guarantee that every single project is going to be in London Advice to Management - Keep doing what you are doing and drive Baringa forwards into the next stage of its journey - This is a special company and lets keep it that way", "rating": 5, "pros": "- Everybody's opinions matter, regardless of seniority and time served", "cons": "- Consulting can be a tough industry and the work we do with our clients is often challenging and difficult", "advice": "- Keep doing what you are doing and drive Baringa forwards into the next stage of its journey"}, {"title": "Great people, great culture, best place to work as a consultant", "text": "Pros 1. The people are fantastic - everyone is work with is enthusiastic about their work, industry and role in the company. 2. Leadership - There is a high partner/non-partner ratio which has meant I've had close contact with senior people from day 1 which has really helped both my personal development and to feel valued within the company. The leadership are transparent about the direction of the company, with quarterly business updates that provide detailed reviews of how and where the company is going. They genuinely care about the company and its employees - they are constantly listening to and responding to feedback, looking for ways to improve the experience for it's employees. 3. Progression - the promotion process is straight forward and transparent. You discuss openly with your line managers and career advisor where you are in relation to the objectives of the next level up. If you all feel that you are meeting these objectives, you are put up for promotion. This happens 4 times a year so if you miss it in one round you only have to wait 3 months for the next. All the promotions have seemed well-deserved and at the right time. 4. Out of Town policies - one of the big downsides of the consulting life can be out of town working. Baringa make this as pain free as possible with it's 3-4-5 policy (3 nights away, 4 days on clients site), provide extra holiday to those working out of town and additional remuneration for those consistently working out of town. Cons As you progress, there is more focus on getting involved with internal initiatives. This can often come at the expense of a good work life balance as you need to fit it in around working on chargeable client work.", "rating": 5, "pros": "1. The people are fantastic - everyone is work with is enthusiastic about their work, industry and role in the company.", "cons": "As you progress, there is more focus on getting involved with internal initiatives. This can often come at the expense of a good work life balance as you need to fit it in around working on chargeable client work.", "advice": null}, {"title": "A great experience so far", "text": "Pros My experience with Baringa has been very positive. I have found the company to have a culture of openness and collaboration. Fellow employees are always keen to work together and help each other to achieve the goals of the company and add value to clients. Cons Consultancy can be hard with travel and demanding clients but Baringa do well to support employees through this.", "rating": 5, "pros": "My experience with Baringa has been very positive. I have found the company to have a culture of openness and collaboration. Fellow employees are always keen to work together and help each other to achieve the goals of the company and add value to clients.", "cons": "Consultancy can be hard with travel and demanding clients but Baringa do well to support employees through this.", "advice": null}, {"title": "Continuously featuring in the Great Place to Work, because it really is", "text": "Pros It's a little cliché to say Baringa is like a family; but it's not far off. At all levels, people know people; and everyone understands what we need to do to be successful. The hierarchy is very flat; and everyone takes some personal responsibility to make sure we succeed. If something can be done better, then people will take charge and improve it. We're a different business to where we were a few years ago, and this is a positive sign of our evolution. I've referred several people into Baringa, because I truly believe it's a good place to be Cons As with any consulting role, there are less positive aspects - for me, it's mostly the travel commitments. But, Baringa are leagues apart from the other consultancies in how we deal with this - people are compensated for being away from home, because we recognise it's rarely someone's first choice Advice to Management Continue what we're doing; which sometimes means changing what we're doing! Evolution is critical to our success, and we've done this so well to date.", "rating": 5, "pros": "It's a little cliché to say Baringa is like a family; but it's not far off. At all levels, people know people; and everyone understands what we need to do to be successful. The hierarchy is very flat; and everyone takes some personal responsibility to make sure we succeed. If something can be done better, then people will take charge and improve it. We're a different business to where we were a few years ago, and this is a positive sign of our evolution. I've referred several people into Baringa, because I truly believe it's a good place to be", "cons": "As with any consulting role, there are less positive aspects - for me, it's mostly the travel commitments. But, Baringa are leagues apart from the other consultancies in how we deal with this - people are compensated for being away from home, because we recognise it's rarely someone's first choice", "advice": "Continue what we're doing; which sometimes means changing what we're doing! Evolution is critical to our success, and we've done this so well to date."}, {"title": "Fantastic Company With The Best People", "text": "Pros With anywhere you work, the quality of the people and the support of your team is so important. I have worked with some of the best for both these areas during my short time at Baringa and I can't rate the people enough. Everyone I've worked it has a lot of expertise in their area (or many areas!) with a genuine interest and drive to deliver value to our clients. Baringa's breadth of work is also really impressive and I'm constantly surprised on all the work we're doing and across so many different companies and industries. I'm always recommending and saying great things about Baringa to my friends and it's been a great career decision for me to join this company. Cons The nature of consulting is that there can be some long hours, lots of travel and there will always be some roles which aren't as exciting as others. Baringa's culture though really does take into account all of these to make sure that all employees are working in a supportive environment and the pros far outweigh the cons. Advice to Management Keep making time to be visible and open to your employees. It's really valued and helps to build trust in our management and our company.", "rating": 5, "pros": "With anywhere you work, the quality of the people and the support of your team is so important. I have worked with some of the best for both these areas during my short time at Baringa and I can't rate the people enough. Everyone I've worked it has a lot of expertise in their area (or many areas!) with a genuine interest and drive to deliver value to our clients. Baringa's breadth of work is also really impressive and I'm constantly surprised on all the work we're doing and across so many different companies and industries.", "cons": "The nature of consulting is that there can be some long hours, lots of travel and there will always be some roles which aren't as exciting as others. Baringa's culture though really does take into account all of these to make sure that all employees are working in a supportive environment and the pros far outweigh the cons.", "advice": "Keep making time to be visible and open to your employees. It's really valued and helps to build trust in our management and our company."}, {"title": "Great people, great opportunities and great parties!", "text": "Pros I've found one of the best things about Baringa has been that all the people regardless of level are approachable and friendly, and clearly very talented. They practise what they preach with regard to being a meritocracy. I was told that I could be promoted after a year of joining if I was able to perform at the necessary level, and within a year I was promoted. There are plenty of opportunities to get involved with shaping the business and getting involved with internal initiative so you can really make a difference to the company rather than feeling like 'just another employee'. Cons It's still consulting, so there can be long hours and the possibility of working out of town, but there is an out of town policy that provides compensation for this.", "rating": 5, "pros": "I've found one of the best things about Baringa has been that all the people regardless of level are approachable and friendly, and clearly very talented.", "cons": "It's still consulting, so there can be long hours and the possibility of working out of town, but there is an out of town policy that provides compensation for this.", "advice": null}, {"title": "Sociable, hard-working and growing", "text": "Pros I joined Baringa just under a year ago after nearing the end of a graduate scheme in industry and couldn't be more pleased with my decision to make the jump. Without re-iterating too much about what has already been mentioned in previous reviews - there really is a hugely sociable culture where hard work is rewarded and every effort is made to ensure your ambitions for certain types of projects and roles are taken into account. Aside from client work, getting involved in internal initiatives has been encouraged from day 1 and proved to be a great way to tap into senior management’s knowledge on current industry issues and trends. At a more junior level, there’s a small analyst community that’s growing every year and meets regularly for socials and training. I've found the internal training courses on industry topics and core consulting skills have been well thought out has made the transition from industry a much easier process. There’s definitely an adventurous, light-hearted competitiveness, and proactive theme that exists which means there’s always something to get involved in if you like. So far a few email chains has led to a skiing trip in Switzerland, the world’s 2nd highest bungee jump, a fancy dress evening at the World’s Darts Championships and current plans are for a sailing race to France this summer! All optional of course but something that has been a pleasant surprise that I think captures the Baringa experience and mind-set quite well. Cons There’s not too much I can think of. A bit more clarity about up-coming projects and roles across different business units including expected start dates, locations, type of project, duration etc. would be welcomed although I hear this is being looked at. Friends and/or your other half get very annoyed if you don’t invite them as a plus one to company events! Advice to Management As the company grows - always keep check that the benefits, culture, compensation and projects that we enjoy now aren't adversely impacted.", "rating": 5, "pros": "I joined Baringa just under a year ago after nearing the end of a graduate scheme in industry and couldn't be more pleased with my decision to make the jump. Without re-iterating too much about what has already been mentioned in previous reviews - there really is a hugely sociable culture where hard work is rewarded and every effort is made to ensure your ambitions for certain types of projects and roles are taken into account. Aside from client work, getting involved in internal initiatives has been encouraged from day 1 and proved to be a great way to tap into senior management’s knowledge on current industry issues and trends.", "cons": "There’s not too much I can think of. A bit more clarity about up-coming projects and roles across different business units including expected start dates, locations, type of project, duration etc. would be welcomed although I hear this is being looked at.", "advice": "As the company grows - always keep check that the benefits, culture, compensation and projects that we enjoy now aren't adversely impacted."}, {"title": "Great values, great people, great leadership", "text": "Pros It's a company that really lives by it's values. There is a real sense of togetherness amongst the staff, regardless of what level you are at - day in and day out, I see senior management engage with those at all levels of the company, treating them all in the same way by showing respect support and a genuine interest in people's opinions as well as their personal lives. Seeing partners getting stuck into client work with the rest of the project teams really brings out the togetherness and collaborative nature of the firm. Having previously only worked for large organisations, it has been a refreshing change to be able to have an influence on how the company develops and grows by getting involved in a number of internal initiatives on top of my client work. Although it is sometimes hard to articulate what the fabled Baringa culture is really about, the leadership team recognise that the company culture must be nurtured and well maintained ensuring we never rest on our laurels. This has bot been an easy thing to do considering the significant growth we have seen over the past few years, but I still very much feel part of the Baringa family. I feel empowered to have a say over where I would like my career to go, and senior management takes a keen interest in my aspirations and try their best to ensure my clients roles support these aspirations. It's a company that works hard together and plays hard together - you always feel as though you're working with friends. Lastly, the company events (weekends away for employees and their families etc...) are second to none! Cons Not many! There is some work to be done to ensure better diversity at all levels and to encourage employees to better manage their work life balance, although I recognise that work load will always differ from client to client. Advice to Management Maintain the openness and approachability of the leadership team and never underestimate the positive impact this has on all levels of the company.", "rating": 5, "pros": "It's a company that really lives by it's values. There is a real sense of togetherness amongst the staff, regardless of what level you are at - day in and day out, I see senior management engage with those at all levels of the company, treating them all in the same way by showing respect support and a genuine interest in people's opinions as well as their personal lives. Seeing partners getting stuck into client work with the rest of the project teams really brings out the togetherness and collaborative nature of the firm.", "cons": "Not many! There is some work to be done to ensure better diversity at all levels and to encourage employees to better manage their work life balance, although I recognise that work load will always differ from client to client.", "advice": "Maintain the openness and approachability of the leadership team and never underestimate the positive impact this has on all levels of the company."}, {"title": "Great People, Great Projects, Great Place to Work", "text": "Pros By far the best things about Baringa are the culture and people. Colleagues are ambitious and talented, which consistently drives the ambition and quality of peers. The fantastic breadth of experience of its people enables project work at a wide range of interesting clients. The Leadership set a clear and consistent vision for the future, offering everyone the opportunity to contribute and shape the future of the organisation. Training is actively encouraged for all levels as is personal development and feedback. The office culture is friendly and full of energy. I've made close friends at Baringa and the organisation really feels like a family! Cons As the company grows, the biggest challenge will be to maintain the culture. I've seen the organisation triple in size since I joined and although this has tweaked the culture, it remains strong, positive and a great place to work.", "rating": 5, "pros": "By far the best things about Baringa are the culture and people. Colleagues are ambitious and talented, which consistently drives the ambition and quality of peers. The fantastic breadth of experience of its people enables project work at a wide range of interesting clients. The Leadership set a clear and consistent vision for the future, offering everyone the opportunity to contribute and shape the future of the organisation.", "cons": "As the company grows, the biggest challenge will be to maintain the culture. I've seen the organisation triple in size since I joined and although this has tweaked the culture, it remains strong, positive and a great place to work.", "advice": null}, {"title": "A Better Approach to Consulting", "text": "Pros Since joining Baringa a little over 6 months ago I've come to realise that the award winning status is backed up with some tangible differences to how we operate. Everyone in the organisation is genuinely approach, from Analyst to Partner level (I spent my first week arguing over email about Liverpool's right back choices with the Managing Partner!) and it feels great to work for a company whose reputation for delivering results whilst having skin in the game is difficult for competitors to rival. For many, including myself, career progression is important - unlike many similar firms Baringa do not operate a \"wait in line\" policy and there is a drive to promote people as soon as they are ready rather than based on an arbitrary number of years in role. Similarly, if people wish to remain at their current grade for longer then there is no pressure to move faster than you are comfortable with, which is very different to the \"up or out\" culture elsewhere. Cons As with all consulting roles there can be long hours and high expectations on many projects, however, Baringa go further than anyone else in the industry to recognise and balance this.", "rating": 5, "pros": "Since joining Baringa a little over 6 months ago I've come to realise that the award winning status is backed up with some tangible differences to how we operate. Everyone in the organisation is genuinely approach, from Analyst to Partner level (I spent my first week arguing over email about Liverpool's right back choices with the Managing Partner!) and it feels great to work for a company whose reputation for delivering results whilst having skin in the game is difficult for competitors to rival.", "cons": "As with all consulting roles there can be long hours and high expectations on many projects, however, Baringa go further than anyone else in the industry to recognise and balance this.", "advice": null}, {"title": "Great company to work for, lovely people and interesting work", "text": "Pros Having recently joined Baringa, the interview process was very well managed and I felt very clear on next steps and timing throughout. Since joining, I've been amazed at how friendly and welcoming everyone across the business has been. Everyone works very hard and everyone I've met so far has been highly intelligent and ambitious, but also lots of fun which is a great combo. Long hours are not expected. Being away on a project during the week means getting together with colleagues for dinners which is a great way to get to know people. There are lots of internal initiatives people can get involved in, and you really do have the opportunity to drive your own career within Baringa. It seems to be a quickly growing company so there is a huge amount of opportunity, it's an exciting time to have joined. Cons Travelling out of London every week is not for everyone, and can be a little tiring. This was something I was very aware of from the interview process though so you can make that decision before you accept.", "rating": 5, "pros": "Having recently joined Baringa, the interview process was very well managed and I felt very clear on next steps and timing throughout. Since joining, I've been amazed at how friendly and welcoming everyone across the business has been. Everyone works very hard and everyone I've met so far has been highly intelligent and ambitious, but also lots of fun which is a great combo. Long hours are not expected. Being away on a project during the week means getting together with colleagues for dinners which is a great way to get to know people. There are lots of internal initiatives people can get involved in, and you really do have the opportunity to drive your own career within Baringa. It seems to be a quickly growing company so there is a huge amount of opportunity, it's an exciting time to have joined.", "cons": "Travelling out of London every week is not for everyone, and can be a little tiring. This was something I was very aware of from the interview process though so you can make that decision before you accept.", "advice": null}, {"title": "Great Company, Great People, Great Potential", "text": "Pros It's a company that really doesn't take its biggest asset, its people, for granted. I know it's a cliche, but they really look after you. All the partners make a significant effort to know who you are and listen to you. You have the opportunity to talk candidly to any of them whenever you want. On top of that, the annual Summer trip is really second-to-none, with a lot of time and money going into it. From a growth perspective, it's had a strong performance every year from revenue and size as they are constantly looking for new areas to either grow into or get more involved in. They prefer to promote from within but this has caused a bit of a bottle-neck at the middle levels which I don't know how it will play out over the next 12-18 months. Plenty of opportunities to get promoted if you want it, plus the promotion rounds are every quarter rather than every year, so if you miss out one round, you've not long to wait...or equally, you've not long to sort whatever prevented you from being promoted. Cons It's still a management consultancy at heart and despite constantly informing people that they only fit the right people with the right roles, ultimately they don't want anyone sitting on the bench and still tend to through you at something that may no be ideal. This is consulting though... Advice to Management Significant challenges on the horizon regarding growth and think they need to react quickly with any growing pains.", "rating": 5, "pros": "It's a company that really doesn't take its biggest asset, its people, for granted. I know it's a cliche, but they really look after you. All the partners make a significant effort to know who you are and listen to you. You have the opportunity to talk candidly to any of them whenever you want. On top of that, the annual Summer trip is really second-to-none, with a lot of time and money going into it.", "cons": "It's still a management consultancy at heart and despite constantly informing people that they only fit the right people with the right roles, ultimately they don't want anyone sitting on the bench and still tend to through you at something that may no be ideal. This is consulting though...", "advice": "Significant challenges on the horizon regarding growth and think they need to react quickly with any growing pains."}, {"title": "Great Place to Work", "text": "Pros Excellent people - some of the best I have ever worked with Individuals can contribute directly to the direction your business is taking Positive and engaged leadership People are looked after - particularly relating to employees personal needs and maintaining work / life balance Cons Role assignment can be managed poorly but is being improved Formal training courses are lacking at mid management level Promotion process is somewhat convoluted and not very transparent Advice to Management Pension provider service is pretty poor and should be looked at again", "rating": 5, "pros": "Excellent people - some of the best I have ever worked with", "cons": "Role assignment can be managed poorly but is being improved", "advice": "Pension provider service is pretty poor and should be looked at again"}, {"title": "A nice community of like-minded people focussed on doing interesting client work exceedingly well", "text": "Pros The relationships I have with Directors and Partners are open and equal. Colleagues care about you. Lots of social events including an annual overseas weekend with partners and children. Really clear bonus scheme and promotion criteria with no 'politics'. Punches above our weight for the clients and type of client work we complete. Cons The pension contribution is less than half that of other firms, and the whole scheme really needs to be reviewed independently. No mobile phone is provided. Advice to Management We could try to reduce the volume of internal emails by better use of the Intranet.", "rating": 5, "pros": "The relationships I have with Directors and Partners are open and equal. Colleagues care about you. Lots of social events including an annual overseas weekend with partners and children. Really clear bonus scheme and promotion criteria with no 'politics'. Punches above our weight for the clients and type of client work we complete.", "cons": "The pension contribution is less than half that of other firms, and the whole scheme really needs to be reviewed independently. No mobile phone is provided.", "advice": "We could try to reduce the volume of internal emails by better use of the Intranet."}, {"title": "Spannendes internationales Umfeld", "text": "Pros - Das Unternehmen legt vergleichsweise großen Fokus auf seine Mitarbeiter - Möglichkeiten zu nationalen und internationalen Projekten - Unheimliches großes Kundenportfolio (u.a. diverse internationale Großkonzerne) Cons - Starkes Unternehmenswachstum stellt die Unternehmenskultur auf die Probe - Baringa Brand und Bekanntheit muss sich im deutschsprachigen Raum noch weiter durchsetzen (in UK mindestens auf Augenhöhe mit BIg4, Accenture, etc) Advice to Management Baringa ist auf einem guten Weg, darf auf seiner Reise die Mitarbeiter und deren Interessen nicht aus den Augen lassen.", "rating": 5, "pros": "- Das Unternehmen legt vergleichsweise großen Fokus auf seine Mitarbeiter", "cons": "- Starkes Unternehmenswachstum stellt die Unternehmenskultur auf die Probe", "advice": "Baringa ist auf einem guten Weg, darf auf seiner Reise die Mitarbeiter und deren Interessen nicht aus den Augen lassen."}, {"title": "Consultancy with a difference - this slogan is definitely true", "text": "Pros Baringa is a consultancy with a very unique culture: the interaction among colleagues - regardless of their hierarchy level - is always respectful and very warm (I have worked for a big consulting firm before and can confirm that its a completely different interaction between colleagues there). Additionaly, Baringa gives really cares about the personal (career)goals of their employees. If you are interested in one specific topic or have specific promotion goals you can be sure to be supported by your managers in any way. Besides all these positive factors Baringa also has very intersting and big clients with interesting project topics which makes it even more worth to join Baringa. Cons Most of the projects are based in the UK. If you don't like to work there you shouldn't join Baringa ;)", "rating": 5, "pros": "Baringa is a consultancy with a very unique culture: the interaction among colleagues - regardless of their hierarchy level - is always respectful and very warm (I have worked for a big consulting firm before and can confirm that its a completely different interaction between colleagues there). Additionaly, Baringa gives really cares about the personal (career)goals of their employees. If you are interested in one specific topic or have specific promotion goals you can be sure to be supported by your managers in any way.", "cons": "Most of the projects are based in the UK. If you don't like to work there you shouldn't join Baringa ;)", "advice": null}]