[{"title": "Energizing company with supportive work environment", "text": "Pros Bedly is growing fast--the company has a great energy to it and is exciting to be a part of. The co-founders are super involved in the day-to-day and really open to all employees' ideas. They're responsive and easy to collaborate with. The whole Bedly team is super passionate about the work. Everyone puts in the hours because they care about the company, and one another. Cons Nothing -- Bedly is a great place to work :)", "rating": 5, "pros": "Bedly is growing fast--the company has a great energy to it and is exciting to be a part of. The co-founders are super involved in the day-to-day and really open to all employees' ideas. They're responsive and easy to collaborate with. The whole Bedly team is super passionate about the work. Everyone puts in the hours because they care about the company, and one another.", "cons": "Nothing -- Bedly is a great place to work :)", "advice": null}, {"title": "Fun Company, Interesting Work", "text": "Pros There is a lot of opportunity to get really involved and you feel as if your work actually makes an impact. Everyone is very open to your ideas and you feel valued. The team is fun, passionate and hard working. Cons Haven't came across any. Advice to Management Management is great!", "rating": 5, "pros": "There is a lot of opportunity to get really involved and you feel as if your work actually makes an impact. Everyone is very open to your ideas and you feel valued. The team is fun, passionate and hard working.", "cons": "Haven't came across any.", "advice": "Management is great!"}, {"title": "Fun & Passionate Environment", "text": "Pros Your ideas are valued here and everyone is treated equally. The team is friendly, fun and really cares about what they're doing. Cons Long hours, but hey, it's a startup. Work hard play hard. Advice to Management HR process and overall organization could be improved. Focus some time as you continue to grow.", "rating": 5, "pros": "Your ideas are valued here and everyone is treated equally. The team is friendly, fun and really cares about what they're doing.", "cons": "Long hours, but hey, it's a startup. Work hard play hard.", "advice": "HR process and overall organization could be improved. Focus some time as you continue to grow."}, {"title": "Fast Paced & Exciting Work", "text": "Pros Exciting energy Diverse set of opinions on the team Interesting work Cons Long hours \"Start-up\" ciaos Advice to Management Keep pushing forward!", "rating": 5, "pros": "Exciting energy", "cons": "Long hours", "advice": "Keep pushing forward!"}, {"title": "Csr!", "text": "Pros Great supervisor's, the comfort of working from your own home, steady hours Cons I've never really had any downsides while working with bedly Advice to Management You guys are great!", "rating": 5, "pros": "Great supervisor's, the comfort of working from your own home, steady hours", "cons": "I've never really had any downsides while working with bedly", "advice": "You guys are great!"}, {"title": "Great company to work for", "text": "Pros Honestly, as a woman working at Bedly, I'm surprised to even see some of these reviews. I've never once felt uncomfortable or like I'm being \"looked down upon\". All the employees including the founders have been nothing but respectful and professional. Cons Long hours and sometimes the workload can be intense. Work comes in ebbs and flows. But then again that's also just the nature of real estate", "rating": 5, "pros": "Honestly, as a woman working at Bedly, I'm surprised to even see some of these reviews. I've never once felt uncomfortable or like I'm being \"looked down upon\". All the employees including the founders have been nothing but respectful and professional.", "cons": "Long hours and sometimes the workload can be intense. Work comes in ebbs and flows. But then again that's also just the nature of real estate", "advice": null}, {"title": "Look for a different start up", "text": "Pros -Working from home -Alot of the contractors are great Cons -Greed -Subleasing apartments and artificially inflating the NYC real estate market -Incompetence/immaturity from management -Cronyism/nepotism (upper management is a group of mid-20 somethings who are all friends from Boston instead of capable/qualified professionals) -Rumors & Drama: some of the employees tell contractors rumors of upper management using company funds/apartments inappropriately. An example is calling them \"Boston Bedly Bros,\" which is in line with the \"bro culture\" a past employee cited. -Poor culture. No vision or insight on ever being promoted or getting raises and most contractors feel unappreciated. -High expectations for low pay -No path forward for employment (instead of 1099) or raises -Lack of diversified workforce (upper management is all white men while contractors are mostly minority women) -No transparency. There have been requests for an organization chart for upwards of six months and it still hasn't been provided. -No accountability for management (since they're all buddies) Advice to Management Drop the arrogance and humble yourselves. Note: hard to rate the CEO when I've never spoken to him, but the word I'd use is \"complicit.\"", "rating": 1, "pros": "-Working from home", "cons": "-Greed", "advice": "Drop the arrogance and humble yourselves."}, {"title": "Amazing team & experience", "text": "Pros Fast paced awesome place to work. The company is growing rapidly & there is an endless amount of opportunity to take on new projects & move up within the company. If you work hard and are willing to learn you'll be well rewarded. Since they are still relatively small you get a chance to see big picture and really feel like you're part of something amazing. Cons You'll be working extremely hard & long hours. If you consider this a con then it's best not to work here.", "rating": 5, "pros": "Fast paced awesome place to work. The company is growing rapidly & there is an endless amount of opportunity to take on new projects & move up within the company. If you work hard and are willing to learn you'll be well rewarded. Since they are still relatively small you get a chance to see big picture and really feel like you're part of something amazing.", "cons": "You'll be working extremely hard & long hours. If you consider this a con then it's best not to work here.", "advice": null}, {"title": "Wolf of Real Estate", "text": "Pros 1. Ergonomic equipment subsidy 2. Work from home / Unlimited PTO 3. Innovation / patent potential if significant scale is reached 4. Cross department collaboration and impact 5. Compensation / Equity is inline with other YC / AngelPad backed startups 6. Pretty good benefits for a pre-series startup: medical, dental, vision, 401k (no match), Bedly apt monthly discount if you move in, and gym membership subsidy among others 7. CEO's socio economic background / network improves chances of more funding from various sources that can get the business out of a tough spot 8. Free dinner during weekly meetings Cons 1. Bro / Fratty / No HR Dept / \"Wolf of Wall Street\" / growing signs of sexual harassment / No Culture 2. Nepotism 3. Little value or care for the customer, very business / numbers focused, at the mercy of investors 4. A much smaller company than their online presence seems to suggest; creates higher expectations on the service Bedly provides for the Landlords and Renters 5. NY HQ is a Bedly apartment; pressure cooker 6. Founders are very inexperienced: tremendous risk from a business and culture perspective; rely more heavily on advisers, consultants, part time workers, and other CEO's from AngelPad startups. This reduces the faith in the very team they hired to do the job and claim to \"invest in their careers\". 7. The smartest / passionate people end up leaving Advice to Management 1. Don't use the company as a power trip / coming of age ceremony 2. Don't scale a business on broken foundations; value best practices and team 3. Don't be afraid to pivot the business 4. Have empathy for your employees and the customer 5. Separate personal life from all aspects of the business 6. Transparency is pick and choose; misleading / controlling / rampant fear 7. Scrappy startup approach leads to severe operational incompetence; useful for prototyping phase not seed and beyond 8. Hire more female workers in the core business (who work at HQ) instead of looking down on them;", "rating": 3, "pros": "1. Ergonomic equipment subsidy", "cons": "1. Bro / Fratty / No HR Dept / \"Wolf of Wall Street\" / growing signs of sexual harassment / No Culture", "advice": "1. Don't use the company as a power trip / coming of age ceremony"}, {"title": "Challenging but rewarding", "text": "Pros Working with a well orientated work group who you could trust enough to pull you through when you are having problems. everyone helps each other out. You can also work from home in a number of different departments which is super convenient. Right from the start I felt welcome and accepted. There work is fast paced and will challenge you everyday. Cons Some departments need more man power but that will grow as the company does.", "rating": 5, "pros": "Working with a well orientated work group who you could trust enough to pull you through when you are having problems. everyone helps each other out. You can also work from home in a number of different departments which is super convenient. Right from the start I felt welcome and accepted. There work is fast paced and will challenge you everyday.", "cons": "Some departments need more man power but that will grow as the company does.", "advice": null}, {"title": "Make your own \"Bed\" elsewhere", "text": "Pros There is autonomy working remotely and a trust given that the work will be done. The schedule was pretty flexible to do other outside jobs. Cons I worked as a part-time Operations Associate for the company and was initially promised a monthly stipend. Instead, they only paid me an hourly rate, which ultimately never amounted to what the monthly stipend would have been. One of the founders also assigned me additional tasks at a certain pay rate but after a month of doing those tasks, he said he would be lowering the pay by almost half. I obviously declined the new \"offer\". I experienced payment delays and my expense reimbursements were sometimes issued almost a month after the work had been completed. There is a disorganization within the main office of the company which affects the work that happens in the fields. This led to operations being far more stressful and labor intensive than necessary. If you are a student just looking to make some extra money, perhaps it is better than working a fast-food restaurant. However, if you are hoping for a real career or career advancement, I strongly urge you to make your own \"Bed\" elsewhere. Advice to Management My advice is to make sure that you are doing things ethically and honoring your initial agreements to both employees and customers. Promising to pay employees one thing and then using bait-and-switch tactics is not the proper way to build a business.", "rating": 3, "pros": "There is autonomy working remotely and a trust given that the work will be done. The schedule was pretty flexible to do other outside jobs.", "cons": "I worked as a part-time Operations Associate for the company and was initially promised a monthly stipend. Instead, they only paid me an hourly rate, which ultimately never amounted to what the monthly stipend would have been.", "advice": "My advice is to make sure that you are doing things ethically and honoring your initial agreements to both employees and customers. Promising to pay employees one thing and then using bait-and-switch tactics is not the proper way to build a business."}]