[{"title": "All good", "text": "Pros Nice benefits, atmosphere in team, beautiful office Cons Is a rather big company (220+)", "rating": 5, "pros": "Nice benefits, atmosphere in team, beautiful office", "cons": "Is a rather big company (220+)", "advice": null}, {"title": "Great company", "text": "Pros The people working here are great. I have never encountered such a friendly and just real environment in a company until I got to Blacklane. I would recommend it to anyone who would want to come to work everyday and be happy about their job and the people they work with. Cons There is a lot happening, a lot of changes and rapid growth, but this is not negative. The company is growing fast. Advice to Management Keep on loving what you do. You are doing a great job!", "rating": 5, "pros": "The people working here are great. I have never encountered such a friendly and just real environment in a company until I got to Blacklane.", "cons": "There is a lot happening, a lot of changes and rapid growth, but this is not negative. The company is growing fast.", "advice": "Keep on loving what you do. You are doing a great job!"}, {"title": "Exactly the opportunity I was looking for", "text": "Pros This is a company that values people with ideas, whether or not they are directly relevant to your job title. They like to discuss and experiment with a wider variety of initiatives than I would have expected: team building exercises that are actually fun, internal interest groups on various topics, educational opportunities, chances to work with, for example, non-profits or on projects that contribute to the betterment of the world. And in your actual work, you have a high degree of autonomy and a real say in what technologies or best practices are used. Work life is also flexible, though it depends on the team. You might be able to work from home multiple days per week, for example. Some teams also have \"innovation Fridays\", a practice that is spreading around the company, when you can work on whatever you want, similar to Google's 20% time idea. Overall, I can't imagine a company going further to accommodate the needs and desires of its employees. Cons One of the drawbacks of the rather flat decision-making process is that it's sometimes hard to make decisions to begin with. We occasionally feel a lack of leadership and productive communication, within and between teams. Everyone is aware of this, however, so it's something we're trying to improve on an ongoing basis. Advice to Management As the company grows, don't lose touch with the grassroots.", "rating": 5, "pros": "This is a company that values people with ideas, whether or not they are directly relevant to your job title. They like to discuss and experiment with a wider variety of initiatives than I would have expected: team building exercises that are actually fun, internal interest groups on various topics, educational opportunities, chances to work with, for example, non-profits or on projects that contribute to the betterment of the world. And in your actual work, you have a high degree of autonomy and a real say in what technologies or best practices are used. Work life is also flexible, though it depends on the team. You might be able to work from home multiple days per week, for example. Some teams also have \"innovation Fridays\", a practice that is spreading around the company, when you can work on whatever you want, similar to Google's 20% time idea. Overall, I can't imagine a company going further to accommodate the needs and desires of its employees.", "cons": "One of the drawbacks of the rather flat decision-making process is that it's sometimes hard to make decisions to begin with. We occasionally feel a lack of leadership and productive communication, within and between teams. Everyone is aware of this, however, so it's something we're trying to improve on an ongoing basis.", "advice": "As the company grows, don't lose touch with the grassroots."}, {"title": "IT", "text": "Pros Extremely open culture, flexible working hours, home office support, fun social activities and multi-cultural office. I feel lucky to have been chosen to work with my team, they are really talented individuals. Cons The communication between departments and teams really needs to be improved to make life a little easier as we continue to grow. Oversight of middle management and communication channels to support staff would improve moral. Low attrition could be caused by some of the middle management being a bit rouge...greater structure around how staff are managed from HR maybe could help? Advice to Management C-suite very approachable and full of ideas Sometimes lack of strategy / long-term vision and the steps needed to get there", "rating": 5, "pros": "Extremely open culture, flexible working hours, home office support, fun social activities and multi-cultural office. I feel lucky to have been chosen to work with my team, they are really talented individuals.", "cons": "The communication between departments and teams really needs to be improved to make life a little easier as we continue to grow.", "advice": "C-suite very approachable and full of ideas"}, {"title": "Great place to work", "text": "Pros great working atmosphere! surrounded by motivated and skilled people in a beautiful office it is simply fun to work here. A big plus is also that there are no fixed working hours and you can decide on your own if you'd rather start at 7 in the morning or work late at night. Cons only few very very experienced people to learn from", "rating": 5, "pros": "great working atmosphere! surrounded by motivated and skilled people in a beautiful office it is simply fun to work here.", "cons": "only few very very experienced people to learn from", "advice": null}, {"title": "Great opportunities for those who want them", "text": "Pros Great, friendly environment Genuine and caring management Great progression opportunities for those who want and work for them C-Level honestly has the staffs' best interests at heart Cons Change and progress on the tech side can be frustratingly slow since the Dev team is often stretched thin Advice to Management You are already a fantastic group of people that shows genuine care for your teams. For me, the biggest change needs to come from the tech side. Many teams are still using old and outdated tools, processes and policies that weren't designed for a company the size we are now.", "rating": 5, "pros": "Great, friendly environment", "cons": "Change and progress on the tech side can be frustratingly slow since the Dev team is often stretched thin", "advice": "You are already a fantastic group of people that shows genuine care for your teams."}, {"title": "awesome people", "text": "Pros extraordinary colleagues from all over the world, management team always approachable, equal treatment of all employees, great office, great social activities Cons communication between different department could be improved Advice to Management stay that way", "rating": 5, "pros": "extraordinary colleagues from all over the world, management team always approachable, equal treatment of all employees, great office, great social activities", "cons": "communication between different department could be improved", "advice": "stay that way"}, {"title": "some room for improvement", "text": "Pros - good work atmosphere (depends on the department) - fair salary - company benefits (gym pass, 2 free rides for Blacklane employees each month, weekly after work freaky Friday's with free drinks, free lunch with some Blacklane colleagues once a month) - annual Blacklane X-mas party - very international and young company - nice and comfy office Cons - working in shifts and working at weekends - not much flexibility within the scheduled shifts - if you would like to work in home office then it depends in which department you are working. Some departments get a laptop straight away and in some departments they tell you they don't have available laptops for doing home office - they need to exchange some chairs (they don't pay for an extra ergonomic chair if needed due to health issues) - It would be good to also promote people who \"don't scream the loudest\" but are very competent and good at their job - communication between departments should be improved - Overtime is welcomed (and paid) but not forced which is good, but it would be great if they don't expect you to stay longer if you are a few minutes late once in a while, whereas usually you arrive at least 15 minutes earlier. Therefore a time stamp system would be better. - the customer care team has to work in shifts which is a big contra Advice to Management - Focus on staff satisfaction first - Continue to listen to your employees - some of the so called \"team leader\" in Customer Care seem nice, but you have to watch out what you say and whom you can really trust. Most of them actually don't really care about the single employee and just want to save their position", "rating": 3, "pros": "- good work atmosphere (depends on the department)", "cons": "- working in shifts and working at weekends", "advice": "- Focus on staff satisfaction first"}, {"title": "Great organization to work for, love coming into the office", "text": "Pros - Great working culture and overall environment - Visionary, accessible and strong senior leadership - meaningful challenges and exciting projects - Lots of training opportunities available - Great work and life balance Cons - time management - too much bureaucracy Advice to Management Ensure all managers have better training and take note of the very high turnover in some teams Focus on staff satisfaction first. Results will follow if staff are engaged and satisfied", "rating": 5, "pros": "- Great working culture and overall environment", "cons": "- time management", "advice": "Ensure all managers have better training and take note of the very high turnover in some teams"}, {"title": "Some grey area between start up and actual company", "text": "Pros Lots of good people work there with lots of good ideas Cons The company motto and ethics are all about 'family' and 'respect' when in reality this couldn't be further from the truth. Loads of leads and management but no real systems in place so it feels as if they are making it up as they go along. Customer service trainers need training themselves. Overall business model is exploiting drivers and paying them very little", "rating": 1, "pros": "Lots of good people work there with lots of good ideas", "cons": "The company motto and ethics are all about 'family' and 'respect' when in reality this couldn't be further from the truth. Loads of leads and management but no real systems in place so it feels as if they are making it up as they go along. Customer service trainers need training themselves. Overall business model is exploiting drivers and paying them very little", "advice": null}, {"title": "Senior Software Engineer", "text": "Pros - Most of the people do care a lot about their work. - Good, neutral company culture. - If you are a foreigner, company is very helpful in solving all of your paperwork. Cons - In 2015-2016 company had serious issues with management in the tech teams. People say that it is much better these days. - Not much space to grow technically if you do not want to stay within what you learned forever. YMMV.", "rating": 5, "pros": "- Most of the people do care a lot about their work.", "cons": "- In 2015-2016 company had serious issues with management in the tech teams. People say that it is much better these days.", "advice": null}, {"title": "Not bad but could be better,pay is bad", "text": "Pros Customer care-Nice atmosphere,friendly people,very interesting building,parties on friday and some other nice things Cons No particular challenge of working here,pretty much the same like in any other corporation(company is becoming a corpo thing and everything is official and fake) Advice to Management Management is doing a lot of things on its own without having a clue how many dissapointed employees are there. No one on the top is transparent and pretty much in their world. Very bad and amateur management.", "rating": 3, "pros": "Customer care-Nice atmosphere,friendly people,very interesting building,parties on friday and some other nice things", "cons": "No particular challenge of working here,pretty much the same like in any other corporation(company is becoming a corpo thing and everything is official and fake)", "advice": "Management is doing a lot of things on its own without having a clue how many dissapointed employees are there. No one on the top is transparent and pretty much in their world. Very bad and amateur management."}, {"title": "C level think there Elon Musk, there a million miles away!", "text": "Pros Was paid on time and Friday beers were nice. Cons The company simple don’t make money! Never have and never will. Literally 95% of the company are just sitting around doing nothing. At first it seems ok but you quickly realize that C level really have no idea what there doing. Really disappointed with my time there. I also had ethically issues with the company after a year. Everyone acts like there changing the world.... all there doing is providing the biggest gas guzzling/polluting cars for rich people. Not exactly motivating and in the end I wasn’t comfortable with there business model. Advice to Management There are more C level staff than most department have staff. You are super top heavy! You don’t need 4 C level and 19 directors??", "rating": 1, "pros": "Was paid on time and Friday beers were nice.", "cons": "The company simple don’t make money! Never have and never will. Literally 95% of the company are just sitting around doing nothing. At first it seems ok but you quickly realize that C level really have no idea what there doing. Really disappointed with my time there. I also had ethically issues with the company after a year. Everyone acts like there changing the world.... all there doing is providing the biggest gas guzzling/polluting cars for rich people. Not exactly motivating and in the end I wasn’t comfortable with there business model.", "advice": "There are more C level staff than most department have staff. You are super top heavy! You don’t need 4 C level and 19 directors??"}, {"title": "Discover your dark side and work for Blacklane.", "text": "Pros Everything look perfect, but it's not. Cons Bad salary, bad management, no culture, gender discrimination. Advice to Management “What you do is what matters, not what you think or say or plan.” JF", "rating": 1, "pros": "Everything look perfect, but it's not.", "cons": "Bad salary, bad management, no culture, gender discrimination.", "advice": "“What you do is what matters, not what you think or say or plan.” JF"}, {"title": "Do not work here if you want to work in a free environment with flat hierarchy", "text": "Pros International company full of interesting colleagues Cons Blacklane is a very hierarchical company where decisions are taken from above and you just have to follow the rules. The company was created by 2 friends and the core staff, or leadership team, is based on a bunch of friends of friends. Needless to say that this leadership team has certain privileges that others don´t. Therefore everything is very biased and you´d better not question these guys. Also hierarchy is quite crazy there, we got interns, juniors, managers, head of, directors, CRO, CFO, CTO, CEO, etc. Absolutely a tightened structure that only works to control people and tell them what to do. Advice to Management I got quite disappointed with the Management since at the beginning they looked like they cared about the employee and they tried to create this type of \"family environment\" but finally you can really see it is not like that at all.", "rating": 3, "pros": "International company full of interesting colleagues", "cons": "Blacklane is a very hierarchical company where decisions are taken from above and you just have to follow the rules.", "advice": "I got quite disappointed with the Management since at the beginning they looked like they cared about the employee and they tried to create this type of \"family environment\" but finally you can really see it is not like that at all."}, {"title": "Inclusive culture, good leadership", "text": "Pros Never worked with kinder, smarter people in my life. The company is extremely consultative with staff at all levels. I know companies say they aren't hierarchical but at blacklane an intern can go up to a director / MD and tell them something is a bad idea and will be listened to Cons Too many meeting. The down side of being consultative is that there are lots of consultations. Slows down the product improvement/velocity Advice to Management Learn to let fires burn. And focus on highest gain the fastest route", "rating": 5, "pros": "Never worked with kinder, smarter people in my life.", "cons": "Too many meeting. The down side of being consultative is that there are lots of consultations. Slows down the product improvement/velocity", "advice": "Learn to let fires burn. And focus on highest gain the fastest route"}, {"title": "Great place to work", "text": "Pros flexible working hours, innovative environment, amazing teamatmosphere, a lot of responsibilities, smart collegues, huge social area with the oligatory kicker and table tennis Cons Due to the large office with 5 floors you don't have the chance to get to know everybody and to see everyone on a daily basis but having such a big office in Berlin is a blessing! Can´t think of any more negative points yet", "rating": 5, "pros": "flexible working hours, innovative environment, amazing teamatmosphere, a lot of responsibilities, smart collegues, huge social area with the oligatory kicker and table tennis", "cons": "Due to the large office with 5 floors you don't have the chance to get to know everybody and to see everyone on a daily basis but having such a big office in Berlin is a blessing! Can´t think of any more negative points yet", "advice": null}, {"title": "Good company to work for", "text": "Pros friendly staff, supportive and flexible management Cons shiftwork. It can be hard to plan around the shifts", "rating": 5, "pros": "friendly staff, supportive and flexible management", "cons": "shiftwork. It can be hard to plan around the shifts", "advice": null}, {"title": "Nice place, bad coding practices", "text": "Pros Nice people, flexible work conditions. Cons Code quality is pretty bad", "rating": 3, "pros": "Nice people, flexible work conditions.", "cons": "Code quality is pretty bad", "advice": null}, {"title": "Working place with heart", "text": "Pros -Amazing colleagues: very talented, friendly and open minded -Great office! -Management approachable all the time -Cozy and spacious social area -Every Friday drinks, music and get together Cons -Decisions sometimes not transparent (improving at the moment) -Some still insecure and inexperienced middle management people (but show potential to become good leader) Advice to Management -Continue to listen to your employees! -Keep on doing: We are going in the right direction with our strategy.", "rating": 5, "pros": "-Amazing colleagues: very talented, friendly and open minded", "cons": "-Decisions sometimes not transparent (improving at the moment)", "advice": "-Continue to listen to your employees!"}, {"title": "Blacklane experience", "text": "Pros great colleagues and working atmosphere Cons too many mid and senior-level management, not efficient communication between departments", "rating": 5, "pros": "great colleagues and working atmosphere", "cons": "too many mid and senior-level management, not efficient communication between departments", "advice": null}, {"title": "Flexible and loyal", "text": "Pros - flexible - takes parental responsibilities into consideration - friendly, cooperative atmosphere - considerate, interested and personable bosses - reward loyal employees - realistic chance of moving within company Cons - having at one point grown very quickly, there was a time when the teams needed streamlining. This came as a shock to many.", "rating": 5, "pros": "- flexible", "cons": "- having at one point grown very quickly, there was a time when the teams needed streamlining. This came as a shock to many.", "advice": null}, {"title": "a great start-up company!", "text": "Pros - great culture, very nice people who truly care about each other - very international team, many different languages and nationalities - company language is English. Speaking German is not a prerequisite - big lofty office space in a former turn of the century factory building - variety of company events - great opportunity to shape the future of the business Cons - needs to have some more processes in place - ownership and responsibilities need to be clearer", "rating": 5, "pros": "- great culture, very nice people who truly care about each other", "cons": "- needs to have some more processes in place", "advice": null}, {"title": "It's not what it seems", "text": "Pros - Big and comfortable office - Colleagues are mostly friendly and international (but only in some teams) Cons - A big office doesn't mean that the company is successful - Some Heads are absolute beginners and lack of any experience in people management - Internal communication is fake - Company culture is a mere copy of what it is like in bigger companies - You basically just have to be lucky to be in the right team with nice colleagues - People can get fired in one day without previous discussion", "rating": 1, "pros": "- Big and comfortable office", "cons": "- A big office doesn't mean that the company is successful", "advice": null}, {"title": "Customer Care Agent", "text": "Pros The Team is great and great culture Cons limited career progression, salary not great.", "rating": 5, "pros": "The Team is great and great culture", "cons": "limited career progression, salary not great.", "advice": null}, {"title": "Good place to work at", "text": "Pros Good work-life balance. Good opportunity to contribute with your ideas. Cons Growing too fast with a lot of changes in a short period of time.", "rating": 5, "pros": "Good work-life balance.", "cons": "Growing too fast with a lot of changes in a short period of time.", "advice": null}, {"title": "Product Development", "text": "Pros Innovative startup company with competitive rates and service in marketplace. Cons Low salary, car service is subpar. Disorganised. Advice to Management Listen to your employees. Hire outside consultants who have background and fully understand black car service industry.", "rating": 3, "pros": "Innovative startup company with competitive rates and service in marketplace.", "cons": "Low salary, car service is subpar. Disorganised.", "advice": "Listen to your employees. Hire outside consultants who have background and fully understand black car service industry."}, {"title": "SEO", "text": "Pros Young environment, flexibility, nice atmosphere Cons Low salaries, poor career progression", "rating": 3, "pros": "Young environment, flexibility, nice atmosphere", "cons": "Low salaries, poor career progression", "advice": null}, {"title": "Very friendly work environment, competent Heads and MDs, general enthusiasm driven by big expectations.", "text": "Pros 1) You can learn a lot from the Heads and MDs, given their proved and very relevant past work experience... 2) There are many opportunities to get new friends... 3) The environment is quite international and open-minded, all cultures are welcomed and the official work language is English... Cons 1) ...but sometimes they won't share their knowledge with you 2) ...but the employees' turnover is quite high (rough estimation: 30% per year) 3) ...but it is still a German company: almost all the Heads are German native speakers, and you better know German anyways if you want to stay there a longer time Advice to Management Start some more structured HR management, focusing on retainment and training; I had the feeling that most employees (except the management) see their job at Blacklane as a mere transactional phase of their career. In order to encourage diversity, I would seek a better balance between German and not German managers.", "rating": 5, "pros": "1) You can learn a lot from the Heads and MDs, given their proved and very relevant past work experience...", "cons": "1) ...but sometimes they won't share their knowledge with you", "advice": "Start some more structured HR management, focusing on retainment and training; I had the feeling that most employees (except the management) see their job at Blacklane as a mere transactional phase of their career. In order to encourage diversity, I would seek a better balance between German and not German managers."}]