[{"title": "Rewarded for hard work", "text": "Pros BlackRock is a place where you can build a great career. You will be working with the brightest and hardest working individuals in the industry. I have been with BlackRock for 10 years and have had the opportunity to continually feel challenged and grow. I am constantly put on new projects and have my responsibilities rotated. Through all of this they have taken good care of me through a total compensation that includes awesome benefits and generous financial incentives. Cons Hours can be long, you are expected to get the job done and although they recognize and reward hard work the expectation is high to ensure your working to your highest potential.", "rating": 5, "pros": "BlackRock is a place where you can build a great career. You will be working with the brightest and hardest working individuals in the industry. I have been with BlackRock for 10 years and have had the opportunity to continually feel challenged and grow. I am constantly put on new projects and have my responsibilities rotated. Through all of this they have taken good care of me through a total compensation that includes awesome benefits and generous financial incentives.", "cons": "Hours can be long, you are expected to get the job done and although they recognize and reward hard work the expectation is high to ensure your working to your highest potential.", "advice": null}, {"title": "Exceptional place to start a career", "text": "Pros Just upped Analyst salary to match marketplace. Far and away the leader in asset management in terms of compensation. Great analyst program. Cons Lack of diversity. Retention of diverse analysts is abysmal partially due to poor training of managers. Still improving brand recognition to compete with other tech companies. Advice to Management Improve middle management", "rating": 5, "pros": "Just upped Analyst salary to match marketplace. Far and away the leader in asset management in terms of compensation. Great analyst program.", "cons": "Lack of diversity. Retention of diverse analysts is abysmal partially due to poor training of managers. Still improving brand recognition to compete with other tech companies.", "advice": "Improve middle management"}, {"title": "Managing Director", "text": "Pros Truly aspirational and progressive for a big company always puts clients first fosters talent Cons comp isn't super competitive lots of politics", "rating": 5, "pros": "Truly aspirational and progressive for a big company", "cons": "comp isn't super competitive", "advice": null}, {"title": "Financial Analyst", "text": "Pros Great work culture that encourages internal mobility and provides plenty of opportunity to build a long career. Cons Culture encourages and rewards hard work, but hours can be long.", "rating": 5, "pros": "Great work culture that encourages internal mobility and provides plenty of opportunity to build a long career.", "cons": "Culture encourages and rewards hard work, but hours can be long.", "advice": null}, {"title": "Director", "text": "Pros Competitive benefits, strong culture of high ethics and collaboration, strong executive management, highly respected company, healthy culture, a great place to work Cons salaries do not keep pace with the market, little to no comp growth over time, inconsistent and sometimes poor middle management", "rating": 5, "pros": "Competitive benefits, strong culture of high ethics and collaboration, strong executive management, highly respected company, healthy culture, a great place to work", "cons": "salaries do not keep pace with the market, little to no comp growth over time, inconsistent and sometimes poor middle management", "advice": null}, {"title": "Analyst", "text": "Pros Large Company Good opportunities for those who want to do more Cons Too political and hierarchical Culture inconsistent across teams Bad work life balance for certain jobs", "rating": 5, "pros": "Large Company", "cons": "Too political and hierarchical", "advice": null}, {"title": "Lots of opportunities but you have to fight for it", "text": "Pros Fair pay for performance, numerous areas of innovation, especially in SF and London ex-BGI offices: smart beta, SAE, trading research. Cons Those areas of innovation can be hard to get into. Some areas, especially related to data science, tend to be closed organizations. An attempt to innovate in some departments may get a cold shoulder. There is little information sharing even across different research-like groups. Many research and data related tasks are duplicated due to lack of common code base. Advice to Management Break the barriers unless you want to have a Jump trading/Tower research environment of lone wolf quants competing for risk budget in the most lucrative products. Continue the great tradition of looking at different markets and opportunities, as well investment in alternative data and infrastructure", "rating": 5, "pros": "Fair pay for performance, numerous areas of innovation, especially in SF and London ex-BGI offices: smart beta, SAE, trading research.", "cons": "Those areas of innovation can be hard to get into. Some areas, especially related to data science, tend to be closed organizations. An attempt to innovate in some departments may get a cold shoulder. There is little information sharing even across different research-like groups. Many research and data related tasks are duplicated due to lack of common code base.", "advice": "Break the barriers unless you want to have a Jump trading/Tower research environment of lone wolf quants competing for risk budget in the most lucrative products. Continue the great tradition of looking at different markets and opportunities, as well investment in alternative data and infrastructure"}, {"title": "Analyst Program", "text": "Pros Good atmosphere, growth opportunities, rewarding Cons Too much management, less focus on nurturing younger talent", "rating": 5, "pros": "Good atmosphere, growth opportunities, rewarding", "cons": "Too much management, less focus on nurturing younger talent", "advice": null}, {"title": "Director", "text": "Pros Work life balance, company supports flexible work schedules (working from home), good benefits and recently implemented flexible time off (no max in the number of days you can take a year) Cons Managers can be sexist paying women less after they become mothers, I was paid more working for a man than I am now working for a woman", "rating": 3, "pros": "Work life balance, company supports flexible work schedules (working from home), good benefits and recently implemented flexible time off (no max in the number of days you can take a year)", "cons": "Managers can be sexist paying women less after they become mothers, I was paid more working for a man than I am now working for a woman", "advice": null}, {"title": "Good company, making a turn for the worse.", "text": "Pros Engaging and fun environment. Cons Non-existent work-life balance and long hours, with compensation incentive only for the \"favorite businesses or leaders.\" Advice to Management Pay attention to how the culture has changed before it is too late.", "rating": 3, "pros": "Engaging and fun environment.", "cons": "Non-existent work-life balance and long hours, with compensation incentive only for the \"favorite businesses or leaders.\"", "advice": "Pay attention to how the culture has changed before it is too late."}, {"title": "Identity Access Management Administrator/Engineer", "text": "Pros Classic Business Financial work environment yet dynamically open like an Upstart cultural work place. Cons You tend to overwork yourself. (maybe its just me..) Advice to Management More Transparency", "rating": 3, "pros": "Classic Business Financial work environment yet dynamically open like an Upstart cultural work place.", "cons": "You tend to overwork yourself. (maybe its just me..)", "advice": "More Transparency"}, {"title": "Best Financial Firm to Work At", "text": "Pros Great career mobility opportunities, exposure to senior management at junior levels, successful company with a culture of innovation Cons Work/life balance can be challenging given high expectations and relatively lean operating model, comp is decent but not great (low salaries, better on the incentive side)", "rating": 5, "pros": "Great career mobility opportunities, exposure to senior management at junior levels, successful company with a culture of innovation", "cons": "Work/life balance can be challenging given high expectations and relatively lean operating model, comp is decent but not great (low salaries, better on the incentive side)", "advice": null}, {"title": "Great culture", "text": "Pros Friendly helpful people who truly want you to succeed Cons Compensation is not the greatest Advice to Management Allow more room for upward mobility", "rating": 5, "pros": "Friendly helpful people who truly want you to succeed", "cons": "Compensation is not the greatest", "advice": "Allow more room for upward mobility"}, {"title": "Good benefits", "text": "Pros Creating flexible work, extended vacation time, unlimited sick time, company 401k match and pension. Cons Some Managers only know how to manage upwards. They don't value Administrative staff. Will easily lay them off if new MD wants new Assistant instead of keeping talent. Very cut throat. New management comes in and cuts out top producers just cause she/he wants to bring unqualified friends to fill the role. Even if business is doing very well they will eliminate talent and claim \"New approach\" \"New direction\" but keep same outline just change name. Advice to Management Keep talent and top producers. Need to stop the turnover. Provide exit interviews so you get a true sense of what is really happening. Also be more involved downwards not just upwards levels. You are losing good loyal people.", "rating": 5, "pros": "Creating flexible work, extended vacation time, unlimited sick time, company 401k match and pension.", "cons": "Some Managers only know how to manage upwards. They don't value Administrative staff. Will easily lay them off if new MD wants new Assistant instead of keeping talent. Very cut throat. New management comes in and cuts out top producers just cause she/he wants to bring unqualified friends to fill the role. Even if business is doing very well they will eliminate talent and claim \"New approach\" \"New direction\" but keep same outline just change name.", "advice": "Keep talent and top producers. Need to stop the turnover. Provide exit interviews so you get a true sense of what is really happening. Also be more involved downwards not just upwards levels. You are losing good loyal people."}, {"title": "Associate", "text": "Pros Strong upper management, benefits, training Cons Middle management, not much work-life balance Advice to Management Try not to micro-manage too much.", "rating": 5, "pros": "Strong upper management, benefits, training", "cons": "Middle management, not much work-life balance", "advice": "Try not to micro-manage too much."}, {"title": "Good company, hard to find the right person", "text": "Pros good reputation lots of opportunities large organization, so a lot of cool things going on Cons a little unorganized, especially the tech pay for entry analysts is not great Advice to Management too slow in terms of keeping a competitive salary", "rating": 5, "pros": "good reputation", "cons": "a little unorganized, especially the tech", "advice": "too slow in terms of keeping a competitive salary"}, {"title": "Great Place to Build a Career", "text": "Pros Work with the best and brightest in the industry and get access to the most powerful fintech tools in the industry. Cons Not many cons, BlackRock is a great place to work.", "rating": 5, "pros": "Work with the best and brightest in the industry and get access to the most powerful fintech tools in the industry.", "cons": "Not many cons, BlackRock is a great place to work.", "advice": null}, {"title": "Great work environment with smart people willing to help you learn and grow", "text": "Pros Great people to work with, flexible time off, and many opportunities to advance. Upper management is very accessible and willing to hear new ideas. Cons Pays slightly below industry average. Current building is outdated so depending on what floor one is on you may not be able to see outside all day", "rating": 5, "pros": "Great people to work with, flexible time off, and many opportunities to advance. Upper management is very accessible and willing to hear new ideas.", "cons": "Pays slightly below industry average. Current building is outdated so depending on what floor one is on you may not be able to see outside all day", "advice": null}, {"title": "Associate", "text": "Pros Smart environment, brand new policy for unlimited vacation days, leader in the industry, and challenging work. Cons The corporate structure is bloated and could use some trimming, more connectivity across business lines would help incentivise teams, more internal opportunities for mobility.", "rating": 5, "pros": "Smart environment, brand new policy for unlimited vacation days, leader in the industry, and challenging work.", "cons": "The corporate structure is bloated and could use some trimming, more connectivity across business lines would help incentivise teams, more internal opportunities for mobility.", "advice": null}, {"title": "Analyst", "text": "Pros Great incentives, good environment, truly friendly colleague Cons bad work-life balance, salary is not competitive enough", "rating": 5, "pros": "Great incentives, good environment, truly friendly colleague", "cons": "bad work-life balance, salary is not competitive enough", "advice": null}, {"title": "Institutional Sales", "text": "Pros Large network, intelligent coworkers, tremendous investment knowledge Cons A lot of red-tape and operational constraints.", "rating": 5, "pros": "Large network, intelligent coworkers, tremendous investment knowledge", "cons": "A lot of red-tape and operational constraints.", "advice": null}, {"title": "Great short term job", "text": "Pros You learn a lot and have access to lots of clients. Cons No work life balance and they are unapologetic about letting you know you are replaceable. Even 20 yr vets have zero security.", "rating": 3, "pros": "You learn a lot and have access to lots of clients.", "cons": "No work life balance and they are unapologetic about letting you know you are replaceable. Even 20 yr vets have zero security.", "advice": null}, {"title": "Business Manager", "text": "Pros World's largest investment manager, well-respected Cons Long hours, stressful, too many opinions, difficult to get things done Advice to Management Start thinking about growing your employee's careers rather than using them and letting them go", "rating": 3, "pros": "World's largest investment manager, well-respected", "cons": "Long hours, stressful, too many opinions, difficult to get things done", "advice": "Start thinking about growing your employee's careers rather than using them and letting them go"}, {"title": "data analyst", "text": "Pros Incredible smart people to work with Cons Takes a long time for career growth", "rating": 5, "pros": "Incredible smart people to work with", "cons": "Takes a long time for career growth", "advice": null}, {"title": "Difficult culture", "text": "Pros There are some brilliant people to work with, terrific benefits, good pay, options, etc. Cons BlackRock founders consider the company to be a technology firm, but the underlying culture behaves like a typical wall street shop. There are 1,500+ technologists out of the nearly 14,000 employed. Some of the founding engineers have only worked at BlackRock as their first and the last job, innovation does not come with complacency. The higher the hierarchy you go, the more competitive it becomes, and you will quickly acknowledge that upward mobility is a long-term (>10yrs) endeavor, which happens only when endorsed and favored by those at the top requiring ample maneuverability through the aggressive politics. There is too much legacy in the technology group creating overlapping organizational layers that do not make sense further leading to a decentralized culture. Seemingly simple enough tasks require several discussions before any agreements are made, and nothing is done until the last critical minute, exasperating the just-in-time culture problem. Advice to Management Get ready for the millennial workforce, drop the street-styled \"you should consider yourself privileged to work here\" attitude. Be a technology firm, treat people with respect and reward those willing to take a risk without instilling Fear, Doubt, and Uncertainty.", "rating": 3, "pros": "There are some brilliant people to work with, terrific benefits, good pay, options, etc.", "cons": "BlackRock founders consider the company to be a technology firm, but the underlying culture behaves like a typical wall street shop. There are 1,500+ technologists out of the nearly 14,000 employed. Some of the founding engineers have only worked at BlackRock as their first and the last job, innovation does not come with complacency. The higher the hierarchy you go, the more competitive it becomes, and you will quickly acknowledge that upward mobility is a long-term (>10yrs) endeavor, which happens only when endorsed and favored by those at the top requiring ample maneuverability through the aggressive politics. There is too much legacy in the technology group creating overlapping organizational layers that do not make sense further leading to a decentralized culture. Seemingly simple enough tasks require several discussions before any agreements are made, and nothing is done until the last critical minute, exasperating the just-in-time culture problem.", "advice": "Get ready for the millennial workforce, drop the street-styled \"you should consider yourself privileged to work here\" attitude. Be a technology firm, treat people with respect and reward those willing to take a risk without instilling Fear, Doubt, and Uncertainty."}, {"title": "Active Management not a focus", "text": "Pros Huge platform to leverage which allows for a lot of opportunities. Cons No direction from senior management, no long term plan", "rating": 3, "pros": "Huge platform to leverage which allows for a lot of opportunities.", "cons": "No direction from senior management, no long term plan", "advice": null}, {"title": "Portfolio Manager", "text": "Pros Brand name, Internal mobility, Company growth, Risk management, Corporate governance Cons Complex hierarchy, siloed functions, lack of competitor focus", "rating": 5, "pros": "Brand name, Internal mobility, Company growth, Risk management, Corporate governance", "cons": "Complex hierarchy, siloed functions, lack of competitor focus", "advice": null}, {"title": "Credit Research Analyst", "text": "Pros Great people to work with. A ton of opportunity to learn inside and outside your department. Insight from a lot of smart people from all over the globe. Cons Far commute from Philadelphia", "rating": 5, "pros": "Great people to work with. A ton of opportunity to learn inside and outside your department. Insight from a lot of smart people from all over the globe.", "cons": "Far commute from Philadelphia", "advice": null}, {"title": "Culture that sours after a few years", "text": "Pros Learning culture, independence in thought and idea generation is valued and encouraged. Great place to start a career. Cons Large company, specified job functions, difficult to move internally, especially upstream. Rewarding favorites is the name of the game. Advice to Management Treat people like people, not robots. Individual attention, even for 5 minutes, matters more than you know. Also, celebrate people's achievements if/when they leave your department, instead of shunning them or being cold and rude.", "rating": 3, "pros": "Learning culture, independence in thought and idea generation is valued and encouraged. Great place to start a career.", "cons": "Large company, specified job functions, difficult to move internally, especially upstream. Rewarding favorites is the name of the game.", "advice": "Treat people like people, not robots. Individual attention, even for 5 minutes, matters more than you know. Also, celebrate people's achievements if/when they leave your department, instead of shunning them or being cold and rude."}, {"title": "Director", "text": "Pros Diversity focused, entrepreneurial, industry leader, high grade of investor trust Cons Lacks transparency, meritocracy, takes a while to ramp up, hiring process", "rating": 5, "pros": "Diversity focused, entrepreneurial, industry leader, high grade of investor trust", "cons": "Lacks transparency, meritocracy, takes a while to ramp up, hiring process", "advice": null}, {"title": "Great company to work for", "text": "Pros Great company to work for, good people, competitive pay. Cons Work life balance could be better, long hours can take a toll after a while", "rating": 5, "pros": "Great company to work for, good people, competitive pay.", "cons": "Work life balance could be better, long hours can take a toll after a while", "advice": null}, {"title": "Great company that is growing their technology footprint", "text": "Pros Growing their internal mobility opportunities. Honest company with values. Great outlook on technology growth Cons Could use more external perspective embedded in senior management, which they are beginning to implement now", "rating": 5, "pros": "Growing their internal mobility opportunities. Honest company with values. Great outlook on technology growth", "cons": "Could use more external perspective embedded in senior management, which they are beginning to implement now", "advice": null}, {"title": "Operation center", "text": "Pros teams are very nice and helpful Cons the work is pretty routine and you won't learn much from it except procedures", "rating": 5, "pros": "teams are very nice and helpful", "cons": "the work is pretty routine and you won't learn much from it except procedures", "advice": null}, {"title": "Company review", "text": "Pros Great company, well-managed, colloquial environment Cons Can be hard to move up", "rating": 5, "pros": "Great company, well-managed, colloquial environment", "cons": "Can be hard to move up", "advice": null}, {"title": "Associate at MAS Product Marketing", "text": "Pros Great place to learn about asset management industry Supportive senior management and leadership Lot of opportunities to grow Great work life balance Cons Sometimes bureaucracy hinders the innovation and great ideas Advice to Management Continue to enhance the middle management", "rating": 5, "pros": "Great place to learn about asset management industry", "cons": "Sometimes bureaucracy hinders the innovation and great ideas", "advice": "Continue to enhance the middle management"}, {"title": "Great company and people", "text": "Pros Surround yourself with great folks Cons big company structure and everything that comes with that", "rating": 5, "pros": "Surround yourself with great folks", "cons": "big company structure and everything that comes with that", "advice": null}, {"title": "Executive Assistant", "text": "Pros great company, excellent benefits, lots of company perks Cons no cons at this time Advice to Management none at time time", "rating": 5, "pros": "great company, excellent benefits, lots of company perks", "cons": "no cons at this time", "advice": "none at time time"}, {"title": "Analyst Review", "text": "Pros Good Place to work. Great work-life balance Cons Can't think of any now", "rating": 3, "pros": "Good Place to work. Great work-life balance", "cons": "Can't think of any now", "advice": null}, {"title": "Aladdin Product Group", "text": "Pros Pay is nice Problems and Challenges are collaborative by nature Switching within teams and learning is encouraged You can learn all about Finance, as Blackrock offers a lot of opportunities to do so Great Work-Life Balance Cons APG is very distinct from other divisions within Blackrock, and you can feel it. Breaking out of tech in Blackrock isn't the easiest thing to do in the world.", "rating": 5, "pros": "Pay is nice", "cons": "APG is very distinct from other divisions within Blackrock, and you can feel it.", "advice": null}, {"title": "Good Organization", "text": "Pros Strong Corporate & Regional Leadership. Very competitive salary, good benefits, empowers employees to work independently. Excellent work life balance. Cons Tough to advance unless located in the corporate office.", "rating": 5, "pros": "Strong Corporate & Regional Leadership. Very competitive salary, good benefits, empowers employees to work independently. Excellent work life balance.", "cons": "Tough to advance unless located in the corporate office.", "advice": null}, {"title": "All over the place", "text": "Pros This is a bigger organization than you'd think so something interesting is always happening. The brand is becoming more recognized and it's clear the business has a future. There are definitely some very talented employees here. Cons Your career will be entirely manager/department dependent. Some of the teams have great culture, pay and promote well, and retain talent - others are just bleeding employees and are missing the signals why. Advice to Management Stop paying lip service and measure the effectiveness of employee-focused initiatives. This must be the only financial company with infinite manager patience, completely random employees get laid off but if you're liked you can fail upwards your whole career. The company needs to take a step back and really think about whether it's living the values it advertises.", "rating": 5, "pros": "This is a bigger organization than you'd think so something interesting is always happening. The brand is becoming more recognized and it's clear the business has a future. There are definitely some very talented employees here.", "cons": "Your career will be entirely manager/department dependent. Some of the teams have great culture, pay and promote well, and retain talent - others are just bleeding employees and are missing the signals why.", "advice": "Stop paying lip service and measure the effectiveness of employee-focused initiatives. This must be the only financial company with infinite manager patience, completely random employees get laid off but if you're liked you can fail upwards your whole career. The company needs to take a step back and really think about whether it's living the values it advertises."}, {"title": "Not for tech ppl", "text": "Pros Great benefits, great place to be if you're looking to be taken care of Cons Despite the marketing speak they tell you about how they're preparing for a digital age and that they're ensuring the digital future of wealth management, it's still a financial services company.", "rating": 5, "pros": "Great benefits, great place to be if you're looking to be taken care of", "cons": "Despite the marketing speak they tell you about how they're preparing for a digital age and that they're ensuring the digital future of wealth management, it's still a financial services company.", "advice": null}, {"title": "Assisstant", "text": "Pros Busy Season, Work with Professionals Cons Not much cons, long hours of work", "rating": 5, "pros": "Busy Season, Work with Professionals", "cons": "Not much cons, long hours of work", "advice": null}, {"title": "The good with the bad", "text": "Pros great brand, good products (at least some) Cons the people and the politics Advice to Management management is the primary problem", "rating": 3, "pros": "great brand, good products (at least some)", "cons": "the people and the politics", "advice": "management is the primary problem"}, {"title": "Recruiting Coordinator", "text": "Pros Great team, and positive work environment, Cons None I can think of.", "rating": 5, "pros": "Great team, and positive work environment,", "cons": "None I can think of.", "advice": null}, {"title": "Awesome", "text": "Pros Flexibility, culture of rising people up, pro internal mobility, cool offices, interesting and intelligent coworkers, talent focus Cons New York centric, competitive, salaries are low for the industry, must go through the analyst program Advice to Management Find a way to foster talent, create stretch opportunities and reward people in your operations teams, the good ones rarely stay.", "rating": 5, "pros": "Flexibility, culture of rising people up, pro internal mobility, cool offices, interesting and intelligent coworkers, talent focus", "cons": "New York centric, competitive, salaries are low for the industry, must go through the analyst program", "advice": "Find a way to foster talent, create stretch opportunities and reward people in your operations teams, the good ones rarely stay."}, {"title": "VP", "text": "Pros Working with very clever people. Cons Politics, cliques and need to fit a mold. Advice to Management Make sure to have more than the manager's retrieval of information as the way of evaluating employees.", "rating": 3, "pros": "Working with very clever people.", "cons": "Politics, cliques and need to fit a mold.", "advice": "Make sure to have more than the manager's retrieval of information as the way of evaluating employees."}, {"title": "HR Director", "text": "Pros Great reputation as a cutting edge company within financial services industry Cons Compensation model for engineering talent is lagging behind market", "rating": 3, "pros": "Great reputation as a cutting edge company within financial services industry", "cons": "Compensation model for engineering talent is lagging behind market", "advice": null}, {"title": "Vice President", "text": "Pros Working environment and commute were great. Cons Always on call even on vacation. Advice to Management Inclusion and diversity is not really happening!", "rating": 3, "pros": "Working environment and commute were great.", "cons": "Always on call even on vacation.", "advice": "Inclusion and diversity is not really happening!"}, {"title": "Supporting Intern to Trading Desk", "text": "Pros Awesome working environment for interns Cons No cons, awesome place to work.", "rating": 5, "pros": "Awesome working environment for interns", "cons": "No cons, awesome place to work.", "advice": null}, {"title": "Great experience", "text": "Pros Blackrock has improved Work flexibility over the years and is now making it a higher priority. Amazing work culture. Enjoy everyone I work with. Co-workers are like family to me Cons Blackrock technology runs things very lean. Things could dramatically improve if they hired more resources. Innovation would improve. Thety need to be more open to Brewer technologies such as AWS", "rating": 5, "pros": "Blackrock has improved Work flexibility over the years and is now making it a higher priority. Amazing work culture. Enjoy everyone I work with. Co-workers are like family to me", "cons": "Blackrock technology runs things very lean. Things could dramatically improve if they hired more resources. Innovation would improve. Thety need to be more open to Brewer technologies such as AWS", "advice": null}, {"title": "Marketing Project Manager", "text": "Pros Good benefits, work/life balance was good (SF), corporate giving, volunteer opportunities, 401K match, etc. Very smart, nice people. Cons Big company with too many layers of management, too many decisions made in NY vs SF.", "rating": 5, "pros": "Good benefits, work/life balance was good (SF), corporate giving, volunteer opportunities, 401K match, etc. Very smart, nice people.", "cons": "Big company with too many layers of management, too many decisions made in NY vs SF.", "advice": null}, {"title": "Director", "text": "Pros good work life balance and generally respectful organization for the industry. Generally well meaning senior leadership team, although it is of course predominately white men and it shows. Cons tons of projects that don't go anywhere. Difficult to assess how your work impacts the overall organization. Difficult to advance in San Francisco with very few leadership positions outside of NY.  A lot of internal politics and gossip. Advice to Management try to be more positive. Leadership communication is often reactive and heavy handed \"40% of you will not be working here next year\". Even if that's true, it is a very heavy environment to work in when that's the guidance coming from the top. People need more aspirational messaging to feel good about their day to day. Also, stop paying lip service to diversity. If you don't mean it, don't talk about it. It's exhausting.", "rating": 5, "pros": "good work life balance and generally respectful organization for the industry. Generally well meaning senior leadership team, although it is of course predominately white men and it shows.", "cons": "tons of projects that don't go anywhere.", "advice": "try to be more positive. Leadership communication is often reactive and heavy handed \"40% of you will not be working here next year\". Even if that's true, it is a very heavy environment to work in when that's the guidance coming from the top. People need more aspirational messaging to feel good about their day to day. Also, stop paying lip service to diversity. If you don't mean it, don't talk about it. It's exhausting."}, {"title": "Portfolio manager", "text": "Pros It is a great environment Cons It is a large company", "rating": 5, "pros": "It is a great environment", "cons": "It is a large company", "advice": null}, {"title": "internal", "text": "Pros great co workers, very smart people here Cons Consistent layoffs at end of year only to increase headcount to lower bonus pool Advice to Management make it feel like you care about your people from a home office perspective. We are clearly replaceable cattle", "rating": 3, "pros": "great co workers, very smart people here", "cons": "Consistent layoffs at end of year only to increase headcount to lower bonus pool", "advice": "make it feel like you care about your people from a home office perspective. We are clearly replaceable cattle"}, {"title": "NY", "text": "Pros Fair amount going on within the company meaning longer term stability. Strong position within the industry and should continue to grow. Cons Environment can be political. Advice to Management Work to build environment where people feel that future career growth is possible", "rating": 3, "pros": "Fair amount going on within the company meaning longer term stability. Strong position within the industry and should continue to grow.", "cons": "Environment can be political.", "advice": "Work to build environment where people feel that future career growth is possible"}, {"title": "Summer Analyst", "text": "Pros Great people, fast paced environment, great resources and compensation Cons I have no cons. Great company", "rating": 5, "pros": "Great people, fast paced environment, great resources and compensation", "cons": "I have no cons. Great company", "advice": null}, {"title": "analyst", "text": "Pros can be lazy, operate on autopiolit Cons no career mobility, tons of bureaucracy Advice to Management horrible/bureacratic", "rating": 3, "pros": "can be lazy, operate on autopiolit", "cons": "no career mobility, tons of bureaucracy", "advice": "horrible/bureacratic"}, {"title": "A year in review", "text": "Pros Smart and talented people / teams Cons Soul sucking hours and culture", "rating": 5, "pros": "Smart and talented people / teams", "cons": "Soul sucking hours and culture", "advice": null}, {"title": "Associate", "text": "Pros Small teamsize Less politics Results oriented Good technology stack Complex and challenging problems to work on. Cons Compensation isn't competitive with tech industry though they call themselves a tech firm Advice to Management Work life balance and Compensation should be given more thought", "rating": 5, "pros": "Small teamsize", "cons": "Compensation isn't competitive with tech industry though they call themselves a tech firm", "advice": "Work life balance and Compensation should be given more thought"}, {"title": "bad culture, even worse compensation", "text": "Pros flat hierarchy, full of young people Cons heavy work load and little exposure", "rating": 3, "pros": "flat hierarchy, full of young people", "cons": "heavy work load and little exposure", "advice": null}, {"title": "Good on paper", "text": "Pros Well established company; good on resume competitive benefits and perks Cons Overall it just wast a great fit for me. Long hours and no work life balance. expect to be on call 24/7, even while on vacation. Their \"Inclusion and diversity\" program is only for the front-end people who make money for the company. Work from home is not for everyone and definitely not for assistants. a lot of politics - if you don't 'click' with your manager/team right away, then you're pretty much on your own. the team i was in had a cliquish environment. - if you're looking for mentorship, this isn't the place for you. people are too busy to try to help or \"mentor\" you. - you only get feedback during your mid-year and year-end review, until then its all mind games (at least on the team i was in). they are very good at highlighting your mistakes", "rating": 1, "pros": "Well established company; good on resume", "cons": "Overall it just wast a great fit for me.", "advice": null}, {"title": "Summer Program at HK office", "text": "Pros great team, great people, great work environment Cons not so great food, not so great IT service", "rating": 5, "pros": "great team, great people, great work environment", "cons": "not so great food, not so great IT service", "advice": null}, {"title": "Great asset management form", "text": "Pros - Great place to work if you like finance Cons - Hierarchical and takes longer to go up the ladder", "rating": 3, "pros": "- Great place to work if you like finance", "cons": "- Hierarchical and takes longer to go up the ladder", "advice": null}, {"title": "Analyst", "text": "Pros Lots of smart people to learn from. Cons Very bureaucratic for lower level employees.", "rating": 3, "pros": "Lots of smart people to learn from.", "cons": "Very bureaucratic for lower level employees.", "advice": null}, {"title": "Cut your teeth and get out", "text": "Pros - commitment to excellence - employees want to do things the right way - a desire to innovate - a lot of smart minds make for cool ideas - a true fiduciary - not a vampire squid Cons The rudest, most aggressive employees you will ever come across in your professional life. While it's a growing company, managing an extreme amount of wealth, this comes at a horrible cost. I've never worked anywhere where people are so quick to throw another under the bus. Not a collegial environment.", "rating": 3, "pros": "- commitment to excellence - employees want to do things the right way", "cons": "The rudest, most aggressive employees you will ever come across in your professional life. While it's a growing company, managing an extreme amount of wealth, this comes at a horrible cost. I've never worked anywhere where people are so quick to throw another under the bus. Not a collegial environment.", "advice": null}, {"title": "Associate Software Developer", "text": "Pros Everyone is so knowledgeable Fast turnaround /deliverables Biggest asset manager Trying to catch up with tech firms on the tech stack Cons No cafeteria, medical room or gym (but there are gym discounts)", "rating": 5, "pros": "Everyone is so knowledgeable", "cons": "No cafeteria, medical room or gym (but there are gym discounts)", "advice": null}, {"title": "Managing Director", "text": "Pros The biggest Global Asset Manager Cons Very little opportunity for Company to grow, too big already, very political", "rating": 3, "pros": "The biggest Global Asset Manager", "cons": "Very little opportunity for Company to grow, too big already, very political", "advice": null}, {"title": "Old beurocratic", "text": "Pros There are no cons. This place sucks the passion out of you Cons Old technology, lousy management, long working hours, stressful environment. Advice to Management Please upgrade your thinking and ways to accomplish task. Don't brainwash", "rating": 1, "pros": "There are no cons. This place sucks the passion out of you", "cons": "Old technology, lousy management, long working hours, stressful environment.", "advice": "Please upgrade your thinking and ways to accomplish task. Don't brainwash"}, {"title": "The best", "text": "Pros The best company. Hands down. Cons Work your butt off or you're out.", "rating": 5, "pros": "The best company. Hands down.", "cons": "Work your butt off or you're out.", "advice": null}, {"title": "Great place", "text": "Pros - great people - very friendly culture within research - former bgi is world class quantitative investing across a wide range of strategy types and asset classes and funds Cons - bureaucracy can sometimes slow down development and implementation of strategies - pay is relatively low - not as true to the philosophy of quant investing as one might think Advice to Management go back to the old bgi culture and mentality", "rating": 5, "pros": "- great people", "cons": "- bureaucracy can sometimes slow down development and implementation of strategies", "advice": "go back to the old bgi culture and mentality"}, {"title": "Vice President", "text": "Pros Good work/life balance, okay resources, good reputation Cons Lots of restructurings all the time in many parts of the firm which makes for lots of distractions to employee productivity", "rating": 3, "pros": "Good work/life balance, okay resources, good reputation", "cons": "Lots of restructurings all the time in many parts of the firm which makes for lots of distractions to employee productivity", "advice": null}, {"title": "Vice President - Wilmington", "text": "Pros Industry leading technology, innovative solutions for multiple business lines, global presence, and hard working culture. Excellent benefits package. Cons None to make note of at this time.", "rating": 5, "pros": "Industry leading technology, innovative solutions for multiple business lines, global presence, and hard working culture. Excellent benefits package.", "cons": "None to make note of at this time.", "advice": null}, {"title": "BlackRock Seattle", "text": "Pros Great work environment, and excellent office culture. Big focus on happy people, happy clients, and innovation. Great benefits. Cons As you might expect with a company this size, there can be some red tape.", "rating": 5, "pros": "Great work environment, and excellent office culture. Big focus on happy people, happy clients, and innovation. Great benefits.", "cons": "As you might expect with a company this size, there can be some red tape.", "advice": null}, {"title": "Senior Java Developer", "text": "Pros Fantastic place to work. Great colleagues, Good salary Cons need visibility to go next level.", "rating": 5, "pros": "Fantastic place to work. Great colleagues, Good salary", "cons": "need visibility to go next level.", "advice": null}, {"title": "BlackRock", "text": "Pros Good place to work, good team Cons Not always the best at work life balance", "rating": 5, "pros": "Good place to work, good team", "cons": "Not always the best at work life balance", "advice": null}, {"title": "Fantastic place to start a career", "text": "Pros Benefits are great, upward mobility, fun atmosphere Cons can be long hours and need to be visible Advice to Management keep hiring good folks and paying them well!", "rating": 5, "pros": "Benefits are great, upward mobility, fun atmosphere", "cons": "can be long hours and need to be visible", "advice": "keep hiring good folks and paying them well!"}, {"title": "Good experience", "text": "Pros Strong brand, and product and geographic breadth, providing a wide-range of job opportunities. Strong environment for exposure and learning of investment basics and insight into macro / market information. Cons Organizational complexity and process focus creates inflexibility and friction that challenges producing results. This process focus leads to jobs that are often highly repetitive. Advice to Management Be true to stated values. Rebalance to value and support results as much as process; enhance ability to attract / retain best thinkers.", "rating": 3, "pros": "Strong brand, and product and geographic breadth, providing a wide-range of job opportunities. Strong environment for exposure and learning of investment basics and insight into macro / market information.", "cons": "Organizational complexity and process focus creates inflexibility and friction that challenges producing results. This process focus leads to jobs that are often highly repetitive.", "advice": "Be true to stated values. Rebalance to value and support results as much as process; enhance ability to attract / retain best thinkers."}, {"title": "Okay company. Not a pay master.", "text": "Pros Politics is everywhere and here as well Cons Not a pay master company. Advice to Management Depends on which function you are.", "rating": 5, "pros": "Politics is everywhere and here as well", "cons": "Not a pay master company.", "advice": "Depends on which function you are."}, {"title": "Vice President", "text": "Pros Big company that has a lot of opportunity for movement Cons The compensation is really inconsistent across titles.", "rating": 5, "pros": "Big company that has a lot of opportunity for movement", "cons": "The compensation is really inconsistent across titles.", "advice": null}, {"title": "Different than other Finance Institutions", "text": "Pros Inclusive, Team Building , Great Benefits and Pay A lot of focus and training in Quantitative research and excellent client service Cons None yet. I work on a great team so my experience may differ from others.", "rating": 5, "pros": "Inclusive, Team Building , Great Benefits and Pay", "cons": "None yet. I work on a great team so my experience may differ from others.", "advice": null}, {"title": "Political", "text": "Pros Some really brilliant people doing some amazing things. Cons Sometimes those brilliant things are overshadowed by politics and gossip Advice to Management Create more of a meritocracy.", "rating": 5, "pros": "Some really brilliant people doing some amazing things.", "cons": "Sometimes those brilliant things are overshadowed by politics and gossip", "advice": "Create more of a meritocracy."}, {"title": "Review", "text": "Pros Stable firm with breadth and scale Given responsibility quickly if have good manager Direct access to management Well positioned in market against competition. Cons Bureaucracy / continued turnover at the top Market / below market pay Slowly tick up over time Great to start or end your career Without a good manager growth will be tough Advice to Management Invest in junior and mid-level talent as they are doing majority of work", "rating": 3, "pros": "Stable firm with breadth and scale", "cons": "Bureaucracy / continued turnover at the top", "advice": "Invest in junior and mid-level talent as they are doing majority of work"}, {"title": "BlackRock", "text": "Pros Wonderful place to work with great hard working people Cons Complex organization - sometimes difficult to execute decisions.", "rating": 5, "pros": "Wonderful place to work with great hard working people", "cons": "Complex organization - sometimes difficult to execute decisions.", "advice": null}, {"title": "Associat", "text": "Pros Large company, great work life balance Cons Extremely political, too many selfish people", "rating": 5, "pros": "Large company, great work life balance", "cons": "Extremely political, too many selfish people", "advice": null}, {"title": "Great Firm", "text": "Pros Great strategy, many talented people Cons Efficiency is lost somewhat as it grows", "rating": 5, "pros": "Great strategy, many talented people", "cons": "Efficiency is lost somewhat as it grows", "advice": null}, {"title": "Director", "text": "Pros Amazing diverisfication of products protects the firm from certain asset classes falling in and our of favor. Cons The size of the firm can create headwinds when trying to prioritize smaller projects. Advice to Management Focus on the profit margins, as ETFs are killing the active business and the fees for ETFs only continue to fall as we battle with Vanguard.", "rating": 5, "pros": "Amazing diverisfication of products protects the firm from certain asset classes falling in and our of favor.", "cons": "The size of the firm can create headwinds when trying to prioritize smaller projects.", "advice": "Focus on the profit margins, as ETFs are killing the active business and the fees for ETFs only continue to fall as we battle with Vanguard."}, {"title": "Not for the faint of heart.", "text": "Pros Promotes innovation. Stays ahead of the curve from an industry perspective. Does a great job of offering training to improve soft skills. Cons Difficult political environment. Hard to make an impact. Not many good people managers. Middle management needs to focus on inspiring those they lead. Advice to Management Reduce the stigma of working in offices outside of NYC and SFO.", "rating": 3, "pros": "Promotes innovation. Stays ahead of the curve from an industry perspective. Does a great job of offering training to improve soft skills.", "cons": "Difficult political environment. Hard to make an impact. Not many good people managers. Middle management needs to focus on inspiring those they lead.", "advice": "Reduce the stigma of working in offices outside of NYC and SFO."}, {"title": "Specialist", "text": "Pros The company provides good health benefits, vacation, 401K. The company pays you when you are on jury duty. They have a good donation match program. Cons Management ladder is frustrating. They think they have decent technology but in fact it could use much more. They say they like to hire from within and via referrals but it is hard to transfer. Advice to Management Use more time to work with employees to establish clearer career paths.", "rating": 5, "pros": "The company provides good health benefits, vacation, 401K. The company pays you when you are on jury duty. They have a good donation match program.", "cons": "Management ladder is frustrating. They think they have decent technology but in fact it could use much more. They say they like to hire from within and via referrals but it is hard to transfer.", "advice": "Use more time to work with employees to establish clearer career paths."}, {"title": "Vice President", "text": "Pros Work hard and learn more Cons work life balance is difficult Advice to Management Be more friendly to new hired", "rating": 3, "pros": "Work hard and learn more", "cons": "work life balance is difficult", "advice": "Be more friendly to new hired"}, {"title": "Summer Intern", "text": "Pros Great group of individuals who share their experience and want to help you learn Cons I can not think of any cons", "rating": 5, "pros": "Great group of individuals who share their experience and want to help you learn", "cons": "I can not think of any cons", "advice": null}, {"title": "Wall St invades asset manangement", "text": "Pros growing business spells great exposure and opportunities. Cons sharp elbows are getting sharper....place has turned into a Wall St reincarnation.", "rating": 3, "pros": "growing business spells great exposure and opportunities.", "cons": "sharp elbows are getting sharper....place has turned into a Wall St reincarnation.", "advice": null}, {"title": "Managing Director", "text": "Pros Great career opportunities with professional and personal achivement. Strong culture. Cons Difficulty in creating work/life balance. Advice to Management Train managers to be better leaders and mentors.", "rating": 5, "pros": "Great career opportunities with professional and personal achivement. Strong culture.", "cons": "Difficulty in creating work/life balance.", "advice": "Train managers to be better leaders and mentors."}, {"title": "Associate", "text": "Pros High caliber teams and respected regardless your level. Small firm feeling and entrepreneur environment. Committed to social impact and growing responsibility. Cons Opportunity to improve benefits program and simplify internal operations. Firm has an amazing culture but would benefit from sprucing up the office ahead of the new headquarters being built in NYC. Sometimes political when trying to do what makes sense. Advice to Management the quality of training and guidance for junior level employees has deteriorated over the 10 years I spent at the company, largely a result of employees more concerned with the short term goal of succeeding in their own role and less concerned about the long term gain from fostering new talent.", "rating": 5, "pros": "High caliber teams and respected regardless your level. Small firm feeling and entrepreneur environment. Committed to social impact and growing responsibility.", "cons": "Opportunity to improve benefits program and simplify internal operations. Firm has an amazing culture but would benefit from sprucing up the office ahead of the new headquarters being built in NYC. Sometimes political when trying to do what makes sense.", "advice": "the quality of training and guidance for junior level employees has deteriorated over the 10 years I spent at the company, largely a result of employees more concerned with the short term goal of succeeding in their own role and less concerned about the long term gain from fostering new talent."}, {"title": "Good jumping spot", "text": "Pros Great work life balance here Cons very political and hard to move up ranks Advice to Management prevent your younger people from leaving otherwise its just very experienced people and junior ones", "rating": 3, "pros": "Great work life balance here", "cons": "very political and hard to move up ranks", "advice": "prevent your younger people from leaving otherwise its just very experienced people and junior ones"}, {"title": "Horrible Corporate Culture", "text": "Pros If in the right role (corporate strategy) there is a large breadth of departments and information to continuously learn. Cons Every other aspect of the workplace. Highly politicized (read kiss butt to get your bonus or advancement), management is incredibly denigrating, colleagues always trying to take credit for everything they touch.", "rating": 1, "pros": "If in the right role (corporate strategy) there is a large breadth of departments and information to continuously learn.", "cons": "Every other aspect of the workplace. Highly politicized (read kiss butt to get your bonus or advancement), management is incredibly denigrating, colleagues always trying to take credit for everything they touch.", "advice": null}, {"title": "Awesome", "text": "Pros People, benefits, salary, to name a few. I love working here! Cons I wish I could work from home more often as I have a crazy commute.", "rating": 5, "pros": "People, benefits, salary, to name a few. I love working here!", "cons": "I wish I could work from home more often as I have a crazy commute.", "advice": null}, {"title": "Not bad", "text": "Pros Learning about the business and benefits Cons Management doesn't promote talent and long hours Advice to Management Please promote talent", "rating": 5, "pros": "Learning about the business and benefits", "cons": "Management doesn't promote talent and long hours", "advice": "Please promote talent"}, {"title": "MD", "text": "Pros great firm, great talented people Cons not too much flexibility as one goes higher Advice to Management succession planning and more opportunities are critical for Dir, MD", "rating": 5, "pros": "great firm, great talented people", "cons": "not too much flexibility as one goes higher", "advice": "succession planning and more opportunities are critical for Dir, MD"}, {"title": "BLK review", "text": "Pros Leader in the industry Cons Intense work environment; Short term results oriented. Advice to Management Slow down to speed up", "rating": 5, "pros": "Leader in the industry", "cons": "Intense work environment; Short term results oriented.", "advice": "Slow down to speed up"}, {"title": "associate", "text": "Pros networking is a great here Cons hard to move around internally Advice to Management invest more in the employees", "rating": 5, "pros": "networking is a great here", "cons": "hard to move around internally", "advice": "invest more in the employees"}, {"title": "Not a performance culture, poor e comp, awful productivity tools", "text": "Pros I'm close with my teammates. Each team is allowed its own culture, which is a positive in my case. BlackRock is a well regarded brand which will make it easier to get a job. Cons - below mkt comp, 3rd quartile - not a performance culture, top performers aren't rewarded, recognized, or promoted appropriately. The most stark, and shocking, example of this is the lack of quotas in the sales org. Can you believe the sales force doesn't have quotas and isn't held accountable for not selling? - the company is constantly doing things to save costs, often at the expense of employee sanity and productivity. Examples include: cancelling software licenses yearly (adobe acrobat), forced black & white printing unless you make like 5 clicks to turn it off, lack of conf rooms, no longer offering bottled water in conference rooms, putting sensors underneath the desks in London to track the time employees spend at their desks Advice to Management - create a firm-wide culture - rewarded performance - give your salesforce quotes - focus on employee productivity, that's part of being a fiduciary for your clients", "rating": 1, "pros": "I'm close with my teammates.", "cons": "- below mkt comp, 3rd quartile", "advice": "- create a firm-wide culture"}, {"title": "Great culture", "text": "Pros Great culture for learning and career growth Cons hard to transfer internally to investments side", "rating": 5, "pros": "Great culture for learning and career growth", "cons": "hard to transfer internally to investments side", "advice": null}, {"title": "Great company", "text": "Pros Amazing Seattle office with great views and accommodations. Very friendly work environment in my experience. BRS is moving in a great positive direction Cons Management and the delegation of responsibility could use work in some areas. Communication from upper management could be more frequent", "rating": 5, "pros": "Amazing Seattle office with great views and accommodations. Very friendly work environment in my experience. BRS is moving in a great positive direction", "cons": "Management and the delegation of responsibility could use work in some areas. Communication from upper management could be more frequent", "advice": null}, {"title": "Great firm", "text": "Pros awesome firm, great reputation, fast paced culture Cons too much red tape, getting very large", "rating": 5, "pros": "awesome firm, great reputation, fast paced culture", "cons": "too much red tape, getting very large", "advice": null}, {"title": "Outstanding Leadership and Platform", "text": "Pros Exposure to the worlds largest investment platform, immense room for learning multiple products, leadership and vision is unmatched, tremendous investment in technology Cons People can get silo'd and functionalized in the name of scale and effeciency - creates for lack of excitement among some peers Advice to Management Continue to share the vision - focus on meritocracy", "rating": 5, "pros": "Exposure to the worlds largest investment platform, immense room for learning multiple products, leadership and vision is unmatched, tremendous investment in technology", "cons": "People can get silo'd and functionalized in the name of scale and effeciency - creates for lack of excitement among some peers", "advice": "Continue to share the vision - focus on meritocracy"}, {"title": "Best in Asset Management", "text": "Pros Cutting edge of asset management Cons Being cutting edge means long hours.", "rating": 5, "pros": "Cutting edge of asset management", "cons": "Being cutting edge means long hours.", "advice": null}, {"title": "Software Engineer", "text": "Pros A fun company to work for Cons Many knowledge are blackrock only", "rating": 5, "pros": "A fun company to work for", "cons": "Many knowledge are blackrock only", "advice": null}, {"title": "Great company with lots of room for advancement", "text": "Pros really smart and hardworking team, lots of room for advancement, great salaries Cons long hours; work/life balance could be improved", "rating": 5, "pros": "really smart and hardworking team, lots of room for advancement, great salaries", "cons": "long hours; work/life balance could be improved", "advice": null}, {"title": "Analyst", "text": "Pros Big name, can learn a lot if you are new Cons pay is not very competitive", "rating": 5, "pros": "Big name, can learn a lot if you are new", "cons": "pay is not very competitive", "advice": null}, {"title": "Associate", "text": "Pros Internal mobility Lots of different groups Cons Difficult to move up if you are not in New York", "rating": 5, "pros": "Internal mobility", "cons": "Difficult to move up if you are not in New York", "advice": null}, {"title": "Financial Analyst", "text": "Pros Innovators. Stable growth. Good reputation. Good people Cons Corporate structure problems that are common among most corporates Advice to Management Should open more opportunities to junior members", "rating": 5, "pros": "Innovators. Stable growth. Good reputation. Good people", "cons": "Corporate structure problems that are common among most corporates", "advice": "Should open more opportunities to junior members"}, {"title": "Director", "text": "Pros Culture People Scale Opportunity Location Cons Compensation Lean Culture Change Growth", "rating": 5, "pros": "Culture People Scale Opportunity Location", "cons": "Compensation Lean Culture Change Growth", "advice": null}, {"title": "Sales", "text": "Pros Good culture but flawed in long term Cons Kind of technologically slow- which is ironic", "rating": 3, "pros": "Good culture but flawed in long term", "cons": "Kind of technologically slow- which is ironic", "advice": null}, {"title": "Positive", "text": "Pros Culture, location and market leadership. Collegial work environment of experienced professionals with a clear mission as fiduciaries to our clients. Cons Facetime. In a changing world driven by technological advances a heavy overhang of spending 50+ hours per week in the office remains. Advice to Management Continue to emphasize a culture of One BlackRock and a culture of communication. Having a clear uniform mission is empowering and gives employees ownership in the firms success.", "rating": 5, "pros": "Culture, location and market leadership. Collegial work environment of experienced professionals with a clear mission as fiduciaries to our clients.", "cons": "Facetime. In a changing world driven by technological advances a heavy overhang of spending 50+ hours per week in the office remains.", "advice": "Continue to emphasize a culture of One BlackRock and a culture of communication. Having a clear uniform mission is empowering and gives employees ownership in the firms success."}, {"title": "Vice President", "text": "Pros Exposure to great minds in finance and technology. Cons You can drown in office politics and underneath incompetent managers. Advice to Management Create more opportunities for junior staff.", "rating": 5, "pros": "Exposure to great minds in finance and technology.", "cons": "You can drown in office politics and underneath incompetent managers.", "advice": "Create more opportunities for junior staff."}, {"title": "Very hardworking. Need to be very dedicated, take the initiative and ownership.", "text": "Pros Pays are relatively good. They are serious about technology and committed to technology. Even MAD level has good hands on coding skill. Cons Need to be very dedicated to your position. When taking ownerships for multiple fronts, your time management and multitasking skill become very important. Required very hardworking to survive.", "rating": 3, "pros": "Pays are relatively good. They are serious about technology and committed to technology. Even MAD level has good hands on coding skill.", "cons": "Need to be very dedicated to your position. When taking ownerships for multiple fronts, your time management and multitasking skill become very important. Required very hardworking to survive.", "advice": null}, {"title": "Associate", "text": "Pros Good Salary and Benefits. Technology is up to par. Cons Not ideal if you're not at HQ", "rating": 5, "pros": "Good Salary and Benefits. Technology is up to par.", "cons": "Not ideal if you're not at HQ", "advice": null}, {"title": "Very Smart Firm", "text": "Pros Very well organized, intelligent firm. Cons Lots of negative messaging near the big layoffs.", "rating": 5, "pros": "Very well organized, intelligent firm.", "cons": "Lots of negative messaging near the big layoffs.", "advice": null}, {"title": "Good place to work - with limitations", "text": "Pros Great employee culture Strong HR and leadership training programs Excellent benefits Data-driven - one source of truth and tightly coupled applications/systems Good remote access and work from home (some areas) Cons Siloed management Planning and decision making done by relationship NYC-centric power Immature planning and project management Depending on the department the work/life balance can be great - or suck big-time Advice to Management Formalize and make transparent decision-making and project and portfolio planning.", "rating": 5, "pros": "Great employee culture", "cons": "Siloed management", "advice": "Formalize and make transparent decision-making and project and portfolio planning."}, {"title": "GPAS Associate", "text": "Pros Recognized name all over the industry Cons Long work hours No vision Underpaid than the industry No appreciation Advice to Management Have a vision Communicate this vision with the employees Have employees contribute to the growth rather than use the top down approach", "rating": 3, "pros": "Recognized name all over the industry", "cons": "Long work hours", "advice": "Have a vision"}, {"title": "Business Analyst", "text": "Pros Stable company with lots of opportunities for growth. Great focus on using technology to create a market advantage and solve industry wide problems Cons You need to continuously market yourself, the yearly review process is mostly a formality. You need to work hard to get feedback and apply it. Advice to Management Provide more training opportunities and encourage certifications.", "rating": 5, "pros": "Stable company with lots of opportunities for growth. Great focus on using technology to create a market advantage and solve industry wide problems", "cons": "You need to continuously market yourself, the yearly review process is mostly a formality. You need to work hard to get feedback and apply it.", "advice": "Provide more training opportunities and encourage certifications."}, {"title": "Managing Director", "text": "Pros Industry leader, multiple business lines, meritocractic, innovation and techonology, global presence, hard working culture Cons Nothing significant to highlight at this time", "rating": 5, "pros": "Industry leader, multiple business lines, meritocractic, innovation and techonology, global presence, hard working culture", "cons": "Nothing significant to highlight at this time", "advice": null}, {"title": "Executive Assistant", "text": "Pros Good culture, was treated with respect as a trading assistant by work group executives and other portfolio managers. Cons Needed to be more diverse at the senior level and within HR.", "rating": 5, "pros": "Good culture, was treated with respect as a trading assistant by work group executives and other portfolio managers.", "cons": "Needed to be more diverse at the senior level and within HR.", "advice": null}, {"title": "Great Company to work for", "text": "Pros Innovative, tech oriented and 100% fiduciary to clients. Living and breathing its principles. Great benefits Cons No relevant cons to work at this Company", "rating": 5, "pros": "Innovative, tech oriented and 100% fiduciary to clients. Living and breathing its principles.", "cons": "No relevant cons to work at this Company", "advice": null}, {"title": "Upward Mobility", "text": "Pros Intelligent, hard-working colleagues, team-work focus, and star workers are rewarded and recognized. Cons Less access to company leadership as company grows.", "rating": 5, "pros": "Intelligent, hard-working colleagues, team-work focus, and star workers are rewarded and recognized.", "cons": "Less access to company leadership as company grows.", "advice": null}, {"title": "Culture is everything", "text": "Pros Company is team-oriented, innovative, collaborative which makes it a great place to work. Really cares about its clients as a fiduciary. Very flat organizational structure - people work together at all levels. Cons As the company is growing there are too many people involved in every decision.", "rating": 5, "pros": "Company is team-oriented, innovative, collaborative which makes it a great place to work. Really cares about its clients as a fiduciary. Very flat organizational structure - people work together at all levels.", "cons": "As the company is growing there are too many people involved in every decision.", "advice": null}, {"title": "So many opportunities available", "text": "Pros Room for growth, reward based on merit, extremely intelligent atmosphere, extensive opportunities for those who work hard Cons None that I can think of!", "rating": 5, "pros": "Room for growth, reward based on merit, extremely intelligent atmosphere, extensive opportunities for those who work hard", "cons": "None that I can think of!", "advice": null}, {"title": "Great company for resume, that's about it", "text": "Pros Strong brand name to have on your resume with a company that's been very successful in recent years. Cons Poor company culture, constant shuffling of employees and management and reorganizations that don't lead to any tangible benefits and perceived lack of direction. Advice to Management Focus on your employees more and build a culture that they actually want to be a part of.", "rating": 3, "pros": "Strong brand name to have on your resume with a company that's been very successful in recent years.", "cons": "Poor company culture, constant shuffling of employees and management and reorganizations that don't lead to any tangible benefits and perceived lack of direction.", "advice": "Focus on your employees more and build a culture that they actually want to be a part of."}, {"title": "Poor Work Life Balance", "text": "Pros Great benefits, highly intelligent colleagues Cons People struggle with work life balance and are mostly underpaid Advice to Management Promote the right people", "rating": 3, "pros": "Great benefits, highly intelligent colleagues", "cons": "People struggle with work life balance and are mostly underpaid", "advice": "Promote the right people"}, {"title": "More appearances than actually doing", "text": "Pros Brand name, compensation and benefits are decent if you stay for more than 3 years, internal mobility. Cons Work life balance in some groups, mixed reviews on management, HR does a lot of industry benchmarks to be just competitive enough but not exactly best in class, lack of diversity in the top ranks, innovation is subjective and seems to be reactionary to market forces than leading.", "rating": 3, "pros": "Brand name, compensation and benefits are decent if you stay for more than 3 years, internal mobility.", "cons": "Work life balance in some groups, mixed reviews on management, HR does a lot of industry benchmarks to be just competitive enough but not exactly best in class, lack of diversity in the top ranks, innovation is subjective and seems to be reactionary to market forces than leading.", "advice": null}, {"title": "Review", "text": "Pros Great people to work with Cons Slow to grow career, firm is too large", "rating": 5, "pros": "Great people to work with", "cons": "Slow to grow career, firm is too large", "advice": null}, {"title": "BlackRock environment", "text": "Pros Great people, great culture, name recognition Cons Work environment can be relentless", "rating": 5, "pros": "Great people, great culture, name recognition", "cons": "Work environment can be relentless", "advice": null}, {"title": "Sales Assoc", "text": "Pros High performing culture with competitive compensation Cons Multiple priorities that change quickly", "rating": 5, "pros": "High performing culture with competitive compensation", "cons": "Multiple priorities that change quickly", "advice": null}, {"title": "State of the art powerhouse, but needs some fine tuning", "text": "Pros Largest asset manager, attracts world class talent, growing businesses. Center of the buyside world and has relationships with all players and strong access to all markets. Great place to learn. Cons Very bureaucratic, large, hierarchical. Underinvested in young talent, too many marketing, strategy, sales, and operations positions. Middle level managers in these positions only slow things down. Advice to Management (1) invest heavily in advisory and consulting businesses to diversify revenue exposure (2) Get rid of obsolete / underperforming VPs and Directors in sales, strategy, operations, COO. (3) Balance the cannibalization of active products by divesting in underperforming businesses and attract talent to growth areas with higher pay", "rating": 5, "pros": "Largest asset manager, attracts world class talent, growing businesses. Center of the buyside world and has relationships with all players and strong access to all markets. Great place to learn.", "cons": "Very bureaucratic, large, hierarchical. Underinvested in young talent, too many marketing, strategy, sales, and operations positions. Middle level managers in these positions only slow things down.", "advice": "(1) invest heavily in advisory and consulting businesses to diversify revenue exposure (2) Get rid of obsolete / underperforming VPs and Directors in sales, strategy, operations, COO. (3) Balance the cannibalization of active products by divesting in underperforming businesses and attract talent to growth areas with higher pay"}, {"title": "Good First Job", "text": "Pros It was a good first job. There is good potential for growth if you're willing to put the time in. Cons Fairly boring daily routine, with a lot of repetitive work", "rating": 5, "pros": "It was a good first job. There is good potential for growth if you're willing to put the time in.", "cons": "Fairly boring daily routine, with a lot of repetitive work", "advice": null}, {"title": "Great Growth Opportunity", "text": "Pros Fantastic reputation in the industry, cutting edge, fast-paced, original founders still run the organization after almost 30 years. Meritocracy Cons Culture has changed a bit over time...more pressure, higher expectations, less work/life balance", "rating": 5, "pros": "Fantastic reputation in the industry, cutting edge, fast-paced, original founders still run the organization after almost 30 years. Meritocracy", "cons": "Culture has changed a bit over time...more pressure, higher expectations, less work/life balance", "advice": null}, {"title": "Specialist", "text": "Pros Great office environment with talented co-workers willing to help. Cons Boston is the smallest office within the company which limits options and room for growth", "rating": 5, "pros": "Great office environment with talented co-workers willing to help.", "cons": "Boston is the smallest office within the company which limits options and room for growth", "advice": null}, {"title": "Nice place", "text": "Pros Great work life balance Cons Most people are very friendly", "rating": 5, "pros": "Great work life balance", "cons": "Most people are very friendly", "advice": null}, {"title": "Poor work life balance", "text": "Pros Opportunities to focus on areas of interest and get involved in projects Cons Work life balance is lacking", "rating": 5, "pros": "Opportunities to focus on areas of interest and get involved in projects", "cons": "Work life balance is lacking", "advice": null}, {"title": "Director", "text": "Pros Great reputation, smart people, good benefits Cons There is a lot of changes in the company", "rating": 3, "pros": "Great reputation, smart people, good benefits", "cons": "There is a lot of changes in the company", "advice": null}, {"title": "Great benefits and pay", "text": "Pros It's team dependent but overall a great work environment to work in if you end up on a good team with good management. Cons Depending on the team, I have heard some rough stories about how people manage their teams.", "rating": 5, "pros": "It's team dependent but overall a great work environment to work in if you end up on a good team with good management.", "cons": "Depending on the team, I have heard some rough stories about how people manage their teams.", "advice": null}, {"title": "Too big and too political", "text": "Pros Name .... that's it. Cons Large organization with multiple layers of middle management who do not add much value. Rife with politics. Advice to Management Cut non performers", "rating": 3, "pros": "Name .... that's it.", "cons": "Large organization with multiple layers of middle management who do not add much value. Rife with politics.", "advice": "Cut non performers"}, {"title": "Analyst", "text": "Pros Hands on learning Challenged to solve tough problems Great bonus component Cons Long working hours Very tight deadlines", "rating": 5, "pros": "Hands on learning", "cons": "Long working hours", "advice": null}, {"title": "Non-revenue producer take", "text": "Pros Challenging work environment, fast pace, focused on revenue generation. Culture is driven to success and winning. Cons Non revenue generating staff constantly worried about jobs. Cut-throat managers thrive. Emphasis is always on pleasing management to stay on their good side even if management is wrong. Creates environment where no one speaks up or offers alternatives for fear of retaliation. Advice to Management Think about having \"skip 2 levels\" meetings or lunches. Encourage people to speak up without fear of retaliation. Don't tolerate retaliation.", "rating": 3, "pros": "Challenging work environment, fast pace, focused on revenue generation. Culture is driven to success and winning.", "cons": "Non revenue generating staff constantly worried about jobs. Cut-throat managers thrive. Emphasis is always on pleasing management to stay on their good side even if management is wrong. Creates environment where no one speaks up or offers alternatives for fear of retaliation.", "advice": "Think about having \"skip 2 levels\" meetings or lunches. Encourage people to speak up without fear of retaliation. Don't tolerate retaliation."}, {"title": "Associate", "text": "Pros Smart people, internal mobility is supported Cons Long working hours, tech teams have old technology Advice to Management Review directors more carefully", "rating": 5, "pros": "Smart people, internal mobility is supported", "cons": "Long working hours, tech teams have old technology", "advice": "Review directors more carefully"}, {"title": "Strong brand, weak company culture", "text": "Pros Strong name in asset management, opportunities for internal mobility, and good efforts made to improve work-life balance Cons No clear career path, marketing isn't a valued part of the organization", "rating": 3, "pros": "Strong name in asset management, opportunities for internal mobility, and good efforts made to improve work-life balance", "cons": "No clear career path, marketing isn't a valued part of the organization", "advice": null}, {"title": "Analyst", "text": "Pros -Smart People -No nonsense approach and results driven Cons -Bureaucratic -Siloed into projects that have little impact at analysts", "rating": 3, "pros": "-Smart People", "cons": "-Bureaucratic", "advice": null}, {"title": "Development Lead", "text": "Pros Opportunities to work on investment platforms for every asset class. Cons Most development teams have a steep learning curve before an individual can be fully productive.", "rating": 5, "pros": "Opportunities to work on investment platforms for every asset class.", "cons": "Most development teams have a steep learning curve before an individual can be fully productive.", "advice": null}, {"title": "Engineers: think carefully before you accept a role at this company!", "text": "Pros BlackRock attracts a lot of talent, particularly in the core business areas. The benefit package is decent, with some good perks (including major brand discounts). Some nice programs to match charitable giving. Cons The engineering culture is abysmal. You'll see and hear lots of handwaving about \"innovation\" and \"hackathons\", but this is merely lipstick on a pig. Talent is not valued and engineering compensation is far below industry standard. APG (Aladdin Product Group) desperately needs an external CTO with modern experience who can shape and implement major changes to methodologies, process and stack and quickly move the firm out of the technological dark ages. \u2028Managers in my area routinely glossed over quality issues and were dismissive of attempts to rectify, not only encouraging bad behavior from engineers but actively rewarding it. Testing has only in the last year received the attention it deserves, so there's little code coverage. Directors and MD's have little integrity (or skill, technical or otherwise). Technical leadership across the firm is conspicuously absent. The level of institutional arrogance is high, and few external hires have had success. The culture is very top-down. BlackRock has a habit of hiring experts and then telling them what to do. This culture, combined with individually-driven bonuses, lack of effective engineering structure or (any) process results in extreme siloing and lots of bad behavior. There's little product vision beyond implementing more features. There's a complete lack of proper estimation or teamwork. Resources are not allocated appropriately or in a dedicated fashion. \u2028\u2028 Consistent large turnover in engineering. The cycle of doom is alive and well: over promise, under deliver, deadlines missed, trust destroyed, and total demoralization. Rinse, wash, repeat. Think twice before you accept a role at this company. Advice to Management Look to other technology companies for guidance. The financial industry is a weak benchmark for possibility.", "rating": 1, "pros": "BlackRock attracts a lot of talent, particularly in the core business areas. The benefit package is decent, with some good perks (including major brand discounts). Some nice programs to match charitable giving.", "cons": "The engineering culture is abysmal. You'll see and hear lots of handwaving about \"innovation\" and \"hackathons\", but this is merely lipstick on a pig. Talent is not valued and engineering compensation is far below industry standard. APG (Aladdin Product Group) desperately needs an external CTO with modern experience who can shape and implement major changes to methodologies, process and stack and quickly move the firm out of the technological dark ages.", "advice": "Look to other technology companies for guidance. The financial industry is a weak benchmark for possibility."}, {"title": "Portfolio Compliance", "text": "Pros Good exposure to other teams, broad company/industry knowledge exposure, great people on the team. Cons People always struggle with work-life balance.", "rating": 5, "pros": "Good exposure to other teams, broad company/industry knowledge exposure, great people on the team.", "cons": "People always struggle with work-life balance.", "advice": null}, {"title": "associate", "text": "Pros nicer culture compared to other companies Cons low pay compared to competitors, long hours", "rating": 3, "pros": "nicer culture compared to other companies", "cons": "low pay compared to competitors, long hours", "advice": null}, {"title": "Associate", "text": "Pros Best asset manager in the world Cons Long hours and very demanding", "rating": 5, "pros": "Best asset manager in the world", "cons": "Long hours and very demanding", "advice": null}, {"title": "Great place to work", "text": "Pros The company really encourages team work, collaboration. It invites new ideas and wants you to challenge the status quo. You are encouraged to innovate and follow your ideas through. The Founding leaders continue to grow and foster the company culture, by staying close to all levels, company events, and philanthropic initiatives . You work with smart people, who care about what you do. Managers are invested in your success but also encourage you to find the right balance. Cons There are times where innovation can lead to getting things done now. In the end, you contribute to a great product, you learn something new -- but sometimes you might have to miss the gym", "rating": 5, "pros": "The company really encourages team work, collaboration. It invites new ideas and wants you to challenge the status quo. You are encouraged to innovate and follow your ideas through.", "cons": "There are times where innovation can lead to getting things done now. In the end, you contribute to a great product, you learn something new -- but sometimes you might have to miss the gym", "advice": null}, {"title": "Not a good company for engineers/technology professionals", "text": "Pros Financial company, good list of clients Cons I had a very bad experience working with BlackRock Inc.. I was a high-ranking student with 3.9 GPA from a premier Technology university in upstate New York with over 4 years of prior full-time software development experience in IT industry. I have several project star awards to my credit prior to working with this company. At BlackRock, I was hired as an Analyst with an inaccurate software engineer job description out of my university by my manager in Green Package Automation team - Portfolio Analytics Group only to realize that they could not find young graduates to fill in their requisitions and people who had left, and hence they did not disclose the truth! Yes, believe me they do manipulate job description and wages when hiring you. I was based out of Wilmington, Delaware and the work culture is a bad shape! Cheap, unqualified professionals, low wages, intensely bureaucratic software release process, work times being tracked, your computer screen is being stalked, your conversations are being stalked, etc. Little or no good mentors available since even they are fighting/competing with the company culture by leaking your performance and minor mistakes to your manager to gain credit for being watchful seniors. If you are a Software Engineer or Technology-related professional this company will not be a good move! The management has only bad apples left since the good ones have left. Managers have been promoted not by virtue of technology knowledge or innovation but since they stayed back when others left leaving no competition for them. You are assigned work on Angular, Angular UI, Node.js, jQuery, JavaScript but my manager did not have first-hand experience/competence on the same. Till date they keep writing and maintain Perl scripts and have recently started building web applications internally. Totally unstructured process of developing process, literally no unit-test cases written, or full-time tester testing your developed software but aiming for 'whatever you've done will work when released'! They do not understand or implement Agile software development methodology and use JIRA as a substitute assuming that by itself is Agile methodology. Absence of a process means believing in incorrect estimations of work and blaming that on your team members in year-end review. To correct the decade-old bad software left behind by employees who have left, rewriting and reinventing software is not possible since moving a brick will cause business to be disrupted and I've tried earnestly and my manager watched silently to blame me for my efforts. Problem-solving and design-thinking (the very core tenet of software engineering) is non-existent! Following such a practice for a year only makes you a bad engineer and develops an attitude of complacency and incompetence (with correct practices). Applying Organizational Behavior, I could notice employees working too many extra hours (both on weekdays and on weekends). Male employees with grey hair at the age of 25 and several others going bald at an age of 28-30 due to over-working, fighting frustration and bad mental health. I had noticed employees having an accident/surgery and showing up to work (on sometimes crutches) next day. Workload management and Empathy was missing! I had to hide my happiness and minor accomplishments from my own team and manager. Your year-end review will be frustrating and a big let down in your overall career because your will be evaluated against goals/job description you did not set! You only realize the bad experience in the job after being deep down in the bad shape and how bad an engineer you had become after you make a good move (i.e. find a good job) and become a good competitive engineer again, and earn a promotion with fair and spirited team culture and mentors. Rest you go figure. Advice to Management The company management (based out of NYC office) pays least attention to high attrition rate in the company. To start with the CTO has to step down along with several big names in management and hire a CTO from outside the company to correct the work culture, high attrition and bring organic innovation. That would be wishful thinking in my opinion!", "rating": 1, "pros": "Financial company, good list of clients", "cons": "I had a very bad experience working with BlackRock Inc.. I was a high-ranking student with 3.9 GPA from a premier Technology university in upstate New York with over 4 years of prior full-time software development experience in IT industry. I have several project star awards to my credit prior to working with this company. At BlackRock, I was hired as an Analyst with an inaccurate software engineer job description out of my university by my manager in Green Package Automation team - Portfolio Analytics Group only to realize that they could not find young graduates to fill in their requisitions and people who had left, and hence they did not disclose the truth! Yes, believe me they do manipulate job description and wages when hiring you.", "advice": "The company management (based out of NYC office) pays least attention to high attrition rate in the company."}, {"title": "Positive", "text": "Pros Excellent company to work for Cons Must be extremely dedicated with a get the job done attitude.", "rating": 5, "pros": "Excellent company to work for", "cons": "Must be extremely dedicated with a get the job done attitude.", "advice": null}, {"title": "Great colleagues, positions tend to get pigeon-holed.", "text": "Pros Great team, smart people, healthy collaborative work environment. Very good base technology Cons Not much room for career growth. If you do something well, you tend to get stuck in that position. This is a widely held observation - not just my opinion.", "rating": 3, "pros": "Great team, smart people, healthy collaborative work environment. Very good base technology", "cons": "Not much room for career growth. If you do something well, you tend to get stuck in that position. This is a widely held observation - not just my opinion.", "advice": null}, {"title": "Limited professional growth", "text": "Pros Great brand in asset management with very strong position in ETF's and risk management, global footprint Cons Limited possibility to move upwards particularly from director positions. They are currently more focused on creating opportunities for VP's Advice to Management Try to create more opportunities to the junior talent in the company to fight competition from other hot sectors like tech", "rating": 3, "pros": "Great brand in asset management with very strong position in ETF's and risk management, global footprint", "cons": "Limited possibility to move upwards particularly from director positions. They are currently more focused on creating opportunities for VP's", "advice": "Try to create more opportunities to the junior talent in the company to fight competition from other hot sectors like tech"}, {"title": "Software Engineer", "text": "Pros Great Benefits, job security, and you have the ability to work in other cities as it is a large company. Cons Long hours as it is a global company. Meetings have to be scheduled so all attendees from several countries can make it. This forces you to take 5am or 6pm meetings a couple times a week. Projects taken much longer to complete due to developers working across different countries. It also takes a lot longer to complete projects due to needing approval from the New York office technology department before proceeding with each step of development.", "rating": 3, "pros": "Great Benefits, job security, and you have the ability to work in other cities as it is a large company.", "cons": "Long hours as it is a global company. Meetings have to be scheduled so all attendees from several countries can make it. This forces you to take 5am or 6pm meetings a couple times a week. Projects taken much longer to complete due to developers working across different countries. It also takes a lot longer to complete projects due to needing approval from the New York office technology department before proceeding with each step of development.", "advice": null}, {"title": "Associate", "text": "Pros Good company with a great reputation in the industry Cons Ineffective middle managers who are not good leaders for the firm", "rating": 3, "pros": "Good company with a great reputation in the industry", "cons": "Ineffective middle managers who are not good leaders for the firm", "advice": null}]