[{"title": "Happy place to work", "text": "Pros The work life balance is the best by far anywhere I have worked. I get to work with a lot of smart people on interesting projects. Work doesn't feel like work here. Startup culture with free snacks, breakfast, beer and ping pong table. Cons Create a 401k match plan Advice to Management Keep up the good work. Listen to customers.", "rating": 5, "pros": "The work life balance is the best by far anywhere I have worked. I get to work with a lot of smart people on interesting projects. Work doesn't feel like work here. Startup culture with free snacks, breakfast, beer and ping pong table.", "cons": "Create a 401k match plan", "advice": "Keep up the good work. Listen to customers."}, {"title": "Great Place to Work", "text": "Pros I am given the freedom to be myself and to apply my personal strengths to get my job done. There is opportunity for advancement if you choose to work for it. Salary is competitive, but it can always be more. Booker is a growing company, but has maintained a family type work environment, we have great camaraderie. I enjoy working here! Cons I would like to see matching 401K", "rating": 5, "pros": "I am given the freedom to be myself and to apply my personal strengths to get my job done.", "cons": "I would like to see matching 401K", "advice": null}, {"title": "Great Place to work!", "text": "Pros I love working for Booker. You get plenty of PTO which is very helpful for myself. They are always providing food, breakfast every Tuesday, snacks galore (both healthy and not so healthy). The environment is a lot of fun to work in, it young and energetic. We do some activities outside of work, which are also fun to participate in. For the most part, the executive team is amazing and very supportive. I also fin that there are lots of opportunities to grow. Cons The office does seem a little clicky at times. Raises and bonuses happen, rarely and typically small. Not a fan of the health benefits. Product isn't responsive on some bigger issues and complaints from our customers. Advice to Management I would say get HR and IT in all offices. Also changing HR to more professional people. Get the executives to interact with all departments, not just the ones they work with. Be more transparent about the product plans and speak to the Customer Service Team and our customers on how to make the system better. Listen to the complaints and get product to stop using the By Design as an excuse.", "rating": 5, "pros": "I love working for Booker. You get plenty of PTO which is very helpful for myself. They are always providing food, breakfast every Tuesday, snacks galore (both healthy and not so healthy). The environment is a lot of fun to work in, it young and energetic. We do some activities outside of work, which are also fun to participate in. For the most part, the executive team is amazing and very supportive. I also fin that there are lots of opportunities to grow.", "cons": "The office does seem a little clicky at times. Raises and bonuses happen, rarely and typically small. Not a fan of the health benefits. Product isn't responsive on some bigger issues and complaints from our customers.", "advice": "I would say get HR and IT in all offices. Also changing HR to more professional people. Get the executives to interact with all departments, not just the ones they work with. Be more transparent about the product plans and speak to the Customer Service Team and our customers on how to make the system better. Listen to the complaints and get product to stop using the By Design as an excuse."}, {"title": "Customer Service", "text": "Pros Fun, fast paced, and the ability to play a large role in the company Cons There is no structure or hierarchy to the HR department, Personal goals and future goals of the company are a bit ambiguous. Advice to Management There needs to be different ways to incorporate skills of employees - HR needs to be overhauled, and promotions need to be dealt with properly.", "rating": 5, "pros": "Fun, fast paced, and the ability to play a large role in the company", "cons": "There is no structure or hierarchy to the HR department,", "advice": "There needs to be different ways to incorporate skills of employees - HR needs to be overhauled, and promotions need to be dealt with properly."}, {"title": "Open to Ideas", "text": "Pros Great company for self-starters and learners since there is little to/no red tape. If you bring forward an idea to leadership, Booker will let you run with it. There are always projects to hop in on since the different departments work well with one another. Benefits here are also above average for similarly sized businesses in AZ. Cons A/C is hit or miss in the summer months. Advice to Management Continue to utilize the Booker Core Values when making decisions about the business.", "rating": 5, "pros": "Great company for self-starters and learners since there is little to/no red tape. If you bring forward an idea to leadership, Booker will let you run with it. There are always projects to hop in on since the different departments work well with one another. Benefits here are also above average for similarly sized businesses in AZ.", "cons": "A/C is hit or miss in the summer months.", "advice": "Continue to utilize the Booker Core Values when making decisions about the business."}, {"title": "Difficult to Find a Better Startup in the Valley", "text": "Pros It is interesting to read through these reviews. It would appear that not all the reviewers are portraying a true booker experience. Working at Booker for years now, I can attribute much of my growth as a professional to the tutelage and guidance of company leaders and my peers here at Booker. We collaborate, we work together, and frankly we get stuff done. The passion for the Health, Wellness, and Beauty industry is remarkable and I can say that I have honestly never spoken to a client who I did not believe I could help become even more successful. The Scottsdale office is kind-of a leadership power house which I appreciate and is the growth hub for the company. You have good VP's from many different departments close by and always willing to discuss a project, idea, or innovation you may have. Tends to be a younger culture as a whole, that likes to have fun but also respects that people have families and lives, always trying to include everyone from all different walks in life. Pretty relaxed office environement, with your typical games (ping pong, ladder ball, basketball,) music, snacks etc... all those little extras that make waking up at 5:30 to beat the traffic worth it. They treat me well, respect my opinion, pay well for the Phoenix area, and offer great benefits so I have no complaints on all those fronts. Cons -No 401k match -Sometimes we get a little caught up in a goal or project and lose sight of the BIG picture of the value we provide for our clients. -Things move quickly here, which isn't for everyone. If you are expecting someone to lay out a 10 year business track plan for you, probably not the best. However if you are a trailblazer you will open more opportunities at Booker then you can probably imagine. Advice to Management -401k match if possible -Regular updates on all the amazing things we are doing for our customers - maybe highlighting a few client that are really crushing it and HOW Booker is leading to this success", "rating": 5, "pros": "It is interesting to read through these reviews.", "cons": "-No 401k match", "advice": "-401k match if possible"}, {"title": "I grew my career at Booker", "text": "Pros I've been working at Booker 7+ years and have had a wonderful experience here. I started in entry level support when the company was under 30 employees and worked my way up to the management level. Booker always encouraged me to grow and challenge myself by giving me new opportunities. They sent me to AMA's Management Training and have invested in my learning throughout the years (books, seminars, etc). I have worked in 3 different departments during my years and have seen ups and downs in the company but overall have had a very positive experience and the company is in a great place now. My current role is in the Customer Experience department and the leadership is top notch right now, by far the best I've experienced in my many years at Booker. I have never been happier, not only with the leadership on CE, but just being a part of an outstanding team of people who help each other and share the common goal of making our customers happy, which in turn will make our employees happy. I have learned so much throughout my years at Booker and have met some of my very best friends here, too. The culture is really engaging and fun. I always have a great time regardless of what Booker office I visit because there is an open and friendly vibe throughout the company. Cons I don't have any major cons, the company is in a good place. My only negative is no 401K matching. Advice to Management 401K matching would be nice.", "rating": 5, "pros": "I've been working at Booker 7+ years and have had a wonderful experience here. I started in entry level support when the company was under 30 employees and worked my way up to the management level. Booker always encouraged me to grow and challenge myself by giving me new opportunities. They sent me to AMA's Management Training and have invested in my learning throughout the years (books, seminars, etc). I have worked in 3 different departments during my years and have seen ups and downs in the company but overall have had a very positive experience and the company is in a great place now.", "cons": "I don't have any major cons, the company is in a good place. My only negative is no 401K matching.", "advice": "401K matching would be nice."}, {"title": "Sales", "text": "Pros Great place to gain sales experience Great co-workers Great direct managers Cons Company is pretty stagnant, not much leadership past the direct managers Change comp plans multiple times a year Lack of internal communication Advice to Management Instead of trying to build on top of the current software and adding as many new features as possible. Fix what already does not work properly. Don't try and tackle more projects than you can handle at once. Stick to the industry that Booker is built for.", "rating": 3, "pros": "Great place to gain sales experience", "cons": "Company is pretty stagnant, not much leadership past the direct managers", "advice": "Instead of trying to build on top of the current software and adding as many new features as possible. Fix what already does not work properly. Don't try and tackle more projects than you can handle at once. Stick to the industry that Booker is built for."}, {"title": "Not good at all", "text": "Pros A lot of happy talk. if free beer balances other shortcomings for you then this is the place for you Cons The product remains stuck in the mud and going nowhere. Sales is spinning and marketing is non-existent. Customer teams get hit with the mess. Advice to Management Plans are shared that never get done. Senior people with to-your-face niceness, but not much for results. The divisive cliques and back-stabbing on previous reviews are true IMO, at least in Scottsdale.", "rating": 1, "pros": "A lot of happy talk. if free beer balances other shortcomings for you then this is the place for you", "cons": "The product remains stuck in the mud and going nowhere. Sales is spinning and marketing is non-existent. Customer teams get hit with the mess.", "advice": "Plans are shared that never get done. Senior people with to-your-face niceness, but not much for results. The divisive cliques and back-stabbing on previous reviews are true IMO, at least in Scottsdale."}, {"title": "Started my career here", "text": "Pros Great culture and comradery Cons Hired a little too fast after my sales class. The second class mostly left or got fired Advice to Management Keep doing great, the company was young back then.", "rating": 5, "pros": "Great culture and comradery", "cons": "Hired a little too fast after my sales class. The second class mostly left or got fired", "advice": "Keep doing great, the company was young back then."}, {"title": "Room to grow and learn the needs of a SAAS", "text": "Pros I've been working at Booker for 3 years now and through out I've gotten to work with interesting people with whom I've also had the privilege to learn from. My role was originally one of technical support but as time went on, I was able to see how my role fit into the bigger picture, and become more engaged in figuring out how I can bring more value to my team. So Booker stuck with me and allowed me to improve. Cons Communication can be a little tough sometimes, but that's also a part of the job. If you can learn to proactively help people, and accept help from others, in times where what to do is a little fuzzy, it's appreciated.", "rating": 5, "pros": "I've been working at Booker for 3 years now and through out I've gotten to work with interesting people with whom I've also had the privilege to learn from. My role was originally one of technical support but as time went on, I was able to see how my role fit into the bigger picture, and become more engaged in figuring out how I can bring more value to my team. So Booker stuck with me and allowed me to improve.", "cons": "Communication can be a little tough sometimes, but that's also a part of the job. If you can learn to proactively help people, and accept help from others, in times where what to do is a little fuzzy, it's appreciated.", "advice": null}, {"title": "Values Driven Startup", "text": "Pros Great culture with caring colleagues. Dynamic and agile teams working on multiple fronts of the platform yet still highly aligned to the ultimate goal of creating a better platform for our end users. Some degree of autonomy as long as you are accomplishing the metrics your manger has set forth. Cons Booker is still a start up and is no exception from the list of adverse conditions that all startups are susceptible to. Advice to Management Never forget about our customers, the small business owners across the world who rely on us to relieve some of the heavy burdens that come from running a business. They trusted us with their business, we promised to never lose focus on their needs.", "rating": 5, "pros": "Great culture with caring colleagues. Dynamic and agile teams working on multiple fronts of the platform yet still highly aligned to the ultimate goal of creating a better platform for our end users. Some degree of autonomy as long as you are accomplishing the metrics your manger has set forth.", "cons": "Booker is still a start up and is no exception from the list of adverse conditions that all startups are susceptible to.", "advice": "Never forget about our customers, the small business owners across the world who rely on us to relieve some of the heavy burdens that come from running a business. They trusted us with their business, we promised to never lose focus on their needs."}, {"title": "Lots of Opportunity in a company that is always improving, with a promising future", "text": "Pros Compensation/Opportunities: I started at Booker a little under 3 years ago as a junior software engineer and within 3 years I was able to get 3 separate promotions, almost doubling my compensation and I am happy to say that I am now a technical lead on a team of other really strong and great software engineers of all disciplines. Suffice to say Booker has given me and many others tremendous opportunity to jump start our careers. The engineering manager values his employees greatly and will often go above and beyond to ensure his employees are happy. I cannot stress that enough. Work Life Balance: Working more then you should is strongly discouraged within the company, you will seldom find people working after hours. If there are people in the office after hours its usually just to listen to music and hang out over a beer because the people that work at Booker are all incredibly talented, intelligent and like minded folk. Booker also provides lots of fun activities for employees on a regular basis, like our annual summer Olympics or the monthly trivia as well as many parties and events throughout the year. The Gems at Booker are the people who work there, and even past employees cannot deny that, as you will often see them attend Booker events just to be around all the great people who work here. On top of that management is really understanding about working from home and PTO. PTO is virtually endless as long as you do what is expected, and for things like bereavement, people have been really understanding and given me as many days as I needed from a personal tragedy. Many of the engineering staff work from home 3-4 days a week and as long as their work is being completed this is OK. We are more project based then time based. On top of all of this, the HR department is really approachable and great to work with. They are constantly improving and always send out surveys to get insight from everyone. They provide breakfast in the morning, snacks throughout the day and host the many events we have at Booker. Management: The current management in Product & Technology is focused on empowering their teams/employees. We have moved away from the Top-Down management approach to a more Bottom-Up approach. We aren't held to some insurmountable and unattainable delivery date, but instead a delivery date that is more realistic and estimated by the individual teams. On top of this the technology department is invested heavily in moving the platform to the cloud. So the days of negotiating a time frame by compromises on the technology are over. We will take the time we need to ensure we do things the right way the first time, because this is overall better for the platform Day-To-Day: The actual work we have in the product and technology side is actually really cutting edge. As I stated above we are heavily invested into moving to the cloud but we have a lot of unique constraints that makes this very challenging. We are also making major strides in how we build independently releasable services and how these many services communicate with each other. On the server-side there is lots of work to do and its all cutting edge. On the client-side we have also heavily invested in the Ember.js framework and for good reason! Ember.js is designed for ambitious applications and we Booker is quite an ambitious project. On the day-to-day team side, we do have a 10 AM daily stand-up and follow Kanban-agile methodology for our processes. Final Word: When I first started at Booker we were in a transition phase and there were many ups and downs. We had some crummy managers in the past and we hit some rocky roads where some tough decisions needed to be made to keep the company going. This is part of any business, especially in the start-up world. That being said, through the many growing pains the company has gone through, 1 thing has been a constant, they have listened to their employees and made DRASTIC improvements. To name a few, they have hired some REALLY AMAZING middle management, they have renovated the main office 2 different times, they have better empowered their employees, and set up mechanisms for career growth and opportunity, and they have invested into technology to improve the platform. The result of all of this is a work environment that has drastically improved over the last 3 years. On top of all that the business has been pulling up some good numbers as of late and we are slated to become profitable fairly soon. This is all very good news and proves out all the hard work and changes the organization has made to be more streamlined and strategic in the improvements they've made to the organization. The truth is always in the numbers. Cons The biggest con I think that exists at Booker, but also exists at every organization is politics. This plays a part with every decision, whether it is good or bad, this is why it is so important to constructive and not destructive when bringing up topics. But This is all true at any organization. The other major con is they do not offer 401k matching, this is a major reason why i have not signed up for their in house 401k offering. Advice to Management Keep doing what your doing, the changes you have made have made tremendous improvements throughout the org. Get 401k matching!", "rating": 5, "pros": "Compensation/Opportunities:", "cons": "The biggest con I think that exists at Booker, but also exists at every organization is politics. This plays a part with every decision, whether it is good or bad, this is why it is so important to constructive and not destructive when bringing up topics. But This is all true at any organization.", "advice": "Keep doing what your doing, the changes you have made have made tremendous improvements throughout the org."}, {"title": "Nice to gain experience", "text": "Pros Fun, lively environment, supportive team, knowledgable developers, interesting varied projects. Cons Uncertain future with mulitple rounds of layoffs periodically Salaries not always on par with current job market Advice to Management Need more honesty and transparency with long term goals and product road map", "rating": 3, "pros": "Fun, lively environment, supportive team, knowledgable developers, interesting varied projects.", "cons": "Uncertain future with mulitple rounds of layoffs periodically", "advice": "Need more honesty and transparency with long term goals and product road map"}, {"title": "Great company and quickly growing", "text": "Pros The culture here is great. Everyone truly lives the core values that are spoken about on a daily basis and the teamwork here is incredible. Very solution oriented rather than fostering an environment to let issues persist and not be fixed. Cons While the company is growing there are not many leadership positions that open quickly, but the opportunity is there to work for. I wish everyone was in one office instead of spread out across a few different states but there is plenty of collaboration to make it feel connected.", "rating": 5, "pros": "The culture here is great. Everyone truly lives the core values that are spoken about on a daily basis and the teamwork here is incredible. Very solution oriented rather than fostering an environment to let issues persist and not be fixed.", "cons": "While the company is growing there are not many leadership positions that open quickly, but the opportunity is there to work for. I wish everyone was in one office instead of spread out across a few different states but there is plenty of collaboration to make it feel connected.", "advice": null}, {"title": "Good people", "text": "Pros Onboarding was thorough & welcoming, great people & culture, empowered in your role, room to explore new opportunities & think out of the box Cons Does not match 401K at all", "rating": 5, "pros": "Onboarding was thorough & welcoming, great people & culture, empowered in your role, room to explore new opportunities & think out of the box", "cons": "Does not match 401K at all", "advice": null}, {"title": "sales executive", "text": "Pros great culture when I was there... CEO was suoer down to earth. Cons its a very over saturated market to sell into.", "rating": 5, "pros": "great culture when I was there... CEO was suoer down to earth.", "cons": "its a very over saturated market to sell into.", "advice": null}, {"title": "Customer Service Specialist", "text": "Pros Great work environment and work-life balance Cons No direction from management, no opportunity to really grow professionally.", "rating": 3, "pros": "Great work environment and work-life balance", "cons": "No direction from management, no opportunity to really grow professionally.", "advice": null}, {"title": "Incredible company - great place to grow and learn", "text": "Pros Excellent culture, benefits, company as a whole. A lot of companies care either about their sales numbers or their employees. Booker cares a lot about both. The Exec Team is the best I've ever worked with and 100% feel they have the company and employees best interest in mind at all times. If you're looking for a company where Marketing and Sales actually get along and do whatever it takes to accomplish their goals, this is the place for you. Bonus: The brand new office in AZ is amazing. Cons The one benefit I would like Booker to add is a 401K matching program. Advice to Management Keep doing what you're doing. You've made some huge changes over the past two years and are moving in the correction direction.", "rating": 5, "pros": "Excellent culture, benefits, company as a whole. A lot of companies care either about their sales numbers or their employees. Booker cares a lot about both. The Exec Team is the best I've ever worked with and 100% feel they have the company and employees best interest in mind at all times.", "cons": "The one benefit I would like Booker to add is a 401K matching program.", "advice": "Keep doing what you're doing. You've made some huge changes over the past two years and are moving in the correction direction."}, {"title": "Supportive Management & Good opportunities for growth", "text": "Pros - start-up culture gives you more opportunities to grow and earn more responsibility - work hard/play hard environment - supportive managers that I feel truly care about my personal well being in addition to my work at booker. - freedom to get work done in whatever way works best for me; don't feel like I am being micromanaged - coworkers are awesome Cons - sometimes there is a lack of communication amongst departments and also between management and staff - disorganized/not super professional HR - we are told about product updates that are coming up, but nothing seems to actually get done when they say - the direction of the company often changes and it's hard to keep up - higher pay would be nice Advice to Management Put more effort into making sure your good employees are happy. I think it's easy to forget about checking in on things like that, but I do know some people who are thinking of looking elsewhere because they aren't getting enough attention or direction from managers.", "rating": 5, "pros": "- start-up culture gives you more opportunities to grow and earn more responsibility", "cons": "- sometimes there is a lack of communication amongst departments and also between management and staff", "advice": "Put more effort into making sure your good employees are happy. I think it's easy to forget about checking in on things like that, but I do know some people who are thinking of looking elsewhere because they aren't getting enough attention or direction from managers."}, {"title": "Production Support Analyst", "text": "Pros HR and my boss have taken an interest in my career and helping me grow down a good career path. I appreciate the time and work they have put in to show that I am a valued employee. Cons Nothing really bad to say. Got a lot of good things going for me here.", "rating": 5, "pros": "HR and my boss have taken an interest in my career and helping me grow down a good career path. I appreciate the time and work they have put in to show that I am a valued employee.", "cons": "Nothing really bad to say. Got a lot of good things going for me here.", "advice": null}, {"title": "Awful Leadership and Terrible Product", "text": "Pros The company spends a lot of money on drinking outings, food, trips and swag. They also overpay. Cons Where to start? Worst job I've had ever. The leadership was clueless. They need to clean house on execs. The product is dated. Turnover is high. It's like a revolving door. It was just a nightmare. Promotions or firings occurred whether you were in the in crowd or not. I still can't believe no one has sued them for wrongful termination. My biggest regret is not leaving sooner. They expected you to work nonstop without any care about work life balance. Biggest waste of my time. I resigned when I realized that it wouldn't get better anytime soon. Advice to Management Clean house on execs and stop putting money into partying & fix your product. Also stop hiring managers that act like Lindsey Lohan in Mean Girls.", "rating": 1, "pros": "The company spends a lot of money on drinking outings, food, trips and swag. They also overpay.", "cons": "Where to start? Worst job I've had ever. The leadership was clueless. They need to clean house on execs. The product is dated. Turnover is high. It's like a revolving door. It was just a nightmare. Promotions or firings occurred whether you were in the in crowd or not. I still can't believe no one has sued them for wrongful termination. My biggest regret is not leaving sooner. They expected you to work nonstop without any care about work life balance. Biggest waste of my time. I resigned when I realized that it wouldn't get better anytime soon.", "advice": "Clean house on execs and stop putting money into partying & fix your product. Also stop hiring managers that act like Lindsey Lohan in Mean Girls."}, {"title": "Determined Company at the Brink of Its Full and Awesome Potential", "text": "Pros - Many amazing, passionate, and intelligent coworkers - Tons of potential for growth in product capabilities - Entrepreneurial spirit of helping small businesses succeed - Dedicated executive leadership - Agile work environment Cons - Numerous shifts in company direction - Significant organizational changes and department restarts - Career opportunities and compensation could be more competitive Advice to Management Continue to embrace communication across all teams and departments. Transparency and the ability to seek critical insights from all levels ultimately strengthens culture and performance company-wide. Deeply cultivate and reward talent/merit! Really intrinsically define the core purpose of the product, the value to the businesses/humans you serve, your market advantages, your true weak points, the culture of Booker, and never lose sight of those parameters in everything Booker does.", "rating": 5, "pros": "- Many amazing, passionate, and intelligent coworkers", "cons": "- Numerous shifts in company direction", "advice": "Continue to embrace communication across all teams and departments. Transparency and the ability to seek critical insights from all levels ultimately strengthens culture and performance company-wide. Deeply cultivate and reward talent/merit! Really intrinsically define the core purpose of the product, the value to the businesses/humans you serve, your market advantages, your true weak points, the culture of Booker, and never lose sight of those parameters in everything Booker does."}, {"title": "Run. Run really really fast.", "text": "Pros There is beer on tap. They have holiday parties sometimes and the most of the people are good. I honestly have nothing else to write. Except run. Cons I am surprised this company lasted as long as they have. It's disorganized, very little communication and the product sucks. The atmosphere is like a never ending bad college party. Advice to Management Care about the people working under you.", "rating": 1, "pros": "There is beer on tap. They have holiday parties sometimes and the most of the people are good. I honestly have nothing else to write. Except run.", "cons": "I am surprised this company lasted as long as they have. It's disorganized, very little communication and the product sucks. The atmosphere is like a never ending bad college party.", "advice": "Care about the people working under you."}, {"title": "Low pay + high stress", "text": "Pros Some of the employees are really nice. Cons -clique-y environment -pay -communication between departments -VPs= some are a waste of money, are just difficult to deal with, and just make things harder for staff. - senior staff are under the thumbs of VPs, and just deliver orders to the employees. Just throw on more work instead of helping -free food is cool, but when its unhealthy, you just gain weight -HR can be disorganized -everything seems to be solved with alchohol -every dept has shrinked, except for sales, which keeps growing. Sales is the one dept that doesnt know how the system works, and makes life hard for everyone else. -Can't really think of a pro other than I made a couple of nice friends working there. But friends dont pay the bills, and lots of the employees are self important. Advice to Management -your employees that make less than $50,000 work really hard and deserve more money -pay your VPs and Senior staff less, and have them step up instead of barking orders.", "rating": 1, "pros": "Some of the employees are really nice.", "cons": "-clique-y environment", "advice": "-your employees that make less than $50,000 work really hard and deserve more money"}, {"title": "Depends on department/title", "text": "Pros Free food, end of month lunches, and Monday breakfast Cons Depending on what department and title you hold you will feel negatively or positively about the company. Presently they are outsourcing positions for entry level positions and adding additional responsibilities with no raises to current employees. Expectations are often unreaastlic and you are treated like a number. If you work in Sales or Marketing these new changes don't effect you. Support and Onboarding are treated poorly when they contribute the most and attempt to solve problems with limited resources. The product itself is outdated and they've created two versions that cause a ton of headaches and confusion for customers. Advice to Management Work on enhancing your product, offer better training, and listen to your hard workers", "rating": 1, "pros": "Free food, end of month lunches, and Monday breakfast", "cons": "Depending on what department and title you hold you will feel negatively or positively about the company. Presently they are outsourcing positions for entry level positions and adding additional responsibilities with no raises to current employees. Expectations are often unreaastlic and you are treated like a number. If you work in Sales or Marketing these new changes don't effect you. Support and Onboarding are treated poorly when they contribute the most and attempt to solve problems with limited resources. The product itself is outdated and they've created two versions that cause a ton of headaches and confusion for customers.", "advice": "Work on enhancing your product, offer better training, and listen to your hard workers"}, {"title": "If you can make it here you can make it anywhere, New York New York", "text": "Pros They feed you Booze everywhere College campus Cons NYC office shrunk 60 % ping pong table makes noise when your working No formal training program Advice to Management Try to retain good talent", "rating": 3, "pros": "They feed you", "cons": "NYC office shrunk 60 %", "advice": "Try to retain good talent"}, {"title": "Salary", "text": "Pros Great work environment and opportunities Cons Not an ideal demographic to sell into", "rating": 5, "pros": "Great work environment and opportunities", "cons": "Not an ideal demographic to sell into", "advice": null}, {"title": "Account Manager", "text": "Pros A great corporate and learning environment. Cons Not enough opportunities to move up with in.", "rating": 5, "pros": "A great corporate and learning environment.", "cons": "Not enough opportunities to move up with in.", "advice": null}, {"title": "Management could be better", "text": "Pros The people are the best part of the company Cons The company seemed not to care about it's employees. Wouldn't have minded if it didn't effect my day to day success", "rating": 3, "pros": "The people are the best part of the company", "cons": "The company seemed not to care about it's employees. Wouldn't have minded if it didn't effect my day to day success", "advice": null}, {"title": "Great place to learn and build a career", "text": "Pros Booker is a growth-stage company, which means there are plenty of opportunities to wear multiple hats and directly add value to the business. The company has some really exciting strategic initiatives ahead of it, and employees are encouraged to take on more responsibility for driving their success. The office culture is fun, my colleagues are a pleasure to work with, and management has a clear vision for the company's future. Cons As with any startup, some processes aren't always clearly defined. However, this presents an opportunity for employees to help determine the path forward. Advice to Management Keep communicating the company's goals and progress toward achieving them. Clarity and transparency on this front has been great for the team.", "rating": 5, "pros": "Booker is a growth-stage company, which means there are plenty of opportunities to wear multiple hats and directly add value to the business. The company has some really exciting strategic initiatives ahead of it, and employees are encouraged to take on more responsibility for driving their success. The office culture is fun, my colleagues are a pleasure to work with, and management has a clear vision for the company's future.", "cons": "As with any startup, some processes aren't always clearly defined. However, this presents an opportunity for employees to help determine the path forward.", "advice": "Keep communicating the company's goals and progress toward achieving them. Clarity and transparency on this front has been great for the team."}, {"title": "Work Hard Play Hard", "text": "Pros - Great benefits - My overall comp has increased year over year - Time off is awesome, and you're not frowned upon when you take it - Career growth is something that actually happens - Fast-paced environment - Ping Pong and Kegs are always a plus - Great culture - Talented professionals - Collaborative environment across different segments - Brand recognition - Flexibility and autonomy given to consult with your clients - Networking opportunities here are endless NYC Management View: MBWA) / Democratic Management Approach. Here is why…. Mike H is an invaluable asset to our team. He has a Democratic / Management by Walking Around (MBWA) approach. He aims to involve all member’s of the team in the decision making process. He is very familiar with the SMB sales process and sales cycle which in the end helps me to land more deals. I have witnessed first-hand many sales reps at Booker develop and hone their skills within a short period of time under Mikes direction. Mike engages with the team and encourages a competitive and healthy rivalry while helping us to embrace corporate and team culture. This helps to drive real metrics and results. This level of management is characteristic I have grown to truly appreciate Mike for. He also engages with other departments, embraces change and lends advice to those in need. Cons - Here at Booker it's easy to become attached to your work, leads & accounts, and it often trickles over into your personal life after hours, or on weekends. - Quota isn't necessarily the easiest to hit. But I guess if it were easy I suppose they would let anyone in. Advice to Management Keep up the good work. Continue to engage with strategic partners and solid investors. Please bring back Presidents Club, things like that will truly keep people here.", "rating": 5, "pros": "- Great benefits", "cons": "- Here at Booker it's easy to become attached to your work, leads & accounts, and it often trickles over into your personal life after hours, or on weekends.", "advice": "Keep up the good work. Continue to engage with strategic partners and solid investors. Please bring back Presidents Club, things like that will truly keep people here."}, {"title": "Account Executive", "text": "Pros - Management is supportive, extremely helpful and knowledgeable. - Great work/life balance. - Office culture is fun and laid back. - Strong communication and collaboration across all departments. - Fabulous product! Cons I can't think of any cons. The team in NYC has been so welcoming and it has been a very easy transition for me. I feel so lucky to work with the best people! Advice to Management Keep pushing that \"one team, one dream\" mentality. We've got a good thing working here!", "rating": 5, "pros": "- Management is supportive, extremely helpful and knowledgeable.", "cons": "I can't think of any cons. The team in NYC has been so welcoming and it has been a very easy transition for me. I feel so lucky to work with the best people!", "advice": "Keep pushing that \"one team, one dream\" mentality. We've got a good thing working here!"}, {"title": "Booker is the place to be!", "text": "Pros Currently been working in the New York City office for a little over three and half years. With any tech start up there are of course ups and downs in the sales department. I'm proud to say Booker Sales department shows a successful story where there are mostly ups and very few downs. To start, each rep has a ramping period gear to help each rep build a pipeline to reach and exceed their goals. During this ramping period, each rep has constant support and guidance from the management/leadership team. The support and guidance includes daily team meetings with the sales director and weekly one on one meetings with the sales director. The sales director is truly one of the best that is out there in any Saas company . Started out as an associate making 100s of calls a day to becoming one of the leaders making a company go public. He is a great mentor for the fact that he knows exactly what each rep is going through with having a goal over their heads and being judge on performance since he was walking in your shoes not that long ago in his career. It being a sales job you have a quota that you have to reach each month. At Booker though that quota is something that with hard work and a positive attitude can be achieved month in and month out. All in all if you are someone considering looking into Booker for a sales career you are looking into the right place. Great guidance/mentor, fun environment, and most importantly an opportunity to make good money while having fun at the same time. Cons If your late on Wednesdays you miss out on free bacon!", "rating": 5, "pros": "Currently been working in the New York City office for a little over three and half years. With any tech start up there are of course ups and downs in the sales department. I'm proud to say Booker Sales department shows a successful story where there are mostly ups and very few downs.", "cons": "If your late on Wednesdays you miss out on free bacon!", "advice": null}, {"title": "Come to Booker and Be Somebody!", "text": "Pros I've been at Booker for over 2+ years now and have loved it since Day 1! -Great work environment - everyone is relaxed and gets the job done. -Support and management is amazing and very transparent. -Product is easy to use and learn, which makes it very easy to sell. -A lot of room for growth within the company and you can really see the impact you make on your team and organization. Cons None I can think of. Advice to Management Keep updating and promoting the platform. We have a lot of talented people here and we can continue to expose this amazing product to the industry.", "rating": 5, "pros": "I've been at Booker for over 2+ years now and have loved it since Day 1!", "cons": "None I can think of.", "advice": "Keep updating and promoting the platform. We have a lot of talented people here and we can continue to expose this amazing product to the industry."}, {"title": "Room to grow, for both employees and the company.", "text": "Pros I started with Booker in an entry level customer support position a year and a half ago. Since then, I have received two vertical title changes and have found a position tailored to my individual skill set. Booker has the most respectable management I have ever worked with. I am proud to work hard at Booker and look forward to sharing ideas with supervisors. managers, and directors. Many people believe the pay to be on the lower end of the spectrum for the industry but I feel fairly compensated for my efforts. Cons I would like to start off by saying all of the reviews prior to mine that I read are true, the good and the very bad. No, there is no 401k matching at this time. However, the health/dental benefits are the best I have personally had at any job to date. Yes, there have been layoffs. I would estimate somewhere between 5 and 10 percent employee downsizing occurred in 2016. The company made some bad bets on expanding into markets that our product did not scale well for. This initiative has been abandoned for 2017 which shows me that senior management is aware and willing to adjust. Yes, there have been system issues, server stability primarily, that led to some very hard work days for the customer support staff. Booker has recently moved to a different third party server provider and those issues have been resolved since. The product itself is starting to appear dated and I'm sure that makes it hard to sell at times. I am not on the sales team but can identify with the negative reviews left by sales reps. The Booker Product Team has shown \"coming soon\" sneak peaks of redesigns in the works that I am hoping hit the market in 2017. Advice to Management Keep working hard. It's up to you to show those at the bottom that they are not fighting a losing battle. Continue sharing the senior leadership teams' ideas with the entire company. Josh's and Brian's emails do get read and have an impact. There is always the silent fear that doom is at the doorstep, especially here at the smallest, most remote office. I personally believe everyone in our office wants to succeed and see Booker succeed. Help us help you make that happen.", "rating": 5, "pros": "I started with Booker in an entry level customer support position a year and a half ago. Since then, I have received two vertical title changes and have found a position tailored to my individual skill set.", "cons": "I would like to start off by saying all of the reviews prior to mine that I read are true, the good and the very bad.", "advice": "Keep working hard. It's up to you to show those at the bottom that they are not fighting a losing battle. Continue sharing the senior leadership teams' ideas with the entire company. Josh's and Brian's emails do get read and have an impact."}, {"title": "Great place to work and grow", "text": "Pros The overwhelmingly positive atmosphere is contagious. It's a fun place to work. Management really cares about the staff. The opportunities to learn and expand your career potential are omnipresent. The ability to directly interact with senior management and the knowledge that they actually care about your input. When investor capital mandated the elimination of my role I was contacted by and supported by a host of people throughout the organization up to and including Josh McCarter, the CEO, prior to and after my departure. The severance and sense or personal caring make Booker a workplace I am glad to have called a home and would gladly return to. Cons Stepping stone mindset of the many young staffers leads to recurring transitions. Like many companies dependent upon venture capital, the investors impact the company's direction and financial decisions. Advice to Management Keep the open lines of communication even more open during times of transition. Most of the staff is young and needs to understand the big picture of decisions that impact business focus, salaries and staffing.", "rating": 5, "pros": "The overwhelmingly positive atmosphere is contagious.", "cons": "Stepping stone mindset of the many young staffers leads to recurring transitions.", "advice": "Keep the open lines of communication even more open during times of transition. Most of the staff is young and needs to understand the big picture of decisions that impact business focus, salaries and staffing."}, {"title": "Support", "text": "Pros Relatively low key environment with nice managers who are more like friends then bosses. Great efforts provided by HR to highlight community and social gatherings. Overall, it's a chill place to work Cons Dulled office culture, lack of competitive compensation, little growth opportunity, lack of social pulse Advice to Management Provide more empowerment", "rating": 3, "pros": "Relatively low key environment with nice managers who are more like friends then bosses. Great efforts provided by HR to highlight community and social gatherings. Overall, it's a chill place to work", "cons": "Dulled office culture, lack of competitive compensation, little growth opportunity, lack of social pulse", "advice": "Provide more empowerment"}, {"title": "Smiling faces and drunk leaders don't help me hit my quota", "text": "Pros Christmas party was another drunken debacle by leaders and it was, as always, pretty embarrassing. Drinking when winning = fun. Getting drunk when having a horrible year = dumb. Cons Product keeps promising progress, but have not seen anything since I joined. But they say happy things. Sales leaders smile a lot and think it is fun to just say happy things, but it is no fun when you can not hit your quota. No salesforce support to speak of. Advice to Management Quit. Total fail in 2016. Happy smiles and drinking do not help me hit quota and few salespeople do hit quota, short of favorites. New leaders have done exactly...what?", "rating": 1, "pros": "Christmas party was another drunken debacle by leaders and it was, as always, pretty embarrassing. Drinking when winning = fun. Getting drunk when having a horrible year = dumb.", "cons": "Product keeps promising progress, but have not seen anything since I joined. But they say happy things. Sales leaders smile a lot and think it is fun to just say happy things, but it is no fun when you can not hit your quota. No salesforce support to speak of.", "advice": "Quit. Total fail in 2016. Happy smiles and drinking do not help me hit quota and few salespeople do hit quota, short of favorites. New leaders have done exactly...what?"}, {"title": "The place to be!", "text": "Pros Great company to work for. HR is always setting up fun events, there's beer in the office, and some great people to work with, Mike Kendall's Trivia Thursdays are epic! Product does well in the market, and has a good name. Very strong leadership from the CEO. Great place to learn and grow in your career, lots of opportunity. I really enjoy working at Booker! Cons Wish we had better coffee in the office. Advice to Management Keep improving. We've done a lot in the last year to improve communication from the front lines to the product teams and exec's, don't lose that good communication.", "rating": 5, "pros": "Great company to work for. HR is always setting up fun events, there's beer in the office, and some great people to work with, Mike Kendall's Trivia Thursdays are epic! Product does well in the market, and has a good name. Very strong leadership from the CEO. Great place to learn and grow in your career, lots of opportunity. I really enjoy working at Booker!", "cons": "Wish we had better coffee in the office.", "advice": "Keep improving. We've done a lot in the last year to improve communication from the front lines to the product teams and exec's, don't lose that good communication."}, {"title": "Horrible!", "text": "Pros Lots of good people (used to) work there Cons Completely unprofitable business which the leadership has no clue how to turn around Advice to Management Fire most executives!", "rating": 1, "pros": "Lots of good people (used to) work there", "cons": "Completely unprofitable business which the leadership has no clue how to turn around", "advice": "Fire most executives!"}, {"title": "Fired (along with dozens more)", "text": "Pros Pretty slack work environment Free beer Cons Hired in with a signing bonus and laid off in less than a year, what more needs to be said? Advice to Management Get your act together and stop wasting money on beer and trivia and half-done office renovations and maybe you won't have to fire dozens of people right before the holidays to keep the company afloat.", "rating": 1, "pros": "Pretty slack work environment", "cons": "Hired in with a signing bonus and laid off in less than a year, what more needs to be said?", "advice": "Get your act together and stop wasting money on beer and trivia and half-done office renovations and maybe you won't have to fire dozens of people right before the holidays to keep the company afloat."}, {"title": "Good start up", "text": "Pros Good start up with reasonable expectations. The culture here is awesome and new changes are moving the company in the right direction. It is sales however the expectations are very reasonable and the company is very understanding that we aren't always going to have the best leads. This isn't like your normal start up where a number is held over your head and if you don't hit your gone. Sales can be stressful especially if you have one foot out the door, this is not the case here! Cons The comp plan could use some work but with recent changes I'm sure that is something being worked on too!!", "rating": 5, "pros": "Good start up with reasonable expectations. The culture here is awesome and new changes are moving the company in the right direction. It is sales however the expectations are very reasonable and the company is very understanding that we aren't always going to have the best leads. This isn't like your normal start up where a number is held over your head and if you don't hit your gone. Sales can be stressful especially if you have one foot out the door, this is not the case here!", "cons": "The comp plan could use some work but with recent changes I'm sure that is something being worked on too!!", "advice": null}, {"title": "I love working at Booker! They care about you being happy there. Free breakfast on Mondays and occasional free lunch!", "text": "Pros Very fun, lax work atmosphere. The leadership is growing quite quickly. Co workers are awesome and are happy to help if needed. We have monthly team builders, which are awesome. If you have a positive attitude, can sell well, and are coachable, you'll fit right in. Cons The leads can be iffy at times, but with any sales job you're going to have that. If you can get somebody talking, you'll be just fine. Advice to Management Maintain the positivity! It's great and spreads like wildfire!", "rating": 5, "pros": "Very fun, lax work atmosphere. The leadership is growing quite quickly. Co workers are awesome and are happy to help if needed. We have monthly team builders, which are awesome. If you have a positive attitude, can sell well, and are coachable, you'll fit right in.", "cons": "The leads can be iffy at times, but with any sales job you're going to have that. If you can get somebody talking, you'll be just fine.", "advice": "Maintain the positivity! It's great and spreads like wildfire!"}, {"title": "More layoffs, again", "text": "Pros Free beer, new kegs each week Good people, relaxed work environment Good work-life balance Cons Multiple rounds of layoffs every year for the last few years No 401k matching", "rating": 1, "pros": "Free beer, new kegs each week", "cons": "Multiple rounds of layoffs every year for the last few years", "advice": null}, {"title": "circling fast down the drain", "text": "Pros There are virtually no pros to working there. And the obvious shill reviews here are comical.I wonder tif that person still works for the company today after the big downsizing? And is overjoyed about some free beer. Cons Implosion. A big chunk of the company let go in the latest bloodbath. About 5% earlier this year. Others let go in between. Lots of fails across the company, mostly executives who are lost and make very bad calls. Advice to Management Advice to investors is to get new leadership. All new leadership. The team that has run things has let the company go to hell.", "rating": 1, "pros": "There are virtually no pros to working there. And the obvious shill reviews here are comical.I wonder tif that person still works for the company today after the big downsizing? And is overjoyed about some free beer.", "cons": "Implosion. A big chunk of the company let go in the latest bloodbath. About 5% earlier this year. Others let go in between. Lots of fails across the company, mostly executives who are lost and make very bad calls.", "advice": "Advice to investors is to get new leadership. All new leadership. The team that has run things has let the company go to hell."}, {"title": "Stay away", "text": "Pros good work atmosphere and tries to add fun to a normal work week Cons no 401k, they just laid off 30 people due to a down year out of the blue", "rating": 1, "pros": "good work atmosphere and tries to add fun to a normal work week", "cons": "no 401k, they just laid off 30 people due to a down year out of the blue", "advice": null}, {"title": "Sales", "text": "Pros There are not very many benefits to working here. Cons The company is barely scraping by and hiring and firing people in all departments to try and improve sales numbers. The truth is the product is sub-par to the competition (that is actually in the same building!). Goals are ridiculous, leads are terrible and leadership is clueless. So many better SaaS companies in the valley to work for!!!! Advice to Management Quit. This company is going to look for a new round of funding in 2017 and odds of that funding happening at a reasonable valuation are slim to none.", "rating": 1, "pros": "There are not very many benefits to working here.", "cons": "The company is barely scraping by and hiring and firing people in all departments to try and improve sales numbers. The truth is the product is sub-par to the competition (that is actually in the same building!). Goals are ridiculous, leads are terrible and leadership is clueless.", "advice": "Quit. This company is going to look for a new round of funding in 2017 and odds of that funding happening at a reasonable valuation are slim to none."}, {"title": "Major Improvement this year", "text": "Pros The people I get to work with are the biggest pro. The changes in Leadership over the last year has made a huge impact in the product development and in the culture. We recently moved onto 1 floor and it makes it so much easier to collaborate with people in other departments. I'm not the type to normally go out for drinks after work, but I make it a point to attend our events, mostly because they're fun and the people are great. Cons No matching 401k and we're located in the financial district. Advice to Management Keep doing what you're doing.", "rating": 5, "pros": "The people I get to work with are the biggest pro. The changes in Leadership over the last year has made a huge impact in the product development and in the culture. We recently moved onto 1 floor and it makes it so much easier to collaborate with people in other departments. I'm not the type to normally go out for drinks after work, but I make it a point to attend our events, mostly because they're fun and the people are great.", "cons": "No matching 401k and we're located in the financial district.", "advice": "Keep doing what you're doing."}, {"title": "Brutal to hit quota", "text": "Pros Office is pretty sweet. Other salespeople are fun. Free food sometimes. Monthly meetings are good. Cons Everything is all over the place. Marketing is shrinking and leads are too. New York is shrinking as headquarters. Advice to Management Get something new to sell. It is brutal to hit quotas. Big projects are not helping us sell. Not sure where the company is going.", "rating": 1, "pros": "Office is pretty sweet. Other salespeople are fun. Free food sometimes. Monthly meetings are good.", "cons": "Everything is all over the place. Marketing is shrinking and leads are too. New York is shrinking as headquarters.", "advice": "Get something new to sell. It is brutal to hit quotas. Big projects are not helping us sell. Not sure where the company is going."}, {"title": "I enjoyed working in Booker", "text": "Pros I really enjoyed working in Booker (had to leave because I got a job opportunity that I just couldn't miss). The atmosphere in the company is very positive, kind, fun & flexible. And that is very important. There is no unnecessary bureaucracy. The company offers (at least it was in 2014) the best health insurance that I've seen so far. It's a good place to get friends. Employees often go out together after work to share and celebrate good events in their and company's life. Cons I would say the code base is not of high quality.. I would recommend to the management to hire more high level developers who would teach less experienced developers and improve the overall code quality. Advice to Management . I would recommend to the management to hire more high level developers who would teach less experienced developers and improve the overall code quality.", "rating": 5, "pros": "I really enjoyed working in Booker (had to leave because I got a job opportunity that I just couldn't miss). The atmosphere in the company is very positive, kind, fun & flexible. And that is very important. There is no unnecessary bureaucracy. The company offers (at least it was in 2014) the best health insurance that I've seen so far. It's a good place to get friends. Employees often go out together after work to share and celebrate good events in their and company's life.", "cons": "I would say the code base is not of high quality.. I would recommend to the management to hire more high level developers who would teach less experienced developers and improve the overall code quality.", "advice": ". I would recommend to the management to hire more high level developers who would teach less experienced developers and improve the overall code quality."}, {"title": "Good, not great", "text": "Pros Nice people. Nice beers on Thursdays. Nice lunches sometimes. I heard summer cruises used to be fun. Two floors used to be fun, but down to one floor now. Cons Product is kinda stale and company has lost headcount over the last year. Customer service people have to try to hold it all together. sales has to try and sell it. Advice to Management Get focused. really. Hard to sell and serve customers when product does not get any real focus.", "rating": 3, "pros": "Nice people. Nice beers on Thursdays. Nice lunches sometimes. I heard summer cruises used to be fun. Two floors used to be fun, but down to one floor now.", "cons": "Product is kinda stale and company has lost headcount over the last year. Customer service people have to try to hold it all together. sales has to try and sell it.", "advice": "Get focused. really. Hard to sell and serve customers when product does not get any real focus."}, {"title": "Not a good to be in sales here", "text": "Pros nice office and location. drink a lot if that is what you are in to. Leaders try to be friendly. Cons Leaders try to be friendly but it is not a fun experience and lots of favoritism. Leaders friends make their quotas. outbound selling is painful, sales plan is sketchy. Pound it and ground it sales. Like I said, not fun though leaders try to smile it away. Advice to Management Get act together. if there is a plan I do not know what it is, nor did the people who sat around me,", "rating": 1, "pros": "nice office and location. drink a lot if that is what you are in to. Leaders try to be friendly.", "cons": "Leaders try to be friendly but it is not a fun experience and lots of favoritism. Leaders friends make their quotas. outbound selling is painful, sales plan is sketchy. Pound it and ground it sales. Like I said, not fun though leaders try to smile it away.", "advice": "Get act together. if there is a plan I do not know what it is, nor did the people who sat around me,"}, {"title": "I like it", "text": "Pros Comfortable work environment, with a good opportunity for a healthy work life balance. Cons Job security is not certain, and its difficult to understand where you place in the bigger picture.", "rating": 3, "pros": "Comfortable work environment, with a good opportunity for a healthy work life balance.", "cons": "Job security is not certain, and its difficult to understand where you place in the bigger picture.", "advice": null}, {"title": "I loved working at this company", "text": "Pros Very good company, great people to work with. Managers are excellent and very helpful. Lots of perks, people are friendly and understanding. I will forever be grateful to have been given an opportunity to work for such a great company with outstanding people. Cons Believe it or not, this job was not for me. I'm a n infrastructure engineer, not e-commerce (at least not just apps). Other than this, I loved working for this company but I had to move onto another company where I could use my skills. Advice to Management Management is very smart, they understand what needs to be done and they seem to have been doing it for years. The success in the company has been shown. Great place to work, but there wasn't a place for me.", "rating": 5, "pros": "Very good company, great people to work with. Managers are excellent and very helpful. Lots of perks, people are friendly and understanding. I will forever be grateful to have been given an opportunity to work for such a great company with outstanding people.", "cons": "Believe it or not, this job was not for me. I'm a n infrastructure engineer, not e-commerce (at least not just apps). Other than this, I loved working for this company but I had to move onto another company where I could use my skills.", "advice": "Management is very smart, they understand what needs to be done and they seem to have been doing it for years. The success in the company has been shown. Great place to work, but there wasn't a place for me."}, {"title": "Huge Positive Turn Around", "text": "Pros As an employee here for the last 3.5 years I have pretty much seen it all at Booker ( the good, the bad, and the ugly). Last year we went through some pretty rough times in terms of company morale but 2016 has made a HUGE turn around. I don't know what to pin the change on but It could be the new leadership in Product or the new HR leadership. Work life and culture has made an incredible turn for the better here at Booker. ( cough cough Julie Fanelli cough cough). Keep up the great work Cons Unfortunately, we still don't have any matching 401k and the fridges get very crowded and clustered. Advice to Management Keep up the good work team!", "rating": 5, "pros": "As an employee here for the last 3.5 years I have pretty much seen it all at Booker ( the good, the bad, and the ugly). Last year we went through some pretty rough times in terms of company morale but 2016 has made a HUGE turn around. I don't know what to pin the change on but It could be the new leadership in Product or the new HR leadership. Work life and culture has made an incredible turn for the better here at Booker. ( cough cough Julie Fanelli cough cough). Keep up the great work", "cons": "Unfortunately, we still don't have any matching 401k and the fridges get very crowded and clustered.", "advice": "Keep up the good work team!"}, {"title": "a glorified call center...", "text": "Pros Breakfast on Mondays, lots of alcohol and free events (games, happy hour) You get two monitors, and there's a basketball game in the office that's fun. Cons The equipment you're given is well below average. The mic on the headset picks up every sound in the room so it's hard to hear, the phones are clunky and old and everything is Dell. The place is a revolving door. You're given a demo to build with almost no training around product knowledge, but you'll get tons of condescending sales koolaid that doesn't overall help employees with sales since this is a physical product you're selling and not some kind of ROI. You can try to quantify a need (and you'll sound awkward) but overall whether a client decides to go with Booker or not is about preference and what the software can do, not how you sell them. Very high, rigid price points and aren't willing to negotiate with the clients, and they insist on charging a signup fee which no other competitor does. You will be given no support. Your hours are 7 to 4 but if you don't work 7 to 7 with a smile on your face your days are numbered. You waste time making 100 dials to businesses who have already been contacted over and over again and have no interest in switching to Booker. After a while it'll start to feel like you're cold calling to sell cars or cell phones since everyone already either has one or is never going to have one. As an inbound rep you'll be given leads that aren't actually inbounds just random forms filled out to read certain blog posts, but very few close or even remember filling out the form since it's not Booker they're interested in in the first place. The favoritism is rampant there so you will see the same four reps hitting quota month after month, but everyone else tends to miss by 40% or less. You can be successful anywhere else, and when you go for your in person interview they'll do a good job of presenting Booker as a company that is happy and a safe environment to work. In reality it is easily the most dysfunctional work environment I've ever experienced. Advice to Management Get your marketing together, stop lying, stop showing up hung over and depressed, and please stop talking to other managers in other offices about reps as word always gets around. All of you talk about each other too. Have some nerve and go directly to the rep and do not passive aggressively dance around what you're trying to say. Plainly give direction, like I'm doing here, and don't be so quick to throw out talent. Self examine. Boost morale from a place of integrity not because you're \"trying to make people happy\"", "rating": 1, "pros": "Breakfast on Mondays, lots of alcohol and free events (games, happy hour)", "cons": "The equipment you're given is well below average. The mic on the headset picks up every sound in the room so it's hard to hear, the phones are clunky and old and everything is Dell. The place is a revolving door.", "advice": "Get your marketing together, stop lying, stop showing up hung over and depressed, and please stop talking to other managers in other offices about reps as word always gets around. All of you talk about each other too. Have some nerve and go directly to the rep and do not passive aggressively dance around what you're trying to say. Plainly give direction, like I'm doing here, and don't be so quick to throw out talent. Self examine."}, {"title": "Going nowhere fast", "text": "Pros Free food, happy hour and execs like to get drunk with the favorite employees Cons Too many cooks in the kitchen, no one making changes that make sense. I just heard they had layoffs earlier this year. Advice to Management Get the systems issues fixed, for good, not just for a while. A lot of good people there but there are some real problems in the infrastructure.", "rating": 3, "pros": "Free food, happy hour and execs like to get drunk with the favorite employees", "cons": "Too many cooks in the kitchen, no one making changes that make sense. I just heard they had layoffs earlier this year.", "advice": "Get the systems issues fixed, for good, not just for a while. A lot of good people there but there are some real problems in the infrastructure."}, {"title": "Learn to manage your startup better, Booker.", "text": "Pros Booker was an easygoing atmosphere, very young, lively and lots of events to get to know others and get your voice heard. The work didn't typically require a brain, just some problem solving to communicate with a client or partner, which was nice. Good meetings, good food and that that cruise last year, oh man. Cons Laying off over 40+ employees in one day after showering many with Cinco De Drinko happy hours, professional photo ops and positive yearly reviews... this was very unexpected. I watched a manager who trained me get thrown on the street after four long years of great contribution to the company. Newer employees stayed.. which made no sense. Lack of communication between departments. Products are rolled out without warning causing an influx of negative client response. Sales team is inconsiderate of other teams, out for their earnings and literally told to not give a dang about other department's issues that they cause and promise to clients. I believe the two floors just combined into one, which is sad because this company doesn't know how to manage money or at least communicate when the chips are down. Advice to Management Learn to communicate better. Praise your employees for their good work.", "rating": 3, "pros": "Booker was an easygoing atmosphere, very young, lively and lots of events to get to know others and get your voice heard. The work didn't typically require a brain, just some problem solving to communicate with a client or partner, which was nice.", "cons": "Laying off over 40+ employees in one day after showering many with Cinco De Drinko happy hours, professional photo ops and positive yearly reviews... this was very unexpected. I watched a manager who trained me get thrown on the street after four long years of great contribution to the company. Newer employees stayed.. which made no sense.", "advice": "Learn to communicate better. Praise your employees for their good work."}, {"title": "Great company,", "text": "Pros I worked here for a few years. There's a great work-life balance here--people work hard, but are also laid back and fun. Upper management is great. They don't undermine or micromanage. Cons With most companies still in startup phase, the salaries are a bit on the low end. Also, if there was a glitch in the software, every department would sometimes have to assist with customer service calls--this was very rare, but sometimes happened. However, the pros at this place definitely outweigh any of the cons!", "rating": 5, "pros": "I worked here for a few years. There's a great work-life balance here--people work hard, but are also laid back and fun. Upper management is great. They don't undermine or micromanage.", "cons": "With most companies still in startup phase, the salaries are a bit on the low end. Also, if there was a glitch in the software, every department would sometimes have to assist with customer service calls--this was very rare, but sometimes happened. However, the pros at this place definitely outweigh any of the cons!", "advice": null}, {"title": "If you are coming out of college great, if not keep looking", "text": "Pros Occasional lunches and breakfast. Great employees to work with. Cons No 401K matching. Below average salaries. Minimal feedback on progress. No sense of value to company. No sense of short term job security. The product itself needs to be restructured. Advice to Management Define how each employee upholds the company. Define what would truly merit a promotion. Take employee and customer feedback to enhance the product.", "rating": 3, "pros": "Occasional lunches and breakfast.", "cons": "No 401K matching.", "advice": "Define how each employee upholds the company."}, {"title": "Implementation Specialist", "text": "Pros Comfortable,easy going work environment. Nice people Cons The product being sold could use some work. Not much communication between departments", "rating": 3, "pros": "Comfortable,easy going work environment. Nice people", "cons": "The product being sold could use some work. Not much communication between departments", "advice": null}, {"title": "Sales", "text": "Pros Build amazing relationships with coworkers Cons - Executive Team - Senior Leadership Team - Managers - HR - The Software ( aka Product Team)", "rating": 3, "pros": "Build amazing relationships with coworkers", "cons": "- Executive Team", "advice": null}, {"title": "Great Place to Start", "text": "Pros Fun environment. Great place to learn the ropes and learn sales strategy Cons Lack of career path. Can feel like favoritism exists Advice to Management figure out a career path that allows you to keep your best employees", "rating": 5, "pros": "Fun environment. Great place to learn the ropes and learn sales strategy", "cons": "Lack of career path. Can feel like favoritism exists", "advice": "figure out a career path that allows you to keep your best employees"}, {"title": "Booker AZ is Life Changing!", "text": "Pros - So much room for growth - Management is support & always helpful - The company has a lot of big things happening - Office culture and positivity is great - Good base, fair ramp & goals, and solid commission - Free breakfast Wednesdays - Love all of my coworkers and sales managers Cons None that I can think of sharing? Keep doing what you are doing! I really enjoy it here so far. Advice to Management Keep up the good work!!! We appreciate how hard you work to make us great!!!", "rating": 5, "pros": "- So much room for growth", "cons": "None that I can think of sharing? Keep doing what you are doing! I really enjoy it here so far.", "advice": "Keep up the good work!!! We appreciate how hard you work to make us great!!!"}, {"title": "Great Company!", "text": "Pros Fun work environment, they do a lot of activities in and out of the office. Growing company with room for advancement, It's a faced paced culture with only about 40 people in the office. Catered breakfast on Wednesdays, along with occasional lunches as well. Snacks! Cons With the fast paced environment people can seem like they are a bit overwhelmed or all over the place, but that is what start-ups are about.", "rating": 5, "pros": "Fun work environment, they do a lot of activities in and out of the office.", "cons": "With the fast paced environment people can seem like they are a bit overwhelmed or all over the place, but that is what start-ups are about.", "advice": null}, {"title": "Booker has been a great experience so far!", "text": "Pros Great company culture, good benefit options, fun environment and activities, both during work hours and after. Management really takes the time to communicate and listen to employees. CEO visits our office regularly and sits down with us to chat, answer questions etc. They treat us like adults and hold us accountable for or performance. Cons Sometimes communication from corporate in NY gets diluted or delayed. There is a lot of pressure in sales - but what sales organization doesn't have pressures. Air conditioner is loud Parking can be a pain Advice to Management No place is perfect, but Booker has a good thing going in AZ. I've never been to the CA or NY offices, but the people who have visited AZ from those offices have been great. Keep up the good wok!", "rating": 5, "pros": "Great company culture, good benefit options, fun environment and activities, both during work hours and after. Management really takes the time to communicate and listen to employees. CEO visits our office regularly and sits down with us to chat, answer questions etc. They treat us like adults and hold us accountable for or performance.", "cons": "Sometimes communication from corporate in NY gets diluted or delayed. There is a lot of pressure in sales - but what sales organization doesn't have pressures.", "advice": "No place is perfect, but Booker has a good thing going in AZ. I've never been to the CA or NY offices, but the people who have visited AZ from those offices have been great. Keep up the good wok!"}, {"title": "Account Executive", "text": "Pros I love working at booker. Great opportunities for advancement, great work life balance, and a fun work atmosphere. Cons Growing company so things are continually changing. Advice to Management Keep up the good work. I love working here.", "rating": 5, "pros": "I love working at booker. Great opportunities for advancement, great work life balance, and a fun work atmosphere.", "cons": "Growing company so things are continually changing.", "advice": "Keep up the good work. I love working here."}, {"title": "Account Executive", "text": "Pros Absolutely an excellent business to be with, such great amenities and growing in a really positive way due to continued support on every front of the business. The organization of things and the passion that I see from the people here will go a long way in continuing to make this place even better. Great people make great businesses! Cons With rapid growth there can be growing pains, but as long as you fail forward then it can't be a bad thing. Advice to Management The management here are great, they know when it's time to roll up their sleeves and put in a little extra work to make sure things get done the right way. Chances are if one of them doesn't have an answer they still know who to ask to get answers. Finding resourceful people is a tough thing to do and we definitely have a tough crew of managers to back us up every step of the way. Great job guys!", "rating": 5, "pros": "Absolutely an excellent business to be with, such great amenities and growing in a really positive way due to continued support on every front of the business. The organization of things and the passion that I see from the people here will go a long way in continuing to make this place even better. Great people make great businesses!", "cons": "With rapid growth there can be growing pains, but as long as you fail forward then it can't be a bad thing.", "advice": "The management here are great, they know when it's time to roll up their sleeves and put in a little extra work to make sure things get done the right way. Chances are if one of them doesn't have an answer they still know who to ask to get answers. Finding resourceful people is a tough thing to do and we definitely have a tough crew of managers to back us up every step of the way. Great job guys!"}, {"title": "Amazing SaaS Company to work for", "text": "Pros Great Product to promote Executive team & management teams Wednesday Breakfasts Team trivia Great partnerships Great Benefits Casual Dress Awesome people Work Life Balance Cons The tenants across the way mess the bathrooms. Advice to Management My advice to management would be a new coffee vendor. Maybe a Keurig? :)", "rating": 5, "pros": "Great Product to promote", "cons": "The tenants across the way mess the bathrooms.", "advice": "My advice to management would be a new coffee vendor."}, {"title": "Client Success Specialist", "text": "Pros Within the client success department in the NY location, everyone was great to work with. Everyone had their area of expertise and it was easy to ask other coworkers for help when in need. Very team oriented, we all liked each other had always got along! The higher ups would occasionally treat the office to some sort of special breakfast/lunch as a thank you, or monthly surprises like hiring massage therapists in the office once in a while! The job can be stressful! Cons The salary was way too little in my opinion for a tech start up company. The company ended up growing quickly, which was great however, more responsibility was given and barely an increase of pay. You would be reviewed on a frequent basis for each position that you were responsible for. Felt like I was being micromanaged..overworked and underpaid. Advice to Management If this is still the case, please understand, when you have to give someone a lot of \"different hats\" to wear and we're all needing to be reviewed for our performances, it doesn't mean that we're incompetent of that job if we don't rate well for that period. It's stressful, and incentive of a potential raise would be best to make the employee feel like they're doing a great job and that they're needed.", "rating": 3, "pros": "Within the client success department in the NY location, everyone was great to work with. Everyone had their area of expertise and it was easy to ask other coworkers for help when in need. Very team oriented, we all liked each other had always got along!", "cons": "The salary was way too little in my opinion for a tech start up company. The company ended up growing quickly, which was great however, more responsibility was given and barely an increase of pay. You would be reviewed on a frequent basis for each position that you were responsible for. Felt like I was being micromanaged..overworked and underpaid.", "advice": "If this is still the case, please understand, when you have to give someone a lot of \"different hats\" to wear and we're all needing to be reviewed for our performances, it doesn't mean that we're incompetent of that job if we don't rate well for that period. It's stressful, and incentive of a potential raise would be best to make the employee feel like they're doing a great job and that they're needed."}, {"title": "Customer Success Specialist", "text": "Pros Booker is an awesome company to work for. We continue to grow and build upon our product. I love the work/life balance they offer us with a very generous pto policy/ My management team I report to is so wonderful and always wanting to help to help us grow as a person in our personal life and career life Cons I have no cons! I love my company.", "rating": 5, "pros": "Booker is an awesome company to work for. We continue to grow and build upon our product. I love the work/life balance they offer us with a very generous pto policy/ My management team I report to is so wonderful and always wanting to help to help us grow as a person in our personal life and career life", "cons": "I have no cons! I love my company.", "advice": null}, {"title": "Outbound Account Executive", "text": "Pros the job is easy if you have experience in outbound sales Cons Management in the Scottsdale office is a complete joke. The insurance benefits are pretty pricey. consistent inconsistency within the office. Surrounded by young kids with very little to no experience. Loud music all day. Very small work areas, it's a small desk not a cubicle. Very high turnover in the short period I was there. Advice to Management You need to give your \"managers\" (and I use that term loosely) some actual management training prior to giving them the title. They should be able to effectively communicate to their employees, discipline accordingly across the board and attend the very meetings that they schedule. It's a real joke in that office.", "rating": 1, "pros": "the job is easy if you have experience in outbound sales", "cons": "Management in the Scottsdale office is a complete joke. The insurance benefits are pretty pricey. consistent inconsistency within the office. Surrounded by young kids with very little to no experience. Loud music all day. Very small work areas, it's a small desk not a cubicle. Very high turnover in the short period I was there.", "advice": "You need to give your \"managers\" (and I use that term loosely) some actual management training prior to giving them the title. They should be able to effectively communicate to their employees, discipline accordingly across the board and attend the very meetings that they schedule. It's a real joke in that office."}, {"title": "Booker", "text": "Pros Fast growth, lots of opportunity to earn up to higher positions or to other departments. Cons Lots to do, not always enough resources to move as quickly as you'd like.", "rating": 3, "pros": "Fast growth, lots of opportunity to earn up to higher positions or to other departments.", "cons": "Lots to do, not always enough resources to move as quickly as you'd like.", "advice": null}, {"title": "Good for cutting teeth in the start-up scene... nothing else", "text": "Pros Will hire basically anyone with a pulse. This is a great place to break into the start-up scene. Some people are nice. Casual dress-code. Flexible hours if you work for the right manager. Cons The pay is awful. You can get paid double in virtually any position at another start-up. The product is horrendous. Constantly broken. Tech debt is crippling and no one is interested in fixing it. The product team is filled with self-important jerks (even more than normal product teams) who have no interest in actually improving the experience for the customer. The tech talent is pathetic- there are virtually no talented programmers on the team. It's a cliquey frat-house type of environment. There is obvious favoritism on the part of certain managers. There are almost none of the \"start-up perks\" left. Did I mention that the product is awful? Quarterly releases should come with a xanax for every person at the company. Advice to Management There's nothing to say. This place is circling the drain.", "rating": 1, "pros": "Will hire basically anyone with a pulse. This is a great place to break into the start-up scene.", "cons": "The pay is awful. You can get paid double in virtually any position at another start-up.", "advice": "There's nothing to say. This place is circling the drain."}, {"title": "Not terrible but not amazing either", "text": "Pros Worked with some awesome highly skilled technology experts. Interesting platform using MongoDB, NewRelic, Redis Company uses a wide selection of programming languages: C#, .Net, Javascript, some Ruby Good resume builder for Juniors, not so great for Senior staff. Cons The pay was terrible Difficult to advance (horizontal moves with new titles and no pay increase do not count) Everyone keeps quitting. Company is in denial about their progress. Advice to Management Give your employees adequate training, regular reviews and really listen to them.", "rating": 3, "pros": "Worked with some awesome highly skilled technology experts.", "cons": "The pay was terrible", "advice": "Give your employees adequate training, regular reviews and really listen to them."}, {"title": "Best place to work this side of the Mississippi!", "text": "Pros Great atmosphere, great people, enjoyable area, time spent with Executives from the top to the bottom Booker is a family where hard work pays off. Luckily every Sunday I think about how great my Monday will be!!! Cons Wish they came to Scottsdale sooner! Advice to Management Keep up the Outstanding work!", "rating": 5, "pros": "Great atmosphere, great people, enjoyable area, time spent with Executives from the top to the bottom Booker is a family where hard work pays off. Luckily every Sunday I think about how great my Monday will be!!!", "cons": "Wish they came to Scottsdale sooner!", "advice": "Keep up the Outstanding work!"}, {"title": "Best Place to work in Arizona! Life Changing Experience!", "text": "Pros Great leadership, Independence, Great environment to work, Great work/life balance, Down to earth approachable executives. Cons I actually havent found one. Advice to Management Keep up the Great work!", "rating": 5, "pros": "Great leadership, Independence, Great environment to work, Great work/life balance, Down to earth approachable executives.", "cons": "I actually havent found one.", "advice": "Keep up the Great work!"}, {"title": "Rather work in Retail or McDonalds", "text": "Pros The benefits are great. Company events are worth it sometimes. The people I work with make the place bearable. Cons There are managers who exhibit favoritism toward others. Feedback is unwarranted and unsupported. Job requirement does not fit pay structure. Sometimes management does not know what is happening and can not give us a direct answer. Advice to Management Treat all employees the same. Give more room for advancement.", "rating": 3, "pros": "The benefits are great. Company events are worth it sometimes. The people I work with make the place bearable.", "cons": "There are managers who exhibit favoritism toward others. Feedback is unwarranted and unsupported. Job requirement does not fit pay structure. Sometimes management does not know what is happening and can not give us a direct answer.", "advice": "Treat all employees the same. Give more room for advancement."}, {"title": "Repetitive work - no growth!", "text": "Pros Great for fresh out of college - very young, fun (immature) moments. It's like freshman year all over again... \"Booker College\" - just fun! Cons No growth but a bunch a new title changes. No more Summer Friday's. Very, very pointless for the 9 hrs a day (40 hrs a week - 35 hrs a week would be fine). Don't see them surviving another 7 years w/o secretly selling to another company but keeping their name. Salaries are about at least 25% below average. If you're looking for a career this is NOT the place! Two year MAX and then RUN out of this place! Advice to Management Help your employees to grow! Even if they do not grow with company - at least help them to grow with their career - show them the ropes!", "rating": 3, "pros": "Great for fresh out of college - very young, fun (immature) moments. It's like freshman year all over again... \"Booker College\" - just fun!", "cons": "No growth but a bunch a new title changes. No more Summer Friday's. Very, very pointless for the 9 hrs a day (40 hrs a week - 35 hrs a week would be fine). Don't see them surviving another 7 years w/o secretly selling to another company but keeping their name. Salaries are about at least 25% below average. If you're looking for a career this is NOT the place! Two year MAX and then RUN out of this place!", "advice": "Help your employees to grow! Even if they do not grow with company - at least help them to grow with their career - show them the ropes!"}, {"title": "Booker Appreciates and Listens to their employees", "text": "Pros Working for Booker was by far the best decision I have ever made in my career. I wouldn't refer Booker to someone who just wants a job, this is definitely much more than that. A place where anyone from any background can come and flourish. Everyone works as a team, no matter what department you're in. And the senior management is completely transparent with all the employees so no one ever feels left out as to what new changes are in the works. This is the first company that I've worked for that actually cares about and considers my ideas and suggestions regarding growth and improvement. As a young woman who doesn't have a college degree, this is kind of a dream come true. Wanting to be listened to and taken seriously in business development has been nothing but daydreams until now. They have a great work/life balance. Management supports their employees in other hobbies outside of work. They are constantly promoting from within and are very open to allowing their employees test out other skill sets in other departments. We have three offices, 1 in NYC, 1 in Scottsdale, and 1 in Orange County and we all communicate with each other on a daily basis so the entire company throughout the nation is pretty close. Also, they allow travel between the 3 offices which is awesome! The last thing is that the culture is GREAT! We're constantly evolved in extra activities in and outside of work Cons I can't really think of any Cons.... I would say the only thing to keep in mind is that this is still a young company so there are many changes taking place rather frequently, but it's great because that means there's always room for individual growth! Advice to Management Keep doing exactly what you're doing!!", "rating": 5, "pros": "Working for Booker was by far the best decision I have ever made in my career. I wouldn't refer Booker to someone who just wants a job, this is definitely much more than that. A place where anyone from any background can come and flourish. Everyone works as a team, no matter what department you're in. And the senior management is completely transparent with all the employees so no one ever feels left out as to what new changes are in the works. This is the first company that I've worked for that actually cares about and considers my ideas and suggestions regarding growth and improvement. As a young woman who doesn't have a college degree, this is kind of a dream come true. Wanting to be listened to and taken seriously in business development has been nothing but daydreams until now. They have a great work/life balance. Management supports their employees in other hobbies outside of work. They are constantly promoting from within and are very open to allowing their employees test out other skill sets in other departments. We have three offices, 1 in NYC, 1 in Scottsdale, and 1 in Orange County and we all communicate with each other on a daily basis so the entire company throughout the nation is pretty close. Also, they allow travel between the 3 offices which is awesome! The last thing is that the culture is GREAT! We're constantly evolved in extra activities in and outside of work", "cons": "I can't really think of any Cons.... I would say the only thing to keep in mind is that this is still a young company so there are many changes taking place rather frequently, but it's great because that means there's always room for individual growth!", "advice": "Keep doing exactly what you're doing!!"}, {"title": "All smiles, but rotting on the inside", "text": "Pros It is a good place to harness your career and gain experience, especially since you'll be dealing with crazy client escalations. Also, a ton of people quit, so you'll find yourself with more responsibility than initially thought. Cons They have started to shift their operations to AZ and Pennsylvania, so maybe it's nice there. But in New York, it's miserable. People are dropping like flies and MGMT does not care at all. I feel a tad exploited knowing that I have worked so hard for so little compensation, thinking that this company will one day be successful. MGMT has made a series of blunders and failed aspirations in the last 10 months, and their lack of action and accountability has made Booker a terrible place to work. Morale is at an all time low, and I don't see any future in this company. There are definitely some delusions of grandeur, and you'd think that management would care a bit more to have a foundation of knowledgeable employees to support the software, but this is not the case. You are supposed to work from 9-6 with a BS unpaid hour for lunch. The pay is absolutely terrible. Customer Success employees make so little, and therefore cannot live anywhere close to the office due to the ridiculous cost of living. If you count your hour commute into your workday, you are working 11-hour days with measly compensation. Advice to Management I am past the point of giving any advice to management.", "rating": 3, "pros": "It is a good place to harness your career and gain experience, especially since you'll be dealing with crazy client escalations. Also, a ton of people quit, so you'll find yourself with more responsibility than initially thought.", "cons": "They have started to shift their operations to AZ and Pennsylvania, so maybe it's nice there. But in New York, it's miserable. People are dropping like flies and MGMT does not care at all. I feel a tad exploited knowing that I have worked so hard for so little compensation, thinking that this company will one day be successful.", "advice": "I am past the point of giving any advice to management."}, {"title": "Great Company", "text": "Pros -Great people to work with -Great work environment -Perks - ping pong, keg Fridays, company outings Cons I think with all start up companies who are successful, there are growing pains. Advice to Management Keep promoting from within. It's so inspiring to see hard work recognized and rewarded. Booker is great at helping you grow in your career.", "rating": 5, "pros": "-Great people to work with", "cons": "I think with all start up companies who are successful, there are growing pains.", "advice": "Keep promoting from within. It's so inspiring to see hard work recognized and rewarded. Booker is great at helping you grow in your career."}, {"title": "Growing Company", "text": "Pros Great people Fun atmosphere Growing company People willing to listen and help improve the technical development process Cons As with any growing company, there are some challenges with competing business priorities. Advice to Management Make sure people across the company continue to be valued for the work they do.", "rating": 5, "pros": "Great people", "cons": "As with any growing company, there are some challenges with competing business priorities.", "advice": "Make sure people across the company continue to be valued for the work they do."}, {"title": "Account Executive", "text": "Pros The office is a fun atmosphere, great coworkers Cons Its a start up company", "rating": 5, "pros": "The office is a fun atmosphere, great coworkers", "cons": "Its a start up company", "advice": null}, {"title": "Great people!", "text": "Pros Love the culture at Booker! The company makes the effort to keep us happy and keep the startup feel. Training has definitely ramped up which I am happy about. Cons Compensation is on the lowside. People leave for big jumps in salary. 401k match would be a big plus! Advice to Management Keep the startup culture going. Don't ever give that up, please!", "rating": 5, "pros": "Love the culture at Booker! The company makes the effort to keep us happy and keep the startup feel. Training has definitely ramped up which I am happy about.", "cons": "Compensation is on the lowside. People leave for big jumps in salary. 401k match would be a big plus!", "advice": "Keep the startup culture going. Don't ever give that up, please!"}, {"title": "Sales Associate", "text": "Pros Fun and young working environment Cons Does not pay well and does not provide opportunities for growth.", "rating": 3, "pros": "Fun and young working environment", "cons": "Does not pay well and does not provide opportunities for growth.", "advice": null}, {"title": "Client success specialist", "text": "Pros Lots of room for growth. Cons No 401k match which is wack Advice to Management No advice", "rating": 1, "pros": "Lots of room for growth.", "cons": "No 401k match which is wack", "advice": "No advice"}, {"title": "Marketing", "text": "Pros Great team spirit and fun, challenging work but all hands are on and no one sits back, company is making a lot of very good moves, growing all the time, very collaborative, fantastic team outings, goals are clear, hard work but rewarded, everyone (regardless of level) is respected and involved Cons No real cons as company is doing a lot of great things now. Advice to Management Communicate across teams better", "rating": 5, "pros": "Great team spirit and fun, challenging work but all hands are on and no one sits back, company is making a lot of very good moves, growing all the time, very collaborative, fantastic team outings, goals are clear, hard work but rewarded, everyone (regardless of level) is respected and involved", "cons": "No real cons as company is doing a lot of great things now.", "advice": "Communicate across teams better"}, {"title": "Tech department disintegration", "text": "Pros You will be working with a lot of smart people Work from home is generous Milk and fruits provided at the beginning of the week Cons Senior Management (tech) does not know how to manage There is a negative vibe everywhere about the company (NY HQ) No room for growth Promotions are not merit based (wish I knew what they were based on) Rate of turnover is incredibly high A large number of incompetent managers Ability to talk is valued much much greater than ability to do Culture is becoming a CYA culture Advice to Management Get new tech management", "rating": 1, "pros": "You will be working with a lot of smart people", "cons": "Senior Management (tech) does not know how to manage", "advice": "Get new tech management"}, {"title": "seriously awesome company with lots of room for growth!", "text": "Pros great culture and work/life balance, lots of room for growth as the company is growing quickly as well, everyone from management to CEO is so awesome and approachable and they recognize hard work, very positive environment all around, great product that you feel confident can significantly help small/medium business owners, continuous training since company is consistently improving product, fun but challenging environment Cons only thing better would be a matching 401K", "rating": 5, "pros": "great culture and work/life balance, lots of room for growth as the company is growing quickly as well, everyone from management to CEO is so awesome and approachable and they recognize hard work, very positive environment all around, great product that you feel confident can significantly help small/medium business owners, continuous training since company is consistently improving product, fun but challenging environment", "cons": "only thing better would be a matching 401K", "advice": null}, {"title": "AE", "text": "Pros C level people know your name. Everyone is friendly and always willing to answer questions. If you have a idea its heard and they really value you as a human. The director of the AZ and CA offices are super nice. They are both working mothers and understand that emergency doctor appointments come up. I Love it here. Cons The health insurance is really costly. $149 every two weeks for PPO plan on a under 30 person. If your starting out as an AE , you will be expected to train as an appointment setter for a few months. Advice to Management Be more transparent about career paths and how to get to end goals.", "rating": 5, "pros": "C level people know your name. Everyone is friendly and always willing to answer questions. If you have a idea its heard and they really value you as a human. The director of the AZ and CA offices are super nice. They are both working mothers and understand that emergency doctor appointments come up. I Love it here.", "cons": "The health insurance is really costly. $149 every two weeks for PPO plan on a under 30 person.", "advice": "Be more transparent about career paths and how to get to end goals."}, {"title": "Run!", "text": "Pros Free food and t-shirts during the summer and holidays. Cons Hours, days worked, no consistency in anything. No one knows anything. They give you the wrong information constantly. High turn around rate, because there is always something better, and they don't like the people that they hire. Stepping stone company. Advice to Management I don't think anything I will say will help.", "rating": 1, "pros": "Free food and t-shirts during the summer and holidays.", "cons": "Hours, days worked, no consistency in anything. No one knows anything. They give you the wrong information constantly. High turn around rate, because there is always something better, and they don't like the people that they hire. Stepping stone company.", "advice": "I don't think anything I will say will help."}, {"title": "Great company culture", "text": "Pros Booker has great company culture, it's an overall fun place to work. There is always work incentives like food and beer. Cons The work itself can be confusing at times, training isn't that effective - you really learn hands on.", "rating": 5, "pros": "Booker has great company culture, it's an overall fun place to work. There is always work incentives like food and beer.", "cons": "The work itself can be confusing at times, training isn't that effective - you really learn hands on.", "advice": null}, {"title": "Customer Experience", "text": "Pros Great place to work out of college Cons Don't have any pros to list", "rating": 5, "pros": "Great place to work out of college", "cons": "Don't have any pros to list", "advice": null}, {"title": "Great Place", "text": "Pros Its getting in the place it should be Cons Some changes needed in the overall teams", "rating": 5, "pros": "Its getting in the place it should be", "cons": "Some changes needed in the overall teams", "advice": null}, {"title": "Implementation team was awesome", "text": "Pros Great Manager, leadership, and energy Cons Product needed some building on", "rating": 3, "pros": "Great Manager, leadership, and energy", "cons": "Product needed some building on", "advice": null}, {"title": "Good place to start, not so good to end", "text": "Pros You get to see many aspects of software development thanks to continuous efforts to share knowledge among different roles Cons Management is as bad as it gets. I don't think the CTO has once talked about technology, and they seem more worried about covering their behinds than proposing good initiatives Advice to Management Listen to the smart technical people, and swallow some of your pride so people see you're actually trying to fix things. Your approach to tech has left everyone skeptical about the company's future.", "rating": 3, "pros": "You get to see many aspects of software development thanks to continuous efforts to share knowledge among different roles", "cons": "Management is as bad as it gets. I don't think the CTO has once talked about technology, and they seem more worried about covering their behinds than proposing good initiatives", "advice": "Listen to the smart technical people, and swallow some of your pride so people see you're actually trying to fix things. Your approach to tech has left everyone skeptical about the company's future."}, {"title": "Great Culture", "text": "Pros Great culture and people are amazing. Good leadership. Cons Lacking upward trajectory as company grows. Suggestions can fall upon deaf ears, be sure to push forward with good ideas. Reviews tend to be unfocused.", "rating": 5, "pros": "Great culture and people are amazing.", "cons": "Lacking upward trajectory as company grows.", "advice": null}, {"title": "Booker is full of nice, fun people, and provides its employees with opportunities for growth and skill-building.", "text": "Pros - Unbelievable work/life balance - Room for growth - Nice, young, fun core of people - Opportunity to learn/develop skills - CEO is the man - Open communication - everyone is approachable from the CEO and down - Fun work outings are a plus - Fast-growing startup with lots of VC backing including Bain Capital - Amazing locations in NYC and California Cons - Communication between teams needs to be improved - Product is improving but should be better - Lots of young people = lots of immaturity — you have to deal with it - Don't pay particularly well, although there is room for growth both in title and salary Advice to Management - Matching 401k program - More cohesive vision for company future (across departments) - Put more money into the actual product/software", "rating": 5, "pros": "- Unbelievable work/life balance", "cons": "- Communication between teams needs to be improved", "advice": "- Matching 401k program"}, {"title": "Booker is a great place to work and provides me everything I need to succeed!", "text": "Pros The best thing about working at Booker is the company culture - the tone is set from the HR department all the way up to the CEO himself. People are always happy, smiling and seem like they love what they are doing. Booker does a great job in providing an atmosphere of work hard and you will get rewarded. Training is given from your superiors in a calm, meaningful way, and they are there to help you every step of the way. Perks include 401K plans, company outings (which are awesome!!!) and lots of team building activities. Cons The only benefit I would like Booker to add is a 401K matching program.", "rating": 5, "pros": "The best thing about working at Booker is the company culture - the tone is set from the HR department all the way up to the CEO himself. People are always happy, smiling and seem like they love what they are doing. Booker does a great job in providing an atmosphere of work hard and you will get rewarded. Training is given from your superiors in a calm, meaningful way, and they are there to help you every step of the way. Perks include 401K plans, company outings (which are awesome!!!) and lots of team building activities.", "cons": "The only benefit I would like Booker to add is a 401K matching program.", "advice": null}, {"title": "Good performance recognized", "text": "Pros Life at Booker is fun, challenging and rewarding. I have been here for almost a year and have really enjoyed my time. I work alongside very talented and friendly staff. If you work hard and are a team player it will get noticed and management does a great job of rewarding good performance. Booker's Fun committee puts together some really enjoyable events. It's an amazing company to work for. Cons At time communication between teams could be better. I have seen some improvement in this area since I've been at the company but there is room for more. Advice to Management Benefits package is good but I would like to see a matching 401K plan. Continue to foster communication and collaboration between different teams and departments.", "rating": 5, "pros": "Life at Booker is fun, challenging and rewarding. I have been here for almost a year and have really enjoyed my time. I work alongside very talented and friendly staff. If you work hard and are a team player it will get noticed and management does a great job of rewarding good performance. Booker's Fun committee puts together some really enjoyable events. It's an amazing company to work for.", "cons": "At time communication between teams could be better. I have seen some improvement in this area since I've been at the company but there is room for more.", "advice": "Benefits package is good but I would like to see a matching 401K plan. Continue to foster communication and collaboration between different teams and departments."}, {"title": "Great people", "text": "Pros Super positive, energetic environment with lots of young, cool people. Lots of fun events outside of work and there is a real feeling of camraderie. Cons Some competition and animosity amongst departments.", "rating": 5, "pros": "Super positive, energetic environment with lots of young, cool people. Lots of fun events outside of work and there is a real feeling of camraderie.", "cons": "Some competition and animosity amongst departments.", "advice": null}, {"title": "Booker is a good balance of good people, a good place, and is not short of interesting and challenging problems to solve", "text": "Pros No matter how deep or wide your history, you will learn a lot at Booker. Cons Not a Con, but a challenge is that the platform is massive and has a huge customer base so ideas are welcome but change might take longer than other smaller and younger companies. Still mad parsecs ahead of your typical investment bank in terms of innovation and turnaround of ideas. Advice to Management Don't stand for status quo. If we came to kick butt and chew bubble gum, we're all out of bubble gum. Disrupt all the things!", "rating": 5, "pros": "No matter how deep or wide your history, you will learn a lot at Booker.", "cons": "Not a Con, but a challenge is that the platform is massive and has a huge customer base so ideas are welcome but change might take longer than other smaller and younger companies. Still mad parsecs ahead of your typical investment bank in terms of innovation and turnaround of ideas.", "advice": "Don't stand for status quo. If we came to kick butt and chew bubble gum, we're all out of bubble gum. Disrupt all the things!"}, {"title": "Interesting/Good Place to Work", "text": "Pros Interesting projects and some good people make this generally a great place to work Cons Booker is still trying to figure out what it's future is... which can be painful and has some management issues.", "rating": 5, "pros": "Interesting projects and some good people make this generally a great place to work", "cons": "Booker is still trying to figure out what it's future is... which can be painful and has some management issues.", "advice": null}, {"title": "Good place to socialize, not a good place to work", "text": "Pros Booker has many employees in their 20s and early 30s, leading to great socializing and networking opportunities. Agile methodology was implemented for the Tech, Product, and QA teams, leading to more open communication between departments, though still not up the ranks. Booker has two comfortable lunch areas, with games and cable TV, making for a pleasant break. Fruit, like bananas and apples, are delivered once a week. The office is centrally located near the Fulton station in downtown and has great views of the WTC and the Hudson river. Cons UNCOMPETITIVE COMPENSATION Uncompetitive compensation is the number one problem at Booker. When compared on Glassdoor to average salaries for similar positions at similar companies in the same area, Booker pays anywhere from 25-50% less. This discrepancy in pay even occurs within Booker between employees in the same or similar roles. Specific examples include an employee who took over the position of a leaving employee with the same title, responsibilities, and experience, but made $20,000 less (~30% less); an employee who had been promoted multiple times and had been in their current role for a year was earning about $45,000 less (~50% less) than what a new employee in the same role received; a person was hired at $25,000 less (~35% less) than the average for the role based on Glassdoor; people hired into the Customer Experience department make less than people hired into the same roles one or two years ago. For two years in a row, annual performance reviews have come with no opportunity of an increase in compensation. In 2014 for the 2013 year, many managers did not conduct reviews unless approached by their employees even though HR had a clear performance review policy. In 2015, for the 2014 year, HR stated that reviews would come with no compensation increase; this would be discussed at a later time in 2015. An increase in compensation only happens when people are promoted or they offer their resignation. When promoted, the increase does not match the fair market compensation for that role. INSIGNIFICANT BENEFITS PTO is constantly being reduced for new employees. Over 20 days used to be offered a few years ago, then was reduced to around 15, and now it's down to 10. Sick days are included in PTO so that means even fewer vacation days. Health, dental, and vision insurance are offered along with other supplemental things like life and disability. However, the health insurance is extremely expensive, around $175 a month for an individual on the lowest plan and the company doesn't cover costs on a tiered basis, so entry level employees pay the same price for insurance as do executives. A 401(k) plan is offered but with no company match nor one being implemented in the foreseeable future. Options are offered but in a very limited amount and how many a person receives varies based on when they joined and whether they were promoted from within to their current position or were hired into that position (promoted employees have fewer options because they received fewer upon hire and are not given an amount equivalent to their new position). NO CAREER GROWTH / LACK MEANINGFUL PROMOTIONS Booker is a company where experienced people can go to work on a complex product, not a place for entry level people looking to learn or grow within the company. With little training, it is hard to attain the skills required to move up or to a different department. And even when employees have the skills for an open position, an outside person is brought in to fill the role. This happens for almost all management level roles and above. Instead, useless titles like Senior and Lead are given to employees to keep them “happy” for another year. Additionally, with these titles comes almost full management responsibilities but very little pay increase, the justification from executives being that these are not management positions. Specific goals for teams and individuals are not set by management, nor are performance requirements, so come annual reviews, management can give out any grade and not have to justify their decision. In the Customer Experience department, the VP was able to promote specific people the VP liked without a transparent process for doing so. In Product, people were passed up for promotions for reasons including that they “looked too young” and that they didn’t come in early enough, even though they often stayed late into the night to meet unrealistic deadlines. In Tech, the Director of Back End “conducted” reviews by sending an email with the HR review document filled out; employees had to seek out the Director to get a meeting to discuss the “review”. NO TRAINING / NO DOCUMENTATION Booker was built with contractors from day one and that continues today, with a large part of the tech team, from developers to QA, working remotely as part of outsourcing companies. This setup has led to pockets of knowledge and poor documentation of code. Very few people understand the platform well and there is no established way of documenting how new features work and how they integrate into the overall system. Onboarding of new employees is almost non-existent except in the sales and customer experience departments. In the tech department, no training on the software is provided, no development environment and other starting tools are provided, and management provides very little in the way of guidance and training and instead relies on teammates to do management’s job. Booker has held Lunch & Learns to help promote people sharing knowledge but the environment has become so non-collegial that people don’t want to invest in sharing because there is no reward and they don’t feel they are part of a team. POOR MANAGEMENT / LEADERSHIP Besides a hard-to-use and complex product, management is the second most likely reason for Booker to fail. They are inexperienced leaders and come from backgrounds unrelated to business-management software development. They believe that hiring more and more people is the solution to Booker’s problems and state that “we need to hire for this role so that the new person can figure out what we should do.” Ironically, hiring people is not a budget problem, but paying current employees fair market value is a problem. Management has very unrealistic growth expectations that they sell to employees and investors to encourage them to stay and invest, respectively. Sales projections are based on hoped-for partnerships that require a great deal of software development and run time, neither of which Booker has. Unless certain executives are replaced and a different strategy for the company is implemented, Booker is not likely to survive and not a place to bet a startup career on. HIGH EMPLOYEE TURNOVER Employee turnover is a serious problem at Booker. For over a year, Booker's maintained about a 25% per year turnover, meaning that with around 200-250 employees, one person a week, on average, leaves the company. While there are employees who have been there longer, including a co-founder, the average employee tenure is about 1-2 years even though the company is over 7 years old. A majority of employees who have been with the company for more than six months express their desire to leave the company or their unhappiness with the company. Management has conducted numerous surveys to determine why employees are unhappy and are leaving, but few meaningful changes have been made. The biggest complaint of employees is compensation. QUESTIONABLE ETHICS The ethics at Booker is particularly troubling with some stand-out examples. Booker will do many things to market itself to potential customers, including paying employees to direct only satisfied customers who are willing to give a 5 star rating to a software review website and encouraging employees to vote on the best spa software in the American Spas’ 2014 Professional's Choice Awards. In regards to the latter, an email from the Director of Brand and Reputation at Booker was sent to all employees stating to vote for Booker but “When asked for your contact information, provide your personal email and telephone number NOT your Booker email.” This was followed up with an email stating “PLEASE NOTE: Do not do this from your work IP — you have to enter from your personal account.” Based on this email, having employees vote for Booker was not only unethical but also not allowed by the awards organization. Booker from time to time will offer an award to people who help out with large projects. Such an award was given out in 2014 to the group that worked on implementing a new enterprise client, working long hours with a very tight deadline. One of the employees working on this project found another job towards the completion of the project and gave his customary two week notice. The award was a baseball game for the team but this employee was not allowed to attend because his last day of employment was the day before the game. Even though he had put in months of hard work on the project and left on good terms, he was not allowed to attend the game. A similar thing happened to an employee who had been with the company for a year and a half and resigned in November of 2014. The employee wanted to attend the holiday party held the first week of December and was allowed to do so but was mandated to pay $80, even though the employee had RSVPed to the event while employed so the headcount was accounted for and the employee had worked there the entire year. The reason for the required payment was because “that’s the policy”. Another instance of poor ethics and possibly illegal discrimination came during reviews from a manager who told an employee that the employee couldn’t receive a senior title because the employee “looked too young” and “how would that title be perceived by others”. A final troubling development is the opening of an office in Philadelphia. The stated rationale behind this was cheaper office space. Philadelphia is not a tech hub, certainly nothing like San Francisco, Austin, Boston, or other cities with available talent. When asked if other cities were considered, the answer was no. This leads one to believe that “cheaper office space” was not a deciding factor. Given that the executive had already hired two friends into VP and Director level positions, providing jobs for friends was a probable reason. Coincidentally, they all live in Philadelphia and commute to New York for Booker. It wouldn’t be surprising if in a few months, these executives permanently work from the Philadelphia office. This would not be far-fetched because two VPs already work remotely, in addition to a large part of tech that is outsourced abroad. Advice to Management Pay fair market salaries and pay consistently among employees with the same or similar roles. This has happened in the QA department but needs to be across the whole company. Provide cheaper healthcare options for entry-level employees and start matching 401(k) contributions. Focus on training employees, whether through online videos like Lynda.com, through continuing education classes, or by hiring managers who are experts in their field and are willing to train their employees. Promote from within for management positions and mentor new managers so they can succeed. Have a focused strategy for the product as it’s too complex as it is and isn't sellable without massive amounts of expensive training for new clients. Choose a market segment and don’t try to please every new enterprise client, especially when it leads to added features to the product that are only relevant to that client. Work on long-term, scalable solutions that are automated instead of short-term patches that require multiple departments spending time away from their jobs to resolve. Stop hiring indiscriminately. It’s a waste of money and not the appropriate solution for the existing problems. Venture capitalists would be happier with a successful company than with a large company. Bring contract developers and QA jobs in-house. It will lead to better knowledge of the product and better communication among employees. Implement documentation requirements so that knowledge isn't lost when an employee leaves.", "rating": 1, "pros": "Booker has many employees in their 20s and early 30s, leading to great socializing and networking opportunities. Agile methodology was implemented for the Tech, Product, and QA teams, leading to more open communication between departments, though still not up the ranks. Booker has two comfortable lunch areas, with games and cable TV, making for a pleasant break. Fruit, like bananas and apples, are delivered once a week. The office is centrally located near the Fulton station in downtown and has great views of the WTC and the Hudson river.", "cons": "UNCOMPETITIVE COMPENSATION", "advice": "Pay fair market salaries and pay consistently among employees with the same or similar roles. This has happened in the QA department but needs to be across the whole company."}, {"title": "Great place to get your foot in the door!", "text": "Pros The culture is a very fun, up-beat. HR likes to plan quarterly outings. There is a Keg and ping pong table. There is a lot of room for growth if you work hard. Cons High turnover. Communication and employee training could be better. Leadership could be more transparent. Some department employees don't believe in the product which leads to not so proactive conversations among colleagues. Overall, the people are great, the product needs some work, but it's getting there. Advice to Management Let your employees be more creative with their schedule or how they do their jobs. Be more flexible to change. Each department should feel just as valued as the next.", "rating": 5, "pros": "The culture is a very fun, up-beat. HR likes to plan quarterly outings. There is a Keg and ping pong table. There is a lot of room for growth if you work hard.", "cons": "High turnover. Communication and employee training could be better. Leadership could be more transparent. Some department employees don't believe in the product which leads to not so proactive conversations among colleagues. Overall, the people are great, the product needs some work, but it's getting there.", "advice": "Let your employees be more creative with their schedule or how they do their jobs. Be more flexible to change. Each department should feel just as valued as the next."}, {"title": "Fast-growing startup, terrific culture, exciting growth prospects", "text": "Pros Booker has a terrific culture that starts with its senior leadership. Smart people work here and they work hard, but maintain a solid work-life balance. It is an exciting time to be at Booker, given its strong growth prospects in the short and long run. Also, Booker is making a huge impact on small businesses and the product is great - it is rewarding to be a part of that impact and create something that actually helps people. Lastly, Booker is a nice combination of a startup environment/culture with a growing/maturing company that is on its way to becoming a mid-sized company. So you get the best of all worlds - growth, culture, opportunity and stability. Cons Sales management seems inexperienced and could use training or need to be revisited. Company and senior leadership needs to revisit their core values. Also, more accountability is needed across all levels when it comes to goals. Advice to Management Take the time to truly define what Booker's core values are, as this needs to resonate within the company. Also, be more transparent when it comes to company goals - for example, Sales goals, Product goals, Marketing goals...", "rating": 5, "pros": "Booker has a terrific culture that starts with its senior leadership. Smart people work here and they work hard, but maintain a solid work-life balance. It is an exciting time to be at Booker, given its strong growth prospects in the short and long run. Also, Booker is making a huge impact on small businesses and the product is great - it is rewarding to be a part of that impact and create something that actually helps people. Lastly, Booker is a nice combination of a startup environment/culture with a growing/maturing company that is on its way to becoming a mid-sized company. So you get the best of all worlds - growth, culture, opportunity and stability.", "cons": "Sales management seems inexperienced and could use training or need to be revisited. Company and senior leadership needs to revisit their core values. Also, more accountability is needed across all levels when it comes to goals.", "advice": "Take the time to truly define what Booker's core values are, as this needs to resonate within the company. Also, be more transparent when it comes to company goals - for example, Sales goals, Product goals, Marketing goals..."}, {"title": "A startup that never grew up", "text": "Pros beer, social gatherings, oranges, free swag, a ping pong table, desks, chairs, Honestly the only really positive take away from this place was I got to work from home 2 days a week. The Human Resources department were very understanding (as I was resigning due to conflicts with co-workers, and were very interested in my feedback). There is work to be done here, and depending on how you see it, it's an opportunity, or a nightmare. Cons I was neither trained, nor on-boarded in any capacity. immature senior staff/directors, company operates more like a frat house, poor management / lack of leadership, inexperienced executives, recruiter was unprofessional, generally a very unstable place that puts it's resources on the hook when product management/sales make mistakes, or they are reeling from horrible contracted relationships which force the hand to tip the companies efforts in all hands on deck efforts each time they made a release or had to satisfy the demanding clients wishes. Generally most of the technical staff seemed frustrated until they have beers, They don't pay competitively I was able to know within the first week this place was a mess and I made a huge mistake accepting the position. I watched a dozen people continue to resign each week as soon as i joined. I watched a director get fired in the most embarrassing way possible. I began looking for a new position after 2 months. This was the first time in my career I had to quit during my resignation period. My supervisor was bitter, and began demanding terms (which neither were discussed prior to my resignation nor acceptable). I literally had to take 3 weeks off unpaid and pay a claw back signing bonus. Easily the worst work experience I've ever had professionally Luckily I landed on my feet, and things are looking much better for me these days. Advice to Management Do you want to hire quality people? Start from the top down, Build a real C team. Create a mentor program which inspires young developers and supports their careers. Create a positive learning culture. Eliminate the bad apples that while tenured and experienced in their improvised and strange operation, have provided little to no opportunity for the new people to step up. Break some walls, avoid gimmicky silver bullet solutions like \"agile\", choose a focus, stop trying to maintain the sinking ship, I've never seen a company support 5 versions of their own API. If you can't change much of what I described, consider selling the company.", "rating": 3, "pros": "beer, social gatherings, oranges, free swag, a ping pong table, desks, chairs,", "cons": "I was neither trained, nor on-boarded in any capacity.", "advice": "Do you want to hire quality people? Start from the top down, Build a real C team. Create a mentor program which inspires young developers and supports their careers. Create a positive learning culture. Eliminate the bad apples that while tenured and experienced in their improvised and strange operation, have provided little to no opportunity for the new people to step up. Break some walls, avoid gimmicky silver bullet solutions like \"agile\", choose a focus, stop trying to maintain the sinking ship, I've never seen a company support 5 versions of their own API."}, {"title": "Awesome", "text": "Pros Great work environment, great product Cons Management needs to be more professional. Advice to Management Higher a manager that is capable of being a manager.", "rating": 5, "pros": "Great work environment, great product", "cons": "Management needs to be more professional.", "advice": "Higher a manager that is capable of being a manager."}, {"title": "Great Resume Builder and chance to meet talented people!", "text": "Pros - Learn new things quickly - More chances to make your own decisions and have an impact IF you go for it - Meet the best people - they know how to hire talent - Great resume builder since you get to wear several hats in different roles - Young atmosphere and open - Fun outings Booker is a great company for anyone out of college who is looking to get experience. They are willing to show you all they can show you and want you to grow but it is not a company where you stay a long time at, you get your experience and leave. The people are what make everyday worth it because you get to see the hard work and time put in from all departments and watch and idea turn into a reality. Cons - Salary - Career Growth - minimal communication within departments", "rating": 3, "pros": "- Learn new things quickly", "cons": "- Salary", "advice": null}, {"title": "Great Start-up", "text": "Pros Booker is a great place to transition or reach another level in your career in a short span time. The culture is vibrant as the company always has celebrations on it's achievements and goals! The people range from people who have been since and newbies. It can be a little awkward at first working in a open space with over fifty people and a range of personalities but that is the epitome of NYC. Overall, I would recommend Booker for someone needing a first time office experience or a career climber. Cons -open work space vs privacy -salary", "rating": 5, "pros": "Booker is a great place to transition or reach another level in your career in a short span time. The culture is vibrant as the company always has celebrations on it's achievements and goals! The people range from people who have been since and newbies. It can be a little awkward at first working in a open space with over fifty people and a range of personalities but that is the epitome of NYC. Overall, I would recommend Booker for someone needing a first time office experience or a career climber.", "cons": "-open work space vs privacy", "advice": null}, {"title": "Great place to work for those determined to go somewhere.", "text": "Pros Great starting salary for an entry level position. Since it's a growing company there are many ways to create value for yourself. Rewards those who try to go beyond what their job description is. Cons Since it is growing if you don't create your own path it can be hard to get noticed. Advice to Management Great place to work. The restructuring of the departments shows clear path and organization. Moving in the right direction.", "rating": 5, "pros": "Great starting salary for an entry level position.", "cons": "Since it is growing if you don't create your own path it can be hard to get noticed.", "advice": "Great place to work. The restructuring of the departments shows clear path and organization. Moving in the right direction."}, {"title": "Great Company, Great People", "text": "Pros Great work environment with opportunities for professional growth. Understanding and helpful management. Honest, hardworking employees.Tons of perks (Summer Fridays, PTO, work events). Approachable and genuine CEO. I have been with the company for 2 years and Booker has always taken care of me. The company has promoted me 3 times and recognized my hard work and contribution on various projects. If you are a hard working, multitasking who is looking to shine in a fast growing company, Booker is for you! Cons If you are someone who sits on the back-burner and waits for tasks to be handed to you, you may not be a good fit for Booker. Advice to Management Keep up the great work!", "rating": 5, "pros": "Great work environment with opportunities for professional growth. Understanding and helpful management. Honest, hardworking employees.Tons of perks (Summer Fridays, PTO, work events). Approachable and genuine CEO.", "cons": "If you are someone who sits on the back-burner and waits for tasks to be handed to you, you may not be a good fit for Booker.", "advice": "Keep up the great work!"}, {"title": "A place where you don't want the end of the day to come!", "text": "Pros -Continuous Growth -Crazy amounts of collaboration -A KILLER product -Exposure to so many diverse and talented people -ACTUALLY being able to love your work, environment, and position! Cons No matching on the 401k. I wish there was more going on in the area. ( That being said....AMAZING views) Advice to Management More Booker events like our \"Booker Olympics\"! We love that stuff!", "rating": 5, "pros": "-Continuous Growth", "cons": "No matching on the 401k.", "advice": "More Booker events like our \"Booker Olympics\"! We love that stuff!"}, {"title": "Where really smart people do really cool....stuff", "text": "Pros - Awesome product that really helps small to medium sized businesses - Rapid growth, more internal promotions and transfers - Increasing product training, company-wide - Increasing transparency and communication - Smart and passionate tech and product team - Tech stack isn't super sexy, but what we're doing with it is pretty darn cool Cons - Financial District location - There has been a communication breakdown between departments in the past, but the company is really spearheading fostering inter departmental and cross-functional communication and collaboration - No 401k match - Frequent desk moves (don't grow attached to your window seat) Advice to Management Keep up the good work and get better fruit - that stuff goes bad the next day!", "rating": 5, "pros": "- Awesome product that really helps small to medium sized businesses", "cons": "- Financial District location", "advice": "Keep up the good work and get better fruit - that stuff goes bad the next day!"}, {"title": "Great product, great people, fun work environment", "text": "Pros There have been huge enhancements in improving the product and general customer experience. The CEO cares greatly about his employees and celebrates successes with the team. There are lots of fun activities for employees and an investment in professional growth. Management is open to time off and promote a healthy work life balance. Often times, employees stay well past close simply because they really like each other. Cons Like all companies, there are silos that need to be broken down, specifically within the Product/Tech area. A lack of having a central operations team causes a breakdown in communication and as a result causes territorial issues. Company communication is often after the fact and not pro-active additionally the meeting culture is counter-productive and often unnecessary. The HR team should develop a company-wide rewards program so there is a brand consistency as well as improving the health benefits and considering a 401k match. Advice to Management There is an experience gap at Booker, lots of entry level staff with limited professional experience (tons of Booker product experience) vs senior management and above with years of professional experience (no Booker product experience). Those without professional experience outside of Booker don't realize how good they have it and often are the biggest critics and morale killers. This being said, developing a mandatory product and process training for the on-boarding of all new hires and existing employees will mitigate this and improve the culture -- this is urgent. Continue the fun activities but consider enhancing existing or adding other benefits (medical/401k match/bonus) as this is what retains staff.", "rating": 5, "pros": "There have been huge enhancements in improving the product and general customer experience. The CEO cares greatly about his employees and celebrates successes with the team. There are lots of fun activities for employees and an investment in professional growth. Management is open to time off and promote a healthy work life balance. Often times, employees stay well past close simply because they really like each other.", "cons": "Like all companies, there are silos that need to be broken down, specifically within the Product/Tech area. A lack of having a central operations team causes a breakdown in communication and as a result causes territorial issues. Company communication is often after the fact and not pro-active additionally the meeting culture is counter-productive and often unnecessary. The HR team should develop a company-wide rewards program so there is a brand consistency as well as improving the health benefits and considering a 401k match.", "advice": "There is an experience gap at Booker, lots of entry level staff with limited professional experience (tons of Booker product experience) vs senior management and above with years of professional experience (no Booker product experience). Those without professional experience outside of Booker don't realize how good they have it and often are the biggest critics and morale killers. This being said, developing a mandatory product and process training for the on-boarding of all new hires and existing employees will mitigate this and improve the culture -- this is urgent. Continue the fun activities but consider enhancing existing or adding other benefits (medical/401k match/bonus) as this is what retains staff."}, {"title": "Fun, challenging environment to grow and make a lasting impact", "text": "Pros As part of the marketing team, I have two fabulous mentors with a ton of industry experience who truly care about investing in their team and helping them grow. Everyone I work with is smart, fun, hardworking, and willing to face problems head-on rather than sweeping them under the rug. There's enough structure within the company to provide room for advancement, but not so much structure that it causes inefficiencies and corporate roadblocks that get in the way of getting stuff done. The company culture is laid back and fun, and leaders are approachable at all levels of the organization. Benefits cover all the standard bases with some additional perks like pre-tax transit benefits as well. Cons It's a startup, so it goes without saying that the hours are long and the bar is set high in terms of company goals and performance. It's a culture of constant meetings, which can be beneficial but at times leads to burnout and diminishing returns. I also hate the requisite ping-pong table. Sorry.", "rating": 5, "pros": "As part of the marketing team, I have two fabulous mentors with a ton of industry experience who truly care about investing in their team and helping them grow. Everyone I work with is smart, fun, hardworking, and willing to face problems head-on rather than sweeping them under the rug. There's enough structure within the company to provide room for advancement, but not so much structure that it causes inefficiencies and corporate roadblocks that get in the way of getting stuff done.", "cons": "It's a startup, so it goes without saying that the hours are long and the bar is set high in terms of company goals and performance.", "advice": null}, {"title": "Great Place to Work!", "text": "Pros Booker is an amazing place to work! The atmosphere and culture are very exciting and motivating. We just had a new release that went exceptionally well so the company only keeps on improving. The company has a very bright future ahead of it. The employees work hard to take this company to new heights. The executives acknowledge the hard work that the employees do so it does not go unnoticed. I already have, and will continue to recommend this company to anyone who is looking for a job. There is no better company in my mind. Cons Commute to get there. Advice to Management Keep doing what you're doing.", "rating": 5, "pros": "Booker is an amazing place to work! The atmosphere and culture are very exciting and motivating. We just had a new release that went exceptionally well so the company only keeps on improving. The company has a very bright future ahead of it. The employees work hard to take this company to new heights. The executives acknowledge the hard work that the employees do so it does not go unnoticed. I already have, and will continue to recommend this company to anyone who is looking for a job. There is no better company in my mind.", "cons": "Commute to get there.", "advice": "Keep doing what you're doing."}, {"title": "Great place to start...", "text": "Pros Staff allows working at Booker to be enjoyable Lots of internal growth End of the month FREE food for Sales ONLY Surf the web while work and get paid Cons -Lack of communication across company and mostly within departments -Lack of employee appreciation -Managers have NO experience or training with the Software -Booker hires young employees within the Customer Experience department ( usually fresh out of college) and treat them as CHILDREN. It is visibly clear to EVERYONE across the company - Focus needs to be on enhancing the software ( appearance and bug related issues) - No company wide training -Start up culture quickly coming to an end Advice to Management Listen to your most valuable employees they know more about the software than you do. Every department should be treated equally the same. Enough with the \"budget cuts\"....invest in your employees. Happy Employees = Happy Customers ( Trader Joe's).", "rating": 3, "pros": "Staff allows working at Booker to be enjoyable", "cons": "-Lack of communication across company and mostly within departments", "advice": "Listen to your most valuable employees they know more about the software than you do. Every department should be treated equally the same. Enough with the \"budget cuts\"....invest in your employees. Happy Employees = Happy Customers ( Trader Joe's)."}, {"title": "Fun Company for Entry Level Canidates", "text": "Pros Fun work environment, culture was great! Cons company is starting to have some turnover problems with sales folks Advice to Management Spruce up your sales training", "rating": 5, "pros": "Fun work environment, culture was great!", "cons": "company is starting to have some turnover problems with sales folks", "advice": "Spruce up your sales training"}, {"title": "learning experience", "text": "Pros cool environment, good people and decent product Cons long sales cycle, way to easy to lose earned commission. Advice to Management need to get their stuff together to make the sales cycle easy and seamless and actually help make the sales exec. money. the goals are usually unrealistic", "rating": 3, "pros": "cool environment, good people and decent product", "cons": "long sales cycle, way to easy to lose earned commission.", "advice": "need to get their stuff together to make the sales cycle easy and seamless and actually help make the sales exec. money. the goals are usually unrealistic"}, {"title": "A company with too much on their plate and no direction...", "text": "Pros Booker started as a great place. My coworkers are still incredible. They are smart, friendly and a ball of fun to be around. These are some of the most enjoyable people I have ever worked with. Cons In short, there is zero communication in the office. The company is lacking management with any kind of attachment to the product. Half of them have probably never even used it. They make decisions without taking into consideration the impact on existing customers and equally important their own employees. There is this constant 'just get it done' attitude without support. Somethings gotta give. The company is now full of managers who just want to delegate work without putting in any effort themselves or holding anyone accountable. Advice to Management Think about your staff. Show them you care. Stop committing to deals you cannot support. Attrition will come as you lose more and more legacy staff unless you acknowledge it and do something about it.", "rating": 3, "pros": "Booker started as a great place. My coworkers are still incredible. They are smart, friendly and a ball of fun to be around. These are some of the most enjoyable people I have ever worked with.", "cons": "In short, there is zero communication in the office. The company is lacking management with any kind of attachment to the product. Half of them have probably never even used it. They make decisions without taking into consideration the impact on existing customers and equally important their own employees. There is this constant 'just get it done' attitude without support. Somethings gotta give. The company is now full of managers who just want to delegate work without putting in any effort themselves or holding anyone accountable.", "advice": "Think about your staff. Show them you care. Stop committing to deals you cannot support. Attrition will come as you lose more and more legacy staff unless you acknowledge it and do something about it."}, {"title": "Massive tech, product, and design debt.", "text": "Pros Good downtown Manhattan location near lots of restaurants, shops, stores. Software allegedly helps small and medium business Any hardware you want (generally) Not really much else to say Cons High employee turnover Massive tech debt Badly coded platform Management can't make decisions Product is very poorly designed High customer churn Too many managers Too many legacy employees holding company back Too many partnerships where they rush to hack and code just to get stuff out the door Advice to Management Clean house. Hire smart, amazing, people who are proven at delivering fantastic work which customers love.", "rating": 1, "pros": "Good downtown Manhattan location near lots of restaurants, shops, stores.", "cons": "High employee turnover", "advice": "Clean house. Hire smart, amazing, people who are proven at delivering fantastic work which customers love."}, {"title": "Great place to work", "text": "Pros Great people great company that care about their employees Cons There is always a bad seed to bring you down where ever you go.", "rating": 5, "pros": "Great people great company that care about their employees", "cons": "There is always a bad seed to bring you down where ever you go.", "advice": null}, {"title": "Great Company", "text": "Pros awesome co workers, fun environment, start up excitement, great hours Cons little to no promotions Advice to Management Promote from within!", "rating": 3, "pros": "awesome co workers, fun environment, start up excitement, great hours", "cons": "little to no promotions", "advice": "Promote from within!"}, {"title": "Great Work Environment", "text": "Pros Booker is a great place to work. The employees at this company are a young and friendly group of people. The management really tries to make everyone here happy and the company frequently sponsors fun events, such as happy hours, lunch and learns and Beer Fridays. Since it is a start-up, there's a lot of room to grow and take on responsibilities you would not otherwise get at a larger company. The dress code is also super casual and you can wear jeans everyday. Cons It's located in the financial district, which is not as easy to get to as midtown.", "rating": 5, "pros": "Booker is a great place to work. The employees at this company are a young and friendly group of people. The management really tries to make everyone here happy and the company frequently sponsors fun events, such as happy hours, lunch and learns and Beer Fridays. Since it is a start-up, there's a lot of room to grow and take on responsibilities you would not otherwise get at a larger company. The dress code is also super casual and you can wear jeans everyday.", "cons": "It's located in the financial district, which is not as easy to get to as midtown.", "advice": null}, {"title": "Stay Away. Like someone else said, \"Sinking Ship.", "text": "Pros -Most of the other sales people were great, and fun to work with -Ping pong table.......but they got rid of that -Beer every Friday, but it's usually warm and foamy and no one seems to care -It didn't really seem like they cared whether you actually hit your call numbers every day -Free food for sales team on the last day of the month Cons -Promotions are few and far between -Compensation is average but they change the quota structure too frequently which makes things more complicated than they need to be -The product FREQUENTLY crashes leaving your customers, who rely on the software to run their business, out to dry -Every sales person is either looking for another job or should be -If you do not meet your quota you are put on a \"performance improvement plan.\" Basically, there is no plan and you should spend your last month looking for another job -There have been many attempts to find a new vertical to launch the product in, but most have fizzled out quickly leaving the sales team to keep calling Salons and Spas that have already been over pitched on similar products -Implementation of the product is a nightmare and often results in losing a client at the expense of the sales rep -Training consisted of a week of listening to other reps make cold-calls, learning about the product, and sitting in on demos of the product, which are usually conducted by reps who had only been there a couple months -When you first start, they give you a bunch of pretty decent leads that you kill yourself trying to set up a demo with them, but then you pass it off to someone that has been there longer than you and you get something like $10 if they close. -Don't really know why I got business cards for a phone sales job -Most of the time the leads we got were straight out of the Yellow Pages and the customer wouldn't even have a website -The sales team managers were usually reps that were very good when they were selling, but terrible at managing people -There isn't really any camaraderie between departments, and I often wouldn't even recognize people from the other floor -Often times managers would come in visibly hung over or would not come in that day because they were hung over, and then they'd give us a hard time for being sick -We were given a lot of vacation time that we could never use because our managers would give us a hard time about it -There seem to be a lot of bogus reviews of this company on here. Anyone that says they can't think of one thing they dislike about their job is kidding themselves Advice to Management I'm not going to kid myself into believing that they will actually read any of this, but if they do, fix the cons.", "rating": 1, "pros": "-Most of the other sales people were great, and fun to work with", "cons": "-Promotions are few and far between", "advice": "I'm not going to kid myself into believing that they will actually read any of this, but if they do, fix the cons."}, {"title": "NOT A STARTUP", "text": "Pros free fruit and beer on Friday afternoons. A computer to surf the internet while getting paid. Cons Where to start. At 7 years old, this company is not a start-up. They attract fresh college kids looking for their first job, and pay them horribly. Revolving door, people leaving almost everyday. The people leaving aren't leaving because they cant make it in sales, its the ones that are staying that can't make it in sales and just dont know what else to do. Good luck coming in not knowing anyone, cause nobody there is looking to make a new friend. Horrible leads provided, recycled almost every 2 months and a over saturated market. Advice to Management Why don't you try playing the most important part of your operation a bit better?", "rating": 1, "pros": "free fruit and beer on Friday afternoons. A computer to surf the internet while getting paid.", "cons": "Where to start. At 7 years old, this company is not a start-up. They attract fresh college kids looking for their first job, and pay them horribly. Revolving door, people leaving almost everyday. The people leaving aren't leaving because they cant make it in sales, its the ones that are staying that can't make it in sales and just dont know what else to do. Good luck coming in not knowing anyone, cause nobody there is looking to make a new friend. Horrible leads provided, recycled almost every 2 months and a over saturated market.", "advice": "Why don't you try playing the most important part of your operation a bit better?"}, {"title": "Do yourself a favor and look elsewhere", "text": "Pros Good people, social atmosphere, supportive team environment Cons Growing too fast for their own good and ruining the company reputation, Booker pays employees way less than it costs to live in the NYC area, the management team is very secretive and whispers a lot, there are a lot of closed door meetings, if you don't socialize you won't make it with the company Advice to Management Be leaders. You get paid good money to motivate your team and help them to do their job well. Advice: Involve your teams in decisions and please give higher compensation and awards that people care about. Everyone talks and I assure you that anyone who has been at Booker for over 1 year is looking for a new job that pays better.", "rating": 3, "pros": "Good people, social atmosphere, supportive team environment", "cons": "Growing too fast for their own good and ruining the company reputation, Booker pays employees way less than it costs to live in the NYC area, the management team is very secretive and whispers a lot, there are a lot of closed door meetings, if you don't socialize you won't make it with the company", "advice": "Be leaders. You get paid good money to motivate your team and help them to do their job well. Advice: Involve your teams in decisions and please give higher compensation and awards that people care about. Everyone talks and I assure you that anyone who has been at Booker for over 1 year is looking for a new job that pays better."}, {"title": "Sinking Ship", "text": "Pros There are a few super-stars, who are always a pleasure to work with Cons Average age of employees is 23 (almost all are straight out of college) / and \"what happens out of the office\" never stays there. Gossip spreads like wildfire. // Senior Managers are aloof, secretive, and two-faced // the product is horrible, and customers complain about the system (particularly it being down) constantly. It makes for a sad, depressing environment. Everyone is looking for an exit strategy - but most people aren't motivated enough to find one (myself included) Advice to Management Pay employees better! Even the best sales people make less than 60K a year. C-level management needs to get their head out of clouds and realize the sinking ship they are leading.", "rating": 1, "pros": "There are a few super-stars, who are always a pleasure to work with", "cons": "Average age of employees is 23 (almost all are straight out of college) / and \"what happens out of the office\" never stays there. Gossip spreads like wildfire. // Senior Managers are aloof, secretive, and two-faced // the product is horrible, and customers complain about the system (particularly it being down) constantly. It makes for a sad, depressing environment. Everyone is looking for an exit strategy - but most people aren't motivated enough to find one (myself included)", "advice": "Pay employees better! Even the best sales people make less than 60K a year. C-level management needs to get their head out of clouds and realize the sinking ship they are leading."}, {"title": "Fast Paced Start-up", "text": "Pros Great company, great people, and the office is awesome. Cons Industry is different, days can become monotonous. Advice to Management None", "rating": 5, "pros": "Great company, great people, and the office is awesome.", "cons": "Industry is different, days can become monotonous.", "advice": "None"}, {"title": "Booker, great place to work for.", "text": "Pros Great culture, and supportive work environment Cons None can immediately come to mind.", "rating": 5, "pros": "Great culture, and supportive work environment", "cons": "None can immediately come to mind.", "advice": null}, {"title": "Cool place to work", "text": "Pros Fun, energetic workforce; great culture; cool digs; free bananas Cons Fast pace and high growth expecatations Advice to Management Keep on keeping on", "rating": 5, "pros": "Fun, energetic workforce; great culture; cool digs; free bananas", "cons": "Fast pace and high growth expecatations", "advice": "Keep on keeping on"}, {"title": "Four words: No Longer A Startup", "text": "Pros Free beer, ping pong, foozeball, Xbox, laid-back company culture, casual dress code, fantastic people to work with. Offers SOME opportunity for advancement, though it is largely merit-based--work hard, become a specialist in something, and you will get promoted vertically or horizontally. Cons Atrocious pay, wayyy below market value. Personal and salary reviews are done for the entire company at a set time in the year, so if you didn't join the company at the right time of the year, you will have to wait more than a year and a half sometimes in order to the raise you deserve for the work you've put in. Not everybody can advance their careers here--only the few superstars. The sales team has a high turnover rate--largely because of recycled leads, excessively cold-calling low-quality leads, and low pay, even if you perform well. Company is growing WAY too fast for its own good. Advice to Management Stop hiring new people and pay your existing employees more!! Give people a reason or incentive to stay, because as you sit at your desk and see all the possible opportunities out there, you realize that the financial recognition for the work you are doing is well below average.", "rating": 3, "pros": "Free beer, ping pong, foozeball, Xbox, laid-back company culture, casual dress code, fantastic people to work with. Offers SOME opportunity for advancement, though it is largely merit-based--work hard, become a specialist in something, and you will get promoted vertically or horizontally.", "cons": "Atrocious pay, wayyy below market value. Personal and salary reviews are done for the entire company at a set time in the year, so if you didn't join the company at the right time of the year, you will have to wait more than a year and a half sometimes in order to the raise you deserve for the work you've put in. Not everybody can advance their careers here--only the few superstars. The sales team has a high turnover rate--largely because of recycled leads, excessively cold-calling low-quality leads, and low pay, even if you perform well.", "advice": "Stop hiring new people and pay your existing employees more!! Give people a reason or incentive to stay, because as you sit at your desk and see all the possible opportunities out there, you realize that the financial recognition for the work you are doing is well below average."}, {"title": "Great Company to Work For!", "text": "Pros Fun and productive work environment, fabulous culture, great people and cool technology! Cons Salary could be better BUT the work environment outweighs this issue. Advice to Management Keep the great culture going no matter how large we get.", "rating": 5, "pros": "Fun and productive work environment, fabulous culture, great people and cool technology!", "cons": "Salary could be better BUT the work environment outweighs this issue.", "advice": "Keep the great culture going no matter how large we get."}, {"title": "A top-heavy company. Cool at first, then goes downhill quickly. Apply at your own risk !", "text": "Pros -They emphasize culture. They literally have fired someone for not 'meshing well' with others, which is just a nice way of saying 'he didn't like to drink with his colleagues or play kickball on Tuesdays with the rest of the group.' -Young people. I have yet to see someone over thirty that is not in management work in the NY office. I know several people in the CA office as well, and that location seems even younger. We all have some common interests, which is a plus, but it also makes for cat fights and too much gossip for my liking. Cons -They emphasize culture. Yes, some people are cool, but many people abuse the socializing aspect. It's tough to see someone who gets paid the same (if not more than you) talk all day to their neighbor when you are putting in hours and hours of effort read: hours and hours of cold calling and watching your neighbor go on Facebook or watching your manager play Candy Crush. -The pay is pretty low and raises are given (if they like you), but you will plateau at about 45k -Top-heavy. The VPs don't even know how to use the software the company sells and supports, yet they have hour-long meetings talking at employees telling them how to improve. it's incredibly difficult to actively listen to this when the person preaching has no idea how to even schedule an appointment in this errr... scheduling software. -I have been an employee since the very beginning and have seen how the company has changed. I used to love waking up in the morning to go to work and hated the days I was sick and couldn't go into the office to work alongside my friends. Now it's like the movie 'Mean Girls.' My department (sales) : the men have this sense of entitlement. The women: gossip all day long. There is a group Skype chat that serves the purpose of making fun of people... it is very disheartening and certainly lowers morale. It always seems the Support department is angry... very, very angry. -The different departments simply do not work together to help both current and prospective clients. Sales just sells a product by making promises they cannot keep; implementation simply pushes the client through the account-building process; support just helps clients with troubleshooting, but all departments refuse to help each other and justify it by saying 'they don't pay me enough for that.' -We have lost a lot of really great people who took their job seriously. This is due to the offices being super clique-y. From my understanding the California office is pretty bad, since there's less employees. I hate to say it, but I strongly believe that if you aren't in the 'inner circle,' they don't make the job as fun for you. On the up-side, I still speak to and love the people that have been fired or have quit LOL Advice to Management Promote from within rather than hire upper management from outside the company. If this company actually promoted from within, us employees would be happier and more encouraged. We would also know that the higher ups acknowledged our great work. Most importantly, start promoting the right people !!! I just wish HR would have hidden cameras or check everyone's computer, AIM, and Skype history... then they would realize what a mistake they have made by promoting those who just delegate work rather than take initiative and do it themselves. Seriously, more than half of my department just looks for jobs all day... that's how unhappy we all are. Right now, it's just a paycheck. I paste on that fake smile every morning and suck it up just so I don't lose my job and go broke.", "rating": 3, "pros": "-They emphasize culture. They literally have fired someone for not 'meshing well' with others, which is just a nice way of saying 'he didn't like to drink with his colleagues or play kickball on Tuesdays with the rest of the group.'", "cons": "-They emphasize culture. Yes, some people are cool, but many people abuse the socializing aspect. It's tough to see someone who gets paid the same (if not more than you) talk all day to their neighbor when you are putting in hours and hours of effort read: hours and hours of cold calling and watching your neighbor go on Facebook or watching your manager play Candy Crush.", "advice": "Promote from within rather than hire upper management from outside the company. If this company actually promoted from within, us employees would be happier and more encouraged. We would also know that the higher ups acknowledged our great work. Most importantly, start promoting the right people !!! I just wish HR would have hidden cameras or check everyone's computer, AIM, and Skype history... then they would realize what a mistake they have made by promoting those who just delegate work rather than take initiative and do it themselves. Seriously, more than half of my department just looks for jobs all day... that's how unhappy we all are. Right now, it's just a paycheck. I paste on that fake smile every morning and suck it up just so I don't lose my job and go broke."}, {"title": "Great for Young, Entry-Level Sales Reps", "text": "Pros Booker is a very cool place to work if you're a young (22 - 26) aspiring sales person looking to gain some experience selling in the trenches. They give you the opportunity within a few months to ramp up your own territory and take prospects from cold call to demonstration to close. The product itself is top-notch in most regards compared to it's competitors, so even a fresh college graduate will be able to close deals after being there for only a few months. The culture in the office is casual, yet competitive. It's not unheard of to see someone in a hoodie and jeans speaking with business owners on the phone and closing deals. Plasma TVs are strategically placed around the office and show sales rankings in real-time. Cons If you're a seasoned sales pro who's looking to take the next step in your sales career, be warned: Booker is probably not a place where you will be able to thrive. This means if you're 26+ and you have 1-3 years of sales experience, stay away. Even the most successful sales reps are still making well below what they could make elsewhere. Quota structure begins fresh every month, so there's no incentive for long-time sales associates to stay. This is truly SMB sales and you're dealing with non-responsive, non-business savvy decision makers on a daily basis. Building deep customer relationships is non-existant because once a deal is closed, there is no chance for re-occurring commissions or up-selling. For a platform that is subscription based, you would think that sales reps would be incentivized to build a book of business so they can reap re-occurring commissions as they nurture their accounts. Instead, reps are paid once on each account and obviously forget about that account the second they are signed up. With that said above, there is a gap in the company when it comes to Account Management. If the Sales Reps aren't nurturing accounts after they close, then who is? The only times accounts are managed is when there are issues and there is no structured way of keeping good relationships with clients that have been on. It's not unheard of to hear of accounts that have no been contacted in years due to the fact that the company is simply just hungry for more sales. Sales Managers in the middle levels are somewhat inexperienced, but are extremely driven and trying their best to build the sales team. I give them kudos for building a path for the sales teams without any to much guidance from upper management. Upper level sales management is almost non-existent and is a huge black eye in the sales organization. They create new quota structures and incentives, and then you're lucky if you hear from them for the rest of the month. The only time they communicate down to actual sales reps is when things are very good or very bad. I have yet to see upper level sales management (not mid level) involved in the sales process itself. Lastly, there is little to no room for movement within the company itself. If you're a highly successful sales rep, you're 100% stuck. Unless you want to become a sales manager (which is a totally different role in itself), the best hunters in the company usually wait around for something better or leave. There's no path to Enterprise Sales or any other Business Development for that matter. Advice to Management I recommend upper management reevaluates the hierarchy of the Sales Team. I question exactly what those at the top are exactly doing if they aren't actively nurturing the sales team. I understand today's sales teams must be data driven, but when you have an upper level sales manager who doesn't know the product as well as his most inexperienced reps, it shows. I also highly recommend that you create pathways to different sales opportunities within the company. Some of the best sales people on the floor could be helping the Enterprise effort/Biz Development effort in middle markets. I still can't understand how the company has 80+ small biz sales reps and only 1-2 Enterprise reps. Mid-Market? Non-existent. I understand the whole start-up atmosphere, but the company needs to begin to nurture their best reps into better positions where they can pursue their career--Or else they will do this elsewhere.", "rating": 5, "pros": "Booker is a very cool place to work if you're a young (22 - 26) aspiring sales person looking to gain some experience selling in the trenches. They give you the opportunity within a few months to ramp up your own territory and take prospects from cold call to demonstration to close.", "cons": "If you're a seasoned sales pro who's looking to take the next step in your sales career, be warned: Booker is probably not a place where you will be able to thrive. This means if you're 26+ and you have 1-3 years of sales experience, stay away.", "advice": "I recommend upper management reevaluates the hierarchy of the Sales Team. I question exactly what those at the top are exactly doing if they aren't actively nurturing the sales team. I understand today's sales teams must be data driven, but when you have an upper level sales manager who doesn't know the product as well as his most inexperienced reps, it shows."}, {"title": "Great company with a lot of problems", "text": "Pros Fun work environment (But that wear's off over time). Managers are great but communication is lacking. Cons Terrible communication from Corporate. System crashes often frustrating clients and distracting employees from their duties. Advice to Management Fix the system, provide upward mobility for your employees, recognize your employees hard work, stop changing the sales compensation plans, stop treating sales reps different from each other (There is a second class citizen of Sales Rep at this company).", "rating": 5, "pros": "Fun work environment (But that wear's off over time). Managers are great but communication is lacking.", "cons": "Terrible communication from Corporate. System crashes often frustrating clients and distracting employees from their duties.", "advice": "Fix the system, provide upward mobility for your employees, recognize your employees hard work, stop changing the sales compensation plans, stop treating sales reps different from each other (There is a second class citizen of Sales Rep at this company)."}, {"title": "Great starting Company in New York", "text": "Pros Very fun and energetic staff, including Upper Management. Lots of company outings, great atmosphere at work for the most part, and always staying up to date with our software and our competitors. The products actually work and are the best or equal to our competitors and is easy to work with. Even though the company is new in the software industry and among competitors, it's gaining headway FAST and is growing its team to reflect it. Cons Sometimes management could act more like management (mid level, especially). Product's foundation is shaky sometimes (as web based software can be), and needs to be updated NOT during the middle of the workweek so we don't disturb clients. Creates a PR issue when clients see this and get angry and take to Facebook or other outlets if there is slowness from updates. Seems to take it's investor's advice too strongly. The product makes money, and is easy to sell, so naturally, we want to get as many people on board with the product as possible. However, to support a growing number of clients, in order to train and support this now enormous clientele list, more support staff, implementation staff, and tech staff are needed to make sure that everything is handled that comes in from the very large sales team. Advice to Management Keep the company growing, but be weary of a few things. 1. How you treat your employees - If you want the best, you need to treat them like the best and pay them well, but I respect that you take on a lot of college grads to get them to work. Tech mostly needs to be paid top dollar so you can continue to have a stable and outstanding product. Average to sub par employees will give average to sub par results, and potentially hurt you in the long run. 2. Be fair to your clients and listen to them. Without them, we have nothing. 3. Keep up the positive attitude in the office. Everything your employees and management do reflects upon the company, including cold calling. 4. Don't only listen to your investors. As paramount as their investment was, putting that money into your product is a wiser choice than growing a sales team. Without product failures, we have the best product and people will want it without as much need for cold callers.", "rating": 5, "pros": "Very fun and energetic staff, including Upper Management. Lots of company outings, great atmosphere at work for the most part, and always staying up to date with our software and our competitors.", "cons": "Sometimes management could act more like management (mid level, especially).", "advice": "Keep the company growing, but be weary of a few things."}, {"title": "Great Culture", "text": "Pros The people are awesome. They are definitely the primary motivator keeping me here Cons I fear the culture is shifting to a more strict regime. It used to be more work hard/play hard, seems to be transitioning into more work less play.", "rating": 3, "pros": "The people are awesome. They are definitely the primary motivator keeping me here", "cons": "I fear the culture is shifting to a more strict regime. It used to be more work hard/play hard, seems to be transitioning into more work less play.", "advice": null}, {"title": "Awesome company in with Team Spirit", "text": "Pros - Team Spirit - Classy casual dress code - Work/ Life Balance - Laid back environment with no Micro Management Cons Located next to Century 21 department store which means a lot of tourist Advice to Management n/a", "rating": 5, "pros": "- Team Spirit", "cons": "Located next to Century 21 department store which means a lot of tourist", "advice": "n/a"}, {"title": "Great Place to work", "text": "Pros The greatest most diverse group of coworkers. Able to take ownership of work and be apart of a growing tech company. You are valued for your thoughts and ideas. Cons Little bumps in the road, but that's all apart of growing up. Advice to Management Let us become invested in the company with stock options in the future. Keep doing what you are doing though its working.", "rating": 5, "pros": "The greatest most diverse group of coworkers. Able to take ownership of work and be apart of a growing tech company. You are valued for your thoughts and ideas.", "cons": "Little bumps in the road, but that's all apart of growing up.", "advice": "Let us become invested in the company with stock options in the future. Keep doing what you are doing though its working."}, {"title": "Great company. But look elsewhere", "text": "Pros The product itself is actually fairly impressive, and towards the tail-end of my time here, the company was starting to gain some traction with major partnerships and deals (Hilton Hotels, integration with Yelp, etc. etc.). Furthermore, once you actually get prospects to show up to the demos, even if you give a sub-par demo, the program will certainly wow the client into signing up (I think maybe one demo wasn't impressed, and I think it was due to a financial situation). The location is also smack dab in the heart of Wall St. So for lunch, you'll be seeing a lot of high-power Wall St. execs, which is a great opportunity for networking for another job. Cons Good god where to begin. When I first found out what Booker was, I thought to myself \"Oh man, how cool! People would JUMP at the ability to have this in their salon or spa\". On day one you find out there's a whole industry of this kind of software. There are a million competitors out there, but as I mentioned above, this program is the so called \"Cadillac package\" of appointment software. Problem is, salon owners are so apathetic to what kind of software they're using, they think the software they bought in the 80's is still good for their business. Which leads to my next point. Prior to this job, I was indifferent to salon owners. After this job, I think it's physically impossible for me to be friends with a salon owner. These people are the rudest people you will ever have the displeasure of talking to. They have no concept of right or wrong (or even basic English for that matter). Every day, I had some uppity, white-trash salon owner telling me to go f*** myself. I once had a salon owner to tell me to \"go get cancer and never call back\". I know cold callers are annoying, but my god lady, all I did was waste 30 seconds of your time. The work environment is one giant clique. This is due to the fact that if an employee refers a friend who gets hired by Booker, the referrer gets a bonus. So everyone knows one another. I'm just the guy who found a posting online. A good number of people just viewed me as the \"outsider\". Even saying \"hi\" to some people would result in the inexplicable cold shoulder. Which is extremely bizarre for a company that is trying oh so hard for the \"nu-age-laidback-21st-century-startup\" company look. Briefly to jump back to my point of this saturated industry. During training you do receive information about how Booker stacks up to their closest competitors. The problem is, these guys update their software just as much as they do. So when someone tells you their software has some of the same features as yours through the latest update, you really don't know whether they're pulling your leg or not. Even better, sometimes someone will just throw a name out there you've never heard of, and you have no idea how your product compares to it. Asking for help from your superiors when you struggle is a joke. I asked my manager numerous times to listen in on my calls and see where I was going wrong. Problem is, I had the misfortune of having all the calls I called during this \"session\" go to voicemail. So the manager could offer no assistance, and when I asked if she could meet again tomorrow, she turned it into a whole group activity with the other Sales Associates (all of whom were not struggling). For me, the straw that broke the camel's back came when I asked my manager for new leads to call, these \"new leads\" were all leads that were either out of business, already clients of ours, or asked to be placed on the Do Not Contact list (in simpler terms, people we could not call). Prior to getting recycled leads, we would get leads that had no website, no phone numbers, no business names, and you'd go in assuming they were a business that was right for us. I think I spent at least half of my time there filtering through broken leads. Lastly, there's compensation. It's a base + commission type structure. I have less financial obligations then most of my peers, but I was always very confused how they were able to afford Manhattan's obscene rent prices, while working on this company's salary. Advice to Management When your employees ask for help. Actually give it to them.", "rating": 1, "pros": "The product itself is actually fairly impressive, and towards the tail-end of my time here, the company was starting to gain some traction with major partnerships and deals (Hilton Hotels, integration with Yelp, etc. etc.). Furthermore, once you actually get prospects to show up to the demos, even if you give a sub-par demo, the program will certainly wow the client into signing up (I think maybe one demo wasn't impressed, and I think it was due to a financial situation).", "cons": "Good god where to begin.", "advice": "When your employees ask for help. Actually give it to them."}, {"title": "A Company Lacking a Sense of Direction", "text": "Pros - Fairly young and energetic staff - Venerable management team - Snacks, games, and other activities are free perks - Ongoing review of your work and where you may improve Cons - It's simple a cold-call factory. You are expected to make roughly 80-100 calls/day with two to three hours of registered talk time. Because marketing efforts are not properly focused, the company simply purchases the names of spas and salons that have recently run a group deal to call. These businesses often have a negative experience with the group deal service and believe you to be soliciting for such a service when you call. There seems to be no strong correlation between an online booking service, such as Booker, and a spa or salon that has run a group deal, however the company continues to funnel these leads to the sales team to call with quite abysmal success. Leads that come from Marketing-related efforts only make up about 1-2% off your total leads to call. The starting salary and compensation plan are well-below industry average. A little over 30k for a starting Sales Associate plus a meager commission package. All-in-all, I recommend that you strongly consider you other opportunities before accepting an offer from Booker. There are a plethora of better experiences to be had in Irvine and NYC than what you will likely experience here. Advice to Management Develop a sense of why the company exists (similar to Apple) and your employee moral may begin to turnaround.", "rating": 3, "pros": "- Fairly young and energetic staff", "cons": "- It's simple a cold-call factory. You are expected to make roughly 80-100 calls/day with two to three hours of registered talk time. Because marketing efforts are not properly focused, the company simply purchases the names of spas and salons that have recently run a group deal to call. These businesses often have a negative experience with the group deal service and believe you to be soliciting for such a service when you call. There seems to be no strong correlation between an online booking service, such as Booker, and a spa or salon that has run a group deal, however the company continues to funnel these leads to the sales team to call with quite abysmal success. Leads that come from Marketing-related efforts only make up about 1-2% off your total leads to call.", "advice": "Develop a sense of why the company exists (similar to Apple) and your employee moral may begin to turnaround."}, {"title": "Great company!", "text": "Pros Fast growth, lots of opportunity, fun, relaxed, casual atmosphere. I love working here so far. Learning lots of new technology and rapidly innovating new features into the product. Cons There are some happy problems related to all the fast growth, for example we do not have processes in place for some things. But we are working on fixing that. Advice to Management Keep doing what you are doing and listening to your employees.", "rating": 5, "pros": "Fast growth, lots of opportunity, fun, relaxed, casual atmosphere. I love working here so far. Learning lots of new technology and rapidly innovating new features into the product.", "cons": "There are some happy problems related to all the fast growth, for example we do not have processes in place for some things. But we are working on fixing that.", "advice": "Keep doing what you are doing and listening to your employees."}, {"title": "Good company, if you maintain your momentum", "text": "Pros - Young, fun company, good people, high energy. I've worked with some amazing people here, and almost everyone is super excited to get up to work (and play) on a day to day basis - Great product. The Booker platform is really robust, and contains a great solution to really fit biz needs - Doing big things- it's a really exciting time to be here, with the recent series B investment (lots of eyeballs on Booker), other biz dev news and upcoming partnerships. It's easy to say that Booker is a company with a lot going for it, and its exciting to be apart of that - Fun perks and benefits - Work/life balance, 401k, Summer Fridays, Keg Fridays, etc, Fun Committee, Booker Cares, etc. It's definitely that cares & wants its employees to be part of the \"Booker\" family, not just clock in/out of each day Cons - Some people are not the most professional Many talk about each other, the minute they turn their backs- this is across all company levels. Hard to learn by example if the higher ups are not exemplary - Pay could be better..Some may not realize this if you're fresh out of college (and desperately pounding the pavement), but it's on the lower end when compared to other companies - Crazy goals across the board (sales & on boarding, client support). Under lots of pressure to sell, sell, sell & support team not always able to support that, especially if everyone in support gets moved to Implementation to support growing # of accounts. It's ridiculous when a signed account can't get in touch with their very booked out implementation coordinator over the next 2 weeks Advice to Management Reward your current employees to retain top talent; keep up the fun company culture; come say hi more often to everyone-- not just your \"favorite\" people", "rating": 3, "pros": "- Young, fun company, good people, high energy. I've worked with some amazing people here, and almost everyone is super excited to get up to work (and play) on a day to day basis", "cons": "- Some people are not the most professional Many talk about each other, the minute they turn their backs- this is across all company levels. Hard to learn by example if the higher ups are not exemplary", "advice": "Reward your current employees to retain top talent; keep up the fun company culture; come say hi more often to everyone-- not just your \"favorite\" people"}, {"title": "Most", "text": "Pros You work just as hard as you play. Since it's a fast growing start up there's a lot of opportunities for those who work at their max potential and have a strong desire to grow. Booker seems to love hiring from withing. Cons As Booker is a fast growing company is constantly changing. New people in everyday. However, not many leave which is a positive thing. Those who do not like or appreciate change may not do well in the environment on the long run. Advice to Management Do your best to retain the main composition of what you started. The positive ambiance and constant recognition to those who perform well only feed into the spectacular company you have always strive to build. Congrats!", "rating": 5, "pros": "You work just as hard as you play. Since it's a fast growing start up there's a lot of opportunities for those who work at their max potential and have a strong desire to grow. Booker seems to love hiring from withing.", "cons": "As Booker is a fast growing company is constantly changing. New people in everyday. However, not many leave which is a positive thing. Those who do not like or appreciate change may not do well in the environment on the long run.", "advice": "Do your best to retain the main composition of what you started. The positive ambiance and constant recognition to those who perform well only feed into the spectacular company you have always strive to build. Congrats!"}, {"title": "The VPs and Management have lost focus of what Booker/GramercyOne meant.", "text": "Pros This is a great place to spend about a year at right out of college. You can gain experience in Customer Service, Implementation or Sales and move on to play in the big leagues easily. Cons Management has its key players and the VPs feed into their drama. Too much is put on everyone's plates: Unreachable sales goals, 100+ accounts in Implementation, endless cases for Customer Success and a very unstable software for all to work with. The worst part might be that Bain Capital just approved Series B funding, every inch of the company is being watched. Advice to Management Do not feed into the drama. Do not speak about your colleagues and your employees in a gossiping manner. HR should be an asset, not an impediment- use them!", "rating": 3, "pros": "This is a great place to spend about a year at right out of college. You can gain experience in Customer Service, Implementation or Sales and move on to play in the big leagues easily.", "cons": "Management has its key players and the VPs feed into their drama. Too much is put on everyone's plates: Unreachable sales goals, 100+ accounts in Implementation, endless cases for Customer Success and a very unstable software for all to work with. The worst part might be that Bain Capital just approved Series B funding, every inch of the company is being watched.", "advice": "Do not feed into the drama. Do not speak about your colleagues and your employees in a gossiping manner. HR should be an asset, not an impediment- use them!"}, {"title": "Best Company to work for. I started here with a staff of 20 and watch it go to 200.", "text": "Pros The best management and infrastructure. Cons I work in a satellite office, and feel left out of important processes and changes. Advice to Management Do not change!", "rating": 5, "pros": "The best management and infrastructure.", "cons": "I work in a satellite office, and feel left out of important processes and changes.", "advice": "Do not change!"}, {"title": "Great Opportunity at a Growing Company", "text": "Pros true ownership over projects open communication with managers great work/life balance fun/creative atmosphere passionate/energetic group of people career growth opportunity Cons it's hard to say what i don't like - everything is pretty positive. but i guess if i had to pick one, it would be the fast company growth, specifically the number of new employees every day. the office becomes a bit louder and crowded. but more people = more ideas, so in the end it's easy to look past the initial 'annoyance'. Advice to Management continue listening to our ideas and keeping us in the loop on larger business ventures", "rating": 5, "pros": "true ownership over projects", "cons": "it's hard to say what i don't like - everything is pretty positive. but i guess if i had to pick one, it would be the fast company growth, specifically the number of new employees every day. the office becomes a bit louder and crowded. but more people = more ideas, so in the end it's easy to look past the initial 'annoyance'.", "advice": "continue listening to our ideas and keeping us in the loop on larger business ventures"}, {"title": "A young, fun, high energy place to work. They invented the phrase \"work hard play hard\" for this eclectic group.", "text": "Pros Wanting to get up and go to work everyday because you enjoy what you do and who you work with. The Friday keg is also a major pro. Cons We're a start-up, so we are all hands on deck most of the time. This is not the place for people that need to be micro managed or told what to do next.", "rating": 5, "pros": "Wanting to get up and go to work everyday because you enjoy what you do and who you work with. The Friday keg is also a major pro.", "cons": "We're a start-up, so we are all hands on deck most of the time. This is not the place for people that need to be micro managed or told what to do next.", "advice": null}, {"title": "High energy, fun, amazing place to work!", "text": "Pros Incredible culture with lots of energy and fun coworkers. Growing super fast, but executive team makes everyone feel integrated and aligned towards a common goal. Office atmosphere is awesome, ping pong, keg, putting green etc. Cons There's high expectations with lots of pressure to perform and exceed goals every month. Advice to Management Keep doing what you're doing.", "rating": 5, "pros": "Incredible culture with lots of energy and fun coworkers. Growing super fast, but executive team makes everyone feel integrated and aligned towards a common goal. Office atmosphere is awesome, ping pong, keg, putting green etc.", "cons": "There's high expectations with lots of pressure to perform and exceed goals every month.", "advice": "Keep doing what you're doing."}, {"title": "This is an awesome place to work as a recent college graduate.", "text": "Pros Very relaxed Environment, nice co-workers, casual attire, company is growing like crazy Cons My pay is OK, my job isn't the greatest Advice to Management You are doing great.", "rating": 5, "pros": "Very relaxed Environment, nice co-workers, casual attire, company is growing like crazy", "cons": "My pay is OK, my job isn't the greatest", "advice": "You are doing great."}, {"title": "Business Development Manager", "text": "Pros Innovative technology, fast growth, exciting industry Cons Rather US-centric mind-set, limited international growth opportunities", "rating": 5, "pros": "Innovative technology, fast growth, exciting industry", "cons": "Rather US-centric mind-set, limited international growth opportunities", "advice": null}, {"title": "Decent place to work but not if you want to move forward in your career", "text": "Pros Not a bad place to work staff friendly company growing Cons No wage rises apart from rate of inflation. No bonus. Management aren't very good at implementing change.", "rating": 3, "pros": "Not a bad place to work staff friendly company growing", "cons": "No wage rises apart from rate of inflation. No bonus. Management aren't very good at implementing change.", "advice": null}]