[{"title": "Great company - Great Benefits", "text": "Pros Great Company with great benefits, They give a lot to their employees. Cons Location. Nice office in Miami, but far from the rest of Dade and Broward county. Advice to Management Listen to your employees a little more.", "rating": 5, "pros": "Great Company with great benefits, They give a lot to their employees.", "cons": "Location. Nice office in Miami, but far from the rest of Dade and Broward county.", "advice": "Listen to your employees a little more."}, {"title": "Medical coordinator", "text": "Pros The organization is always searching for ways to improve its processes for internal and external clients. Cons Some managers discriminate against some employees by making exceptions to their closest peers while not to others who have the same rights. Advice to Management Value your good employees!", "rating": 5, "pros": "The organization is always searching for ways to improve its processes for internal and external clients.", "cons": "Some managers discriminate against some employees by making exceptions to their closest peers while not to others who have the same rights.", "advice": "Value your good employees!"}, {"title": "I love working here!", "text": "Pros Great work environment, great incentive plan, motivation every day!!! the company is very generous! Cons The health insurance product is one of the best in the world but is very expensive so its hard to sell.", "rating": 5, "pros": "Great work environment, great incentive plan, motivation every day!!! the company is very generous!", "cons": "The health insurance product is one of the best in the world but is very expensive so its hard to sell.", "advice": null}, {"title": "Not good at all", "text": "Pros would not recommend to jobseekers Cons management, distance, not care about employees as everything is agent centered", "rating": 3, "pros": "would not recommend to jobseekers", "cons": "management, distance, not care about employees as everything is agent centered", "advice": null}, {"title": "RGN", "text": "Pros Like helping and looking after residents in their own homes and have interest in Palliative Care Cons Lack of carers to care for vulnerable residents at home.", "rating": 3, "pros": "Like helping and looking after residents in their own homes and have interest in Palliative Care", "cons": "Lack of carers to care for vulnerable residents at home.", "advice": null}, {"title": "Medical Coordinator", "text": "Pros The largest International Insurance company. A market that attend to high premium individuals outside the US. to accessibility in utilizing the US for medical treatment. Cons From my years of experience in the healthcare business I did not find any cons with this company. their salaries are very competitive. Advice to Management Keep doing a great Job, wish that the local insurance company would treat their members like you do.", "rating": 5, "pros": "The largest International Insurance company. A market that attend to high premium individuals outside the US. to accessibility in utilizing the US for medical treatment.", "cons": "From my years of experience in the healthcare business I did not find any cons with this company. their salaries are very competitive.", "advice": "Keep doing a great Job, wish that the local insurance company would treat their members like you do."}, {"title": "Competitive benefits", "text": "Pros Great 401(k) plan, health insurance low option free for employee, life insurance paid by employeer with additional coverage available, long term disability and short term disability options available, reduced price gym membership Cons Tuition reimbursement minimum but it helps, company has partnership with private universities, offering reduced tuition which is a benefit. Advice to Management No comments", "rating": 5, "pros": "Great 401(k) plan, health insurance low option free for employee, life insurance paid by employeer with additional coverage available, long term disability and short term disability options available, reduced price gym membership", "cons": "Tuition reimbursement minimum but it helps, company has partnership with private universities, offering reduced tuition which is a benefit.", "advice": "No comments"}, {"title": "Business Analyst II", "text": "Pros Great working environment and camaraderie. Compelling vision into the future. Cons Ambivalent when it comes to bridge its expectations and reality. Advice to Management Improve the definition and the implementation of a global enterprise.", "rating": 5, "pros": "Great working environment and camaraderie. Compelling vision into the future.", "cons": "Ambivalent when it comes to bridge its expectations and reality.", "advice": "Improve the definition and the implementation of a global enterprise."}, {"title": "Finance Mgr", "text": "Pros Offers somewhat competitive benefits to employees Cons Inexperienced senior management team. Company undergoing too many changes, globally and locally. Unprofessional environment. Extremely high churn/turnover of staff. Low employee moral. Advice to Management Get your act together", "rating": 1, "pros": "Offers somewhat competitive benefits to employees", "cons": "Inexperienced senior management team. Company undergoing too many changes, globally and locally. Unprofessional environment. Extremely high churn/turnover of staff. Low employee moral.", "advice": "Get your act together"}, {"title": "Medical staff on Miami location are un license .", "text": "Pros Good benefits but they could provide better benefits to their employees. Cons Poor management in Miami they should a more diversified group of employees ,a high % of employees or managers are from Havana Cuba. Advice to Management Too many chiefs , not enough Indians , if you are looking to save on staff eliminate the excess managers , they have", "rating": 3, "pros": "Good benefits but they could provide better benefits to their employees.", "cons": "Poor management in Miami they should a more diversified group of employees ,a high % of employees or managers are from Havana Cuba.", "advice": "Too many chiefs , not enough Indians , if you are looking to save on staff eliminate the excess managers , they have"}, {"title": "Great place", "text": "Pros No stress \"in the air\" that most insurances have good benefits great people events and parties +++ employee appreciation and giveaways Cons normal drama of corporations (clicks) can be kind of hard to grow in the company even though they've made recent changes to promote within Advice to Management You guys are doing great. Keep up the good work and encouraging employees.", "rating": 5, "pros": "No stress \"in the air\" that most insurances have", "cons": "normal drama of corporations (clicks)", "advice": "You guys are doing great. Keep up the good work and encouraging employees."}, {"title": "Ok", "text": "Pros Great benefits. good people. security Cons No upward mobility. Lack of incentive Advice to Management Promote from within", "rating": 3, "pros": "Great benefits. good people. security", "cons": "No upward mobility. Lack of incentive", "advice": "Promote from within"}, {"title": "Love Working Here", "text": "Pros I love working at Bupa. I have been here for 4 years and I truly enjoy the work I do. My supervisor is excellent. The benefits they offer are great and they truly care about their employees. Cons Listen closely to your employees concerns", "rating": 5, "pros": "I love working at Bupa. I have been here for 4 years and I truly enjoy the work I do. My supervisor is excellent. The benefits they offer are great and they truly care about their employees.", "cons": "Listen closely to your employees concerns", "advice": null}, {"title": "Sr. Sales Officer", "text": "Pros Great work environment and great ethical values Cons The position is not secured, so you might get fired next morning. Every week new policy.", "rating": 5, "pros": "Great work environment and great ethical values", "cons": "The position is not secured, so you might get fired next morning.", "advice": null}, {"title": "Terrible!!!!!!", "text": "Pros Nothing. Not even the parking. That was a hassle too. Cons Everything. Especially the people. Elitists. Backstabbing, snitching, even witchcraft! Advice to Management Close down before somebody offs themselves or goes ballistic.", "rating": 1, "pros": "Nothing. Not even the parking. That was a hassle too.", "cons": "Everything. Especially the people. Elitists. Backstabbing, snitching, even witchcraft!", "advice": "Close down before somebody offs themselves or goes ballistic."}, {"title": "Word experience", "text": "Pros great working environment, managers, and co-works help you most of the time. Cons low salary and benefits. Lack of growth opportunities.", "rating": 3, "pros": "great working environment, managers, and co-works help you most of the time.", "cons": "low salary and benefits. Lack of growth opportunities.", "advice": null}, {"title": "Operations Manager", "text": "Pros The culture is about putting the customer first, new ideas are encouraged and talent is nurtured. The salary is great and the benefits are brilliant as well. Siginificant investment in personal development. A great company. Cons As the company moves through organizational change the ability to make decisions is limited. The company is moving to a central brain with regional implementation which takes some of the joy away from being a leader here. Advice to Management Keep empowering your employees, Give people in leadership roles the ability to affect change. Keep focusing on the people who work here, it makes a big impact to know that you support the frontline.", "rating": 5, "pros": "The culture is about putting the customer first, new ideas are encouraged and talent is nurtured. The salary is great and the benefits are brilliant as well. Siginificant investment in personal development. A great company.", "cons": "As the company moves through organizational change the ability to make decisions is limited. The company is moving to a central brain with regional implementation which takes some of the joy away from being a leader here.", "advice": "Keep empowering your employees, Give people in leadership roles the ability to affect change. Keep focusing on the people who work here, it makes a big impact to know that you support the frontline."}, {"title": "Good company to work for", "text": "Pros Good team spirit and cohesive work environment Cons Basic reward packages poor development of junior talent", "rating": 5, "pros": "Good team spirit and cohesive work environment", "cons": "Basic reward packages poor development of junior talent", "advice": null}, {"title": "Supervisor of Preauthorization", "text": "Pros Bupa is one of the leading health insurance companies in the world. It offers good training and cares about the employees. Salary is slightly above average. Working environment is excellent Cons As a typical UK company, new ideas are not so welcomed at Bupa. Decision making is a long process. Not much room left for the development of career planning", "rating": 5, "pros": "Bupa is one of the leading health insurance companies in the world. It offers good training and cares about the employees. Salary is slightly above average. Working environment is excellent", "cons": "As a typical UK company, new ideas are not so welcomed at Bupa. Decision making is a long process. Not much room left for the development of career planning", "advice": null}, {"title": "HQ - A place in flux", "text": "Pros It's going places and there are some fantastic people there. Cons It's going through lots of changes and these are causing unrest in what was known as a 'family' organization.", "rating": 3, "pros": "It's going places and there are some fantastic people there.", "cons": "It's going through lots of changes and these are causing unrest in what was known as a 'family' organization.", "advice": null}, {"title": "Digital", "text": "Pros Inspiring purpose, motivated teams and strong leadership team. Cons Typical characteristics of big corporate: slow, bureaucratic, heavily siloed. However new management have made big steps forward in transforming old stale culture.", "rating": 5, "pros": "Inspiring purpose, motivated teams and strong leadership team.", "cons": "Typical characteristics of big corporate: slow, bureaucratic, heavily siloed. However new management have made big steps forward in transforming old stale culture.", "advice": null}, {"title": "Lessons from a bad experience", "text": "Pros Some great co-workers, both personally and professionally. That was the only good thing that kept me going. Cons Top management just does not care about the people that work here. Promises to help solve structural problems are just lip service; nothing is actually done to force improvement. No work life balance, nor any attempt to have some resemblance of it. Advice to Management I cannot believe truly positive change can be accomplished with the top management team under which I worked.", "rating": 1, "pros": "Some great co-workers, both personally and professionally. That was the only good thing that kept me going.", "cons": "Top management just does not care about the people that work here. Promises to help solve structural problems are just lip service; nothing is actually done to force improvement.", "advice": "I cannot believe truly positive change can be accomplished with the top management team under which I worked."}, {"title": "good company", "text": "Pros Great benefits, employee perks and gives back to the community. Many offices worldwide and adapts to multiple cultures. Cons Processes are always changing and management has a large turn around", "rating": 5, "pros": "Great benefits, employee perks and gives back to the community. Many offices worldwide and adapts to multiple cultures.", "cons": "Processes are always changing and management has a large turn around", "advice": null}, {"title": "Sales", "text": "Pros Leading health insurance company in a very competitive market both in Latin America as well as the rest of the world. Cons Very limited communication throughout the different departments and very bureaucratic. Service levels (back then) were constantly changing and although they had the right intentions, the end results where not always the most successful! Advice to Management Communicate and motivate!", "rating": 3, "pros": "Leading health insurance company in a very competitive market both in Latin America as well as the rest of the world.", "cons": "Very limited communication throughout the different departments and very bureaucratic. Service levels (back then) were constantly changing and although they had the right intentions, the end results where not always the most successful!", "advice": "Communicate and motivate!"}, {"title": "Potencial", "text": "Pros Good company, Benefits and teams Cons Management lack of knowledge is delaying company potential to be excellent ZERO Motivation Good entry level company poor understanding of local culture for employees Advice to Management Evaluated who you have doing operations", "rating": 1, "pros": "Good company, Benefits and teams", "cons": "Management lack of knowledge is delaying company potential to be excellent", "advice": "Evaluated who you have doing operations"}, {"title": "Not good", "text": "Pros Interesting people and cultural mix Moving to a nice new location For the time being, still leader in its business Cons Lack of credible strategy that is the reason for a shrinking business No commitment with the business from HQ in UK", "rating": 1, "pros": "Interesting people and cultural mix", "cons": "Lack of credible strategy that is the reason for a shrinking business", "advice": null}, {"title": "Agile is not the answer for everything. Get skilled people first.", "text": "Pros Work life balance. Good office location. Health insurance discount. Free coffees. Cons Bad culture in tech team. Everything is slow. Simple tasks may take a few weeks or even months. Lack of enthusiasm of technology. Poor leadership of the digital team. Talking big but act small. Careless and clueless about what people's skills are and lost some great people because of that. No real required tech/skills from the leadership, so a lot of times they will just bad decisions. Advice to Management Do not play company politics. Culture of the tech team needs to change. Agile is not the answer for everything. Hire the right people first.", "rating": 3, "pros": "Work life balance. Good office location. Health insurance discount. Free coffees.", "cons": "Bad culture in tech team. Everything is slow. Simple tasks may take a few weeks or even months. Lack of enthusiasm of technology.", "advice": "Do not play company politics. Culture of the tech team needs to change. Agile is not the answer for everything. Hire the right people first."}, {"title": "Relationship Manager", "text": "Pros Amazing place to work. Great people. Cons Share with your employees new decision that will be taken. We are always the last people to know anything. Advice to Management Keep up the good work", "rating": 5, "pros": "Amazing place to work. Great people.", "cons": "Share with your employees new decision that will be taken. We are always the last people to know anything.", "advice": "Keep up the good work"}, {"title": "Legal Advisor", "text": "Pros Good work life balance and friendly team. Cons Not very clear guidelines for career progression.", "rating": 3, "pros": "Good work life balance and friendly team.", "cons": "Not very clear guidelines for career progression.", "advice": null}, {"title": "Great purpose but unclear strategy and execution", "text": "Pros Purpose led organisation, diverse workforce, global business, strong brand at least in some markets Cons Lack of cohesive strategy, poor execution of change and transformation, revolving door of senior management creates high degree of uncertainty Advice to Management Less is more, greater execution strength with better balance between local autonomy and better group strategic steering", "rating": 3, "pros": "Purpose led organisation, diverse workforce, global business, strong brand at least in some markets", "cons": "Lack of cohesive strategy, poor execution of change and transformation, revolving door of senior management creates high degree of uncertainty", "advice": "Less is more, greater execution strength with better balance between local autonomy and better group strategic steering"}, {"title": "A lot of responsibility for minimum wage", "text": "Pros No one complains if you sit & talk to the residents, you're allowed to laugh, when you work a full day you get an award winning cooked lunch. From housekeeping to senior nurse you're given....and expected to give....respect. You're all important to the smooth running, the only difference is more qualified the higher rate per hour. They'll help you with any qualification you want to get. Cons Like most places nowadays, when you get a large influx of under 30s you get people who want money for nothing, who take the massive legal responsibility of care homes with a pinch of salt & think well I've done my area why should I help on theirs. Advice to Management Keep a closer eye on the young ones, they have grown up with an it's all about me attitude, a sad by product of the times", "rating": 5, "pros": "No one complains if you sit & talk to the residents, you're allowed to laugh, when you work a full day you get an award winning cooked lunch. From housekeeping to senior nurse you're given....and expected to give....respect. You're all important to the smooth running, the only difference is more qualified the higher rate per hour. They'll help you with any qualification you want to get.", "cons": "Like most places nowadays, when you get a large influx of under 30s you get people who want money for nothing, who take the massive legal responsibility of care homes with a pinch of salt & think well I've done my area why should I help on theirs.", "advice": "Keep a closer eye on the young ones, they have grown up with an it's all about me attitude, a sad by product of the times"}, {"title": "Great company to work for with amazing people.", "text": "Pros - People - On site gym - Free fruit - Promotes health a well being - Competitive salary upon entry - Career progression encouraged Cons - Internal progression has pay limitations - Disjointed departments (Silo working) - Lack of qualification/training offered for specific roles which require them Advice to Management Invest in your people to ensure they stay with you.", "rating": 5, "pros": "- People", "cons": "- Internal progression has pay limitations", "advice": "Invest in your people to ensure they stay with you."}, {"title": "Poor work life balance", "text": "Pros Discounted health insurance. At Bupa you work for a company who truly does value it's customers wholeheartedly, and has a fantastic reputation in the industry. Cons poor work life balance, poor sales incentive structure, poor salary for amount of work to be completed and hours expected. The business values the customer so much that it affects the value of the retail staff. Advice to Management Show your staff you care by encouraging them to develop and want more for themselves, staff should feel supported if they want to apply for higher positions within the business and undertake development programmes, not be put down and told they are not to apply. Bupa frequently loses good staff members due to this fact alone and will sadly continue to see this trend increase as a result.", "rating": 3, "pros": "Discounted health insurance. At Bupa you work for a company who truly does value it's customers wholeheartedly, and has a fantastic reputation in the industry.", "cons": "poor work life balance, poor sales incentive structure, poor salary for amount of work to be completed and hours expected. The business values the customer so much that it affects the value of the retail staff.", "advice": "Show your staff you care by encouraging them to develop and want more for themselves, staff should feel supported if they want to apply for higher positions within the business and undertake development programmes, not be put down and told they are not to apply. Bupa frequently loses good staff members due to this fact alone and will sadly continue to see this trend increase as a result."}, {"title": "Development coach, human resourses specialist.", "text": "Pros Good benefits, great working hours. Cons Terrible leadership, terrible communications. Lack of vision Advice to Management Communicate better.", "rating": 3, "pros": "Good benefits, great working hours.", "cons": "Terrible leadership, terrible communications. Lack of vision", "advice": "Communicate better."}, {"title": "good company", "text": "Pros good people, growth opportunities learning and development. Cons work life balance two low Advice to Management good work", "rating": 3, "pros": "good people, growth opportunities learning and development.", "cons": "work life balance two low", "advice": "good work"}, {"title": "Avoid at all costs worst company I've ever stupidly worked for", "text": "Pros Silly games and the friendly people. Don't get me wrong the trainers are lovely and give you as much as they can before you go live on the department floor. Cons Sales is sales you have to perform no doubt but it takes time to build a pipeline. Whatever you do never leave your job to work for bupa. If you don't perform straight away you will end up without a job and they won't care if you have kids, mortgage or anything to pay for. There are a couple of managers on the department that treat you like a number from day one. You have to pass 2 calls perfectly after training and if you don't you get fired on the spot. If you don't get sales in the first week you get fired and if they don't like you well yeh they will find an excuse to fire you. The coaches on they department instead of supporting you as you would expect in any job give you awful feedback and grass you up to the managers if you make mistakes and instead of positive criticism and trying to help you better yourself like any normal company they put you down and make you feel so anxious and unconfident you are set up to fail. I've seen people in floods of tears due to the lack of support and being put down making overall moral poor. Bupa really don't care about anyone but there ego. The behaviour of people in authority is discusting and some coaches are on a power trip. They literally employ people off looks and take in 20 at a time then get rid of the ones who they don't like personally or haven't sold enough in 2 weeks. One big revolving door. Enjoy a nice review of yourself not so powerful now are we! Advice to Management Treat people with a bit more respect, support is minimal if non at all and you can't wait to just get rid of people you can't be bothered helping. Very old school managing skills. If anyone applies don't say I didn't warn you.", "rating": 1, "pros": "Silly games and the friendly people. Don't get me wrong the trainers are lovely and give you as much as they can before you go live on the department floor.", "cons": "Sales is sales you have to perform no doubt but it takes time to build a pipeline. Whatever you do never leave your job to work for bupa. If you don't perform straight away you will end up without a job and they won't care if you have kids, mortgage or anything to pay for. There are a couple of managers on the department that treat you like a number from day one. You have to pass 2 calls perfectly after training and if you don't you get fired on the spot. If you don't get sales in the first week you get fired and if they don't like you well yeh they will find an excuse to fire you. The coaches on they department instead of supporting you as you would expect in any job give you awful feedback and grass you up to the managers if you make mistakes and instead of positive criticism and trying to help you better yourself like any normal company they put you down and make you feel so anxious and unconfident you are set up to fail. I've seen people in floods of tears due to the lack of support and being put down making overall moral poor. Bupa really don't care about anyone but there ego.", "advice": "Treat people with a bit more respect, support is minimal if non at all and you can't wait to just get rid of people you can't be bothered helping. Very old school managing skills. If anyone applies don't say I didn't warn you."}, {"title": "Member services", "text": "Pros Can’t think of any, free coffe? Cons Racist, unfair, favouritism. Manager constantly shopping online on their phone poor management. Unfair dismissals Advice to Management Train managers again, poor management unprofessional.", "rating": 1, "pros": "Can’t think of any, free coffe?", "cons": "Racist, unfair, favouritism. Manager constantly shopping online on their phone poor management. Unfair dismissals", "advice": "Train managers again, poor management unprofessional."}, {"title": "Brand Lead", "text": "Pros It's a great place to work Cons Limited career opportunities which is hard to progress Advice to Management No advice", "rating": 5, "pros": "It's a great place to work", "cons": "Limited career opportunities which is hard to progress", "advice": "No advice"}, {"title": "Integrity void", "text": "Pros Standard working hours. Great product Cons Some staff have no work ethic , bullying and back stabbing is rife team managers are weak and the latest senior management drafted in from salford is really poor no knowledge no drive ..exec are only bothered about money but say its about customers even when they wont invest in basic rqmnts like staff and systems. Staff moan about everything yet wont leave and get a job they like because its easier to stay and do nothing because mgrs are afraid to manage them and when previous managers did stand upto to them bupa didnt support them. Snr team in salford are all talk and no substance Advice to Management Manage under performance . Ensure ALL managers are managed and that favourites who get away with poor performance are addressed", "rating": 1, "pros": "Standard working hours. Great product", "cons": "Some staff have no work ethic , bullying and back stabbing is rife team managers are weak and the latest senior management drafted in from salford is really poor no knowledge no drive ..exec are only bothered about money but say its about customers even when they wont invest in basic rqmnts like staff and systems. Staff moan about everything yet wont leave and get a job they like because its easier to stay and do nothing because mgrs are afraid to manage them and when previous managers did stand upto to them bupa didnt support them. Snr team in salford are all talk and no substance", "advice": "Manage under performance . Ensure ALL managers are managed and that favourites who get away with poor performance are addressed"}, {"title": "Loved my Job", "text": "Pros Chances of overtime, some really good staff, was fun being able to dress up for Halloween, Easter etc. Residents loved it and had a laugh at us. Cons Bullying, very bad GM's, rewards bullying with promotions, expecting staff to do the work of two people resulting in a lot of staff injuries. Good staff are pushed out and not so good staff get treated well. Abuse of residents at times as well with nothing being done by management . Advice to Management So much advice, too little space. Get rid of the bullies and bad staff (including GM's), hold on to the good ones. Treat staff well and they will be happy to be there without stress and threats. Put residents first before money. Where i use to work needs so many things changed to make it a better place. I would love to work there again too if given the opportunity, loved the residents and my job, apart from the stuff that drove me out. It could be such a great place for residents too, instead of them just staring at walls. If only someone would just listen.", "rating": 3, "pros": "Chances of overtime, some really good staff, was fun being able to dress up for Halloween, Easter etc. Residents loved it and had a laugh at us.", "cons": "Bullying, very bad GM's, rewards bullying with promotions, expecting staff to do the work of two people resulting in a lot of staff injuries. Good staff are pushed out and not so good staff get treated well. Abuse of residents at times as well with nothing being done by management .", "advice": "So much advice, too little space. Get rid of the bullies and bad staff (including GM's), hold on to the good ones. Treat staff well and they will be happy to be there without stress and threats. Put residents first before money. Where i use to work needs so many things changed to make it a better place. I would love to work there again too if given the opportunity, loved the residents and my job, apart from the stuff that drove me out. It could be such a great place for residents too, instead of them just staring at walls. If only someone would just listen."}, {"title": "Okay", "text": "Pros Very good induction, you work with some very experienced staff, good amount of hours and reasonable break times. Cons Being a new and inexperienced in the role, I came across some horrid colleagues who constantly told me, “Care work is not for everyone”. I wanted to learn the role well but felt like nobody wanted to give me the chance. And many people told me different things on each resident, what food I gave and how they should be fed. Other colleagues were constantly watching me like a hawk waiting for me to make a mistake. Tell me I’m doing alright and then gossip about me to the Manager. I didn’t really feel like a care assistant. I felt like I was just bossing residents around and institutionalised them. Advice to Management If you want a decent employee, then treat them like an employee", "rating": 3, "pros": "Very good induction, you work with some very experienced staff, good amount of hours and reasonable break times.", "cons": "Being a new and inexperienced in the role, I came across some horrid colleagues who constantly told me, “Care work is not for everyone”. I wanted to learn the role well but felt like nobody wanted to give me the chance. And many people told me different things on each resident, what food I gave and how they should be fed. Other colleagues were constantly watching me like a hawk waiting for me to make a mistake. Tell me I’m doing alright and then gossip about me to the Manager.", "advice": "If you want a decent employee, then treat them like an employee"}, {"title": "Not as good as I've thought", "text": "Pros Nice work environment and colleagues; well-known business; flexibility; free gym, discounted cafe and discounted canteen in all the main office. Good direct manager and team-mates Cons Poor leadership and lack of accountability is widespread within the company, from Bupa Executive Team down to manager level; slow decision making and decisions change too often (see latest office move news); health insurance for employees is worse than health insurance you get when you work in a different firm that has Bupa as vendor. Advice to Management Take better care of your employees, make people accountable for their mistakes at work,", "rating": 3, "pros": "Nice work environment and colleagues; well-known business; flexibility; free gym, discounted cafe and discounted canteen in all the main office.", "cons": "Poor leadership and lack of accountability is widespread within the company, from Bupa Executive Team down to manager level; slow decision making and decisions change too often (see latest office move news); health insurance for employees is worse than health insurance you get when you work in a different firm that has Bupa as vendor.", "advice": "Take better care of your employees, make people accountable for their mistakes at work,"}, {"title": "Anonymous", "text": "Pros - Rare to come across an employer that places great emphasis on work life balance - Supportive management. - Opportunity for growth - Genuine team who collectively want to make a difference Cons - Salary not comparative in market - Performance Review Bonus is hard to get in front line positions. - Unequal spread of workload amongst team, not reimbursed for difference in load. Advice to Management - Continue to breed aearning culture through coaching and training - Encourage work life balance across all streams at Bupa. Some departments seem to get it whilst some departments are still quite old school around working styles/flexibility - Ensure pay is comparative to external market and work loads.", "rating": 5, "pros": "- Rare to come across an employer that places great emphasis on work life balance", "cons": "- Salary not comparative in market", "advice": "- Continue to breed aearning culture through coaching and training"}, {"title": "Finally found a company with work/life balance that cares for its employees", "text": "Pros *Really friendly, open, supportive environment *Practices what it preaches, focused on employee's health & wellbeing with various wellness initiatives available *A true work/life balance with flexible work hours and work from home *Plenty of growth opportunities throughout the business Cons *Salaries are fair but could be more competitive, however the positive work culture helps make up for that", "rating": 5, "pros": "*Really friendly, open, supportive environment", "cons": "*Salaries are fair but could be more competitive, however the positive work culture helps make up for that", "advice": null}, {"title": "Excellent ethical company", "text": "Pros support and encourage what they preach - longer, healthier, happier lives. great work life balance, supportive culture with intelligent and respectful people. Cons none to date as all is working well Advice to Management keep up the great work", "rating": 5, "pros": "support and encourage what they preach - longer, healthier, happier lives. great work life balance, supportive culture with intelligent and respectful people.", "cons": "none to date as all is working well", "advice": "keep up the great work"}, {"title": "Working in Bupa", "text": "Pros Nice and kindly Good working environment Cons Some procedure or problem solve a bit slow Advice to Management Get more staff working in Bupa", "rating": 5, "pros": "Nice and kindly", "cons": "Some procedure or problem solve a bit slow", "advice": "Get more staff working in Bupa"}, {"title": "Fantastic Global Company", "text": "Pros Global - Working closely with different teams and people across our regional offices makes my job more interesting and challenging A company that genuinely cares for its customers and staff Relaxed atmosphere, non-hierarchical, flexible working, good salary and benefits Cons Being a global insurance company can have it's complexities meaning not everything is straight forward and can sometimes prove challenging Competitive market to be in", "rating": 5, "pros": "Global - Working closely with different teams and people across our regional offices makes my job more interesting and challenging", "cons": "Being a global insurance company can have it's complexities meaning not everything is straight forward and can sometimes prove challenging", "advice": null}, {"title": "Bupa Global", "text": "Pros Flexible work hours and great direct managers. Cons Poor leadership from executive management and lack of communication overall.", "rating": 3, "pros": "Flexible work hours and great direct managers.", "cons": "Poor leadership from executive management and lack of communication overall.", "advice": null}, {"title": "Carer", "text": "Pros Supporting residents with activities and families Cons Long hours and not many staff Advice to Management Communication, visit homes and action staff comments", "rating": 5, "pros": "Supporting residents with activities and families", "cons": "Long hours and not many staff", "advice": "Communication, visit homes and action staff comments"}, {"title": "Eastablished Bullying by General/Regional Manager", "text": "Pros Had the pleasure to work with staff from outside the home such as Admiral Nurses Cons * Bullying allowed by GM & from GM; they are always believed * Lying accepted by GM- such as home managers falsely completing paperwork * residents illegally detailed in the home- not covered by DoLs; over 98% of all the residents * high complaints from family- New GM allowed old staff back to re-create these again * Staff allowed to blaintently lie during investigations; encouraged by GM to get the results she wants * Blatent special treatment and favouritism by the GM- old friends network * Tokanistic attitude towards dementia care- Managwr, GM out of their depth/ no clue about it. * Unqualified staff running specialist homes with no specialist knowledge Advice to Management Listen to staff when they are saying the are being billed by GM- it’s not just ‘ground floor’ staff who get bullied. If managers work extra hours- pay they if they can’t take the time back", "rating": 1, "pros": "Had the pleasure to work with staff from outside the home such as Admiral Nurses", "cons": "* Bullying allowed by GM & from GM; they are always believed", "advice": "Listen to staff when they are saying the are being billed by GM- it’s not just ‘ground floor’ staff who get bullied."}, {"title": "Kitchen Assistant", "text": "Pros team work, organised, friendly, supportive Cons fast paced, dirty, long shifts, demanding", "rating": 5, "pros": "team work, organised, friendly, supportive", "cons": "fast paced, dirty, long shifts, demanding", "advice": null}, {"title": "Stuck in the past and don't practice what they preach", "text": "Pros -Lovely people: great, friendly, down to earth members of staff who don't take themselves too seriously. Everyone is approachable. -Care about your health: on-site gym, health insurance, flu vaccinations, counselling service etc -Relatively well paid Cons - Technology and processes are in the dark ages, no investment or innovation - Lack of clear career progression and it's hard to know who to speak to about this - No management training i.e. managers don't know how to look after people - The offices are horrible! Although they're building a new office ready next year. Advice to Management Think about staff and what they're getting out of work, not just what they're delivering for you. People aren't machines who just churn out work.", "rating": 3, "pros": "-Lovely people: great, friendly, down to earth members of staff who don't take themselves too seriously. Everyone is approachable.", "cons": "- Technology and processes are in the dark ages, no investment or innovation", "advice": "Think about staff and what they're getting out of work, not just what they're delivering for you. People aren't machines who just churn out work."}, {"title": "Changing all the times", "text": "Pros Both MPF scheme and ORSO scheme open for employees to choose. ORSO scheme cover 10% employer contribution and optional for employee contribution Cons Structure changing all the times, management keep changing, not transparent enough, treatment and opportunities to local and non local employees are not the same, unfair treatment Advice to Management Transparent and fairness", "rating": 3, "pros": "Both MPF scheme and ORSO scheme open for employees to choose. ORSO scheme cover 10% employer contribution and optional for employee contribution", "cons": "Structure changing all the times, management keep changing, not transparent enough, treatment and opportunities to local and non local employees are not the same, unfair treatment", "advice": "Transparent and fairness"}, {"title": "Great enviorment but very weak in Riyadh", "text": "Pros - Great environment - Good working hours Cons - Very weak sales & marketing in Riyadh (almost dead) due to the HQ being in Jeddah", "rating": 3, "pros": "- Great environment", "cons": "- Very weak sales & marketing in Riyadh (almost dead) due to the HQ being in Jeddah", "advice": null}, {"title": "Healthcare consultant", "text": "Pros great people, nice office and flexibility Cons scripts and commission Lack sales team incentives and motivation Advice to Management good management", "rating": 5, "pros": "great people, nice office and flexibility", "cons": "scripts and commission", "advice": "good management"}, {"title": "Healthcare Consultant - New Business", "text": "Pros The canteen food is really good, that's about it. The health insurance benefit doesn't start until you pass probations Cons Awful, stressful, shockingly managed sales department. The company is not what it makes itself out to be. They will get rid of you without any notice or logical reason. Advice to Management Please change your ways. The style is so unethical, unfair and demotivating.", "rating": 1, "pros": "The canteen food is really good, that's about it. The health insurance benefit doesn't start until you pass probations", "cons": "Awful, stressful, shockingly managed sales department. The company is not what it makes itself out to be. They will get rid of you without any notice or logical reason.", "advice": "Please change your ways. The style is so unethical, unfair and demotivating."}, {"title": "BUPA Benefits", "text": "Pros Good bonus offers and staff points scheme - where you can win holidays to international destinations for just turning up doing your job well!! Cons Sucks the life out of you - trying to sell cover back to aged individuals who simply dont want it. Advice to Management More life is to be given to staff - food choice in the sedentary lifestyle needs work - when you work for a health ambassador - the choices you give to staff have to carry that value through and through.", "rating": 3, "pros": "Good bonus offers and staff points scheme - where you can win holidays to international destinations for just turning up doing your job well!!", "cons": "Sucks the life out of you - trying to sell cover back to aged individuals who simply dont want it.", "advice": "More life is to be given to staff - food choice in the sedentary lifestyle needs work - when you work for a health ambassador - the choices you give to staff have to carry that value through and through."}, {"title": "Old Style Management", "text": "Pros Talk about all the great things that they are developing Cons Still waiting for them to action them", "rating": 1, "pros": "Talk about all the great things that they are developing", "cons": "Still waiting for them to action them", "advice": null}, {"title": "Call centre worker", "text": "Pros The training in 2016 was extensive and in-depth. Rotating roster Good pay rate Cons Breach staff privacy Unsupportive and discriminative management. Agressive HR staff The centres atmosphere now creates an unwelcome workspace for staff Advice to Management Need a more honest and open attitude instead of discriminating staff with medical issues. When issuess have been raised, need to follow through correctly and accordingly to resolve those issues", "rating": 1, "pros": "The training in 2016 was extensive and in-depth.", "cons": "Breach staff privacy", "advice": "Need a more honest and open attitude instead of discriminating staff with medical issues. When issuess have been raised, need to follow through correctly and accordingly to resolve those issues"}, {"title": "Manager", "text": "Pros None at all what so ever Cons Everything. Not a nice place Advice to Management Get a real job", "rating": 1, "pros": "None at all what so ever", "cons": "Everything. Not a nice place", "advice": "Get a real job"}, {"title": "Bad place to work", "text": "Pros Induction training, pay rate, nothing else Cons low staff morale,unclean, a shambles, no organisation Advice to Management R.E nursing and residential home I don't know what anyone can do to sort it out the staffing levels and rate of staff leaving is horrendous. Not clean, food quality poor, care standards poor, no shift organisation , relatives complaining ( I can see why)", "rating": 1, "pros": "Induction training, pay rate, nothing else", "cons": "low staff morale,unclean, a shambles, no organisation", "advice": "R.E nursing and residential home"}, {"title": "About the experience", "text": "Pros I help the floor employee and advisor to understand how the insurance of Maxbupa works Cons Everyday is a new challenge & I like to accept it. Advice to Management Kindly go through my CV", "rating": 5, "pros": "I help the floor employee and advisor to understand how the insurance of Maxbupa works", "cons": "Everyday is a new challenge & I like to accept it.", "advice": "Kindly go through my CV"}, {"title": "On the whole a great organisation.", "text": "Pros The purpose - it’s great going to work every day knowing you are looking after some of the most vulnerable people in the community. Cons Technology! They have not kept up to date with technology and are now having to try and play catch up. Advice to Management N/-", "rating": 5, "pros": "The purpose - it’s great going to work every day knowing you are looking after some of the most vulnerable people in the community.", "cons": "Technology! They have not kept up to date with technology and are now having to try and play catch up.", "advice": "N/-"}, {"title": "Ridiculous, understaffed, exasperating and laborious", "text": "Pros Working with some of the best people I have ever known. Exceptionally diligent and meticulous people. Cons Constantly calling for overtime, but refusing to hire new staff. Constant cutbacks on essentials (such as wipes, soap and gloves). Complete misuse of funds (using over £2000 for decorative ornaments for use in gardens, but limiting units' consumption of food and fizzy juice per day) Ineffective cost-management with procurement (meaning a high volume of meats bought in are found to be spoiled). Constant criticism of work done in units and work not done in units, with no assistance given to help units rectify problems. Poor overall managerial leadership (told carers that we \"know where the gate is\" when voicing concerns and issues). Advice to Management Without the carers, seniors and nurses, you wouldn't have a job. We are important. We also spend most of our daily lives in the workplace - we know what we need to make the unit better day-by-day, instead of the little projects thought up on whims.", "rating": 1, "pros": "Working with some of the best people I have ever known. Exceptionally diligent and meticulous people.", "cons": "Constantly calling for overtime, but refusing to hire new staff.", "advice": "Without the carers, seniors and nurses, you wouldn't have a job. We are important. We also spend most of our daily lives in the workplace - we know what we need to make the unit better day-by-day, instead of the little projects thought up on whims."}, {"title": "Worrying", "text": "Pros Ok so management only higher were great at helping you team managers were nasty but really who would say anything like being seen as a snitch on probation higher management need to see that advisors are miserable more than they know , but when we were asked no point or dare to say how it really is Cons Coaches on power trips make you feel useless Advice to Management A lot goes on that you do not know don't say if nobody speaks up because code of office is you never speak up", "rating": 1, "pros": "Ok so management only higher were great at helping you team managers were nasty but really who would say anything like being seen as a snitch on probation higher management need to see that advisors are miserable more than they know , but when we were asked no point or dare to say how it really is", "cons": "Coaches on power trips make you feel useless", "advice": "A lot goes on that you do not know don't say if nobody speaks up because code of office is you never speak up"}, {"title": "Member Services", "text": "Pros Good pay and private medical insurance. Cons Poor communication and management, bad processes", "rating": 3, "pros": "Good pay and private medical insurance.", "cons": "Poor communication and management, bad processes", "advice": null}, {"title": "Not reccomended", "text": "Pros There are non at all Cons Poor pay, staffing, management, facilities, food Advice to Management Start over from the begining", "rating": 1, "pros": "There are non at all", "cons": "Poor pay, staffing, management, facilities, food", "advice": "Start over from the begining"}, {"title": "Great people, limited development opportunity", "text": "Pros Good experience and professional qualification support. Cons There's limited opportunity for career progression", "rating": 3, "pros": "Good experience and professional qualification support.", "cons": "There's limited opportunity for career progression", "advice": null}, {"title": "They have a long way to go...", "text": "Pros Made some good friendships Health care benefits Flexible work hours Cons Very cliquish culture Unqualified senior management Very less pay No proper process or infrastructure", "rating": 1, "pros": "Made some good friendships", "cons": "Very cliquish culture", "advice": null}, {"title": "No real development structure for employees", "text": "Pros It's a warm and friendly environment, with great employee benefits. They have many celebrations throughout the year and great incentives for those in the sales department. Cons Working for such a large organisation it was difficult to progress, there was no clear development structure and so unless you wanted to side-step into another role within the business you are almost confined to working in the same role.", "rating": 3, "pros": "It's a warm and friendly environment, with great employee benefits. They have many celebrations throughout the year and great incentives for those in the sales department.", "cons": "Working for such a large organisation it was difficult to progress, there was no clear development structure and so unless you wanted to side-step into another role within the business you are almost confined to working in the same role.", "advice": null}, {"title": "Great training", "text": "Pros Great training, great location, great team Cons Poor management, Long Hours, Not enough support. Advice to Management Learn how to manage", "rating": 3, "pros": "Great training, great location, great team", "cons": "Poor management, Long Hours, Not enough support.", "advice": "Learn how to manage"}, {"title": "Senior management are arrogant, unsupportive and task orientated.", "text": "Pros Im struggling right now to think of any pros. Cons Staff are spoken to in an appauling manner. Staff turnover is high. Registered Nurses reduced to tears by upper management. Advice to Management My advice to management is to get off their high horses and actually spend time on the units. Instead of being clipboard princesse's, try and look and observe the good work the undervalued carers and Nurses do on a daily basis. Try not to be critical all of the time and hold off on the bullying tactics that is so common in Bupa. Registered Nurses steer clear of Bupa if you value your pin and self esteem.", "rating": 1, "pros": "Im struggling right now to think of any pros.", "cons": "Staff are spoken to in an appauling manner. Staff turnover is high. Registered Nurses reduced to tears by upper management.", "advice": "My advice to management is to get off their high horses and actually spend time on the units. Instead of being clipboard princesse's, try and look and observe the good work the undervalued carers and Nurses do on a daily basis. Try not to be critical all of the time and hold off on the bullying tactics that is so common in Bupa. Registered Nurses steer clear of Bupa if you value your pin and self esteem."}, {"title": "Best place to work", "text": "Pros Bupa sees their employees as their major assets, hence fully taking care of their work environment and well-being. Cons I don's see any major negative review about Bupa Advice to Management Continue to press on to be the global health care leader.", "rating": 5, "pros": "Bupa sees their employees as their major assets, hence fully taking care of their work environment and well-being.", "cons": "I don's see any major negative review about Bupa", "advice": "Continue to press on to be the global health care leader."}, {"title": "Bupa Life", "text": "Pros Friendly, people focused, good benefits. Cons Complicated structure, can make things very political.", "rating": 5, "pros": "Friendly, people focused, good benefits.", "cons": "Complicated structure, can make things very political.", "advice": null}, {"title": "Average employer", "text": "Pros Decent pay, some benefits including health assessment. Cons Large company, easy to get lost in the many layers. No free medical cover", "rating": 3, "pros": "Decent pay, some benefits including health assessment.", "cons": "Large company, easy to get lost in the many layers. No free medical cover", "advice": null}, {"title": "Terrible corporate culture and management", "text": "Pros Health insurance discount Free coffee at some sites Work from home available Reasonable wage with perks Cons Horrible management and HR processes Managers are able to bully employees with little reprisal All HR conflicts are kept confidential, so offenders can prosper and move up without recieving any real consequences Forced positivity at all times, inability to acknowledge accept project failures Expectation that if you aren't constantly participating in team activities (inside and outside of work hours)or question anything that you aren't a good employee and don't care about your team Advice to Management This is a toxic culture that needs to be addressed. As it is now employees face abuse alone and have learned not to try to report or change things - even if they are wrong and wasteful or bad for employees. The culture is clearly a \"YES\" men and women only. It's openly acknowledged among employees that managers have made people cry and quit, people have quit just to escape abuse from managers, when the abuser only faces \"re-education on procedures\". Everything is always glossed over and everyone is expected to always be \"passionate, excited and happy\" to work at Bupa. While management egos are allowed to run rampant, creating money and time wasting projects to advance their careers, while pressuring employees to complete them and ensuring the blame rests with employees if there are failures. It wasn't this way a few years ago, the shift has happened in the last two years as management has become extremely top heavy, sometimes 4 managers for a team - some with vague titles and difficult to pin down responsibilities. Employees who do the work and may not be interested in promotion but happy where they are, are considered strange and abohorrent for not wanting to advance somehow. There is only respect for ambition, very little respect for those who do the hard, sometimes very tedious work day in and day out while they are forced to also spend time accounting for every single minute of their day in a tracker. These are just some of the issues, and once again, this is a more recent deterioration over the last two years, hopefully it will change but in the meantime, if you still want to work in the corporate world, try applying with another company.", "rating": 1, "pros": "Health insurance discount", "cons": "Horrible management and HR processes", "advice": "This is a toxic culture that needs to be addressed. As it is now employees face abuse alone and have learned not to try to report or change things - even if they are wrong and wasteful or bad for employees. The culture is clearly a \"YES\" men and women only. It's openly acknowledged among employees that managers have made people cry and quit, people have quit just to escape abuse from managers, when the abuser only faces \"re-education on procedures\". Everything is always glossed over and everyone is expected to always be \"passionate, excited and happy\" to work at Bupa. While management egos are allowed to run rampant, creating money and time wasting projects to advance their careers, while pressuring employees to complete them and ensuring the blame rests with employees if there are failures."}, {"title": "Senior carer", "text": "Pros Good company to work for good rate of pay Cons Staff shortage and to much paperwork Advice to Management None", "rating": 5, "pros": "Good company to work for good rate of pay", "cons": "Staff shortage and to much paperwork", "advice": "None"}, {"title": "Rewarding job but rubbish pay and overworked!", "text": "Pros -Rewarding job -great employees -good employers (in my care home) -lovely residents -love having a good relationship with the families Cons -Poor pay -overworked - not enough holiday.. only pro rota - expected to work 12 hour days.. -always on your feet.. not paid for breaks. Advice to Management Make your pay better! Stop overworking your employees!", "rating": 3, "pros": "-Rewarding job", "cons": "-Poor pay", "advice": "Make your pay better!"}, {"title": "IT analyst", "text": "Pros Good company to work for especially for work/life balance Cons Poor planning for future project funding. Advice to Management Be more proactive about planning and less knee jerk reactions", "rating": 5, "pros": "Good company to work for especially for work/life balance", "cons": "Poor planning for future project funding.", "advice": "Be more proactive about planning and less knee jerk reactions"}, {"title": "Heart is in the right place", "text": "Pros Generally good people (collaborative) Most people somewhat passionate about health and care Opportunities across different business units Cons Business units operating in silos, but coming together in some functions Health insurance outlook is cloudy", "rating": 5, "pros": "Generally good people (collaborative)", "cons": "Business units operating in silos, but coming together in some functions", "advice": null}, {"title": "So, So", "text": "Pros Overall culture is good and somewhat positive. Majority of fellow employees/ team are friendly and respectful. Appropriate support when/where needed. Cons Large organisation with some ‘red tape’ and obstacles to jump to try new things in your role.", "rating": 3, "pros": "Overall culture is good and somewhat positive. Majority of fellow employees/ team are friendly and respectful. Appropriate support when/where needed.", "cons": "Large organisation with some ‘red tape’ and obstacles to jump to try new things in your role.", "advice": null}, {"title": "It is what you where hired to do", "text": "Pros Great place to work with really good peers around you, nice benefits attached with this role, well paid. Good holiday entitlement, with Bank Holidays given as off. Cons Whilst I was employed with them they were in a process of employing many retention consultants, but I think they over did it. At first there was reassurance from management of job security, however as time went on they forgotten about that side, next thing you the was a mad rush to get everyone trained and into teams ASAP, not enough time given to develop those skills and understanding of the role. Next thing you know management starts to threaten you with contract termination if not improved within a space of 3 days. Confusing as there was no proper allocation on where the specific phone calls were meant to go. So much to learn but so little time. Advice to Management Very poor management skills, felt like I was rushed, no organisation, doing one thing then another within minutes. Granted did get extra training but was not given enough time to implement it, always would be hit and miss.", "rating": 3, "pros": "Great place to work with really good peers around you, nice benefits attached with this role, well paid. Good holiday entitlement, with Bank Holidays given as off.", "cons": "Whilst I was employed with them they were in a process of employing many retention consultants, but I think they over did it. At first there was reassurance from management of job security, however as time went on they forgotten about that side, next thing you the was a mad rush to get everyone trained and into teams ASAP, not enough time given to develop those skills and understanding of the role. Next thing you know management starts to threaten you with contract termination if not improved within a space of 3 days. Confusing as there was no proper allocation on where the specific phone calls were meant to go. So much to learn but so little time.", "advice": "Very poor management skills, felt like I was rushed, no organisation, doing one thing then another within minutes. Granted did get extra training but was not given enough time to implement it, always would be hit and miss."}, {"title": "Care Assistant", "text": "Pros Really rewarding position face to face with people who need help. Had a really good team around me. Hard work but the most satisfying position I have held. Cons Management team useless, condisenting and selfish. Refused to use the budget on the residents; not buying equipment, limiting food and drinks like juice and biscuits, not replacing broken tables chairs and mattresses. Advice to Management Use your budget on the residents as it's suppose to and that in turn would make the care assistants jobs easier.", "rating": 3, "pros": "Really rewarding position face to face with people who need help. Had a really good team around me. Hard work but the most satisfying position I have held.", "cons": "Management team useless, condisenting and selfish. Refused to use the budget on the residents; not buying equipment, limiting food and drinks like juice and biscuits, not replacing broken tables chairs and mattresses.", "advice": "Use your budget on the residents as it's suppose to and that in turn would make the care assistants jobs easier."}, {"title": "Not a good work place", "text": "Pros Good friendly team and made a lot of friends Cons Was a terrible place to work. One of the team coaches were inappropriate outside of work and it was reported and dodged and then he took payments of customers credit cards without customer permission and I reported it and the head of sales backed him on it. Unless you are friends with management you get nowhere in this company. I was made to feel so uncomfortable and had a sick mum and wasn't able to take annual leave fast tracked I had to resign. Then they found some excuse not to pay me my full annual leave. Management is unprofessional and spend days playing card games with friends instead of coaching team mates. Complete waste of time working for this company and after having bupa health cover since the day I was born and getting an infection at a bupa dental clinic and Bupa's way of covering it up was giving me free cleans for life at bupa dental...like I would step foot in a bupa clinic after that. My whole family is looking st switching health fund. Advice to Management Stop hiring friends and promoting people who can't lead teams and don't know how to train. Promote those team members who work hard and have the sales experience to teach. Bupa has so many incredible staff members that are so wasted in the wrong positions and could really exceed if promoted. I really hope those people are started to be valued or move on from the company.", "rating": 1, "pros": "Good friendly team and made a lot of friends", "cons": "Was a terrible place to work. One of the team coaches were inappropriate outside of work and it was reported and dodged and then he took payments of customers credit cards without customer permission and I reported it and the head of sales backed him on it. Unless you are friends with management you get nowhere in this company. I was made to feel so uncomfortable and had a sick mum and wasn't able to take annual leave fast tracked I had to resign. Then they found some excuse not to pay me my full annual leave. Management is unprofessional and spend days playing card games with friends instead of coaching team mates. Complete waste of time working for this company and after having bupa health cover since the day I was born and getting an infection at a bupa dental clinic and Bupa's way of covering it up was giving me free cleans for life at bupa dental...like I would step foot in a bupa clinic after that. My whole family is looking st switching health fund.", "advice": "Stop hiring friends and promoting people who can't lead teams and don't know how to train. Promote those team members who work hard and have the sales experience to teach. Bupa has so many incredible staff members that are so wasted in the wrong positions and could really exceed if promoted. I really hope those people are started to be valued or move on from the company."}, {"title": "Great work place.", "text": "Pros Very supportive, nice atmosphere and learning opportunities. Cons They are short staffed too often. Advice to Management Hire more staff.", "rating": 5, "pros": "Very supportive, nice atmosphere and learning opportunities.", "cons": "They are short staffed too often.", "advice": "Hire more staff."}, {"title": "Work at bupa", "text": "Pros Good team support each other when needed Cons No real perks that benefit staff Advice to Management More appreciation to staff required", "rating": 5, "pros": "Good team support each other when needed", "cons": "No real perks that benefit staff", "advice": "More appreciation to staff required"}, {"title": "Service Account Manager", "text": "Pros Supportive management, potential for growth if you are serious about your work Cons Have a succession plan from within and recruit for senior roles from within as they already know the business and the customers!!! Advice to Management Recognize people's strengths and place them in their roles accordingly", "rating": 5, "pros": "Supportive management, potential for growth if you are serious about your work", "cons": "Have a succession plan from within and recruit for senior roles from within as they already know the business and the customers!!!", "advice": "Recognize people's strengths and place them in their roles accordingly"}, {"title": "Shocking Company", "text": "Pros Good people. Decent pay. Good benefits Cons Awful processes. micro-managed. Antiquated business model Advice to Management As per most companies the people are great, even the management team. On a personal level I can not fault anyone. There is a good culture of being able to speak to senior management about issues but as a wider business culture it is shocking. Serious levels of micro-management. Awful processes and a very antiquated organisation. I had my notice in before having another job lined up as I can not stand working here any longer.", "rating": 1, "pros": "Good people. Decent pay. Good benefits", "cons": "Awful processes. micro-managed. Antiquated business model", "advice": "As per most companies the people are great, even the management team. On a personal level I can not fault anyone. There is a good culture of being able to speak to senior management about issues but as a wider business culture it is shocking."}, {"title": "Clueless Bupa Global Executives", "text": "Pros Great people that genuinely want to make thigs better - the Senior leadership tries really hard but the executive leadership has no clue - Cons A executive leadership that does not care about people. The more they can get out of you the better - no leadership development Advice to Management Stop pretending to care about people talking about trust and caring about people - allow senior leaders to lead - Sheldon, stop allowing Latin America to run the show and do whatever they like, especially Steve Los", "rating": 1, "pros": "Great people that genuinely want to make thigs better - the Senior leadership tries really hard but the executive leadership has no clue -", "cons": "A executive leadership that does not care about people. The more they can get out of you the better - no leadership development", "advice": "Stop pretending to care about people talking about trust and caring about people - allow senior leaders to lead - Sheldon, stop allowing Latin America to run the show and do whatever they like, especially Steve Los"}, {"title": "General Misdirection Everywhere you look", "text": "Pros Great friendly people Work life balance Cons General misalignment between teams Poor investment decisions with external suppliers often invested in rather than their own people Below average salary Lack of ambition is the general culture in the organisation Advice to Management Take a hard look at yourselves and ask \"why is everything so over complicated?\"", "rating": 3, "pros": "Great friendly people", "cons": "General misalignment between teams", "advice": "Take a hard look at yourselves and ask \"why is everything so over complicated?\""}, {"title": "Bupa Care Homes - OK Employer", "text": "Pros Competitive, established, compliant, good benefits Cons Private, low salary, management, hours,", "rating": 3, "pros": "Competitive, established, compliant, good benefits", "cons": "Private, low salary, management, hours,", "advice": null}, {"title": "Amazing team 😊", "text": "Pros Everybody works well as a team & gets on with it & all of he residents are lovely 😊 I really couldn't ask for a better team to be on with as if somebody finishes on their floor hey will come down & ask to help out. Cons Short staffed sometimes which puts more stress on everybody but that goes on everywhere. Sometimes the rota isn't done on time so if people are not in to fill the shift they ring up asking. Advice to Management Be able to sort out quickly if somebody phoned in I'll so we're not left running around rushed off our feet.", "rating": 5, "pros": "Everybody works well as a team & gets on with it & all of he residents are lovely 😊 I really couldn't ask for a better team to be on with as if somebody finishes on their floor hey will come down & ask to help out.", "cons": "Short staffed sometimes which puts more stress on everybody but that goes on everywhere. Sometimes the rota isn't done on time so if people are not in to fill the shift they ring up asking.", "advice": "Be able to sort out quickly if somebody phoned in I'll so we're not left running around rushed off our feet."}, {"title": "Specialist complaints manager", "text": "Pros Reliable procedures Job security Good pay Good benefits good career opportunities Good people management procedures Flexible work hours Great employee support Cons Culture and climate There are certain areas of business that arent able to be flexible to meet customer needs Advice to Management Take more time to train and confidence build", "rating": 3, "pros": "Reliable procedures", "cons": "Culture and climate", "advice": "Take more time to train and confidence build"}, {"title": "peripatetic nurse", "text": "Pros very cleaned ,tidy and nice staff Cons short of staff,they don't care about the patients Advice to Management hired the good and professional staffs", "rating": 5, "pros": "very cleaned ,tidy and nice staff", "cons": "short of staff,they don't care about the patients", "advice": "hired the good and professional staffs"}, {"title": "Care Assistant", "text": "Pros welcoming environment good benefits good training programmes free lunch Cons the shifts are long (but they are everywhere)", "rating": 5, "pros": "welcoming environment", "cons": "the shifts are long (but they are everywhere)", "advice": null}, {"title": "There would be far worse places to work", "text": "Pros Bupa has a good culture and the overall cause is generally positive (given it operates within a commercial context). The majority of people at Bupa professional, well meaning and respectful. The organisation has the systems and structures that you would expect of a large organisation, and therefore there is appropriate support and development opportunities. Cons Like any large organisation, there can be a lot of political manoeuvring required to achieve success in your role, particularly if the role is about innovation or getting new ideas off the ground moreover than an operational or transactional role. It can take time to progress. Advice to Management Continue to hire good quality people and culture and performance take care of themselves.", "rating": 5, "pros": "Bupa has a good culture and the overall cause is generally positive (given it operates within a commercial context). The majority of people at Bupa professional, well meaning and respectful. The organisation has the systems and structures that you would expect of a large organisation, and therefore there is appropriate support and development opportunities.", "cons": "Like any large organisation, there can be a lot of political manoeuvring required to achieve success in your role, particularly if the role is about innovation or getting new ideas off the ground moreover than an operational or transactional role. It can take time to progress.", "advice": "Continue to hire good quality people and culture and performance take care of themselves."}, {"title": "Bupa care home", "text": "Pros Lovely staff great atmosphere and good place to work Cons Short of staff and sick ness Advice to Management None of the above as it's friendly place to work and every one gets on", "rating": 5, "pros": "Lovely staff great atmosphere and good place to work", "cons": "Short of staff and sick ness", "advice": "None of the above as it's friendly place to work and every one gets on"}, {"title": "Bupa", "text": "Pros good uncapped commission and benefits. Cons not much room for growth", "rating": 3, "pros": "good uncapped commission and benefits.", "cons": "not much room for growth", "advice": null}, {"title": "Going in right direction but slowly", "text": "Pros - Continuous stream of work in new technologies (Microsoft Stack) - Excellent Australian CIO - People friendly environment - Great work life balance - Very customer focused Cons - Too many parallel streams of work starts together causing bottleneck - Slow decision making, decisions change too often. - Move towards agile culture will take time to mature. - Some business units are comparatively small. Advice to Management Not all your team leaders are good, you claim to hire the best talent but I don't see it in practice. Better mid level leaders required to motivate people. HR practices significantly lag behind leading organisations in Australia, something to improve.", "rating": 5, "pros": "- Continuous stream of work in new technologies (Microsoft Stack)", "cons": "- Too many parallel streams of work starts together causing bottleneck", "advice": "Not all your team leaders are good, you claim to hire the best talent but I don't see it in practice. Better mid level leaders required to motivate people. HR practices significantly lag behind leading organisations in Australia, something to improve."}, {"title": "Great company", "text": "Pros Good employee benefits, good working environment Cons Salary and not much room for progression. Higher salarys offered to external candidates Advice to Management Speak up more rather than just do as your told all the time. Some of your ideas are fantastic yet unheard.", "rating": 5, "pros": "Good employee benefits, good working environment", "cons": "Salary and not much room for progression. Higher salarys offered to external candidates", "advice": "Speak up more rather than just do as your told all the time. Some of your ideas are fantastic yet unheard."}, {"title": "Low Salary Poor Employee Benefits", "text": "Pros Location, location, location and great coffee Cons Low salaries; limited opportunities to progress and a disingenuous 'employee first' mantra Advice to Management Talk to employees lower down the food chain. There are cultural challenges at play that are complex, requiring tough bold decisions", "rating": 3, "pros": "Location, location, location and great coffee", "cons": "Low salaries; limited opportunities to progress and a disingenuous 'employee first' mantra", "advice": "Talk to employees lower down the food chain. There are cultural challenges at play that are complex, requiring tough bold decisions"}, {"title": "Care assistant", "text": "Pros Some great work colleagues to get you through the day. Cons No consistency, under staffed, large work loads and 12 hour shifts. No praise but quick to say what you haven't done rather than keeping things running smoothly. Rubbish pay! Promise of a hot meals (jacket spud) they sell themselves at the interview but it's not like what they say. Advice to Management Appreciate your staff, after all it's us keeping you afloat.", "rating": 3, "pros": "Some great work colleagues to get you through the day.", "cons": "No consistency, under staffed, large work loads and 12 hour shifts. No praise but quick to say what you haven't done rather than keeping things running smoothly. Rubbish pay! Promise of a hot meals (jacket spud) they sell themselves at the interview but it's not like what they say.", "advice": "Appreciate your staff, after all it's us keeping you afloat."}, {"title": "Care Assitant", "text": "Pros A loving caring company. Have the residents needs and interests at heart. C Cons Can't think of any.", "rating": 5, "pros": "A loving caring company. Have the residents needs and interests at heart. C", "cons": "Can't think of any.", "advice": null}, {"title": "Lost my soul", "text": "Pros 40% of private health insurance Cons backstabbing colleagues, to this day - I am still made fun of in the cubicle chatter across the team (I know that for a fact), unsupportive team, inconsistent treatment, management played favourites, HR that could not care less, understaffed, underpaid Advice to Management perhaps look to embracing everybody in the team, not just a few because your personalities match and all like to hang out for drinks on fridays. Look to reducing the workload or building a bigger team, so the quality of each team member can be improved. Stop piling on more and more portfolios on the same people! Have more than one person working on the largest portfolio - this does not include a hiring a temp. Have computer systems that don't break down every couple weeks, so the that the \"fix's\" don't end up breaking down as well. Without the systems not in place, no one's work can be completed or even saved. Perhaps have certain team members apologise or face HR that accuse other innocent team members of taking drugs IN A LEADERSHIP MEETING. this person was never reprimanded for their actions", "rating": 1, "pros": "40% of private health insurance", "cons": "backstabbing colleagues, to this day - I am still made fun of in the cubicle chatter across the team (I know that for a fact), unsupportive team, inconsistent treatment, management played favourites, HR that could not care less, understaffed, underpaid", "advice": "perhaps look to embracing everybody in the team, not just a few because your personalities match and all like to hang out for drinks on fridays. Look to reducing the workload or building a bigger team, so the quality of each team member can be improved. Stop piling on more and more portfolios on the same people! Have more than one person working on the largest portfolio - this does not include a hiring a temp."}, {"title": "Care assistant", "text": "Pros Diversity of work, team dynamics and excellence for residents Cons Tough days when your colleagues are unwell or tired Advice to Management Keep up the positive reviews and appraisals for all non management", "rating": 5, "pros": "Diversity of work, team dynamics and excellence for residents", "cons": "Tough days when your colleagues are unwell or tired", "advice": "Keep up the positive reviews and appraisals for all non management"}, {"title": "Good intentions but lacking meaningful action. Very poor.", "text": "Pros Building location in Melbourne CBD, working environment is flexible. Pay is quite good. Cons Poor financial planning every single year for project spend, inadequate benefits schemes (ironically similar sized employers offer better discounts on health insurance. Agile practice is totally flawed and viewed purely as a delivery mechanism vs the wholesale change needed, because there is little buy-in for the organisational to allow it to work. The purpose of `longer, healthier, happier lives` does not translate into anything meaningful into people goals. There is little in the way of support for career development or conversations to support this. Advice to Management Significant overhaul of middle management is needed, people then processes. Focus on giving individuals and team meaningful goals that align with the company purpose otherwise its just vacuous.", "rating": 1, "pros": "Building location in Melbourne CBD, working environment is flexible. Pay is quite good.", "cons": "Poor financial planning every single year for project spend, inadequate benefits schemes (ironically similar sized employers offer better discounts on health insurance.", "advice": "Significant overhaul of middle management is needed, people then processes. Focus on giving individuals and team meaningful goals that align with the company purpose otherwise its just vacuous."}, {"title": "Care assistant", "text": "Pros Staff where friendly , residents where lovely. Cons Money was poor, no support , no team work , managers where not helpful Advice to Management Listen to staff , up the pay as staff work really hard", "rating": 3, "pros": "Staff where friendly , residents where lovely.", "cons": "Money was poor, no support , no team work , managers where not helpful", "advice": "Listen to staff , up the pay as staff work really hard"}, {"title": "Care assistant", "text": "Pros Enjoy the people I look after and work with Cons No support from your manager No team work sometimes Advice to Management Be there to support staff", "rating": 3, "pros": "Enjoy the people I look after and work with", "cons": "No support from your manager", "advice": "Be there to support staff"}, {"title": "Nice experience", "text": "Pros Good, professional team who were very supportive Cons Not enough room for progression", "rating": 5, "pros": "Good, professional team who were very supportive", "cons": "Not enough room for progression", "advice": null}, {"title": "Working for bupa", "text": "Pros Managers are really supportive, very accommodating for those with children, regular training to keep us up to date, work with some great team of carers and nurses. Cons Staffing levels can be difficult at times, poor pay for the hard work we do. Advice to Management Keep doing what your doing", "rating": 5, "pros": "Managers are really supportive, very accommodating for those with children, regular training to keep us up to date, work with some great team of carers and nurses.", "cons": "Staffing levels can be difficult at times, poor pay for the hard work we do.", "advice": "Keep doing what your doing"}, {"title": "Nice experience", "text": "Pros Good, professional team who were very supportive Cons Not enough room for progression", "rating": 5, "pros": "Good, professional team who were very supportive", "cons": "Not enough room for progression", "advice": null}, {"title": "Best place to work", "text": "Pros Good teamwork,friendly residents and relatives, flexible working hours, spport for career development,training Cons Salary, staff shortage, staff food", "rating": 5, "pros": "Good teamwork,friendly residents and relatives, flexible working hours, spport for career development,training", "cons": "Salary, staff shortage, staff food", "advice": null}, {"title": "Career", "text": "Pros It's a nice company to work for and very helpful Cons The money isn't very good Advice to Management Keep doing what your doing excellent", "rating": 5, "pros": "It's a nice company to work for and very helpful", "cons": "The money isn't very good", "advice": "Keep doing what your doing excellent"}, {"title": "Worst place I've worked in healthcare", "text": "Pros -lovely residents and families that you bond with -(some) friendly staff that help you and keep you going through the day -as activities staff, not counted in floor numbers so able to be more flexible with shifts Cons -severe lack of adequate training -malicious gossiping very common -upper management overworks floor staff -management prefer to rely on staff taking on too much overtime rather than hire in agency or more staff to cover shifts -pay is one of the lowest in the healthcare sector -no career progression at all possible with very limited personal development in place as well Advice to Management I completed an extensive exit interview so hopefully my suggestions there will be heard.", "rating": 1, "pros": "-lovely residents and families that you bond with", "cons": "-severe lack of adequate training", "advice": "I completed an extensive exit interview so hopefully my suggestions there will be heard."}, {"title": "Good employer that cares about wellbeing of employees", "text": "Pros - Good culture - Flexible working - Modern head offices in CBD - 3 months paid maternity leave after 12 months employment - Discount on health insurance, optical, travel, home and car insurance - Wellbeing and support programs Cons - Legacy systems - Process improvement can be challenging", "rating": 5, "pros": "- Good culture", "cons": "- Legacy systems", "advice": null}, {"title": "Care assistant", "text": "Pros Caring for the elderly. Chance to give back to the community. Staff working together as a team. A chance to learn and move up. Flexible hours. Cons Mangers are not supportive. They put off to get learners in so you can get nvq's. never giving any of things bupa offers. When suspended made to work in the laundry for your money. Your just a number. Advice to Management Stick by your staff and stop treating them just like a number. Help staff listen to them there the ones who are doing the work. Reward the good hard working people. Stop slating nightstaff", "rating": 5, "pros": "Caring for the elderly. Chance to give back to the community. Staff working together as a team. A chance to learn and move up. Flexible hours.", "cons": "Mangers are not supportive. They put off to get learners in so you can get nvq's. never giving any of things bupa offers. When suspended made to work in the laundry for your money. Your just a number.", "advice": "Stick by your staff and stop treating them just like a number. Help staff listen to them there the ones who are doing the work. Reward the good hard working people. Stop slating nightstaff"}, {"title": "business development role", "text": "Pros Good people client-focused leading to positive outcomes Cons poor systems lack of follow-through on company-wide initiatives Advice to Management take more notice", "rating": 5, "pros": "Good people", "cons": "poor systems", "advice": "take more notice"}, {"title": "OK company", "text": "Pros Care about changing people's health Cons Not innovative, very traditional, don't want to change Advice to Management Invest in people and new technologies", "rating": 3, "pros": "Care about changing people's health", "cons": "Not innovative, very traditional, don't want to change", "advice": "Invest in people and new technologies"}, {"title": "Nurse", "text": "Pros You feel that you are well valued by the company. Cons Unfortunately the pay is less per hour as compared to others.", "rating": 5, "pros": "You feel that you are well valued by the company.", "cons": "Unfortunately the pay is less per hour as compared to others.", "advice": null}, {"title": "Laundry assistant", "text": "Pros Like a family always someone willing to listen and help Cons None it was very nice", "rating": 5, "pros": "Like a family always someone willing to listen and help", "cons": "None it was very nice", "advice": null}, {"title": "The worst place anyone could every work", "text": "Pros Taking care of the residents and giving them the best you can offer. It is easy to sit and listen their experiences and interact with them Cons I would consider this to be the worst place I have ever worked. This company supports a gossiping environment, overly racist tendencies. No support from managers, no support from nurses. Managers looked down on you as a mere number, you are required to work a full 12hr shift sometimes without resting as the unit is very challenging due to the type of dementia. Even after completing a 36hr shift they will call you on your days off to come in for work. If you refuse - you won't be regarded as a favourite. Lots of writing - no computer to type anything. Sometimes you are shouted at and if you report it, due to the experience of that person it will be swept under the carpet. No safety measure in regards to staff members as sometimes the resident will have some types of sickness and the only safety is a easy tear plastic apron and gloves. You will receive scratches, bites and sometimes punches from residents. The salary is a disgrace (£7.35 per hour) sometimes working a extra shift is the only way to add to your salary. You will fall sick due to the level of mental and physical stress you endure particularly from staff members. No training programs, no scope for growth, no compensations (a staff member receive an award for the most reporting of other staff members which includes resting sometimes) Advice to Management Your salary doesn't enhance you to godlike being", "rating": 1, "pros": "Taking care of the residents and giving them the best you can offer. It is easy to sit and listen their experiences and interact with them", "cons": "I would consider this to be the worst place I have ever worked. This company supports a gossiping environment, overly racist tendencies. No support from managers, no support from nurses. Managers looked down on you as a mere number, you are required to work a full 12hr shift sometimes without resting as the unit is very challenging due to the type of dementia. Even after completing a 36hr shift they will call you on your days off to come in for work. If you refuse - you won't be regarded as a favourite. Lots of writing - no computer to type anything. Sometimes you are shouted at and if you report it, due to the experience of that person it will be swept under the carpet. No safety measure in regards to staff members as sometimes the resident will have some types of sickness and the only safety is a easy tear plastic apron and gloves. You will receive scratches, bites and sometimes punches from residents. The salary is a disgrace (£7.35 per hour) sometimes working a extra shift is the only way to add to your salary. You will fall sick due to the level of mental and physical stress you endure particularly from staff members. No training programs, no scope for growth, no compensations (a staff member receive an award for the most reporting of other staff members which includes resting sometimes)", "advice": "Your salary doesn't enhance you to godlike being"}, {"title": "Senior Sustainability", "text": "Pros employee well-being and life work balance if you work corporate Cons low paid, not brave innovative enough Advice to Management focus on action", "rating": 3, "pros": "employee well-being and life work balance if you work corporate", "cons": "low paid, not brave innovative enough", "advice": "focus on action"}, {"title": "A great culture and place to work", "text": "Pros Strong Leadership - Area and State Managers keep in contact with you and connect you to other areas of the business Programs for Growth - I have participated in two Bupa development programs which have cost me $0 and are solely focused on personal development. Culture- Teams at Bupa enjoy positive focus and the ability to share with one another Cons Sales Targets can be hard in a Retail environment - but management are supportive of this. Sometimes vision takes time, and your enthusiasm gets slowed by red tape or timing. Advice to Management Area, Regional General Manager and Upper Management in Customer Growth makes front line managers feel connected. I appreciate the time I get to spend with them, and only wish we could spend more time connecting with one another.", "rating": 5, "pros": "Strong Leadership - Area and State Managers keep in contact with you and connect you to other areas of the business", "cons": "Sales Targets can be hard in a Retail environment - but management are supportive of this.", "advice": "Area, Regional General Manager and Upper Management in Customer Growth makes front line managers feel connected. I appreciate the time I get to spend with them, and only wish we could spend more time connecting with one another."}, {"title": "A mixed view", "text": "Pros Plenty of projects to get involved in Cons Little investment in the business Salary below market value Advice to Management To value employees more", "rating": 3, "pros": "Plenty of projects to get involved in", "cons": "Little investment in the business", "advice": "To value employees more"}, {"title": "Grow their people", "text": "Pros If you have talent, you are driven, you work hard and perform , you don't go unnoticed. This company provide opportunities to develop talent and assist with career growth. They have programs for Future Leaders, offers Graduate programs , Diplomas for Leaders, Gender Agenda programs that empowers women in the workplace . Cons Need improvement with digital and technology. But the leaders are aware and work is in progress. This company is proactively improving. Advice to Management Need to get more external talents , not necessarily from the health field as people with experience from other industries can bring fresh insights in the way we do our business.", "rating": 5, "pros": "If you have talent, you are driven, you work hard and perform , you don't go unnoticed. This company provide opportunities to develop talent and assist with career growth. They have programs for Future Leaders, offers Graduate programs , Diplomas for Leaders, Gender Agenda programs that empowers women in the workplace .", "cons": "Need improvement with digital and technology. But the leaders are aware and work is in progress. This company is proactively improving.", "advice": "Need to get more external talents , not necessarily from the health field as people with experience from other industries can bring fresh insights in the way we do our business."}, {"title": "A good company to work for", "text": "Pros Working for Bupa is like being in a big family, everyone who has worked there knows all the residents like there are a family Cons Not having an activity co-ordinator everyday", "rating": 5, "pros": "Working for Bupa is like being in a big family, everyone who has worked there knows all the residents like there are a family", "cons": "Not having an activity co-ordinator everyday", "advice": null}, {"title": "Why choose Bupa or not", "text": "Pros Good career path to move up to management. Golden opportunities through the company. Cons Lack of support when needed. Pay rate below average. Advice to Management Trust in your team and listen to what they say.", "rating": 3, "pros": "Good career path to move up to management.", "cons": "Lack of support when needed.", "advice": "Trust in your team and listen to what they say."}, {"title": "Great culture", "text": "Pros Good culture, work/life balance, lots of opportunities to take on secondments and other roles. Fantastic benefits available to employees from the moment they start. Cons Low salary for jobs compared to similar jobs at other companies, needs to have better policies around flexibility and overtime. Advice to Management Review of salary and zones to ensure that employees are paid correctly based on their experience and qualifications.", "rating": 5, "pros": "Good culture, work/life balance, lots of opportunities to take on secondments and other roles. Fantastic benefits available to employees from the moment they start.", "cons": "Low salary for jobs compared to similar jobs at other companies, needs to have better policies around flexibility and overtime.", "advice": "Review of salary and zones to ensure that employees are paid correctly based on their experience and qualifications."}, {"title": "Dissatisfied", "text": "Pros Making residents happy. Day to day interaction with residents Cons Power hungry seniors. Senior carers thinking that they dont need to take part in the hard parts of the job. Advice to Management Do a shift in one of the units.", "rating": 1, "pros": "Making residents happy. Day to day interaction with residents", "cons": "Power hungry seniors. Senior carers thinking that they dont need to take part in the hard parts of the job.", "advice": "Do a shift in one of the units."}, {"title": "Mediocre pay, mediocre leadership", "text": "Pros A friendly culture, work-life balance. Onsite gym at my location Cons Poor leadership ensures that real change never gets delivered. And real change is needed, in some teams (horrible culture), employee engagement, career pathways, IT, business strategy...the list goes on. Right now, mediocre leadership in each of these areas ensures that poor management are hired-in, rather than promoting good talent from within, leading to staff disenfranchisement and demotivation and poor decision-making by mediocre manangers withoit even the experience of Bupa. Management paper over the cracks but the financials don't lie. It is a shame, because despite paying much lower than market rates for talent, a culture of \"doing the right thing\" amongst staff ensures people work their socks off. Shame it is all in vain. Finally, benefits are not all they seem: private healthcare is not what you'd get from competitors (e.g. AXA, or even the Bupa coverage you'd get at another company). Pay rises only near inflation, with real achievement reflected in bonus. That is, when management don't dole out the money to favourites. Career advancement? Non-existent. Apart from the leadership team, I've only seen ONE promotion across all peer teams. Advice to Management Advice to the Board: sack the leadership team, get a turnaround chairman (as Aviva did) and hire (and pay for) a transformational leadership team. The rest will fall into place.", "rating": 1, "pros": "A friendly culture, work-life balance. Onsite gym at my location", "cons": "Poor leadership ensures that real change never gets delivered. And real change is needed, in some teams (horrible culture), employee engagement, career pathways, IT, business strategy...the list goes on.", "advice": "Advice to the Board: sack the leadership team, get a turnaround chairman (as Aviva did) and hire (and pay for) a transformational leadership team. The rest will fall into place."}, {"title": "Care Assistant", "text": "Pros The clients were very lovely. Always overtime. Cons Awful pay. Always short staffed. Manager was horrible. I was in my first trimester of pregnancy, I had a bleed. Was advised to go to A and E rung work to tell them and they insisted I went in and did my shift! Advice to Management Your staff shouldon't have to make an appointment to speak with you. Back your staff up. Especially loyal ones", "rating": 1, "pros": "The clients were very lovely. Always overtime.", "cons": "Awful pay. Always short staffed. Manager was horrible. I was in my first trimester of pregnancy, I had a bleed. Was advised to go to A and E rung work to tell them and they insisted I went in and did my shift!", "advice": "Your staff shouldon't have to make an appointment to speak with you. Back your staff up. Especially loyal ones"}, {"title": "Not very good", "text": "Pros Private healthcare and decent pension Cons Don't seem to take care of employee's or appreciate/ value your work. Unless you suck up and your face fits. I have a disability and have found it so difficult to put things in place, that occupational health have recommended and they are legally supposed to. Also they are the worlds worst in regards to sickness you would expect them to understand being in healthcare but far from, first opportunity will give you warning, then written warning with a meeting etc. They don't take into consideration your background in regards to disability as well as people feel so pressured to go into work, that they then pass their illnesses around the office, this includes d&v as well as colds etc. Managers have no compassion and don't take personal circumstances into consideration into account. It's all very corporate and tick box exercise, they have a advise line for managers. Managers often take forever to get back to you and lways need to speak to speak to advise line as they have no clue. Advice to Management Take people into consideration, not one fits all. Be approachable and if you say you will answer a question tomorrow answer it. If your not able to say and say your awaiting response. Learn things because most of you seem incompetant, especially those promoted up recently", "rating": 1, "pros": "Private healthcare and decent pension", "cons": "Don't seem to take care of employee's or appreciate/ value your work. Unless you suck up and your face fits.", "advice": "Take people into consideration, not one fits all. Be approachable and if you say you will answer a question tomorrow answer it. If your not able to say and say your awaiting response."}, {"title": "Great purpose, poor pay and career progression", "text": "Pros Lovely people, great purpose, work life balance Cons Low pay compared to market, lack of job opportunities", "rating": 3, "pros": "Lovely people, great purpose, work life balance", "cons": "Low pay compared to market, lack of job opportunities", "advice": null}, {"title": "Working at BUPA", "text": "Pros Nice location. Good facilities. Great facilities Gym, Canteen, Health focused Great bunch of people to work with. Great not having shareholder pressure to drive profit only programs Cons Slow to get anything approved. Management heavy Advice to Management To many decision makers to get things moving. To drive innovation you need to promote up forward thinking values and risk takers", "rating": 5, "pros": "Nice location. Good facilities. Great facilities Gym, Canteen, Health focused", "cons": "Slow to get anything approved.", "advice": "To many decision makers to get things moving. To drive innovation you need to promote up forward thinking values and risk takers"}, {"title": "software tester", "text": "Pros good working conditions and work place Cons poor management style without concern for long term staff Advice to Management deal with staff better", "rating": 3, "pros": "good working conditions and work place", "cons": "poor management style without concern for long term staff", "advice": "deal with staff better"}, {"title": "Disconnected", "text": "Pros Great purpose and powerful brand Cons Massive disconnect between purpose and culture, not as nice as it seems Advice to Management Reconnect with what is important - customers and employees", "rating": 1, "pros": "Great purpose and powerful brand", "cons": "Massive disconnect between purpose and culture, not as nice as it seems", "advice": "Reconnect with what is important - customers and employees"}, {"title": "Unprofessional", "text": "Pros Very bright and capable people in the lower ranks - high achievers who get the job done in spite of the challenges Cons Cronyism and nepotism is rife. If you're on the outer in that respect merit means nothing. Millions spent achieving nothing in their transformation program over many years. Money wasted devising new ways of working that has achieved nothing - in the meantime the people on the ground have kept delivering. Enjoyed working there but was shafted. Never been treated so unprofessionally - anywhere - ever Advice to Management Don't be all talk - get back to basics - none of the \"flavour of the month silver bullets\" have achieved anything. Take on criticism and stop hiring your family and friends.", "rating": 1, "pros": "Very bright and capable people in the lower ranks - high achievers who get the job done in spite of the challenges", "cons": "Cronyism and nepotism is rife. If you're on the outer in that respect merit means nothing. Millions spent achieving nothing in their transformation program over many years. Money wasted devising new ways of working that has achieved nothing - in the meantime the people on the ground have kept delivering. Enjoyed working there but was shafted. Never been treated so unprofessionally - anywhere - ever", "advice": "Don't be all talk - get back to basics - none of the \"flavour of the month silver bullets\" have achieved anything. Take on criticism and stop hiring your family and friends."}, {"title": "Housekeeping Assistant", "text": "Pros Flexible hours - good for students such as myself as I always have a job to come home to when I am on my holidays. Most of the staff are very friendly. Line Manager is very friendly and accommodating. Cons Sometimes the work seems to not be worth the money. Can feel undervalued. Advice to Management Value your staff as often as possible. Even just a thanks can go a long way.", "rating": 3, "pros": "Flexible hours - good for students such as myself as I always have a job to come home to when I am on my holidays. Most of the staff are very friendly. Line Manager is very friendly and accommodating.", "cons": "Sometimes the work seems to not be worth the money. Can feel undervalued.", "advice": "Value your staff as often as possible. Even just a thanks can go a long way."}, {"title": "Busy", "text": "Pros colleagues nice and clean work environment Cons too much volume of work Advice to Management care more about your staff than perks", "rating": 3, "pros": "colleagues nice and clean work environment", "cons": "too much volume of work", "advice": "care more about your staff than perks"}, {"title": "The people are great", "text": "Pros I really love working with my colleagues. They are a great group of people who are passionate and driven. And also open to change and innovation. Great purpose which I feel very aligned to. Cons At times there is a lack of understanding between different teams that we all share one common goal. There is so much to gain from knowledge sharing which I feel doesn't happen enough. It can take time for things to progress/be approved, and often the momentum can be affected. Advice to Management Communication is the key. Often issues arise due to a lack of communication between management and direct reports.", "rating": 3, "pros": "I really love working with my colleagues. They are a great group of people who are passionate and driven. And also open to change and innovation.", "cons": "At times there is a lack of understanding between different teams that we all share one common goal. There is so much to gain from knowledge sharing which I feel doesn't happen enough.", "advice": "Communication is the key. Often issues arise due to a lack of communication between management and direct reports."}, {"title": "Bonus not paid", "text": "Pros I got known some fantastic nurses and carers. Feeling that I am part of this badly treated unlucky team. Cons The job is was promised was a Clinical service manager - I ended up as staff nurse working 12 hours shifts over 42 hours a week. Before you sign contract and start they promise you all kinds of things but in the reality these things will not happen. Bupa is advertising £1000 bonus when you sign contract with them, but you will never see it and even asking about is it not good. Advice to Management Be professional, support people rather than blame, be true and honest. Dont put the standards high when you are failing the basics. Stop adverstising about the bonus for registered nurses.", "rating": 1, "pros": "I got known some fantastic nurses and carers. Feeling that I am part of this badly treated unlucky team.", "cons": "The job is was promised was a Clinical service manager - I ended up as staff nurse working 12 hours shifts over 42 hours a week. Before you sign contract and start they promise you all kinds of things but in the reality these things will not happen.", "advice": "Be professional, support people rather than blame, be true and honest. Dont put the standards high when you are failing the basics. Stop adverstising about the bonus for registered nurses."}, {"title": "a good home for Project Managers", "text": "Pros solid governance and approach to delivering projects and good support for senior management Cons some times too much red tape to get stuff approved", "rating": 5, "pros": "solid governance and approach to delivering projects and good support for senior management", "cons": "some times too much red tape to get stuff approved", "advice": null}, {"title": "Bupa, Health care assistant", "text": "Pros Bupa Fit membership for staff Cons Pay is minimum wage Hours are long Always short staffed Dont get paid breaks Work is very very hard Management do not listen to staff Food for staff and residents is awful Advice to Management Listen to staff more, hire more staff or use more agency staff", "rating": 1, "pros": "Bupa Fit membership for staff", "cons": "Pay is minimum wage", "advice": "Listen to staff more, hire more staff or use more agency staff"}, {"title": "Damaged", "text": "Pros Used to be a great working culture until one point. Cons Some really great people work their however, some of the Management were extremely unprofessional e.g. One of the managers used to sexually harass me on a regular basis making me so uncomfortable that I had to leave. BUPA is lucky I didn't slap a lawsuit on them for having an employee like him taking advantage of me and other vulnerable woman knowing he has power/status to get away with it. Apparently he had an affair with two of his staff members and now engaged to another employee of BUPA. Disgusting ! Advice to Management Be aware of what your staff are doing. Maybe make it aware to employees that if something like this is happening that they can feel comfortable to talk to someone about it.", "rating": 1, "pros": "Used to be a great working culture until one point.", "cons": "Some really great people work their however, some of the Management were extremely unprofessional e.g. One of the managers used to sexually harass me on a regular basis making me so uncomfortable that I had to leave. BUPA is lucky I didn't slap a lawsuit on them for having an employee like him taking advantage of me and other vulnerable woman knowing he has power/status to get away with it. Apparently he had an affair with two of his staff members and now engaged to another employee of BUPA. Disgusting !", "advice": "Be aware of what your staff are doing. Maybe make it aware to employees that if something like this is happening that they can feel comfortable to talk to someone about it."}, {"title": "Cultural issues", "text": "Pros Employment in Bupa might help to prepare for working in a complex organisation with a lot of administrative/ bureaucratic challenges. Cons Bupa seems to promote nepotism and internal discrimination. The opportunities for development and promotion are open predominantly for relatives/mates of those responsible for decision making.", "rating": 3, "pros": "Employment in Bupa might help to prepare for working in a complex organisation with a lot of administrative/ bureaucratic challenges.", "cons": "Bupa seems to promote nepotism and internal discrimination. The opportunities for development and promotion are open predominantly for relatives/mates of those responsible for decision making.", "advice": null}, {"title": "Treatment of care assistants", "text": "Pros Good working environment, i.e. Nice colleges good team work and potential to climb the ladder. Refresher training, a loan scheme and some insentivies. Cons Low paid, lack of staff, exhausting 12 hour shifts. Lack of respect for care assistants by the management, not enough time to spend with residents. Advice to Management The living wage is needed, more staff needed, quality care is needed due to lack of staff. Care assistants are the back bone of this industry and need to be treated and respected as such!!", "rating": 3, "pros": "Good working environment, i.e. Nice colleges good team work and potential to climb the ladder. Refresher training, a loan scheme and some insentivies.", "cons": "Low paid, lack of staff, exhausting 12 hour shifts. Lack of respect for care assistants by the management, not enough time to spend with residents.", "advice": "The living wage is needed, more staff needed, quality care is needed due to lack of staff. Care assistants are the back bone of this industry and need to be treated and respected as such!!"}, {"title": "Job", "text": "Pros reputable company to work for, good benefits, great people, Cons horrible offices, car parking a nightmare", "rating": 3, "pros": "reputable company to work for, good benefits, great people,", "cons": "horrible offices, car parking a nightmare", "advice": null}, {"title": "sales associate", "text": "Pros friendly professional team high remuneration Cons there are a lot of opportunities Advice to Management excellent", "rating": 5, "pros": "friendly professional team high remuneration", "cons": "there are a lot of opportunities", "advice": "excellent"}, {"title": "Maintenance", "text": "Pros Salary ok Working hours flexible Good training Cons No progression No support from external management", "rating": 5, "pros": "Salary ok", "cons": "No progression", "advice": null}, {"title": "An excellent experience but not for me in the long run", "text": "Pros Excellent development for staff, management and leadership courses are outstanding. Back office is exceptional with the processes running like a well oiled machine Cons Too big to manage change easily. People can get lost in the system because the organisation is so large. Advice to Management Go back to basics and focus on the core business", "rating": 5, "pros": "Excellent development for staff, management and leadership courses are outstanding. Back office is exceptional with the processes running like a well oiled machine", "cons": "Too big to manage change easily. People can get lost in the system because the organisation is so large.", "advice": "Go back to basics and focus on the core business"}, {"title": "Poor management", "text": "Pros Unit team and manager were extremely professional Cons Home management not interested in workforce welfare expecting staff to work 5 12 hour shifts in a row to cover for vacancies leading to staff sickness due to stress and exhaustion Advice to Management Look after your staff and your staff will look after you", "rating": 1, "pros": "Unit team and manager were extremely professional", "cons": "Home management not interested in workforce welfare expecting staff to work 5 12 hour shifts in a row to cover for vacancies leading to staff sickness due to stress and exhaustion", "advice": "Look after your staff and your staff will look after you"}, {"title": "Great Employee Benefits", "text": "Pros Great building facilities such as gym, restaurant, gardens, terrace, etc They have a very good Health Insurance for you and your whole family, including parents. Cons Too much competition between employees. The work schedule was too tight, not much flexibility for conciliate. Not enough training possibilities Advice to Management More flexibility", "rating": 5, "pros": "Great building facilities such as gym, restaurant, gardens, terrace, etc", "cons": "Too much competition between employees. The work schedule was too tight, not much flexibility for conciliate.", "advice": "More flexibility"}, {"title": "Amazing", "text": "Pros Making a different in service users' lives. Offers so many opportunities that you will definitely find the right role for you. Competitive salary and they pay the cost of your DBS. Pension plan and life assurance scheme. Cons Stressful work environment at times. Prior experience and qualifications are required. Intense competition. Advice to Management Keep doing what you do, supporting staff to achieve their full potential.", "rating": 5, "pros": "Making a different in service users' lives.", "cons": "Stressful work environment at times.", "advice": "Keep doing what you do, supporting staff to achieve their full potential."}, {"title": "Dont ask questions...", "text": "Pros good benefits, on-site gym, reasonable pay Cons dictatorship mentality, no co-operation between divisions, in-fighting and politics, huge blame culture, no training or induction", "rating": 1, "pros": "good benefits, on-site gym, reasonable pay", "cons": "dictatorship mentality, no co-operation between divisions, in-fighting and politics, huge blame culture, no training or induction", "advice": null}, {"title": "Shambles", "text": "Pros Some nice people Good restaurant Gym facilities Cons Inexperienced Finance team driven into the ground Horrendous hours worked Management turn a blind eye to aggressive behaviour Advice to Management Sort out the horrible culture instead of constantly congratulating one another on how great you are", "rating": 1, "pros": "Some nice people", "cons": "Inexperienced Finance team driven into the ground", "advice": "Sort out the horrible culture instead of constantly congratulating one another on how great you are"}, {"title": "Wouldn't recommend", "text": "Pros Paid breaks - when you get them! Helping and forming good relationships with residents and families. Cons Archaic practices (eg staff filling in time sheets to get paid, care staff doing washing up and laundry regularly). Poor pay. Lack of leadership within care home. Favouritism of certain staff with management. Not getting paid for overtime.", "rating": 3, "pros": "Paid breaks - when you get them!", "cons": "Archaic practices (eg staff filling in time sheets to get paid, care staff doing washing up and laundry regularly).", "advice": null}, {"title": "Career Development", "text": "Pros Challenging work, friendly team, supportive colleagues Cons Limited development. Too many layers of management Advice to Management Recognise potential and provide better career development opportunity", "rating": 3, "pros": "Challenging work, friendly team, supportive colleagues", "cons": "Limited development. Too many layers of management", "advice": "Recognise potential and provide better career development opportunity"}, {"title": "Company review", "text": "Pros Good work life balance Good mix of people flexi hours Cons Employee engagement and recognition framework absent Growth path not defined Cost over quality approach", "rating": 5, "pros": "Good work life balance", "cons": "Employee engagement and recognition framework absent", "advice": null}, {"title": "Account Manager", "text": "Pros Great colleagues, reasonable senior management although a bit \"revolving door' with a while new team every few years with\"new\" ideas Cons Very few. Insurance side of the business real fun - the care homes seem to get slagged badly on here Advice to Management Learn from the mistakes of the past. Not all your \"new\" ideas are always new!", "rating": 5, "pros": "Great colleagues, reasonable senior management although a bit \"revolving door' with a while new team every few years with\"new\" ideas", "cons": "Very few. Insurance side of the business real fun - the care homes seem to get slagged badly on here", "advice": "Learn from the mistakes of the past. Not all your \"new\" ideas are always new!"}, {"title": "Good, not great", "text": "Pros Flexible (working from home encouraged) Onsite gyms Cons Most benefits are voluntary salary sacrifice (own company health trust expensive) High turnover in leadership Complex hierarchy and reporting lines Inequality of benefits Advice to Management Inequality of benefits means some lower grades now paid more than higher ones", "rating": 3, "pros": "Flexible (working from home encouraged)", "cons": "Most benefits are voluntary salary sacrifice (own company health trust expensive)", "advice": "Inequality of benefits means some lower grades now paid more than higher ones"}, {"title": "The place to work", "text": "Pros Friendly people, flexible hours, reasonable remuneration Cons Somethings get resolved slowly, a bit of politics", "rating": 5, "pros": "Friendly people, flexible hours, reasonable remuneration", "cons": "Somethings get resolved slowly, a bit of politics", "advice": null}, {"title": "The health insurance company who makes employees sick", "text": "Pros ...on site gym. Catering also ok but not at all subsidised like they said. Cons Reactive not proactive. Doesn't like change and doesn't like to deviate from their outdated processes. Is it any wonder bupa is losing its grip on the market. Prehistoric sickness and absence processes and would rather you die at your desk than be off ill. Booking holidays has to be done a month in advance and the do not accommodate emergencies or last minute requests. Unclean facilities and deem moving a keyboard a risk but would like you to clean your keyboard with a wet cloth. Oh and bags of rotting food beneath the desks.the joys of hot desking. Training is backwards. Recruitment lie to you to get you to accept the job roles and the staff play blind to it and make no effort to rectify it. Advice to Management Sort it out.", "rating": 1, "pros": "...on site gym. Catering also ok but not at all subsidised like they said.", "cons": "Reactive not proactive. Doesn't like change and doesn't like to deviate from their outdated processes. Is it any wonder bupa is losing its grip on the market.", "advice": "Sort it out."}, {"title": "Lots of potential but a long way to go", "text": "Pros Looks great on your CV as everyone thinks the inside must be as amazing as the very well polished outside (based on the ads people see), becoming more flexible and progressive but you may reach retirement by the time they catch up to the rest of the world Cons Backwards culture, capability is lacking significantly, it's a popularity contest with directors having clear favourites that get all the opportunities handed to them despite their lack of suitability, low pay for anyone in the aged care business, a few devoted good eggs work there but are treated poorly for speaking up about issues Advice to Management Take a long hard look at yourself", "rating": 3, "pros": "Looks great on your CV as everyone thinks the inside must be as amazing as the very well polished outside (based on the ads people see), becoming more flexible and progressive but you may reach retirement by the time they catch up to the rest of the world", "cons": "Backwards culture, capability is lacking significantly, it's a popularity contest with directors having clear favourites that get all the opportunities handed to them despite their lack of suitability, low pay for anyone in the aged care business, a few devoted good eggs work there but are treated poorly for speaking up about issues", "advice": "Take a long hard look at yourself"}, {"title": "Dreadful", "text": "Pros Looks good on your cv for your next employer. People are really genuinely very nice. This business doesn't deserve them. Cons The recruitment process is let's say whatever it takes to get them in, regardless of whether it's true. The culture is twenty years out of date, driving their employees into the ground with unmanageable targets. Their attitude to regulation is reactive rather than proactive leaving themselves wide open to huge fines. Poor and really disappointing. Advice to Management When you bring people into the business to share ideas listen to them. Or they will go elsewhere.", "rating": 1, "pros": "Looks good on your cv for your next employer. People are really genuinely very nice. This business doesn't deserve them.", "cons": "The recruitment process is let's say whatever it takes to get them in, regardless of whether it's true. The culture is twenty years out of date, driving their employees into the ground with unmanageable targets. Their attitude to regulation is reactive rather than proactive leaving themselves wide open to huge fines. Poor and really disappointing.", "advice": "When you bring people into the business to share ideas listen to them. Or they will go elsewhere."}, {"title": "Anonymous carer", "text": "Pros Helping the residents good team in unit Cons Extremely poor management non approachable Poor wage for the work we do Favouritism from management", "rating": 3, "pros": "Helping the residents good team in unit", "cons": "Extremely poor management non approachable", "advice": null}, {"title": "Great opportunities", "text": "Pros Great opportunities - significant transformation underway, exciting change agenda People and leadership are great - passionate people Cons Could provide more wellness options for employees", "rating": 5, "pros": "Great opportunities - significant transformation underway, exciting change agenda", "cons": "Could provide more wellness options for employees", "advice": null}, {"title": "Good culture & plenty of opportunities to grow/develop", "text": "Pros Great place to work, albeit in the midst of ongoing transformation & from the perspective of someone working out of head office dept. but based in Nanchester. Great culture, which promotes development and sharing of ideas/ways to improve. Really friendly staff & management from operational up to exec level are hard working, open/honest (as they can be), and happy to promote/support staff develop/grow, especially if you're happy to push yourself & demonstrate Bupa's values. Also great variety & scope in work for internal auditors due to diverse nature of business & matrix structure/operating model. Cons Pace of change at operational level can be slow, but may speed up with ongoing transformation/cultural change. Due to matrix model frustratingly ineffective in decision making with management at time hesitant/afraid to act. Resource heavy in head office & unclear what the people/functions do/contribute. Also disparity in rewards between head office and operational staff. Advice to Management None really. Suppose only request would be to utilise hubs/offices outside of London when considering requirements for corporate level roles.", "rating": 5, "pros": "Great place to work, albeit in the midst of ongoing transformation & from the perspective of someone working out of head office dept. but based in Nanchester.", "cons": "Pace of change at operational level can be slow, but may speed up with ongoing transformation/cultural change.", "advice": "None really. Suppose only request would be to utilise hubs/offices outside of London when considering requirements for corporate level roles."}, {"title": "Bupa", "text": "Pros Free medical assessments for staff, Makes you aware of the importance of living a healthy lifestyle. Cons Display of favouritsim is common", "rating": 3, "pros": "Free medical assessments for staff, Makes you aware of the importance of living a healthy lifestyle.", "cons": "Display of favouritsim is common", "advice": null}, {"title": "Working at Bupa", "text": "Pros A great place to work that now offers potential Global experience, being one of the largest Health and Care Companies in the world. Now a very forward thinking organisation that offers great opportunities for Business Analysts and other IT Professionals. Employees have a number of excellent benefits and are very well looked after. Cons Change does not happen quickly, but this does add to the challenge of working in IT and Change management Advice to Management Great Company, Great people, continue onwards!", "rating": 5, "pros": "A great place to work that now offers potential Global experience, being one of the largest Health and Care Companies in the world. Now a very forward thinking organisation that offers great opportunities for Business Analysts and other IT Professionals.", "cons": "Change does not happen quickly, but this does add to the challenge of working in IT and Change management", "advice": "Great Company, Great people, continue onwards!"}, {"title": "Good company", "text": "Pros Global business, with good focus on purpose. Cons Talent management could be better.", "rating": 5, "pros": "Global business, with good focus on purpose.", "cons": "Talent management could be better.", "advice": null}, {"title": "Not the best place to work", "text": "Pros Company has a great marketing strategy when it come to attract talent and provides employees with dental and health insurance benefits. Cons The HR department only has one thing in mind - THE COMPANY!!!!! People are not valued and the management only have one thing in mind - profitability, customers and employees are definitely not a priority in this environment.", "rating": 3, "pros": "Company has a great marketing strategy when it come to attract talent and provides employees with dental and health insurance benefits.", "cons": "The HR department only has one thing in mind - THE COMPANY!!!!!", "advice": null}, {"title": "Sales and Customer Service", "text": "Pros Help customers with their different health needs Cons low remuneration. store managers changing all the time and one worse than the other Advice to Management build up more pipelines for employee's career development", "rating": 3, "pros": "Help customers with their different health needs", "cons": "low remuneration. store managers changing all the time and one worse than the other", "advice": "build up more pipelines for employee's career development"}, {"title": "Assistant chef role", "text": "Pros Guaranteed contracted hours Not many other benefits I'm afraid Cons Bupa have a bad reputation from both residents/families and staff feedback. Managers are manipulative, stretchjng your duties to suit them.", "rating": 3, "pros": "Guaranteed contracted hours", "cons": "Bupa have a bad reputation from both residents/families and staff feedback.", "advice": null}, {"title": "Stable work environment", "text": "Pros People are friendly Not too much pressure Fringe benefits are not bad Overtime work sometimes Office is clean and neat Cons Lack of career advancement Doing things for the sake of doing Managers are bureaucratic and passive, especially whose serviced 10+ years Advice to Management For years, management keep saying the career development will be available. Please make sure to apply a discount adjustment to the GPS scores, people were well prepared before giving their ratings thx!", "rating": 3, "pros": "People are friendly", "cons": "Lack of career advancement", "advice": "For years, management keep saying the career development will be available."}, {"title": "Working in Bupa Asia", "text": "Pros Bupa Asia has a very cohesive work environment, colleagues are very willing to work across departmental lines to ensure positive outcomes for clients. Cons Some departments are required to work half saturdays.", "rating": 5, "pros": "Bupa Asia has a very cohesive work environment, colleagues are very willing to work across departmental lines to ensure positive outcomes for clients.", "cons": "Some departments are required to work half saturdays.", "advice": null}, {"title": "Great Company to Work For", "text": "Pros Good development and support Great culture Good benefits Fantastic company to work for Cons Old IT systems are a little inefficient Like all large companies a little politics in dealing with other departments but very managable", "rating": 5, "pros": "Good development and support", "cons": "Old IT systems are a little inefficient", "advice": null}, {"title": "Uncaring and unsympathetic management", "text": "Pros Not too far to commute Cons No training Uncaring management Terrible rates of pay Expected to do long hours without any thanks Advice to Management Look after your staff and appreciate that they work extremely hard, often very long hours with no breaks. If they start to feel unappreciated they will not stick around.", "rating": 1, "pros": "Not too far to commute", "cons": "No training", "advice": "Look after your staff and appreciate that they work extremely hard, often very long hours with no breaks. If they start to feel unappreciated they will not stick around."}, {"title": "care", "text": "Pros You get to know your colleagues and manager Flexible shifts You are getting to know the residents and families of residents which can be very rewarding Cons Not enough room to progress in your career according to your abilities Pretty much always short of staff Certain staff don't put in the same effort to contribute to team work Advice to Management better recruitment management as certain people are there just for having a job and not contributing to residents care or company as a whole", "rating": 5, "pros": "You get to know your colleagues and manager", "cons": "Not enough room to progress in your career according to your abilities", "advice": "better recruitment management as certain people are there just for having a job and not contributing to residents care or company as a whole"}, {"title": "GSO", "text": "Pros good team to work with Cons NO good salary, very less salary Advice to Management good leadership necessary", "rating": 3, "pros": "good team to work with", "cons": "NO good salary, very less salary", "advice": "good leadership necessary"}, {"title": "Nice place", "text": "Pros good environment, and a lot opportunity Cons too much work, that barley see your family", "rating": 5, "pros": "good environment, and a lot opportunity", "cons": "too much work, that barley see your family", "advice": null}, {"title": "All talk and no action", "text": "Pros Location & discounted health fund benefits Cons It's a very professionally immature organisation with a misogynist and bullying workplace culture. Bupa is a boy's club, particularly in the digital transformation team. Do not work in this department if you are female and/or are gay. You will not be treated well or given the opportunities you deserve. Not only is the culture a problem, long standing staff in digital do not understand the basics of accessibility and usability. If you have accepted a job in the digital team, do not stay here long as Bupa does not have a good reputation in the industry and you will find it hard to get another job. Advice to Management Get the basics right. Do not allow male staff to treat female managers and staff with disrespect. If you want to be seen as an equal opportunity employer, then treat people equally. Stop hiring people in digital who have aggressive and competitive personalities and get rid of the dead wood who have been at the organisation for five years or more.", "rating": 1, "pros": "Location & discounted health fund benefits", "cons": "It's a very professionally immature organisation with a misogynist and bullying workplace culture. Bupa is a boy's club, particularly in the digital transformation team. Do not work in this department if you are female and/or are gay. You will not be treated well or given the opportunities you deserve. Not only is the culture a problem, long standing staff in digital do not understand the basics of accessibility and usability. If you have accepted a job in the digital team, do not stay here long as Bupa does not have a good reputation in the industry and you will find it hard to get another job.", "advice": "Get the basics right. Do not allow male staff to treat female managers and staff with disrespect. If you want to be seen as an equal opportunity employer, then treat people equally. Stop hiring people in digital who have aggressive and competitive personalities and get rid of the dead wood who have been at the organisation for five years or more."}, {"title": "Room to improve", "text": "Pros -Work/life balance -Great people -Benefits Cons -Misdirected strategy -Pay is not competitive Advice to Management Focus on the core business until we can stabilize the ship. Worry about 'nice to have' projects later", "rating": 5, "pros": "-Work/life balance -Great people -Benefits", "cons": "-Misdirected strategy", "advice": "Focus on the core business until we can stabilize the ship. Worry about 'nice to have' projects later"}, {"title": "Bupa", "text": "Pros procedures are clear and works very well Cons nothing at all. atmosphere is really supporting Advice to Management keep on doing so well in the future", "rating": 5, "pros": "procedures are clear and works very well", "cons": "nothing at all. atmosphere is really supporting", "advice": "keep on doing so well in the future"}, {"title": "More like a bank than a healthcare company", "text": "Pros nice head offices global business good bonuses Cons senior leadership team passive aggressive culture average people succeed over talent Advice to Management Live your proposition and stop navel gazing. Stop being profit greedy and genuinely put your people first", "rating": 3, "pros": "nice head offices", "cons": "senior leadership team", "advice": "Live your proposition and stop navel gazing. Stop being profit greedy and genuinely put your people first"}, {"title": "Salary", "text": "Pros Relaxed working environment Fair management Good team especially non-managerial colleagues Cons Poor pay compared to other Management style and managers still need a bit of training and update on how to manage people and workforce Advice to Management Sort your managers out and offer more managerial training to your managers", "rating": 3, "pros": "Relaxed working environment", "cons": "Poor pay compared to other", "advice": "Sort your managers out and offer more managerial training to your managers"}, {"title": "Bupa Management", "text": "Pros Great atmosphere, values and strong brand. As an employer they do think of everything and look after you quite a lot. Opportunities are available in the organisation if you ask and show willing. Cons The company on a semi annual basis moves everyone around hoping all the problems will go away.", "rating": 5, "pros": "Great atmosphere, values and strong brand. As an employer they do think of everything and look after you quite a lot. Opportunities are available in the organisation if you ask and show willing.", "cons": "The company on a semi annual basis moves everyone around hoping all the problems will go away.", "advice": null}, {"title": "Great benefits and work life", "text": "Pros The employees are amazing and there is a good sense of community. A lot of training is provided and there is a lot of motivation for us to do our best. Cons As a large company, there are a lot of bureaucratic processes for evaluating the employees. checking boxes instead of checking the human.", "rating": 5, "pros": "The employees are amazing and there is a good sense of community. A lot of training is provided and there is a lot of motivation for us to do our best.", "cons": "As a large company, there are a lot of bureaucratic processes for evaluating the employees. checking boxes instead of checking the human.", "advice": null}, {"title": "DO NOT Join Bupa Australia & New Zealand", "text": "Pros Great vision on paper, very fancy and attractive presentations Cons On paper and in marketing brochures, everything looks good. Under the hood, it is a messed organization. Do not join the 'Transformation' program. That program lacks clear direction and good communication. Senior leadership has some understanding, but middle management is playing their games. Pretty much every project manager is in a rush to get their browny points rather than worrying about teams and the actual work. They are solely relying on vendors to do the job without trusting staff. That's the norm. If you don't have a stamp from the vendor, then work is not recognized and appreciated. Extremely bureaucratic working environment with full of selfish managers. Advice to Management Care about people. They are here to work. \"Try\" to remove bureaucracy. Appreciate hard work by people.", "rating": 1, "pros": "Great vision on paper, very fancy and attractive presentations", "cons": "On paper and in marketing brochures, everything looks good. Under the hood, it is a messed organization. Do not join the 'Transformation' program. That program lacks clear direction and good communication. Senior leadership has some understanding, but middle management is playing their games. Pretty much every project manager is in a rush to get their browny points rather than worrying about teams and the actual work.", "advice": "Care about people. They are here to work. \"Try\" to remove bureaucracy. Appreciate hard work by people."}, {"title": "Manager", "text": "Pros Front line staff are great and work very, very hard Cons Senior Management are very poor Too many people sat behind desks making decisions Little care for the residents from management - purely profit orientated No accountability from senior management of the poor decisions they make Advice to Management None - they don't listen so a complete waste of expensive resource", "rating": 1, "pros": "Front line staff are great and work very, very hard", "cons": "Senior Management are very poor", "advice": "None - they don't listen so a complete waste of expensive resource"}, {"title": "Boring Bupa", "text": "Pros As a claims handler: +The canteen +Helping people in need of care +Offered chance to travel Cons - No room for thought, creativity or intelligence in all roles I came across - Dull non-varied work - Lack of career structure or investment in people - Senior management removed from rest of organisation Advice to Management Consider developing career plans and varying individuals work or continue to lose talent and intelligent individuals.", "rating": 3, "pros": "As a claims handler:", "cons": "- No room for thought, creativity or intelligence in all roles I came across", "advice": "Consider developing career plans and varying individuals work or continue to lose talent and intelligent individuals."}, {"title": "Manager", "text": "Pros Good exposure. Good medical coverage. Cons More decisions need to be reached during management meetings.", "rating": 3, "pros": "Good exposure. Good medical coverage.", "cons": "More decisions need to be reached during management meetings.", "advice": null}, {"title": "Understaffed, negative atmosphere between staff", "text": "Pros The lovely residents, care assistants who work so damn hard for little recognition. No more pros to say to be honest Cons Poor infection control! I was shocked by how awful it was after working in care for many years for different companies. Staff very negative towards each other and back stabbing. Incredibly understaffed for the amount of residents. Job more stressful than it needs to be due to lack of staff. Big turn around in staff Advice to Management Look at staff morale and increase staff levels", "rating": 1, "pros": "The lovely residents, care assistants who work so damn hard for little recognition. No more pros to say to be honest", "cons": "Poor infection control! I was shocked by how awful it was after working in care for many years for different companies.", "advice": "Look at staff morale and increase staff levels"}, {"title": "Carer", "text": "Pros Great people in some areas Cons Lost the original culture of caring and putting people first Advice to Management Get some people in who understand care homes", "rating": 3, "pros": "Great people in some areas", "cons": "Lost the original culture of caring and putting people first", "advice": "Get some people in who understand care homes"}, {"title": "Good Company", "text": "Pros Huge amount of support if required. Very good quality training and induction process. Such a big company you are able to search for support in any area. Cons Can be just a number. Employees not offered health care benefits. Large amount of paperwork, rules regulations and protocols. Some need updating.", "rating": 3, "pros": "Huge amount of support if required. Very good quality training and induction process.", "cons": "Can be just a number. Employees not offered health care benefits. Large amount of paperwork, rules regulations and protocols. Some need updating.", "advice": null}, {"title": "Business Units need to work together", "text": "Pros - Friendly Atmosphere - Very Good Benefits - Good pay once you stop doing a junior role Cons - Does not promote healthy eating/weight loss as much as they should - Business units do not work together Advice to Management Notice talent earlier, keep good staff and don't let them leave, provide mid year pay increases not yearly ones.", "rating": 5, "pros": "- Friendly Atmosphere", "cons": "- Does not promote healthy eating/weight loss as much as they should", "advice": "Notice talent earlier, keep good staff and don't let them leave, provide mid year pay increases not yearly ones."}, {"title": "Positive place to work", "text": "Pros Great work flexibility, opportunities galore, Great industry to be in as very stable. Cons Pay scale is below average for most of the roles across the board Advice to Management Look at paying above market rates for quality staff", "rating": 3, "pros": "Great work flexibility, opportunities galore, Great industry to be in as very stable.", "cons": "Pay scale is below average for most of the roles across the board", "advice": "Look at paying above market rates for quality staff"}, {"title": "One for all", "text": "Pros There are no pros at this place Cons Poor pay poor management work load to hard no sick pay holidays you have to book a year in advance then you still can't have the days you want Advice to Management Look after all your staff a bit more not the ones at the top", "rating": 1, "pros": "There are no pros at this place", "cons": "Poor pay poor management work load to hard no sick pay holidays you have to book a year in advance then you still can't have the days you want", "advice": "Look after all your staff a bit more not the ones at the top"}, {"title": "People", "text": "Pros fantastic culture, very values driven, purpose is very much lived and breathed. Cons Things can take time and there can be politics. Advice to Management Focus on the people", "rating": 5, "pros": "fantastic culture, very values driven, purpose is very much lived and breathed.", "cons": "Things can take time and there can be politics.", "advice": "Focus on the people"}, {"title": "Highly recommended for marketers in Australia", "text": "Pros Great range of opportunities, supportive management, and fantastic purpose. Cons Consultative culture - this is a strength and at times a weakness (this can impact timeliness of decisions).", "rating": 5, "pros": "Great range of opportunities, supportive management, and fantastic purpose.", "cons": "Consultative culture - this is a strength and at times a weakness (this can impact timeliness of decisions).", "advice": null}, {"title": "zero contract", "text": "Pros offer great health care for staff Cons zero contract hours are not guaranteed Advice to Management lose the zero contract hours altogether", "rating": 3, "pros": "offer great health care for staff", "cons": "zero contract hours are not guaranteed", "advice": "lose the zero contract hours altogether"}, {"title": "Great place to work", "text": "Pros Excellent team and great culture. Everyone is very friendly and understanding Cons Decisions regarding contract renewal / permanency was very very slow. Advice to Management Make decisions faster.", "rating": 5, "pros": "Excellent team and great culture. Everyone is very friendly and understanding", "cons": "Decisions regarding contract renewal / permanency was very very slow.", "advice": "Make decisions faster."}, {"title": "Good work life balance", "text": "Pros Good work life balance & salary is ok. Cons Static culture Need investment in tools and systems Advice to Management Diversity in the workplace & new blood would help", "rating": 3, "pros": "Good work life balance & salary is ok.", "cons": "Static culture", "advice": "Diversity in the workplace & new blood would help"}, {"title": "Healthcare Assistant", "text": "Pros Free meals 3 days on four days off Cons Poor management Low Staff ratio Senior healthcare assistants think they're nurses and refuse to help healthcare assistants Bullying Interrogation/Bullying when you call in sick Condescending attitude by management Refuse to give references Advice to Management The list is endless", "rating": 1, "pros": "Free meals", "cons": "Poor management", "advice": "The list is endless"}, {"title": "Don't know", "text": "Pros It is a friendly place to work in where nurses and carers can work together. There is some unity daily. Cons Some workers can be negative at times, while some would be happy to work together some can be quite destructive in trying to get the positive ones not to unite", "rating": 3, "pros": "It is a friendly place to work in where nurses and carers can work together. There is some unity daily.", "cons": "Some workers can be negative at times, while some would be happy to work together some can be quite destructive in trying to get the positive ones not to unite", "advice": null}, {"title": "Its a Big Corporate Company", "text": "Pros As a large company, it was nice to be working for a name that everyone recognised. Cons Communication amongst teams and management can be a problem at times.", "rating": 3, "pros": "As a large company, it was nice to be working for a name that everyone recognised.", "cons": "Communication amongst teams and management can be a problem at times.", "advice": null}, {"title": "COOP Trainee", "text": "Pros open and diverse environment, good managers. Cons sometimes the open environment causes some noises and make it hard to constraints.", "rating": 5, "pros": "open and diverse environment, good managers.", "cons": "sometimes the open environment causes some noises and make it hard to constraints.", "advice": null}, {"title": "Working in healthcare", "text": "Pros Jobs look good on paper Cons No support from management level Advice to Management Support your staff", "rating": 3, "pros": "Jobs look good on paper", "cons": "No support from management level", "advice": "Support your staff"}, {"title": "Great environment and culture", "text": "Pros Great people, lots of opportunities, training, and professional development. Cons Nothing I can think of", "rating": 5, "pros": "Great people, lots of opportunities, training, and professional development.", "cons": "Nothing I can think of", "advice": null}, {"title": "Care Assistant", "text": "Pros Permanent job, colleges are great Cons Very bad pay, things not very clear Advice to Management To invest more trying to keep the employees than to pay double to agency staff", "rating": 1, "pros": "Permanent job, colleges are great", "cons": "Very bad pay, things not very clear", "advice": "To invest more trying to keep the employees than to pay double to agency staff"}, {"title": "Home Cleaning", "text": "Pros This business is very good to work for and they make sure you get paid on time which. Cons They are good to work for so there are no bad things to say. Advice to Management It was great to work there and I would like to work there again.", "rating": 5, "pros": "This business is very good to work for and they make sure you get paid on time which.", "cons": "They are good to work for so there are no bad things to say.", "advice": "It was great to work there and I would like to work there again."}, {"title": "Underwriting", "text": "Pros The workload is acceptable comparing to other insurance company. Colleagues are friendly. Company encourages staff to do workout by offering subsidy for sport classes. Cons People are not proactive enough to make things done better. Slow growth in terms of career pathway.", "rating": 3, "pros": "The workload is acceptable comparing to other insurance company. Colleagues are friendly. Company encourages staff to do workout by offering subsidy for sport classes.", "cons": "People are not proactive enough to make things done better. Slow growth in terms of career pathway.", "advice": null}, {"title": "Good company .", "text": "Pros Healthy life style is genuinely a concern, not just for show. Encourage work-life balance and healthy life, Amazing working environment, On time salary. Cons Pay is low for a stressful job. Very rarely promote from within, lack of career advancement. You are pushed to your limits for minimum wage Advice to Management Instead of cutting every possible staff member and shoving the workload onto the employee, add a few more sales floor staff.", "rating": 3, "pros": "Healthy life style is genuinely a concern, not just for show. Encourage work-life balance and healthy life, Amazing working environment, On time salary.", "cons": "Pay is low for a stressful job. Very rarely promote from within, lack of career advancement. You are pushed to your limits for minimum wage", "advice": "Instead of cutting every possible staff member and shoving the workload onto the employee, add a few more sales floor staff."}, {"title": "care", "text": "Pros Train towards nvq 2 and 3.Can make some of the residents day making them feel happy. Cons Unable to train higher than at nvq 3 can be a lot of back stabbing.Some managers un approachable.Feel as if your there just to do a job and not enough time to spend with the residents. Advice to Management Listen to your employees in what they have to say", "rating": 3, "pros": "Train towards nvq 2 and 3.Can make some of the residents day making them feel happy.", "cons": "Unable to train higher than at nvq 3 can be a lot of back stabbing.Some managers un approachable.Feel as if your there just to do a job and not enough time to spend with the residents.", "advice": "Listen to your employees in what they have to say"}, {"title": "Authoritarian management (not great leaders)", "text": "Pros Good pay, good health insurance discounts and great policy around what you can wear to work. Senior leaders don't seem to be aware of the way middle management treat their employees. Some managers are very good at managing up to keep leaders away from the 'mess' or seeing what's really going on. Cons Management need to stop thinking about themselves and climbing the corporate ladder, and think more about their customers and people. Do things right and the rest will follow. If your people aren't happy, and it clearly shows through low engagement results, rather than reward poor general managers with funding for ridiculously expensive projects, hold them accountable for people outcomes. Advice to Management Stop wasting your customers money unnecessarily. Moving money around in your annual budget to justify expenditure and blind side the MD won't help the bottom line. I challenge the health insurance leadership team to work in one another's business and ask people 1 on 1 what the teams think of their own directors. If people feel 'safe to be honest' they'll tell you the truth, which no one would dare say for fear of retribution. It's really sad but if you speak up you'll be shipped out.", "rating": 3, "pros": "Good pay, good health insurance discounts and great policy around what you can wear to work. Senior leaders don't seem to be aware of the way middle management treat their employees. Some managers are very good at managing up to keep leaders away from the 'mess' or seeing what's really going on.", "cons": "Management need to stop thinking about themselves and climbing the corporate ladder, and think more about their customers and people. Do things right and the rest will follow. If your people aren't happy, and it clearly shows through low engagement results, rather than reward poor general managers with funding for ridiculously expensive projects, hold them accountable for people outcomes.", "advice": "Stop wasting your customers money unnecessarily. Moving money around in your annual budget to justify expenditure and blind side the MD won't help the bottom line. I challenge the health insurance leadership team to work in one another's business and ask people 1 on 1 what the teams think of their own directors. If people feel 'safe to be honest' they'll tell you the truth, which no one would dare say for fear of retribution. It's really sad but if you speak up you'll be shipped out."}, {"title": "Head of", "text": "Pros Great culture. Lives it's values. Cons Still some employees in senior management who are from the old Bupa world and are holding the organisation back. Advice to Management Keep driving innovation. Customer focus with a view to leveraging technology and data.", "rating": 5, "pros": "Great culture. Lives it's values.", "cons": "Still some employees in senior management who are from the old Bupa world and are holding the organisation back.", "advice": "Keep driving innovation. Customer focus with a view to leveraging technology and data."}, {"title": "Working in a Bupa Paliative care unit", "text": "Pros Working for Bupa helped when I wanted to move on. Everyone has heard of the company and associates it with quality health care. Cons In reality Bup a pay their care assistants minimum wage. Severe and consistent under staffing resulted in stressed staff ord and patients who were emotionally and occupationally neglected. Heart breaking if you're looking for a job where you want to make a positive difference. Advice to Management Raise staffing levels and deliver a better service to the clients that pay huge sum's of money for their care.", "rating": 3, "pros": "Working for Bupa helped when I wanted to move on. Everyone has heard of the company and associates it with quality health care.", "cons": "In reality Bup a pay their care assistants minimum wage. Severe and consistent under staffing resulted in stressed staff ord and patients who were emotionally and occupationally neglected. Heart breaking if you're looking for a job where you want to make a positive difference.", "advice": "Raise staffing levels and deliver a better service to the clients that pay huge sum's of money for their care."}, {"title": "Resourcing Manager", "text": "Pros Good company culture with laid back coworkers Cons Slow in process and unclear unorganised structure", "rating": 5, "pros": "Good company culture with laid back coworkers", "cons": "Slow in process and unclear unorganised structure", "advice": null}, {"title": "Staff Nurse", "text": "Pros Not far from home. Reasonable salary. Good care staff. Other nurses okay. Management okay at times. Could do better. Cons Have only just sorted my pay out. Residents with very complex needs not always very well assessed. Room for improvement. Advice to Management Get it sorted. Management not appropriately qualified. Meals for residents not to bad could do better though. Room for improvement.", "rating": 3, "pros": "Not far from home. Reasonable salary. Good care staff. Other nurses okay. Management okay at times. Could do better.", "cons": "Have only just sorted my pay out. Residents with very complex needs not always very well assessed. Room for improvement.", "advice": "Get it sorted. Management not appropriately qualified. Meals for residents not to bad could do better though. Room for improvement."}, {"title": "A truly great place to work if you're happy at your level", "text": "Pros Genuine commitment to employees' well-being Passionate about making a difference in the health industry Employees encouraged to leave on time and not overwork Cons Work output and skills are expected to be completely homogeneous and interchangeable with team-mates', being stronger in some areas and weaker in others is considered bad Little room for individuality Little chance of career advancement Advice to Management Express what you want more clearly - set the true expectations up front", "rating": 5, "pros": "Genuine commitment to employees' well-being", "cons": "Work output and skills are expected to be completely homogeneous and interchangeable with team-mates', being stronger in some areas and weaker in others is considered bad", "advice": "Express what you want more clearly - set the true expectations up front"}, {"title": "Great working environment but financials has to improve", "text": "Pros Great facilities inside the office: gym, cafe and resturants and kindergarten Good appreciation of hard workers and talents Fast growing company for people don't like routine Cons Financial packages are not competitive, HR put many restrictions on employee promotion, trainings and career advancement Some colleagues are not qualified but the company keep them", "rating": 5, "pros": "Great facilities inside the office: gym, cafe and resturants and kindergarten", "cons": "Financial packages are not competitive, HR put many restrictions on employee promotion, trainings and career advancement", "advice": null}, {"title": "great", "text": "Pros team spirit everybody is really friendly opportunities to grow great employment perks Cons retail management is a bit all over the place some of the time... they have lowered there HI discount", "rating": 5, "pros": "team spirit everybody is really friendly", "cons": "retail management is a bit all over the place some of the time...", "advice": null}, {"title": "not Great", "text": "Pros Internal team I worked with was wonderful Cons .. ... ... ... ...", "rating": 3, "pros": "Internal team I worked with was wonderful", "cons": ".. ... ... ... ...", "advice": null}, {"title": "Administrator", "text": "Pros Opportunity to pay it forward and care for people who need it, some opportunity to progress your career (depending on who you are). Cons Lousy pay and annual leave, very obvious hierarchical structure, disorganised lower management, BUREAUCRATIC, complete detachment of central offices who carried out analysis and formed processes from the care homes where the actual services were provided. Advice to Management I had the pleasure of meeting a couple of people in higher management, These people were smart and professional, however, at the time they needed to be more aware of what was going on at lower levels.", "rating": 3, "pros": "Opportunity to pay it forward and care for people who need it, some opportunity to progress your career (depending on who you are).", "cons": "Lousy pay and annual leave, very obvious hierarchical structure, disorganised lower management, BUREAUCRATIC, complete detachment of central offices who carried out analysis and formed processes from the care homes where the actual services were provided.", "advice": "I had the pleasure of meeting a couple of people in higher management, These people were smart and professional, however, at the time they needed to be more aware of what was going on at lower levels."}, {"title": "Room for Improvement", "text": "Pros Excellent team spirit within my role, great manager. The team ran incentives, which was a great way to keep staff motivated. Cons The job became very dull doing the same thing every day, I wanted to progress but wasn't given the opportunity...I was told I wouldn't get the job above me anyway which was a real incentive to apply in the first place...NOT! The training was very limited and every time I asked management about it, I was told to go online and look at what e-learning courses were on offer or day training. The wage was extremely low for the job I was doing...I was travelling up & down the country doing recruitment events and ran off my feet everyday, but the salary I was getting paid was way below market level Advice to Management Review salaries, on-boarding for existing & new team members as well as their own personal development and training", "rating": 3, "pros": "Excellent team spirit within my role, great manager. The team ran incentives, which was a great way to keep staff motivated.", "cons": "The job became very dull doing the same thing every day, I wanted to progress but wasn't given the opportunity...I was told I wouldn't get the job above me anyway which was a real incentive to apply in the first place...NOT!", "advice": "Review salaries, on-boarding for existing & new team members as well as their own personal development and training"}, {"title": "Bupa", "text": "Pros near to where i live, continuous training, hours i want Cons unrealistic targets, move goalposts all the time, bad management Advice to Management listen to your minions we are what hold you up", "rating": 3, "pros": "near to where i live, continuous training, hours i want", "cons": "unrealistic targets, move goalposts all the time, bad management", "advice": "listen to your minions we are what hold you up"}, {"title": "All round: A great place to work.", "text": "Pros Open working environment, great organisational structure, passionate and productive workforce, high caliber employees, fun working atmosphere. Cons Usual corporate politics can apply on occasion. Advice to Management Don't squeeze staff financially when profits are great. Give them more not less!", "rating": 5, "pros": "Open working environment, great organisational structure, passionate and productive workforce, high caliber employees, fun working atmosphere.", "cons": "Usual corporate politics can apply on occasion.", "advice": "Don't squeeze staff financially when profits are great. Give them more not less!"}, {"title": "Unit Manager", "text": "Pros Take a lead in championing care for vulnerable adults Cons communication need to be maintained at all times Advice to Management Keep planning with staff for plans to be succesful", "rating": 5, "pros": "Take a lead in championing care for vulnerable adults", "cons": "communication need to be maintained at all times", "advice": "Keep planning with staff for plans to be succesful"}, {"title": "Sales and Customer Service Consultant", "text": "Pros Great team work, and caring working environment Cons Very busy environment to work Advice to Management Do not have any suggestions", "rating": 5, "pros": "Great team work, and caring working environment", "cons": "Very busy environment to work", "advice": "Do not have any suggestions"}, {"title": "Member services adviser", "text": "Pros Strong brand - cares about TCF. Gym and cafeteria Teams - worked with some really nice people On- time salary. I have come across and worked with very friendly and supportive teams and managers. If you are not worried about career advancement but a friendly working environment where you are allowed to use your initiative this role may be suitable. Cons Lack of career advancement - I working a few years without career advancement, applied for another role internally. No response from recruiter who i had to chase. I did not get the job. I asked why - I asked for positive and negative feedback so I could train and be capable. Summary feedback I have a lot of skills and experience and too experienced for the role. Internal communication. Not enough time to get some important things done such as paperwork to resolve queries smoothly, mostly on the phone taking calls. No much training for career advancement internally or to training opportunities to move across department. Most training provided is given specific to role you are already in so it is difficult to advance vertically or horizontally. High employee turnover - very intensive work environment, penalty for seconds late, pay could be better considering intensity of job Senior management turnover is also high - over 5 years and almost 4 CEO. This affects strategy, culture and morale Management spends too much time on meetings. Very highly intensive for calls and focus majorly on call volume, should recruit more people for calls. Invest in better PC systems that don’t crash. Monitored breaks including penalised toilet breaks which some managers might be breaking worker’s rights. Make sure you can prove reason everything you do should you be faced with a disciplinary. First 2yrs there, a great place to work - culture, morale, pay, overtime, expectations and then last 2 or 3 years with changes in management,culture changes, focused on cost excessively affected service one can provide to client, surge in complaints, reduced staff morale, auto-in calls, burn-out, high levels of stress Advice to Management Management changes so often and this affects the company culture, strategy, motivation, and morale. Also, listen more to your employees to rentain best staff, and to rentain and grow clients. In addition, there comes a point where cost-cutting strategies damages the brand.", "rating": 3, "pros": "Strong brand - cares about TCF.", "cons": "Lack of career advancement - I working a few years without career advancement, applied for another role internally. No response from recruiter who i had to chase. I did not get the job. I asked why - I asked for positive and negative feedback so I could train and be capable. Summary feedback I have a lot of skills and experience and too experienced for the role.", "advice": "Management changes so often and this affects the company culture, strategy, motivation, and morale. Also, listen more to your employees to rentain best staff, and to rentain and grow clients. In addition, there comes a point where cost-cutting strategies damages the brand."}, {"title": "Dont work there", "text": "Pros Used to be but not anymore Cons Poor management, new starters higher salary, no respect for existing staff Advice to Management Listen to staff", "rating": 3, "pros": "Used to be but not anymore", "cons": "Poor management, new starters higher salary, no respect for existing staff", "advice": "Listen to staff"}, {"title": "Terrible company", "text": "Pros They have great benefits apparently- but no one has ever been able to access them or would even know how to do so Cons Worst wages in the care sector. Management don't care about their employees. Understaffed and over worked. Low morale amongst employees. Management make it as difficult as possible to get a reference when employees are applying for new jobs (some even binned- when the employee isn't liked by the manager). Low staff skills as the people who they are taking on don't have any experience in nursing home care, just care in the community. High use of agency staff, which puts excess pressure on current employees who have to pick up the extra work on these shifts. No real progression prospects for carers Advice to Management Need to buck up their ideas, provide more support to staff and stop sweeping problems under the carpet.", "rating": 1, "pros": "They have great benefits apparently- but no one has ever been able to access them or would even know how to do so", "cons": "Worst wages in the care sector. Management don't care about their employees. Understaffed and over worked. Low morale amongst employees. Management make it as difficult as possible to get a reference when employees are applying for new jobs (some even binned- when the employee isn't liked by the manager). Low staff skills as the people who they are taking on don't have any experience in nursing home care, just care in the community. High use of agency staff, which puts excess pressure on current employees who have to pick up the extra work on these shifts. No real progression prospects for carers", "advice": "Need to buck up their ideas, provide more support to staff and stop sweeping problems under the carpet."}, {"title": "Excellent employer", "text": "Pros Lots of opportunity to move across departments and develop Cons Large company so can get frustrating to get things agreed", "rating": 5, "pros": "Lots of opportunity to move across departments and develop", "cons": "Large company so can get frustrating to get things agreed", "advice": null}, {"title": "senior manager", "text": "Pros Amazing purpose that brings everyone together and creates a drive to do good, meaningful work. Real and genuine commitment to managing your life with work being one aspect of this. Lots of opportunities to get involved in many many aspects of health and care due to diversity of business Cons The global structure and technology advancement are still in early days and so the pace of change can at times be challenging Advice to Management Keep going! It's a fantastic organisation with a great ambition", "rating": 5, "pros": "Amazing purpose that brings everyone together and creates a drive to do good, meaningful work. Real and genuine commitment to managing your life with work being one aspect of this. Lots of opportunities to get involved in many many aspects of health and care due to diversity of business", "cons": "The global structure and technology advancement are still in early days and so the pace of change can at times be challenging", "advice": "Keep going! It's a fantastic organisation with a great ambition"}, {"title": "none", "text": "Pros Convenient and flexible working pattern Cons Pay could be better i think Advice to Management pay better to keep employees", "rating": 5, "pros": "Convenient and flexible working pattern", "cons": "Pay could be better i think", "advice": "pay better to keep employees"}, {"title": "Ok", "text": "Pros Strong company purpose Nice people to work with A few great leaders to look up to and learn from Fast paced and good opportunity to learn Good growth potential for the business Good salary and benefits Gym & canteen Cons Clunky IT systems & processes in some business units and at Group Some negative leadership creating stressful and unpleasant atmosphere Advice to Management Put in place a clear strategy for IT financial systems development and don't let another 4-5 years go without clear progress. Resolve leadership issues to turn into positive leadership Monitor high turnover in key areas and activities to avoid reinventing the wheel", "rating": 3, "pros": "Strong company purpose", "cons": "Clunky IT systems & processes in some business units and at Group", "advice": "Put in place a clear strategy for IT financial systems development and don't let another 4-5 years go without clear progress."}, {"title": "Working with People with Dementia", "text": "Pros Permanent part-time gives the opportunity to work around children's commitments. It is easy to either swap shifts with co-workers or simply hand your shift to someone else. It's also easy to pick up additional shifts Cons Notice for additional shifts is often very short and roster system is somewhat complicated. More access to the person managing the roster would be great Advice to Management Use a more up-to-date roster system and the training that's provided could be more around shift times so that everybody can attend more easily.", "rating": 5, "pros": "Permanent part-time gives the opportunity to work around children's commitments. It is easy to either swap shifts with co-workers or simply hand your shift to someone else. It's also easy to pick up additional shifts", "cons": "Notice for additional shifts is often very short and roster system is somewhat complicated. More access to the person managing the roster would be great", "advice": "Use a more up-to-date roster system and the training that's provided could be more around shift times so that everybody can attend more easily."}, {"title": "Support Worker", "text": "Pros I loved every aspect of working for this company. Cons A sudden change with rotas - this happens all of the time in care work. Advice to Management Keep up the good work !!", "rating": 5, "pros": "I loved every aspect of working for this company.", "cons": "A sudden change with rotas - this happens all of the time in care work.", "advice": "Keep up the good work !!"}, {"title": "Great company", "text": "Pros Great place, people. Totally recommended Cons Growth too fast and loosing a bit in training", "rating": 5, "pros": "Great place, people. Totally recommended", "cons": "Growth too fast and loosing a bit in training", "advice": null}, {"title": "broken promise", "text": "Pros Met some nice people working for Bupa but that is not enough to even consider job with them Cons Job description on interview nothing like actual job - pay very low, Bupa employing people not trained or capable to do even basic jobs, often not even speaking basic English,staff not replaced so you have to do job for 2 people for the same pay. Rude staff and management without any medical background . whole place is just a big accident waiting to happen. Advice to Management stop being rude and start listening to staff when they come to them with complaints or concerns. do not fix things when they go wrong - listen to your staff and prevent them in the first place. give enough staff and hours to provide service our residents deserve.", "rating": 1, "pros": "Met some nice people working for Bupa but that is not enough to even consider job with them", "cons": "Job description on interview nothing like actual job - pay very low, Bupa employing people not trained or capable to do even basic jobs, often not even speaking basic English,staff not replaced so you have to do job for 2 people for the same pay. Rude staff and management without any medical background . whole place is just a big accident waiting to happen.", "advice": "stop being rude and start listening to staff when they come to them with complaints or concerns. do not fix things when they go wrong - listen to your staff and prevent them in the first place. give enough staff and hours to provide service our residents deserve."}, {"title": "Just like the NHS its full of opportunities for budding managers", "text": "Pros Pick up the phone for support. Neighbouring Bupa homes are supportive with new managers. Pay isnt the best but you can negotiate on interview. Cons Senior management changes like the seasons. Quality managers arent consistent. But that isnt a company issue, its a shame they carry the bupa brand. Advice to Management Keep a diary! Write your learnings and reflections. They can be very helpful in your growth as a manager.", "rating": 5, "pros": "Pick up the phone for support. Neighbouring Bupa homes are supportive with new managers. Pay isnt the best but you can negotiate on interview.", "cons": "Senior management changes like the seasons. Quality managers arent consistent. But that isnt a company issue, its a shame they carry the bupa brand.", "advice": "Keep a diary! Write your learnings and reflections. They can be very helpful in your growth as a manager."}, {"title": "Health advisor", "text": "Pros Excellent support and training Cons Low salary, less money than an entry level job with the NHS, but we are required to have a degree Advice to Management Salary review t stop the huge staff turnover", "rating": 3, "pros": "Excellent support and training", "cons": "Low salary, less money than an entry level job with the NHS, but we are required to have a degree", "advice": "Salary review t stop the huge staff turnover"}, {"title": "Talk the talk dont walk the walk", "text": "Pros Good concepts  promote change in culture and person first ideology Cons Do not embrace change although promote change Poor communication process  Authoritarian managment style ( not leadership) Poor HR department Advice to Management Get real", "rating": 3, "pros": "Good concepts", "cons": "Do not embrace change although promote change", "advice": "Get real"}, {"title": "Only work here if you dont care how you get treated", "text": "Pros Some staff are nice but not all and not very freindly. Staff very good to residents. The resident are lovly. Cons You are pushed to your limits for minimum wage no matter which day of the year you work. christmas day whatever. You work 12 hour shifts Then they call you up 2 hours after youv gone home to get you to work extra that day while your tryng to sleep. And your made to feel bad for refusing and not thanked if you say you will. Staff work minimum wage for no thanks. When they go off sick they are made to feel really bad and are shouted at by manager in front of other staff. Advice to Management Pay your workers a proper wage. Managers mum turned up to work at 5 in the morning then sitting around watching everyone else working. Felt like she was just there to check up on us. She spoke to us realy badly and disrespectfuly. Made it not a nice place to work. No wonder staff went off sick. Hated it.", "rating": 1, "pros": "Some staff are nice but not all and not very freindly. Staff very good to residents. The resident are lovly.", "cons": "You are pushed to your limits for minimum wage no matter which day of the year you work. christmas day whatever. You work 12 hour shifts Then they call you up 2 hours after youv gone home to get you to work extra that day while your tryng to sleep. And your made to feel bad for refusing and not thanked if you say you will. Staff work minimum wage for no thanks. When they go off sick they are made to feel really bad and are shouted at by manager in front of other staff.", "advice": "Pay your workers a proper wage. Managers mum turned up to work at 5 in the morning then sitting around watching everyone else working. Felt like she was just there to check up on us. She spoke to us realy badly and disrespectfuly. Made it not a nice place to work. No wonder staff went off sick. Hated it."}, {"title": "Work-life balance and a company in growth", "text": "Pros Encourage work-life balance and healthy life. Friendly colleagues with caring manager. Cons Very hard to get promoted. Not competitive bonus system. Frequent restructuring. Advice to Management Please invest more on your staff and don't let them go easily!", "rating": 5, "pros": "Encourage work-life balance and healthy life. Friendly colleagues with caring manager.", "cons": "Very hard to get promoted.", "advice": "Please invest more on your staff and don't let them go easily!"}, {"title": "Shame", "text": "Pros I'm sure all employees are really nice people. Cons Unprofessional; I was not given a pass until my second day in the role. Employees who didn't know who I was were letting me in and out of the building, where very confidential information is easily accessible. Absolutely no care is given in regards to health and safety training, ironic. Morale of workers is very low, as they are stretched very far and wide for minimum wage roles with no obvious managerial acknowledgement or care. There is no surprise that employees do not say anything as there was no evidence that managers were approachable or there to be spoken to. Advice to Management Those who are appreciated will always do more than expected.", "rating": 1, "pros": "I'm sure all employees are really nice people.", "cons": "Unprofessional; I was not given a pass until my second day in the role. Employees who didn't know who I was were letting me in and out of the building, where very confidential information is easily accessible. Absolutely no care is given in regards to health and safety training, ironic. Morale of workers is very low, as they are stretched very far and wide for minimum wage roles with no obvious managerial acknowledgement or care. There is no surprise that employees do not say anything as there was no evidence that managers were approachable or there to be spoken to.", "advice": "Those who are appreciated will always do more than expected."}, {"title": "Head housekeeper head supervisor head of hostess", "text": "Pros Do not bother if you have any sense working for Bupa they pay rubbish money and still expect all for nothing look at the website for the staff who are privie to emails mere dog body's not privvie to the amount they have made last year so you go the ones who get big bucks . I will. Not give up my job for you I will take my concerns to the public if they don't listen there is always CQC . Cons The choice of tuna or cheese only unless you work 12 hrs takey advice let them keep it bring your own Advice to Management Stop looking after your self do the job for the same money as we mere mortals do see how you like it", "rating": 3, "pros": "Do not bother if you have any sense working for Bupa they pay rubbish money and still expect all for nothing look at the website for the staff who are privie to emails mere dog body's not privvie to the amount they have made last year so you go the ones who get big bucks . I will. Not give up my job for you I will take my concerns to the public if they don't listen there is always CQC .", "cons": "The choice of tuna or cheese only unless you work 12 hrs takey advice let them keep it bring your own", "advice": "Stop looking after your self do the job for the same money as we mere mortals do see how you like it"}, {"title": "An amazing purpose and vision; with plenty of opportunity", "text": "Pros The first organisation I have worked for in 15 years that has such clarity of purpose, vision and values which really mean something to me which is fab! The culture is one of possibility - i.e. you can create your own career/developmental opportunities and so far I have been encouraged to follow them all through to completion. The business manages a great balance between people, profit and the customer (a very hard balance to strike). Overall - I have really enjoyed the last 18 months here at Bupa! Cons Being such a large organisation (80,000 people across all continents) it's sometimes difficult getting to grips with the expanse and diverse nature of what we do (one size does not fit all). Advice to Management Keep investing in people (as you do today) and continue to develop our digital presence", "rating": 5, "pros": "The first organisation I have worked for in 15 years that has such clarity of purpose, vision and values which really mean something to me which is fab! The culture is one of possibility - i.e. you can create your own career/developmental opportunities and so far I have been encouraged to follow them all through to completion. The business manages a great balance between people, profit and the customer (a very hard balance to strike). Overall - I have really enjoyed the last 18 months here at Bupa!", "cons": "Being such a large organisation (80,000 people across all continents) it's sometimes difficult getting to grips with the expanse and diverse nature of what we do (one size does not fit all).", "advice": "Keep investing in people (as you do today) and continue to develop our digital presence"}, {"title": "Awful", "text": "Pros The commitment of the staff at home level, the shiny reputation from the outside of the company. The promises at the start of employment. Cons The judgemental out of touch middle management. The lack of respect for employees mental health. The training is awful and not fit for purpose. The false belief that it's shiny reputation will keep customers coming through the door when the actual care, staffing levels, investment, food, nurses, staff knowledge and quality of care is absolutely awful", "rating": 1, "pros": "The commitment of the staff at home level, the shiny reputation from the outside of the company. The promises at the start of employment.", "cons": "The judgemental out of touch middle management. The lack of respect for employees mental health. The training is awful and not fit for purpose. The false belief that it's shiny reputation will keep customers coming through the door when the actual care, staffing levels, investment, food, nurses, staff knowledge and quality of care is absolutely awful", "advice": null}, {"title": "Very low salary compared to the work you're doing", "text": "Pros Free hot meal different alternative shifts (outings for the residents) Cons Low salary Bad management too few carers considering how many residents need 2 carers for each task No regular brakes and sometimes none carers don't stay long due to long hours, endless pressure from the management to do extra shifts and sometimes even hostile environment. Advice to Management Don't put 5 carers on a nightshift just because it's the policy. Assess how many carers are needed for each floor so those who need 2x assistance can get the service and help they need. If there're only 5 persons per nightshift and the half of residents need 2 carers it's impossible to fulfil both health and safety regulations and give them full service.", "rating": 3, "pros": "Free hot meal", "cons": "Low salary", "advice": "Don't put 5 carers on a nightshift just because it's the policy. Assess how many carers are needed for each floor so those who need 2x assistance can get the service and help they need. If there're only 5 persons per nightshift and the half of residents need 2 carers it's impossible to fulfil both health and safety regulations and give them full service."}, {"title": "Friendly but Unorganised", "text": "Pros The people here are what makes the job worthwhile. That and the pay. I work in an amazing team, who not only support each other but are genuinely, lovely people. The pay is really decent for the basic role that you're required to do and having private medical insurance for next to nothing is amazing. Cons The management are reactive not proactive. The communication is brilliant at times and poor at others. Being short on staff creates high stress levels and a more demanding role. Advice to Management Hire more staff, work with people's talents, explain things that to you may be minor as they could be massive for front line staff. For example system issues or grey areas.", "rating": 3, "pros": "The people here are what makes the job worthwhile. That and the pay. I work in an amazing team, who not only support each other but are genuinely, lovely people. The pay is really decent for the basic role that you're required to do and having private medical insurance for next to nothing is amazing.", "cons": "The management are reactive not proactive. The communication is brilliant at times and poor at others. Being short on staff creates high stress levels and a more demanding role.", "advice": "Hire more staff, work with people's talents, explain things that to you may be minor as they could be massive for front line staff. For example system issues or grey areas."}, {"title": "Brilliant", "text": "Pros The pay is really good love it, and would go back Cons The hours they can be long and tough and tiring Advice to Management Understanding", "rating": 5, "pros": "The pay is really good love it, and would go back", "cons": "The hours they can be long and tough and tiring", "advice": "Understanding"}, {"title": "Worked here since 2002, Bupa is my home", "text": "Pros Wonderful people, no matter where you work (I have worked in many of our business and at approx 8 different locations). Our purpose of Longer, Healthier, Happier lives attracts and retains people with really great hearts. We are a large and expanding organisation with very exciting ambitions to make a significant improvement to the health of the world. Cons We operate in some really challenging markets/healthcare areas which mean that in some places resources aren't as plentiful as we'd like them to be. We're on a continual journey to address this.", "rating": 5, "pros": "Wonderful people, no matter where you work (I have worked in many of our business and at approx 8 different locations). Our purpose of Longer, Healthier, Happier lives attracts and retains people with really great hearts. We are a large and expanding organisation with very exciting ambitions to make a significant improvement to the health of the world.", "cons": "We operate in some really challenging markets/healthcare areas which mean that in some places resources aren't as plentiful as we'd like them to be. We're on a continual journey to address this.", "advice": null}, {"title": "Great place to work!", "text": "Pros Supportive and inspiring managers, capable employees, fun working environment, good benefits, interesting work, genuine connection to business purpose, a real sense of change and momentum for the better! Cons Lack of modern technology/digital, poor systems", "rating": 5, "pros": "Supportive and inspiring managers, capable employees, fun working environment, good benefits, interesting work, genuine connection to business purpose, a real sense of change and momentum for the better!", "cons": "Lack of modern technology/digital, poor systems", "advice": null}, {"title": "Understaffed, underpaid and under appreciated", "text": "Pros You build good relationships with most staff you work with. You grow attached to the residents and form a connection with them. You get meals there. You get to choose to do nightshifts vs dayshifts Cons The pay you receive for the amount of work you do is terrible. It is very understaffed, with some staff not pulling their weight. You do not get much, or any real help from management regarding workplace issues. They have changed the policy for overtime pay, so there is even less incentive to work overtime. Staff are over worked and under appreciated, with management/people with more administrative roles not fully understanding the amount of time and effort that goes into the job.", "rating": 3, "pros": "You build good relationships with most staff you work with.", "cons": "The pay you receive for the amount of work you do is terrible.", "advice": null}, {"title": "Head of Talent", "text": "Pros There are great people to work with and it makes a difference to work for an organisation that has a values led purpose. It is inspirational. Cons It is a big organisation that has grown up organically and hence some of the technology and systems are not great", "rating": 5, "pros": "There are great people to work with and it makes a difference to work for an organisation that has a values led purpose. It is inspirational.", "cons": "It is a big organisation that has grown up organically and hence some of the technology and systems are not great", "advice": null}, {"title": "Transforming", "text": "Pros Bupa is transforming into a health company. Focus is firmly on the customer. Great people. Great vision. Is maturing in its approach and management. Cons Some of the management team were out to prove themselves more than work together. Has become a bit cliquey. Advice to Management Trust others, work together and be transparent", "rating": 5, "pros": "Bupa is transforming into a health company. Focus is firmly on the customer. Great people. Great vision. Is maturing in its approach and management.", "cons": "Some of the management team were out to prove themselves more than work together. Has become a bit cliquey.", "advice": "Trust others, work together and be transparent"}, {"title": "Good company", "text": "Pros Good pay great incentive in the sales department. Fantastic people in the company Cons Managers coming up with ideas that don't work in practice. Only really get promotion if you know the right people. Advice to Management Listen to staff more", "rating": 5, "pros": "Good pay great incentive in the sales department. Fantastic people in the company", "cons": "Managers coming up with ideas that don't work in practice.", "advice": "Listen to staff more"}, {"title": "Great culture & people, working on outdated processes & technoligies", "text": "Pros The purpose of the company (longer, healthier happier lives) really serves to bring people together for a common goal - everyone is committed and it generates a culture of helpfulness and ambition. The industry is also ever changing which means the business has to adapt, making it an agile & evolving place to be. Real commitment to work life balance, with challenging work balanced with an appreciation of life outside of work. Cons Bupa is supported and run by outdated systems and processes which holds up innovation and progression. There is also a disconnect in the global structure at the moment which means the company cannot realise it's true global value - for employees this shows up in career opportunities, leveraging information and sharing excellence. However, this is acknowledged and being worked on so should evolve in time. Advice to Management Focus on your people - get career paths and opportunities for development sorted, don't hide behind excuses of technology for lack of global collaboration and engagement.", "rating": 5, "pros": "The purpose of the company (longer, healthier happier lives) really serves to bring people together for a common goal - everyone is committed and it generates a culture of helpfulness and ambition. The industry is also ever changing which means the business has to adapt, making it an agile & evolving place to be. Real commitment to work life balance, with challenging work balanced with an appreciation of life outside of work.", "cons": "Bupa is supported and run by outdated systems and processes which holds up innovation and progression. There is also a disconnect in the global structure at the moment which means the company cannot realise it's true global value - for employees this shows up in career opportunities, leveraging information and sharing excellence. However, this is acknowledged and being worked on so should evolve in time.", "advice": "Focus on your people - get career paths and opportunities for development sorted, don't hide behind excuses of technology for lack of global collaboration and engagement."}, {"title": "Great place to work", "text": "Pros Bupa is a purpose drive organisation that truly cares about its people and is starting to put them front and centre of their business strategy - they understand that by caring about their people they will deliver brilliant customer service. Cons The ambition at Bupa is huge, which is admirable, but there are a some basics to fix at the same time as going after the more exciting things! Keeping aligned to it's Purpose of longer, healthier, happier lives keeps the frustrations at bay. Advice to Management Keep leading from the front in all that you do, role modelling behaviours is how your people will trust you and be inspired by you", "rating": 5, "pros": "Bupa is a purpose drive organisation that truly cares about its people and is starting to put them front and centre of their business strategy - they understand that by caring about their people they will deliver brilliant customer service.", "cons": "The ambition at Bupa is huge, which is admirable, but there are a some basics to fix at the same time as going after the more exciting things! Keeping aligned to it's Purpose of longer, healthier, happier lives keeps the frustrations at bay.", "advice": "Keep leading from the front in all that you do, role modelling behaviours is how your people will trust you and be inspired by you"}, {"title": "OK", "text": "Pros Flexible working - can work from home and pretty much choose hours. Nice office and canteen Cons Lots of contractors and people in management/senior roles that you don't feel deserve to be there. IT seem a poor relation compared to the rest of the business", "rating": 3, "pros": "Flexible working - can work from home and pretty much choose hours. Nice office and canteen", "cons": "Lots of contractors and people in management/senior roles that you don't feel deserve to be there. IT seem a poor relation compared to the rest of the business", "advice": null}, {"title": "Poor treatment of staff", "text": "Pros Modern homes, modern equipment, clean. Cons Treat staff poorly, blame staff whenever anything goes wrong. Poor management, unsupportive, and undervalued care staff. Advice to Management Treat staff with the same dignity and respect that you would expect your homes residents to get.", "rating": 3, "pros": "Modern homes, modern equipment, clean.", "cons": "Treat staff poorly, blame staff whenever anything goes wrong. Poor management, unsupportive, and undervalued care staff.", "advice": "Treat staff with the same dignity and respect that you would expect your homes residents to get."}, {"title": "Care about your people", "text": "Pros Some amazing people who have a passion for what they do. A great purpose which employees connect to. No shareholders. Cons Leaders need to take a good look in the mirror. Increased engagement relies on great leaders. We gave average managers but no inspirational leaders. We have a great purpose which attracts and retains people. However, there is no connection to our leaders. There's a massive gap that creates tension and a 'them' and 'us' atmosphere. Advice to Management Show that you care. Go and experience what our people do. Don't just visit a care home, be actively involved in their lives.", "rating": 3, "pros": "Some amazing people who have a passion for what they do.", "cons": "Leaders need to take a good look in the mirror. Increased engagement relies on great leaders. We gave average managers but no inspirational leaders.", "advice": "Show that you care. Go and experience what our people do. Don't just visit a care home, be actively involved in their lives."}, {"title": "Customer service", "text": "Pros A very satisfying job experience for someone passionate in helping other people . Cons Tedious, communication missing, less organised", "rating": 3, "pros": "A very satisfying job experience for someone passionate in helping other people .", "cons": "Tedious, communication missing, less organised", "advice": null}, {"title": "Care homes", "text": "Pros None as they don't listen to their staff. Cons Lots, very slow in all management situations. Advice to Management Get on the shop floor, stop hiding behind your desk. Listen to your workers.", "rating": 1, "pros": "None as they don't listen to their staff.", "cons": "Lots, very slow in all management situations.", "advice": "Get on the shop floor, stop hiding behind your desk. Listen to your workers."}, {"title": "Needs a global operating review", "text": "Pros People are very nice but too nice to run a commercial business Cons lack of processes, systems, resources, governance and democratic decision making means nothing get done quickly, professional or to best practice standards.", "rating": 3, "pros": "People are very nice but too nice to run a commercial business", "cons": "lack of processes, systems, resources, governance and democratic decision making means nothing get done quickly, professional or to best practice standards.", "advice": null}, {"title": "New Business Advisor / Business Administrator", "text": "Pros One of the best companies in health insurance sector. Cons No growth opportunities and room for development. Advice to Management STOP BEING BIASED AND TREAT ALL THE EMPLOYEES WITH RESPECT.", "rating": 5, "pros": "One of the best companies in health insurance sector.", "cons": "No growth opportunities and room for development.", "advice": "STOP BEING BIASED AND TREAT ALL THE EMPLOYEES WITH RESPECT."}, {"title": "Talks a great game", "text": "Pros Good salaries, great prospects for the right people and if the timing is right, good staff discounts (just reduced from 50% discount to 40%), good hours in retail. Cons Bupa TALKS about providing the best customer experience but human resources are stripped year on year. The retail network falls solely within the sales channel which results in all the pressure being to achieve sales KPIs and not enough resources to meet their existing customers' expectations. Given the choice between serving people in store and chasing sales, the customer loses every single time. There is a definite us and them mentality - If you are not completely on board and happy with everything all the time - you are out. There is lots of support if you are being bullied at work, but no action taken to stop/prevent it. Advice to Management Give us more people. Allow us enough resources to actually meet our commitments. Take your customer experience seriously.", "rating": 3, "pros": "Good salaries, great prospects for the right people and if the timing is right, good staff discounts (just reduced from 50% discount to 40%), good hours in retail.", "cons": "Bupa TALKS about providing the best customer experience but human resources are stripped year on year. The retail network falls solely within the sales channel which results in all the pressure being to achieve sales KPIs and not enough resources to meet their existing customers' expectations. Given the choice between serving people in store and chasing sales, the customer loses every single time.", "advice": "Give us more people. Allow us enough resources to actually meet our commitments. Take your customer experience seriously."}, {"title": "Hard work for little reward", "text": "Pros Lovely residents and a lovely job to do Cons Not enough pay for what you do, had no appraisal since I've worked here. Short Staffed. Advice to Management Pay staff more....especially if working nights.", "rating": 3, "pros": "Lovely residents and a lovely job to do", "cons": "Not enough pay for what you do, had no appraisal since I've worked here. Short Staffed.", "advice": "Pay staff more....especially if working nights."}, {"title": "you need to love your job", "text": "Pros not really any pros that stand out Cons no company sick pay....no long term service bonus.....all bupa care about is 'bums in beds' .....no unsociable hours incentives....minimum wage", "rating": 3, "pros": "not really any pros that stand out", "cons": "no company sick pay....no long term service bonus.....all bupa care about is 'bums in beds' .....no unsociable hours incentives....minimum wage", "advice": null}, {"title": "Would not recommend working in", "text": "Pros Good Salary, Flexible environment though Cons No emphasis on employee development. Lots of work with very less recognition. Teams are pretty structureless and all analysis work is overtaken my mangement decision because of which very less morale. Advice to Management Please ask HR to take employee complaints seriously.", "rating": 1, "pros": "Good Salary, Flexible environment though", "cons": "No emphasis on employee development. Lots of work with very less recognition. Teams are pretty structureless and all analysis work is overtaken my mangement decision because of which very less morale.", "advice": "Please ask HR to take employee complaints seriously."}, {"title": "lovely home, disappointment with outcome", "text": "Pros Lovely friendly home, clean and welcoming. great place to work. Cons Staff were a little rude and felt like picking on new people. Advice to Management cant fault your work, when i worked there it was different", "rating": 5, "pros": "Lovely friendly home, clean and welcoming. great place to work.", "cons": "Staff were a little rude and felt like picking on new people.", "advice": "cant fault your work, when i worked there it was different"}, {"title": "What happened to a great company", "text": "Pros Pension, staff benefits and working in healthcare Cons CEO and the consultants GAP he has brought in are a nightmare, 75% of past senior leadership and talent have left he company fed up with new approach, increasingly detached mindset with not sufficient focus on service. Advice to Management Get rid of the consultants", "rating": 1, "pros": "Pension, staff benefits and working in healthcare", "cons": "CEO and the consultants GAP he has brought in are a nightmare, 75% of past senior leadership and talent have left he company fed up with new approach, increasingly detached mindset with not sufficient focus on service.", "advice": "Get rid of the consultants"}, {"title": "Outstanding Company", "text": "Pros Amazing working environment, On time salary Cons No downsides at all for this", "rating": 5, "pros": "Amazing working environment, On time salary", "cons": "No downsides at all for this", "advice": null}, {"title": "customer services at bupa", "text": "Pros Benefits, PMI, Gym and meal allowance Cons Relative lack of training and coaching. Insufficient Process improvement focus Advice to Management Streamline processes better and provide staff with better training and growth opportunities", "rating": 5, "pros": "Benefits, PMI, Gym and meal allowance", "cons": "Relative lack of training and coaching. Insufficient Process improvement focus", "advice": "Streamline processes better and provide staff with better training and growth opportunities"}, {"title": "Gen Man", "text": "Pros Benefits, investment, non profit, pensions & health care Cons No I. T. Solutions, old management processes Advice to Management Move with the times", "rating": 3, "pros": "Benefits, investment, non profit, pensions & health care", "cons": "No I. T. Solutions, old management processes", "advice": "Move with the times"}, {"title": "Short staff, no care for resident,only good paper work", "text": "Pros Always i have seen very short staff, No good care for residents...example residents has been showered for once in month but in paper work they are showered daily. For 30 residents there is only 3 staff including senior carer .So please let me know how much care every resident can get from this staff.. Cons please stop doing paper work and give good care for the residents employ more staff.. Advice to Management Employe more staff and start thinking how much good care can u give for ur resident", "rating": 1, "pros": "Always i have seen very short staff, No good care for residents...example residents has been showered for once in month but in paper work they are showered daily. For 30 residents there is only 3 staff including senior carer .So please let me know how much care every resident can get from this staff..", "cons": "please stop doing paper work and give good care for the residents employ more staff..", "advice": "Employe more staff and start thinking how much good care can u give for ur resident"}, {"title": "Overview", "text": "Pros You are allowed to work at your own pace and sort out your workload. As long as you get the work done, you dont get the management breathing down your neck. Cons Not a good pay for the work you do, not very pleasant people to work with either.", "rating": 3, "pros": "You are allowed to work at your own pace and sort out your workload. As long as you get the work done, you dont get the management breathing down your neck.", "cons": "Not a good pay for the work you do, not very pleasant people to work with either.", "advice": null}, {"title": "good place to be", "text": "Pros Enjoy bupa's involvement in my career, their leadership and very caring attitude Cons bupa is a large company and that always has downfalls Advice to Management keep up the good work please", "rating": 5, "pros": "Enjoy bupa's involvement in my career, their leadership and very caring attitude", "cons": "bupa is a large company and that always has downfalls", "advice": "keep up the good work please"}, {"title": "Customer Services Manager", "text": "Pros A fantastic first year with Bupa, delighted with the personal development I have received with access to superb training and internal and external coaching. Never before have I experienced such growth as a manager with an organisation which takes a massive interest in my personal engagement. Huge encouragement to strive to go that extra mile for our customers and deliver an extra ordinary level of customer service. An organisation I have to say I am proud to work for. Cons With a Doctor available to see immediately on our Staines campus with a free Gym facility on site with personal coaching, this company is interested in my personal well being. Can't see any cons in that quite frankly. A hugely busy organisation where you are expected to work hard but with a huge array of benefits and world wide career opportunities. Advice to Management Keep doing what you are doing in engaging with your work force, it is clear to see this is leading to individuals contributing more discretionary effort, including me.", "rating": 5, "pros": "A fantastic first year with Bupa, delighted with the personal development I have received with access to superb training and internal and external coaching. Never before have I experienced such growth as a manager with an organisation which takes a massive interest in my personal engagement. Huge encouragement to strive to go that extra mile for our customers and deliver an extra ordinary level of customer service. An organisation I have to say I am proud to work for.", "cons": "With a Doctor available to see immediately on our Staines campus with a free Gym facility on site with personal coaching, this company is interested in my personal well being. Can't see any cons in that quite frankly. A hugely busy organisation where you are expected to work hard but with a huge array of benefits and world wide career opportunities.", "advice": "Keep doing what you are doing in engaging with your work force, it is clear to see this is leading to individuals contributing more discretionary effort, including me."}, {"title": "Mediocre", "text": "Pros Stable company, so if you want a permanent job with decent pay where you will be surrounded by average people then you'll be happy. Cons IT department has zero innovative leadership. Full of mediocre people who are happy with average and just want a pay check. Management is all about politics and empires. Advice to Management Appoint a technology driven CIO, one who is a technologist and not an accountant!", "rating": 3, "pros": "Stable company, so if you want a permanent job with decent pay where you will be surrounded by average people then you'll be happy.", "cons": "IT department has zero innovative leadership. Full of mediocre people who are happy with average and just want a pay check. Management is all about politics and empires.", "advice": "Appoint a technology driven CIO, one who is a technologist and not an accountant!"}, {"title": "Not the same!!!", "text": "Pros Great people within Discounted health insurance/ general insurance. Career Recognition to be working in such a large organization Cons Its not the same any more!!! Due to changes, it has become harder to be promoted from within, which was not the case 1-2 years ago! Corporate politics Inexperienced management. You end up feeling like a payroll number!!! Advice to Management Get your act together!! The turnover has risen so much and to make it worse its your highly experienced and achieving staff leaving. You will be left with staff who are both inexperienced but also dont care about Bupa the way older staff used to! Management have no real power! Reduce red tape! Your GPS will only continue to dwindle!!", "rating": 3, "pros": "Great people within", "cons": "Its not the same any more!!!", "advice": "Get your act together!!"}, {"title": "not too bad of a place", "text": "Pros training, ongoing progress, paid breaks Cons poor pay, long hours, only 30 mins lunch break", "rating": 3, "pros": "training, ongoing progress, paid breaks", "cons": "poor pay, long hours, only 30 mins lunch break", "advice": null}, {"title": "Customer Service", "text": "Pros Supportive collaborative environment: opportunities to move up in organisation: great colleagues, Cons Salary sucks, but no worst than other places Advice to Management Close the disparaties between the modes of management between the sites", "rating": 5, "pros": "Supportive collaborative environment: opportunities to move up in organisation: great colleagues,", "cons": "Salary sucks, but no worst than other places", "advice": "Close the disparaties between the modes of management between the sites"}, {"title": "Excellent company, great ambition, still maturing globally.", "text": "Pros Good pay, good benefits, exciting work place and good work/life balance. Cons Needs to mature more as a global company. No central services means central roles become less effective. Advice to Management Continue to progress centralised skills and encourage innovation within your management team. Don't get bogged down by GAP management overkill - it helps in most areas but its not the be all and end all...", "rating": 5, "pros": "Good pay, good benefits, exciting work place and good work/life balance.", "cons": "Needs to mature more as a global company. No central services means central roles become less effective.", "advice": "Continue to progress centralised skills and encourage innovation within your management team. Don't get bogged down by GAP management overkill - it helps in most areas but its not the be all and end all..."}, {"title": "Great Place to Work", "text": "Pros Having worked for Bupa for many years i can honestly say i have never worked for a better employer, i have been supported whilst bringing my children up where they have always been flexible and understanding in all situation, i have been encouraged and supported with career progression and exposed to many business areas which has vastly imporved my knowledge of the health care industry. We are kept well informed of Bupa's vision and how that involves everyone at Bupa, as well as expressing how important each indivduals role is in assisting the business achieve its goals Bupa also offer a wide range of employee benefits from private medical insurance, assisting with cost for gym memberships and annual health assesments, are to name but a few which your are encourage to take full advantage of Cons None great place to work Advice to Management Keep doing what your doing", "rating": 1, "pros": "Having worked for Bupa for many years i can honestly say i have never worked for a better employer, i have been supported whilst bringing my children up where they have always been flexible and understanding in all situation, i have been encouraged and supported with career progression and exposed to many business areas which has vastly imporved my knowledge of the health care industry. We are kept well informed of Bupa's vision and how that involves everyone at Bupa, as well as expressing how important each indivduals role is in assisting the business achieve its goals", "cons": "None great place to work", "advice": "Keep doing what your doing"}, {"title": "Project Manager", "text": "Pros Great support for employees to live a healthy lifestyle Flexible working environment Great discounts to health insurance Cons Limited training opportunities for continuous improvement", "rating": 3, "pros": "Great support for employees to live a healthy lifestyle", "cons": "Limited training opportunities for continuous improvement", "advice": null}, {"title": "Horrendous", "text": "Pros Lovely carers and lovely residents. Cons No support for deaths, unit manage made me suicidal. Home was too big and constantly understaffed. Advice to Management Offer staff support on their first death. Don't leave them to get on with it.", "rating": 1, "pros": "Lovely carers and lovely residents.", "cons": "No support for deaths, unit manage made me suicidal. Home was too big and constantly understaffed.", "advice": "Offer staff support on their first death. Don't leave them to get on with it."}, {"title": "Good pay - Rubbish managerment", "text": "Pros Good pay, Good benefits perks Cons Manager not concerned about staffs Health and well-being, rather working them to the max. Advice to Management Start looking at work moral and work/life balance", "rating": 1, "pros": "Good pay, Good benefits perks", "cons": "Manager not concerned about staffs Health and well-being, rather working them to the max.", "advice": "Start looking at work moral and work/life balance"}, {"title": "Internal development", "text": "Pros Nice offices. Good Agile/Scrum adoption - techniques actually used and supported properly which is rare. Cons Non-profit: no drive to compete on quality, operational efficiency, or growth. Graduate scheme roles had zero responsibility, level more suited to work experience for an A-level student. Very hard to get on even internally-run training courses, had to lobby hard to get *more* work to do to stave off boredom. Advice to Management Develop your staff more and you won't have to hire in very expensive consultants and contractors do to the work that matters.", "rating": 3, "pros": "Nice offices. Good Agile/Scrum adoption - techniques actually used and supported properly which is rare.", "cons": "Non-profit: no drive to compete on quality, operational efficiency, or growth. Graduate scheme roles had zero responsibility, level more suited to work experience for an A-level student. Very hard to get on even internally-run training courses, had to lobby hard to get *more* work to do to stave off boredom.", "advice": "Develop your staff more and you won't have to hire in very expensive consultants and contractors do to the work that matters."}, {"title": "Insecure employment experience", "text": "Pros First of all, the workplace facilities are really good. Plus, it's multinational, mixed and diversified. The packages they provide are pretty good. Cons Managers are bossy, i have face a manager that can't be called a leader. You might face managers with a lower degree than his employees, some use their employees to get manager's personal stuff done out of the org. I was insecure, where they let new managers terminate anyone just because they locate high possession with low degree and no foreign languages (low english). It wasn't a good environment at all, managers abuse employees easily there under the bureaucracy umbrella. That's one of the main reasons behind its high turnover rate. One of the heads there was employed in a company that has kicked him out per his management corruption and he has been employed at Bupa due to his strong business relations. We see Bupa employees applying in career fairs to other companies complaining about the unhealthy environment especially ladies. That's Bupa in Saudi Arabia. Advice to Management Eliminate the corrupted management heads in Jeddah.", "rating": 1, "pros": "First of all, the workplace facilities are really good. Plus, it's multinational, mixed and diversified. The packages they provide are pretty good.", "cons": "Managers are bossy, i have face a manager that can't be called a leader. You might face managers with a lower degree than his employees, some use their employees to get manager's personal stuff done out of the org. I was insecure, where they let new managers terminate anyone just because they locate high possession with low degree and no foreign languages (low english). It wasn't a good environment at all, managers abuse employees easily there under the bureaucracy umbrella. That's one of the main reasons behind its high turnover rate. One of the heads there was employed in a company that has kicked him out per his management corruption and he has been employed at Bupa due to his strong business relations. We see Bupa employees applying in career fairs to other companies complaining about the unhealthy environment especially ladies. That's Bupa in Saudi Arabia.", "advice": "Eliminate the corrupted management heads in Jeddah."}]