[{"title": "Finance Manager", "text": "Pros Great environment. Great Pay, Cons Takes time to move up Advice to Management Keep up the good work!", "rating": 5, "pros": "Great environment. Great Pay,", "cons": "Takes time to move up", "advice": "Keep up the good work!"}, {"title": "Assistant Project Manager", "text": "Pros Capita is likely to recruit you if you have the basic skills and willingness to learn quickly. There are also many opportunities to progress up the company Cons High staff turnover. You end up feeling like a small fish in a big ocean! The staff turn over is very high, teams are constantly changing", "rating": 3, "pros": "Capita is likely to recruit you if you have the basic skills and willingness to learn quickly. There are also many opportunities to progress up the company", "cons": "High staff turnover. You end up feeling like a small fish in a big ocean! The staff turn over is very high, teams are constantly changing", "advice": null}, {"title": "Too much cost cutting and not enough investment", "text": "Pros People I worked with were great and helpful. I learned a lot Cons Poor salary and general unwillingness from the top down to promote or keep anyone good", "rating": 3, "pros": "People I worked with were great and helpful. I learned a lot", "cons": "Poor salary and general unwillingness from the top down to promote or keep anyone good", "advice": null}, {"title": "Support Developer", "text": "Pros Good location. Just opposite parliament. Cons Low pay, hard work, treat you as a slave.", "rating": 1, "pros": "Good location. Just opposite parliament.", "cons": "Low pay, hard work, treat you as a slave.", "advice": null}, {"title": "Worst experience I ever had", "text": "Pros I don't think any advantage except location of company. Cons hopeless management, no transparency in any process, rules are different for different employee, rude and arrogant behavior by HR department. Advice to Management Need improvement in all area. Especially", "rating": 1, "pros": "I don't think any advantage except location of company.", "cons": "hopeless management, no transparency in any process, rules are different for different employee,", "advice": "Need improvement in all area. Especially"}, {"title": "ACCOUNT MANAGER", "text": "Pros Opportunity to progress for those wanting to progress in their careers. Cons poor leadership from senior mangers Advice to Management Explore new ways of working more effective than tick box exercise", "rating": 5, "pros": "Opportunity to progress for those wanting to progress in their careers.", "cons": "poor leadership from senior mangers", "advice": "Explore new ways of working more effective than tick box exercise"}, {"title": "Capita", "text": "Pros good people, good working hours Cons can feel like a number", "rating": 3, "pros": "good people, good working hours", "cons": "can feel like a number", "advice": null}, {"title": "company review on capita", "text": "Pros interesting work, though easy to get lost in company Cons company too big to make an impact, fingers in too many pies", "rating": 3, "pros": "interesting work, though easy to get lost in company", "cons": "company too big to make an impact, fingers in too many pies", "advice": null}, {"title": "Release Manager", "text": "Pros Employee friendly, Onsite opportunities, Good annual hike Cons politics, Transport is pathetic, all work is manual Advice to Management NA", "rating": 5, "pros": "Employee friendly, Onsite opportunities, Good annual hike", "cons": "politics, Transport is pathetic, all work is manual", "advice": "NA"}, {"title": "not bad", "text": "Pros nice staff alright projects relaxed environment close commute Cons low staff retention lack of training low pay", "rating": 3, "pros": "nice staff", "cons": "low staff retention", "advice": null}, {"title": "Easy, fun, stable and comfortable job", "text": "Pros Best work colleagues Easy money Good hours for students Cons Management doesn't know what they are doing half the time Policy changes almost every week and it is not communicated to staff Advice to Management Please communicate changes to staff better. We are not magically made aware of changes to policy.", "rating": 5, "pros": "Best work colleagues", "cons": "Management doesn't know what they are doing half the time", "advice": "Please communicate changes to staff better. We are not magically made aware of changes to policy."}, {"title": "Capita", "text": "Pros Good variety of work available Cons too much bureaucracy, which prevents adapting Advice to Management be open to more agile ways of working", "rating": 5, "pros": "Good variety of work available", "cons": "too much bureaucracy, which prevents adapting", "advice": "be open to more agile ways of working"}, {"title": "Capita debenhams", "text": "Pros Like school good fun Cons Poor wage overworked and jelous people Advice to Management GF your self", "rating": 3, "pros": "Like school good fun", "cons": "Poor wage overworked and jelous people", "advice": "GF your self"}, {"title": "BBC", "text": "Pros Good company to work for Cons Poor attendance hours with my current role Advice to Management Review current attendance hours for suitability", "rating": 3, "pros": "Good company to work for", "cons": "Poor attendance hours with my current role", "advice": "Review current attendance hours for suitability"}, {"title": "Good place to work", "text": "Pros Lots of support and career progression Cons Such a large organisation you can get lost in the numbers Advice to Management Na", "rating": 5, "pros": "Lots of support and career progression", "cons": "Such a large organisation you can get lost in the numbers", "advice": "Na"}, {"title": "Great Experience", "text": "Pros Capita outsources its services to many other companies, which one of them was Google. The atmosphere was amazing and the job was quite interesting. Hence, overall satisfaction levels are pretty high! Cons Since Capita is a large organization, difference processes in it are quite slow - but it's very much understood and reasonable for such large companies.", "rating": 5, "pros": "Capita outsources its services to many other companies, which one of them was Google. The atmosphere was amazing and the job was quite interesting. Hence, overall satisfaction levels are pretty high!", "cons": "Since Capita is a large organization, difference processes in it are quite slow - but it's very much understood and reasonable for such large companies.", "advice": null}, {"title": "I’ve had a lot worse, but have had better.", "text": "Pros Fairly professional in their communication, they send out the employees surveys but difficult to assess if it’s just corporate lip service. My line manager is pretty good, any issues have just been him following company process not with them personally. Cons A bit inflexible and unfair at times, we work remotely using a PDA - mine malfunctioned and I couldn’t work for the day while I awaited a replacement. After I was told I had to make up the hours I didn’t work. So if HQ staff turn up to work and the IT systems are down all day would they be told they had to come in and make up their hours on a Saturday? Probably not... Be prepared to work till 9pm on the TVL contract, not too bad in July but pretty rubbish in the winter.. Advice to Management Just bear in mind how hard the TVL contract is, knocking peoples doors on the winter at 8 pm and the response we receive at times.", "rating": 3, "pros": "Fairly professional in their communication, they send out the employees surveys but difficult to assess if it’s just corporate lip service.", "cons": "A bit inflexible and unfair at times, we work remotely using a PDA - mine malfunctioned and I couldn’t work for the day while I awaited a replacement. After I was told I had to make up the hours I didn’t work. So if HQ staff turn up to work and the IT systems are down all day would they be told they had to come in and make up their hours on a Saturday? Probably not...", "advice": "Just bear in mind how hard the TVL contract is, knocking peoples doors on the winter at 8 pm and the response we receive at times."}, {"title": "working for capita", "text": "Pros good training and career opportunities Cons long hours can sometimes be involced", "rating": 3, "pros": "good training and career opportunities", "cons": "long hours can sometimes be involced", "advice": null}, {"title": "Company Review", "text": "Pros Renowned, Good for Freshers to work at. Cons Punctual, Only formals, No leave", "rating": 5, "pros": "Renowned, Good for Freshers to work at.", "cons": "Punctual, Only formals, No leave", "advice": null}, {"title": "capita", "text": "Pros Helped me develop my skills and enhance my knowledge . Cons I am Looking for a new challenge, to broaden my horizons.", "rating": 3, "pros": "Helped me develop my skills and enhance my knowledge .", "cons": "I am Looking for a new challenge, to broaden my horizons.", "advice": null}, {"title": "My experience so far in the company", "text": "Pros good work experience, nice staff Cons not offering enough internships and work placements Advice to Management Invest more in training and create more opportunities for graduates", "rating": 3, "pros": "good work experience, nice staff", "cons": "not offering enough internships and work placements", "advice": "Invest more in training and create more opportunities for graduates"}, {"title": "Business Analyst", "text": "Pros The location is very ideal Cons The wages are very poor starting off Advice to Management Improve Salaries", "rating": 3, "pros": "The location is very ideal", "cons": "The wages are very poor starting off", "advice": "Improve Salaries"}, {"title": "Average call centre", "text": "Pros Normal call centre Can be quiet when there are no calls, very busy when in winter One/ two experienced managers Cons The majority of managers have no idea what they are doing Most are inexperienced No career progression, this is not a job you can develop in Advice to Management Get some training", "rating": 3, "pros": "Normal call centre", "cons": "The majority of managers have no idea what they are doing", "advice": "Get some training"}, {"title": "Good learning experience, but very little support", "text": "Pros Big company, fast moving, you can gain a great deal of experience in a short space of time. Cons Long hours, little support from management, dictatorial environment Advice to Management Be more supportive of your employees", "rating": 3, "pros": "Big company, fast moving, you can gain a great deal of experience in a short space of time.", "cons": "Long hours, little support from management, dictatorial environment", "advice": "Be more supportive of your employees"}, {"title": "Capita Employee Benefits in Sheffield. The worst job I have ever had!", "text": "Pros To be honest I can’t think of one positive after working at Capita employee benefits. I’m sure there are better parts of capita to work in though. Cons The most unhappy workplace I have ever worked in. Managers crying in the toilets, poor training and a complete lack of support. Advice to Management Take ownership of your business. Don’t trust your service delivery managers and audit the operation from top to bottom.", "rating": 1, "pros": "To be honest I can’t think of one positive after working at Capita employee benefits. I’m sure there are better parts of capita to work in though.", "cons": "The most unhappy workplace I have ever worked in. Managers crying in the toilets, poor training and a complete lack of support.", "advice": "Take ownership of your business. Don’t trust your service delivery managers and audit the operation from top to bottom."}, {"title": "It was a disaster", "text": "Pros Free coffee and pastries during training. The training counts towards revalidation. Nice office to work in. Some of the staff are nice. Cons The advert describing the job is very deceptive. It was it is a 37.5 hour week. This is not true. The shifts are 8-1 or 1-6 totalling 5 hours. That's 4 claimants to assess. The write-up time for each of these is 1.5 hours each. That's a further 6 hours added into your day. Then there is preparation for the following days assessments which takes at least an hour. In total you are looking at a 12 hour day. Also the position is advertised as permanent. One of the first things they tell you on the training is that if you don't pass the training you will have to leave the business. This is no idle threat either. They fired 5 other trainees who did not pass. Furthermore is you do manage to pass the demanding and intense training at your first meeting with the line manager you are told capita will dismiss anyone who does get 5 acceptable reports in a row in the first month and a half of starting the job. This applied to keeping up with cpd course too. Advice to Management I would like to say be upfront and honest when advertising these positions about the basics like the hours of work and the kind of contract people are entering into. However I can't see how capita could be honest about this because if they were nobody would apply.", "rating": 1, "pros": "Free coffee and pastries during training.", "cons": "The advert describing the job is very deceptive. It was it is a 37.5 hour week. This is not true. The shifts are 8-1 or 1-6 totalling 5 hours. That's 4 claimants to assess. The write-up time for each of these is 1.5 hours each. That's a further 6 hours added into your day. Then there is preparation for the following days assessments which takes at least an hour. In total you are looking at a 12 hour day. Also the position is advertised as permanent. One of the first things they tell you on the training is that if you don't pass the training you will have to leave the business. This is no idle threat either. They fired 5 other trainees who did not pass. Furthermore is you do manage to pass the demanding and intense training at your first meeting with the line manager you are told capita will dismiss anyone who does get 5 acceptable reports in a row in the first month and a half of starting the job. This applied to keeping up with cpd course too.", "advice": "I would like to say be upfront and honest when advertising these positions about the basics like the hours of work and the kind of contract people are entering into. However I can't see how capita could be honest about this because if they were nobody would apply."}, {"title": "Times are a-changing", "text": "Pros The people I work with are great, and they trust you to do a good job - you don't have to jump through hoops to get things done and approved. There is a new CEO who has made a very good first impression and wants to change the culture at Capita. Cons Communication is terrible. Things are never formalised, so you hear about things through rumour and suddenly those things are in place but no formal communication. People aren't important, team meetings get cancelled, personal development isn't taken seriously. Advice to Management Have a clear strategy, communicate that strategy clearly, and value your people.", "rating": 3, "pros": "The people I work with are great, and they trust you to do a good job - you don't have to jump through hoops to get things done and approved.", "cons": "Communication is terrible. Things are never formalised, so you hear about things through rumour and suddenly those things are in place but no formal communication. People aren't important, team meetings get cancelled, personal development isn't taken seriously.", "advice": "Have a clear strategy, communicate that strategy clearly, and value your people."}, {"title": "Good local job", "text": "Pros Good team members and pleasant work environment. Cons Wages could be better. Also high staff turnover.", "rating": 3, "pros": "Good team members and pleasant work environment.", "cons": "Wages could be better. Also high staff turnover.", "advice": null}, {"title": "Worst company and process at mumbai", "text": "Pros There is nothing good to say as the last experience from company made all the good of the company spoil Cons The company Hr want us to join immediately by buyout or leaving the current organisation and more over also giving lucrative offer like joining bonus..However when the employee wish to buy out or leave capita the same HR call it wrong and more over make it worst and try to play with the employee future stating it's all policy. Even not helpful to waive even a single day..The words of HR is if you don't report till last date mentioned well make it as absconding and more over no service letter will be issued and ur future will dis-balance Coming to work profile , there is no value for good employee. I'll never recommend anyone to join this company Advice to Management Please stop the process of immediate hiring or start providing service letter/buyout feature if you ask the employee to do so from their current organisation.", "rating": 1, "pros": "There is nothing good to say as the last experience from company made all the good of the company spoil", "cons": "The company Hr want us to join immediately by buyout or leaving the current organisation and more over also giving lucrative offer like joining bonus..However when the employee wish to buy out or leave capita the same HR call it wrong and more over make it worst and try to play with the employee future stating it's all policy.", "advice": "Please stop the process of immediate hiring or start providing service letter/buyout feature if you ask the employee to do so from their current organisation."}, {"title": "Its a place that provides you with a platform to grow", "text": "Pros getting to the opportunity to understand and influence how a global blue chip business. Cultures differ from department to department, I am fortunate to work with a great team and manager. Cons Pay rises are slow as with only one opportunity to apply for a rise per year Advice to Management Look to up-skill internal talent to the next level", "rating": 5, "pros": "getting to the opportunity to understand and influence how a global blue chip business. Cultures differ from department to department, I am fortunate to work with a great team and manager.", "cons": "Pay rises are slow as with only one opportunity to apply for a rise per year", "advice": "Look to up-skill internal talent to the next level"}, {"title": "Customer Service Advisor", "text": "Pros they treat their employee very fairly Cons working on the weekends", "rating": 5, "pros": "they treat their employee very fairly", "cons": "working on the weekends", "advice": null}, {"title": "Decreasing Workforce", "text": "Pros Well paid, reasonable workload, good relationship with colleagues building conveniently located in centre of Leeds. Cons Decreasing workforce leading to concern over job security, zero investment on site by clientmeaning building leaves a lot to be desired. Advice to Management Staff morale would be boosted if cronyism were removed and something approaching a meritocracy was in operation.", "rating": 5, "pros": "Well paid, reasonable workload, good relationship with colleagues building conveniently located in centre of Leeds.", "cons": "Decreasing workforce leading to concern over job security, zero investment on site by clientmeaning building leaves a lot to be desired.", "advice": "Staff morale would be boosted if cronyism were removed and something approaching a meritocracy was in operation."}, {"title": "High focus on negatives instead of the myriad of positives.", "text": "Pros Great colleagues and a smart workforce. Cons Management - the only time you will get feedback is if you get something wrong and if not you're unlikely to hear anything despite working hard and going over and above the normal duties. They constantly remind you that you're a cog in the machine. Wages: well below market average and once the economy picks up they will lose a lot of highly skilled workers. The office workers are lucky to get a 0.5% raise yearly while management will get 10% and above. Advice to Management Improve the cons", "rating": 1, "pros": "Great colleagues and a smart workforce.", "cons": "Management - the only time you will get feedback is if you get something wrong and if not you're unlikely to hear anything despite working hard and going over and above the normal duties.", "advice": "Improve the cons"}, {"title": "Nothing Special", "text": "Pros The People and Work Enviroment Cons No future job opportunities. Poor Wages", "rating": 3, "pros": "The People and Work Enviroment", "cons": "No future job opportunities.", "advice": null}, {"title": "Sr account", "text": "Pros Safe surrounding for women Cons No pick up drop facility", "rating": 1, "pros": "Safe surrounding for women", "cons": "No pick up drop facility", "advice": null}, {"title": "This is not a stable job option", "text": "Pros For some it is an alternative to clinical work Cons Capita will dismiss anyone who does not pass the training. This is not made clear prior to accepting the job offer. Many people have given up stable jobs in the nhs under the misguided belief that they are entering a permanent contract with Capita. They are not. The report writing is very boring and repetitive. All reports are sent to an audit service when you start who send most of them back for amendments. Also you have to 5 acceptable reports in a row soon after completing training which is very hard to do. If you don't they will fire you. Advice to Management Be more honest at interview about what the job entails.", "rating": 1, "pros": "For some it is an alternative to clinical work", "cons": "Capita will dismiss anyone who does not pass the training. This is not made clear prior to accepting the job offer. Many people have given up stable jobs in the nhs under the misguided belief that they are entering a permanent contract with Capita. They are not. The report writing is very boring and repetitive. All reports are sent to an audit service when you start who send most of them back for amendments. Also you have to 5 acceptable reports in a row soon after completing training which is very hard to do. If you don't they will fire you.", "advice": "Be more honest at interview about what the job entails."}, {"title": "Faceless corporate dinosaur", "text": "Pros They certainly have a variety of roles, due to the sheer scale of the business Cons Thousands of ineffectual managers, most senior people are soul-less accountants focused purely on profit, whatever the cost to their people or customers. The engagement scores in this business speak volumes - literally some of the worst you'll ever see. Customers' reaction when they find out your business is part of Capita? Hilarious! The amount of contracts we've lost due to the cruddy reputation this company has is huge. Yes, we have gained some by being part of the business BUT 95% are with other Capita companies, so smoke and mirrors. Advice to Management Try learning about leadership and practising it. Furthermore, acquisition and trading with yourself isn't really a sustainable model if the 'true' external customer thinks you're rubbish.", "rating": 1, "pros": "They certainly have a variety of roles, due to the sheer scale of the business", "cons": "Thousands of ineffectual managers, most senior people are soul-less accountants focused purely on profit, whatever the cost to their people or customers.", "advice": "Try learning about leadership and practising it."}, {"title": "sr executive", "text": "Pros Need a Change , better salary Cons need change, better carreer opportunity Advice to Management .", "rating": 3, "pros": "Need a Change , better salary", "cons": "need change, better carreer opportunity", "advice": "."}, {"title": "Interesting company", "text": "Pros A reasonable business. Good benefits. Good policy. Strong business in various markets. Profitable. Good teams and flexible working. What else Cons Not the most dynamic of businesses but adapting to a changing digital landscape. There are many competitors in fields as with any business.", "rating": 3, "pros": "A reasonable business. Good benefits. Good policy. Strong business in various markets. Profitable. Good teams and flexible working. What else", "cons": "Not the most dynamic of businesses but adapting to a changing digital landscape. There are many competitors in fields as with any business.", "advice": null}, {"title": "Do not join", "text": "Pros No pros. Not a good company even for freshers Cons Pathetic management. BPO mentality No business strategy Employees treated as slaves Only policies for the benifit of company Worthless management handled by worthless managers who are themselves slaves of their UK bosses No salary perks, no increments. Huge variable pay which you won't get back Nothing new to learn Products often get closed, so your employment is on risk Advice to Management Change the BPO mentality or else close the development center. You dnt deserve to be a software development company", "rating": 1, "pros": "No pros. Not a good company even for freshers", "cons": "Pathetic management.", "advice": "Change the BPO mentality or else close the development center. You dnt deserve to be a software development company"}, {"title": "Current employee - over 1 year", "text": "Pros Great development opportunities, Promoting people from within the company Cons Long working hours and overtime", "rating": 5, "pros": "Great development opportunities,", "cons": "Long working hours and overtime", "advice": null}, {"title": "Worst company", "text": "Pros It's a job. And its pays... sometimes Cons Don't pay, don't recognise hard work, frequent bullying. Advice to Management Grow up and get a life.", "rating": 1, "pros": "It's a job. And its pays... sometimes", "cons": "Don't pay, don't recognise hard work, frequent bullying.", "advice": "Grow up and get a life."}, {"title": "First Thoughts", "text": "Pros Good working conditions and supportive environment. Cons Dealing with unpleasant and nasty customers. Advice to Management Always support your front liner staff.", "rating": 5, "pros": "Good working conditions and supportive environment.", "cons": "Dealing with unpleasant and nasty customers.", "advice": "Always support your front liner staff."}, {"title": "Capita for West Sussex County Council", "text": "Pros Big team, great chance to meet new people. Fairly quick start date after job offer. Cons Issues with pay which took a while to resolve. Lots of management favouritism - instances of one rule for one and a different rule for others. Advice to Management More transparency, honesty and fairness needed. Sometimes employees feel undervalued.", "rating": 3, "pros": "Big team, great chance to meet new people.", "cons": "Issues with pay which took a while to resolve.", "advice": "More transparency, honesty and fairness needed."}, {"title": "New life", "text": "Pros Great team and good company Cons None can think of as yet Advice to Management Thank uou", "rating": 5, "pros": "Great team and good company", "cons": "None can think of as yet", "advice": "Thank uou"}, {"title": "Nice company to work with", "text": "Pros Friendly staff. Lots of Opportunity to learn. Manager approachable Cons No performance appraisal done since being employed", "rating": 5, "pros": "Friendly staff. Lots of Opportunity to learn. Manager approachable", "cons": "No performance appraisal done since being employed", "advice": null}, {"title": "Enjoyable", "text": "Pros Large company - potential to work in different areas Cons Difficult to access senior management as a junior employee", "rating": 3, "pros": "Large company - potential to work in different areas", "cons": "Difficult to access senior management as a junior employee", "advice": null}, {"title": "Pisstake.", "text": "Pros Nice people. People appear to have similar working mindsets. Cons The review meetings actually aggravate my ongoing health condition which you would know if you were paying attention. Advice to Management Listen to people.", "rating": 3, "pros": "Nice people. People appear to have similar working mindsets.", "cons": "The review meetings actually aggravate my ongoing health condition which you would know if you were paying attention.", "advice": "Listen to people."}, {"title": "Capita HR Solutions", "text": "Pros There are no pros here Cons Capita HR solutions project team in Edinburgh are devoid of any people skills. A mish mash of poorly communicated work with little to no structure on how it is planned. Both managers work remotely leaving the Edinburgh team rudderless. No leaders. Avoid. Advice to Management Quit", "rating": 1, "pros": "There are no pros here", "cons": "Capita HR solutions project team in Edinburgh are devoid of any people skills. A mish mash of poorly communicated work with little to no structure on how it is planned. Both managers work remotely leaving the Edinburgh team rudderless. No leaders. Avoid.", "advice": "Quit"}, {"title": "Good company for the fresher", "text": "Pros Friendly environment good transport facilities Cons Bonus and Hike on salary is less", "rating": 5, "pros": "Friendly environment", "cons": "Bonus and Hike on salary is less", "advice": null}, {"title": "Working for Capita", "text": "Pros Fast paced environment. Target driven. Must be fully accountable to meet targets and keep quality audits high. Days for quickly. Mixture of peoples from all different backgrounds. Cons If training is located elsewhere, you must attend.", "rating": 5, "pros": "Fast paced environment. Target driven. Must be fully accountable to meet targets and keep quality audits high. Days for quickly. Mixture of peoples from all different backgrounds.", "cons": "If training is located elsewhere, you must attend.", "advice": null}, {"title": "Dissapointed, deflated", "text": "Pros Looks great on paper, good training. Cons 14 hours a day 6-7 days a week is not worth any salary, nothing was as advertised or promised, overall very bad experience!! Hi Advice to Management Support for the people on the ground, realistic workload, help when new people are struggling. All the full time staff that started with me left within 3 months after completing training, something is seriously wrong!!", "rating": 1, "pros": "Looks great on paper, good training.", "cons": "14 hours a day 6-7 days a week is not worth any salary, nothing was as advertised or promised, overall very bad experience!! Hi", "advice": "Support for the people on the ground, realistic workload, help when new people are struggling. All the full time staff that started with me left within 3 months after completing training, something is seriously wrong!!"}, {"title": "Great business to be part of", "text": "Pros Opportunity to progress your career and change your career! Flexible working and mature management style Cons Nothing to share on this", "rating": 5, "pros": "Opportunity to progress your career and change your career! Flexible working and mature management style", "cons": "Nothing to share on this", "advice": null}, {"title": "Recommended!", "text": "Pros Job security, great benefits, good environment, good people Cons annual salary review freezes - only way to get more money is via promotion Advice to Management Maintain focus on your people!", "rating": 5, "pros": "Job security, great benefits, good environment, good people", "cons": "annual salary review freezes - only way to get more money is via promotion", "advice": "Maintain focus on your people!"}, {"title": "Customer Service Administrator", "text": "Pros Flexible hours. Helpful training from the outset. Cons Limited career opportunities meaning progression difficult Advice to Management More promotional prospects required", "rating": 5, "pros": "Flexible hours. Helpful training from the outset.", "cons": "Limited career opportunities meaning progression difficult", "advice": "More promotional prospects required"}, {"title": "HR and Payroll policies changed. ALL OF THESE UPDATES ARE FOR SIMS IDC PROCESS ONLY", "text": "Pros It was great policies till 31st dec 2017. But capita management wished Happy new year with below great news and made work life a bit more bitter. Cons 1. Leaves cut down to 26 from 29 2. Dramatically changed notice period for all employees from 2 months to 3 months 3.Travel allowance which was 2200 rs apart from monthly salary for not opting cab is REMOVED. Advice to Management Management should think about employees as its employees who works for company, and Capita is know for its policies, Capita is a product company Not service.", "rating": 1, "pros": "It was great policies till 31st dec 2017. But capita management wished Happy new year with below great news and made work life a bit more bitter.", "cons": "1. Leaves cut down to 26 from 29", "advice": "Management should think about employees as its employees who works for company, and Capita is know for its policies, Capita is a product company Not service."}, {"title": "Do not join Capita, specially IDC unit Pune or you will regret.", "text": "Pros 20 words are too much to describe the pros for this company. There are no pros as such, which will make you proud working here. Cons Below are the changes made by management, which are applicable from 1st Jan'18. 1. Amended notice period from 2 to 3 months, which is very bad for career growth. 2. No free cab, now you need pay from your pocket for cab services. 3. No sick leaves, which were earlier in the compensation and benefits. 4. Formal dress code. 5. You cannot drink coffee or take any eatables at your workstation. 6. Too much of politics by management. 7. Parking issues. Advice to Management Management has done a very poor job, changing the policies and they need to rethink about it. You will loss your business, if you are not even reconsidering the policies!", "rating": 1, "pros": "20 words are too much to describe the pros for this company. There are no pros as such, which will make you proud working here.", "cons": "Below are the changes made by management, which are applicable from 1st Jan'18.", "advice": "Management has done a very poor job, changing the policies and they need to rethink about it. You will loss your business, if you are not even reconsidering the policies!"}, {"title": "NOT GOOD NOT BAD", "text": "Pros got promotions, good teammates, good infra Cons appraisal is worst, salary packages offered are not that great, Advice to Management pay well so that employees work well", "rating": 3, "pros": "got promotions, good teammates, good infra", "cons": "appraisal is worst, salary packages offered are not that great,", "advice": "pay well so that employees work well"}, {"title": "Shocking", "text": "Pros It beats being on benefits, but only just. Cons Management is absolutely shocking, McDonalds staff are treated better! I was a \"Customer Service Advisor\" yet I was not allowed and even berated for taking the time necessary to solve customer problems. The whole point was to solve problems at first POC, however we were given 180 seconds per call to do everything! Sometimes getting through data security and finding out what the problem was in the first place took longer than that!! Advice to Management Managers need to be TRAINED MANAGERS WITH EXPERIENCE LEADING PEOPLE, not just friends of friends promoted because a position becomes vacant. Managers are there to motivate and lead a team, not lord it over you and make you feel like scum.", "rating": 1, "pros": "It beats being on benefits, but only just.", "cons": "Management is absolutely shocking, McDonalds staff are treated better!", "advice": "Managers need to be TRAINED MANAGERS WITH EXPERIENCE LEADING PEOPLE, not just friends of friends promoted because a position becomes vacant. Managers are there to motivate and lead a team, not lord it over you and make you feel like scum."}, {"title": "No real progression available", "text": "Pros Easy day-to-day Flexi-time Decent friendly atmosphere (department dependent) Can get noticed for excellent work Cons No scope for progression More work being placed offshore Little connection with higher management Advice to Management It can be positive to allow employees to gain expertise. Diluting all skills down to the absolute basic level ruins personal motivation", "rating": 3, "pros": "Easy day-to-day", "cons": "No scope for progression", "advice": "It can be positive to allow employees to gain expertise. Diluting all skills down to the absolute basic level ruins personal motivation"}, {"title": "Awful company", "text": "Pros Really there are none at all Cons They fire you if you fail the training. They fire if you don't get enough good reports in after the training. You have to work 12 hour days to get everything done. Not worth leaving the NHS for.", "rating": 1, "pros": "Really there are none at all", "cons": "They fire you if you fail the training. They fire if you don't get enough good reports in after the training. You have to work 12 hour days to get everything done. Not worth leaving the NHS for.", "advice": null}, {"title": "Bad job experience", "text": "Pros Cheap lunch at cafeteria Met some nice people Cons Where to begin? - Shift Pattern - rude and disrespectful managers who treat you like school children  (Not all of them, most of them) - Mentally draining - No appraisals - Unrealistic Targets - No rewards for going a little over shift time when call handling but quick to dock wage if matter of seconds late logging into systems Advice to Management Take time to reward employees, stop treating them like school children but rather like adults who are working hard to provide for themselves and their families.", "rating": 1, "pros": "Cheap lunch at cafeteria", "cons": "Where to begin?", "advice": "Take time to reward employees, stop treating them like school children but rather like adults who are working hard to provide for themselves and their families."}, {"title": "Aim higher!", "text": "Pros Good contracted (outsource clients) like Google, now lost! Cons Poor pay. Terrible contract. Archaic system for payslips etc. Useless HR - especially during redundancy consultation. No annual pay increases. Would rate lower than one star in some areas. Advice to Management Invest in people, not just shareholder ROI.", "rating": 1, "pros": "Good contracted (outsource clients) like Google, now lost!", "cons": "Poor pay.", "advice": "Invest in people, not just shareholder ROI."}, {"title": "Tester", "text": "Pros Friendly colleages and bosses Cons big workload in short deadlines Advice to Management employ more to share workload", "rating": 5, "pros": "Friendly colleages and bosses", "cons": "big workload in short deadlines", "advice": "employ more to share workload"}, {"title": "Very poor grad scheme", "text": "Pros There are no pros working for Capita Cons Hardly provided experience as they could not find me any clients", "rating": 1, "pros": "There are no pros working for Capita", "cons": "Hardly provided experience as they could not find me any clients", "advice": null}, {"title": "Good Company To Work With", "text": "Pros Good Work Environment and Staff Cons No future growth , work is stagnant Advice to Management None", "rating": 5, "pros": "Good Work Environment and Staff", "cons": "No future growth , work is stagnant", "advice": "None"}, {"title": "Laid back atmosphere but zero training", "text": "Pros Great location in Belfast, good offices with heating, air con, free tea and coffee and break area. Depending on your role and contract pros can vary but it’s good experience in the shared services area. Good start for HR or Payroll and majority of employees and managers seemed friendly. Cons Just above minimum wage, more work will be allocated with new skills and no training and no salary reviews as Administrator. You will join and play with yourself for about a month until you get logins and on the system. In that time you’ll sit and watch someone do their job, there is no training structure at all, zero. Then you’ll get thrown into the deep end and it’s sink or swim. Once you get to grips with things it can be good experience but managers or team leaders have no time for you or to assist you, it’s left to your fellow team members who again have been on the same wage for three years and shouldn’t be expected to train people. You’ll get an introduction to the company after about a month if your still there. It has fantastic potential and if there was a proper training structure then potentially this could be an extremely good area to work in but there doesn’t seem to be common sense at higher levels. Advice to Management Advice won’t be taken on board but if there was a proper introduction and training system in place then this would give employees a bit of an insight into operations and be able to hit the ground running. It’s a revolving door and people will continue to leave if they do a bit of digging and realise that there are so many higher paid jobs in Belfast area.", "rating": 3, "pros": "Great location in Belfast, good offices with heating, air con, free tea and coffee and break area. Depending on your role and contract pros can vary but it’s good experience in the shared services area. Good start for HR or Payroll and majority of employees and managers seemed friendly.", "cons": "Just above minimum wage, more work will be allocated with new skills and no training and no salary reviews as Administrator.", "advice": "Advice won’t be taken on board but if there was a proper introduction and training system in place then this would give employees a bit of an insight into operations and be able to hit the ground running. It’s a revolving door and people will continue to leave if they do a bit of digging and realise that there are so many higher paid jobs in Belfast area."}, {"title": "Dreadful Organisation", "text": "Pros If you're absolutely desperate for a job, they might hire you. Cons Capita are a really awful company to work for, and I really can't stress that enough. If you're given the opportunity to work for them, I'd strongly recommend looking elsewhere if it's at all possible. As an outsourcer, their only aim is to save money for their clients, which include various retail and communications companies etc, and this leads to very unpleasant working conditions for employees. I'm happy to say I only worked for them temporarily but it was enough to know I'd never consider them again. Avoid at all costs. Advice to Management Wouldn't waste my time.", "rating": 1, "pros": "If you're absolutely desperate for a job, they might hire you.", "cons": "Capita are a really awful company to work for, and I really can't stress that enough. If you're given the opportunity to work for them, I'd strongly recommend looking elsewhere if it's at all possible. As an outsourcer, their only aim is to save money for their clients, which include various retail and communications companies etc, and this leads to very unpleasant working conditions for employees. I'm happy to say I only worked for them temporarily but it was enough to know I'd never consider them again. Avoid at all costs.", "advice": "Wouldn't waste my time."}, {"title": "Data analyst", "text": "Pros Friendly environment, lovely coleagues good work life balance. Cons Strict business rules, not professional management and low salary.", "rating": 3, "pros": "Friendly environment, lovely coleagues good work life balance.", "cons": "Strict business rules, not professional management and low salary.", "advice": null}, {"title": "Good Learning curve", "text": "Pros Independence is highly practiced here good mentors good place for a recruitment opportunity Cons leadership can be better improved Advice to Management No comment", "rating": 5, "pros": "Independence is highly practiced here", "cons": "leadership can be better improved", "advice": "No comment"}, {"title": "Capita Travel and Events - AVOID!!", "text": "Pros Back in its heydays before they kept acquiring companies to gain market scale what was Capita Business Travel was a great place to work. Service and looking after customers and people came first. After they acquired Expotel it just became a sales machine of sell, sell, sell and it became a sinking ship with a failed CEO and the old one coming back, multiple people overseeing the department I worked within and not one of them lasting longer than 9 months and every one had a different outlook so the pace of change was crazy! Cons My manager was a control freak and micromanaged not just me but other colleagues who have since left. My role was to ultimately retain customers but the dynamic of that changed becoming more sales orientated. I got paid a rubbish salary and when I left Capita Travel and Events and went to a new job in the same industry my salary increased by over £10,000 a year! How I stayed for 4.5 years is beyond me! Advice to Management Pay your people according to market rates! £20,000 for an Account Manager in business travel is not competitive, remove your cap on internal recruits salaries! Get rid of your dead wood management, the reason Capita bought Expotel was because it was failing yet so many of T&E's management are former Expotel staff? Give people the freedom and flexibility to just get on with their job, don't be on their back all the time. Get back to what you used to be good at, great service, people orientated and more importantly invest in your technology!", "rating": 1, "pros": "Back in its heydays before they kept acquiring companies to gain market scale what was Capita Business Travel was a great place to work. Service and looking after customers and people came first. After they acquired Expotel it just became a sales machine of sell, sell, sell and it became a sinking ship with a failed CEO and the old one coming back, multiple people overseeing the department I worked within and not one of them lasting longer than 9 months and every one had a different outlook so the pace of change was crazy!", "cons": "My manager was a control freak and micromanaged not just me but other colleagues who have since left. My role was to ultimately retain customers but the dynamic of that changed becoming more sales orientated. I got paid a rubbish salary and when I left Capita Travel and Events and went to a new job in the same industry my salary increased by over £10,000 a year! How I stayed for 4.5 years is beyond me!", "advice": "Pay your people according to market rates! £20,000 for an Account Manager in business travel is not competitive, remove your cap on internal recruits salaries!"}, {"title": "No option for improvement or promotion", "text": "Pros it pays bills , but dont expect the payrise. Cons No option for progress or training or progress.", "rating": 3, "pros": "it pays bills , but dont expect the payrise.", "cons": "No option for progress or training or progress.", "advice": null}, {"title": "Very good and great training", "text": "Pros Pay and benefits and training Cons Management and team leaders do not help enough", "rating": 3, "pros": "Pay and benefits and training", "cons": "Management and team leaders do not help enough", "advice": null}, {"title": "IT Project manager", "text": "Pros flexible working, good salary, friendly collegue Cons no bonus, stagnant salary, no promotion", "rating": 5, "pros": "flexible working, good salary, friendly collegue", "cons": "no bonus, stagnant salary, no promotion", "advice": null}, {"title": "the platform is yours", "text": "Pros great work, lots to try out and encouraging staff Cons none to mention as such Advice to Management none to mention", "rating": 5, "pros": "great work, lots to try out and encouraging staff", "cons": "none to mention as such", "advice": "none to mention"}, {"title": "O2 partnership", "text": "Pros Free coffee, free shuttle bus, Cons Everything else , some good people but they’re the old bt or o2 staff and on a very decent whack that’s why they haven’t gone Advice to Management Get a grip", "rating": 1, "pros": "Free coffee, free shuttle bus,", "cons": "Everything else , some good people but they’re the old bt or o2 staff and on a very decent whack that’s why they haven’t gone", "advice": "Get a grip"}, {"title": "great", "text": "Pros good and great and will be good angain Cons nothing i have to say at all", "rating": 5, "pros": "good and great and will be good angain", "cons": "nothing i have to say at all", "advice": null}, {"title": "XXX", "text": "Pros Free Cab Services Lot Of Parties Cons No Onsite People never get the full variable amount Advice to Management Onsite Opportunities should be created in order to keep the employee motivated", "rating": 3, "pros": "Free Cab Services", "cons": "No Onsite", "advice": "Onsite Opportunities should be created in order to keep the employee motivated"}, {"title": "Capita Novus Programme", "text": "Pros Intensive training at capita will give you better understanding of Software development. Practical work will help you to adapt to real environment. Cons Need to have faster response on any novus requests. Advice to Management Needs to improve the capita desktop logging security", "rating": 5, "pros": "Intensive training at capita will give you better understanding of Software development. Practical work will help you to adapt to real environment.", "cons": "Need to have faster response on any novus requests.", "advice": "Needs to improve the capita desktop logging security"}, {"title": "Market researcher", "text": "Pros UK higher management are fine to work with Cons 1. below industry annual hike 2. Dirty internal politics , many a times it has been a reason for many to leave the company. Its really bad.", "rating": 3, "pros": "UK higher management are fine to work with", "cons": "1. below industry annual hike", "advice": null}, {"title": "Capita Ventura", "text": "Pros Good Customer Base in UK Cons No career growth Organisation has no vision in India More diplomacy than work Advice to Management NIL", "rating": 3, "pros": "Good Customer Base in UK", "cons": "No career growth", "advice": "NIL"}, {"title": "Good job", "text": "Pros Decent facilities, good pay, nice colleagues Cons Poor management, favourtism, poor location, poor chances of progression.", "rating": 5, "pros": "Decent facilities, good pay, nice colleagues", "cons": "Poor management, favourtism, poor location, poor chances of progression.", "advice": null}, {"title": "John Lewis", "text": "Pros Good atmosphere to work in Cons Training is not the best", "rating": 5, "pros": "Good atmosphere to work in", "cons": "Training is not the best", "advice": null}, {"title": "Good for steady work, not a good career move.", "text": "Pros Stable employment, clean office, friendly environment Cons Poor decision making, no assistance in career progression, no encouragement to do better. Management seem to be constantly changing the goalposts Advice to Management Help your staff. Provide proper salary reviews based on goals that were set in the year.", "rating": 3, "pros": "Stable employment, clean office, friendly environment", "cons": "Poor decision making, no assistance in career progression, no encouragement to do better.", "advice": "Help your staff. Provide proper salary reviews based on goals that were set in the year."}, {"title": "engineer", "text": "Pros worst company to work Cons i wont recommend anyone to work here Advice to Management no management what so ever", "rating": 1, "pros": "worst company to work", "cons": "i wont recommend anyone to work here", "advice": "no management what so ever"}, {"title": "Ok company to work for", "text": "Pros They offer reasonable hours, non anti social etc. Cons Not the best rate of pay", "rating": 3, "pros": "They offer reasonable hours, non anti social etc.", "cons": "Not the best rate of pay", "advice": null}, {"title": "Care & welfare of a detainee", "text": "Pros Great work colleagues who make it bearable Cons Bad management with no man management skills Advice to Management Treat staff with respect instead of doing everything to provoke bad morale", "rating": 1, "pros": "Great work colleagues who make it bearable", "cons": "Bad management with no man management skills", "advice": "Treat staff with respect instead of doing everything to provoke bad morale"}, {"title": "c/s", "text": "Pros good environment and friendly colleagues, Cons favouritism, managers can be rude at times", "rating": 3, "pros": "good environment and friendly colleagues,", "cons": "favouritism, managers can be rude at times", "advice": null}, {"title": "Poor wages", "text": "Pros Amazing colleagues to talk with Cons Very low salary 15600 they advatise as customer care so they can offer a lower wage as c.s wages on average our around 16k but we are working for an insurance department processing claims for carphone warehouse and just getting paid just over minim wage Advice to Management No comments on mangers", "rating": 3, "pros": "Amazing colleagues to talk with", "cons": "Very low salary 15600 they advatise as customer care so they can offer a lower wage as c.s wages on average our around 16k but we are working for an insurance department processing claims for carphone warehouse and just getting paid just over minim wage", "advice": "No comments on mangers"}, {"title": "Orbit Development team is great - shame about the Capita bit!", "text": "Pros Great team. Key people in team are very knowledgeable and have been around a while. Management structure is pretty flat and lots of responsibility for those who want it. No boundaries - if you are interested in what other teams and team members are doing in Orbit Tech no problem, just ask. Progressive in terms of infrastructure compared to rest of capita - everything is cloud. Cons Parent company is Capita - only care about balance sheet - will make changes even when they are nonsensical. No bonus. No technical training - basically DIY. No salary increases accept the bare minimum: <=2%. Development is being outsourced to India. Seems to be a widening gap between the business and tech. Advice to Management Start valuing what you have. Listen to your teams and communicate with them on a personal level.", "rating": 3, "pros": "Great team. Key people in team are very knowledgeable and have been around a while. Management structure is pretty flat and lots of responsibility for those who want it. No boundaries - if you are interested in what other teams and team members are doing in Orbit Tech no problem, just ask. Progressive in terms of infrastructure compared to rest of capita - everything is cloud.", "cons": "Parent company is Capita - only care about balance sheet - will make changes even when they are nonsensical. No bonus. No technical training - basically DIY. No salary increases accept the bare minimum: <=2%. Development is being outsourced to India. Seems to be a widening gap between the business and tech.", "advice": "Start valuing what you have. Listen to your teams and communicate with them on a personal level."}, {"title": "Good, but less utilisation of resources", "text": "Pros Open work culture, good communication between juniors and seniors, onshore opportunity if a new project, CSR and offsite activities well organised Cons Outdated technology, need to improve on resource management, utilising experience resources more efficiently. Nothing much to say in cons as these are some drawbacks", "rating": 3, "pros": "Open work culture, good communication between juniors and seniors, onshore opportunity if a new project, CSR and offsite activities well organised", "cons": "Outdated technology, need to improve on resource management, utilising experience resources more efficiently. Nothing much to say in cons as these are some drawbacks", "advice": null}, {"title": "Good local job", "text": "Pros Good team members, weekends off Cons Paid very low wages, high staff turn over", "rating": 3, "pros": "Good team members, weekends off", "cons": "Paid very low wages, high staff turn over", "advice": null}, {"title": "Highly Unsecure Job", "text": "Pros Good Salary and other allowances Cons Job is highly unsecure, employess are always under the fear of lossing their job. I was asked to leave only in 3rd week after i joined this company along with the group of some 20+ other other employees from my team stating some change in management decision. Advice to Management Please do not ruin the careers of the employees. Do not change your decisions overnight that effect employees. You should stop hiring if you are unsure about your projects instead of recuriting an employee and asking him to leave right in his first month of joining.", "rating": 1, "pros": "Good Salary and other allowances", "cons": "Job is highly unsecure, employess are always under the fear of lossing their job.", "advice": "Please do not ruin the careers of the employees. Do not change your decisions overnight that effect employees. You should stop hiring if you are unsure about your projects instead of recuriting an employee and asking him to leave right in his first month of joining."}, {"title": "PIP Disabity Assessor", "text": "Pros Good training, reasonable salary, efficient support services and infrastructure Cons Paid for 22.5 hours and since finished training 3 months ago have worked closer to 40 hour week. Too many assessments too soon into the job. Stuck on the computer for too many hours, not sure how full-timers manage! Advice to Management Access to more exemplary reports would have been helpful. Gradual increase of assessments. Take notice when staff tell you they are working too many hours", "rating": 3, "pros": "Good training, reasonable salary, efficient support services and infrastructure", "cons": "Paid for 22.5 hours and since finished training 3 months ago have worked closer to 40 hour week. Too many assessments too soon into the job. Stuck on the computer for too many hours, not sure how full-timers manage!", "advice": "Access to more exemplary reports would have been helpful. Gradual increase of assessments. Take notice when staff tell you they are working too many hours"}, {"title": "Good place to work", "text": "Pros excellent Senior Management with a great vision Cons Equal payment opportunities do not exist Advice to Management Please look at being fair", "rating": 3, "pros": "excellent Senior Management with a great vision", "cons": "Equal payment opportunities do not exist", "advice": "Please look at being fair"}, {"title": "Seeing changes with in a FTSE 250", "text": "Pros I work within a great part of capita with a great team attitude. My line manager is good to work with/for. I have flexibility with the view of getting your work done and do your best to exceed KPI's and we will treat you like an adult and won't micromanage you. I get to gain experience working at a high level and working with industry leaders. Cons Sometimes the Pay can seem low compared to the external market.", "rating": 5, "pros": "I work within a great part of capita with a great team attitude. My line manager is good to work with/for. I have flexibility with the view of getting your work done and do your best to exceed KPI's and we will treat you like an adult and won't micromanage you. I get to gain experience working at a high level and working with industry leaders.", "cons": "Sometimes the Pay can seem low compared to the external market.", "advice": null}, {"title": "Struggling to change with the times", "text": "Pros Excellent big bid sales team Contract teams highly empowered and own almost all areas of delivery Cons Very weak at IT / Systems - both internally and deploying for customers Constant changes of divisions and mgt to mask some deep seated issues Advice to Management Need to change with the times. Need to be more customer centric. Needs to put in place a trusted career development path. Needs to address systems weaknesses.", "rating": 3, "pros": "Excellent big bid sales team", "cons": "Very weak at IT / Systems - both internally and deploying for customers", "advice": "Need to change with the times. Need to be more customer centric. Needs to put in place a trusted career development path. Needs to address systems weaknesses."}, {"title": "Avoid", "text": "Pros The work is not particularly hard and if you're in one of the better roles, pay is adequate. Easy to slip into a fairly comfortable rut of undemanding work Cons Almost everything else. As an outsourcer, Capita take the maximum they can get and spend as little as possible on staff, be that on benefits, perks, holiday, office design ,etc. Soulless place to work with exceptionally high staff turnover rates, limited career progression, and negative overall atmosphere. If you need a short term stop gap or like the idea of a relatively laid back but totally unfulfilling job, Capita will suffice, but otherwise I would avoid.", "rating": 1, "pros": "The work is not particularly hard and if you're in one of the better roles, pay is adequate.", "cons": "Almost everything else. As an outsourcer, Capita take the maximum they can get and spend as little as possible on staff, be that on benefits, perks, holiday, office design ,etc.", "advice": null}, {"title": "ANON", "text": "Pros Good People, Varied Projects, Benefits Cons Career growth, Pension could be better", "rating": 5, "pros": "Good People, Varied Projects, Benefits", "cons": "Career growth, Pension could be better", "advice": null}, {"title": "Customer Service Advisor", "text": "Pros The three breaks you have although penalised if less than 1 minute late from them Cons Paid little when job has a lot of responsibility, no recognition Advice to Management Appreciate and praise staff more", "rating": 1, "pros": "The three breaks you have although penalised if less than 1 minute late from them", "cons": "Paid little when job has a lot of responsibility, no recognition", "advice": "Appreciate and praise staff more"}, {"title": "Job", "text": "Pros Good friendly people, managers are there to help , money Cons Boring , no changes to the job Advice to Management Some are better than others and some have there favourites", "rating": 3, "pros": "Good friendly people, managers are there to help , money", "cons": "Boring , no changes to the job", "advice": "Some are better than others and some have there favourites"}, {"title": "Like every other", "text": "Pros nice office, different campaigns, good canteen, lots of opportunity Cons very much like every other outsourcer. They have silly rules and regulations, they change shifts at last minute, you're just another number and so the work life balance isn't great.", "rating": 3, "pros": "nice office, different campaigns, good canteen, lots of opportunity", "cons": "very much like every other outsourcer. They have silly rules and regulations, they change shifts at last minute, you're just another number and so the work life balance isn't great.", "advice": null}, {"title": "Can't complain", "text": "Pros Flexible working hours, reasonable holiday entitlement. Cons Not much room to move upwards Advice to Management Good management team on the frontline", "rating": 3, "pros": "Flexible working hours, reasonable holiday entitlement.", "cons": "Not much room to move upwards", "advice": "Good management team on the frontline"}, {"title": "Not Bad tbh", "text": "Pros A sturdy company marred by shares woes Cons not all it's cracked up to be.", "rating": 3, "pros": "A sturdy company marred by shares woes", "cons": "not all it's cracked up to be.", "advice": null}, {"title": "Good place to start a career", "text": "Pros The company provides good work experience Cons Lack of training and development opportunities", "rating": 3, "pros": "The company provides good work experience", "cons": "Lack of training and development opportunities", "advice": null}, {"title": "Terrible experience working at Capita", "text": "Pros In theory they pay your travelling for training expenses although I’m still waiting! Revalidation hours are sorted during the training Cons Up to 60 hour weeks expected with no provision for time back or payment! No support Poor teaching methods No honesty or integrity Face fits culture Expensive training programme which is basically not fit for purpose as only 6 out of 13 got through.... Advice to Management Be honest in your recruitment process- don’t tell people after they’ve accepted a verbal 9-5 Home based job that they’re on an 8-8 contract Monday-Saturday. Pay your employees what you owe them!!!! Very short-sighted and expensive training programme - it needs review!", "rating": 1, "pros": "In theory they pay your travelling for training expenses although I’m still waiting!", "cons": "Up to 60 hour weeks expected with no provision for time back or payment!", "advice": "Be honest in your recruitment process- don’t tell people after they’ve accepted a verbal 9-5 Home based job that they’re on an 8-8 contract Monday-Saturday."}, {"title": "Good facilities", "text": "Pros should increase the base salary Cons nothing much good company overall Advice to Management please increase salary", "rating": 5, "pros": "should increase the base salary", "cons": "nothing much good company overall", "advice": "please increase salary"}, {"title": "Admin", "text": "Pros Excellent contracts, teams, IT systems, offices, brand Cons Constant corporate company name changes... Advice to Management Recognise performers and reward accordingly", "rating": 5, "pros": "Excellent contracts, teams, IT systems, offices, brand", "cons": "Constant corporate company name changes...", "advice": "Recognise performers and reward accordingly"}, {"title": "Awesome", "text": "Pros Very Nice place to work Cons There are No Cons as such Advice to Management Nothing to advice to management", "rating": 5, "pros": "Very Nice place to work", "cons": "There are No Cons as such", "advice": "Nothing to advice to management"}, {"title": "Customer realtion manager", "text": "Pros Really nice people to work with in capita and some managers Cons They only need you for sometime and then they would try to dismiss you in any errors you make and thats why they always recruiting", "rating": 3, "pros": "Really nice people to work with in capita and some managers", "cons": "They only need you for sometime and then they would try to dismiss you in any errors you make and thats why they always recruiting", "advice": null}, {"title": "Customer realtion manager", "text": "Pros Really nice people to work with in capita and some managers Cons They only need you for sometime and then they would try to dismiss you in any errors you make and thats why they always recruiting", "rating": 3, "pros": "Really nice people to work with in capita and some managers", "cons": "They only need you for sometime and then they would try to dismiss you in any errors you make and thats why they always recruiting", "advice": null}, {"title": "Salary for Customer Service", "text": "Pros Meeting lots of new people and best place on earth to cut your teeth on the Customer Service Industry. Cons Capita do not look after their employees as well as other companies do. Sure, they're busy and need to deal with all types of queries, but this does not mean that they need to deal with us as just another number. Some effective leadership is needed constantly. Advice to Management Exercises to boost and maintain team morale is a MUST! Friendly competitions each month also helps but try not to make the prizes too competitive or 'shiny' as this could also backfire and cause mutiny between employees in the Call Centres. Best approach is a team outing each week and a discount at their favourite place should they reach targets.", "rating": 5, "pros": "Meeting lots of new people and best place on earth to cut your teeth on the Customer Service Industry.", "cons": "Capita do not look after their employees as well as other companies do. Sure, they're busy and need to deal with all types of queries, but this does not mean that they need to deal with us as just another number. Some effective leadership is needed constantly.", "advice": "Exercises to boost and maintain team morale is a MUST! Friendly competitions each month also helps but try not to make the prizes too competitive or 'shiny' as this could also backfire and cause mutiny between employees in the Call Centres. Best approach is a team outing each week and a discount at their favourite place should they reach targets."}, {"title": "Pensions Regulator contract", "text": "Pros Generally recruits internally for job vacancies Some good staff benefits Agent of the month programme and refer a friend scheme in place, gives vouchers. Cons Unprofessional management, frequently made racist and derogatory remarks about staff in meetings. Abysmal communication skills from senior management Absence and other staff issues generally treated with suspicion by management Management treat staff with general disdain and seem to enjoy the staff disliking them. Broken Performance-Related-Pay system that management has no interest to fix. Overall lack of progression options with contract, pointless barriers such as 6 months experience on contract needed. Apprenticeships offered however didn't have infrastructure to run them. Nothing cascaded to applicants, left completely in the dark about status of apprenticeships. Staff penalised for missing breaks because they were made to take a call. Staff and team leaders scrutinised for things management do not actively do themselves. Advice to Management Listen to staff, do not treat them with disdain (why do you think so many people are leaving?) Introduce a better PRP system, or at least improve it. Stop penalising staff for having to take calls minutes before their allocated breaks.", "rating": 3, "pros": "Generally recruits internally for job vacancies", "cons": "Unprofessional management, frequently made racist and derogatory remarks about staff in meetings.", "advice": "Listen to staff, do not treat them with disdain (why do you think so many people are leaving?)"}, {"title": "Service Deliveyr Manager", "text": "Pros Nice work Life balance, and well organised cultural activity Cons Lack of new technologies, and lack of technical trainings Advice to Management Keep it up", "rating": 5, "pros": "Nice work Life balance, and well organised cultural activity", "cons": "Lack of new technologies, and lack of technical trainings", "advice": "Keep it up"}, {"title": "Fair job", "text": "Pros Straight forward, able to adapt, good team work Cons Systems are way too old and hard to work with, they never look to improve Advice to Management Don't just expand, think about the staff and they'll think about you and work hard for you", "rating": 3, "pros": "Straight forward, able to adapt, good team work", "cons": "Systems are way too old and hard to work with, they never look to improve", "advice": "Don't just expand, think about the staff and they'll think about you and work hard for you"}, {"title": "MI Analyst", "text": "Pros You can feel lots of flexibility, no big pressure. Cons Low pay and no bonus.", "rating": 3, "pros": "You can feel lots of flexibility, no big pressure.", "cons": "Low pay and no bonus.", "advice": null}, {"title": "Great colleagues, Poor management", "text": "Pros The company is large so there are many departments you can go into. Cons Progression is matter of who you are friends with and not based on your skill. Frequent cases of them paying you the wrong amount which you then have to struggle and fight to have corrected. Have a high turnover of staff due to not caring enough to cultivate business relationships. They would rather replace than work things out. Salaries advertised are not correct ie they may say the OTE is 35k but what they will fail to mention is that that figure is set because 1 person may have got that several years ago... once, but 99.9% of people will never hit it. Advice to Management Treat employees as people.", "rating": 1, "pros": "The company is large so there are many departments you can go into.", "cons": "Progression is matter of who you are friends with and not based on your skill.", "advice": "Treat employees as people."}, {"title": "Work Experience", "text": "Pros Excellent environment to work in. Cons I did not experience any. Advice to Management Keep Up the great work.", "rating": 5, "pros": "Excellent environment to work in.", "cons": "I did not experience any.", "advice": "Keep Up the great work."}, {"title": "Good place but can be better", "text": "Pros UK leader in technology-enabled business process management and outsourcing solutions. Cons Needs to provide regular opportunities to learn and develop new skills. Advice to Management Provide regular opportunities to learn and develop new skills.", "rating": 3, "pros": "UK leader in technology-enabled business process management and outsourcing solutions.", "cons": "Needs to provide regular opportunities to learn and develop new skills.", "advice": "Provide regular opportunities to learn and develop new skills."}, {"title": "Not worth the stress", "text": "Pros Colleagues that are there when the going gets tough Cons Bad management, no pay rise, awful toilets, disgusting place to work for. Save your sanity and look for something else. Advice to Management Grow up and treat staff like a human being not a child .", "rating": 1, "pros": "Colleagues that are there when the going gets tough", "cons": "Bad management, no pay rise, awful toilets, disgusting place to work for. Save your sanity and look for something else.", "advice": "Grow up and treat staff like a human being not a child ."}, {"title": "Sales Manager", "text": "Pros - Costa in office - fun people to work with Cons - Lack of progression internally Advice to Management - Look at the quality you have in your office currently.", "rating": 1, "pros": "- Costa in office", "cons": "- Lack of progression internally", "advice": "- Look at the quality you have in your office currently."}, {"title": "working in HR at Capita", "text": "Pros In Capita HR, you will find that you have excellent colleagues (Operations Partners and Managers), who have very good knowledge of employee relations and HR generally. You will be able to organise your own diary so as to be home occasionally if you need to be and you travel around the UK, meaning that you are not bored by being in the same place every day. At first, you will find the work varied and interesting and you can move between divisions so as not to get bored. Capita generally seems to be a good place to work. Cons In HR, the culture is driven from the top and it is very much command and control. Above the HRM level, there is a general lack of recent knowledge of anything outside Capita. There are no coaches at this level and ironically little good people management. In the Ops Partner and Manager levels, people are expected to do a huge amount of travelling, all in their own time. Working hours are extremely long. Advice to Management Recruit some HR Directors with a view of the world outside Capita. Make people management the most important part of the role.", "rating": 1, "pros": "In Capita HR, you will find that you have excellent colleagues (Operations Partners and Managers), who have very good knowledge of employee relations and HR generally.", "cons": "In HR, the culture is driven from the top and it is very much command and control. Above the HRM level, there is a general lack of recent knowledge of anything outside Capita. There are no coaches at this level and ironically little good people management.", "advice": "Recruit some HR Directors with a view of the world outside Capita. Make people management the most important part of the role."}, {"title": "Horrible", "text": "Pros Friendly colleagues, people i worked with (not including management) were amazing. Free cup of tea in the morning Cons Absolutely everything else, please do not work here. Management do not want to help you and only care about their stats and themselves. My soul died working at this place. Advice to Management Appreciate your colleagues/staff! The reason you are failing with targets and stats is due to not giving them enough credit for all the hard work that they do. You constantly point out our flaws, but when we do something good it goes unnoticed. No wonder more people are leaving. But I guess we're just a number and when we leave, you'll just find another robot to replace us with.", "rating": 1, "pros": "Friendly colleagues, people i worked with (not including management) were amazing. Free cup of tea in the morning", "cons": "Absolutely everything else, please do not work here. Management do not want to help you and only care about their stats and themselves. My soul died working at this place.", "advice": "Appreciate your colleagues/staff! The reason you are failing with targets and stats is due to not giving them enough credit for all the hard work that they do. You constantly point out our flaws, but when we do something good it goes unnoticed. No wonder more people are leaving. But I guess we're just a number and when we leave, you'll just find another robot to replace us with."}, {"title": "Senior Insurance Associate", "text": "Pros professional environment to work and can improve and gain knowledge. Cons lots of politics, if one can survive this, then everything is easy.", "rating": 3, "pros": "professional environment to work and can improve and gain knowledge.", "cons": "lots of politics, if one can survive this, then everything is easy.", "advice": null}, {"title": "nio", "text": "Pros good incentives and hike ,bonus . friendly working environment Cons No cons Advice to Management Nothing", "rating": 5, "pros": "good incentives and hike ,bonus . friendly working environment", "cons": "No cons", "advice": "Nothing"}, {"title": "Family Business", "text": "Pros No pros for anyone who loves their work and is true to it Cons Its just a family business... no growth for ppl who deserve it.. even if u get the highest rating for yrs no one will bother to create a path for u to move upwards... the management is a family who wants to keep in all between those who love everything except working Advice to Management Treat people like you care instead of just coming to the floor once and yelling", "rating": 1, "pros": "No pros for anyone who loves their work and is true to it", "cons": "Its just a family business... no growth for ppl who deserve it.. even if u get the highest rating for yrs no one will bother to create a path for u to move upwards... the management is a family who wants to keep in all between those who love everything except working", "advice": "Treat people like you care instead of just coming to the floor once and yelling"}, {"title": "Atrocious behaviour from incompetent arrogant leaders", "text": "Pros Literally none at all. None Cons Your cv will be tarnished. Crapita are a virus that preys on weak procurement teams in mainly government departments. Once a leader gets in place they will bring in hordes of the cheapest rubbish from the market and set about ticking boxes that show they deliver something. Its all fiction. They deliver nothing but pain. Incredible rudeness and incompetence from the top to the bottom. Advice to Management Resign. Seriously just leave site. Your client WILL be better off without your wisdom. Actually take some time to get your hands dirty by getting stuck in to a programme, rather than just turn up and start dictating rubbish that doesn't fit. Agressive attitudes put peoples backs up target than earn respect.", "rating": 1, "pros": "Literally none at all. None", "cons": "Your cv will be tarnished.", "advice": "Resign. Seriously just leave site. Your client WILL be better off without your wisdom."}, {"title": "Great place to push yourself", "text": "Pros Opportunities, locations, possible to work across divisions Cons can be somewhat cut throat.. Advice to Management None", "rating": 5, "pros": "Opportunities, locations, possible to work across divisions", "cons": "can be somewhat cut throat..", "advice": "None"}, {"title": "Avoid like the plague", "text": "Pros The day I left, seriously. Cons Everything, everything, everything, everything and everything", "rating": 1, "pros": "The day I left, seriously.", "cons": "Everything, everything, everything, everything and everything", "advice": null}, {"title": "Simple, stress-free, dead end", "text": "Pros It depends on what project you're on, but the outsourcing work is usually pretty basic. Cons There is very little opportunity for progression Advice to Management Communicate - the biggest problems were always due to lack of communication between departments and sometimes meant day or week long delays in workflow.", "rating": 3, "pros": "It depends on what project you're on, but the outsourcing work is usually pretty basic.", "cons": "There is very little opportunity for progression", "advice": "Communicate - the biggest problems were always due to lack of communication between departments and sometimes meant day or week long delays in workflow."}, {"title": "I wouldn't recommend working here", "text": "Pros The colleagues you meet. Training relevant to role provided if you have a good manager. Despite everything else that I've said there are people who have been here for over 10 years - not necessarily worked their way up mind you. Cons Lowest paid in the industry. Good managers few and far between. Lack of responsibility taken by staff / departments, means that a lot of things outside of your remit falls in your lap but then you get more experience which aids you when you inevitably leave to go on to better roles paying more money. Advice to Management Increase salaries to make them competitive at least. Create a better benefits package. Train management - not all managers are leaders.", "rating": 3, "pros": "The colleagues you meet. Training relevant to role provided if you have a good manager. Despite everything else that I've said there are people who have been here for over 10 years - not necessarily worked their way up mind you.", "cons": "Lowest paid in the industry. Good managers few and far between. Lack of responsibility taken by staff / departments, means that a lot of things outside of your remit falls in your lap but then you get more experience which aids you when you inevitably leave to go on to better roles paying more money.", "advice": "Increase salaries to make them competitive at least. Create a better benefits package. Train management - not all managers are leaders."}, {"title": "MI Analyst", "text": "Pros Great people, modern software - Office 365, MS Dynamics etc. Cons Limited Parking and Pay below average for role.", "rating": 5, "pros": "Great people, modern software - Office 365, MS Dynamics etc.", "cons": "Limited Parking and Pay below average for role.", "advice": null}, {"title": "Capita", "text": "Pros good team spirit free tea/coffee good basic salary Cons days can be repetitive", "rating": 5, "pros": "good team spirit", "cons": "days can be repetitive", "advice": null}, {"title": "Work and Life Balance", "text": "Pros Best company to work with. Cons Package should be revised accordingly", "rating": 5, "pros": "Best company to work with.", "cons": "Package should be revised accordingly", "advice": null}, {"title": "Customer Service Advisor", "text": "Pros You get paid set amount every month. Cons Bad management. Team leaders are fresh out of college and have no training or experience in managing their own teams. Given that I work for Lloyds in Capita now, the trainers and team leaders are far more organized, respectful and kind whereas O2 team Leaders and trainees really need sufficient training on their roles. There is ZERO room to progress. Advice to Management Please stop hiring so many young people to take on such big responsibilities - managing a group of 15 with little to no experience is extremely unfair particularly when you are a grown woman and have to listen to a 18 year old yell in your face like a superior. Unacceptable.", "rating": 1, "pros": "You get paid set amount every month.", "cons": "Bad management.", "advice": "Please stop hiring so many young people to take on such big responsibilities - managing a group of 15 with little to no experience is extremely unfair particularly when you are a grown woman and have to listen to a 18 year old yell in your face like a superior. Unacceptable."}, {"title": "Field Engineering", "text": "Pros Flexible working is possible, salary is not the worst Cons Very poor support from management", "rating": 1, "pros": "Flexible working is possible, salary is not the worst", "cons": "Very poor support from management", "advice": null}, {"title": "Good as a parent company, but follow hire and fire policy.", "text": "Pros # Pay package (only way to attract talents) # Friendly colleages ( but beware of back bitting ) # Well served pantry # Free gym with instructor # Prominant locations # Timely FNFs Cons # Hire and fire policy # Internal politics # Immature and whimsical leadership # No planning for proper growth # Not advisable to join the software development centre # IDC is not a good place to work for career growth Advice to Management Please get to know the talent pool and take proper decision to maintain such assets.", "rating": 3, "pros": "# Pay package (only way to attract talents)", "cons": "# Hire and fire policy", "advice": "Please get to know the talent pool and take proper decision to maintain such assets."}, {"title": "The over all experience has been good, as far as a BPO goes it's managed well in comparison to other BPO's", "text": "Pros Regular fun days and incentives, competitive salaries and good employee recognition through bonuses and employee awards. Diverse work force creates a healthy environment Cons Standard cons for a BPO, its a challenge reporting to two sets of managers both internal and client. Progression is some what limited and there is a lack of up skill training at a management level Advice to Management More staff interaction, get mid to entry level employees feedback and actually create an even better working environment", "rating": 3, "pros": "Regular fun days and incentives, competitive salaries and good employee recognition through bonuses and employee awards. Diverse work force creates a healthy environment", "cons": "Standard cons for a BPO, its a challenge reporting to two sets of managers both internal and client. Progression is some what limited and there is a lack of up skill training at a management level", "advice": "More staff interaction, get mid to entry level employees feedback and actually create an even better working environment"}, {"title": "Good title", "text": "Pros Good culture and a good place to gain experience Cons they need to listen to staff more Advice to Management Listen to staff", "rating": 1, "pros": "Good culture and a good place to gain experience", "cons": "they need to listen to staff more", "advice": "Listen to staff"}, {"title": "Just a number", "text": "Pros It is easy to get a job there Cons The pay is terrible. Very little chance of progression. Management favour their friends for promotions. Advice to Management Be more professional", "rating": 3, "pros": "It is easy to get a job there", "cons": "The pay is terrible. Very little chance of progression. Management favour their friends for promotions.", "advice": "Be more professional"}, {"title": "Customer service samsung", "text": "Pros To be honest, the only thing i liked about the job is learning and being the first to find out about new devices Cons You work long 9 hour shifts, gets tiring and a really boring job. You dont have a work/life balance. Managers never take calls and when calls go to escalation team.. they never or hardly call the customer back. This for you means hard work and an angry customer to deal with. You have to constantly lie to customers saying they will receive a call back. Management in capita is the worst! Literally they are rude and treat you like a number! The pay is ridiculous for the amount of work you do and constantly hearing customers swear at you. Advice to Management Change shift pattern Change management Make it more fun not boring", "rating": 1, "pros": "To be honest, the only thing i liked about the job is learning and being the first to find out about new devices", "cons": "You work long 9 hour shifts, gets tiring and a really boring job. You dont have a work/life balance.", "advice": "Change shift pattern"}, {"title": "Call Centre Operative", "text": "Pros Good pay for a call centre job Cons Very boring work, sat next to a computer all day", "rating": 3, "pros": "Good pay for a call centre job", "cons": "Very boring work, sat next to a computer all day", "advice": null}, {"title": "First Day Of Training.", "text": "Pros This company is clearly not up to date on the laws of discrimination and homophobia . Cons I witnessed the tutor do nothing to combat homophobia or even prevent it. All the tutor did was roll her eyes. So this is how you deal with homophobia just roll your eyes and brush it of, DISGUSTING. Advice to Management Yesterday I was in the Capita Training for the brand Tesco Direct . This was my first day with the company and the last. I witnessed the tutor say to a new starter because he was wearing Doc Martins and he was bald that he must be part of the EDL. How inappropriate is that to say to someone on the first day of meeting them. Your team member the tutor in question also witnessed one of the new starters make a joke out of gay people. The joke was what do you call a gay horse - Neyyyy and flips his hand out as in to impersonate a homosexual. I am a homosexual Male and I found this highly offencive and completely inappropriate. The tutor just rolled her eyes and nothing was mentioned. My advice to you is to train your staff correctly on the basis of discrimination and Homophobia. As a company you state that you are open to sexual orientation that was a complete lie also I was told you are the one of the best to work for yea it really sounds like it from my first day and last day.", "rating": 1, "pros": "This company is clearly not up to date on the laws of discrimination and homophobia .", "cons": "I witnessed the tutor do nothing to combat homophobia or even prevent it. All the tutor did was roll her eyes. So this is how you deal with homophobia just roll your eyes and brush it of, DISGUSTING.", "advice": "Yesterday I was in the Capita Training for the brand Tesco Direct . This was my first day with the company and the last. I witnessed the tutor say to a new starter because he was wearing Doc Martins and he was bald that he must be part of the EDL. How inappropriate is that to say to someone on the first day of meeting them."}, {"title": "Poor treatment of workers", "text": "Pros Colleagues are the pros I can take from ParkingEye, I have made friends and connections for life. Cons Micro Management, Salary, Feeling Valued, Failed to provide workers with water after the main supply water was contaminated with Cryptosporidium for over 3 weeks. You go on annual leave and on your return they have given your position to someone else and shipped you to another department without consultation. Advice to Management Focus on worker engagement and treating people better, value your employees rather than profit margins and trying to force employees to attend Christmas Parties through their annual objectives", "rating": 1, "pros": "Colleagues are the pros I can take from ParkingEye, I have made friends and connections for life.", "cons": "Micro Management, Salary, Feeling Valued, Failed to provide workers with water after the main supply water was contaminated with Cryptosporidium for over 3 weeks. You go on annual leave and on your return they have given your position to someone else and shipped you to another department without consultation.", "advice": "Focus on worker engagement and treating people better, value your employees rather than profit margins and trying to force employees to attend Christmas Parties through their annual objectives"}, {"title": "Great company to work for", "text": "Pros Career progression and developmental opportunities are available. Good support structure and opportunity to complete continual professional development for professional registration throughout each year. Cons Can be very different to previous clinical jobs. Advice to Management Open and transparent relationships are key.", "rating": 5, "pros": "Career progression and developmental opportunities are available. Good support structure and opportunity to complete continual professional development for professional registration throughout each year.", "cons": "Can be very different to previous clinical jobs.", "advice": "Open and transparent relationships are key."}, {"title": "Best professionalism with a personal touch", "text": "Pros On time salary, Competitive Package Background Verification Cons I have not found a single cons.", "rating": 5, "pros": "On time salary,", "cons": "I have not found a single cons.", "advice": null}, {"title": "Great Company", "text": "Pros Work life balance Great people Opportunities Internal movement is getting better Cons DNA & Values Senior Managers pay lip service to the values Advice to Management Live your values and senior Directors need to look in a mirror to see if they are the problem", "rating": 5, "pros": "Work life balance", "cons": "DNA & Values", "advice": "Live your values and senior Directors need to look in a mirror to see if they are the problem"}, {"title": "Good organisation to work", "text": "Pros Good Hike. Appraisal is good. Learning is good Short term travel to UK Cons Not such thing coming to my mind as of now", "rating": 5, "pros": "Good Hike.", "cons": "Not such thing coming to my mind as of now", "advice": null}, {"title": "Avoid like the plague", "text": "Pros Did have some great people, unfortunately most were pushed out of the door or left on their own decision Cons Drone style method of working Zero motivation or enthusiasm across all faces Fake \"open door\" management policy Share prices continually plummet, no confidence in the leadership at the top Non existent business direction or career progression Unrealistic personal targets and objectives (lucky if you get a 121) Popularly referred to as \"Crapita\" amongst customers and employees Advice to Management Dissolve the business, especially the Managed Print Service", "rating": 1, "pros": "Did have some great people, unfortunately most were pushed out of the door or left on their own decision", "cons": "Drone style method of working", "advice": "Dissolve the business, especially the Managed Print Service"}, {"title": "Capita", "text": "Pros Good working environment Management was good Cons Salary issue. Salary isn't that good Advice to Management N/A", "rating": 5, "pros": "Good working environment", "cons": "Salary issue. Salary isn't that good", "advice": "N/A"}, {"title": "Typical Outsourcing Company!", "text": "Pros A real mix of great and awful people! All depends on which contract you're on. They have some great client brands on their books...looks great on your CV. It's like marmite...you'll either love it or hate it. Reasonable pay Cons The sales team appear to promise the client the world and leaves the rest of us to pick up the obvious disappointment/ anger when reality sets in. Aggressive management. Capita hasn't been doing well for a while now and it shows in Management behaviour. (Hopefully this will change now that it looks like they're about to renew some big contracts) Change is common place in Capita so don't get settled. When it happens...it's fast, unsettling and not compassionate. Very little room for progression. Their recruitment is slow. Advice to Management Change!", "rating": 1, "pros": "A real mix of great and awful people! All depends on which contract you're on.", "cons": "The sales team appear to promise the client the world and leaves the rest of us to pick up the obvious disappointment/ anger when reality sets in.", "advice": "Change!"}, {"title": "Ppi Case Handler", "text": "Pros * Job felt secure for the most part. Good if you don't like contracting. * Pay was quite good, especially if you became a senior case handler on the evening shift. Cons * Felt very micromanaged, not an issue with competent experienced managers but very much so with younger inexperienced ones who were clearly out of their depth. * Promotion depended if you got along with the 'boys club' or the 'boyband' as we called them . A small group of guys who suspiciously got more promotional opportunities than others. * High turnover of staff which wasn't great if you were just getting to know someone only for someone else to suddenly take their place. Morale felt low for most of the time. * Did meet some duplicitous and ruthless people (but is expected in such work environments). *Ops managers felt detached and distant from the case handlers. Advice to Management * Don't let a small group of managers run amok. * Ops managers could have connected more with case handlers.", "rating": 3, "pros": "* Job felt secure for the most part. Good if you don't like contracting.", "cons": "* Felt very micromanaged, not an issue with competent experienced managers but very much so with younger inexperienced ones who were clearly out of their depth.", "advice": "* Don't let a small group of managers run amok."}, {"title": "Loved working there", "text": "Pros Great salary. Fun place to work. Fabulous company benefits Cons Some very unfair performance management procedures in place, and I'm speaking as a manager who had to instigate the proceedures Advice to Management Be more supportive and understanding of disabled employees. The reason I left, was due to the poor treatment that I recieved from a senior manager. I was heartbroken at having to resign.", "rating": 5, "pros": "Great salary. Fun place to work. Fabulous company benefits", "cons": "Some very unfair performance management procedures in place, and I'm speaking as a manager who had to instigate the proceedures", "advice": "Be more supportive and understanding of disabled employees. The reason I left, was due to the poor treatment that I recieved from a senior manager. I was heartbroken at having to resign."}, {"title": "worked in CAPITA India", "text": "Pros it was cool working there. not much work pressure Cons Not remember anything actually. Only thing it was far from my home", "rating": 3, "pros": "it was cool working there. not much work pressure", "cons": "Not remember anything actually. Only thing it was far from my home", "advice": null}, {"title": "Business Analyst Grad Scheme", "text": "Pros Paid for Business analyst qualifications. Cons No Job at the end of 3 months unpaid training, Based on sales team being able to sell inexperienced analyst to companies. Don't bother. Advice to Management Stop exploiting graduates", "rating": 1, "pros": "Paid for Business analyst qualifications.", "cons": "No Job at the end of 3 months unpaid training, Based on sales team being able to sell inexperienced analyst to companies. Don't bother.", "advice": "Stop exploiting graduates"}, {"title": "Capita review", "text": "Pros Basic pay Basic holidays Nice team Cons Dull work environment Poor pay Micro management Unfriendly staff Basic holidays Advice to Management Improve company atmosphere. Learn customer service skills", "rating": 1, "pros": "Basic pay", "cons": "Dull work environment", "advice": "Improve company atmosphere."}, {"title": "Software tester", "text": "Pros - Laid Back - Management rarely on your back Cons - Not many benefits - Sometimes hard to get in touch with management", "rating": 5, "pros": "- Laid Back", "cons": "- Not many benefits", "advice": null}, {"title": "National Field Sales/Enforcement Trainer", "text": "Pros Great company who value your work Cons sometimes work can become repetitive", "rating": 5, "pros": "Great company who value your work", "cons": "sometimes work can become repetitive", "advice": null}, {"title": "Feedback on Interview Process for Capita", "text": "Pros Kept fully informed by Capita recruiter; Relaxed interview and interviewers; Structured interview following company format; Written test for systems analyst role to show competency that lasted about an hour. I brought in printed examples of my work that was appreciated and showed what I was capable of. Shown around the office after the interview; Cons From submitting the application online to hearing from the recruiter was between 3 to 4 weeks and I assumed that I had not been successful due to not hearing anything. Advice to Management Have improved status feedback of application progress even if it is pending review;", "rating": 5, "pros": "Kept fully informed by Capita recruiter;", "cons": "From submitting the application online to hearing from the recruiter was between 3 to 4 weeks and I assumed that I had not been successful due to not hearing anything.", "advice": "Have improved status feedback of application progress even if it is pending review;"}, {"title": "Application process", "text": "Pros -Really friendly experience -Quick and easy application process -Keep you up to date every step of the way -Very supportive and helpful throughout -Interviewer was friendly, welcoming and informative Cons In my case there weren't any recognisable cons with the application process Advice to Management keep it up", "rating": 5, "pros": "-Really friendly experience", "cons": "In my case there weren't any recognisable cons with the application process", "advice": "keep it up"}, {"title": "Manager", "text": "Pros Central Dublin office location and flexibility Cons Big UK based public liability company", "rating": 3, "pros": "Central Dublin office location and flexibility", "cons": "Big UK based public liability company", "advice": null}, {"title": "Good experience but low wages", "text": "Pros Large company with lots of opportunities Staff are great Cons Salaries are low and internal processes are cumbersome.", "rating": 5, "pros": "Large company with lots of opportunities", "cons": "Salaries are low and internal processes are cumbersome.", "advice": null}, {"title": "Good environment", "text": "Pros Very friendly colleagues. Relax and chill environment Cons No cons. Facilities and such are good.", "rating": 5, "pros": "Very friendly colleagues.", "cons": "No cons.", "advice": null}, {"title": "Terrible Company to work for.", "text": "Pros Fellow employees were great. Cons Incredibly disorganised. Was there 3 weeks before we were given any training on how to do our jobs. Management is incompetent, payroll is impossible to contact. Instructions on what our job should be change on a daily basis and turnover in staff is horrendous. Stay away. Advice to Management Treat your staff decently and they'll look after you.", "rating": 1, "pros": "Fellow employees were great.", "cons": "Incredibly disorganised. Was there 3 weeks before we were given any training on how to do our jobs. Management is incompetent, payroll is impossible to contact. Instructions on what our job should be change on a daily basis and turnover in staff is horrendous. Stay away.", "advice": "Treat your staff decently and they'll look after you."}, {"title": "My capita experiences", "text": "Pros flexible working, lovely team of colleagues Cons lack of progression opportunities, nepotism, no clear strategic vision, expectation to work long hours and don't reward people as promised.", "rating": 3, "pros": "flexible working, lovely team of colleagues", "cons": "lack of progression opportunities, nepotism, no clear strategic vision, expectation to work long hours and don't reward people as promised.", "advice": null}, {"title": "Good Place To Start", "text": "Pros Good People (depends on project). Good Technology Stack. Cons Bad support on Facility Escalations - Problems. Software Division also forced with BPO Policies / Procedures. No Promotion as a Software Brand.", "rating": 3, "pros": "Good People (depends on project).", "cons": "Bad support on Facility Escalations - Problems.", "advice": null}, {"title": "Love the people, flexible hours possible with the right manager", "text": "Pros Work with some creative bunch with good sense of humour. Great flexible working. Cons Lack of competitive salary means they tend to lose good talented staff. There is a 10% salary increase cap which means you cant get more than 10% salary increase no matter where or what role you move to within the company. Advice to Management Invest in your bottom level staff especially the good ones as they are the ones that do the job and it will be a shame to lose them.", "rating": 3, "pros": "Work with some creative bunch with good sense of humour. Great flexible working.", "cons": "Lack of competitive salary means they tend to lose good talented staff. There is a 10% salary increase cap which means you cant get more than 10% salary increase no matter where or what role you move to within the company.", "advice": "Invest in your bottom level staff especially the good ones as they are the ones that do the job and it will be a shame to lose them."}, {"title": "Would not recommend", "text": "Pros Consistent hours and decent pay grade. Cons Huge focus on sales (which they don't inform you of in the interview) Poor training Poor management", "rating": 3, "pros": "Consistent hours and decent pay grade.", "cons": "Huge focus on sales (which they don't inform you of in the interview)", "advice": null}, {"title": "Horrible", "text": "Pros There are no pros working here its like a prison everyone is treated like crap nobody cares about any issues you have going on they just through work and last minute decisions at you and expect you too get everything right the first time Cons I will never recommend anyone to work here the hours are long and tiring and hardly any days off if you take sick leave they interrogate you like their the cia no support from majority of the managers Advice to Management Stop gossiping and grow up", "rating": 1, "pros": "There are no pros working here its like a prison everyone is treated like crap nobody cares about any issues you have going on they just through work and last minute decisions at you and expect you too get everything right the first time", "cons": "I will never recommend anyone to work here the hours are long and tiring and hardly any days off if you take sick leave they interrogate you like their the cia no support from majority of the managers", "advice": "Stop gossiping and grow up"}, {"title": "BE AWARE", "text": "Pros It s good they offer you the possibility of study CeMap, interesting the fact of getting into the mortgages world to better understand how it works with all the processes. Cons Adverse environment, feel like a naughty pupil at school. Salary does not worth the stress. It's not a place where to stay for long, that explains why so many people constantly leave every week...", "rating": 3, "pros": "It s good they offer you the possibility of study CeMap, interesting the fact of getting into the mortgages world to better understand how it works with all the processes.", "cons": "Adverse environment, feel like a naughty pupil at school.", "advice": null}, {"title": "Senior case handler", "text": "Pros Flexible working is the best thing really. Cons No progression . Senior management not really interested unless your a manager and above. This specifically relates to management in the Lloyds project in leeds.. other contractors doing the same work are paid much better... if Capita is not passing the income to staff at least give good employment benefits. I don't know about other areas of Capita.. but here staff do more work and paid a lot less than other those working for other contractors and are generally unhappy. Advice to Management Take interest in your staff.. Catch phrases do not really do anything..if they are just that. staff what to see you do what you say. You are loosing a lot of talent. Staff do a great job, acknowledge and reward them or they are out.", "rating": 1, "pros": "Flexible working is the best thing really.", "cons": "No progression . Senior management not really interested unless your a manager and above. This specifically relates to management in the Lloyds project in leeds.. other contractors doing the same work are paid much better... if Capita is not passing the income to staff at least give good employment benefits. I don't know about other areas of Capita.. but here staff do more work and paid a lot less than other those working for other contractors and are generally unhappy.", "advice": "Take interest in your staff.."}, {"title": "Capita IT", "text": "Pros Teams are friendly and empathetic Cons Not much job security. Sometimes asked to complete work where senior management do not understand the scope or depth of complexity to a task Advice to Management Encourage teams to grow/learn, provide assistance with this. Enable promotion, do not stifle it because it is 'inconvenient' to you.", "rating": 3, "pros": "Teams are friendly and empathetic", "cons": "Not much job security. Sometimes asked to complete work where senior management do not understand the scope or depth of complexity to a task", "advice": "Encourage teams to grow/learn, provide assistance with this. Enable promotion, do not stifle it because it is 'inconvenient' to you."}, {"title": "Customer Service Advisor", "text": "Pros Lots of young people, free coffee Cons Definitely nepotism - Manager hired her son, daughter etc All of them worked in a good atmosphere, but mind if you are out of the 'circle'. Really high pressure, the manager was running through the office and literally shouted at people.", "rating": 1, "pros": "Lots of young people, free coffee", "cons": "Definitely nepotism - Manager hired her son, daughter etc", "advice": null}, {"title": "Good company", "text": "Pros Lots of opportunity, friendly people and interesting work. Cons None come to mind", "rating": 5, "pros": "Lots of opportunity, friendly people and interesting work.", "cons": "None come to mind", "advice": null}, {"title": "British Gas Billing Advisor", "text": "Pros Easy to progress in the company, if you can put up with this environment Cons Horrible working environment, you are just a number in this company. You get paid minimum wage for doing a super stressful job, if you work directly for British Gas you get paid a lot more, my advise would be to go direct with British Gas. There's a very strict no tolerance approach to absence including doctors appointments and sick days.", "rating": 1, "pros": "Easy to progress in the company, if you can put up with this environment", "cons": "Horrible working environment, you are just a number in this company. You get paid minimum wage for doing a super stressful job, if you work directly for British Gas you get paid a lot more, my advise would be to go direct with British Gas.", "advice": null}, {"title": "Flexible but poor pay", "text": "Pros Very flexible and good work life balance. Overall package is good with plenty of benefits, and good opportunities to move around different accounts. Cons Poor pay compared to competitors. And overall customer retention is poor. Recognition for a job well done is fairly non existent and no regular reviews or supervision or career progression. Advice to Management Encourage and listen to your staff. Give responsibility and recognition to a eager work force.", "rating": 1, "pros": "Very flexible and good work life balance. Overall package is good with plenty of benefits, and good opportunities to move around different accounts.", "cons": "Poor pay compared to competitors. And overall customer retention is poor. Recognition for a job well done is fairly non existent and no regular reviews or supervision or career progression.", "advice": "Encourage and listen to your staff. Give responsibility and recognition to a eager work force."}, {"title": "Not a very good place to work.....", "text": "Pros Free tap water, free coffee, free tea Cons No different from hell-fire work-wise", "rating": 1, "pros": "Free tap water, free coffee, free tea", "cons": "No different from hell-fire work-wise", "advice": null}, {"title": "Good Company", "text": "Pros Management were really helpful around health issues Cons Sometimes it can be too noisy in the call centre and this can lead to being unable to hear customers properly.", "rating": 5, "pros": "Management were really helpful around health issues", "cons": "Sometimes it can be too noisy in the call centre and this can lead to being unable to hear customers properly.", "advice": null}, {"title": "Stay clear", "text": "Pros I honestly cannot think of a 'pro' Cons Awful company. Rubbish pay, no incentive, no pay increases, rubbish employee benefits, no support from managers, senior managers are out of sight, working environment is not pleasant, system is outdated, micromanaged in every way possible, no targets to work towards, no progression... overall the worst corporate company I have ever worked for... you are literally known by your number instead of name. Advice to Management Try managing", "rating": 1, "pros": "I honestly cannot think of a 'pro'", "cons": "Awful company. Rubbish pay, no incentive, no pay increases, rubbish employee benefits, no support from managers, senior managers are out of sight, working environment is not pleasant, system is outdated, micromanaged in every way possible, no targets to work towards, no progression... overall the worst corporate company I have ever worked for... you are literally known by your number instead of name.", "advice": "Try managing"}, {"title": "Stay away", "text": "Pros The people in your team, some of the team leaders and ops managers are realy supportive. Cons Your just a number, lack of career prospects in the company. Really poor wage compared to other call centres! Advice to Management Look after your people and treat them like people not number, look at some for of a pay increase!", "rating": 1, "pros": "The people in your team, some of the team leaders and ops managers are realy supportive.", "cons": "Your just a number, lack of career prospects in the company. Really poor wage compared to other call centres!", "advice": "Look after your people and treat them like people not number, look at some for of a pay increase!"}, {"title": "Average delivery, frustrating to work for, some great people and opportunities.", "text": "Pros Decisive, ever changing, challenging, working with great people all driven to get stuff done. Loads of great opportunities for your career Cons No strategic direction or joined up thinking. Very silo'd. Doesn't get the best out of people and what they can bring to the party. Too much going on for anyone to do a good job. Confusion reigns! Advice to Management Set a strategic direction, communicate it and get everyone behind that", "rating": 3, "pros": "Decisive, ever changing, challenging, working with great people all driven to get stuff done. Loads of great opportunities for your career", "cons": "No strategic direction or joined up thinking. Very silo'd. Doesn't get the best out of people and what they can bring to the party. Too much going on for anyone to do a good job. Confusion reigns!", "advice": "Set a strategic direction, communicate it and get everyone behind that"}, {"title": "Advisor", "text": "Pros Not a lot that is a pro. Cons The management underpay you and expect loads of targets to be hit in return. Advice to Management Reconsider who is in charge and how they treat employees.", "rating": 1, "pros": "Not a lot that is a pro.", "cons": "The management underpay you and expect loads of targets to be hit in return.", "advice": "Reconsider who is in charge and how they treat employees."}, {"title": "Commercial Manager", "text": "Pros Average salary and good pension benefits Cons Absolutely awful working environment, all management are interested in is personal gain. Directors and Managers change every few months due to the enormous work load dumped on them, in my opinion, Capita under-resource for the contracts that they sign up to deliver. Advice to Management Stop quoting the lowest price to win contracts and then running the contracts on a shoestring budget.", "rating": 1, "pros": "Average salary and good pension benefits", "cons": "Absolutely awful working environment, all management are interested in is personal gain. Directors and Managers change every few months due to the enormous work load dumped on them, in my opinion, Capita under-resource for the contracts that they sign up to deliver.", "advice": "Stop quoting the lowest price to win contracts and then running the contracts on a shoestring budget."}, {"title": "Capita PIp", "text": "Pros Supportive manager and team leaders Cons Best senior manager ever worked for always available and supportive even when team leaders were busy she cared for customers and staff but now gone. Micromanaged by power hungry managers based on another site who care only about themselves. Always ready to push others under the bus when it suits. Advice to Management Sort it out. You owe it to us and customers. Think of others not yourself before it is too late! Some of us are conscientious and want to help customers", "rating": 1, "pros": "Supportive manager and team leaders", "cons": "Best senior manager ever worked for always available and supportive even when team leaders were busy she cared for customers and staff but now gone. Micromanaged by power hungry managers based on another site who care only about themselves. Always ready to push others under the bus when it suits.", "advice": "Sort it out. You owe it to us and customers. Think of others not yourself before it is too late! Some of us are conscientious and want to help customers"}, {"title": "Nice team", "text": "Pros lots of perks in Next project..client bonus and capita bonus is there Cons lots of politics for short time onsite Advice to Management Please get some certification or get knowledge in Mainframe", "rating": 5, "pros": "lots of perks in Next project..client bonus and capita bonus is there", "cons": "lots of politics for short time onsite", "advice": "Please get some certification or get knowledge in Mainframe"}, {"title": "DONT DO IT-Bullying at it s best", "text": "Pros Working on my own away from Capita toxic management Cons Terrible terrible management. You are penalised if direct debits from sales get cancelled. Toxic attitude and bully boy antics from above. Managers try to pretend to help you to squeeze what they can out of you. Toxic company, steer clear. Advice to Management Don t patronise employees doing their level best to achieve. The new toxic manageress , south east region, yes you know who you are, who came to position in 2010 was trying to make a name for herself and was a complete pain in every way shape and form. Result=staff leaving and staff undermined", "rating": 1, "pros": "Working on my own away from Capita toxic management", "cons": "Terrible terrible management. You are penalised if direct debits from sales get cancelled. Toxic attitude and bully boy antics from above. Managers try to pretend to help you to squeeze what they can out of you. Toxic company, steer clear.", "advice": "Don t patronise employees doing their level best to achieve. The new toxic manageress , south east region, yes you know who you are, who came to position in 2010 was trying to make a name for herself and was a complete pain in every way shape and form. Result=staff leaving and staff undermined"}, {"title": "Capita in general", "text": "Pros Flexi working, allowed to get on with your job Cons A bit like the NHS - full of people all working at 50% and waiting to retire. Everyone is set up to be selfish and screw others over to get ahead Advice to Management Care more about your people, set realistic targets and goals fro your workforce instead of wanting them to fail so you can asave millions on bonus payments...", "rating": 3, "pros": "Flexi working, allowed to get on with your job", "cons": "A bit like the NHS - full of people all working at 50% and waiting to retire. Everyone is set up to be selfish and screw others over to get ahead", "advice": "Care more about your people, set realistic targets and goals fro your workforce instead of wanting them to fail so you can asave millions on bonus payments..."}, {"title": "Place to Work", "text": "Pros Changing environment, dynamic place to work. Fast pace, people are great. Cons Priorities constantly changing, poor direction and very little investment is made. Advice to Management None", "rating": 3, "pros": "Changing environment, dynamic place to work. Fast pace, people are great.", "cons": "Priorities constantly changing, poor direction and very little investment is made.", "advice": "None"}, {"title": "Getting better", "text": "Pros Flexibility and exposure to a variety of challenges / scenarios. Cons Can feel like a sink or swim environment at times.", "rating": 3, "pros": "Flexibility and exposure to a variety of challenges / scenarios.", "cons": "Can feel like a sink or swim environment at times.", "advice": null}, {"title": "Capita", "text": "Pros Great Professional set up at Skyepark in Glasgow. Cons Promise of promotion seems slim as i witness 3 outside hires.", "rating": 3, "pros": "Great Professional set up at Skyepark in Glasgow.", "cons": "Promise of promotion seems slim as i witness 3 outside hires.", "advice": null}, {"title": "Improving within the business", "text": "Pros Good opportunity to further yourself within the company Cons Shift pattern can be hard to get used to Advice to Management I am enthusiastic, punctual, target driven and very keen to progress", "rating": 5, "pros": "Good opportunity to further yourself within the company", "cons": "Shift pattern can be hard to get used to", "advice": "I am enthusiastic, punctual, target driven and very keen to progress"}, {"title": "Capita travel and events", "text": "Pros Flexible with holiday, Staff are friendly Cons Management are Rubbish, The company is all about facts and Figures making money, Customer focus is gone. Employees are there last priority Staff do not get replaced when they leave. Added pressure to remaining staff, Career opportunities are extremely limited. Technology is extremely limited we are not as completive within the travel market.", "rating": 1, "pros": "Flexible with holiday, Staff are friendly", "cons": "Management are Rubbish, The company is all about facts and Figures making money, Customer focus is gone. Employees are there last priority Staff do not get replaced when they leave. Added pressure to remaining staff, Career opportunities are extremely limited. Technology is extremely limited we are not as completive within the travel market.", "advice": null}, {"title": "Good Company to learn new skills", "text": "Pros Good Experience Lot of scope for learning Cons No cons Its all good. But hard work.", "rating": 3, "pros": "Good Experience", "cons": "No cons", "advice": null}, {"title": "Opportunity", "text": "Pros Opportunity for roles in lots of different parts of the business. Good pay and management are open to suggestions and improvements Cons Lack of cooperation and communication between the different divisions. Too dependent on public sector clients. Would benefit from taking on more private sector clients", "rating": 5, "pros": "Opportunity for roles in lots of different parts of the business. Good pay and management are open to suggestions and improvements", "cons": "Lack of cooperation and communication between the different divisions. Too dependent on public sector clients. Would benefit from taking on more private sector clients", "advice": null}, {"title": "Meh", "text": "Pros Good options for moving around the company, good training in the office and on the floor. Cons Lack of communication with management. Never really know if what you're doing is what they want.", "rating": 3, "pros": "Good options for moving around the company, good training in the office and on the floor.", "cons": "Lack of communication with management. Never really know if what you're doing is what they want.", "advice": null}, {"title": "Capita Call Centre Leek", "text": "Pros Working environment. Colleagues. Good break areas. Decent set ups for desks and free drinks from vending machines is always a positive. Cons Frustrating policies which lead to very dissatisfied customers and even more dissatisfied workers. Customers regularly have a go at the staff and threaten them, management can't do anything. Very statistics driven, however we were always told to do \"better than the average of the team\" but that's not how averages work. In order to get an average, you need people above and below it (unless every member of the team gets the exact same stats week). Advice to Management Look into your policies and give more support to help the agents deal with the dissatisfaction. If the agents understood the reasoning behind the policies they could explain it to the customers which would help.", "rating": 3, "pros": "Working environment. Colleagues. Good break areas. Decent set ups for desks and free drinks from vending machines is always a positive.", "cons": "Frustrating policies which lead to very dissatisfied customers and even more dissatisfied workers. Customers regularly have a go at the staff and threaten them, management can't do anything. Very statistics driven, however we were always told to do \"better than the average of the team\" but that's not how averages work. In order to get an average, you need people above and below it (unless every member of the team gets the exact same stats week).", "advice": "Look into your policies and give more support to help the agents deal with the dissatisfaction. If the agents understood the reasoning behind the policies they could explain it to the customers which would help."}, {"title": "Dead end company.", "text": "Pros Flexible hours. Not a lot else that can be said. Some good colleagues but all equally hate the place as much as each other. Cons Childish senior management, school-like environment. Power tripping leaders who have little to no authority love lording over their staff. Management will \"throw you under the bus\" at any given opportunity. If you are ambitious, steer clear. They do not acknowledge or recognise effort and talent. They will not reward without you asking 50 times first. Capped 10% pay rise on promotions. Expect you to go the extra mile for them, yet do not reward or make any offer in return. The only recommendation I can make is to not work here. Advice to Management Develop staff to progress. I have seen about 7 vacancies advertised internally, that have all been filled by external roles, despite a number of qualified personnel being suitable applying. This is a huge issue and is one of the main reasons staff retention rates are so low and everyone leaves. For the size of the business, the opportunities are very few and far between.", "rating": 1, "pros": "Flexible hours. Not a lot else that can be said. Some good colleagues but all equally hate the place as much as each other.", "cons": "Childish senior management, school-like environment. Power tripping leaders who have little to no authority love lording over their staff. Management will \"throw you under the bus\" at any given opportunity. If you are ambitious, steer clear. They do not acknowledge or recognise effort and talent. They will not reward without you asking 50 times first. Capped 10% pay rise on promotions. Expect you to go the extra mile for them, yet do not reward or make any offer in return. The only recommendation I can make is to not work here.", "advice": "Develop staff to progress. I have seen about 7 vacancies advertised internally, that have all been filled by external roles, despite a number of qualified personnel being suitable applying. This is a huge issue and is one of the main reasons staff retention rates are so low and everyone leaves. For the size of the business, the opportunities are very few and far between."}, {"title": "CAS Ireland", "text": "Pros Some decent talented people working there in various departments , location in Dublin is good and some good work experience Cons extremely frustrating place to work and senior department members who should not be managing people. Culture unlikely to change with new owners . Turnover is high . Advice to Management Reward and recognise the staff that actually do the work for you . Some excellent people working for you but not treated accordingly .", "rating": 1, "pros": "Some decent talented people working there in various departments , location in Dublin is good and some good work experience", "cons": "extremely frustrating place to work and senior department members who should not be managing people. Culture unlikely to change with new owners . Turnover is high .", "advice": "Reward and recognise the staff that actually do the work for you . Some excellent people working for you but not treated accordingly ."}, {"title": "Worst company Ever", "text": "Pros No pros I could see apart from the infrastructure Cons Non professional , office politics to the core , the management won't let u to grow, insecure people , pathetic behaviour towards employees Advice to Management Be real stop hypocrisy !! You want puppets under u the competent ones you guys detest learn to appreciate talent", "rating": 1, "pros": "No pros I could see apart from the infrastructure", "cons": "Non professional , office politics to the core , the management won't let u to grow, insecure people , pathetic behaviour towards employees", "advice": "Be real stop hypocrisy !! You want puppets under u the competent ones you guys detest learn to appreciate talent"}, {"title": "Novus grad scheme", "text": "Pros If you get a job through Novus grad scheme it is good Cons Novus grad scheme never a good choice for Trainee Testers , They do not have much requirement for Software Testers . if you are looking for Novus Trainee Testers opportunity, try some par time job also.", "rating": 1, "pros": "If you get a job through Novus grad scheme it is good", "cons": "Novus grad scheme never a good choice for Trainee Testers , They do not have much requirement for Software Testers . if you are looking for Novus Trainee Testers opportunity, try some par time job also.", "advice": null}, {"title": "Contractor", "text": "Pros Good pay for administrative work - was contracting at Lloyds blackhorse doing data input work. Friendly trainer provided before joining the job. Cons Terrible management, threatened to claw back pay if I left the contract early, very unprepared for the contracting environment.", "rating": 3, "pros": "Good pay for administrative work - was contracting at Lloyds blackhorse doing data input work. Friendly trainer provided before joining the job.", "cons": "Terrible management, threatened to claw back pay if I left the contract early, very unprepared for the contracting environment.", "advice": null}, {"title": "Good Company to work", "text": "Pros Skilled Developers, Excellent Product, and nice environment to work Cons Need equal opportunity for all Advice to Management Nice to work. keep it up.", "rating": 5, "pros": "Skilled Developers, Excellent Product, and nice environment to work", "cons": "Need equal opportunity for all", "advice": "Nice to work. keep it up."}, {"title": "Capita Novus - should be a last resort", "text": "Pros Subscription to a good quality video course library to learn from A good internal project to work on from which useful things learnt Free tea/coffee/hot chocolate Travel expenses paid for certain period if meet criteria Cons Lack of clients unlike what was made out to be Rude trainer (in one of the streams) Likely to face worse case scenario (no pay for at least 5 months before being allowed to leave) Training is not intense or even present once the core training finishes Advice to Management Pay attention to all novus, their training rather than just holding sessions in which they're left on their own to do naught", "rating": 3, "pros": "Subscription to a good quality video course library to learn from", "cons": "Lack of clients unlike what was made out to be", "advice": "Pay attention to all novus, their training rather than just holding sessions in which they're left on their own to do naught"}, {"title": "Customer Service Advisor", "text": "Pros Good Pay, Good People Good Environment Cons Long Hours, Sometime You Get Bored On Shift Advice to Management None", "rating": 3, "pros": "Good Pay, Good People Good Environment", "cons": "Long Hours, Sometime You Get Bored On Shift", "advice": "None"}, {"title": "Senior Executive", "text": "Pros No work pressure. Chill process. No tension for leaves. U will get for week offs Cons Management is not good at.HR are pathetic they are least bothered in keeping back us. Salary is very poor. No hike after performing outstanding for hole year. Don't even think to work with Capita Advice to Management HR should be helpful. Management should be strong to support Employees.", "rating": 1, "pros": "No work pressure. Chill process. No tension for leaves. U will get for week offs", "cons": "Management is not good at.HR are pathetic they are least bothered in keeping back us. Salary is very poor. No hike after performing outstanding for hole year.", "advice": "HR should be helpful. Management should be strong to support Employees."}, {"title": "No idea of caring for staff - current or former", "text": "Pros The team (Synaptic Software) I worked with were a good bunch and products Benefits are reasonable ( but be careful which pension scheme you opt for, I am sure they try and confuse/mislead staff to save money. Cons unrealistic targets On leaving I was overpaid, which I wasn't aware of the actual reason. 5 months later I receive a letter from a collection agency, which conveniently is owned by Capita. To my knowledge, no attempts were made to contact me - I had moved house but put a redirection on, Why could they not simply phone me, my mobile number would be on my personnel file, rather than possibly leaving me with a CCJ etc. This is disgusting treatment of a former, professional employee and reflects the money grabbing/soulless attitude of the business. Advice to Management Its a wonder you continue to recruit good staff, your whole mentality is about shareholders etc. Which I would suggest hasn't worked that well for you over the last year Major projects consistently overrun, and you get the press you deserve. I am amazed to see you have secured the major one you have recently, with the debacle other other high profile ones", "rating": 1, "pros": "The team (Synaptic Software) I worked with were a good bunch and products", "cons": "unrealistic targets", "advice": "Its a wonder you continue to recruit good staff, your whole mentality is about shareholders etc. Which I would suggest hasn't worked that well for you over the last year"}, {"title": "Capita", "text": "Pros people and a happy go lucky culture. Cons micro management and a tight finance team Advice to Management hiring \"yes men\" as managers, resulting in high staff turnover due to unappreciated and undervalued staff.", "rating": 3, "pros": "people and a happy go lucky culture.", "cons": "micro management and a tight finance team", "advice": "hiring \"yes men\" as managers, resulting in high staff turnover due to unappreciated and undervalued staff."}, {"title": "Business Development", "text": "Pros Wider group access, exciting place, big! Cons Complex, political, some poor businesses", "rating": 5, "pros": "Wider group access, exciting place, big!", "cons": "Complex, political, some poor businesses", "advice": null}, {"title": "they don't care about employees at all", "text": "Pros The people on my team and my manager is great, but the company is awful Cons I was paid a full time wage whilst working part time from April 2017. Capita put the wrong tax code in so it disguised that I was being over paid. They also never gave me access to my pay slips until July. As soon as I got access, I told them what happened. They took all of my pay for the next two months and also took my tax back which they are not legally entitled to do. They will cut corners legally where they can to get as much money out of you. This hasn't just happened to me, this has happened to 7 people just on my team alone. Do not work for these guys unless you are desperate and DO NOT work for them if you have kids. You won't be able to feed them when they take your pay. I'm now getting out as soon as my notice is up. Advice to Management Start caring about your employees more. Take care of them and they will take care of you.", "rating": 1, "pros": "The people on my team and my manager is great, but the company is awful", "cons": "I was paid a full time wage whilst working part time from April 2017. Capita put the wrong tax code in so it disguised that I was being over paid. They also never gave me access to my pay slips until July. As soon as I got access, I told them what happened. They took all of my pay for the next two months and also took my tax back which they are not legally entitled to do.", "advice": "Start caring about your employees more. Take care of them and they will take care of you."}, {"title": "DO NOT EVEN BOTHER", "text": "Pros Mon-Fri work days. There is a great pub nearby where you can drown your sorrows with a beer and curry after a rubbish day (which is most). Cons Poor wages, jump through hoops for a tiny reward but if too many attain the reward, goalposts are changed to suit. Senior Management have no empathy for the \"little guys\" that keep the contact centre going. You're lucky if your manager even knows your role, most are just reading from a handbook majority of the time. Absolute life suckers, I spent 3 months with depression and anxiety because of the way I was treated (and I wasn't the only one). Pay rise 2.5% per year only if you hit all targets so lucky if you get 1%. No 121's or team time unless they want to moan at you for something. Advice to Management Go get a job in a prison, at least the prisoners may be deserving of your rubbish attitude and careless nature.", "rating": 1, "pros": "Mon-Fri work days. There is a great pub nearby where you can drown your sorrows with a beer and curry after a rubbish day (which is most).", "cons": "Poor wages, jump through hoops for a tiny reward but if too many attain the reward, goalposts are changed to suit. Senior Management have no empathy for the \"little guys\" that keep the contact centre going. You're lucky if your manager even knows your role, most are just reading from a handbook majority of the time. Absolute life suckers, I spent 3 months with depression and anxiety because of the way I was treated (and I wasn't the only one). Pay rise 2.5% per year only if you hit all targets so lucky if you get 1%. No 121's or team time unless they want to moan at you for something.", "advice": "Go get a job in a prison, at least the prisoners may be deserving of your rubbish attitude and careless nature."}, {"title": "A niche department with potential", "text": "Pros Fast paced, with high regulation, demanding legacy with major scope for turning this around. We're well down the path towards CD/CI with a number of applications. Management listens and explains their strategy if you're good and humble you'll go far. Must be practical and hands on, no room for bystanders and people that blow hot air. Cons Salaries are not competitive, regulated and pressured environment isn't for everyone. Overtime is frequent but again, suits some not others. Advice to Management Align salaries to be more competitive, push WFH and training from home days (already being done). Don't give up pushing change!", "rating": 5, "pros": "Fast paced, with high regulation, demanding legacy with major scope for turning this around. We're well down the path towards CD/CI with a number of applications. Management listens and explains their strategy if you're good and humble you'll go far. Must be practical and hands on, no room for bystanders and people that blow hot air.", "cons": "Salaries are not competitive, regulated and pressured environment isn't for everyone. Overtime is frequent but again, suits some not others.", "advice": "Align salaries to be more competitive, push WFH and training from home days (already being done). Don't give up pushing change!"}, {"title": "Awful place in every way", "text": "Pros Name on CV - albeit mine for a very short time Cons Pay is a disgrace Everyone there is so uninspiring - unkept, bossy to the point of being gobby, no charisma. The management and people being hired are bottom of the barrel. Other offices are in the worst locations and we had to always travel there and back. Sometimes we would be treated to a 1* hotel to stay over night The culture is very dull Petty does not describe it - email went out about the colour of suits, footwear, no chipped nail varnish or low cut blouses. Like being at school. No pay for sick days within the first 6 months. Expecting to work double as hard for nothing extra because no one stays in the job longer than a year (unless they've been there for 15+ years like the Post Office et al) Advice to Management Give people benefits. Working double time on the smallest wage possible is a joke. Non of the systems work - laptops, mobiles, software is all extremely archaic. It's like stepping back into the 80s. The company I work at now provides MacBook, pays our own phone bill rather than supplying a phone from 1998, our other offices are USA not Swindon and they pay extremely well with huge benefits like food in the office etc.", "rating": 1, "pros": "Name on CV - albeit mine for a very short time", "cons": "Pay is a disgrace", "advice": "Give people benefits."}, {"title": "Health Care", "text": "Pros The out of London pay was very good Cons Very unprofessional and in organised. Going through many change. I do Not recommend working for them. Sending nurses out without proper credentials Advice to Management Close the company. Will only service 3 years at the rate they are going", "rating": 1, "pros": "The out of London pay was very good", "cons": "Very unprofessional and in organised. Going through many change. I do Not recommend working for them. Sending nurses out without proper credentials", "advice": "Close the company. Will only service 3 years at the rate they are going"}, {"title": "job and company", "text": "Pros Good company, lots of opportunity Cons company sometimes feels too big", "rating": 3, "pros": "Good company, lots of opportunity", "cons": "company sometimes feels too big", "advice": null}, {"title": "Capita SIMS. A mask of deception.", "text": "Pros Good wage and working hours. Some really talented individuals. Certain management actually care and provide career opportunities. Cons Human resources are a complete joke and only see their employees as bricks in a wall. Procedures are so complicated and go against the employee. They love buracracy which really does ruin the relationships between employees.  They don't think in any simple terms its always made too complicated which is reflected in their software. They run before they can walk with any project they take rushing pretty much everything. Advice to Management Talk to the little guy at the bottom you might learn a couple of things about the company you supposedly take care of.", "rating": 1, "pros": "Good wage and working hours.", "cons": "Human resources are a complete joke and only see their employees as bricks in a wall.", "advice": "Talk to the little guy at the bottom you might learn a couple of things about the company you supposedly take care of."}, {"title": "Treasury", "text": "Pros Great team who worked together very well in a pressured environment. Cons Lack of formal training. Advice to Management I found Management very supportive and involved.", "rating": 5, "pros": "Great team who worked together very well in a pressured environment.", "cons": "Lack of formal training.", "advice": "I found Management very supportive and involved."}, {"title": "Team Manager", "text": "Pros Employee Centric, Supportive Management, Planned and Organized Structure, Safe and Clean Work Environment, Proper Work-Life Balance, Open Communication channels, Customer Delight Oriented, Great Workforce Management, Focused on Talented development and employee empowerment Cons If an individual is reluctant to work in shifts due to personal obligations or obstacles, this isn't the place to work in. Advice to Management One of the best companies to work with due to the support and guidance of the management.", "rating": 5, "pros": "Employee Centric, Supportive Management, Planned and Organized Structure, Safe and Clean Work Environment, Proper Work-Life Balance, Open Communication channels, Customer Delight Oriented, Great Workforce Management, Focused on Talented development and employee empowerment", "cons": "If an individual is reluctant to work in shifts due to personal obligations or obstacles, this isn't the place to work in.", "advice": "One of the best companies to work with due to the support and guidance of the management."}, {"title": "Sustainability at capita", "text": "Pros Company car. Small compact team. Interesting role area. Mainly covering the South West but national coverage. Gained a good reputation locally. Cons Low pay. Poor path for progression. Lack of support and training. Far too financially driven don't support the individual well enough. Advice to Management Listen to staff", "rating": 3, "pros": "Company car. Small compact team. Interesting role area. Mainly covering the South West but national coverage. Gained a good reputation locally.", "cons": "Low pay. Poor path for progression. Lack of support and training. Far too financially driven don't support the individual well enough.", "advice": "Listen to staff"}, {"title": "Ok, but not great", "text": "Pros Large organisation so lots of opportunities. Cons You have to know the right people to be afforded the right oportunity", "rating": 3, "pros": "Large organisation so lots of opportunities.", "cons": "You have to know the right people to be afforded the right oportunity", "advice": null}, {"title": "Company", "text": "Pros Very Nice place to Work Cons Nice place to wok and grow Advice to Management All works fine", "rating": 5, "pros": "Very Nice place to Work", "cons": "Nice place to wok and grow", "advice": "All works fine"}, {"title": "Senior Practitioner", "text": "Pros Good culture and work life balance Cons Not much growth opportunities in the company", "rating": 5, "pros": "Good culture and work life balance", "cons": "Not much growth opportunities in the company", "advice": null}, {"title": "Network Engineer", "text": "Pros Friendly staff Director Good working environment Work from home Cons Management not always around Not enough projects to work on Advice to Management Deploy more engineers on projects", "rating": 5, "pros": "Friendly staff", "cons": "Management not always around", "advice": "Deploy more engineers on projects"}, {"title": "Worst recruitment role ever", "text": "Pros I honestly can't think of many. You got a free breakfast, so that was quite good, but if you didn't it within designated times you didn't eat. The sales training is okay. Cons - The worse management I've had in any company, swore at me, talked down to me and made me feel worthless. - Long working hours with no flexibility. Lied about working hours to start with. - Terrible commission structure that didn't make much sense. - Overly strict policy on dress code. - Strict KPIs on call stats. - Constant abuse and shouting from management. Advice to Management - Treat your staff like they are worth something and they might stay.", "rating": 1, "pros": "I honestly can't think of many. You got a free breakfast, so that was quite good, but if you didn't it within designated times you didn't eat. The sales training is okay.", "cons": "- The worse management I've had in any company, swore at me, talked down to me and made me feel worthless.", "advice": "- Treat your staff like they are worth something and they might stay."}, {"title": "Capita Novus Programme", "text": "Pros Decent training - practical as well as theory based training OK earning potential when on assignment Ability to work on more than one assignment meaning you get some varied experience A good team helping out with finding next assignment and organising travel/accommodation. I eventually went perm at my last client, this programme gave me the foot in the door I needed. Cons Sometime spent on the bench in between assignment but this did mean I could do some additional training and take some exams before starting my next assignment. Advice to Management Good programme, improvements have recently been made. Continue on this path and it will be an amazing programme.", "rating": 5, "pros": "Decent training - practical as well as theory based training", "cons": "Sometime spent on the bench in between assignment but this did mean I could do some additional training and take some exams before starting my next assignment.", "advice": "Good programme, improvements have recently been made. Continue on this path and it will be an amazing programme."}, {"title": "Be very careful", "text": "Pros Good stepping stone, friendly and supportive teams, good balance with work and life Cons don't believe them when they make you promises, management don't care about staff hence high staff turnaround and letting the good folk go Advice to Management That's if they will ever take any. Capita do not value their staff and always mess them about, unless you're higher up on the pyramid. One of the worst things is by wasting staff time by offering interviews to give them a false sense of hope about a job where they already know who they wanted from the beginning. I left well over a year ago, and before I left I was told there will be loads of opportunities. One year on, I hear people leaving and also getting made redundant. Capita broke my self confidence and pride, and nothing will change that. I hope whoever is reading this and looking to join capita or already with them to be very vigilant (unless you're happy). Don't fall for their traps, or anyone's. One or two who are favoured over you will throw you under a bus for them to step up.", "rating": 1, "pros": "Good stepping stone, friendly and supportive teams, good balance with work and life", "cons": "don't believe them when they make you promises, management don't care about staff hence high staff turnaround and letting the good folk go", "advice": "That's if they will ever take any. Capita do not value their staff and always mess them about, unless you're higher up on the pyramid. One of the worst things is by wasting staff time by offering interviews to give them a false sense of hope about a job where they already know who they wanted from the beginning. I left well over a year ago, and before I left I was told there will be loads of opportunities. One year on, I hear people leaving and also getting made redundant. Capita broke my self confidence and pride, and nothing will change that. I hope whoever is reading this and looking to join capita or already with them to be very vigilant (unless you're happy). Don't fall for their traps, or anyone's. One or two who are favoured over you will throw you under a bus for them to step up."}, {"title": "Programme Manager/Director", "text": "Pros A good company to work and I have enjoyed my time there but it now time to move on and look for new challenges and larger more interesting projects Keep doing what you are doing Cons A good company to work and I have enjoyed my time there but it now time to move on and look for new challenges and larger more interesting projects.. being asked to do this is a complete and utter wast of time just to register for jobs whoever designed this site has no idea of what is required for job board such as this Advice to Management Keep doing what you are doing", "rating": 5, "pros": "A good company to work and I have enjoyed my time there but it now time to move on and look for new challenges and larger more interesting projects Keep doing what you are doing", "cons": "A good company to work and I have enjoyed my time there but it now time to move on and look for new challenges and larger more interesting projects.. being asked to do this is a complete and utter wast of time just to register for jobs whoever designed this site has no idea of what is required for job board such as this", "advice": "Keep doing what you are doing"}, {"title": "Solution Architect", "text": "Pros I have the pleasure of working with some of the most fantastically talented individuals who are always willing to learn new things and more importantly, teach more things. Cons A lot of the businesses in the group are splintered meaning that cross divisional opportunities are sometimes missed due to internal politics. Advice to Management Focus more on the people and innovation side of things as we are losing talented people and passing up opportunities as we are too risk averse.", "rating": 5, "pros": "I have the pleasure of working with some of the most fantastically talented individuals who are always willing to learn new things and more importantly, teach more things.", "cons": "A lot of the businesses in the group are splintered meaning that cross divisional opportunities are sometimes missed due to internal politics.", "advice": "Focus more on the people and innovation side of things as we are losing talented people and passing up opportunities as we are too risk averse."}, {"title": "Call Centre job- Okay to work for- needs better organisation", "text": "Pros -Good hours, can extend and do more if wanted to -Good pay for what the work was -Good training -Nice atmosphere/colleagues Cons Needs better management, everything a bit messy and unorganised at times. Some supervisors think they are better than you- but not all. Advice to Management Better organisation needed", "rating": 3, "pros": "-Good hours, can extend and do more if wanted to", "cons": "Needs better management, everything a bit messy and unorganised at times.", "advice": "Better organisation needed"}, {"title": "Call centre review (based in Leeds)", "text": "Pros Coworkers were friendly and the office location was reasonably convenient. Cons Management just not interested. Training was boring and extended with forced exercises. It's quite clear you're being trained to become an insignificant cog. Advice to Management Listen to your colleagues.", "rating": 3, "pros": "Coworkers were friendly and the office location was reasonably convenient.", "cons": "Management just not interested. Training was boring and extended with forced exercises. It's quite clear you're being trained to become an insignificant cog.", "advice": "Listen to your colleagues."}, {"title": "Lasklustre", "text": "Pros Decent hours not a lot of weekends. Decent pay for a poor job Cons If your a strong candidate with an opinion then management don't hire you whatsoever Advice to Management Don't be scumbags and hire or promote your mates over talented employees", "rating": 1, "pros": "Decent hours not a lot of weekends. Decent pay for a poor job", "cons": "If your a strong candidate with an opinion then management don't hire you whatsoever", "advice": "Don't be scumbags and hire or promote your mates over talented employees"}, {"title": "Short term experience", "text": "Pros easy to make friends comfortable environment Cons poor motivation and pay poor support Advice to Management make things more interesting and rewarding", "rating": 3, "pros": "easy to make friends", "cons": "poor motivation and pay", "advice": "make things more interesting and rewarding"}, {"title": "BPMI Analyst", "text": "Pros Work life balance.. Free cab facility Cons shift timings.. Less % of hikes", "rating": 3, "pros": "Work life balance.. Free cab facility", "cons": "shift timings.. Less % of hikes", "advice": null}, {"title": "Project Manager", "text": "Pros Industry wide exposure, multiple locations Cons low wages, very few benefits Advice to Management Take care of employees and they'll take care of business!", "rating": 3, "pros": "Industry wide exposure, multiple locations", "cons": "low wages, very few benefits", "advice": "Take care of employees and they'll take care of business!"}, {"title": "Called Crapita for a very good reason.", "text": "Pros None. Rubbish company. Treats employees like commodities. Cons Horrible working environment. Poor management. No training. Nothing positive to add", "rating": 1, "pros": "None. Rubbish company. Treats employees like commodities.", "cons": "Horrible working environment. Poor management. No training. Nothing positive to add", "advice": null}, {"title": "Case Handler", "text": "Pros Good people and training for the role. Cons The opportunities to progress within the business can be limited.", "rating": 5, "pros": "Good people and training for the role.", "cons": "The opportunities to progress within the business can be limited.", "advice": null}, {"title": "Capita Review", "text": "Pros Good career opportunities, My business Division has excellent senior management and a good team here Cons Nothing for my business division (Capita is made up of lots of different businesses which are sometimes hard to communicate with) Advice to Management Invest in training opportunities for Graduates", "rating": 5, "pros": "Good career opportunities, My business Division has excellent senior management and a good team here", "cons": "Nothing for my business division (Capita is made up of lots of different businesses which are sometimes hard to communicate with)", "advice": "Invest in training opportunities for Graduates"}, {"title": "Most staff nickname the company \"Crapita\" Go figure..TPR", "text": "Pros - Nice staff members - Tea and coffee station - Thorough training, training team are all lovely I'm only writing this for the 20 word minimum Cons - Undervalued staff - Extremely high staff turnover (some staff have resigned with no other job lined up) - Unprofessional office manager - Capita are very stingy and milk staff for all they're worth - Restrictive environment - Too much work as so many staff have quit - Lack of progression - Productivity is measure on a system that is currently inaccurate, managers know this but still use it as the reason to not give a pay rise (unbelievable, I know...) - Cheap company that skrimps on things such as quick computers - Employees are treated like they are just a number Advice to Management Employee engagement meetings are useless because all you do is note the watered down versions of work issues. Even when the notes are made there are no chances. I've genuinely never experienced such low morale in a work place. Over 15 members of staff have either left or are working their notice in August 2017 alone! I hope the contract somehow crashes and burns and is passed on to a company who cares about their staff.", "rating": 1, "pros": "- Nice staff members", "cons": "- Undervalued staff", "advice": "Employee engagement meetings are useless because all you do is note the watered down versions of work issues."}, {"title": "More change", "text": "Pros The portfolio is very large and therefore there is a significant customer base to go after. this could change soon Cons They management seem to change their minds every quarter, which means that there is always significant change happening. This constant churn makes customers very unhappy. Advice to Management Stop making constant changes that upset customers", "rating": 3, "pros": "The portfolio is very large and therefore there is a significant customer base to go after. this could change soon", "cons": "They management seem to change their minds every quarter, which means that there is always significant change happening. This constant churn makes customers very unhappy.", "advice": "Stop making constant changes that upset customers"}, {"title": "Bad planning of projects, frequent shut down", "text": "Pros Benefits are good, offer vouchers for employees Cons Less job security, projects can shut down without notice", "rating": 3, "pros": "Benefits are good, offer vouchers for employees", "cons": "Less job security, projects can shut down without notice", "advice": null}, {"title": "Toxic and Disfunctional", "text": "Pros Great benefits - that's about it Cons A shambles of an organisation that has lost its way. Constant re-organisation, acquisitions that create confusion, disconnected services, inter divisional politics and an obsession on monthly financial reporting - MOBS has basically created a toxic and dysfunctional environment.. the lunatics have certainly taken over the asylum Don't expected investment in either you as a person or the services you offer to clients - in my first few weeks at Capita I asked how you would describe this place - the answer was \"beige\"... unexciting, dull, inoffensive and hardly noticed. Advice to Management Sack the 200 (rumoured to be) Managing Directors, simplify the organisation, get rid of the onerous process and policies (which incidentally no-one really follows if they can help it) and refocus on the customer - not the internal accountants who are killing the business and it will be interesting to see who the next CEO is. I am betting on somebody with an Accounting/ Finance background.", "rating": 3, "pros": "Great benefits - that's about it", "cons": "A shambles of an organisation that has lost its way. Constant re-organisation, acquisitions that create confusion, disconnected services, inter divisional politics and an obsession on monthly financial reporting - MOBS has basically created a toxic and dysfunctional environment.. the lunatics have certainly taken over the asylum", "advice": "Sack the 200 (rumoured to be) Managing Directors, simplify the organisation, get rid of the onerous process and policies (which incidentally no-one really follows if they can help it) and refocus on the customer - not the internal accountants who are killing the business and it will be interesting to see who the next CEO is. I am betting on somebody with an Accounting/ Finance background."}, {"title": "Software developer", "text": "Pros Good career opportunities. Good salary. Good work life balance. Cab facility Cons No laptops upto mid level engineers Bpo culture rules for all departments", "rating": 5, "pros": "Good career opportunities.", "cons": "No laptops upto mid level engineers", "advice": null}, {"title": "Employer review", "text": "Pros None, none, none, none and none.. Cons No work life balance expected to work 10+ hours a day because you are a certain grade/salary. 23 days holiday!! What a joke. No budget for training!!! Really. shocking management team with no people skills. Worse thing is the set 10% uplift in salary for a promotion no matter what position you apply for?? All in all not worth wasting your time working for them. Advice to Management Maybe start and listen to your employees instead of dictating to them.", "rating": 3, "pros": "None, none, none, none and none..", "cons": "No work life balance expected to work 10+ hours a day because you are a certain grade/salary. 23 days holiday!! What a joke. No budget for training!!! Really. shocking management team with no people skills. Worse thing is the set 10% uplift in salary for a", "advice": "Maybe start and listen to your employees instead of dictating to them."}, {"title": "The worst company ever to work at", "text": "Pros Salary, benefits, and direct team Cons Poor management, dysfunctional, constant budget cuts and savings needed, laborious process to get any funds or resources yet supposed to improve profit, growth with nothing. I was working excessive hours, constantly under pressure. No care, empathy or support from management. Company far too big, lots of acquisitions and don't properly integrate businesses just run them with no infrastructure, funding or resources. I was doing about 10 different jobs as no resource. Advice to Management Stop being so aggressive, looking at bottom lines, listen to the issues and invest in businesses and resources.", "rating": 3, "pros": "Salary, benefits, and direct team", "cons": "Poor management, dysfunctional, constant budget cuts and savings needed, laborious process to get any funds or resources yet supposed to improve profit, growth with nothing. I was working excessive hours, constantly under pressure. No care, empathy or support from management. Company far too big, lots of acquisitions and don't properly integrate businesses just run them with no infrastructure, funding or resources. I was doing about 10 different jobs as no resource.", "advice": "Stop being so aggressive, looking at bottom lines, listen to the issues and invest in businesses and resources."}, {"title": "Okay company with no growth", "text": "Pros Good compensation, less work pressure Cons People with no skills except for buttering can become your leads or managers and will expect the same from you. Advice to Management Respect the people working hard for you not the ones licking.", "rating": 3, "pros": "Good compensation, less work pressure", "cons": "People with no skills except for buttering can become your leads or managers and will expect the same from you.", "advice": "Respect the people working hard for you not the ones licking."}, {"title": "Interesting work but restrictive pay policies", "text": "Pros Work is varied and interesting with some great opportunities Cons Maximum 10% pay rise on promotion Advice to Management Pay the external rate to those promoted. Talent won't stay just because you tell them they are important.", "rating": 5, "pros": "Work is varied and interesting with some great opportunities", "cons": "Maximum 10% pay rise on promotion", "advice": "Pay the external rate to those promoted. Talent won't stay just because you tell them they are important."}, {"title": "Decent Job for part time work, good experience", "text": "Pros Fun environment, good training and the pay isnt too bad either! Big office, plenty of different people throughout. Cons bit of a nightmare getting all your systems up and running at first but in the end got there. could be better organised. Advice to Management get everything organisd quicker. SO many new faces coming in that they arent able to sort evryone out and its bit of a free for all.", "rating": 5, "pros": "Fun environment, good training and the pay isnt too bad either! Big office, plenty of different people throughout.", "cons": "bit of a nightmare getting all your systems up and running at first but in the end got there. could be better organised.", "advice": "get everything organisd quicker. SO many new faces coming in that they arent able to sort evryone out and its bit of a free for all."}, {"title": "Asset services administrator", "text": "Pros office was close to home Cons poor management team poor salary BIG office politics Advice to Management use common sense", "rating": 1, "pros": "office was close to home", "cons": "poor management team", "advice": "use common sense"}, {"title": "Needs to think more about employees not profit", "text": "Pros Flexible working Good loyal team members (this trait is always used to the companies advantage) Cons Bully tactics No communication at all. Always overlook hard-working staff. Always promote and dedicate time to the staff that add no value to the company and deliver no results. All employee perks removed. No reward and recognition for hard work or service. Management left to their own devices and never reviewed for own performance. No appraisals or 121. Lack of career progression and usually blocked if attempted. No correct training for new staff. All member and client focus has been thrown out of the window. No loyalty to staff or clients. No consistent or performance related pay increase - pay rised only offered when threaten to leave. No support from management at any level. Advice to Management Take a long hard look at the company that staff used to enjoy working at and listen to the feedback you receive and act on it to learn where you went wrong. Last feedback delivered to you was answered with basically \"I already know\" but as you haven't done anything about it it shows the staff that you know but you don't care, as long as you have the money rolling in and all bonuses are only paid to director level or above. Any request to reward staff is declined due to financial reasons but money is thrown at people as soon as you realise you have driven the most experienced staff out of the door. If the money was availale to recognise talent in the first place they wouldn't walk. The little perks and office environment, as well as communication and recognition for both hard work and service used to make it a company people wanted to work for and to recommend to friends and family. It is no longer a company anyone wants to work at, nevermind recommend to others. Review the sick leave and the reason why people are off sick and respect and reward the staff who have been loyal and hardworking . Recognise their achievements rather than using it as a weapon against them. Managers are there to monitor and review the performance of their staff but it seems their performance is not reviewed and they are left to their own devices with no action taken if they do not meet or even skim the requirements of their performance targets or basic job role and responsibilities. It's such a shame things had to get this far. Seeing over 100 years experience walk out of the door within a 2 week period should make you sit up and wonder why, unfortunately it hasn't and the years of experience leaving the business just continues to add up.", "rating": 1, "pros": "Flexible working", "cons": "Bully tactics", "advice": "Take a long hard look at the company that staff used to enjoy working at and listen to the feedback you receive and act on it to learn where you went wrong."}, {"title": "Average - could do so much more", "text": "Pros Have to push hard to progress and develop. Cons Good job security and relatively laid back, however that may be the individual management of my team Advice to Management Invest in your staff", "rating": 3, "pros": "Have to push hard to progress and develop.", "cons": "Good job security and relatively laid back, however that may be the individual management of my team", "advice": "Invest in your staff"}, {"title": "Some opportunities, no longevity", "text": "Pros There are plenty of opportunities for people within the business Cons Salary increases are capped at 10% meaning there is little point staying within the business Advice to Management More flexibility with internal moves will keep people within the business. While outside blood is essential there is also a benefit of people who know the process and people involved, particularly within the IT sphere.", "rating": 3, "pros": "There are plenty of opportunities for people within the business", "cons": "Salary increases are capped at 10% meaning there is little point staying within the business", "advice": "More flexibility with internal moves will keep people within the business. While outside blood is essential there is also a benefit of people who know the process and people involved, particularly within the IT sphere."}, {"title": "Focus always on bottom line. No people, just numbers", "text": "Pros Good pay, benefits are OK, good pension. If targets are hit the management won't ask any questions how. Much improved training Cons No progression, very poor quality manager. Focus always on appearance to client. Customer requirements and employee well being secondary. If NOT hitting target \"support\" is terrible Advice to Management Lookafter current employees better.", "rating": 3, "pros": "Good pay, benefits are OK, good pension. If targets are hit the management won't ask any questions how. Much improved training", "cons": "No progression, very poor quality manager. Focus always on appearance to client. Customer requirements and employee well being secondary. If NOT hitting target \"support\" is terrible", "advice": "Lookafter current employees better."}, {"title": "Where do I start........", "text": "Pros Leeds/Sheffield other offices maybe - I hear that some parts are professional Cons I did start here excited with the opportunities that would be available being back at a so called big company.... Salary - 16.5k for a team leader? Yes you can imagine the quality that provided local standard is 23k.... CVs received expecting more were binned and often the roles were offered to internal staff with little to no experience and little to no training support given on the job. Management - Well where to start, lets just say that there were some very \"close\" direct line managers, where staff couldn't raise any issues. Process and policy changes including systems that didn't match the companies policies were signed off and used in little silos by \"close\" managers. You would think senior managers would remove issues like this through reallocation of personnel, you know professional approach and all that. HR - Very poor and often HR issues were shared and emails to management via the \"Ask\" system were put through a lower inexperienced manager/secretary level of staff to reply. This caused a very poor atmosphere in the office. People told the contracts weren't being renewed by pointing at them walking around the team saying no, yes no, yes. - Unfortunately this really happened. Pay/Salary - the guys working here do so for peanuts with the level of work that they complete. 12 minutes personal breaks allowed in a day and you are timed, we aren't at school and if they actually managed staff better they wouldn't need this type of poor management styles... I would really avoid at all costs Advice to Management The CEO/Business need to review Darlington and its management styles then they might just find the reasons why they score like they do on here!", "rating": 1, "pros": "Leeds/Sheffield other offices maybe - I hear that some parts are professional", "cons": "I did start here excited with the opportunities that would be available being back at a so called big company.... Salary - 16.5k for a team leader? Yes you can imagine the quality that provided local standard is 23k.... CVs received expecting more were binned and often the roles were offered to internal staff with little to no experience and little to no training support given on the job.", "advice": "The CEO/Business need to review Darlington and its management styles then they might just find the reasons why they score like they do on here!"}, {"title": "Used to be a great employer, now they are struggling", "text": "Pros - variety - some very good people Cons - financial controls - lack of autonomy - unclear strategy Advice to Management Focus on people as your best asset", "rating": 1, "pros": "- variety", "cons": "- financial controls", "advice": "Focus on people as your best asset"}, {"title": "This is a review", "text": "Pros They're ight, not too bad Cons They're terrible at paying new people Advice to Management This is advice to management", "rating": 3, "pros": "They're ight, not too bad", "cons": "They're terrible at paying new people", "advice": "This is advice to management"}, {"title": "Review", "text": "Pros Good people, support with qualifications, challenging work, good work/life balance Cons poor choice of benefits, average pension, average pay Advice to Management Put people back at the centre of the business rather than profit", "rating": 3, "pros": "Good people, support with qualifications, challenging work, good work/life balance", "cons": "poor choice of benefits, average pension, average pay", "advice": "Put people back at the centre of the business rather than profit"}, {"title": "Capita IT Services", "text": "Pros Hard to give any positives other than the fact it paid the bills Cons Not many people realise this, even those who work there, but Capita is fundamentally a group of about 100 small to medium businesses trading under the Capita brand, ran by a group of Accountants at the top level. Some of those businesses are forced to adopt the Logo some manage to avoid the honour. These 100 businesses are all controlled by layers and layers of bureaucracy, with individual business Units, Towers and Divisions, all with management structures and governance rules and regulations which make it very hard to get things done. They are aware of the fact that they are one of the most promising businesses in the country if they could just get their act together but they just cant seem to work it out. What tends to happen is that management layers will change on a regular basis due to the fact that profits aren’t going up fast enough. The management layers then have political battles or ‘land grabs’ to increase their Empires / chances of success by pulling in profitable business units which creates constant restructures and redundancies. Due to the fact the management layers are constantly changing the restructures never stop, which means that people are constantly at risk. You are most at risk in December, just in time to ruin your Xmas or June, to spoil the summer holidays, which means that people approach the holidays with serious trepidation. People who are good at their jobs generally leave after the 1st or 2nd round of redundancies, which normally happens around 12 months after an initial acquisition. People who come in and are good at their jobs can quickly get overwhelmed with work because people with high levels of motivation are in short supply 'for obvious reasons'. If you are extremely motivated and driven Capita could be the perfect fit for you to develop your skills and climb the ladder as they recognise and promote talent, the issue is the environment created by everything else that’s going on around you and how long you can cope with it. Not all business units within Capita are like this, I have been told that some are good places to work and some people who left while I was there did come back but to other roles. If you are a truly talented sales person Capita will look after you very well and pay you well, but the support you will get from others in the business ‘for obvious reasons’ will make it very challenging to succeed. These is an honest assessment of my 5-6 years at Capita. Advice to Management Stop sacking good Managers and Director because they don't fit into your org chart.. Stop the restructures and settle the business down.", "rating": 3, "pros": "Hard to give any positives other than the fact it paid the bills", "cons": "Not many people realise this, even those who work there, but Capita is fundamentally a group of about 100 small to medium businesses trading under the Capita brand, ran by a group of Accountants at the top level. Some of those businesses are forced to adopt the Logo some manage to avoid the honour. These 100 businesses are all controlled by layers and layers of bureaucracy, with individual business Units, Towers and Divisions, all with management structures and governance rules and regulations which make it very hard to get things done.", "advice": "Stop sacking good Managers and Director because they don't fit into your org chart.. Stop the restructures and settle the business down."}, {"title": "Expert Reviewer - Capita Customer Management", "text": "Pros Work-life balance, flexibility, that is about it. The people are good but after a while you need to look after yourself and leave Cons The joining wage stays the same, horrible management, force changes down your throat or ask you to quit in a nice way. No payrise, no bonus, constant change to managers, always ignoring what you have to say Advice to Management Listen to the staff, reward when required. Promote within and give a fair wage, 10% increment is absolutely rubbish. Sack incompetent managers who can't even lead a meeting.", "rating": 3, "pros": "Work-life balance, flexibility, that is about it. The people are good but after a while you need to look after yourself and leave", "cons": "The joining wage stays the same, horrible management, force changes down your throat or ask you to quit in a nice way. No payrise, no bonus, constant change to managers, always ignoring what you have to say", "advice": "Listen to the staff, reward when required. Promote within and give a fair wage, 10% increment is absolutely rubbish. Sack incompetent managers who can't even lead a meeting."}, {"title": "accounts admin-Capita asset services", "text": "Pros Friendly team,enjoy the working environment,best company culture I have experienced so far. Cons low wages,not many opportunities for career growth Advice to Management pay Better wages and be clear about career advancement options", "rating": 5, "pros": "Friendly team,enjoy the working environment,best company culture I have experienced so far.", "cons": "low wages,not many opportunities for career growth", "advice": "pay Better wages and be clear about career advancement options"}, {"title": "Operations Manager", "text": "Pros Nothing good about the company Cons bad management, lack of opportunities", "rating": 1, "pros": "Nothing good about the company", "cons": "bad management, lack of opportunities", "advice": null}, {"title": "Culture of a small company", "text": "Pros 1. Good Salary/Hike 2. Transport facility at very less cost Cons 1. No too many projects to Navigate. 2.Less options for re skilling/ extra learning Advice to Management Please think about what your people/team shouldnt be spending on.", "rating": 5, "pros": "1. Good Salary/Hike", "cons": "1. No too many projects to Navigate.", "advice": "Please think about what your people/team shouldnt be spending on."}, {"title": "The people make the place better than it is", "text": "Pros You will meet some good people Cons Massive gaps in pay between internal and external employees doing the same job Advice to Management Review your policies or continue to have high levels of attrition", "rating": 3, "pros": "You will meet some good people", "cons": "Massive gaps in pay between internal and external employees doing the same job", "advice": "Review your policies or continue to have high levels of attrition"}, {"title": "Good", "text": "Pros hours vry good, ran shuttle bus srvice from city centre to contact centre Cons managers not very nice, very strict on timing, if you had to go over on your time due to long calls, it didnt matter, but if u were one minute late from a break it was trouble.", "rating": 5, "pros": "hours vry good, ran shuttle bus srvice from city centre to contact centre", "cons": "managers not very nice, very strict on timing, if you had to go over on your time due to long calls, it didnt matter, but if u were one minute late from a break it was trouble.", "advice": null}, {"title": "Case handler", "text": "Pros Except from flexible working hours nothing else. Cons No progression. Small salary compared to others. No development.", "rating": 3, "pros": "Except from flexible working hours nothing else.", "cons": "No progression. Small salary compared to others. No development.", "advice": null}, {"title": "Referrals Advisor", "text": "Pros Its a regular monthly wage Cons Staff Morale has hit rock bottom poor wages Advice to Management Worst mistake Company's do is hand the Customer service side of their business over to this company, yes it might save you a lot of money and stream line your business. BUT the quality of the work that is carried out under your company name is shocking!!! This company is all about saving money and meeting targets and the staff and customers pay the price of this!!!!", "rating": 1, "pros": "Its a regular monthly wage", "cons": "Staff Morale has hit rock bottom", "advice": "Worst mistake Company's do is hand the Customer service side of their business over to this company, yes it might save you a lot of money and stream line your business. BUT the quality of the work that is carried out under your company name is shocking!!! This company is all about saving money and meeting targets and the staff and customers pay the price of this!!!!"}, {"title": "Customer service advisor", "text": "Pros This is a nice place to work Cons Flexible shift patterns /working hours is a problem Advice to Management nothing", "rating": 5, "pros": "This is a nice place to work", "cons": "Flexible shift patterns /working hours is a problem", "advice": "nothing"}, {"title": "Senior Business Director", "text": "Pros Clinical staff superb, a lot of experience within clinical triage and decision healthcare management. Operations, Product and Delivery staff always tried to be supportive. Cons The business lacks leadership, direction, strategy and business planning from senior management team. No investment in products since Capita plc acquired business 3 years ago. Very little bid strategy and lack of internal resource made proposals hard work to complete. Lost various global opportunities because Capita Healthcare Decisions too greedy on profit margins. Advice to Management Strong senior leadership team required to steer this business in the right direction. Take out global and focus on UK and Europe. I would not recommend this business to a friend. It is a failing business", "rating": 1, "pros": "Clinical staff superb, a lot of experience within clinical triage and decision healthcare management. Operations, Product and Delivery staff always tried to be supportive.", "cons": "The business lacks leadership, direction, strategy and business planning from senior management team. No investment in products since Capita plc acquired business 3 years ago. Very little bid strategy and lack of internal resource made proposals hard work to complete. Lost various global opportunities because Capita Healthcare Decisions too greedy on profit margins.", "advice": "Strong senior leadership team required to steer this business in the right direction. Take out global and focus on UK and Europe."}, {"title": "Worst experience of my career", "text": "Pros NA well located in a good/modern campus Cons its much like Egypt scenario 2000 years back. The employee voice will not be reached. Most of the promotions and increment is based on the way he/she looks, there are better chances you will be promoted if you wear the right attire and drink with the managers Advice to Management NA - its too late for change, give it up", "rating": 1, "pros": "NA well located in a good/modern campus", "cons": "its much like Egypt scenario 2000 years back. The employee voice will not be reached.", "advice": "NA - its too late for change, give it up"}, {"title": "Accounts", "text": "Pros Central location near Victoria area Cons Pay isn't very good for London. I don't like the office, grey, not enough space. Promotion seems unlikely for me. Many colleagues aren't very pleasant, don't talk, can't believe how many junior and middle staff there are, and I don't know why so many needed, and some have been around forever without any promotion? Managers don't seem to have meetings or give clear vision. Training would be a good idea? Recent image of the firm could do with a re-vamp. Too many constituent companies, layers of managers, divisions etc. Advice to Management Cut out the layers. Talk to us more. Shake things up. Move people on. Hire some top people who can communicate well and who have worked for good companies, not just relying on grey, introverted middle managers who can't motivate", "rating": 1, "pros": "Central location near Victoria area", "cons": "Pay isn't very good for London. I don't like the office, grey, not enough space. Promotion seems unlikely for me. Many colleagues aren't very pleasant, don't talk, can't believe how many junior and middle staff there are, and I don't know why so many needed, and some have been around forever without any promotion? Managers don't seem to have meetings or give clear vision. Training would be a good idea? Recent image of the firm could do with a re-vamp. Too many constituent companies, layers of managers, divisions etc.", "advice": "Cut out the layers. Talk to us more. Shake things up. Move people on. Hire some top people who can communicate well and who have worked for good companies, not just relying on grey, introverted middle managers who can't motivate"}, {"title": "Consultancy", "text": "Pros Open to innovation, variety of roles Cons Consultancy so often roles are not necassarily the correct fit Limited scope for promotion Advice to Management Look to develop current employee's rather than bringing in hired help", "rating": 3, "pros": "Open to innovation, variety of roles", "cons": "Consultancy so often roles are not necassarily the correct fit", "advice": "Look to develop current employee's rather than bringing in hired help"}, {"title": "Novus Scheme - business analyst", "text": "Pros They do provide you with training, and if you are lucky you will get a range of clients to work with. Cons Honestly there is so many I will provide them a later date. What I will say is if you do join the novus scheme really make sure it is what you want and you are willing to sacrifice your time to be a part of it. Worst case scenario you could be training and on the bench for a total of 7 months. All of which is unpaid.", "rating": 3, "pros": "They do provide you with training, and if you are lucky you will get a range of clients to work with.", "cons": "Honestly there is so many I will provide them a later date. What I will say is if you do join the novus scheme really make sure it is what you want and you are willing to sacrifice your time to be a part of it. Worst case scenario you could be training and on the bench for a total of 7 months. All of which is unpaid.", "advice": null}, {"title": "Building Surveyor", "text": "Pros Excellent company with huge potential for personal progression within due to the size, as well as the company ethos. The nature and structure allows this progression solely to depend on your own decision making, passion and tactical ability. Not a business for laid back introverted types. Cons The size and scale can create barriers for creating change and it can take a long time to progress certain aspects. It is however vital to show added value for everything you do in Capita otherwise you will get nowhere. Advice to Management Invest heavily in the youth coming through and ensure the highest attention to detail possible when interviewing new employees. The people you take on board can so, so easily make or break a department. As well as this off load personnel who refuse to co-operate and bring about progress in the company, this should be completely paramount. Capita should not be about power grabbing and low level tribal vendettas.", "rating": 5, "pros": "Excellent company with huge potential for personal progression within due to the size, as well as the company ethos. The nature and structure allows this progression solely to depend on your own decision making, passion and tactical ability. Not a business for laid back introverted types.", "cons": "The size and scale can create barriers for creating change and it can take a long time to progress certain aspects. It is however vital to show added value for everything you do in Capita otherwise you will get nowhere.", "advice": "Invest heavily in the youth coming through and ensure the highest attention to detail possible when interviewing new employees. The people you take on board can so, so easily make or break a department. As well as this off load personnel who refuse to co-operate and bring about progress in the company, this should be completely paramount. Capita should not be about power grabbing and low level tribal vendettas."}, {"title": "You get what you put in!", "text": "Pros Very relaxed, friendly but busy atmosphere. Quite a unique, modern place to work. Lots of incentives, rewarded for hard work, lots of room to promote if you put the effort in - it is what you make of it. Cons Hours can be slightly unsociable depending on your lifestyle, can be quite repetitive if you don't get involved in extra activities. Very strict on break times and adherence to schedule", "rating": 5, "pros": "Very relaxed, friendly but busy atmosphere. Quite a unique, modern place to work. Lots of incentives, rewarded for hard work, lots of room to promote if you put the effort in - it is what you make of it.", "cons": "Hours can be slightly unsociable depending on your lifestyle, can be quite repetitive if you don't get involved in extra activities. Very strict on break times and adherence to schedule", "advice": null}, {"title": "It's okay.", "text": "Pros It's an okay place to work. The people are nice but and they make you feel welcome but anyone above immediate management may not leave the same impression. The company does look after their employees and you are treated as a human which is nice. Cons Pay is average to poor. Incredibly stingy with money. Incredibly convoluted business structure as capita is so large. It can become hard to know who to talk to.", "rating": 3, "pros": "It's an okay place to work. The people are nice but and they make you feel welcome but anyone above immediate management may not leave the same impression.", "cons": "Pay is average to poor. Incredibly stingy with money.", "advice": null}, {"title": "Best Place to work", "text": "Pros Open door policy Good work culture transport facility opportunities to learn Work life balance Approachable Management Cons Salary part can be an issue here Advice to Management Good luck !", "rating": 5, "pros": "Open door policy", "cons": "Salary part can be an issue here", "advice": "Good luck !"}, {"title": "Good company with real worthless managers", "text": "Pros Good Name around UK. Cons 1. Leaders who came from small company like Nitin should be fired first for the company to flourish. 2. Should behave like MNC and not like a local kirana shop. 3. Employees should be respected 4. HR team should be more responsible 5. Process should be formed and should be distributed to management for them to follow Advice to Management Fire the management team in India and get someone who came from a big MNC and not from some company where they were the only employees. People should know that the team working for them also carries some experience and most of the time are from better companies than you guys are :)", "rating": 1, "pros": "Good Name around UK.", "cons": "1. Leaders who came from small company like Nitin should be fired first for the company to flourish.", "advice": "Fire the management team in India and get someone who came from a big MNC and not from some company where they were the only employees. People should know that the team working for them also carries some experience and most of the time are from better companies than you guys are :)"}, {"title": "It Project management", "text": "Pros Good training and development Cons Improve kn flexible working arrangements Advice to Management Spend more 1-1 sessions if possible", "rating": 5, "pros": "Good training and development", "cons": "Improve kn flexible working arrangements", "advice": "Spend more 1-1 sessions if possible"}, {"title": "Capita", "text": "Pros the flexibility is very good, ability to start any time from 8-10, Cons you don't get praised for good job, however you will be instantly told when you made an error.", "rating": 3, "pros": "the flexibility is very good, ability to start any time from 8-10,", "cons": "you don't get praised for good job, however you will be instantly told when you made an error.", "advice": null}, {"title": "John Lewis customer services", "text": "Pros About what you'd expect from an outsource customer service job. The clients are decent and the targets aren't too difficult. Cons Fairly skilled work by customer service standards, management can be a little work shy at times. Advice to Management Focus on retaining the talented employees rather than hiring new people after the attrition rates get too bad.", "rating": 5, "pros": "About what you'd expect from an outsource customer service job. The clients are decent and the targets aren't too difficult.", "cons": "Fairly skilled work by customer service standards, management can be a little work shy at times.", "advice": "Focus on retaining the talented employees rather than hiring new people after the attrition rates get too bad."}, {"title": "CCM", "text": "Pros Plenty of opportunities to move around and come genuinely awesome people work here Gained lots of experience Cons Fast-paced and hectic Bad communication Stupid attrition levels Terrible recruitment", "rating": 3, "pros": "Plenty of opportunities to move around and come genuinely awesome people work here", "cons": "Fast-paced and hectic", "advice": null}, {"title": "Dominant UK presence", "text": "Pros Majorservice provider in UK BFS market. Cash secured company. All Pune offices are with in the city limits with very good transportation. The people around are good especially Sr. Management. For lower and middle level staff there are many onshore opportunities, especially in the IT division. Training department is good. Kalyani Nagar facility has good canteens. Company is in Growing phase in India. Cons The Indian growth plan is not defined well. Work from home is limited. Presence in Geography other than UK, India and Dubai is too thin. Advice to Management Indian Growth plan has to be strong. All the best, this is a good company.", "rating": 5, "pros": "Majorservice provider in UK BFS market. Cash secured company. All Pune offices are with in the city limits with very good transportation. The people around are good especially Sr. Management. For lower and middle level staff there are many onshore opportunities, especially in the IT division. Training department is good. Kalyani Nagar facility has good canteens. Company is in Growing phase in India.", "cons": "The Indian growth plan is not defined well. Work from home is limited. Presence in Geography other than UK, India and Dubai is too thin.", "advice": "Indian Growth plan has to be strong. All the best, this is a good company."}]