[{"title": "Play Favorites", "text": "Pros Good work culture Kind, respectful coworkers Cons Difficult to be recognized, noticed, or promoted--it all depends on the group you work for Advice to Management Pay attention to all your employees--have higher ups check in with employees", "rating": 5, "pros": "Good work culture", "cons": "Difficult to be recognized, noticed, or promoted--it all depends on the group you work for", "advice": "Pay attention to all your employees--have higher ups check in with employees"}, {"title": "N/A", "text": "Pros very talented group of people Cons although its a large agency it could use additional support as the staff is overworked", "rating": 5, "pros": "very talented group of people", "cons": "although its a large agency it could use additional support as the staff is overworked", "advice": null}, {"title": "Great place to work", "text": "Pros Loved the people and the energy Cons Hard work and overtime is expected", "rating": 5, "pros": "Loved the people and the energy", "cons": "Hard work and overtime is expected", "advice": null}, {"title": "Worst shop in a Dying industry", "text": "Pros High end parties Normal benefits Cons Super sweatshop, had no life work balance at CDM. Total burn out and complete unappreciation. Supreme politics and unspoken racism. Advice to Management Listen to EVERYONE", "rating": 1, "pros": "High end parties", "cons": "Super sweatshop, had no life work balance at CDM.", "advice": "Listen to EVERYONE"}, {"title": "Intern", "text": "Pros Great culture, very collaborative environment Cons Long hours, and sometimes slow work for interns", "rating": 5, "pros": "Great culture, very collaborative environment", "cons": "Long hours, and sometimes slow work for interns", "advice": null}, {"title": "Good Place to Work", "text": "Pros Atmosphere, generous PTO and medical benefits Cons Not much growth for opportunities if you work from satellite offices outside on NYC", "rating": 3, "pros": "Atmosphere, generous PTO and medical benefits", "cons": "Not much growth for opportunities if you work from satellite offices outside on NYC", "advice": null}, {"title": "Another one bites the dust", "text": "Pros good benefits, depending on what team you are on there are some good people Cons long hours, a lot of favoritism, feels more like a factory than a creative environment, insane turnover rate Advice to Management CDM is losing A LOT of good people. Management needs to acknowledge this and figure out a way to keep people. Your workers are not just disposable puppets.", "rating": 3, "pros": "good benefits, depending on what team you are on there are some good people", "cons": "long hours, a lot of favoritism, feels more like a factory than a creative environment, insane turnover rate", "advice": "CDM is losing A LOT of good people. Management needs to acknowledge this and figure out a way to keep people. Your workers are not just disposable puppets."}, {"title": "Business Development Associate", "text": "Pros Decent benefits, high profile clients, good learning opportunity Cons bad corporate culture. business development team is full of rude people Advice to Management Make sure your employees are being treated well.", "rating": 3, "pros": "Decent benefits, high profile clients, good learning opportunity", "cons": "bad corporate culture. business development team is full of rude people", "advice": "Make sure your employees are being treated well."}, {"title": "VP", "text": "Pros Caring, creative and it's well run. People also truly care about you and your development. It's not the same in other agencies I've worked. Cons I wouldn't change much about CDM. I think it has helped me grown while I've been here and I've seen so many others do the same Advice to Management I think the new president is really making a difference.", "rating": 5, "pros": "Caring, creative and it's well run. People also truly care about you and your development. It's not the same in other agencies I've worked.", "cons": "I wouldn't change much about CDM. I think it has helped me grown while I've been here and I've seen so many others do the same", "advice": "I think the new president is really making a difference."}, {"title": "Account Supervisor", "text": "Pros Good creatives. Very buttoned up. Highly rigid environment Cons Culture is cut throat. You either thrive or don't Advice to Management People are not a commodity. They are the life blood of the organization. without them there are just empty desks.", "rating": 5, "pros": "Good creatives. Very buttoned up. Highly rigid environment", "cons": "Culture is cut throat. You either thrive or don't", "advice": "People are not a commodity. They are the life blood of the organization. without them there are just empty desks."}, {"title": "Great people. Not so much creative.", "text": "Pros Some of the nicest people. There are cliques, and it's kind of an old boys club up top, but some of the nicest people I've worked with. Cons Creative leadership is super nice, but doesn't pick the best creative. Constantly recycling ideas, many times ideas that didn't win pitches. If you want to work in a creative setting, get ready to fight tooth and nail for your ideas. That, or be happy with the most see-say work you'll ever see. Advice to Management Listen to younger employees who have their fingers on the pulse of the industry. Don't recycle ideas. If it wasn't good enough three years ago, it won't be good enough now.", "rating": 1, "pros": "Some of the nicest people. There are cliques, and it's kind of an old boys club up top, but some of the nicest people I've worked with.", "cons": "Creative leadership is super nice, but doesn't pick the best creative. Constantly recycling ideas, many times ideas that didn't win pitches. If you want to work in a creative setting, get ready to fight tooth and nail for your ideas. That, or be happy with the most see-say work you'll ever see.", "advice": "Listen to younger employees who have their fingers on the pulse of the industry. Don't recycle ideas. If it wasn't good enough three years ago, it won't be good enough now."}, {"title": "A company that cares!", "text": "Pros This company sets the bar for caring about both business and employees. They care about the people that work for them, the clients they engage, the community they are in, and the fun to be had. Work life balance is fully achieved here with flexible work hours, great benefits, and office incentives. And they love feedback! Cons At this time, I have not experienced any.", "rating": 5, "pros": "This company sets the bar for caring about both business and employees. They care about the people that work for them, the clients they engage, the community they are in, and the fun to be had. Work life balance is fully achieved here with flexible work hours, great benefits, and office incentives. And they love feedback!", "cons": "At this time, I have not experienced any.", "advice": null}, {"title": "Great place to work", "text": "Pros Great people, good clients, great holding company (BBDO). Cons Open office concept is loud and somewhat difficult to work in, even with noise-cancelling headphones. Advice to Management Keep doing what you're doing.", "rating": 5, "pros": "Great people, good clients, great holding company (BBDO).", "cons": "Open office concept is loud and somewhat difficult to work in, even with noise-cancelling headphones.", "advice": "Keep doing what you're doing."}, {"title": "Agency of old", "text": "Pros Free bananas and coffee. Cons They shipped a good chunk of finance to India Advice to Management Don't be cheap.", "rating": 3, "pros": "Free bananas and coffee.", "cons": "They shipped a good chunk of finance to India", "advice": "Don't be cheap."}, {"title": "Senior Copywriter", "text": "Pros GREAT people, ALOT of experience- more than i would have gotten in that role elsewhere Cons Things take reallly reallllyyyy long to happen (promotions/moving to a new team) Upper management doesn't care all that much", "rating": 5, "pros": "GREAT people, ALOT of experience- more than i would have gotten in that role elsewhere", "cons": "Things take reallly reallllyyyy long to happen (promotions/moving to a new team) Upper management doesn't care all that much", "advice": null}, {"title": "Lol lol lol.", "text": "Pros Great values. They talk about them and post them everywhere. You can't miss them. Cons Follow their values until the numbers don't look good. Not so graceful then Advice to Management Grow up", "rating": 1, "pros": "Great values. They talk about them and post them everywhere. You can't miss them.", "cons": "Follow their values until the numbers don't look good. Not so graceful then", "advice": "Grow up"}, {"title": "Room for creativity", "text": "Pros People seem really happy here. There are minor complaints here and there but I would say the culture here is positive and people are generally very approachable. Seems like a very chill place so far Cons Work that needs to be done ebb and flow - sometimes you're really busy other times very very open. Work varies by client as well Advice to Management None so far", "rating": 5, "pros": "People seem really happy here. There are minor complaints here and there but I would say the culture here is positive and people are generally very approachable. Seems like a very chill place so far", "cons": "Work that needs to be done ebb and flow - sometimes you're really busy other times very very open. Work varies by client as well", "advice": "None so far"}, {"title": "CDM NY Review", "text": "Pros The people are for the most part nice to work with and depending on the team a good work life balance Cons The work can be very boring", "rating": 3, "pros": "The people are for the most part nice to work with and depending on the team a good work life balance", "cons": "The work can be very boring", "advice": null}, {"title": "svp", "text": "Pros one of the best creative environments to work in. office style, management, people make it so that it is a pleasure to come to work Cons too many issues with office politics sometimes for our clients get in the way of being the best we can be Advice to Management keep recognizing superior creative work, be more selective in which clients we agree to accept as some may be more injurious to morale than the \"profits\" warrant", "rating": 5, "pros": "one of the best creative environments to work in. office style, management, people", "cons": "too many issues with office politics sometimes for our clients get in the way of being the best we can be", "advice": "keep recognizing superior creative work, be more selective in which clients we agree to accept as some may be more injurious to morale than the \"profits\" warrant"}, {"title": "Dynamic place to work", "text": "Pros Terrific mobility, terrific people and always something (good) happening. New President is a true leader and setting a great vibe around the agency. Cons Nothing I can think of", "rating": 5, "pros": "Terrific mobility, terrific people and always something (good) happening. New President is a true leader and setting a great vibe around the agency.", "cons": "Nothing I can think of", "advice": null}, {"title": "Account Supervisor", "text": "Pros Management, bonuses, diverse clients, global footprint Cons Creative risk-taking, project management department Advice to Management Keep doing what you are doing", "rating": 5, "pros": "Management, bonuses, diverse clients, global footprint", "cons": "Creative risk-taking, project management department", "advice": "Keep doing what you are doing"}, {"title": "Stay away!", "text": "Pros free food and coffee; unlimited access to mens' and ladies' room Cons Hostile, snooty culture where the only time people smile is when they congratulate colleagues who have managed to find another job. Highest pressure shop in the city where 'chitchat' is frowned on. Narcissists at the top line the halls with photos of themselves at all stages of their lives -- even baby pictures. Worst shop around. Advice to Management When you fired all the upper tier folks en masse -- who built the business from the bottom up, you showed the folks in the ranks how they will be rewarded will be for loyalty and hard work.", "rating": 1, "pros": "free food and coffee; unlimited access to mens' and ladies' room", "cons": "Hostile, snooty culture where the only time people smile is when they congratulate colleagues who have managed to find another job. Highest pressure shop in the city where 'chitchat' is frowned on. Narcissists at the top line the halls with photos of themselves at all stages of their lives -- even baby pictures. Worst shop around.", "advice": "When you fired all the upper tier folks en masse -- who built the business from the bottom up, you showed the folks in the ranks how they will be rewarded will be for loyalty and hard work."}, {"title": "Account Supervisor", "text": "Pros Good people overall. Convenient location. They have many Pfizer account which are located across the street. Generally a relatively social atmosphere Cons You will be largely ignored unless you work on high profile brands. Maintenance brands have staffing issues and promotions are much more difficult. Internal financial management software and practices are tedious and cumbersome and updates are required monthly. PM department is very weak and account ends up responsible for most of their job description. Advice to Management Fix PM department, update finance software and focus on folks who keep the ship afloat and not just the giant accounts.", "rating": 5, "pros": "Good people overall. Convenient location. They have many Pfizer account which are located across the street. Generally a relatively social atmosphere", "cons": "You will be largely ignored unless you work on high profile brands. Maintenance brands have staffing issues and promotions are much more difficult. Internal financial management software and practices are tedious and cumbersome and updates are required monthly. PM department is very weak and account ends up responsible for most of their job description.", "advice": "Fix PM department, update finance software and focus on folks who keep the ship afloat and not just the giant accounts."}, {"title": "Unusually lovely people", "text": "Pros People treat one another with a level of respect and kindness that is sadly, all too rare in our business. They call it GRACE and it's deemed quite important when hiring or assessing employees. It seems to be second nature for everyone and is quite infectious and makes even the tightest deadlines easier. Cons I wish I joined here years ago and can understand why people seem to stay forever. Cannot find any other cons to write about. Advice to Management Keep doing what you're doing. Please.", "rating": 5, "pros": "People treat one another with a level of respect and kindness that is sadly, all too rare in our business. They call it GRACE and it's deemed quite important when hiring or assessing employees. It seems to be second nature for everyone and is quite infectious and makes even the tightest deadlines easier.", "cons": "I wish I joined here years ago and can understand why people seem to stay forever. Cannot find any other cons to write about.", "advice": "Keep doing what you're doing. Please."}, {"title": "Great place to work", "text": "Pros Great people, varied work. Great digital routing process. Good management Cons Sometimes hectic, some unexpected late nights. Dislike the goals/review process (comes from parent company)", "rating": 5, "pros": "Great people, varied work. Great digital routing process. Good management", "cons": "Sometimes hectic, some unexpected late nights. Dislike the goals/review process (comes from parent company)", "advice": null}, {"title": "Art Supervisor", "text": "Pros Nice colleagues, team work spirit every where you look, very talented people, easy access by train Cons The agency has changed after Omnicom took over. Very understaffed, long hours of work, the gesture of courtesy of the company covering dinner when you work around 13 hours a day are gone, replacement of local employees by outsourcing jobs overseas it's taking a toll on quality and working conditions.", "rating": 3, "pros": "Nice colleagues, team work spirit every where you look, very talented people, easy access by train", "cons": "The agency has changed after Omnicom took over. Very understaffed, long hours of work, the gesture of courtesy of the company covering dinner when you work around 13 hours a day are gone, replacement of local employees by outsourcing jobs overseas it's taking a toll on quality and working conditions.", "advice": null}, {"title": "Chaos", "text": "Pros The pay was good. That was it. Cons 12-hour-workdays, non-stop meetings, stressed out people, etc.", "rating": 3, "pros": "The pay was good. That was it.", "cons": "12-hour-workdays, non-stop meetings, stressed out people, etc.", "advice": null}, {"title": "A good company but not always a great place to work", "text": "Pros Great support, culture, and benefits Cons Demand long hours. Never enough to just do your job...they're always looking to have you go above and beyond.", "rating": 5, "pros": "Great support, culture, and benefits", "cons": "Demand long hours. Never enough to just do your job...they're always looking to have you go above and beyond.", "advice": null}, {"title": "Senior Presentation Specialist", "text": "Pros - Smart and hardworking colleagues - Collaborative environment - Challenging work - High standards on quality of work Cons - Work/life balance needs improvement - Path for career growth not always easy Advice to Management Have more open dialogue with employees.", "rating": 5, "pros": "- Smart and hardworking colleagues", "cons": "- Work/life balance needs improvement", "advice": "Have more open dialogue with employees."}, {"title": "Great culture", "text": "Pros Well defined and meaningful culture and values. Great personal and professional development. Very supportive environment. Great deal of female talent and advancement. Cons Pay tends to be less than industry standard for many positions and men seem to be better compensated than women. Recent loss of great female leadership.", "rating": 5, "pros": "Well defined and meaningful culture and values. Great personal and professional development. Very supportive environment. Great deal of female talent and advancement.", "cons": "Pay tends to be less than industry standard for many positions and men seem to be better compensated than women. Recent loss of great female leadership.", "advice": null}, {"title": "Great for pharma", "text": "Pros Great people who get the job done is a heavy regulated market Cons was print focused, pharma is boring and slow to move Advice to Management Push the digital envelop1", "rating": 5, "pros": "Great people who get the job done is a heavy regulated market", "cons": "was print focused, pharma is boring and slow to move", "advice": "Push the digital envelop1"}, {"title": "they pay me", "text": "Pros they pay me to come to work Cons they make me work every day", "rating": 3, "pros": "they pay me to come to work", "cons": "they make me work every day", "advice": null}, {"title": "Disappointing in the end. However I do wish them the best!", "text": "Pros Some really great people and work. Truly. If you're in the right circle you can actually get to do some good work, however this is really rare. Good work life balance. Cons Really bad hires in managerial roles. (Apparently all you need is the ability to constantly compliment the right people and be a 'yes man', and you are allowed to steal/ palm off other peoples ideas and pass them off as you're own!) Company talks a lot about employee growth, but does absolutely nothing towards that. Managers tend to think this is not their responsibility. (obvious there are a few bad apples, and those are the ones I am referring to and was stuck with for a little too long!!) Advice to Management Pay more attention to what happenings in your groups.", "rating": 3, "pros": "Some really great people and work. Truly. If you're in the right circle you can actually get to do some good work, however this is really rare.", "cons": "Really bad hires in managerial roles. (Apparently all you need is the ability to constantly compliment the right people and be a 'yes man', and you are allowed to steal/ palm off other peoples ideas and pass them off as you're own!)", "advice": "Pay more attention to what happenings in your groups."}, {"title": "In transition", "text": "Pros Great company, employees share enthusiasm and love for the craft. Cons Transitioning due to the migration of all Omnicom companies. SOP and process changing. Some budget cuts are being made.", "rating": 5, "pros": "Great company, employees share enthusiasm and love for the craft.", "cons": "Transitioning due to the migration of all Omnicom companies. SOP and process changing. Some budget cuts are being made.", "advice": null}, {"title": "Out of Touch", "text": "Pros There used to only be Pros but over the years there are only CONS Cons Senior Management has lost sight of what's important... the people who work for the company. There is no transparency. They have become out of touch with their employees.", "rating": 3, "pros": "There used to only be Pros but over the years there are only CONS", "cons": "Senior Management has lost sight of what's important... the people who work for the company. There is no transparency. They have become out of touch with their employees.", "advice": null}, {"title": "Post-Transition", "text": "Pros Great employee atmosphere Great benefits - Vacation, health overall, 401k Majority of senior management care about the growth of the employees at the mid to entry-level tiers Cons Budget cuts - consolidating services at employee expense particularly for industry experience levels 3years or below Transitioned from a warm and welcoming/personal CDM independent \"look & feel\" to a cold and colorless open floor plan with cheap office materials and resources that screams sales cold-calling center Lack of opportunities - While a majority of senior management seem to care about the growth of those at the mid to lower levels - issues and voice-opinions are not being addressed and instead either overlooked or disregarded Advice to Management 1. Investing in employee happiness across the board will in turn generate the client love (revenue growth) you seek", "rating": 3, "pros": "Great employee atmosphere", "cons": "Budget cuts - consolidating services at employee expense particularly for industry experience levels 3years or below", "advice": "1. Investing in employee happiness across the board will in turn generate the client love (revenue growth) you seek"}, {"title": "Management has no clue", "text": "Pros Used to be a great place to work. Good camaraderie. Decent benefits. The creative is decent and the creatives strive for perfection. Cons All its companies are mismanaged. There is no training and advancement very limited . Managers do not care about their employees. All in all, a sweatshop with salary increases only to managers' favorites. Advice to Management Give a hoot about your employees. And show some loyalty. And a raise once in a while would boost the dismal morale.", "rating": 3, "pros": "Used to be a great place to work. Good camaraderie. Decent benefits. The creative is decent and the creatives strive for perfection.", "cons": "All its companies are mismanaged. There is no training and advancement very limited . Managers do not care about their employees. All in all, a sweatshop with salary increases only to managers' favorites.", "advice": "Give a hoot about your employees. And show some loyalty. And a raise once in a while would boost the dismal morale."}, {"title": "Losing the thread", "text": "Pros Strong culture and formerly strong emphasis on developing people. Cons Has transformed into the worst kind of sweatshop agency. Long, LONG hours for clients whose expectations are poorly managed. Creative leadership is ossified so that only those who \"grew up\" within CDM and within the right cliques advance at a pace commensurate with their talents and achievements. Efforts by leadership to engage with the rank and file feel contrived and phony. The Los Angeles office was sunk by poor leadership decisions, beginning with the top brass in NYC, that were made as a result of the aforementioned situation. The imperative to \"run lean\" also contributed, so beware when thinking of joining an Omnicom-owned agency. They demand blood from stones in the form of black ink in the ledger every single quarter no matter what. Long-term visions are dimmed by short-term financial priorities. The CEO once told me that the secret to his success was realizing that management had to be a selfless act. Unfortunately, most of the senior leadership has either forgotten this or never learned how to apply it. Advice to Management Change the creative leadership and do not do it from within.", "rating": 3, "pros": "Strong culture and formerly strong emphasis on developing people.", "cons": "Has transformed into the worst kind of sweatshop agency. Long, LONG hours for clients whose expectations are poorly managed. Creative leadership is ossified so that only those who \"grew up\" within CDM and within the right cliques advance at a pace commensurate with their talents and achievements. Efforts by leadership to engage with the rank and file feel contrived and phony.", "advice": "Change the creative leadership and do not do it from within."}, {"title": "Good", "text": "Pros Nice people work life balance Cons Need to raise quality of work", "rating": 5, "pros": "Nice people work life balance", "cons": "Need to raise quality of work", "advice": null}, {"title": "A great company.", "text": "Pros A great place to work. Great people and a happy environment. Cons Working in medical world can be a bit dull at times.", "rating": 5, "pros": "A great place to work. Great people and a happy environment.", "cons": "Working in medical world can be a bit dull at times.", "advice": null}, {"title": "Good", "text": "Pros People, culture, work/life balance for some Cons Compensation, learning/growth, lack of support Advice to Management Continue focusing on building employees and departments versus focusing on leadership and senior level team", "rating": 5, "pros": "People, culture, work/life balance for some", "cons": "Compensation, learning/growth, lack of support", "advice": "Continue focusing on building employees and departments versus focusing on leadership and senior level team"}, {"title": "Stuck in the 90's", "text": "Pros Classy building, prestigious name, fancy coffee machine Cons Sterile environment despite weak attempts to inspire creative culture. Shallow people typical of New Jersey dominated healthcare scene. Advice to Management did that office re-design ever happen?", "rating": 3, "pros": "Classy building, prestigious name, fancy coffee machine", "cons": "Sterile environment despite weak attempts to inspire creative culture. Shallow people typical of New Jersey dominated healthcare scene.", "advice": "did that office re-design ever happen?"}, {"title": "Don't be fooled by the veneer", "text": "Pros People are encouraged to be nice, respectful Office was generally quiet, calm at least in the old office layout before they removed the offices / cubes in lieu of \"open seating\". Cons Here's the real problem: despite making every effort to appear to be this awesome place to work, they lack the foundation to give stable employment to most \"employees\". They take on advertising projects on unpredictable timelines, without the necessary staffing, that ebb and flow greatly (recently ebbing more), creating situations for hard-working employees. They have long since tried to hire \"freelancers\" to avoid laying off employees when the work ebbs, but more recently I saw the ugly side of them willing to \"hire\" people \"full-time\" for short durations just to get short-term project needs met, followed by large layoffs. They also off-shored the entire client technology team -- so much for being a \"digitally savvy\" agency. Don't be fooled by comments that report a \"nice environment\" and \"good salaries\"...the \"jobs\" here won't last, especially the higher paying ones. And while it does last, be prepared for those situations where they pile on the work without the necessary resources, planning, etc. Advice to Management Try to make promises you can keep when you consider \"hiring\" people if you want to build a better foundation for employee trust.", "rating": 1, "pros": "People are encouraged to be nice, respectful", "cons": "Here's the real problem: despite making every effort to appear to be this awesome place to work, they lack the foundation to give stable employment to most \"employees\". They take on advertising projects on unpredictable timelines, without the necessary staffing, that ebb and flow greatly (recently ebbing more), creating situations for hard-working employees.", "advice": "Try to make promises you can keep when you consider \"hiring\" people if you want to build a better foundation for employee trust."}, {"title": "Senior Account Executive", "text": "Pros Great benefits and smart people Cons Upper management is disconnected Advice to Management NA", "rating": 3, "pros": "Great benefits and smart people", "cons": "Upper management is disconnected", "advice": "NA"}, {"title": "Great experience, but don't stay too long", "text": "Pros Great agency in terms of talent, clients, and experience. Cons Promotions are given to rarely. Lack of incentive. Advice to Management Since the turnover in this industry is so quick, you need to incentivize you're employees to stay longer than 2 years. Create more frequent, smaller rewards and promotions.", "rating": 3, "pros": "Great agency in terms of talent, clients, and experience.", "cons": "Promotions are given to rarely. Lack of incentive.", "advice": "Since the turnover in this industry is so quick, you need to incentivize you're employees to stay longer than 2 years. Create more frequent, smaller rewards and promotions."}, {"title": "Going Clear at CDM", "text": "Pros The best coffee, without a doubt. No expense spared with the multiple Jura coffee machines that are available throughout the space. Stunning photos of all of the partners adorn the walls so you'll always remember who the partners are. So considerate, and humble. Cons It was my first town hall meeting at CDM after working there for a few months as a VP in the \"creative\" department, and I was eager to hear the president speak to better understand exactly what it was I'd gotten myself into. I had been there long enough to experience first hand the inner circle and cliques of the creative directors and the air of superiority they proudly displayed to remind everyone who's not in the club, that they are in fact not in the club. On average, about 90% of the CDs at CDM had grown up in the creative department. That made for a large group of creatives who didn’t know what they didn’t know. I had witnessed first hand what happened to those who had the courage to leave on their own to try their skills at other shops. The great majority ended up crawling back home to the mother ship. The town hall was beginning. The president of CDM stepped onto a 6 foot diameter by 1 foot tall platform, which made him only about 2 inches taller than the average human. Pacing back and forth and holding the mic with what appeared to be a death grip, he touted the agency's achievements from the previous quarter, rambling on and on while throwing in some more self-congratulatory mumbo jumbo that bored me into a daydream. I found myself drifting and wondering about making better use of my talents at an agency that \"gets it\". A shop with creative leaders who weren't preoccupied with reassuring themselves of their \"leadership\" abilities by needing to refer to themselves as leaders every chance they got, as if repeating it over and over out loud somehow made it true. I wondered, if this is what it's like to belong to the Church of Scientology. Suddenly the president of CDM said something that snapped me out of my fantasy of Tom Cruise and I saving the world from an evil genius plotting to brainwash all clients everywhere to run nothing but banner ads. \"You know, it takes a special kind of person to work here at CDM. We don't just hire anybody, so you should all consider yourselves special—part of the chosen few. But, (followed by a very deliberate and long pause) if it turns out you're not one of us, we'll find you, and you won't be here for long.\" Wait just a freakin' minute here. Did he really just say that out loud to the entire CDM staff, including HR, or did I imagine it? So as nonchalantly as possible, I turned to the people on either side of me and then behind me to check for reactions from my fellow co-workers. What I saw, scared the hell out of me. There were no reactions. None at all, as if everything was normal. Just blank, staring-into-space, open-mouthed expressionless faces mimicking the theater audience from the infamous Apple 1984 commercial. Clearly, it was too late for my fellow Scientologists. Luckily for me though, I hadn't drank from the CDM water cooler and I slipped out of there just in time, maintaining complete control of what truly belonged to me. My substance, style, conviction and grace. Not theirs. But most of all I left with my soul, dignity and free will. Here's the deal with CDM. It's a nice place to work if you're just starting out, have no sense of purpose or you're ready to join that cult you've always dreamed of. CDM will be there, ready and willing to mold you into the exact likeness of it's very creepy self. But, if you happen to be an independent thinker who's firmly grounded in a belief system of what makes for great work based on your own proven history of success, you're going to offend, challenge (not in a good way) and make the nice, although misdirected folks over at CDM very uncomfortable. So think it over. If however you do choose to sign on that dotted line, then good luck to you. And whatever you do, don't drink the water. Advice to Management Keep on living the dream. You're an inspiration to your loyal followers.", "rating": 3, "pros": "The best coffee, without a doubt. No expense spared with the multiple Jura coffee machines that are available throughout the space. Stunning photos of all of the partners adorn the walls so you'll always remember who the partners are. So considerate, and humble.", "cons": "It was my first town hall meeting at CDM after working there for a few months as a VP in the \"creative\" department, and I was eager to hear the president speak to better understand exactly what it was I'd gotten myself into. I had been there long enough to experience first hand the inner circle and cliques of the creative directors and the air of superiority they proudly displayed to remind everyone who's not in the club, that they are in fact not in the club. On average, about 90% of the CDs at CDM had grown up in the creative department. That made for a large group of creatives who didn’t know what they didn’t know. I had witnessed first hand what happened to those who had the courage to leave on their own to try their skills at other shops. The great majority ended up crawling back home to the mother ship.", "advice": "Keep on living the dream. You're an inspiration to your loyal followers."}, {"title": "An industry stand-out", "text": "Pros Great people and very nice working environment/facilities. Cons Freelance staffing is often unpredictable", "rating": 5, "pros": "Great people and very nice working environment/facilities.", "cons": "Freelance staffing is often unpredictable", "advice": null}, {"title": "Great place,great culture", "text": "Pros Culture,, environment and the people are great! Cons Limited growth opportunities for shared services Advice to Management Think outside the traditional box when itcinesto growth and development", "rating": 5, "pros": "Culture,, environment and the people are great!", "cons": "Limited growth opportunities for shared services", "advice": "Think outside the traditional box when itcinesto growth and development"}, {"title": "Great Agency, All Around", "text": "Pros Some of the most creative and inspired people I've worked with in the industry. Each project is met with enthusiasm, and every ACD/CD will listen to any level creative. I've seen a junior level creative come up with what is now a campaign. CDM likes to promote from within, and it happens routinely. They really take care of their own. Cons Because the work is so great, the hours can reflect that. It's not super common, but I've become accustomed to at least one 12 hour day a week. More often than not, it's two.", "rating": 5, "pros": "Some of the most creative and inspired people I've worked with in the industry. Each project is met with enthusiasm, and every ACD/CD will listen to any level creative. I've seen a junior level creative come up with what is now a campaign. CDM likes to promote from within, and it happens routinely. They really take care of their own.", "cons": "Because the work is so great, the hours can reflect that. It's not super common, but I've become accustomed to at least one 12 hour day a week. More often than not, it's two.", "advice": null}, {"title": "Great place to work", "text": "Pros Great group of people to work with and very approachable senior leadership Cons Often scrambling for resources often short staffed", "rating": 5, "pros": "Great group of people to work with and very approachable senior leadership", "cons": "Often scrambling for resources often short staffed", "advice": null}, {"title": "Art Director", "text": "Pros great people free food and drink always good culture Cons cheap agency long hours low creative and recycled ideas always", "rating": 3, "pros": "great people", "cons": "cheap agency", "advice": null}, {"title": "An OK experience", "text": "Pros Large company, class atmosphere, good benefits, talented coworkers Cons Long hours and weekend work, lots of internal politics and favoritism, waves of layoffs", "rating": 3, "pros": "Large company, class atmosphere, good benefits, talented coworkers", "cons": "Long hours and weekend work, lots of internal politics and favoritism, waves of layoffs", "advice": null}, {"title": "Art Supervisor", "text": "Pros Great agency with a lot of versatile clients Cons working a lot of hours", "rating": 5, "pros": "Great agency with a lot of versatile clients", "cons": "working a lot of hours", "advice": null}, {"title": "Business Development", "text": "Pros Great people to learn from and great exposure Cons Lots of work and late nights, so if you can't handle it, don't try", "rating": 5, "pros": "Great people to learn from and great exposure", "cons": "Lots of work and late nights, so if you can't handle it, don't try", "advice": null}, {"title": "Poor leadership sunk L.A", "text": "Pros Great group of hard-working, like minded employees. Everyone jumped in and lent a hand when needed (except for upper management) Before \"leadership\" was in place, independent thinking was encouraged. Employees liked each other and were always doing things outside of work. Cons 16 hour work days at least twice a week The 2 \"leaders\" lacked confidence. they were driven by fear and each client and staffing decision they made was a reflection of this. Management had no idea how to run a 30 person office and insisted on turning to the NY office for everything. Advice to Management Find the people who thought it would be great to have 2 \"leaders\" with NO experience running an agency and have them FIRED! 30 people are out on the street because of this decision.", "rating": 1, "pros": "Great group of hard-working, like minded employees.", "cons": "16 hour work days at least twice a week", "advice": "Find the people who thought it would be great to have 2 \"leaders\" with NO experience running an agency and have them FIRED! 30 people are out on the street because of this decision."}, {"title": "The CDM Group", "text": "Pros Awesome work environment, great co-workers, room for growth in finance and other departments Cons Growth in finance department can take some time", "rating": 5, "pros": "Awesome work environment, great co-workers, room for growth in finance and other departments", "cons": "Growth in finance department can take some time", "advice": null}, {"title": "Was a great agency to work at", "text": "Pros • management made a lot of effort to foster a great culture • creative-friendly, account-driven shop Cons • some groups tended to be very clicky • work-life balance was lacking", "rating": 3, "pros": "• management made a lot of effort to foster a great culture", "cons": "• some groups tended to be very clicky", "advice": null}, {"title": "CDM Los Angeles", "text": "Pros The CDM Los Angeles office was gifted with some really talented and hard working employees that if they were ever allowed to, would excel at their work and win new business and keep clients. Cons Sadly, the upper management was never interested to be involved enough and that led the agency to it's demise.", "rating": 1, "pros": "The CDM Los Angeles office was gifted with some really talented and hard working employees that if they were ever allowed to, would excel at their work and win new business and keep clients.", "cons": "Sadly, the upper management was never interested to be involved enough and that led the agency to it's demise.", "advice": null}, {"title": "Worst work and people culture I've experienced", "text": "Pros Can't think of any pros Cons Management incompetence, driven beyond normal. Really didn't care about its employees. Bad working culture.", "rating": 1, "pros": "Can't think of any pros", "cons": "Management incompetence, driven beyond normal. Really didn't care about its employees. Bad working culture.", "advice": null}, {"title": "Had great potential. Now a struggling collective.", "text": "Pros Friendly co-workers and extremely hard-working people all around. Cons Creative leadership is nonexistent. Rough clients who demand generic work, and management does not fight for better work. No opportunities to produce award-winning work, and clients have lost faith. Morale is very low. Advice to Management Do not be scared of clients and think twice before presenting sub-par work. It will only keep hurting the agency's life and reputation.", "rating": 3, "pros": "Friendly co-workers and extremely hard-working people all around.", "cons": "Creative leadership is nonexistent. Rough clients who demand generic work, and management does not fight for better work. No opportunities to produce award-winning work, and clients have lost faith. Morale is very low.", "advice": "Do not be scared of clients and think twice before presenting sub-par work. It will only keep hurting the agency's life and reputation."}, {"title": "Good entry level job", "text": "Pros smart, motivated people, good project experience, solid entry level position with opportunity to work in a variety of project and research areas Cons limited upward mobility without masters degree, salary below average, poor communication with upper management, other than that great place to work", "rating": 3, "pros": "smart, motivated people, good project experience, solid entry level position with opportunity to work in a variety of project and research areas", "cons": "limited upward mobility without masters degree, salary below average, poor communication with upper management, other than that great place to work", "advice": null}, {"title": "Intern", "text": "Pros Great people Great CEO Great VP Food all the time Vibrant offices Cons Office politics Nit-picking Really anal management Micromanagement", "rating": 3, "pros": "Great people", "cons": "Office politics", "advice": null}, {"title": "Pretty good", "text": "Pros Great computer system. Flexible. Managers treat their people well. Cons A lot of people don't know how to use their computer system. Advice to Management Train new hires. Sink or swim environment hurts everyone. Don't market to your employees, they are professional marketers and see through the manipulation.", "rating": 5, "pros": "Great computer system. Flexible. Managers treat their people well.", "cons": "A lot of people don't know how to use their computer system.", "advice": "Train new hires. Sink or swim environment hurts everyone. Don't market to your employees, they are professional marketers and see through the manipulation."}, {"title": "Work Environment", "text": "Pros Convenient location to shopping and very well stocked pantry. Offices are cool and have a creative vibe Cons Phony and clueless upper management. Micro managers with no ability to manage clients and their unrealistic expectations. Advice to Management Pay attention to an average loss of 2+ employees per week. Provide a work environment that allows a true work/life balance. Empower middle management to manage client relationships", "rating": 1, "pros": "Convenient location to shopping and very well stocked pantry. Offices are cool and have a creative vibe", "cons": "Phony and clueless upper management. Micro managers with no ability to manage clients and their unrealistic expectations.", "advice": "Pay attention to an average loss of 2+ employees per week. Provide a work environment that allows a true work/life balance. Empower middle management to manage client relationships"}, {"title": "Growing Potential", "text": "Pros CDM invests in its people and gives them opportunities to grow/stretch. If you're willing to work hard, you will be rewarded. Cons Teams tend to be understaffed and overworked. If you're looking for work/life balance, look elsewhere. Advice to Management Avoid burning out your people and boost up your staffing efforts!", "rating": 3, "pros": "CDM invests in its people and gives them opportunities to grow/stretch. If you're willing to work hard, you will be rewarded.", "cons": "Teams tend to be understaffed and overworked. If you're looking for work/life balance, look elsewhere.", "advice": "Avoid burning out your people and boost up your staffing efforts!"}, {"title": "VP Account Supervisor", "text": "Pros Was epic wonderful. Healthcare industry is an industry. Bearing in mind, people are not an industry, people are human beings. Cons Became rather terrible. Management de-railed. Would not consider recent times \"a healthy atmosphere.\" A bit of a bully mentality forging. Plates WAY too big for individual person. Compensation and responsibilities grossly off. Advice to Management Get back to caring for your people - that profit increase every year will continue to come naturally. People basics first and all will be well in the healthcare space, for everyone, together.", "rating": 1, "pros": "Was epic wonderful. Healthcare industry is an industry. Bearing in mind, people are not an industry, people are human beings.", "cons": "Became rather terrible. Management de-railed. Would not consider recent times \"a healthy atmosphere.\" A bit of a bully mentality forging. Plates WAY too big for individual person. Compensation and responsibilities grossly off.", "advice": "Get back to caring for your people - that profit increase every year will continue to come naturally. People basics first and all will be well in the healthcare space, for everyone, together."}, {"title": "SVP, Management Supervisor", "text": "Pros Great people, creative talent is unrivaled; left job due to reorganization. Benefits were phenomenal --was sorry to go. Hope to be able to return someday when the company regains strength. Cons Losing my job was totally unanticipated and tough. It's hard to work for the best and then find something else. All jobs since have paled in comparison. Advice to Management Focus on rebuilding the organization and fine reputation you previously enjoyed. Many of us who departed would welcome an invitation to return.", "rating": 5, "pros": "Great people, creative talent is unrivaled; left job due to reorganization. Benefits were phenomenal --was sorry to go. Hope to be able to return someday when the company regains strength.", "cons": "Losing my job was totally unanticipated and tough. It's hard to work for the best and then find something else. All jobs since have paled in comparison.", "advice": "Focus on rebuilding the organization and fine reputation you previously enjoyed. Many of us who departed would welcome an invitation to return."}, {"title": "high quality standards, uncompromising clients", "text": "Pros The people at CDM are generally high-caliber professionals. Most of the LA office consists of NYC transplants, so it's a good spot for someone just coming to the West coast. As a freelancer, CDM is great because they are high-volume, and usually busy throughout the entire year, leading to longer freelance assignments. Cons Supervisors tend to be highly prescriptive in their creative feedback. If you don't want long hours, don't go there. Advice to Management Staff up so their are more folks in LA to service your West coast clients", "rating": 5, "pros": "The people at CDM are generally high-caliber professionals. Most of the LA office consists of NYC transplants, so it's a good spot for someone just coming to the West coast.", "cons": "Supervisors tend to be highly prescriptive in their creative feedback.", "advice": "Staff up so their are more folks in LA to service your West coast clients"}, {"title": "Great Place to Work", "text": "Pros Awesome team to work with. Great office environment with qualified individuals to work with. Cons none at all. everything was great. Advice to Management stay on top of things. keep equipping stag with right technology tools", "rating": 5, "pros": "Awesome team to work with. Great office environment with qualified individuals to work with.", "cons": "none at all. everything was great.", "advice": "stay on top of things. keep equipping stag with right technology tools"}, {"title": "Glory days...", "text": "Pros Free coffee. Used to be a great agency, but now past their prime. Cons Run by scary true believers which would be a good thing if they weren't so brainwashed themselves by Omnicom seminars, which they talk about like they've spoken to God. Only worried about making money for the parent company, like mid level mobsters. The creative is formulaic, and feels moth eaten. Advice to Management Retire.", "rating": 1, "pros": "Free coffee. Used to be a great agency, but now past their prime.", "cons": "Run by scary true believers which would be a good thing if they weren't so brainwashed themselves by Omnicom seminars, which they talk about like they've spoken to God. Only worried about making money for the parent company, like mid level mobsters.", "advice": "Retire."}, {"title": "Best Agency I've Worked For", "text": "Pros As a project manager, I often am tasked with not only foreseeing issues that may arise down the line, but also fixing a daily slurry of emergencies that arise. This isn't a CDM thing, it's a project management thing. My team at CDM is the only one out of 6 teams I've worked on since entering advertising that seems to understand the difficulties inherent in Project Management, and who actually listen and attempt to help when fixing a problem, rather than attempting to point fingers. It's a somewhat comfortable work environment, which is honestly rare in advertising. Cons Needs more development and UX team members. Often brands itself as a digital agency, although dev resources are scant and rarely available. Advice to Management Hire more full time, salaried dev and UX members. CDM doesn't have enough of these team members to justly label themselves a \"digital\" agency.", "rating": 5, "pros": "As a project manager, I often am tasked with not only foreseeing issues that may arise down the line, but also fixing a daily slurry of emergencies that arise. This isn't a CDM thing, it's a project management thing. My team at CDM is the only one out of 6 teams I've worked on since entering advertising that seems to understand the difficulties inherent in Project Management, and who actually listen and attempt to help when fixing a problem, rather than attempting to point fingers. It's a somewhat comfortable work environment, which is honestly rare in advertising.", "cons": "Needs more development and UX team members. Often brands itself as a digital agency, although dev resources are scant and rarely available.", "advice": "Hire more full time, salaried dev and UX members. CDM doesn't have enough of these team members to justly label themselves a \"digital\" agency."}, {"title": "Good place to work", "text": "Pros Great place to work and learn Cons Very big place - you only get to know your team and department.", "rating": 5, "pros": "Great place to work and learn", "cons": "Very big place - you only get to know your team and department.", "advice": null}, {"title": "Gold standard for pharma advertising", "text": "Pros CDM has great managers, great creative teams, and great process. They fully support their employees, so no one is overwhelmed or overworked even in the busiest of times. Cons It is a very large company, and often feels very corporate. Not as \"creative\" as other agencies, CDM is really driven by Account and client wants. Advice to Management Maintain transparency, hire more full time employees and less free-lancers, work harder to appropriately staff creative teams during busy times", "rating": 5, "pros": "CDM has great managers, great creative teams, and great process. They fully support their employees, so no one is overwhelmed or overworked even in the busiest of times.", "cons": "It is a very large company, and often feels very corporate. Not as \"creative\" as other agencies, CDM is really driven by Account and client wants.", "advice": "Maintain transparency, hire more full time employees and less free-lancers, work harder to appropriately staff creative teams during busy times"}, {"title": "Finance", "text": "Pros Great place to work. Several talented people and growth opportunity. Cons None I can think of.", "rating": 5, "pros": "Great place to work. Several talented people and growth opportunity.", "cons": "None I can think of.", "advice": null}, {"title": "You're only as good as your management team", "text": "Pros CDM held a lot of promise. There are a lot of good, talented folks there. I was eager to work with them. Cons The problem in many agencies is no one trains creatives as they enter management levels. Instead, you get creatives trying to handle situations they are illequipped to handle, creating a caustic mini-environment. Advice to Management Develop a training program for supervisory levels to teach them how to manage staff and situations. If they come in at that level, they must pass a test reviewing tactics or participate in the program immediately. Without that, you have egos clashing and crashing and running amok.", "rating": 3, "pros": "CDM held a lot of promise. There are a lot of good, talented folks there. I was eager to work with them.", "cons": "The problem in many agencies is no one trains creatives as they enter management levels. Instead, you get creatives trying to handle situations they are illequipped to handle, creating a caustic mini-environment.", "advice": "Develop a training program for supervisory levels to teach them how to manage staff and situations. If they come in at that level, they must pass a test reviewing tactics or participate in the program immediately. Without that, you have egos clashing and crashing and running amok."}, {"title": ".", "text": "Pros great place to work, great culture, good compensation Cons Nothing at all to complain about", "rating": 5, "pros": "great place to work, great culture, good compensation", "cons": "Nothing at all to complain about", "advice": null}, {"title": "Vibe President, Medical Director", "text": "Pros Stimulating environment with great creative people to work with. I would recommend this place to a friend Cons Nothing specific at all. This is the best place I have worked. I would recommend it to a friend. Advice to Management Keep up the great work and keep inspiring the creative brand development", "rating": 5, "pros": "Stimulating environment with great creative people to work with. I would recommend this place to a friend", "cons": "Nothing specific at all. This is the best place I have worked. I would recommend it to a friend.", "advice": "Keep up the great work and keep inspiring the creative brand development"}, {"title": "Art Supervisor", "text": "Pros Working with the best Creatives. Cons Can be long hours to meet client deadlines.", "rating": 5, "pros": "Working with the best Creatives.", "cons": "Can be long hours to meet client deadlines.", "advice": null}, {"title": "Wanna grow? Work here.", "text": "Pros Great culture. Supportive, brilliant, creative directors. Fewer egos than you would expect. A real appreciation for good advertising. Cons You'll work 50-70 hour weeks. Much of it is under your control (eg, volunteering to work on a pitch), but the nature of the beast will require a ton of work outside of 9-5.", "rating": 5, "pros": "Great culture. Supportive, brilliant, creative directors. Fewer egos than you would expect. A real appreciation for good advertising.", "cons": "You'll work 50-70 hour weeks. Much of it is under your control (eg, volunteering to work on a pitch), but the nature of the beast will require a ton of work outside of 9-5.", "advice": null}, {"title": "VP, Account Group Supervisor", "text": "Pros Nice office, convenient location, some friendly/nice people Cons When people mention favoritism in their reviews, LISTEN! I wish I had! There is tons of favoritism and cliques that are hard to break through among those who have been there longer than you. I felt pretty alone even though I was considered somewhat \"senior\". Very poor communication about expectations. Management (obviously) talks behind your back instead of coming to you directly with any issues. Decisions about how to deal with difficult clients are atrocious and Intuitively WRONG ! I have a very long track record in pharma and this place was full of people who didn't have a lot of common sense dealing with clients. You could work 15 hours a day and no one would care/notice. Don't come here if you have kids, you'll never see them. Advice to Management Reward your long-termers but welcome new comers as well. Be more direct with people about any brewing issues.", "rating": 1, "pros": "Nice office, convenient location, some friendly/nice people", "cons": "When people mention favoritism in their reviews, LISTEN! I wish I had! There is tons of favoritism and cliques that are hard to break through among those who have been there longer than you. I felt pretty alone even though I was considered somewhat \"senior\". Very poor communication about expectations. Management (obviously) talks behind your back instead of coming to you directly with any issues. Decisions about how to deal with difficult clients are atrocious and Intuitively WRONG ! I have a very long track record in pharma and this place was full of people who didn't have a lot of common sense dealing with clients. You could work 15 hours a day and no one would care/notice. Don't come here if you have kids, you'll never see them.", "advice": "Reward your long-termers but welcome new comers as well. Be more direct with people about any brewing issues."}, {"title": "Best place I hav eever worked", "text": "Pros I have never worked somewhere where there is a better collection of smart AND nice people. The values are really driven through the organization and people walk the talk about Substance, Style, Conviction, and Grace. Cons I honestly can't think of anything.", "rating": 5, "pros": "I have never worked somewhere where there is a better collection of smart AND nice people. The values are really driven through the organization and people walk the talk about Substance, Style, Conviction, and Grace.", "cons": "I honestly can't think of anything.", "advice": null}, {"title": "Smart people need not apply", "text": "Pros They promote studio people to creative directors. And copy editors to creative directors. (Who does that?) Lots of opportunity for untalented people. Cons You know the old adage: hire people smarter than you. Well thats not the case at CDM. if your smart, watch out! Only management can be smart. Unfortunately, they all came from the studio or editorial departments. Advice to Management Reorganize, from the top down...and attempt to hire management (creative and account) who have accomplished something with their careers.", "rating": 1, "pros": "They promote studio people to creative directors. And copy editors to creative directors. (Who does that?) Lots of opportunity for untalented people.", "cons": "You know the old adage: hire people smarter than you. Well thats not the case at CDM. if your smart, watch out! Only management can be smart. Unfortunately, they all came from the studio or editorial departments.", "advice": "Reorganize, from the top down...and attempt to hire management (creative and account) who have accomplished something with their careers."}, {"title": "Client Billing Associate", "text": "Pros -Good people to work with -Challenging -Corporate perks ( Late night meals, Car service, and Summer Fridays) Cons -Underpaid -Slow room for growth -High tunover Advice to Management Appreciate the small people in your company you never know what they can become for you.", "rating": 5, "pros": "-Good people to work with", "cons": "-Underpaid", "advice": "Appreciate the small people in your company you never know what they can become for you."}, {"title": "Wonderful place", "text": "Pros As much fun as pharma can be, great leader of the PM staff and smart people looking to bring as much advertising/marketing mentality to limitations set by federal guidelines. Great work life balance, and people eager and willing listen to new ideas from digital veterans to learn as they expand digital. You can take home the flowers at the end of the week since they get fresh ones every week. Cons Not a con, but structured approach to product and project execution per legal and FDA guidelines, not as much the wild west that you would see on a retail client. Advice to Management keep on keeping on.", "rating": 5, "pros": "As much fun as pharma can be, great leader of the PM staff and smart people looking to bring as much advertising/marketing mentality to limitations set by federal guidelines.", "cons": "Not a con, but structured approach to product and project execution per legal and FDA guidelines, not as much the wild west that you would see on a retail client.", "advice": "keep on keeping on."}, {"title": "The BEST pharma agency!", "text": "Pros Such a super talented group of people. The work speaks for itself. The agency works hard to show appreciation for employees, and provides lots of opportunities for professional growth. I'd work here again in a heartbeat! Cons It can be easy to be overlooked, since there are so many good people. If you don't speak up, you can easily get passed over for opportunities like pitches, etc. Advice to Management Keep doing what you're doing, but make sure you give everyone equal opportunities to participate in special projects.", "rating": 5, "pros": "Such a super talented group of people. The work speaks for itself. The agency works hard to show appreciation for employees, and provides lots of opportunities for professional growth. I'd work here again in a heartbeat!", "cons": "It can be easy to be overlooked, since there are so many good people. If you don't speak up, you can easily get passed over for opportunities like pitches, etc.", "advice": "Keep doing what you're doing, but make sure you give everyone equal opportunities to participate in special projects."}, {"title": "Account Supervisor", "text": "Pros Great people that were very smart. Cons Salaries were below industry average, long hours", "rating": 3, "pros": "Great people that were very smart.", "cons": "Salaries were below industry average, long hours", "advice": null}, {"title": "Great Experience", "text": "Pros Everyone is friendly and willing to help. Consistent promotion from within. Cons They do not prepare you well enough for positions you will be promoted to.", "rating": 5, "pros": "Everyone is friendly and willing to help. Consistent promotion from within.", "cons": "They do not prepare you well enough for positions you will be promoted to.", "advice": null}, {"title": "QA", "text": "Pros Great team, teamwork, pay, Desktop support, cutting edge Cons Long hours, revolving door, more long hours, little space, overlapping meetings Advice to Management Keep the loyal ones", "rating": 3, "pros": "Great team, teamwork, pay, Desktop support, cutting edge", "cons": "Long hours, revolving door, more long hours, little space, overlapping meetings", "advice": "Keep the loyal ones"}, {"title": "Salaries stink", "text": "Pros Entertaining environment, good space nice people Cons Long hours. Not so smart people Advice to Management You need to make at least $250K salary to commute to NY and work long hours. $75K is hardly enough.", "rating": 3, "pros": "Entertaining environment, good space nice people", "cons": "Long hours. Not so smart people", "advice": "You need to make at least $250K salary to commute to NY and work long hours. $75K is hardly enough."}, {"title": "Good Place to work for", "text": "Pros Good People, fun Place, energetic environment. One of the Top agencies in the town. Cons Too many shifts in the higher upper management. A lot of consolidation was going on. Advice to Management You guys started off working as a small company that acted like a big company, now that you are growing big you yet need to continue to operate like a small company to keep your employees happy.", "rating": 5, "pros": "Good People, fun Place, energetic environment. One of the Top agencies in the town.", "cons": "Too many shifts in the higher upper management. A lot of consolidation was going on.", "advice": "You guys started off working as a small company that acted like a big company, now that you are growing big you yet need to continue to operate like a small company to keep your employees happy."}, {"title": "Not bad", "text": "Pros They have a very set work process in place. I liked the people. Cons Was like working in a factory when it got busy. Advice to Management Pay your people more!", "rating": 3, "pros": "They have a very set work process in place. I liked the people.", "cons": "Was like working in a factory when it got busy.", "advice": "Pay your people more!"}, {"title": "Receptionist", "text": "Pros Great exposure to clients and all levels of company, they invest in your future, only hire people in reception they see a future in the company with. Cons Not able to explore what you want to do while in reception because it is really busy", "rating": 5, "pros": "Great exposure to clients and all levels of company, they invest in your future, only hire people in reception they see a future in the company with.", "cons": "Not able to explore what you want to do while in reception because it is really busy", "advice": null}, {"title": "Great Place to Work", "text": "Pros Great culture, friendly people, amazing work Cons They don't address managers who can't manage Advice to Management Managers shouldn't be able to only manage up. Be respectful to employees and act swiftly on those managers with bad feedback", "rating": 5, "pros": "Great culture, friendly people, amazing work", "cons": "They don't address managers who can't manage", "advice": "Managers shouldn't be able to only manage up. Be respectful to employees and act swiftly on those managers with bad feedback"}, {"title": "CDM Group", "text": "Pros Research experience on an NIH study. Cons Manager for NIH funded longitudinal study is never in the office, which was not made clear upon appointment. Micromanages remotely, and criticizes work on email blasts to whole team. Advice to Management Need to hire a research manager who is on site daily.", "rating": 3, "pros": "Research experience on an NIH study.", "cons": "Manager for NIH funded longitudinal study is never in the office, which was not made clear upon appointment. Micromanages remotely, and criticizes work on email blasts to whole team.", "advice": "Need to hire a research manager who is on site daily."}, {"title": "Account Supervisor", "text": "Pros HCP categorical knowledge Strong cross-network opportunities and diversification Theoretically process driven Cons Poor senior management and employee retention Favoritism of accounts and associated teams Lack of process Lack of growth opportunity Lack of MCM integration or analytical capabilities Advice to Management Rethink organizational structure and prioritization resources across groups. Consider bringing on new bodies with strong understanding of new technology and operational practices", "rating": 3, "pros": "HCP categorical knowledge", "cons": "Poor senior management and employee retention", "advice": "Rethink organizational structure and prioritization resources across groups. Consider bringing on new bodies with strong understanding of new technology and operational practices"}, {"title": "I don't miss it", "text": "Pros good benefits, decent offices, that's all Cons TOO MANY egos, senior mgmt plays favorites, overrun by cattiness and politics, horrible project management department, pay is not competitive", "rating": 3, "pros": "good benefits, decent offices, that's all", "cons": "TOO MANY egos, senior mgmt plays favorites, overrun by cattiness and politics, horrible project management department, pay is not competitive", "advice": null}, {"title": "Account Planning", "text": "Pros Strong process, new business machine, very smart people, amazing network. Cons No real career guidance, Omnicom controls career progress in reality, not CDM managers, a little bit too rigid, clicky and people play favorites. Advice to Management Analytics and non personal promotion need significant upgrades. Project management very spotty.", "rating": 5, "pros": "Strong process, new business machine, very smart people, amazing network.", "cons": "No real career guidance, Omnicom controls career progress in reality, not CDM managers, a little bit too rigid, clicky and people play favorites.", "advice": "Analytics and non personal promotion need significant upgrades. Project management very spotty."}, {"title": "Account Management Intern", "text": "Pros great work, brands, people, and clients Cons sometime lack work to do", "rating": 5, "pros": "great work, brands, people, and clients", "cons": "sometime lack work to do", "advice": null}, {"title": "Production", "text": "Pros Some nice people easy commute. Cons no leadership, awful on-boarding system, no process, no mentorship positions are sold to be creative fun stimulating but in fact are complete opposite. Most managers have been there for so long they have forgotten what goes on in the real world professionally .Very cliquish, cut throat..be careful!!! Folks will throw you under the bus over the stupidest work situations No one understands the meaning of good work. Way to many VP's and everyone in on the same level professionally. No such thing as work life balance here. Advice to Management Look your teams over..with a fine tooth comb find out who really are the people who work in your departments. If reviews are submitted clearly stating that most manager are not good eggs, why keep them there!! Its them who are making this place below standard.", "rating": 1, "pros": "Some nice people easy commute.", "cons": "no leadership, awful on-boarding system, no process, no mentorship positions are sold to be creative fun stimulating but in fact are complete opposite. Most managers have been there for so long they have forgotten what goes on in the real world professionally .Very cliquish, cut throat..be careful!!! Folks will throw you under the bus over the stupidest work situations No one understands the meaning of good work. Way to many VP's and everyone in on the same level professionally. No such thing as work life balance here.", "advice": "Look your teams over..with a fine tooth comb find out who really are the people who work in your departments. If reviews are submitted clearly stating that most manager are not good eggs, why keep them there!! Its them who are making this place below standard."}, {"title": "Creative", "text": "Pros Work life balance Good benefits for fulltime employees Cons Not digital at all Depressing Everyone looking for another job", "rating": 3, "pros": "Work life balance", "cons": "Not digital at all", "advice": null}, {"title": "Was good for some time", "text": "Pros Good environment, nice people to work with Cons No career growth, not appreciated by managment", "rating": 3, "pros": "Good environment, nice people to work with", "cons": "No career growth, not appreciated by managment", "advice": null}, {"title": "The best in the industry", "text": "Pros Strong performance culture based on rock solid core values and single-minded vision. Creative/client service/strategy/media/technology all matter. All levels of management held accountable for company performance and employee development. Cons It takes time to hire really great people, so positions can be open for awhile. Advice to Management Keep doing what your doing and hold everyone accountable to practice what you/they preach", "rating": 5, "pros": "Strong performance culture based on rock solid core values and single-minded vision. Creative/client service/strategy/media/technology all matter. All levels of management held accountable for company performance and employee development.", "cons": "It takes time to hire really great people, so positions can be open for awhile.", "advice": "Keep doing what your doing and hold everyone accountable to practice what you/they preach"}, {"title": "Probably best in the industry, but still has room to improve", "text": "Pros Top clients and brands, good benefits (birthday off, off between xmas and new years, 401 K match, etc), increasing focus on people and their development as well as creative Cons Slow to recruit for key positions and some of the clients are too conservative Advice to Management Don't just talk about the focus on growing people, see it through", "rating": 5, "pros": "Top clients and brands, good benefits (birthday off, off between xmas and new years, 401 K match, etc), increasing focus on people and their development as well as creative", "cons": "Slow to recruit for key positions and some of the clients are too conservative", "advice": "Don't just talk about the focus on growing people, see it through"}, {"title": "Full of talent, low on new blood", "text": "Pros Great benefits Good location Solid reputation Omnicom network gives access to training, resources etc High standards for performance Perfect on-boarding process Digital capabilities are decent for a traditional AOR Promotions Collaboration across departments Bonuses Cons Dated processes and lack of differentiation from other agencies Top heavy More mentorship programs and practices needed Too many veterans Limited development/growth opportunities Lack of self-awareness", "rating": 3, "pros": "Great benefits", "cons": "Dated processes and lack of differentiation from other agencies", "advice": null}, {"title": "Great people, Fun atmosphere, Under paid", "text": "Pros A lot of fun people are fun to work with laid back atmosphere Cons Company can be cheap and under pay employees", "rating": 5, "pros": "A lot of fun", "cons": "Company can be cheap and under pay employees", "advice": null}, {"title": "Smart people, not much nurturing", "text": "Pros Smart coworkers, nice office, summer fridays Cons Late nights, limited mentoring/supervision, lots of stress Advice to Management Nurture young employees more.", "rating": 3, "pros": "Smart coworkers, nice office, summer fridays", "cons": "Late nights, limited mentoring/supervision, lots of stress", "advice": "Nurture young employees more."}, {"title": "Great Group of People to Work With", "text": "Pros There's plenty of room to grow. Team works really well together. Benefits are good, especially the matching 401k. Cons Work-Live balance uneven, lots of late nights. Too much focus on process that caused bottlenecks in routing and making the deadlines established. Advice to Management Need to establish some flexibility on the process. Use it as a guideline and do not penalize those who work around the guidelines to meet client goals and expectations.", "rating": 5, "pros": "There's plenty of room to grow. Team works really well together. Benefits are good, especially the matching 401k.", "cons": "Work-Live balance uneven, lots of late nights. Too much focus on process that caused bottlenecks in routing and making the deadlines established.", "advice": "Need to establish some flexibility on the process. Use it as a guideline and do not penalize those who work around the guidelines to meet client goals and expectations."}, {"title": "Great NJ Agency", "text": "Pros Smart, collaborative people, always pushing for great creative work Cons getting back the focus again", "rating": 5, "pros": "Smart, collaborative people, always pushing for great creative work", "cons": "getting back the focus again", "advice": null}, {"title": "Princeton: finding our way", "text": "Pros Great talent; great clients and brands. Resilient in the face of much change over last few years. Cons Princeton Culture is under attack; new leadership focused on $ vs the great creative we were once known for. Advice to Management If you (let your young talented and creative) build it, clients (and $) will come.", "rating": 5, "pros": "Great talent; great clients and brands. Resilient in the face of much change over last few years.", "cons": "Princeton Culture is under attack; new leadership focused on $ vs the great creative we were once known for.", "advice": "If you (let your young talented and creative) build it, clients (and $) will come."}, {"title": "Great learning opportunity", "text": "Pros Great place to learn the pharma ad agency process, top to bottom. 90% of the people are very nice and fun to be around, new business pitches are fun to be a part of, and among the worker bees, there's a lot of collaboration. Cons Salary is low compared to other shops, long hours, burn-and-churn model adopted late into my career that was not good for work-life balance. Advice to Management Hard to say now that it's been a few years removed. Hopefully more creatives were hired to help balance workload.", "rating": 3, "pros": "Great place to learn the pharma ad agency process, top to bottom. 90% of the people are very nice and fun to be around, new business pitches are fun to be a part of, and among the worker bees, there's a lot of collaboration.", "cons": "Salary is low compared to other shops, long hours, burn-and-churn model adopted late into my career that was not good for work-life balance.", "advice": "Hard to say now that it's been a few years removed. Hopefully more creatives were hired to help balance workload."}, {"title": "A mixed bag of good and not-so-good", "text": "Pros One of the best things about working for CDM is the top leadership tries to enforce Substance, Style, Conviction and Grace. Those four qualities are definitely not practices by each person, including management who are there to enforce it. Another good things is matching 401(k). I was able to save a pretty good amount in my retirement fund. Another good thing is once your hired a committee (part of HR) reviews your background to make sure your salary is commensurate with your experience. Cons When I was there the President was a woman, and I feel there was more compassion and kindness that trickled down from the top. I saw a number of people get promoted so I believe career growth is most definitely possible. The medical benefits were not the best I've had, but are pretty good. The dental is better than normal, that is according to my dentist! After two years of employment you get three weeks vacation. The company closes from Christmas to after New Year's. That's an added week of vacation. They have early closings on summer Fridays. Working from home is allowed in some departments. Advice to Management Get down in the trenches sometimes and let the employees know you are there to support them and not just make money or prove how successful you can be in your job.", "rating": 3, "pros": "One of the best things about working for CDM is the top leadership tries to enforce Substance, Style, Conviction and Grace. Those four qualities are definitely not practices by each person, including management who are there to enforce it. Another good things is matching 401(k). I was able to save a pretty good amount in my retirement fund. Another good thing is once your hired a committee (part of HR) reviews your background to make sure your salary is commensurate with your experience.", "cons": "When I was there the President was a woman, and I feel there was more compassion and kindness that trickled down from the top. I saw a number of people get promoted so I believe career growth is most definitely possible. The medical benefits were not the best I've had, but are pretty good. The dental is better than normal, that is according to my dentist!", "advice": "Get down in the trenches sometimes and let the employees know you are there to support them and not just make money or prove how successful you can be in your job."}, {"title": "Creative", "text": "Pros The people are smarter here than anywhere else I've worked Cons Never stands still. Always seems to be evolving. You've for to have an appetite for that. Advice to Management Continue to make good hires like new HR and IT director", "rating": 5, "pros": "The people are smarter here than anywhere else I've worked", "cons": "Never stands still. Always seems to be evolving. You've for to have an appetite for that.", "advice": "Continue to make good hires like new HR and IT director"}, {"title": "Human Resources", "text": "Pros Great Exec team, lots of diversity in business, clients. Standout to competitors and everyone is mostly positive and focused on client and employee satisfaction Cons Lots of HR Turnover, better idea of a work/life balance, more availability to work in other locations with the exception of NJ/NJ", "rating": 5, "pros": "Great Exec team, lots of diversity in business, clients. Standout to competitors and everyone is mostly positive and focused on client and employee satisfaction", "cons": "Lots of HR Turnover, better idea of a work/life balance, more availability to work in other locations with the exception of NJ/NJ", "advice": null}, {"title": "Company on the decline, once great now struggling to figure out what's next", "text": "Pros Strong people on the ground dedicated to doing quality work and providing high customer satisfaction. Beautiful working environment for some of the staff. Recognized leader in their business category. Cons Values of the company were once guiding principles but have become hollow words. High turn-over rate of long-time staff and leaders has become mass exodus to other healthcare agencies. Frequent changes in top leadership and company direction smell of desperation and lack of confidence. Narcissistic upper management often value their own opinions to the exclusion of common sense. Disjointed communication across working groups often leads to isolation and missed opportunities. Advice to Management Go back in time a few years, take a survey of your employees and clients from that time then let that feedback guide your direction now.", "rating": 3, "pros": "Strong people on the ground dedicated to doing quality work and providing high customer satisfaction.", "cons": "Values of the company were once guiding principles but have become hollow words.", "advice": "Go back in time a few years, take a survey of your employees and clients from that time then let that feedback guide your direction now."}, {"title": "Learning and exposure to best practices", "text": "Pros Strong leadership committed to helping employes do their best work. Extremely profitable organization with good employee benefit perks -- pilates class, free fruit, birthday day off, community service day, training opportunities. Cons Once you get to a certain level, there's nowhere left to go, and no direction on how to break into the inner sanctum. Unwilligness to confront conflict and low morale among all levels of employees. Traditional creative work and clients, with limited experimentation and/or innovation.", "rating": 3, "pros": "Strong leadership committed to helping employes do their best work. Extremely profitable organization with good employee benefit perks -- pilates class, free fruit, birthday day off, community service day, training opportunities.", "cons": "Once you get to a certain level, there's nowhere left to go, and no direction on how to break into the inner sanctum. Unwilligness to confront conflict and low morale among all levels of employees. Traditional creative work and clients, with limited experimentation and/or innovation.", "advice": null}, {"title": "Good Opportunities", "text": "Pros Good opportunities to take charge of. Cons Tendency for people to become complacent and not innovative", "rating": 3, "pros": "Good opportunities to take charge of.", "cons": "Tendency for people to become complacent and not innovative", "advice": null}, {"title": "Office politics and mediocrity abound", "text": "Pros Well respected company, some of senior leadership are quite talented Cons Large amount of recent turnover - lots of top talent have left (or, more accurately, have been pushed out) and overall employee morale is very low. Mediocre people remain because of their ability to cow tow to the C-Suite with little if any substantive contribution. Senior leadership talks about the 4 values ad nauseam, however, lacks the introspection to be actually able to live these values. Advice to Management Do what you say you will and live the company values.", "rating": 1, "pros": "Well respected company, some of senior leadership are quite talented", "cons": "Large amount of recent turnover - lots of top talent have left (or, more accurately, have been pushed out) and overall employee morale is very low. Mediocre people remain because of their ability to cow tow to the C-Suite with little if any substantive contribution. Senior leadership talks about the 4 values ad nauseam, however, lacks the introspection to be actually able to live these values.", "advice": "Do what you say you will and live the company values."}, {"title": "Lots of politics", "text": "Pros Pays will compared to other companies in industry Cons Lots of politics. Can't trust managers. Fake. Preach life work balance. Then beat everyone up on utilization.", "rating": 1, "pros": "Pays will compared to other companies in industry", "cons": "Lots of politics. Can't trust managers. Fake. Preach life work balance. Then beat everyone up on utilization.", "advice": null}, {"title": "Top-heavy company buried in politics", "text": "Pros Opportunities to work on myriad brands and projects alongside young talent Cons Little to no support, particularly from the top down. HR is absent, certain departments favored over others (eg, creative and account). Lack of opportunity for career advancement despite senior leadership continuing to receive promotions and praise. Advice to Management Start appreciating and rewarding your masses before they all jump ship.", "rating": 3, "pros": "Opportunities to work on myriad brands and projects alongside young talent", "cons": "Little to no support, particularly from the top down. HR is absent, certain departments favored over others (eg, creative and account). Lack of opportunity for career advancement despite senior leadership continuing to receive promotions and praise.", "advice": "Start appreciating and rewarding your masses before they all jump ship."}, {"title": "Strong culture", "text": "Pros Great group of people who are passionate about making CDM the best agency it can be. Great work, smart people, high standards and expectations. Cons Not everyone can meet the standards that are set, and that is not a bad thing.", "rating": 5, "pros": "Great group of people who are passionate about making CDM the best agency it can be. Great work, smart people, high standards and expectations.", "cons": "Not everyone can meet the standards that are set, and that is not a bad thing.", "advice": null}, {"title": "Don't get stuck", "text": "Pros Lots of structure, very smart people at different levels, and high motivation to produce solid work. It is easy to learn and grow up to a point. Cons Mass delusion at senior management level, and too much time is spent inventing new titles/honors for themselves than recognizing employees for their valuable contributions. Very bad pay for the amount of hours you are expected to work and a general sense that employees should be thankful for working there. They ask a lot of you, especially loyalty and commitment, without offering any of it in return. Eventually, most people learn that the agency leadership doesn't care about anyone but themselves. Advice to Management Don't think so highly of yourselves and recognize the value of people who contribute.", "rating": 3, "pros": "Lots of structure, very smart people at different levels, and high motivation to produce solid work. It is easy to learn and grow up to a point.", "cons": "Mass delusion at senior management level, and too much time is spent inventing new titles/honors for themselves than recognizing employees for their valuable contributions. Very bad pay for the amount of hours you are expected to work and a general sense that employees should be thankful for working there. They ask a lot of you, especially loyalty and commitment, without offering any of it in return. Eventually, most people learn that the agency leadership doesn't care about anyone but themselves.", "advice": "Don't think so highly of yourselves and recognize the value of people who contribute."}, {"title": "Sweet people, lowest paying in the industry", "text": "Pros - The people are all sweet, easy to get along with and in all, the people you work with are the best part of the job - Everyone here is very smart and works incredibly hard - Summer Fridays, great health insurance, bagel breakfast once a month, being able to purchase the company computers at a discounted price and training courses Cons - Very buttoned up, and insanely strict on their process (mainly because this is HCP work and they have to be) - Strong culture, very much a \"Drink the Kool-Aid\" type of culture. - The workload is often crazy and time demanding (don't expect to get out of there before 8pm every night) - Creative is stale and un-original. Account often drives the creative. Not truly a \"creative\" shop. Advice to Management Be willing to take more risks, creatively, and start matching industry pay standards, especially since this is HCP work.", "rating": 3, "pros": "- The people are all sweet, easy to get along with and in all, the people you work with are the best part of the job", "cons": "- Very buttoned up, and insanely strict on their process (mainly because this is HCP work and they have to be)", "advice": "Be willing to take more risks, creatively, and start matching industry pay standards, especially since this is HCP work."}, {"title": "Company encourages employee growth through cultivating a culture of learning and new, interesting thinking.", "text": "Pros Smart people in a great environment where learning is encouraged. Leadership is concerned with providing high quality work AND is interested in staff personally. You feel that people really care about helping you build your career here. Cons Not located in NYC. Great energy, but located outside major metro area. If you don't need to be right in the city, it's hard to beat CDM Princeton. Advice to Management Keep up the great work!", "rating": 5, "pros": "Smart people in a great environment where learning is encouraged. Leadership is concerned with providing high quality work AND is interested in staff personally. You feel that people really care about helping you build your career here.", "cons": "Not located in NYC. Great energy, but located outside major metro area. If you don't need to be right in the city, it's hard to beat CDM Princeton.", "advice": "Keep up the great work!"}, {"title": "Great place to work if you aren't in Account Management", "text": "Pros Great hours and people are nice Cons Management doesn't listen to employees Advice to Management Listen to your employees and value the hard workers.", "rating": 5, "pros": "Great hours and people are nice", "cons": "Management doesn't listen to employees", "advice": "Listen to your employees and value the hard workers."}, {"title": "Great Place to work hard, be acknowledged and do good.", "text": "Pros Work (for the most part) with very smart, talented, creative, hardworking and nice people. Senior Leadership is accessible, approachable and open. Lots of opportunity for growth. The CDM Group is a growing, successful and profitable group of Agencies. Bonuses, time off between Christmas and New Years. Annual Summer and Holiday Parties. Recently most of the Agencies gave their staff new I-Pad mini's or I-Pad airs including the Shared Services teams (Finance, Facilities, HR and Business Development)!!! Internal and external training available. Free fruit (apples, oranges, bananas etc) and lots of coffee options. We also have a \"Good Works Day\", support the art program for sick kids at Children's Hospital at Montifiore with both monthly excursions of staff to go do arts and crafts with sick kids and an we coordinate an Industry wide annual fundraiser to pay for the program coordinators at Montifiore. AHA is another big cause that we support with a variety of programs, Cons As with any organizations there are things one would like to be different because of personal preferences. Every department is different. I often see people leave because they think the grass is greener somewhere else only to come back here. From my perspective this is a fabulous place to work.", "rating": 5, "pros": "Work (for the most part) with very smart, talented, creative, hardworking and nice people. Senior Leadership is accessible, approachable and open. Lots of opportunity for growth. The CDM Group is a growing, successful and profitable group of Agencies. Bonuses, time off between Christmas and New Years. Annual Summer and Holiday Parties. Recently most of the Agencies gave their staff new I-Pad mini's or I-Pad airs including the Shared Services teams (Finance, Facilities, HR and Business Development)!!! Internal and external training available. Free fruit (apples, oranges, bananas etc) and lots of coffee options. We also have a \"Good Works Day\", support the art program for sick kids at Children's Hospital at Montifiore with both monthly excursions of staff to go do arts and crafts with sick kids and an we coordinate an Industry wide annual fundraiser to pay for the program coordinators at Montifiore. AHA is another big cause that we support with a variety of programs,", "cons": "As with any organizations there are things one would like to be different because of personal preferences. Every department is different. I often see people leave because they think the grass is greener somewhere else only to come back here. From my perspective this is a fabulous place to work.", "advice": null}, {"title": "Advertising isn't a formula", "text": "Pros There are sweet people at CDM. And the fresh fruit and coffee are nice perks. Its also nice that they have a raffle to buy the computers with leases that have expired. Cons They're stuck in their ways and have a \"CDM\" ad. It's formulaic and doesn't really inspire anyone to do anything different. Its also an ad--they're too slow to push digital or hire anyone with the ability to do it. Advice to Management Get with today's culture and start hiring people that embrace it.", "rating": 3, "pros": "There are sweet people at CDM. And the fresh fruit and coffee are nice perks. Its also nice that they have a raffle to buy the computers with leases that have expired.", "cons": "They're stuck in their ways and have a \"CDM\" ad. It's formulaic and doesn't really inspire anyone to do anything different. Its also an ad--they're too slow to push digital or hire anyone with the ability to do it.", "advice": "Get with today's culture and start hiring people that embrace it."}, {"title": "Drink the Kool-Aid Kind of Place. Work hard, play hard.", "text": "Pros Great benefits, lots of parties with good food and beer. Definitely some very creative and smart people employed here. Cons Lots of rules, structure and very high expectations of its employees. Pretty competitive environment with some bureaucracy and caddy behavior along the way. Late nights are to be expected from any term spent at an agency. So be prepared to spend 50 hours+ here; or more if you are on a product launch team. Advice to Management Constant feedback is a great tool to use to help people to grow, but remember to tell your employees what they are doing well, too. Perhaps embrace individuality a bit more so people feel part of a team instead of a soldier on a battleground.", "rating": 3, "pros": "Great benefits, lots of parties with good food and beer. Definitely some very creative and smart people employed here.", "cons": "Lots of rules, structure and very high expectations of its employees. Pretty competitive environment with some bureaucracy and caddy behavior along the way. Late nights are to be expected from any term spent at an agency. So be prepared to spend 50 hours+ here; or more if you are on a product launch team.", "advice": "Constant feedback is a great tool to use to help people to grow, but remember to tell your employees what they are doing well, too. Perhaps embrace individuality a bit more so people feel part of a team instead of a soldier on a battleground."}, {"title": "not much to compare with", "text": "Pros great people, my studio manager is great to work with, understanding of personal stuff Cons HR and Finance seems to treat people like numbers", "rating": 5, "pros": "great people, my studio manager is great to work with, understanding of personal stuff", "cons": "HR and Finance seems to treat people like numbers", "advice": null}, {"title": "A great place to work and advance.", "text": "Pros Good accountability structure, good pay, plenty of time off. Cons There are no downsides. Unless you hate New York City. Advice to Management Keep up the great work!", "rating": 5, "pros": "Good accountability structure, good pay, plenty of time off.", "cons": "There are no downsides. Unless you hate New York City.", "advice": "Keep up the great work!"}, {"title": "High turnover + no work/life balance", "text": "Pros If you need experience and can't get anything else, the money isn't terrible. Cons Each person has to turn around so much work that they don't bother to get to know those around the, even one desk away. The department I was in had a 200% turnover rate in less than 2 years. If you are there 6 months, you have seniority. Because of this, no one knows how to do anything. Everyone throws each other under the bus and aggressive behavior is tolerated. Advice to Management Your best knowledge and people have already left the company because the workload and atmosphere are poor.", "rating": 1, "pros": "If you need experience and can't get anything else, the money isn't terrible.", "cons": "Each person has to turn around so much work that they don't bother to get to know those around the, even one desk away. The department I was in had a 200% turnover rate in less than 2 years. If you are there 6 months, you have seniority. Because of this, no one knows how to do anything. Everyone throws each other under the bus and aggressive behavior is tolerated.", "advice": "Your best knowledge and people have already left the company because the workload and atmosphere are poor."}, {"title": "If you love office politics, you'll love getting promoted.", "text": "Pros You'll learn to work with—and become—among the best of the best. Cons Popularity contests, in-fighting, backstabbing all become more prevalent with higher titles. Distracts from the creative process.", "rating": 5, "pros": "You'll learn to work with—and become—among the best of the best.", "cons": "Popularity contests, in-fighting, backstabbing all become more prevalent with higher titles. Distracts from the creative process.", "advice": null}, {"title": "Lousy Senior Leadership", "text": "Pros Some terrific talent in the agency. Very dedicated, very spirited. Strong creative talent. Smart brand planners and strategic thinkers. Cons 100% the senior leadership team. Fear-based culture driven by the top who are out for blood. Total micromanagers. Don't listen to anyone. People are total commodities and are cast out without regard. Advice to Management Get out of the way. Trust people for a change.", "rating": 1, "pros": "Some terrific talent in the agency. Very dedicated, very spirited. Strong creative talent. Smart brand planners and strategic thinkers.", "cons": "100% the senior leadership team. Fear-based culture driven by the top who are out for blood. Total micromanagers. Don't listen to anyone. People are total commodities and are cast out without regard.", "advice": "Get out of the way. Trust people for a change."}, {"title": "Really enjoyed the creativity, passion and culture", "text": "Pros Really enjoyed supporting all business units within CDM; positive teamwork, diverse culture and good client service Cons Sometimes I felt as those egos were getting in the way of peoples own work and set unrealistic expectations", "rating": 5, "pros": "Really enjoyed supporting all business units within CDM; positive teamwork, diverse culture and good client service", "cons": "Sometimes I felt as those egos were getting in the way of peoples own work and set unrealistic expectations", "advice": null}, {"title": "AWFUL", "text": "Pros Very free and loose environment. Not a lot of structure. Cons Very loose and free environment. not a lot of structure. Not organized. Advice to Management Implement some structure and process. Be more aware of problems and try to fix them.", "rating": 3, "pros": "Very free and loose environment. Not a lot of structure.", "cons": "Very loose and free environment. not a lot of structure. Not organized.", "advice": "Implement some structure and process. Be more aware of problems and try to fix them."}, {"title": "Overall Positive Experience", "text": "Pros Great company culture, a lot of mobility within the company, everyone is extremely friendly, motivated, and dedicated to the company. Cons There are some departments that are better to work in than others, some departments get better exposure to upper management than others. Advice to Management Keep up the good work!", "rating": 5, "pros": "Great company culture, a lot of mobility within the company, everyone is extremely friendly, motivated, and dedicated to the company.", "cons": "There are some departments that are better to work in than others, some departments get better exposure to upper management than others.", "advice": "Keep up the good work!"}, {"title": "Great company......Kinda", "text": "Pros Great culture, people and the money wasn't bad either :) as an assistant I was always paid overtime so there is opportunity for significant extra money. Cons This place has an extremely HIGH turnover rate!!!!!!!!", "rating": 5, "pros": "Great culture, people and the money wasn't bad either :) as an assistant I was always paid overtime so there is opportunity for significant extra money.", "cons": "This place has an extremely HIGH turnover rate!!!!!!!!", "advice": null}, {"title": "Giant healthcare agency", "text": "Pros organized, structured, good orientation in place. Cons Too many hacks. People who talk too much and not walk. Popularity contest. Should be more about who's more creative and better at their jobs. Advice to Management Too many cooks in the kitchen especially people with fancy, senior titles.", "rating": 3, "pros": "organized, structured, good orientation in place.", "cons": "Too many hacks. People who talk too much and not walk. Popularity contest. Should be more about who's more creative and better at their jobs.", "advice": "Too many cooks in the kitchen especially people with fancy, senior titles."}, {"title": "Fast paced with limited worklife balance.", "text": "Pros Friendly environment, with lots of leftover food and free coffee. Many talented people to interact with. Cons Limited worklife balance with little with little to no best practices or structure. Limited privacy, even when scheduling to be out of the office. Poor onboarding process. Advice to Management Keep working hard to bring in more business, but also consider investing into a growth program for all employees.", "rating": 3, "pros": "Friendly environment, with lots of leftover food and free coffee. Many talented people to interact with.", "cons": "Limited worklife balance with little with little to no best practices or structure. Limited privacy, even when scheduling to be out of the office. Poor onboarding process.", "advice": "Keep working hard to bring in more business, but also consider investing into a growth program for all employees."}, {"title": "Great until the end", "text": "Pros Very supportive of internal growth Cons Poor salary and yearly bonus Advice to Management Regain the culture previously established", "rating": 5, "pros": "Very supportive of internal growth", "cons": "Poor salary and yearly bonus", "advice": "Regain the culture previously established"}, {"title": "Flat organization, with little to no upward mobility.", "text": "Pros Everyone is very friendly, and the company seems to care a great deal about its revenue-generating employees. Cons No management direction or strategy. All departments seem disjointed, and there's no real process for getting things done quickly and effectively.", "rating": 3, "pros": "Everyone is very friendly, and the company seems to care a great deal about its revenue-generating employees.", "cons": "No management direction or strategy. All departments seem disjointed, and there's no real process for getting things done quickly and effectively.", "advice": null}, {"title": "Great way to start a career", "text": "Pros Being in an entry level position it's a learning experience in an environment that makes the learning fun and enjoyable. Cons I have only been with the company for a couple of months so it is hard to say.", "rating": 5, "pros": "Being in an entry level position it's a learning experience in an environment that makes the learning fun and enjoyable.", "cons": "I have only been with the company for a couple of months so it is hard to say.", "advice": null}, {"title": "Good company. Strong leadership", "text": "Pros High quality work for clients Cons Often too driven by the long time employees and cliques", "rating": 5, "pros": "High quality work for clients", "cons": "Often too driven by the long time employees and cliques", "advice": null}, {"title": "Great place to work", "text": "Pros Good work, good culture, good people. Very supportive atmosphere. People care about you and your career growth. Cons None that I can think of, other than that the pay seems to run a bit low compared to other places I know of. Advice to Management Keep up the good work.", "rating": 5, "pros": "Good work, good culture, good people. Very supportive atmosphere. People care about you and your career growth.", "cons": "None that I can think of, other than that the pay seems to run a bit low compared to other places I know of.", "advice": "Keep up the good work."}, {"title": "Art Director", "text": "Pros Definitely made really good friends Cons They do not promote quickly", "rating": 3, "pros": "Definitely made really good friends", "cons": "They do not promote quickly", "advice": null}, {"title": "Feels like home", "text": "Pros Highly collaborative, highly creative, highly challenging and highly rewarding. Can't imagine working anywhere else. Cons None that I can think of. Advice to Management Keep pushing to greatness.", "rating": 5, "pros": "Highly collaborative, highly creative, highly challenging and highly rewarding. Can't imagine working anywhere else.", "cons": "None that I can think of.", "advice": "Keep pushing to greatness."}, {"title": "Overall very good company", "text": "Pros Prioritizes training and in-house promotion. Lots of opportunity for career development. Cons It's advertising--short notice overtime, weekend work, can be very demanding deadline work. If the client needs it, you do it. But it pays overtime so there is opportunity for significant extra money.", "rating": 5, "pros": "Prioritizes training and in-house promotion. Lots of opportunity for career development.", "cons": "It's advertising--short notice overtime, weekend work, can be very demanding deadline work. If the client needs it, you do it. But it pays overtime so there is opportunity for significant extra money.", "advice": null}, {"title": "Flexibility, but you pay a price.", "text": "Pros Flexible, a lot of talented individuals to work with. Some really really great people. Cons Management at the top is a revolving doorr. Your reward for a job well done is more and more work. No respect for the work/life balance. If you had any criticisms, you were deemed negative. Advice to Management Realize the people that are truly great at their professions and give them the credit they deserve, in the forms of recognition, compensation, etc. you try but it just doesn't quite feel true.", "rating": 3, "pros": "Flexible, a lot of talented individuals to work with. Some really really great people.", "cons": "Management at the top is a revolving doorr. Your reward for a job well done is more and more work. No respect for the work/life balance. If you had any criticisms, you were deemed negative.", "advice": "Realize the people that are truly great at their professions and give them the credit they deserve, in the forms of recognition, compensation, etc. you try but it just doesn't quite feel true."}, {"title": "Account supervisor", "text": "Pros great company to work at- great culture Cons management has to give opportunities for junior staff Advice to Management need to grow staff more", "rating": 3, "pros": "great company to work at- great culture", "cons": "management has to give opportunities for junior staff", "advice": "need to grow staff more"}, {"title": "An great agency with even better people.", "text": "Pros CDM's values of Substance, Style, Conviction, & Grace truly emanate from the top down. Cons Sometimes the extended tenure of senior managers limits creative potential.", "rating": 5, "pros": "CDM's values of Substance, Style, Conviction, & Grace truly emanate from the top down.", "cons": "Sometimes the extended tenure of senior managers limits creative potential.", "advice": null}, {"title": "Best of the best", "text": "Pros You will work and learn from the best here. The smartest, sharpest people in the business. It is the high level of the talent that makes life different here. Cons It's not for everybody. This is no place to hang out. You will be pushed and will be asked to grow and work hard. It is fun and satisfying, but challenging. Advice to Management Keep pushing and reaching to be better.", "rating": 5, "pros": "You will work and learn from the best here. The smartest, sharpest people in the business. It is the high level of the talent that makes life different here.", "cons": "It's not for everybody. This is no place to hang out. You will be pushed and will be asked to grow and work hard. It is fun and satisfying, but challenging.", "advice": "Keep pushing and reaching to be better."}, {"title": "Shiny on the outside, tough on the inside", "text": "Pros Hard-working, smart teams - day-to-day nice people Can really learn how to do healthcare advertising right - the gold standard of expectations Big pharma clients - opportunity to learn how the big players work Very strong job processes in place, and good understanding of execution Cons Radical restructuring over the last year - no more loyalty to employees Burnout Work model: get them young & cheap, work them very hard Utilization pressure over creative considerations Forced social-fun atmosphere - Kool Aid mentality Wants desperately to be digital - not there yet Advice to Management Good luck with the new cutthroat model.", "rating": 3, "pros": "Hard-working, smart teams - day-to-day nice people", "cons": "Radical restructuring over the last year - no more loyalty to employees", "advice": "Good luck with the new cutthroat model."}, {"title": "Creative atmosphere that allows growth", "text": "Pros Great creative environment. Collaboration and teamwork are pillars. Cons Lots of long night and hours. Advice to Management Keep up the good work.", "rating": 5, "pros": "Great creative environment. Collaboration and teamwork are pillars.", "cons": "Lots of long night and hours.", "advice": "Keep up the good work."}, {"title": "Challenging and rewarding. Like sweeping for land mines.", "text": "Pros All of the agencies in the group have lots of talented people. The NYC headquarters has the strongest and most aggressive culture. Be aware of internal politics or better yet just don't get involved. In general, you get paid for performance and if you survive the first year, you're good for as many as you like Cons midtown east location makes for tough commutes from NJ and to certain client locations. Intense rivalries and internal politics distract the senior management from actually running the business. Your experience will vary greatly by department and/or the Partner above you.", "rating": 5, "pros": "All of the agencies in the group have lots of talented people. The NYC headquarters has the strongest and most aggressive culture. Be aware of internal politics or better yet just don't get involved. In general, you get paid for performance and if you survive the first year, you're good for as many as you like", "cons": "midtown east location makes for tough commutes from NJ and to certain client locations. Intense rivalries and internal politics distract the senior management from actually running the business. Your experience will vary greatly by department and/or the Partner above you.", "advice": null}, {"title": "Poor working conditions", "text": "Pros the money was about average for the skillset, most people at least pretend to be nice. the location is interesting west village nyc. not much else. Cons poor working conditions, sweat shop development, senior management expects insane amounts of productions because they know nothing about the process. Advice to Management read a book on development, developers are a valuable commodity in the NYC and you will not be able to keep or attract qualified developers with your current means.", "rating": 3, "pros": "the money was about average for the skillset, most people at least pretend to be nice. the location is interesting west village nyc. not much else.", "cons": "poor working conditions, sweat shop development, senior management expects insane amounts of productions because they know nothing about the process.", "advice": "read a book on development, developers are a valuable commodity in the NYC and you will not be able to keep or attract qualified developers with your current means."}, {"title": "A good experience but long hours.", "text": "Pros Great people. Smart, talented. Creative Partners are wonderful. They're honest. They pay reasonably well and give bonuses. Interesting accounts. Plenty of mentoring, training, and opportunities to grow. They promote people in a timely manner. They grow their staff and as a result, many people stay a long time. Cons Very long hours. No part time or flex schedules. Its all or nothing. If you have responsibilities outside the office (young children, sick relatives, etc) you will need support to make this job work, such as a spouse that has more regular hours or stays home, an au pair or daycare with extended hours, neighbors or relatives that can step in at home for you, etc. Advice to Management Consider a variety of roles and schedules.", "rating": 3, "pros": "Great people. Smart, talented. Creative Partners are wonderful. They're honest. They pay reasonably well and give bonuses. Interesting accounts. Plenty of mentoring, training, and opportunities to grow. They promote people in a timely manner. They grow their staff and as a result, many people stay a long time.", "cons": "Very long hours. No part time or flex schedules. Its all or nothing. If you have responsibilities outside the office (young children, sick relatives, etc) you will need support to make this job work, such as a spouse that has more regular hours or stays home, an au pair or daycare with extended hours, neighbors or relatives that can step in at home for you, etc.", "advice": "Consider a variety of roles and schedules."}, {"title": "A mixture of good and bad", "text": "Pros Relaxed co-workers Acceptable pay and benefits Cons Too clique-ish A big divide between management and labor Often impossible work/life balance, Burn out junior staff Too quick to make changes without thinking it out Advice to Management Take a deep breath before trying another corporate rebranding, or launching another division.", "rating": 3, "pros": "Relaxed co-workers", "cons": "Too clique-ish", "advice": "Take a deep breath before trying another corporate rebranding, or launching another division."}, {"title": "A really bad experience, it seems senior management do not have a clear plan for the employees so they can grow.", "text": "Pros The company has great benefits, it is part of a big organization, very nice offices. Its reputation is really well known within the pharma/advertising community. Cons It is a bureaucracy, the senior management is very old fashioned and they have been working there for decades -It is a very closed circle. They expect you to be liked and to gain the respect of your peers instead of communicating what is expected from you clearly. Advice to Management Guys do not waist people's time. If you hire someone make sure the person is set up for success. It looks you do not know what you are doing.", "rating": 3, "pros": "The company has great benefits, it is part of a big organization, very nice offices. Its reputation is really well known within the pharma/advertising community.", "cons": "It is a bureaucracy, the senior management is very old fashioned and they have been working there for decades -It is a very closed circle. They expect you to be liked and to gain the respect of your peers instead of communicating what is expected from you clearly.", "advice": "Guys do not waist people's time. If you hire someone make sure the person is set up for success. It looks you do not know what you are doing."}, {"title": "good company, bad mamagement", "text": "Pros nice people working there in general Cons worse senior management, has no clue Advice to Management grow up, make an effort to get to know and nourish the employees", "rating": 3, "pros": "nice people working there in general", "cons": "worse senior management, has no clue", "advice": "grow up, make an effort to get to know and nourish the employees"}, {"title": "committed to good work. A little behind the tech curve.", "text": "Pros They love their clients and have slowly over the years made their employees feel much more expendable. Too bad really. Cons Old fashioned leadership. Too much kow towing to their holding company (Omnicom). More narrow minded about lateral movement from one dept to another. Advice to Management Get up to speed tech wise. Make the creative departments more open to new talent inside the company rather than having the 'familiarity breeds contempt' attitude.", "rating": 3, "pros": "They love their clients and have slowly over the years made their employees feel much more expendable. Too bad really.", "cons": "Old fashioned leadership. Too much kow towing to their holding company (Omnicom). More narrow minded about lateral movement from one dept to another.", "advice": "Get up to speed tech wise. Make the creative departments more open to new talent inside the company rather than having the 'familiarity breeds contempt' attitude."}, {"title": "Challenging, and enormous opportunity", "text": "Pros Smart creative people. And fun. Cons Must put in the time.", "rating": 5, "pros": "Smart creative people. And fun.", "cons": "Must put in the time.", "advice": null}, {"title": "Fabulous", "text": "Pros Smart, buttoned-up people. Very strong and wonderful culture. The sky is the limit as far as what one can accomplish at this agency. There is so much opportunity to succeed. Cons We work extremely hard and sometimes work/life balance can be challenging. Advice to Management We have a terrific leadership team who has a passion for keeping this organization moving forward with the highest quality.", "rating": 5, "pros": "Smart, buttoned-up people. Very strong and wonderful culture. The sky is the limit as far as what one can accomplish at this agency. There is so much opportunity to succeed.", "cons": "We work extremely hard and sometimes work/life balance can be challenging.", "advice": "We have a terrific leadership team who has a passion for keeping this organization moving forward with the highest quality."}, {"title": "Creative Environment", "text": "Pros Very creative atmosphere, challenging clients, great co-workers Cons Long hours and frequent travel Advice to Management Increase allowance for \"working-late\" dinners", "rating": 3, "pros": "Very creative atmosphere, challenging clients, great co-workers", "cons": "Long hours and frequent travel", "advice": "Increase allowance for \"working-late\" dinners"}, {"title": "Overall good", "text": "Pros CDM is cream of the crop when it come to healthcare advertising. Company leaders constantly challenge themselves and in turn the company to be better, more creative and ahead of the game and it seems to work. The people are smart, diverse and help each other out. Cons It's getting to big and the managements stance that it's \"all about the employee\" seems to be a promise they can't follow through with anymore which may explain why so many people are leaving. Advice to Management Acknowledge teams and not individuals at the agency meetings, at an agency that large with so many teams, there are very few (if any) people who can do it alone.", "rating": 5, "pros": "CDM is cream of the crop when it come to healthcare advertising. Company leaders constantly challenge themselves and in turn the company to be better, more creative and ahead of the game and it seems to work. The people are smart, diverse and help each other out.", "cons": "It's getting to big and the managements stance that it's \"all about the employee\" seems to be a promise they can't follow through with anymore which may explain why so many people are leaving.", "advice": "Acknowledge teams and not individuals at the agency meetings, at an agency that large with so many teams, there are very few (if any) people who can do it alone."}, {"title": "A mostly great place to work (but with a few caveats)", "text": "Pros There are diverse and interesting people who work at CDM, everyone is willing if able to help each other out if needed. There seems to be a requirement for all copywriters to moonlight in a band or be a stand-up comedian. The office is a nice place to work - comfortable workstations and free fruit and coffee. Cons Some lack of direction from middle/upper management: ACD's are too bogged down on multiple brands to give needed attention sometimes. The promotion and raise process is veiled and unnecessarily difficult to navigate. No matter your performance, upper management plays favorites. If you would like to speed up your career - get ready to brown nose. Advice to Management - Make the promotion process more transparent. - Speed up the hiring process so when brands have a space open, it's quickly filled. If not other team members have to pick up the slack and feel they are being taken advantage of.", "rating": 5, "pros": "There are diverse and interesting people who work at CDM, everyone is willing if able to help each other out if needed. There seems to be a requirement for all copywriters to moonlight in a band or be a stand-up comedian.", "cons": "Some lack of direction from middle/upper management: ACD's are too bogged down on multiple brands to give needed attention sometimes.", "advice": "- Make the promotion process more transparent."}, {"title": "Sharp Agency, at the top of their game", "text": "Pros - Sharp Agency, at the top of their game - Great experience learning to work as a team on each project (each with their element of expertise) - Well compensated - Terrific addition to your resume for the future - They are top-tier, so it reflects very well on your career too Cons - Large team, so timing issues do arise (late hours sometimes) - some 'design by committee' issues, as more people do get involved Advice to Management They're a good group, so be sure to make an effort so senior management knows the value of your contribution.", "rating": 5, "pros": "- Sharp Agency, at the top of their game", "cons": "- Large team, so timing issues do arise (late hours sometimes)", "advice": "They're a good group, so be sure to make an effort so senior management knows the value of your contribution."}, {"title": "Very Nice People, Very Insane Workload", "text": "Pros Very nice people. You will learn a great deal there. Everyone is gracious. Nice team esprit, camaraderie. Cons Sweatshop. Women outnumber men about 3 to 1, and are an easy mark for exploitation. 17.9% growth in 2009, on the backs of employees. Long hours. Quality of much of junior staff leaves much to be desired in terms of talent and experience. Overly process-oriented. \"Big Brother is watching\" environment. If you sneeze the wrong way, you are criticized. Endless evaluations invariably create an adversarial atmosphere and engender conflicts. Advice to Management Don't push so hard. You are trying to grow too fast and will overextend yourself. End a culture of criticism and endless evaluation, which leads to friction. Ease up on the workload; add more bodies.", "rating": 3, "pros": "Very nice people. You will learn a great deal there. Everyone is gracious. Nice team esprit, camaraderie.", "cons": "Sweatshop. Women outnumber men about 3 to 1, and are an easy mark for exploitation. 17.9% growth in 2009, on the backs of employees. Long hours. Quality of much of junior staff leaves much to be desired in terms of talent and experience. Overly process-oriented. \"Big Brother is watching\" environment. If you sneeze the wrong way, you are criticized. Endless evaluations invariably create an adversarial atmosphere and engender conflicts.", "advice": "Don't push so hard. You are trying to grow too fast and will overextend yourself. End a culture of criticism and endless evaluation, which leads to friction. Ease up on the workload; add more bodies."}, {"title": "Not your usual ad agency.", "text": "Pros Genuine appreciation for everyone. Genuinely nice people who truly care about your progress and well-being. Cons A bit of a \"cult\" mentality. Rigid process very hard to get used to if you come from the outside. Advice to Management Management here is really great. Very transparent. They don't seclude themselves away from the rest of the people.", "rating": 5, "pros": "Genuine appreciation for everyone. Genuinely nice people who truly care about your progress and well-being.", "cons": "A bit of a \"cult\" mentality. Rigid process very hard to get used to if you come from the outside.", "advice": "Management here is really great. Very transparent. They don't seclude themselves away from the rest of the people."}, {"title": "Excellent place to work", "text": "Pros There is a great creative vibe at CDM Princeton. At first you wouldn't expect it since the agency is located in a boring corporate business park, but they've managed to make the agency very modern and creative. There are 3 partners that run CDMP along with the President, they are all great and very personable-- Particularly Gerry, who is the copy partner. He is the nicest guy and incredibly approachable. He doesn't position himself as senior management at all and even introduces himself as a \"writer\", he's just very down to earth. The biggest pro for CDMP is you get rewarded for doing a good job and it doesn't feel like you have to leave the agency to be able to grow. CDMP frequently promotes employees, I can't be sure about raises. They also encourage you to grow outside of your field if that is what you'd like to do. If you're a copywriter and want to become an account person, CDMP helps you get to where you want to be. CDMP also has a great work/life balance. There are summer Fridays, Christmas to New years off, ample amount of holidays, and office parties/get togethers. There is also a lot of great creative coming out of CDMP, they've won several awards and pitches. They are also constantly growing and pushing the limit with clients, especially digitally. And last but not least, this is the first agency I've worked at where they give out bonuses. It's a welcome change! Cons There honestly aren't many cons. The closest to a con I can think of is the seating is kind of open so if you're bothered by that, you might have a problem. Also, this is the first agency I've worked at where there is a very limited amount of creative directors and they have limited involvement with day to day functions, including face time with non-senior staff. However, I am pretty neutral to that and I see it as just a different way to run things. Advice to Management Keep up the good work! CDM is a great place to work so I guess I'd just say don't change it too much.", "rating": 5, "pros": "There is a great creative vibe at CDM Princeton. At first you wouldn't expect it since the agency is located in a boring corporate business park, but they've managed to make the agency very modern and creative.", "cons": "There honestly aren't many cons. The closest to a con I can think of is the seating is kind of open so if you're bothered by that, you might have a problem. Also, this is the first agency I've worked at where there is a very limited amount of creative directors and they have limited involvement with day to day functions, including face time with non-senior staff. However, I am pretty neutral to that and I see it as just a different way to run things.", "advice": "Keep up the good work! CDM is a great place to work so I guess I'd just say don't change it too much."}, {"title": "Great atmosphere, smart people, great work", "text": "Pros People, people, and people. They are diverse, smart, dynamic and motivated. Most of all, they are compelled to do great work and make it fun Cons Have not found any yet Advice to Management Rather than cast such a wide net at new business pitches, we should concentrate on a model more focused on the audience the potential client is relating to", "rating": 5, "pros": "People, people, and people. They are diverse, smart, dynamic and motivated. Most of all, they are compelled to do great work and make it fun", "cons": "Have not found any yet", "advice": "Rather than cast such a wide net at new business pitches, we should concentrate on a model more focused on the audience the potential client is relating to"}, {"title": "Great place to grow", "text": "Pros People really care about the work . Everyone is creative, passionate, willing to work hard. Communication is seen as important Cons too big but they are working on fixing that. lots of people are leaving lately--seem like an exodus is happening Advice to Management Work on keeping those currently employed happy and feeling valued", "rating": 5, "pros": "People really care about the work . Everyone is creative, passionate, willing to work hard.", "cons": "too big but they are working on fixing that. lots of people are leaving lately--seem like an exodus is happening", "advice": "Work on keeping those currently employed happy and feeling valued"}, {"title": "Great people and company culture", "text": "Pros No one will expect you to do any busy work just because you are interning Cons Not given enough responsibility at times Advice to Management Help the interns feel more valuable to the company", "rating": 5, "pros": "No one will expect you to do any busy work just because you are interning", "cons": "Not given enough responsibility at times", "advice": "Help the interns feel more valuable to the company"}, {"title": "So many VPs... but not a lot of leadership", "text": "Pros We did important work for some big clients, and our account teams knew our clients inside out and because of this the scope of our work most often stayed on track because the clients trusted our recommendations and our creativity. Cons The agency will take on any work, even if is not their core competency, and will keep on bringing it in without a staffing plan in place to handle it. So many at the VP level and many at the leadership skills to be at that level. Advice to Management If you are going to pitch new work, follow up a win with an appropriate staffing plan to support the work, otherwise, you will burn people out too quickly.", "rating": 3, "pros": "We did important work for some big clients, and our account teams knew our clients inside out and because of this the scope of our work most often stayed on track because the clients trusted our recommendations and our creativity.", "cons": "The agency will take on any work, even if is not their core competency, and will keep on bringing it in without a staffing plan in place to handle it.", "advice": "If you are going to pitch new work, follow up a win with an appropriate staffing plan to support the work, otherwise, you will burn people out too quickly."}, {"title": "Too big, too fast", "text": "Pros Everyone that works there is great! They are smart, hardworking individuals and fun to be around. Cons Lack of recognition and appreciation for entry and mid-level staff. There is no work-life balance. Advice to Management Stop, look, and listen to your employees and the way things are progressing at the agency. Maybe its time to get back to basics.", "rating": 3, "pros": "Everyone that works there is great! They are smart, hardworking individuals and fun to be around.", "cons": "Lack of recognition and appreciation for entry and mid-level staff. There is no work-life balance.", "advice": "Stop, look, and listen to your employees and the way things are progressing at the agency. Maybe its time to get back to basics."}, {"title": "You have to be on your toes.", "text": "Pros If your smart, you'll be surrounded by the same. Cons Crunch time can be pretty insane. Advice to Management Not much.", "rating": 5, "pros": "If your smart, you'll be surrounded by the same.", "cons": "Crunch time can be pretty insane.", "advice": "Not much."}, {"title": "Great People", "text": "Pros The people are pretty extraordinary. Smart and passionate. Cons It's not for everybody. You'll figure out pretty quickly if you're going to make it. Kind of like the Navy seals. Advice to Management Very good and long standing senior management.", "rating": 5, "pros": "The people are pretty extraordinary. Smart and passionate.", "cons": "It's not for everybody. You'll figure out pretty quickly if you're going to make it. Kind of like the Navy seals.", "advice": "Very good and long standing senior management."}, {"title": "CDM-going well so far.", "text": "Pros Great reputation, great people to learn from. Wonderful people to work with Cons Very big. Hard to start off and learn--you have to run in jumping. Advice to Management n/a", "rating": 5, "pros": "Great reputation, great people to learn from. Wonderful people to work with", "cons": "Very big. Hard to start off and learn--you have to run in jumping.", "advice": "n/a"}, {"title": "If you prefer Harvard University to Vassar or Grinnell, CDM may be for you. It's definitely sink or swim.", "text": "Pros Reputation, reputation, reputation. The quality of the creative that's produced and CDM's pitch-winning record makes it the BEST. Cons You must \"drink the Koolaide\" to work there. Depending on the account you're on, you may not have many real creative opportunities. People on \"work horse\" accounts have very little flexibility to move around. Unless you're one of the \"chosen ones\" early on you won't ever be treated well by upper management. Staff aren't rewarded for good work and happy clients, they're rewarded if they're liked personally and stand up creatively. Advice to Management Ed Wise is a terrific leader. He's revered, respected, and feared (in a good way). He seems to be an honest and direct communicator. Somehow his style doesn't always seem to trickle down.", "rating": 3, "pros": "Reputation, reputation, reputation. The quality of the creative that's produced and CDM's pitch-winning record makes it the BEST.", "cons": "You must \"drink the Koolaide\" to work there. Depending on the account you're on, you may not have many real creative opportunities. People on \"work horse\" accounts have very little flexibility to move around. Unless you're one of the \"chosen ones\" early on you won't ever be treated well by upper management. Staff aren't rewarded for good work and happy clients, they're rewarded if they're liked personally and stand up creatively.", "advice": "Ed Wise is a terrific leader. He's revered, respected, and feared (in a good way). He seems to be an honest and direct communicator. Somehow his style doesn't always seem to trickle down."}, {"title": "CDM is great but...", "text": "Pros It's such a growing company. Cons You can get lost in it's size. Advice to Management Don't give out awards to single people at the yearly meeting, rather teams.", "rating": 5, "pros": "It's such a growing company.", "cons": "You can get lost in it's size.", "advice": "Don't give out awards to single people at the yearly meeting, rather teams."}, {"title": "specialized technician", "text": "Pros Good scheduales. Nice enviroment. I like to work like technician and enjoy the technology Cons I cant grow up in this company. The bosses are a lot and disorganizer Advice to Management Be more organized and helpful with the employees. Give benefits for the employes goals", "rating": 3, "pros": "Good scheduales. Nice enviroment. I like to work like technician and enjoy the technology", "cons": "I cant grow up in this company. The bosses are a lot and disorganizer", "advice": "Be more organized and helpful with the employees. Give benefits for the employes goals"}, {"title": "OK to work", "text": "Pros some directions to work on project provided Cons low pay with minimum bonus Advice to Management increase pay", "rating": 5, "pros": "some directions to work on project provided", "cons": "low pay with minimum bonus", "advice": "increase pay"}, {"title": "Easy Work, Poor Pay", "text": "Pros Good Colleagues. Good Job Security. Straight Forward work Cons Poor Pay. No progression thru the company. Monthly Pay. Advice to Management Promote from within the company.", "rating": 3, "pros": "Good Colleagues. Good Job Security. Straight Forward work", "cons": "Poor Pay. No progression thru the company. Monthly Pay.", "advice": "Promote from within the company."}, {"title": "senior account manager", "text": "Pros Friendly good natured work environment. Managers that care about your progression. Cons Their needs to be more shared responsibility. Advice to Management Dont grow too fast and forget the value of a good culture.", "rating": 5, "pros": "Friendly good natured work environment. Managers that care about your progression.", "cons": "Their needs to be more shared responsibility.", "advice": "Dont grow too fast and forget the value of a good culture."}, {"title": "A junior person's experience at CDM", "text": "Pros Very fast-paced environment, you will learn a lot in a short amount of time. Quality of work is top-notch. Cons This was my first job out of college and while I wanted to be successful here, I found myself overloaded with very menial tasks that did not allow me to develop my talents. My team was overworked and this in turn created a hostile environment, making for a very negative experience for myself and many of my team members. I learned a lot while I was here but paid too much in terms of my spirit and happiness. Advice to Management Your junior staff probably have more to offer than you think. Allow each individual to explore their talents and grow in a more nurturing environment.", "rating": 3, "pros": "Very fast-paced environment, you will learn a lot in a short amount of time. Quality of work is top-notch.", "cons": "This was my first job out of college and while I wanted to be successful here, I found myself overloaded with very menial tasks that did not allow me to develop my talents. My team was overworked and this in turn created a hostile environment, making for a very negative experience for myself and many of my team members. I learned a lot while I was here but paid too much in terms of my spirit and happiness.", "advice": "Your junior staff probably have more to offer than you think. Allow each individual to explore their talents and grow in a more nurturing environment."}, {"title": "Senior Digital Operations", "text": "Pros Training courses offered, Summer Fridays, Great Group of people who are passionate and experts in the industry. They work hard and play hard. They win pitches due to the long hours and hard work in a group effort. Cons Promotions are not based on quality of work but your “likability” by senior staff. Not many opportunities for growth or advancement and the promotion process is simply laughable, which is why there is a huge turnover rate. Salary is below industry standard. Advice to Management Salary is not competitive by industry standard, and the promotion procedure should be tweaked to eliminate bias. Not the worse place to work, but not competive to other agenices.", "rating": 3, "pros": "Training courses offered, Summer Fridays, Great Group of people who are passionate and experts in the industry. They work hard and play hard. They win pitches due to the long hours and hard work in a group effort.", "cons": "Promotions are not based on quality of work but your “likability” by senior staff. Not many opportunities for growth or advancement and the promotion process is simply laughable, which is why there is a huge turnover rate. Salary is below industry standard.", "advice": "Salary is not competitive by industry standard, and the promotion procedure should be tweaked to eliminate bias. Not the worse place to work, but not competive to other agenices."}, {"title": "Chaotic, disorganized, catty", "text": "Pros The salary is generally competitive, and there are some friendly people. Paid-time-off is alright, but not great. Also, the company is greatly expanding. Most departments have very structured career paths. Note that each division of The CDM Group has a different culture. This review is for Entree Health. Cons There is very little management oversight and discipline at all levels within the organization. Account staff are given all of the staff/resources whereas all other groups are understaffed and overworked. In many cases, the focus is on pleasing the client rather than collaborating as a team. As such, work tends to be dumped on non-Account staff, sometimes with little notice or respect. And, when one makes an effort to accommodate last minutes requests, there is usually no gratitude for being a team player. While there are some protocols in place, they are only followed occasionally, which leads to confusion, miscommunication, etc. Also, there is a very negative, catty culture, and in many cases, the worst offenders are not chastised (and in some cases they are actually promoted). I've seen and heard of numersou employees crying because of such rude, uncalled behavior. Turnover for the organization is not surprisingly very high. Advice to Management Lead by good example. Be genuine. Create a collaborative, positive working environment.", "rating": 1, "pros": "The salary is generally competitive, and there are some friendly people. Paid-time-off is alright, but not great. Also, the company is greatly expanding. Most departments have very structured career paths. Note that each division of The CDM Group has a different culture. This review is for Entree Health.", "cons": "There is very little management oversight and discipline at all levels within the organization. Account staff are given all of the staff/resources whereas all other groups are understaffed and overworked. In many cases, the focus is on pleasing the client rather than collaborating as a team. As such, work tends to be dumped on non-Account staff, sometimes with little notice or respect. And, when one makes an effort to accommodate last minutes requests, there is usually no gratitude for being a team player. While there are some protocols in place, they are only followed occasionally, which leads to confusion, miscommunication, etc. Also, there is a very negative, catty culture, and in many cases, the worst offenders are not chastised (and in some cases they are actually promoted). I've seen and heard of numersou employees crying because of such rude, uncalled behavior. Turnover for the organization is not surprisingly very high.", "advice": "Lead by good example. Be genuine. Create a collaborative, positive working environment."}, {"title": "Great people, unpredictable hours", "text": "Pros Everyone I have met at this company has been amazing. The people want you to succeed and they are always willing to help you. All you need to do is ask. Cons Be ready to give up your social life a bit. During the week you are very lucky if you can leave even by 6pm. People are definitely stretched thin. Advice to Management Distribute work evenly, and make sure to communicate. Half the problem is that there is confusion about a job.", "rating": 3, "pros": "Everyone I have met at this company has been amazing. The people want you to succeed and they are always willing to help you. All you need to do is ask.", "cons": "Be ready to give up your social life a bit. During the week you are very lucky if you can leave even by 6pm. People are definitely stretched thin.", "advice": "Distribute work evenly, and make sure to communicate. Half the problem is that there is confusion about a job."}, {"title": "Typical Ad Agency", "text": "Pros Fun people, fun atmosphere, high level of creative. Cons Political, weak leadership, poor focus on client needs.", "rating": 3, "pros": "Fun people, fun atmosphere, high level of creative.", "cons": "Political, weak leadership, poor focus on client needs.", "advice": null}, {"title": "Substance, Style, Conviction and Grace", "text": "Pros There are no stupid people at CDM Beautiful pitch decks Haven't lost a pitch in years Cons Long hours, creative complain all the time, very structured, your first weeks are hard Advice to Management Get more involved by having 1-1 with key people. Don't hire people with no Agency Experience as SVPs", "rating": 3, "pros": "There are no stupid people at CDM", "cons": "Long hours, creative complain all the time, very structured, your first weeks are hard", "advice": "Get more involved by having 1-1 with key people. Don't hire people with no Agency Experience as SVPs"}, {"title": "Premier Healthcare communications experience", "text": "Pros professional, talented, hard working, fun, great client roster Cons Demanding, Long hours, Strong culture", "rating": 5, "pros": "professional, talented, hard working, fun, great client roster", "cons": "Demanding, Long hours, Strong culture", "advice": null}, {"title": "smart people, good creative, could be better", "text": "Pros very creative and smart people, well structured for the industry they focus on; a lot of resident experts, strong culture Cons not digitally smart enough, not committed to change aggressively enough, too much emphasis on account and not enough counter balance Advice to Management be careful how you position for the future, especially right now. change is happening faster outside than it happening inside.", "rating": 5, "pros": "very creative and smart people, well structured for the industry they focus on; a lot of resident experts, strong culture", "cons": "not digitally smart enough, not committed to change aggressively enough, too much emphasis on account and not enough counter balance", "advice": "be careful how you position for the future, especially right now. change is happening faster outside than it happening inside."}, {"title": "Missing the good old days", "text": "Pros CDM is full of bright, talented people who care about each other and their work. Teams are supportive of each other and generally wiling to do whatever it takes to do a job well. Cons Senior management is quick to respond to changes in the industry by making changes to the agencies. if there are repercussions, their response is to make another change, sometimes reversing the original decision. This pattern is destabilizing. Advice to Management Heal thyself.", "rating": 3, "pros": "CDM is full of bright, talented people who care about each other and their work. Teams are supportive of each other and generally wiling to do whatever it takes to do a job well.", "cons": "Senior management is quick to respond to changes in the industry by making changes to the agencies. if there are repercussions, their response is to make another change, sometimes reversing the original decision. This pattern is destabilizing.", "advice": "Heal thyself."}, {"title": "CDM - solid company, declining recognition for production force", "text": "Pros Smart people, technology drivers, buttoned up process Cons production force became downgraded to the point of separation - interpreted as not making a difference Advice to Management Do not stop recognizing the little people", "rating": 5, "pros": "Smart people, technology drivers, buttoned up process", "cons": "production force became downgraded to the point of separation - interpreted as not making a difference", "advice": "Do not stop recognizing the little people"}, {"title": "working at cdm", "text": "Pros A pharma ad agency that pushes for the most creative ideas. Cons Direction given my higher management is not always clear. Advice to Management Communicate more with the people in the company.", "rating": 5, "pros": "A pharma ad agency that pushes for the most creative ideas.", "cons": "Direction given my higher management is not always clear.", "advice": "Communicate more with the people in the company."}, {"title": "You will perform at a higher level than you knew you could perform. Because you have to.", "text": "Pros Very smart people. A process for everything. Managing partners are great, talented folk. Cons Easy to get lost in an enormous cast of thousands. May not appeal to those from smaller shops. Workloads can be staggering at times. Advice to Management A little humility goes a long way.", "rating": 5, "pros": "Very smart people. A process for everything. Managing partners are great, talented folk.", "cons": "Easy to get lost in an enormous cast of thousands. May not appeal to those from smaller shops. Workloads can be staggering at times.", "advice": "A little humility goes a long way."}, {"title": "great place, but there's gotta be more fun places to work", "text": "Pros CDM on your resume works like Harvard. Go anywhere after that. Cons Feels clique-y. Great people but somehow not a lot of bonding. Advice to Management Enough with the rah, rah drink the koolade. Why can't you be happy with being the best?", "rating": 3, "pros": "CDM on your resume works like Harvard. Go anywhere after that.", "cons": "Feels clique-y. Great people but somehow not a lot of bonding.", "advice": "Enough with the rah, rah drink the koolade. Why can't you be happy with being the best?"}, {"title": "Big and getting bigger", "text": "Pros Opportunity for a long career here. Some of the most senior people started at the bottom. Machine-like process means things get done. People are smart, mostly. Cons Can be inefficient. Skill set variable, and training is not always specific enough to really help people improve. Huge growth means some of the intimacy has been lost. Advice to Management Communicate more, even about things that aren't easy to say. In the absence of information, people will make things up that are worse than the truth. Figure out a way to truly leverage the power of the network.", "rating": 5, "pros": "Opportunity for a long career here. Some of the most senior people started at the bottom. Machine-like process means things get done. People are smart, mostly.", "cons": "Can be inefficient. Skill set variable, and training is not always specific enough to really help people improve. Huge growth means some of the intimacy has been lost.", "advice": "Communicate more, even about things that aren't easy to say. In the absence of information, people will make things up that are worse than the truth. Figure out a way to truly leverage the power of the network."}]