[{"title": "My favorite job I've held", "text": "Pros This is my favorite job I've had by far. The people are uniformly great and I love working with everyone. If I were to ever leave, they'd all be on my recruit list. We have a great design-first product, it has high test coverage and is built with security in mind. We're building for now and for the future. The business development team is signing big deals and meeting with pretty much every brand name healthcare company in the US. The management team is building the company the right way. What really sets the company apart for me is the small touches, where the execs show how much they care about the employees. At our holiday dinner, everyone got a hand-written note. At our most recent retreat, we all got memory books. Cons There's a noticeable lack of diversity, specifically a lack of women employees. The company has acknowledged it and everyone is working on fixing it. Advice to Management Keep it up!", "rating": 5, "pros": "This is my favorite job I've had by far. The people are uniformly great and I love working with everyone. If I were to ever leave, they'd all be on my recruit list. We have a great design-first product, it has high test coverage and is built with security in mind. We're building for now and for the future. The business development team is signing big deals and meeting with pretty much every brand name healthcare company in the US. The management team is building the company the right way. What really sets the company apart for me is the small touches, where the execs show how much they care about the employees. At our holiday dinner, everyone got a hand-written note. At our most recent retreat, we all got memory books.", "cons": "There's a noticeable lack of diversity, specifically a lack of women employees. The company has acknowledged it and everyone is working on fixing it.", "advice": "Keep it up!"}, {"title": "Great team, great product, company set up for success", "text": "Pros I'm one of the more senior people on the engineering team. I am super happy to be at Cedar. The technical team is very sharp, the problems that we are working on are interesting, and the product is having a real, positive impact on both our customers (the health care providers) and the patients that they serve. Specifics: * Tech leadership is very thoughtful and committed to long-term success of team members as well as the company. I think there's a real understanding that burning out your team members burns out your company. The focus is on being productive and collaborative, not on seeing who can stay longest in the office at night. * Very open and collegial atmosphere in the office. No politics, no cliques, no secrets. * Junior hires are supported with mentorship and career development * There's an openness to new technology without the compulsive drive to chase it. Our stack in early 2018 is Python 3 + Django + PostgreSQL on the backend and React + Redux + RxJs on the front, which provides a really solid foundation with room to explore. * A real commitment to being introspective as a team about processes, organization, and technology. We talk about what works and doesn't work in our team structure and are empowered to make changes that we decide on as a team. * Company is set up for success. There's a deep sales funnel, good product-market fit, great leadership, and substantial capital resources. There is nothing certain in the world of startups, but I like Cedar's chances. This won't always be true, but as of now no one has ever left Cedar. I think that speaks volumes about what it's like to work here. Cons A diversity of backgrounds and experiences is essential to a healthy and productive team. As of right now, we aren't as diverse a group as I would like. Fortunately, this is an issue that we are in agreement on as a team and I feel that there is a sincere effort to move in the right direction while Cedar is still small. Advice to Management Keep it up!", "rating": 5, "pros": "I'm one of the more senior people on the engineering team. I am super happy to be at Cedar. The technical team is very sharp, the problems that we are working on are interesting, and the product is having a real, positive impact on both our customers (the health care providers) and the patients that they serve.", "cons": "A diversity of backgrounds and experiences is essential to a healthy and productive team. As of right now, we aren't as diverse a group as I would like. Fortunately, this is an issue that we are in agreement on as a team and I feel that there is a sincere effort to move in the right direction while Cedar is still small.", "advice": "Keep it up!"}, {"title": "Great culture, intelligent and driven people, fantastic product", "text": "Pros The people at Cedar are extremely personable, intelligent, and motivated, resulting in a great culture and really laid back but driven work environment. Since the team is very close-knit, we get a lot of exposure nearly all aspects of the business- something that is very valuable to me. Cons I cannot think of any cons right now.", "rating": 5, "pros": "The people at Cedar are extremely personable, intelligent, and motivated, resulting in a great culture and really laid back but driven work environment.", "cons": "I cannot think of any cons right now.", "advice": null}, {"title": "Business Development", "text": "Pros I love the mission and values of Cedar. The colleagues are by far the best I have been working with throughout my career. Fixing the patient financial healthcare experience resonates well with me - as many of us I had a bad billing experience and am excited that we are fixing this. The office is in a great location and the vibe amazing. Cons Not much specifically about Cedar, more general for a start-up: You need to be self-driven and comfortable with ambiguity when considering working here. Advice to Management Keep up being as transparent as possible. It's great for everybody to review the board slides and share information openly with the team.", "rating": 5, "pros": "I love the mission and values of Cedar. The colleagues are by far the best I have been working with throughout my career. Fixing the patient financial healthcare experience resonates well with me - as many of us I had a bad billing experience and am excited that we are fixing this. The office is in a great location and the vibe amazing.", "cons": "Not much specifically about Cedar, more general for a start-up: You need to be self-driven and comfortable with ambiguity when considering working here.", "advice": "Keep up being as transparent as possible. It's great for everybody to review the board slides and share information openly with the team."}, {"title": "Great place to work with amazing opportunities", "text": "Pros - Strongest team I have ever worked with - everyone is really focused on the company vision and solving really important real-world problems, a real pleasure working with every person here - Huge opportunity for growth, both on an individual level and for the company as a whole - Very collaborative, no-ego environment - Awesome workspace in Soho with regular off-sites and team outings - Competitive compensation and benefits - Really fun bunch of people to be around with a very healthy work/life balance Cons No cons at this point! Advice to Management Continue to hold a high bar to keep this an amazing place to work as we grow", "rating": 5, "pros": "- Strongest team I have ever worked with - everyone is really focused on the company vision and solving really important real-world problems, a real pleasure working with every person here", "cons": "No cons at this point!", "advice": "Continue to hold a high bar to keep this an amazing place to work as we grow"}, {"title": "Amazing company with major opportunities for personal growth", "text": "Pros -Incredibly talented, motivated, and inspired team. I have never before felt like I was surrounded by people with so much to learn from, whether it's technical skills, people skills, or how to get the most out of my career. Brilliant co-workers eager to teach, yet always open minded to learn and discuss. -Management is focused on making sure every employee is receiving the resources and guidance they need to grow and best reach their potential. Very transparent leadership. -You can feel the direct impact your work is having on the massive industry challenge that we are solving together -Quite impressed by the great degree of care given to the experience of the users of our product and solving very real problems for them. -Fantastic office environment, location, and perks Cons -no cons at the moment Advice to Management Maintain this unique culture of positivity and personal attention as the company grows", "rating": 5, "pros": "-Incredibly talented, motivated, and inspired team. I have never before felt like I was surrounded by people with so much to learn from, whether it's technical skills, people skills, or how to get the most out of my career. Brilliant co-workers eager to teach, yet always open minded to learn and discuss.", "cons": "-no cons at the moment", "advice": "Maintain this unique culture of positivity and personal attention as the company grows"}, {"title": "Working at Cedar", "text": "Pros Strong team all-around, Opportunity to work on fixing a real world problem that affects millions of people, Competitive compensation and benefits, great working environment at the office in Soho, large growth potential for both employees and company Cons None that I can think of at the current stage.", "rating": 5, "pros": "Strong team all-around, Opportunity to work on fixing a real world problem that affects millions of people, Competitive compensation and benefits, great working environment at the office in Soho, large growth potential for both employees and company", "cons": "None that I can think of at the current stage.", "advice": null}]