[{"title": "Software Developer - Cobol", "text": "Pros very good work life balance Cons very slow pace of development", "rating": 5, "pros": "very good work life balance", "cons": "very slow pace of development", "advice": null}, {"title": "Great!", "text": "Pros Everyone is so nice! good pay! Cons Strict scheduling, not very accommodating.", "rating": 5, "pros": "Everyone is so nice! good pay!", "cons": "Strict scheduling, not very accommodating.", "advice": null}, {"title": "Review", "text": "Pros Extremely employee and customer focused Cons New staffing model can be challenging", "rating": 5, "pros": "Extremely employee and customer focused", "cons": "New staffing model can be challenging", "advice": null}, {"title": "Teller", "text": "Pros Great benefits and time off for part-time employees. Cons Their pay scale is pretty low.", "rating": 5, "pros": "Great benefits and time off for part-time employees.", "cons": "Their pay scale is pretty low.", "advice": null}, {"title": "Worked for 10+ years", "text": "Pros Smart people and good opportunity upward mobility. Good compensation. Cons Massive company. As with any massive company, you have to tolerate some bureaucracy and overhead. You'll also be worked to the bone.", "rating": 5, "pros": "Smart people and good opportunity upward mobility. Good compensation.", "cons": "Massive company. As with any massive company, you have to tolerate some bureaucracy and overhead. You'll also be worked to the bone.", "advice": null}, {"title": "Fraud Recovery Specialist II", "text": "Pros The job can be fun at time, love the people i work with and being able to learn so much. Cons Pay can be better.. upper management sucks.", "rating": 5, "pros": "The job can be fun at time, love the people i work with and being able to learn so much.", "cons": "Pay can be better.. upper management sucks.", "advice": null}, {"title": "Great always room for improvement", "text": "Pros Great work environment. Great middle management. BENEFITS OMG! Cons Lowest base pay in the industry BUT uncapped incentives. Advice to Management Pay us more base", "rating": 5, "pros": "Great work environment. Great middle management. BENEFITS OMG!", "cons": "Lowest base pay in the industry BUT uncapped incentives.", "advice": "Pay us more base"}, {"title": "Great!", "text": "Pros Great environment , Good Management, Organized, Stable Cons Mortgage Industry is always fluctuating", "rating": 5, "pros": "Great environment , Good Management, Organized, Stable", "cons": "Mortgage Industry is always fluctuating", "advice": null}, {"title": "GOOD PEOPLE, GOOD EXPERIENCE, YOU WILL LEARN SO MUCH!!", "text": "Pros Hard work always gets recognized. Amazing opportunities...you will love the benefits package and the work-life balance. Anything is possible at Chase. Moving up just requires some dedication and some MASSIVE CUSTOMER SERVICE SKILLS. They are huge on diversity, and managers have all been around for a long time...they have seen it all and will understand exactly what you are going through. Be prepared to dive in to one of the best corporate cultures there is. You will learn much more than banking. Cons YOU WILL BE THROWN IN AND THOSE WHO CAN LEARN TO SWIM WILL GROW AND PROSPER WITH THE COMPANY...pretty fast actually. THOSE WHO NEED HAND-HOLDING WILL NOT MAKE IT!! There is hardly any credit training like other banks. Do not make any excuses-your managers will see right through you. YOUR JOB IS TO READ UP ON POLICIES THAT WILL CHANGE ALL THE TIME, AND KEEP UP WITH THE COMPETITION. ALWAYS. GOOD THING IS THEY PROVIDE ALL THE RESOURCES...YOU JUST HAVE TO WANT IT AND TRY YOUR BEST! SLACKERS DO NOT GET COMPENSATED. DO NOT EXPECT TO MAKE A LOT OF MONEY IF YOU DO NOT HUSTLE. THERE ARE NO FREE PASSES. Just like any career, you have to make a profit for the company. Advice to Management Keep providing leadership training to employees.", "rating": 5, "pros": "Hard work always gets recognized. Amazing opportunities...you will love the benefits package and the work-life balance. Anything is possible at Chase. Moving up just requires some dedication and some MASSIVE CUSTOMER SERVICE SKILLS. They are huge on diversity, and managers have all been around for a long time...they have seen it all and will understand exactly what you are going through. Be prepared to dive in to one of the best corporate cultures there is. You will learn much more than banking.", "cons": "YOU WILL BE THROWN IN AND THOSE WHO CAN LEARN TO SWIM WILL GROW AND PROSPER WITH THE COMPANY...pretty fast actually. THOSE WHO NEED HAND-HOLDING WILL NOT MAKE IT!! There is hardly any credit training like other banks. Do not make any excuses-your managers will see right through you. YOUR JOB IS TO READ UP ON POLICIES THAT WILL CHANGE ALL THE TIME, AND KEEP UP WITH THE COMPETITION. ALWAYS.", "advice": "Keep providing leadership training to employees."}, {"title": "Relationship Banker", "text": "Pros Benefits, Salary, Tuition Reimbursement, Hours Cons Always changing points amounts for earning incentives Advice to Management Improve communication between employees", "rating": 5, "pros": "Benefits, Salary, Tuition Reimbursement, Hours", "cons": "Always changing points amounts for earning incentives", "advice": "Improve communication between employees"}, {"title": "Relationship Banker", "text": "Pros Great culture within the bank. Management encourages and support career growth as well as making the workplace a \"family environment\". Chase usually hires strong individuals that have career goals. Good place to develop banking skills. They focus on customer satisfaction more than anything. Cons They want you to follow a sales sheet when assisting a new customer. They do not encourage you to use your creativity or imagination to lock in on a sale or to build customer retention. Advice to Management Increase hiring standards to bring in higher caliber employees, even in non-investment related lines of business", "rating": 5, "pros": "Great culture within the bank. Management encourages and support career growth as well as making the workplace a \"family environment\". Chase usually hires strong individuals that have career goals. Good place to develop banking skills. They focus on customer satisfaction more than anything.", "cons": "They want you to follow a sales sheet when assisting a new customer. They do not encourage you to use your creativity or imagination to lock in on a sale or to build customer retention.", "advice": "Increase hiring standards to bring in higher caliber employees, even in non-investment related lines of business"}, {"title": "Banker", "text": "Pros Amazing company with lots of room to grow Cons some people next to you dont have degrees and make more than you", "rating": 5, "pros": "Amazing company with lots of room to grow", "cons": "some people next to you dont have degrees and make more than you", "advice": null}, {"title": "Awesome work place", "text": "Pros Good environment , Good fellow employees, Management seem willing to help you learn and succeed. They pay well on commission Cons Pay is just alright. I feel they can do better. Especially for their tellers since it’s a big bank and compared to other big banks they pay the least", "rating": 5, "pros": "Good environment , Good fellow employees, Management seem willing to help you learn and succeed. They pay well on commission", "cons": "Pay is just alright. I feel they can do better. Especially for their tellers since it’s a big bank and compared to other big banks they pay the least", "advice": null}, {"title": "Former Chase Bank Teller", "text": "Pros Great benefits and bonuses, as well as growth opportunities . Cons Work life balance can be non-existent at times.", "rating": 5, "pros": "Great benefits and bonuses, as well as growth opportunities .", "cons": "Work life balance can be non-existent at times.", "advice": null}, {"title": "Lead Teller-Operations Specialist", "text": "Pros Great advancement opportunity and a great work culture. Amazing benefits and good compensation. Cons Lots of pressure to perform at a high level and there's not always time to get everything done as well as you're expected. Advice to Management Provide more support for LTOS position because of the amount that's expected of them.", "rating": 5, "pros": "Great advancement opportunity and a great work culture. Amazing benefits and good compensation.", "cons": "Lots of pressure to perform at a high level and there's not always time to get everything done as well as you're expected.", "advice": "Provide more support for LTOS position because of the amount that's expected of them."}, {"title": "Good place to gain experience then move on.", "text": "Pros Great place to start an experience in banking. Not too stressful of an environment. Goals are realistic. Many locations. Cons Can easily get stuck in the same position unless you are very vocal about moving up. Closed mouths don't get feed here. Even then, upper management tend to look outside the company for new management.", "rating": 5, "pros": "Great place to start an experience in banking. Not too stressful of an environment. Goals are realistic. Many locations.", "cons": "Can easily get stuck in the same position unless you are very vocal about moving up. Closed mouths don't get feed here. Even then, upper management tend to look outside the company for new management.", "advice": null}, {"title": "AVP Small Business Banker II", "text": "Pros Great Training, Fast Pace, Great System Cons Too structured, Incentive Plan Pay-out Reduction Advice to Management Breathe a little", "rating": 5, "pros": "Great Training, Fast Pace, Great System", "cons": "Too structured, Incentive Plan Pay-out Reduction", "advice": "Breathe a little"}, {"title": "Senior Specialist I", "text": "Pros Great benefits, good pay, food and snack days Cons Political atmosphere, too strict with attendance Advice to Management be a little more understanding", "rating": 5, "pros": "Great benefits, good pay, food and snack days", "cons": "Political atmosphere, too strict with attendance", "advice": "be a little more understanding"}, {"title": "Business Analyst", "text": "Pros Good salary, benefits, enjoyed the work Cons Nothing really negative to say. Location strategy can be vexing though", "rating": 5, "pros": "Good salary, benefits, enjoyed the work", "cons": "Nothing really negative to say. Location strategy can be vexing though", "advice": null}, {"title": "Teller", "text": "Pros Meet lots of random people, and also make a lot of friends. Cons Working with people's money, and you do the same thing everyday. Advice to Management Personally I couldn't get to know anyone because I had 7 different managers in a year.", "rating": 5, "pros": "Meet lots of random people, and also make a lot of friends.", "cons": "Working with people's money, and you do the same thing everyday.", "advice": "Personally I couldn't get to know anyone because I had 7 different managers in a year."}, {"title": "Almost ten years climbing the ladder", "text": "Pros great benefits, opportunity to move up, many different positions. Many employee centric events, wellness initiatives, 401k matching, and ability to work from home Cons Difficult to negotiate pay if your entry position is low wage; possible, but hard to move higher than 10% pay increase even if there is an appropriate increase in responsibility. Advice to Management Encourage employee development as much as possible, cut unnecessary red tape, and discourage fire drills in favor of proper work distribution during normal hours", "rating": 5, "pros": "great benefits, opportunity to move up, many different positions. Many employee centric events, wellness initiatives, 401k matching, and ability to work from home", "cons": "Difficult to negotiate pay if your entry position is low wage; possible, but hard to move higher than 10% pay increase even if there is an appropriate increase in responsibility.", "advice": "Encourage employee development as much as possible, cut unnecessary red tape, and discourage fire drills in favor of proper work distribution during normal hours"}, {"title": "Relationship Banker", "text": "Pros - they will pay you - great colleagues (most of them) - good benefit options (life insurance etc.) - no call nights/late evenings Cons - questionable middle management - your success is largely a product of your location - your chances of getting to a good location are entirely dependent on how the middle management feels about you", "rating": 3, "pros": "- they will pay you", "cons": "- questionable middle management", "advice": null}, {"title": "Lead Teller Operations Supervisor", "text": "Pros Enjoyed working with my team. Manager always willing to help and available when needed. Cons Pay was not satisfying. Sometimes had to work long hours from open to close.", "rating": 5, "pros": "Enjoyed working with my team. Manager always willing to help and available when needed.", "cons": "Pay was not satisfying. Sometimes had to work long hours from open to close.", "advice": null}, {"title": "One of the better LO gigs out there in my experience (about 15 years as LO - 27 years in mortgage)", "text": "Pros Work environment is good. Most branches are good at referring. Built in opportunities from customer base. Management in San Diego are very good. Underwriting is mostly make sense. Conservative but not as bad as other big banks I’ve worked at. Cons Conservative underwriting. Too much turnover of branch personnel so constantly retraining for referrals. Bonuses are difficult to obtain. Will make good money but tough to make great money unless you come in as a big hitter with real solid business sources and negotiate your dedicated assistant/ support team. Because there are a lot of time wasting activities thrown at you. Read on. Too many operations tasks for sales. Too many internal email time wasters. Bonuses too hard to obtain and cause resentment and makes sales folks get too much into ops. (Csat bonus based on overall satisfaction not loan officer satisfaction so resentment when ops brings down marks and pull thru bonus causes many LOs -like me- to end up spending way too much time trying to decode multiple k-1s, 1065s and 1120s, running AU, researching guideline manuals, emailing internal employees like uw managers, etc about likelihood of approval, etc ). Too long onboarding. While still employed, after working there over a year, I was inexplicably removed off all systems access as if being offboarded. It took almost two weeks to get back up and running which is unacceptable for a mostly commissioned loan officer and nobody could explain why/ How it happened. Advice to Management Be a little more liberal with dedicated assistants for the right people. Continue to improve operations speed and customer service. See above under cons.", "rating": 5, "pros": "Work environment is good. Most branches are good at referring. Built in opportunities from customer base. Management in San Diego are very good. Underwriting is mostly make sense. Conservative but not as bad as other big banks I’ve worked at.", "cons": "Conservative underwriting. Too much turnover of branch personnel so constantly retraining for referrals. Bonuses are difficult to obtain. Will make good money but tough to make great money unless you come in as a big hitter with real solid business sources and negotiate your dedicated assistant/ support team. Because there are a lot of time wasting activities thrown at you. Read on. Too many operations tasks for sales. Too many internal email time wasters. Bonuses too hard to obtain and cause resentment and makes sales folks get too much into ops. (Csat bonus based on overall satisfaction not loan officer satisfaction so resentment when ops brings down marks and pull thru bonus causes many LOs -like me- to end up spending way too much time trying to decode multiple k-1s, 1065s and 1120s, running AU, researching guideline manuals, emailing internal employees like uw managers, etc about likelihood of approval, etc ). Too long onboarding. While still employed, after working there over a year, I was inexplicably removed off all systems access as if being offboarded. It took almost two weeks to get back up and running which is unacceptable for a mostly commissioned loan officer and nobody could explain why/ How it happened.", "advice": "Be a little more liberal with dedicated assistants for the right people. Continue to improve operations speed and customer service. See above under cons."}, {"title": "Accounting clerk", "text": "Pros Good benefits and closed to home. Cons No opportunity to advance. Too much politics Advice to Management None", "rating": 3, "pros": "Good benefits and closed to home.", "cons": "No opportunity to advance. Too much politics", "advice": "None"}, {"title": "Retention Advisor", "text": "Pros Benefits, Fun atmosphere, Weekly spiffs, reward and bonus structure, flexible scheduling for school students. Cons Not many Cons this was truly one of the best organizations I've ever worked. Advice to Management Great job, keep up the wonderful work", "rating": 5, "pros": "Benefits, Fun atmosphere, Weekly spiffs, reward and bonus structure, flexible scheduling for school students.", "cons": "Not many Cons this was truly one of the best organizations I've ever worked.", "advice": "Great job, keep up the wonderful work"}, {"title": "Personal Banker", "text": "Pros Steady income, if your a people person you’ll interact with a lot of different ones so that’s nice too. Cons Since I’ve been with the company they have taken away annual bonuses, quarterly incentive based on surveys. They hire people and offer them higher pay then the employees who have been with the company for years.", "rating": 3, "pros": "Steady income, if your a people person you’ll interact with a lot of different ones so that’s nice too.", "cons": "Since I’ve been with the company they have taken away annual bonuses, quarterly incentive based on surveys. They hire people and offer them higher pay then the employees who have been with the company for years.", "advice": null}, {"title": "UnderwriterIII", "text": "Pros Good salary pay and Great medical benefits Cons Long hours No overtime pay No performance based bonus or commission Advice to Management First, decide on a direction for the business model, then stick to it. Reward employees who work harder and generate more profits for the bank. Get rid of the employees who just skate by.", "rating": 5, "pros": "Good salary pay and Great medical benefits", "cons": "Long hours", "advice": "First, decide on a direction for the business model, then stick to it."}, {"title": "Good Company to have your resume but the salary can be so much better", "text": "Pros Like I had mentioned, working for CHASE will raise some eyebrows and peak some interest going forward for future job opportunities. Cons The 35k-40k base salary for a banker totally sucks since you have grind every month to make a decent salary to live off of. If you work in a high-income area with a decent amount of foot traffic, good branch partners (an FA and an RM that can close), and a BM that actually likes you, you're good but if any of these three elements are non-existent then you're in for a dogfight for PVCs (Product Value Credits which is commission you get paid for).", "rating": 5, "pros": "Like I had mentioned, working for CHASE will raise some eyebrows and peak some interest going forward for future job opportunities.", "cons": "The 35k-40k base salary for a banker totally sucks since you have grind every month to make a decent salary to live off of. If you work in a high-income area with a decent amount of foot traffic, good branch partners (an FA and an RM that can close), and a BM that actually likes you, you're good but if any of these three elements are non-existent then you're in for a dogfight for PVCs (Product Value Credits which is commission you get paid for).", "advice": null}, {"title": "Lack of available opportunity", "text": "Pros Forming customer relationships and short weekend hours Cons Teller pay is not appropriate for job requirements and there is little opportunity to advance in the company", "rating": 3, "pros": "Forming customer relationships and short weekend hours", "cons": "Teller pay is not appropriate for job requirements and there is little opportunity to advance in the company", "advice": null}, {"title": "LTOS", "text": "Pros Great work environment Tons of support from management Thoughtful of needs Benefits, paid drive time to work, paid military leave Paid maternity leave 5% 401k matching Cons low staffing Overtime, which can be a pro depending on how you look at it.", "rating": 5, "pros": "Great work environment", "cons": "low staffing", "advice": null}, {"title": "Get out what you put in..", "text": "Pros Commission structure allows you to make substantial amount on top of your base which is around the industries average. Hard work pays off Cons Corporate Structure, you really have to market your skill set to move up, or else be in the same place for a while Advice to Management Give raises and opportunities to your talented employees or lose them to someone else", "rating": 5, "pros": "Commission structure allows you to make substantial amount on top of your base which is around the industries average. Hard work pays off", "cons": "Corporate Structure, you really have to market your skill set to move up, or else be in the same place for a while", "advice": "Give raises and opportunities to your talented employees or lose them to someone else"}, {"title": "Teller", "text": "Pros Great support from Manager and Bankers Cons Desired Full time, although was only able to acquire Part time hours as a teller", "rating": 5, "pros": "Great support from Manager and Bankers", "cons": "Desired Full time, although was only able to acquire Part time hours as a teller", "advice": null}, {"title": "Don't get dipped in Blue", "text": "Pros Other employees were great, 401k match, free safe deposit box. Cons The management top to bottom. Google Morning Huddle/ 1-2-3 Drill.", "rating": 3, "pros": "Other employees were great, 401k match, free safe deposit box.", "cons": "The management top to bottom. Google Morning Huddle/ 1-2-3 Drill.", "advice": null}, {"title": "Chase", "text": "Pros Good Experience in retail banking Cons Upper management doesn't listen when good ideas aren't there own", "rating": 3, "pros": "Good Experience in retail banking", "cons": "Upper management doesn't listen when good ideas aren't there own", "advice": null}, {"title": "Senior Specialist II", "text": "Pros Good benifits, friendly co-workers and helpful Cons Lots of corporate politics and low pay", "rating": 3, "pros": "Good benifits, friendly co-workers and helpful", "cons": "Lots of corporate politics and low pay", "advice": null}, {"title": "Business Systems Analyst I", "text": "Pros Vacation package, Community Involvement, Charitable Donations Track Record. Cons Pay not up to market value, Health Benefits degredation, Damaged Reputation due to lack of proper risk controls. Too many \"Program Improvement\" methodologies implemented within short windows of time. Advice to Management Understand workflow and staff accordingly to avoid over-distribution of work or compensate employees more equitably.", "rating": 3, "pros": "Vacation package, Community Involvement, Charitable Donations Track Record.", "cons": "Pay not up to market value, Health Benefits degredation, Damaged Reputation due to lack of proper risk controls. Too many \"Program Improvement\" methodologies implemented within short windows of time.", "advice": "Understand workflow and staff accordingly to avoid over-distribution of work or compensate employees more equitably."}, {"title": "Relationship banker", "text": "Pros Decent Benefits, Good computer systems Cons High employee turnover, aggressive sales goals, micro management, low pay", "rating": 3, "pros": "Decent Benefits, Good computer systems", "cons": "High employee turnover, aggressive sales goals, micro management, low pay", "advice": null}, {"title": "Analyst", "text": "Pros Good pay. Good Vacation time. Cons Overly bureaucratic and lack of communication from senior management.", "rating": 3, "pros": "Good pay. Good Vacation time.", "cons": "Overly bureaucratic and lack of communication from senior management.", "advice": null}, {"title": "Huge company - doesn't care about branch employees", "text": "Pros Great benefits Work in your community Co-workers. Everyone I worked with were dedicated, hard working people. The people make it a good place to work. Cons No increases to a low base salary Cutting incentive pay Limited opportunity for consistent incentives in slow, low traffic branches. No upward mobility They ask branch employees to take on more and more responsibilities, and potential liability, without additional compensation. Advice to Management Put your money where your mouth is. They spend \"Employee Appreciation Week\" peppering you with emails saying how great a job you and your branch are doing. The next week they cut the incentive pay. Stop stack ranking your branches. It's demoralizing. Use common sense. I resigned effective Saturday Dec 30th. I didn't make it effective on the 31st as that was a Sunday and not a business day. My final paycheck was debited 10 vacation hours because I wasn't an employee on the 31st therefore not earning those hours. I worked worked up until the last possible minute but that doesn't mean anything.", "rating": 3, "pros": "Great benefits", "cons": "No increases to a low base salary", "advice": "Put your money where your mouth is. They spend \"Employee Appreciation Week\" peppering you with emails saying how great a job you and your branch are doing. The next week they cut the incentive pay."}, {"title": "Good Company......", "text": "Pros Offers great benefits and loves its employees and customers. Excellent work and home life benefits Cons Worst Customer Service Management team. Some of them are so two faced it is scary to trust them. They tell the team supervisors one thing and then when it gets delivered to the specialists and the specialists go back to Management, they pretend they don't know why the supervisors made the decisions meanwhile you walk in on a conversation telling the supervisors to continue to deliver that same thing that same way. Advice to Management Fire the two faced managers.", "rating": 3, "pros": "Offers great benefits and loves its employees and customers. Excellent work and home life benefits", "cons": "Worst Customer Service Management team. Some of them are so two faced it is scary to trust them. They tell the team supervisors one thing and then when it gets delivered to the specialists and the specialists go back to Management, they pretend they don't know why the supervisors made the decisions meanwhile you walk in on a conversation telling the supervisors to continue to deliver that same thing that same way.", "advice": "Fire the two faced managers."}, {"title": "Bank Teller", "text": "Pros Flexibility with a part time role Cons Horrible manager need to learn how to manage better.", "rating": 3, "pros": "Flexibility with a part time role", "cons": "Horrible manager need to learn how to manage better.", "advice": null}, {"title": "Bank Teller", "text": "Pros Great easy systems Great internal Controls Easy to Learn Cons Not enough responsibilities Very limited with what you can do (I.E. cannot open accounts, cannot do any servicing on customers accounts, etc.) VERY HARD TO IMPOSSIBLE to jump to other LOB (lines of business) Advice to Management Put more faith and loyalty to employees that have been there", "rating": 5, "pros": "Great easy systems", "cons": "Not enough responsibilities", "advice": "Put more faith and loyalty to employees that have been there"}, {"title": "Great company", "text": "Pros Great people to work with Cons Not a lot of room for growth", "rating": 5, "pros": "Great people to work with", "cons": "Not a lot of room for growth", "advice": null}, {"title": "Great experience", "text": "Pros Great hours, Great benefits, Great perks. Perks include cell phone discount, Gym memberships, and entertainment. They also have discounted JP Morgan stocks Cons Not enough hours as a part time. Uniform allowance is pretty low so you have to end up buying more ties, etc...", "rating": 5, "pros": "Great hours, Great benefits, Great perks. Perks include cell phone discount, Gym memberships, and entertainment. They also have discounted JP Morgan stocks", "cons": "Not enough hours as a part time. Uniform allowance is pretty low so you have to end up buying more ties, etc...", "advice": null}, {"title": "Top Notch", "text": "Pros Benefits & Salary ; Good environment; Work at home option. Cons Slow computers & software complications. Advice to Management Management specific training needed.", "rating": 5, "pros": "Benefits & Salary ; Good environment; Work at home option.", "cons": "Slow computers & software complications.", "advice": "Management specific training needed."}, {"title": "Great Company But...", "text": "Pros Health Benefits Incentives (employee discounts) Quarterly Bonus Cons Lower pay for position than local & national average incentives(monthly bonus) are unlimited but low depending on the area you work. Advice to Management Promote within Company, some of the best candidates are already working at Chase.", "rating": 3, "pros": "Health Benefits", "cons": "Lower pay for position than local & national average", "advice": "Promote within Company, some of the best candidates are already working at Chase."}, {"title": "Private Client Advisor", "text": "Pros Lot of opportunity to advance Multiple roles available Client facing roles are well compensated Cons Bureaucratic Micromanagement Underperforming colleagues not held accountable Advice to Management Ask for and require accountability at all levels of the firm Teach managers to manage people not processes or sales targets", "rating": 5, "pros": "Lot of opportunity to advance", "cons": "Bureaucratic", "advice": "Ask for and require accountability at all levels of the firm"}, {"title": "Great company", "text": "Pros Great money, Managable Hours, and very great customers Cons Dealing with customers problems and fearing of being robbed Advice to Management Keep molding great leaders", "rating": 5, "pros": "Great money, Managable Hours, and very great customers", "cons": "Dealing with customers problems and fearing of being robbed", "advice": "Keep molding great leaders"}, {"title": "Best of big bank culture", "text": "Pros Opportunity for growth, flexible managers, good recognition of good work, important/impactful projects (brings meaning to daily routine), adequate compensation Cons Easy to get lost in big company, old-fashioned banking culture (stricter dress code than comparable companies), complicated overhead processes, bad parking situation (at my location) Advice to Management Loosen the dress code, adapt to the culture of the incoming workforce, know what’s going on but don’t micromanage, don’t pretend issues or blockers are smaller than what they really are", "rating": 5, "pros": "Opportunity for growth, flexible managers, good recognition of good work, important/impactful projects (brings meaning to daily routine), adequate compensation", "cons": "Easy to get lost in big company, old-fashioned banking culture (stricter dress code than comparable companies), complicated overhead processes, bad parking situation (at my location)", "advice": "Loosen the dress code, adapt to the culture of the incoming workforce, know what’s going on but don’t micromanage, don’t pretend issues or blockers are smaller than what they really are"}, {"title": "Operations Specialist", "text": "Pros Good work life balance for workers Cons Layoffs to many jobs going overseas", "rating": 5, "pros": "Good work life balance for workers", "cons": "Layoffs to many jobs going overseas", "advice": null}, {"title": "Good Company to work for", "text": "Pros Hours are flexible and good coworkers Cons Not enough training. Need more", "rating": 5, "pros": "Hours are flexible and good coworkers", "cons": "Not enough training. Need more", "advice": null}, {"title": "Relationship Mgr", "text": "Pros Salary, benefits, good work environment Cons Inability to move departments w/o paycut", "rating": 5, "pros": "Salary, benefits, good work environment", "cons": "Inability to move departments w/o paycut", "advice": null}, {"title": "Teller", "text": "Pros Good for students; copious locations; turnover allows for ever-ready options for employment; comprehensive job training and onsite education for new-hires. Cons Awkward hours; actual job location potentially incongruous with initial residency; high standards for employment for what is initially only a 20 hour per week position.", "rating": 5, "pros": "Good for students; copious locations; turnover allows for ever-ready options for employment; comprehensive job training and onsite education for new-hires.", "cons": "Awkward hours; actual job location potentially incongruous with initial residency; high standards for employment for what is initially only a 20 hour per week position.", "advice": null}, {"title": "It was ok", "text": "Pros Nice office downtown. Good benefits, time off, 401k match. Training was great but very boring at times. Lots of assistance and guidance. Cons Tough to grow inside. Never given a chance for a transfer outside of my department. Big company, treated like a number.", "rating": 5, "pros": "Nice office downtown. Good benefits, time off, 401k match. Training was great but very boring at times. Lots of assistance and guidance.", "cons": "Tough to grow inside. Never given a chance for a transfer outside of my department. Big company, treated like a number.", "advice": null}, {"title": "Great Benefits, Getting Better with Time", "text": "Pros Benefits: health, life, 401k + match, legal assistance, adoption assistance, parental leave (very competitive) Flexible work arrangements Vacation policy Cons Been here for close to a decade, company is getting better and better each year.", "rating": 5, "pros": "Benefits: health, life, 401k + match, legal assistance, adoption assistance, parental leave (very competitive)", "cons": "Been here for close to a decade, company is getting better and better each year.", "advice": null}, {"title": "Lead Teller Operational Specialist", "text": "Pros Great benefits. Amazing people. Great way to meet sales goals. Cons Pay too little for the amount done as a Lead Teller", "rating": 5, "pros": "Great benefits. Amazing people. Great way to meet sales goals.", "cons": "Pay too little for the amount done as a Lead Teller", "advice": null}, {"title": "Relationship Banker", "text": "Pros Fun Environment and Ok benefits Cons They don't really care about employees", "rating": 3, "pros": "Fun Environment and Ok benefits", "cons": "They don't really care about employees", "advice": null}, {"title": "Teller", "text": "Pros Medical Dental Vision Free checks/money order Paid holidays Cons Someone spoke to HR with a problem they had or with what a few employees were having but not much was done. Seems like things got worst after that since nothing was done and the manager found out that someone told on her.", "rating": 5, "pros": "Medical", "cons": "Someone spoke to HR with a problem they had or with what a few employees were having but not much was done. Seems like things got worst after that since nothing was done and the manager found out that someone told on her.", "advice": null}, {"title": "Great benefits, hours flexible solid pay", "text": "Pros great place to start a career Cons a little competitive with other bankers Advice to Management great job, maybe work a system on who gets the next customer", "rating": 5, "pros": "great place to start a career", "cons": "a little competitive with other bankers", "advice": "great job, maybe work a system on who gets the next customer"}, {"title": "Senior Teller", "text": "Pros Great company Great benefits Great intro job to banking Cons Some customers can be overwhelming Advice to Management Keep up the good work.", "rating": 5, "pros": "Great company", "cons": "Some customers can be overwhelming", "advice": "Keep up the good work."}, {"title": "Mortgage Banker", "text": "Pros Good benefits and decent pay Cons Lack of ability to grow with company. Pay is good if you have back office support so you can close loans on time", "rating": 3, "pros": "Good benefits and decent pay", "cons": "Lack of ability to grow with company. Pay is good if you have back office support so you can close loans on time", "advice": null}, {"title": "part time teller", "text": "Pros great benefits, work with school schedule Cons inflexible with other things like internships", "rating": 5, "pros": "great benefits, work with school schedule", "cons": "inflexible with other things like internships", "advice": null}, {"title": "Its all about how you look at it", "text": "Pros Opportunity to grow within company Cons Need to know people to move up Advice to Management More development programs", "rating": 3, "pros": "Opportunity to grow within company", "cons": "Need to know people to move up", "advice": "More development programs"}, {"title": "Lead Teller Ops", "text": "Pros 401k, pension, health, vision, dental, MRA funds, flexible schedule, holidays off, three weeks of paid vacation plus sick and personal time, co works are great, career advancement. Cons The pay could be better, bankers incentive plans are always changing, the company expects more work out of employees and not matching that harder work with higher pay. Depending on branch location you could end up at a stressful busy branch or a quite boring one. If you are in sales you rather be at a busy location to make your monthly sales. You can get stuck staying past scheduled hours to audit entities such as eATMs/ATMs. Advice to Management Remember the Branch Manager sets the tone for all other employees, be mindful of how you deal with stress and keep others uplifted.", "rating": 5, "pros": "401k, pension, health, vision, dental, MRA funds, flexible schedule, holidays off, three weeks of paid vacation plus sick and personal time, co works are great, career advancement.", "cons": "The pay could be better, bankers incentive plans are always changing, the company expects more work out of employees and not matching that harder work with higher pay. Depending on branch location you could end up at a stressful busy branch or a quite boring one. If you are in sales you rather be at a busy location to make your monthly sales. You can get stuck staying past scheduled hours to audit entities such as eATMs/ATMs.", "advice": "Remember the Branch Manager sets the tone for all other employees, be mindful of how you deal with stress and keep others uplifted."}, {"title": "administrative and management support", "text": "Pros Insurance benefits & Leave absence programs are above average . Cons No home & work life balance and constant lay offs no matter how skilled you are, falsely claim to care about the customer. Advice to Management n/a", "rating": 1, "pros": "Insurance benefits & Leave absence programs are above average .", "cons": "No home & work life balance and constant lay offs no matter how skilled you are, falsely claim to care about the customer.", "advice": "n/a"}, {"title": "Chase", "text": "Pros Management was great and the pay was fairly good Cons Not very much room to move up in the company", "rating": 5, "pros": "Management was great and the pay was fairly good", "cons": "Not very much room to move up in the company", "advice": null}, {"title": "Lead teller Operation Specialist", "text": "Pros Good benefits and friendly workplace. Cons Salary is too much based on commission.", "rating": 5, "pros": "Good benefits and friendly workplace.", "cons": "Salary is too much based on commission.", "advice": null}, {"title": "Good Opportunity", "text": "Pros Promotions based on meeting quotas and daily goals Decent work evironment Cons Routine-like Employee drama can get distracting Advice to Management Managers should take care of HR-related issues before they escalate to cause a harmful/distracting work environment", "rating": 5, "pros": "Promotions based on meeting quotas and daily goals", "cons": "Routine-like", "advice": "Managers should take care of HR-related issues before they escalate to cause a harmful/distracting work environment"}, {"title": "Great Company", "text": "Pros great management and excellent staff. really makes you feel like family Cons there are weird hours and the manager doesn't give time off easily.", "rating": 5, "pros": "great management and excellent staff. really makes you feel like family", "cons": "there are weird hours and the manager doesn't give time off easily.", "advice": null}, {"title": "Teller", "text": "Pros All benefits in a part-time package! I have three weeks of paid vacation time, 80 hours of rollover sick time, 3 days of personal time, 5% 401k match and pension. Cons Limited growth unless you want to stay in retail banking. Unlimited in retail banking ie. personal banker, relationship banker - I am leaving Chase to go work for another top bank after finishing my masters degree. Chase wouldn't even give me the opportunity to interview whereas the other bank noticed the experience I bring. Advice to Management My branch manager and region manager were always 100% supportive! Anyone above your regional manager you don't hear from.", "rating": 5, "pros": "All benefits in a part-time package! I have three weeks of paid vacation time, 80 hours of rollover sick time, 3 days of personal time, 5% 401k match and pension.", "cons": "Limited growth unless you want to stay in retail banking. Unlimited in retail banking ie. personal banker, relationship banker - I am leaving Chase to go work for another top bank after finishing my masters degree. Chase wouldn't even give me the opportunity to interview whereas the other bank noticed the experience I bring.", "advice": "My branch manager and region manager were always 100% supportive! Anyone above your regional manager you don't hear from."}, {"title": "Relationship Banker", "text": "Pros Benefits are good for part-time employees. Underpaid overall compared to other institutions is the trade off. Cons AS A FEMALE, I was told by multiple managers to wear more make up, shorter hemlines, and \"try harder\". They told me that's how they'd previously reached goals, and as \"a salesperson I had to sell my self\". When I was sick, my boyfriend's manager called my manager to see if he had called out too- which is crossing the line. My relationship was in line with Chase policy because we were NOT in the same branch, there was no reason she should have been snooping. I saw people get passed up in the company for \"knowing the right person\" even though they were not qualified, and actually qualified people were passed up. I saw two people get selected for a better position, then LOSE IT because their manager made a phone call to keep them in her own branch. Turnover was insane in the company. Last but not least, the very last thing I was told was when I left the company I was that I'd have to pay back my licensing if I ever came back to Chase. Well, today- they put \"MISC DEBIT\" all over my accounts and zeroed out not just my money but the money that was my dad's and my boyfriend's since I was a joint on it. I'm spending hours on the phone with them regarding this and no one can answer any of my questions and have no notes on why they did this all of a sudden. Needless to say, this company is awful. There's more but I can't even type it all. Advice to Management Be transparent. Do not lie. Make changes when you say you will. STOP VIOLATING HR. The fear of losing my job was the only reason I didn't formally file a complaint. Management is petty and will forever keep you stagnant in the company if they don't like you. They pretend to develop you, but it's all BS to get you to do more with the same pay. At the end of the day, if you're not lucky enough to have a good manager who really cares, you will never move up.", "rating": 1, "pros": "Benefits are good for part-time employees. Underpaid overall compared to other institutions is the trade off.", "cons": "AS A FEMALE, I was told by multiple managers to wear more make up, shorter hemlines, and \"try harder\". They told me that's how they'd previously reached goals, and as \"a salesperson I had to sell my self\". When I was sick, my boyfriend's manager called my manager to see if he had called out too- which is crossing the line. My relationship was in line with Chase policy because we were NOT in the same branch, there was no reason she should have been snooping. I saw people get passed up in the company for \"knowing the right person\" even though they were not qualified, and actually qualified people were passed up. I saw two people get selected for a better position, then LOSE IT because their manager made a phone call to keep them in her own branch. Turnover was insane in the company. Last but not least, the very last thing I was told was when I left the company I was that I'd have to pay back my licensing if I ever came back to Chase. Well, today- they put \"MISC DEBIT\" all over my accounts and zeroed out not just my money but the money that was my dad's and my boyfriend's since I was a joint on it. I'm spending hours on the phone with them regarding this and no one can answer any of my questions and have no notes on why they did this all of a sudden. Needless to say, this company is awful. There's more but I can't even type it all.", "advice": "Be transparent. Do not lie. Make changes when you say you will. STOP VIOLATING HR. The fear of losing my job was the only reason I didn't formally file a complaint. Management is petty and will forever keep you stagnant in the company if they don't like you. They pretend to develop you, but it's all BS to get you to do more with the same pay. At the end of the day, if you're not lucky enough to have a good manager who really cares, you will never move up."}, {"title": "Decent Part Time Job", "text": "Pros The job was fairly easy. Cons The work environment and customers could be a bit frustrating. Advice to Management Take more advice from the employees.", "rating": 3, "pros": "The job was fairly easy.", "cons": "The work environment and customers could be a bit frustrating.", "advice": "Take more advice from the employees."}, {"title": "commission based salary", "text": "Pros Easy job, Good way to earn money Cons Hard Training, Series 6/ Series 63/ life insurance training", "rating": 5, "pros": "Easy job, Good way to earn money", "cons": "Hard Training, Series 6/ Series 63/ life insurance training", "advice": null}, {"title": "Chase", "text": "Pros Chase has some good people working in most their branches! Cons Too much technology might diminish the workforce.", "rating": 5, "pros": "Chase has some good people working in most their branches!", "cons": "Too much technology might diminish the workforce.", "advice": null}, {"title": "Good place to start", "text": "Pros Work life balance. But you can make a living working here if you don’t spend to much money, just have to change you spending habits Cons Kinda gets boring. Strict 9-5 hours and you work with the same people. Customer service is key for this job", "rating": 5, "pros": "Work life balance. But you can make a living working here if you don’t spend to much money, just have to change you spending habits", "cons": "Kinda gets boring. Strict 9-5 hours and you work with the same people. Customer service is key for this job", "advice": null}, {"title": "Great company with a total upside. A great starter job or one that is searching for something more relaxed.", "text": "Pros Flexible hours, 401k. Room to advance and they will sometimes pay for education if in the right market. Commission is a plus Cons Coworkers can gossip which is normal for this type of job. Heavily relies on how your manager treats staff. Some people can push sales", "rating": 5, "pros": "Flexible hours, 401k. Room to advance and they will sometimes pay for education if in the right market. Commission is a plus", "cons": "Coworkers can gossip which is normal for this type of job. Heavily relies on how your manager treats staff. Some people can push sales", "advice": null}, {"title": "If you are a student BEWARE", "text": "Pros paid vacation, bonuses, 3 weeks vacation awithin the same year of being hired Cons Chase hours are looooooonnnngggg. so if you are trying to be a part time student GET A NEW JOB. 9/10 your manager won't want to give you a free enough schedule to attend school. I was almost rejected from transferring because I was a student. that's how serious it is for you in this company.", "rating": 3, "pros": "paid vacation, bonuses, 3 weeks vacation awithin the same year of being hired", "cons": "Chase hours are looooooonnnngggg. so if you are trying to be a part time student GET A NEW JOB. 9/10 your manager won't want to give you a free enough schedule to attend school. I was almost rejected from transferring because I was a student. that's how serious it is for you in this company.", "advice": null}, {"title": "Chase Mortgage", "text": "Pros Stable Company, great training, good communication Cons Under market pay, continual reorgs", "rating": 3, "pros": "Stable Company, great training, good communication", "cons": "Under market pay, continual reorgs", "advice": null}, {"title": "good company", "text": "Pros work hours flexible schedule opportunities technology is updated for you to succeed Cons no movement have to wait longer to get promoted Advice to Management promote your employees from within don't hire from outside first", "rating": 5, "pros": "work hours", "cons": "no movement", "advice": "promote your employees from within don't hire from outside first"}, {"title": "great to work at", "text": "Pros time off AND GOOD TEAM Cons none MANAGEMENT IS GREAT Advice to Management none", "rating": 5, "pros": "time off AND GOOD TEAM", "cons": "none MANAGEMENT IS GREAT", "advice": "none"}, {"title": "Assistant Manager", "text": "Pros Great benefit packages and bonuses Cons The amount of hours you have to work with no over time or additional compensation Advice to Management Be prepared to put a lot of time into your job", "rating": 3, "pros": "Great benefit packages and bonuses", "cons": "The amount of hours you have to work with no over time or additional compensation", "advice": "Be prepared to put a lot of time into your job"}, {"title": "Horrible", "text": "Pros If you are an idiot manager, you will have a career here Cons Everything is a con with this company. The pay is low and they manipulate the perfprmance evaluations to justify giving you a low raise Advice to Management Quit and get a different job", "rating": 1, "pros": "If you are an idiot manager, you will have a career here", "cons": "Everything is a con with this company. The pay is low and they manipulate the perfprmance evaluations to justify giving you a low raise", "advice": "Quit and get a different job"}, {"title": "Great place to work", "text": "Pros Flexibility , work from home opportunities available Cons Health benefits are okay, they are wellness conscious so you are responsible for what you pay into you medical reimbursement acct that’s can go towards a deductible before they pay anything.", "rating": 5, "pros": "Flexibility , work from home opportunities available", "cons": "Health benefits are okay, they are wellness conscious so you are responsible for what you pay into you medical reimbursement acct that’s can go towards a deductible before they pay anything.", "advice": null}, {"title": "Relationship Banker", "text": "Pros Great Co worker, training, and able to help customer with their banking needs. To make money you have to be in a great location. Cons The only downfall about chase is the pay. I think they should raise the base pay up. They are always changing the incentive plan every year making it harder to hit pay out Advice to Management Banker work hard growing this company. If possible look at the base pay and raise it please", "rating": 3, "pros": "Great Co worker, training, and able to help customer with their banking needs. To make money you have to be in a great location.", "cons": "The only downfall about chase is the pay. I think they should raise the base pay up. They are always changing the incentive plan every year making it harder to hit pay out", "advice": "Banker work hard growing this company. If possible look at the base pay and raise it please"}, {"title": "Teller", "text": "Pros The computer system is very secure. Cons The employees are terrible. Advice to Management Don't accuse people of doing stuff without evidence.", "rating": 3, "pros": "The computer system is very secure.", "cons": "The employees are terrible.", "advice": "Don't accuse people of doing stuff without evidence."}, {"title": "underwriter", "text": "Pros One of the highest pay in the industry Cons horrible management. Upper management allow bullying and discrimination. People are cold and distant. It is not a place for team players. Working hard and doing good work don't guarantee job security. Advice to Management fire 80% of your lower level managers. They are pulling the employees back.", "rating": 3, "pros": "One of the highest pay in the industry", "cons": "horrible management. Upper management allow bullying and discrimination. People are cold and distant. It is not a place for team players. Working hard and doing good work don't guarantee job security.", "advice": "fire 80% of your lower level managers. They are pulling the employees back."}, {"title": "Good Benefits", "text": "Pros Benefits; PTO; Workload; Coworkers; Resources Cons Schedule; Customers; Salary; Overtime; Breaks", "rating": 5, "pros": "Benefits; PTO; Workload; Coworkers; Resources", "cons": "Schedule; Customers; Salary; Overtime; Breaks", "advice": null}, {"title": "Overall great starter job as a teller", "text": "Pros They are professional and do their best to prepare you for success. Great benefits and carrer opportunities Cons Not many. Just wish there were better incentives and bonuses for tellers. Advice to Management None", "rating": 5, "pros": "They are professional and do their best to prepare you for success. Great benefits and carrer opportunities", "cons": "Not many. Just wish there were better incentives and bonuses for tellers.", "advice": "None"}, {"title": "Analyst", "text": "Pros I do love everything Chase does for its employees. I love benefit package, opportunity to volunteer during work days, 4-month maternity/paternity leaves. Cons Very unfair salaries all across.", "rating": 3, "pros": "I do love everything Chase does for its employees. I love benefit package, opportunity to volunteer during work days, 4-month maternity/paternity leaves.", "cons": "Very unfair salaries all across.", "advice": null}, {"title": "Financial Advisot", "text": "Pros Unrealistic sales goals were propagated without evaluation, or method Cons Managers were unethical, and more concerned with covering up their past misdeeds. Advice to Management resign", "rating": 1, "pros": "Unrealistic sales goals were propagated without evaluation, or method", "cons": "Managers were unethical, and more concerned with covering up their past misdeeds.", "advice": "resign"}, {"title": "Discrimination is OK… -10", "text": "Pros Medical Benefits, some coworkers, food, There is more cons than pros, there is a 20 word minimum, but this company is awful and corrupt. Cons Management, favoritism, discrimination, Company does not listen to the employee, takes too much complaining to fix an issue, management tries to argue with HR, there is no resolution to any issue, parking, and work life and home life hard to balance. Advice to Management Listen to your employees, if they’re telling you that a manager is being discriminating against them listen, and stop favoritism it does not help your employees,", "rating": 1, "pros": "Medical Benefits, some coworkers, food,", "cons": "Management, favoritism, discrimination, Company does not listen to the employee, takes too much complaining to fix an issue, management tries to argue with HR, there is no resolution to any issue, parking, and work life and home life hard to balance.", "advice": "Listen to your employees, if they’re telling you that a manager is being discriminating against them listen, and stop favoritism it does not help your employees,"}, {"title": "Full Time Career", "text": "Pros -Strong Benefits Package -Great Training -Strong Reputation and Stability in Market -Fantastic Coworkers and Team Cons -Hours can get quite long - especially in retail. -Depending on work location, advancement opportunities may be limited. Advice to Management -Great experience - I was surrounded by wonderful people and learned so much during my tenure with the company.", "rating": 5, "pros": "-Strong Benefits Package", "cons": "-Hours can get quite long - especially in retail.", "advice": "-Great experience - I was surrounded by wonderful people and learned so much during my tenure with the company."}, {"title": "Analyst", "text": "Pros Good benefits, people, culture. Cons Flexibility depends on line of business, often times high stress environment, a lot of monotonous data inputting", "rating": 5, "pros": "Good benefits, people, culture.", "cons": "Flexibility depends on line of business, often times high stress environment, a lot of monotonous data inputting", "advice": null}, {"title": "Business Analyst", "text": "Pros Good Benefits and little stress Cons low salary but good health benefits", "rating": 3, "pros": "Good Benefits and little stress", "cons": "low salary but good health benefits", "advice": null}, {"title": "banker", "text": "Pros very easy to work on the computers Cons none really. They are very understanding Advice to Management none", "rating": 5, "pros": "very easy to work on the computers", "cons": "none really. They are very understanding", "advice": "none"}, {"title": "Personal Banker", "text": "Pros Chase is an amazing place to work. Management is always on top of employees to have them progress in their career. Cons I dont believe there are any cons about chase. We are a company that wants the best for our employees and customers. Advice to Management Keep working with employees and their families. One chase!", "rating": 5, "pros": "Chase is an amazing place to work. Management is always on top of employees to have them progress in their career.", "cons": "I dont believe there are any cons about chase. We are a company that wants the best for our employees and customers.", "advice": "Keep working with employees and their families. One chase!"}, {"title": "Lead Teller Operations Specialist", "text": "Pros Benefits are amazing ! Cons Work hours are the worst & not enough employees working.", "rating": 3, "pros": "Benefits are amazing !", "cons": "Work hours are the worst & not enough employees working.", "advice": null}, {"title": "Ups and downs", "text": "Pros Good benefits, decent pay. Rewards for excellence. Cons Must play the game, some rude clients. Advice to Management Try to be more genuine.", "rating": 3, "pros": "Good benefits, decent pay. Rewards for excellence.", "cons": "Must play the game, some rude clients.", "advice": "Try to be more genuine."}, {"title": "Chase has its pros and cons", "text": "Pros Management encourages mobility which is most of the time a lateral move, competitive salary, management training programs, culture, networking events Cons Most areas work long hours and weekends, communication can be challenging, mobility causes turnover which hinders areas from improving due to constantly training new hires", "rating": 3, "pros": "Management encourages mobility which is most of the time a lateral move, competitive salary, management training programs, culture, networking events", "cons": "Most areas work long hours and weekends, communication can be challenging, mobility causes turnover which hinders areas from improving due to constantly training new hires", "advice": null}, {"title": "Excellent experience working at Chase", "text": "Pros A lot of opportunities to make a career. Both in retail and behind the scenes jobs in marketing in administration is risk. Cons The financial corporate world isn’t for everyone and you need to have the right state of mind and the right personality to enjoy working here", "rating": 5, "pros": "A lot of opportunities to make a career. Both in retail and behind the scenes jobs in marketing in administration is risk.", "cons": "The financial corporate world isn’t for everyone and you need to have the right state of mind and the right personality to enjoy working here", "advice": null}, {"title": "project manager II", "text": "Pros benefits are good. vacation is very good. Cons poor career opportunities in Jacksonville", "rating": 3, "pros": "benefits are good. vacation is very good.", "cons": "poor career opportunities in Jacksonville", "advice": null}, {"title": "All depends on which branch you are in", "text": "Pros Clients are great. Some expect too much. You create your own commission. Work hard and it will pay off Cons Cutting back on bonuses as usual. All about building your book of business", "rating": 5, "pros": "Clients are great. Some expect too much. You create your own commission. Work hard and it will pay off", "cons": "Cutting back on bonuses as usual. All about building your book of business", "advice": null}, {"title": "Mortgage Underwriter", "text": "Pros Great culture, benefits, PTO, and salary. Upper management really listens and tries to make environment great and enjoyable. Great work/life balance. Cons Hard to see much upward mobility and job can get quite stressful at times. Policies constantly change Advice to Management Great management. Only advice I could give is to try not to change things so often such as overtime.", "rating": 5, "pros": "Great culture, benefits, PTO, and salary. Upper management really listens and tries to make environment great and enjoyable. Great work/life balance.", "cons": "Hard to see much upward mobility and job can get quite stressful at times. Policies constantly change", "advice": "Great management. Only advice I could give is to try not to change things so often such as overtime."}, {"title": "It is the best bank to work for as a teller.", "text": "Pros Great pay for part-time student, amazing technology for tellers compared to other big banks, great PTO (about 2 weeks including sick), great week long full-time training. Cons It really depends on who you're working with, it can be good or bad. I had the best tellers working with me, but my supervisor aka Vice President, sucked. The manager only really cared about the bankers and their sales targets. They also break the law in regards to reporting time worked each day. Frequent interrupted mandatory breaks as well as incorrect time reporting. Advice to Management Make sure you don't put down your tellers, it makes it difficult to give the best service to the customers.", "rating": 5, "pros": "Great pay for part-time student, amazing technology for tellers compared to other big banks, great PTO (about 2 weeks including sick), great week long full-time training.", "cons": "It really depends on who you're working with, it can be good or bad. I had the best tellers working with me, but my supervisor aka Vice President, sucked. The manager only really cared about the bankers and their sales targets. They also break the law in regards to reporting time worked each day. Frequent interrupted mandatory breaks as well as incorrect time reporting.", "advice": "Make sure you don't put down your tellers, it makes it difficult to give the best service to the customers."}, {"title": "Business customer service", "text": "Pros The insurance benefits are the best. Cons The call surveys were not the best way to determine employees performance.", "rating": 3, "pros": "The insurance benefits are the best.", "cons": "The call surveys were not the best way to determine employees performance.", "advice": null}, {"title": "Liars", "text": "Pros • Paid Travel • Close all Holidays Cons • Poor Management • Pay is capped at 14/hr for tellers • Long shifts •Short Staffed  The management will tell you all this great stuff but in the end they’d crap on you and only really cared about the bankers. They also believe that E-ATMs were a thing of the future but considering the local population is was a huge flop everyday. Not to mention the manager was young and inexperienced with a tinge of racism. Like the majority of our patrons were Jewish or Black if you don’t like them don’t work there. Advice to Management Stop being greedy and consider the lives your employees live.", "rating": 3, "pros": "• Paid Travel", "cons": "• Poor Management", "advice": "Stop being greedy and consider the lives your employees live."}, {"title": "go apply", "text": "Pros Great Company, great benefit, worth to try it Cons A lot of pressure, doesn't pay as well as other company", "rating": 5, "pros": "Great Company, great benefit, worth to try it", "cons": "A lot of pressure, doesn't pay as well as other company", "advice": null}, {"title": "Teller", "text": "Pros Vacation benefits were really great Cons High turnover rate of employees especially tellers", "rating": 5, "pros": "Vacation benefits were really great", "cons": "High turnover rate of employees especially tellers", "advice": null}, {"title": "Good", "text": "Pros Updated computer systems, big brand - looks good on resume, good start pay, flexible schedule, depends upon branch, managers are helpful Cons Highly political, no career growth, managers need to be caring overall, no benefits for part time employees, high sales goals Advice to Management Listen to frontline employees", "rating": 3, "pros": "Updated computer systems, big brand - looks good on resume, good start pay, flexible schedule, depends upon branch, managers are helpful", "cons": "Highly political, no career growth, managers need to be caring overall, no benefits for part time employees, high sales goals", "advice": "Listen to frontline employees"}, {"title": "Review for chase", "text": "Pros Easy going place to work. Cons No room for growth. company politics Lack of communication Management skills can be better No upward mobility", "rating": 3, "pros": "Easy going place to work.", "cons": "No room for growth.", "advice": null}, {"title": "Customer Service Representative", "text": "Pros Work location, flexibility with schedule and excellent benefits. Cons Call center experience, and did not have the ability for work life balance.", "rating": 5, "pros": "Work location, flexibility with schedule and excellent benefits.", "cons": "Call center experience, and did not have the ability for work life balance.", "advice": null}, {"title": "Overworked", "text": "Pros Depending on the team it is a good place to work at. Cons Lack of professionalism and no appreciation for employees hard work . Advice to Management Training on managerial and coaching skills for upper management.", "rating": 3, "pros": "Depending on the team it is a good place to work at.", "cons": "Lack of professionalism and no appreciation for employees hard work .", "advice": "Training on managerial and coaching skills for upper management."}, {"title": "Sr. Mortgage banker", "text": "Pros Everyone is nice to work with. If you wortk hard you can make money. Cons Hard to get to management level. No diversity in Management level. Advice to Management Nope. You are stock in one place for ever. That's why I left. No diversity in Management level.", "rating": 3, "pros": "Everyone is nice to work with. If you wortk hard you can make money.", "cons": "Hard to get to management level. No diversity in Management level.", "advice": "Nope. You are stock in one place for ever. That's why I left. No diversity in Management level."}, {"title": "Expect lots of overtime", "text": "Pros Good benefits are the draw. 401k match and pension are decent. A fair amount of paid time off makes the long days easier to bear. Cons Constant org changes, talent gets lost in the shuffle. Many, many long hours. No work life balance despite management promoting it as such. Advice to Management Assess talent when reorging. Educate management on respectfulness of employees.", "rating": 1, "pros": "Good benefits are the draw. 401k match and pension are decent. A fair amount of paid time off makes the long days easier to bear.", "cons": "Constant org changes, talent gets lost in the shuffle. Many, many long hours. No work life balance despite management promoting it as such.", "advice": "Assess talent when reorging. Educate management on respectfulness of employees."}, {"title": "Loss mitagation", "text": "Pros Benefits Pay Life workDistance to work Friends Cons Lots of change Some bad managment", "rating": 5, "pros": "Benefits Pay Life workDistance to work", "cons": "Lots of change", "advice": null}, {"title": "Senior Specialist II", "text": "Pros Opportunity for growth in the company Cons There is a high turn over rate", "rating": 5, "pros": "Opportunity for growth in the company", "cons": "There is a high turn over rate", "advice": null}, {"title": "Bank Teller", "text": "Pros -Flexible -Benefits -Friendly environment -Easy work Cons -Chase allows for “known” customers. Meaning instead of asking for the customers ID, because you “know” them you bypass the information. However, as a new employee who knows no one this can be very annoying and uncomfortable. Most customers are rude about it, and would rather hold up the line than present their ID while they wait for another employee to be free and enter “known” on their behalf. -In training ID is a topic highly discussed, but not followed. -Training focuses on teller express and not enough on the internet portal. The portal can help answe a lot of questions the customer may have. Advice to Management Training should also include the internet portal, this portal is used almost as much as teller express when a customer has extra questions.", "rating": 5, "pros": "-Flexible", "cons": "-Chase allows for “known” customers. Meaning instead of asking for the customers ID, because you “know” them you bypass the information. However, as a new employee who knows no one this can be very annoying and uncomfortable. Most customers are rude about it, and would rather hold up the line than present their ID while they wait for another employee to be free and enter “known” on their behalf.", "advice": "Training should also include the internet portal, this portal is used almost as much as teller express when a customer has extra questions."}, {"title": "Relationship Banker", "text": "Pros Health Benefits Opportunities in all lines of business Cons Compensation Support to move to other departments not on retail Advice to Management Support employees who are educationally qualified and who continue to educate themselves to move into sought career field", "rating": 5, "pros": "Health Benefits", "cons": "Compensation", "advice": "Support employees who are educationally qualified and who continue to educate themselves to move into sought career field"}, {"title": "Good place to work", "text": "Pros 1) Benefits 2) Good company ethic 3) Flexible Cons 1) Uniform 2) Customers (sometimes REALLY rude) Advice to Management Be more considerate of your employees ans treat everyone fairly.", "rating": 5, "pros": "1) Benefits", "cons": "1) Uniform", "advice": "Be more considerate of your employees ans treat everyone fairly."}, {"title": "Teller", "text": "Pros Great place to work for, wonderful team, Cons Not offer full time teller", "rating": 5, "pros": "Great place to work for, wonderful team,", "cons": "Not offer full time teller", "advice": null}, {"title": "Generous and flexible", "text": "Pros Competitive pay, lots of flexibility Cons Dead end, hard to move past a on the phones job", "rating": 5, "pros": "Competitive pay, lots of flexibility", "cons": "Dead end, hard to move past a on the phones job", "advice": null}, {"title": "Relationship banker", "text": "Pros Monthly incentives, paid time off, ok benefits, decent technology and 401k. Cons Low base, long hours, no advancement and need to hit 100% of your monthly goal in order to get paid at 100 percent. No work/life balance! Advice to Management Employees opinion doesn’t matter", "rating": 1, "pros": "Monthly incentives, paid time off, ok benefits, decent technology and 401k.", "cons": "Low base, long hours, no advancement and need to hit 100% of your monthly goal in order to get paid at 100 percent. No work/life balance!", "advice": "Employees opinion doesn’t matter"}, {"title": "Overall Good Company", "text": "Pros Many different career paths available Cons Work hard and may not be recognized", "rating": 3, "pros": "Many different career paths available", "cons": "Work hard and may not be recognized", "advice": null}, {"title": "Dedication", "text": "Pros Career advancement, dedication shows through commesions Cons Compensation always changing for benefit of the co. & not the employees. Advice to Management Keep your team active in development plans.", "rating": 5, "pros": "Career advancement, dedication shows through commesions", "cons": "Compensation always changing for benefit of the co. & not the employees.", "advice": "Keep your team active in development plans."}, {"title": "Great", "text": "Pros Benefits assebility assistant understands great Cons Only if you don’t like corporate America", "rating": 5, "pros": "Benefits assebility assistant understands great", "cons": "Only if you don’t like corporate America", "advice": null}, {"title": "Highs and Lows", "text": "Pros The community I worked in made it worth coming in each day. The benefits were good. Cons Turnover rate high, lack of coaching and support from management, Private Client team lazy, many HR problems, partners were either great or too busy to help but gladly took referrals, elimination of positions made everyones job more difficult. Advancement is completely correlated to your direct manager otherwise youre stuck Advice to Management Upper management needs to support everyone not a select few. Good ol' boy club feel is obvious and gets old", "rating": 3, "pros": "The community I worked in made it worth coming in each day. The benefits were good.", "cons": "Turnover rate high, lack of coaching and support from management, Private Client team lazy, many HR problems, partners were either great or too busy to help but gladly took referrals, elimination of positions made everyones job more difficult. Advancement is completely correlated to your direct manager otherwise youre stuck", "advice": "Upper management needs to support everyone not a select few. Good ol' boy club feel is obvious and gets old"}, {"title": "Teller", "text": "Pros Flexible Great work life balance Cons Pay was not enough All tellers did not make the same Advice to Management N/A", "rating": 5, "pros": "Flexible", "cons": "Pay was not enough", "advice": "N/A"}, {"title": "Great job when you have a good manager", "text": "Pros Resources, demographic information availability, specialists of other lines of business Cons Micromanaging, no true oversight over branch managers, lack of application of company's plan in terms of staffing and job responsibilities.", "rating": 5, "pros": "Resources, demographic information availability, specialists of other lines of business", "cons": "Micromanaging, no true oversight over branch managers, lack of application of company's plan in terms of staffing and job responsibilities.", "advice": null}, {"title": "great place", "text": "Pros the place is great to work at Cons there are no cons for working here", "rating": 5, "pros": "the place is great to work at", "cons": "there are no cons for working here", "advice": null}, {"title": "LTOS", "text": "Pros Comfortable environment, plenty of time off vacation personal and sick and maternity leave Cons Takes long to move through the company. Annual bonus only for BM and ABM", "rating": 3, "pros": "Comfortable environment, plenty of time off vacation personal and sick and maternity leave", "cons": "Takes long to move through the company. Annual bonus only for BM and ABM", "advice": null}, {"title": "Personal banker", "text": "Pros Make great cash incentives unlimited no cap, 401k, pensions, vacations, personal time, sick time and holiday days off. Cons Changes of policy of the bank changes all the time. Hours are usually 9-6 monday-sat with one day off and its different month to month. Advice to Management Be more flexible with working parents because of kids school events. My particular manager is not so flexible of schedule changes only at his own terms.", "rating": 5, "pros": "Make great cash incentives unlimited no cap, 401k, pensions, vacations, personal time, sick time and holiday days off.", "cons": "Changes of policy of the bank changes all the time. Hours are usually 9-6 monday-sat with one day off and its different month to month.", "advice": "Be more flexible with working parents because of kids school events. My particular manager is not so flexible of schedule changes only at his own terms."}, {"title": "Work Review", "text": "Pros Good company to work for , good benefits Cons Employees work in Silo, not too much interaction across the divisons", "rating": 3, "pros": "Good company to work for , good benefits", "cons": "Employees work in Silo, not too much interaction across the divisons", "advice": null}, {"title": "Stable Place to work", "text": "Pros Very stable company with 100+ yrs of good history. Diverse portfolio offers financial stability to the company. Cons Very bureaucratic Not at par in the technological area Advice to Management Need to focus on employee empowerment", "rating": 5, "pros": "Very stable company with 100+ yrs of good history.", "cons": "Very bureaucratic", "advice": "Need to focus on employee empowerment"}, {"title": "Yada Yada Yada", "text": "Pros Benefits Salary Pension Cafeteria Name on the Resume Cons Management Cafeteria Location Security Fake \"Care about You\" employee program.", "rating": 5, "pros": "Benefits", "cons": "Management", "advice": null}, {"title": "good company", "text": "Pros great company to work for Cons no advancement, seems like you're stuck in the same position.", "rating": 3, "pros": "great company to work for", "cons": "no advancement, seems like you're stuck in the same position.", "advice": null}, {"title": "Personal Banker/Teller", "text": "Pros Great benefits and perks for being a Chase employee. Cons Very poor organizational culture that supports unethical behaviors as long as the \"numbers\" looked good. Advice to Management Get additional management training in motivating employees and conflict resolution.", "rating": 3, "pros": "Great benefits and perks for being a Chase employee.", "cons": "Very poor organizational culture that supports unethical behaviors as long as the \"numbers\" looked good.", "advice": "Get additional management training in motivating employees and conflict resolution."}, {"title": "Teller , its okay", "text": "Pros Its an easy job and you get holiday pay. Cons You only get 20 hours from the start and when you have classes, its hard to get them to budge on it. If you ask for more hours you have to jump through hoops according to them to get that. Alot of nepotism Advice to Management Give more flexibility to students. Doing this will keep them around and make them desire to stay. I plan on putting in my two weeks and I just started two months ago. My education comes first.", "rating": 3, "pros": "Its an easy job and you get holiday pay.", "cons": "You only get 20 hours from the start and when you have classes, its hard to get them to budge on it. If you ask for more hours you have to jump through hoops according to them to get that. Alot of nepotism", "advice": "Give more flexibility to students. Doing this will keep them around and make them desire to stay. I plan on putting in my two weeks and I just started two months ago. My education comes first."}, {"title": "Manager/VP", "text": "Pros Solid place to work and grow Cons More competitive compensation would help", "rating": 5, "pros": "Solid place to work and grow", "cons": "More competitive compensation would help", "advice": null}, {"title": "Bank Teller", "text": "Pros The job had room to grow even though you don’t need much education to get hired. Their benefits and vacations were reasonable. The work environment was a positive team atmosphere. A lot of days off bc banks are usually closed anyways Cons We didn’t get a seat at my branch so after a while you could get tired standing. The computer system was complicated to learn. Had to work Saturdays. Advice to Management Allow your employees to sit at least in between helping customers", "rating": 5, "pros": "The job had room to grow even though you don’t need much education to get hired. Their benefits and vacations were reasonable. The work environment was a positive team atmosphere. A lot of days off bc banks are usually closed anyways", "cons": "We didn’t get a seat at my branch so after a while you could get tired standing. The computer system was complicated to learn. Had to work Saturdays.", "advice": "Allow your employees to sit at least in between helping customers"}, {"title": "Review", "text": "Pros Great place to work, for the most part. Cons Lack of proper upper management could reuse ongoing training. Advice to Management Windows for opportunity growth are too small.", "rating": 5, "pros": "Great place to work, for the most part.", "cons": "Lack of proper upper management could reuse ongoing training.", "advice": "Windows for opportunity growth are too small."}, {"title": "Worst Job Ever", "text": "Pros Benefits, PTO, Some discounts at certain places Cons Extreme micromanagement, 24/7 so you work every single holiday, Rude customers, Adherence time. Low pay. PTO never gets approved. Back to back calls the ENTIRE shift. Breaks can only be taken during designated break times. If a call goes over that them, then that's that, no break for you. Advice to Management Stop micromanaging. Whats the point in having PTO if it never gets approved even if it is requested 6 months in advanced. The adherence time is so unforgiving. If an employee has to take a crap, it messes with your adherence time. I was miserable every single day of my life at this place. I was contemplating suicide because I hated my life so much. Being fired from there was the best thing that ever happened and probably saved my life.", "rating": 1, "pros": "Benefits, PTO, Some discounts at certain places", "cons": "Extreme micromanagement, 24/7 so you work every single holiday, Rude customers, Adherence time. Low pay. PTO never gets approved. Back to back calls the ENTIRE shift. Breaks can only be taken during designated break times. If a call goes over that them, then that's that, no break for you.", "advice": "Stop micromanaging. Whats the point in having PTO if it never gets approved even if it is requested 6 months in advanced. The adherence time is so unforgiving. If an employee has to take a crap, it messes with your adherence time. I was miserable every single day of my life at this place. I was contemplating suicide because I hated my life so much. Being fired from there was the best thing that ever happened and probably saved my life."}, {"title": "Great place to work", "text": "Pros Great opportunity to grow and learn Cons They are open 24 hours a day 365 days a year Advice to Management Listen to employees", "rating": 5, "pros": "Great opportunity to grow and learn", "cons": "They are open 24 hours a day 365 days a year", "advice": "Listen to employees"}, {"title": "Great professional start", "text": "Pros Great way to begin a professional career Cons I was part time but was often scheduled full time hours. This would've been fine if I weren't a full time student at the time. Advice to Management Be considerate of employees life outside of the branch", "rating": 5, "pros": "Great way to begin a professional career", "cons": "I was part time but was often scheduled full time hours. This would've been fine if I weren't a full time student at the time.", "advice": "Be considerate of employees life outside of the branch"}, {"title": "Assistant Branch Manager", "text": "Pros Performance Bonus, uniform, training & experience, volatile customer service Cons All sales focus in all areas of the company, after hours sales call nights, wide divide in salary from Branch Managers to Assistant Branch Managers, uniform", "rating": 3, "pros": "Performance Bonus, uniform, training & experience, volatile customer service", "cons": "All sales focus in all areas of the company, after hours sales call nights, wide divide in salary from Branch Managers to Assistant Branch Managers, uniform", "advice": null}, {"title": "Great company to work for", "text": "Pros Plenty of opportunities to move up, great pay especially in new york city area, commissions added to paycheck every month, paid sick and vacation and yearly christmas bonus even if part time Cons Hard to get time off, because they are typically disbursed by seniority Advice to Management Great management", "rating": 5, "pros": "Plenty of opportunities to move up, great pay especially in new york city area, commissions added to paycheck every month, paid sick and vacation and yearly christmas bonus even if part time", "cons": "Hard to get time off, because they are typically disbursed by seniority", "advice": "Great management"}, {"title": "At a glance", "text": "Pros Great flexibility. I get a great work life balance. 4 weeks vacation, personal and sick time. Great bonus POTENTIAL. Excellent benefits,MRA, 401k 5% match. Great opportunities for career advancement. Great partners!! Cons Low base salary. Lots of phone calls with unrealistic sales expectations. Micro managed at times. We push everyone to use technology and as result, there is less traffic in the branch and it's difficult to get them back in. Advice to Management Pay higher base salaries comparable to other banks. Allow us to leave more personalized emails to clients. Revisit the commission structure. Get rid of cycle dates. If a client deposits money in a savings, but pulls the money out 2 1/2 months later (but keeps account open) the banker shouldn't get a charge back.", "rating": 5, "pros": "Great flexibility. I get a great work life balance. 4 weeks vacation, personal and sick time. Great bonus POTENTIAL. Excellent benefits,MRA, 401k 5% match. Great opportunities for career advancement. Great partners!!", "cons": "Low base salary. Lots of phone calls with unrealistic sales expectations. Micro managed at times. We push everyone to use technology and as result, there is less traffic in the branch and it's difficult to get them back in.", "advice": "Pay higher base salaries comparable to other banks. Allow us to leave more personalized emails to clients. Revisit the commission structure. Get rid of cycle dates. If a client deposits money in a savings, but pulls the money out 2 1/2 months later (but keeps account open) the banker shouldn't get a charge back."}, {"title": "Chase your dreams", "text": "Pros You get to interact with a lot of different people, everyday. Everyday is a new day and new experience. You learn a lot about currency, and not just U.S. currency, especially if you get to work at a location that deals directly with foreign currency. Room to development/growth. Cons You are customer-facing and upset or angry customers may be tough to deal with at times. Most tellers only receive part-time hours. Advice to Management Be good to your staff and they will be good to you.", "rating": 5, "pros": "You get to interact with a lot of different people, everyday. Everyday is a new day and new experience. You learn a lot about currency, and not just U.S. currency, especially if you get to work at a location that deals directly with foreign currency. Room to development/growth.", "cons": "You are customer-facing and upset or angry customers may be tough to deal with at times. Most tellers only receive part-time hours.", "advice": "Be good to your staff and they will be good to you."}, {"title": "acccunt executive", "text": "Pros Great people in the sales and home office for support. Cons Operations office had several managers all with different styles and closing loans suffered to process.", "rating": 5, "pros": "Great people in the sales and home office for support.", "cons": "Operations office had several managers all with different styles and closing loans suffered to process.", "advice": null}, {"title": "teller", "text": "Pros Paid time off and personal leave Cons Health benefits not so great", "rating": 5, "pros": "Paid time off and personal leave", "cons": "Health benefits not so great", "advice": null}, {"title": "Great Benefits", "text": "Pros Great Benefits, schedule, Great Benefits, schedule and Great Benefits, Cons Career Advancement, upper management, short lunches, no communicate and low moral", "rating": 5, "pros": "Great Benefits, schedule, Great Benefits, schedule and Great Benefits,", "cons": "Career Advancement, upper management, short lunches, no communicate and low moral", "advice": null}, {"title": "Relationship Banker", "text": "Pros Great bonus structure and pay Cons Long hours no Saturday's off", "rating": 5, "pros": "Great bonus structure and pay", "cons": "Long hours no Saturday's off", "advice": null}, {"title": "SPECIALIST II", "text": "Pros management actually care about you and do their best to keep you in the company. They try to help you as much as they can for you to grow within the company. they have great benefits , their vacation time and off time are amazing , maybe because they know its a hard job (mentally) and they pay you more depending your performance. Cons handeling with costumers all day may be stressful and can be overwhelming. they do have a high volume of calls.", "rating": 5, "pros": "management actually care about you and do their best to keep you in the company. They try to help you as much as they can for you to grow within the company. they have great benefits , their vacation time and off time are amazing , maybe because they know its a hard job (mentally) and they pay you more depending your performance.", "cons": "handeling with costumers all day may be stressful and can be overwhelming. they do have a high volume of calls.", "advice": null}, {"title": "Small Business Banker", "text": "Pros Great training and upper management makes sure you're well trained for the job. Cons System and process can be improved.", "rating": 5, "pros": "Great training and upper management makes sure you're well trained for the job.", "cons": "System and process can be improved.", "advice": null}, {"title": "Software developer", "text": "Pros good work/life balance big company branding Cons I don't know why so many people thought their benefits are good. let me tell the truth. Health Insurance: Chase has high deductible insurance like other companies. But the catch is their saving accounts. They have two accounts for Health: MRA and HCSA. (notice: other company usually offer HSA which is totally different.). MRA is called medical reimbursement account. When you have body checked annually and some data is met, then Chase will give you $200 to this account and the fund CANNOT be used for dental and vision. HCSA is called Healthcare saving account and you contribute semi-monthly. Basically money in your account is yours. However, if you contribute more than $500 per year and don't spend them by EOY, the amount over $500 will be forfeited by Chase. YES, your money will be taken away by Chase. Looks like they are making money and it is their benefit not yours. When you left the company, fund in MRA will be forfeited by the end of that month and fund in your HCSA will be forfeited by following March. 401K: You don't have 401k match first year period. You will have 401k match second year and the match will come to your account at the end of 2nd year: If you leave between 1-2 years, you cannot even see the money. You can keep 401k match at the end of 3rd year. But notice they always give you the match at the end of year, so you cannot make money from the match through the years. Annual increase and Incentive: 3-5% sometime less Culture & Value: Each line of business just pushes their responsibilities out and so many politics go on. If other people's pay grade is higher than you, you need to follow their orders even if they know nothing literally. Some of them just have more years of work experiences than you and they don't even know how to use the tools required for their daily work, but you still have to cover them. Once I was in a meeting and people were arguing on one issue. One of the person went to phone book to look up the rank and took side. Nothing is right or wrong but only politics and pay grade.", "rating": 3, "pros": "good work/life balance", "cons": "I don't know why so many people thought their benefits are good. let me tell the truth.", "advice": null}, {"title": "dispute by phone", "text": "Pros good benefits with options to move around Cons its a great place to work", "rating": 5, "pros": "good benefits with options to move around", "cons": "its a great place to work", "advice": null}, {"title": "Branch Manager", "text": "Pros Great people, great systems and resources. Cons Efforts to push technology and automated systems for clients led to reduction in staff and a significant volume of work for the few teams in the branches. Efforts to cut costs led to cleaning services being cancelled once a week and branch personnel is required to clean for that day. Low salary, bonus is given once a year rather than quarterly.", "rating": 3, "pros": "Great people, great systems and resources.", "cons": "Efforts to push technology and automated systems for clients led to reduction in staff and a significant volume of work for the few teams in the branches. Efforts to cut costs led to cleaning services being cancelled once a week and branch personnel is required to clean for that day. Low salary, bonus is given once a year rather than quarterly.", "advice": null}, {"title": "A Great Company", "text": "Pros Chase is a great company to work for if you put in the work. The structure for employees makes sure that no one is left out. Cons The only thing I see as an opportunity for Chase to improve upon is being more transparent on how people can move up to other positions in the company. Advice to Management Please refer to the previous writing.", "rating": 5, "pros": "Chase is a great company to work for if you put in the work. The structure for employees makes sure that no one is left out.", "cons": "The only thing I see as an opportunity for Chase to improve upon is being more transparent on how people can move up to other positions in the company.", "advice": "Please refer to the previous writing."}, {"title": "Banker", "text": "Pros Chase is a solid company. Good benefits - 401k match, generous amount of vacation time, health care options. Diverse work force. Cons There is a huge issue with lack of career progression and growth. Very hard to move from retail banking to other parts of the company. Advice to Management Get out of your office and see what actually happens in the branch.", "rating": 3, "pros": "Chase is a solid company. Good benefits - 401k match, generous amount of vacation time, health care options. Diverse work force.", "cons": "There is a huge issue with lack of career progression and growth. Very hard to move from retail banking to other parts of the company.", "advice": "Get out of your office and see what actually happens in the branch."}, {"title": "My notes", "text": "Pros Good people to work with, stellar customer service training, great benefits Cons Location and hours made it difficult to network outside the firm", "rating": 5, "pros": "Good people to work with, stellar customer service training, great benefits", "cons": "Location and hours made it difficult to network outside the firm", "advice": null}, {"title": "Assistant manager", "text": "Pros Good people, easy work, structure Cons Limited career pathing and exclusive community Advice to Management Work on career development to retain people", "rating": 5, "pros": "Good people, easy work, structure", "cons": "Limited career pathing and exclusive community", "advice": "Work on career development to retain people"}, {"title": "Wonderful place", "text": "Pros The work environment has been really great and I enjoy coming in to work and helping others. I feel like my peers really want what is best for me and my superiors try to help me succeed in my career. Cons There are no full time teller positions, and moving up has proven to be a bit difficult. Recommend becoming a banker in order to gain experience the company wants you to have because as a teller it doesn't seem like the company feels you have the right experience to move up.", "rating": 5, "pros": "The work environment has been really great and I enjoy coming in to work and helping others. I feel like my peers really want what is best for me and my superiors try to help me succeed in my career.", "cons": "There are no full time teller positions, and moving up has proven to be a bit difficult. Recommend becoming a banker in order to gain experience the company wants you to have because as a teller it doesn't seem like the company feels you have the right experience to move up.", "advice": null}, {"title": "Not bad for a College Job", "text": "Pros Flexible Scheduling Opportunity to move up Friendly co-workers Relatively easy Cons Working on Saturdays Sometimes have to deal with rude customers", "rating": 5, "pros": "Flexible Scheduling", "cons": "Working on Saturdays", "advice": null}, {"title": "pay", "text": "Pros excellent benefits plus great bonus Cons base salary rate is not the best", "rating": 3, "pros": "excellent benefits plus great bonus", "cons": "base salary rate is not the best", "advice": null}, {"title": "Diminishing Return - All Shine, no substance (anymore)", "text": "Pros Great opportunity for those under 40 years old. If you need a job, and you have a personality that can sell without thinking, this place is for you. They will train you, pay for licensing, hone you to their standards and make you comfortable, as long as you don’t think. The benefits, though constantly constricting, are ok. Cons For a company that place is such an emphasis on finding value to add (in soliciting customers), they fall short in adding value to their existing resources and people. It is truly sad when employee in a booming economy has to fight for pay raises and commission payouts, When a corporation is showing extraordinary profitability. It is also truly sad when employees hit plateaus or glass ceilings because it would cost That same employee to move up the ladder. It would cost them in time it would cost them and lost sales pipeline and ultimately in income from 1 to 3 years. It’s also unfortunate that there is a Glass ceiling when it comes to age and upward mobility in this company. Find me a NEW relationship manager who is over the age of 40. Finally, it’s unfortunate that this company has pigeonholed itself in the offering of products and services. While they sell the shiny appearance of “private client”, and offer these positions to potential employers as “a privilege” - It is no longer a truly privileged position. And there is no true value (for branches outside of major metro areas). Rates are same, lines are same and the banker that was supposed to be their dedicated point man can’t help, because he’s reversing the fees on an account for someone who shouldn’t be banking in the first place. The only thing that made Private Client special is that employee - he/she is the difference between standard retail brand banking and private client banking. Not the product, not the name - it’s the employee. Employment with this company Has turned out to be a diminishing return on my investment of time, money and expertise. It’s a shame, I once loved this place! Advice to Management There seems to be a general disconnect (between all levels of management) in the management of resources; including people, time, money, technology, and in real property. Make sure the computers work. A ten year old desktop running internet explorer on windows xp is not a “private client” experience Make sure your furniture doesn’t look like a goodwill acquisition. Chairs that have big chunks missing from arms, seats that creak and crack when clients sit in them and cubicles that provide no privacy are downright embarrassing when you call yourself Private Client Reduce the number of branches to avoid saturation (1 branch for every 2 square Miles in Vegas is overkill and leads to difficult sales in-fighting, overzealous and used car sales tactics and a reduced potential pool of qualified prospects). A pool of 5000 prospects (50% of population covered by typical branch) may actually yield 1000 qualified prospects of which 500 already Bank/invest with us. Do the math - squeezing a stone will not make it yield gold, it will only crush it to dust, Clearly define job title rolls, and stick to those rolls - private client bankers should not be doing notaries for core clients, opening second chance checking or prepaid cards for prior charge offs or password resets for the 20th time this year... Private client needs to focus on the HNW clients in order to get paid! Lastly, pay your employees like you truly care - not just a shiny slogan - do what IS right and pay those people what they deserve. And DONT make them fight for it - they will only defect to your competitors (with a good portion of their book following, not because they solicited them, but because the clients sought out those bankers - the difference-makers ... the whole reason the chose to open accounts and invest in the first place.$", "rating": 1, "pros": "Great opportunity for those under 40 years old. If you need a job, and you have a personality that can sell without thinking, this place is for you. They will train you, pay for licensing, hone you to their standards and make you comfortable, as long as you don’t think.", "cons": "For a company that place is such an emphasis on finding value to add (in soliciting customers), they fall short in adding value to their existing resources and people.", "advice": "There seems to be a general disconnect (between all levels of management) in the management of resources; including people, time, money, technology, and in real property."}, {"title": "Great Company", "text": "Pros Great Company to work for, lots of open jobs. They offer great work/life balance. Cons Hard mobility within the company. There are bidding wars for vacation time depending on the dept. that you work for. Advice to Management Keep training and offering advise to your employees. Work with them early on to determine proper career paths.", "rating": 5, "pros": "Great Company to work for, lots of open jobs. They offer great work/life balance.", "cons": "Hard mobility within the company. There are bidding wars for vacation time depending on the dept. that you work for.", "advice": "Keep training and offering advise to your employees. Work with them early on to determine proper career paths."}, {"title": "FADP", "text": "Pros Work-life-balance was a huge plus. Long hours are not expected. Cons Not intellectually stimulating, slow-paced environment.", "rating": 3, "pros": "Work-life-balance was a huge plus. Long hours are not expected.", "cons": "Not intellectually stimulating, slow-paced environment.", "advice": null}, {"title": "Relationship Banker", "text": "Pros You get to help people and meet their financial needs. Cons You do have to stay extended hours to call & follow up with customers. Sometimes you are \"cold\" calling people. Advice to Management The management at my location was amazing!! If I hadn't moved to a different state I'd still be working there. They have an exceptional training program.", "rating": 5, "pros": "You get to help people and meet their financial needs.", "cons": "You do have to stay extended hours to call & follow up with customers. Sometimes you are \"cold\" calling people.", "advice": "The management at my location was amazing!! If I hadn't moved to a different state I'd still be working there. They have an exceptional training program."}, {"title": "Mortgage Banker", "text": "Pros Internal Referral System for various bank sales professionals to receive bank client prospects from both banking staff and other bank sales executives. Bank managers, tellers, and other bank staff were all very professional and great people to work with each day. The career opportunities within the mortgage division are very good because this division is so inefficient that someone could move up quickly if they can manage to tolerate all of many issues existing the mortgage division. Cons Mortgage division was a mess to put it lightly. The loan underwriting dept was much better at denying loans than approving loans. If there was a single weakness in the loan file, the loan was denied. So, it was very, very difficult to get a loan approved. If the loan was approved, then it would have to go back and forth to the UW for review an average of 13 separate UW reviews before reaching final approval. As you can imagine, this created a very lengthy loan process for loan applicant clients. For example, a loan file typically spent 60+ days in loan processing before getting the clear to close from underwriting because of the number of reviews made by loan underwriters, the addition of new loan conditions by underwriters, lack of a sense of urgency found to exist pervasively throughout the loan fulfillment operations Centers (regional operatations Centers or centralized processing and underwriting Centers) back and forth of a loan file. The loan software systems used by the bank were all proprietary, thus no one could have prior knowledge and experience with the software unless you had already worked with the bank before in some other role before migrating into the mortgage division. Many of these proprietary software systems had significant flaws, were unreliable, and created many problems with both loan origination and processing that do not exist within the mortgage industry, but instead were a result of being associated with the bank and the attempt to integrate banking software with mortgage industry software. To sum it up, the software was a mess and the software alone created many significant issues for the bank’s mortgage division. Advice to Management While the interaction of banking employees within the bank setting environment is very good, the integration of the bank software with the mortgage software is not good. The number of prospective clients for the bank seems nearly limitless at times, but the inefficiency of the mortgage division, especially in regards to the loan fulfillment Ops Centers and loan origination software make it extremely difficult to complete a loan. Because of these huge barriers existing for the mortgage origination folks, it is impossible to provide an efficient loan experience for bank clients, as well as obtaining new clients outside of the bank’s internal clientele. The problems existing in just those areas (loan fulfillment underwriting and processing, and loan software and its integration with the bank’s many internal software programs) alone create a huge mess that continually prevents loan origination staff from being able to provide bank clients with a good loan experience due to the lack of efficient loan fulfillment operations and computer-glitch filled loan software used by the bank for the mortgage division. These are both unbelievably inefficent. In fact, so much so to the point that the bank should strongly consider a complete overhaul of the mortgage division, thereby requiring a new software system and loan fulfillment operations plan for its loan origination and fulfillment software, loan processing and underwriting SOP’s, and nearly everything as it relates to loan fulfillment operations. It was incredibly disappointing to realize how much potential was being wasted by the bank in its mortgage business channel because the potential existing for the bank within the mortgage industry seems nearly inexhaustible. However, the inefficiency existing within its loan Ops appears equally challenging, too. If the bank could solve its loan fulfillment issues, which are daunting and significant, then without a doubt the bank could dominate the mortgage industry. However, I do not believe that the bank will make the mortgage division a priority and I think they already recognize the enormity of the problems plaguing their mortgage division and are unwillingly to commit to the effort needed to correct the loan fulfillment of its loan operations.", "rating": 3, "pros": "Internal Referral System for various bank sales professionals to receive bank client prospects from both banking staff and other bank sales executives. Bank managers, tellers, and other bank staff were all very professional and great people to work with each day. The career opportunities within the mortgage division are very good because this division is so inefficient that someone could move up quickly if they can manage to tolerate all of many issues existing the mortgage division.", "cons": "Mortgage division was a mess to put it lightly. The loan underwriting dept was much better at denying loans than approving loans. If there was a single weakness in the loan file, the loan was denied. So, it was very, very difficult to get a loan approved. If the loan was approved, then it would have to go back and forth to the UW for review an average of 13 separate UW reviews before reaching final approval. As you can imagine, this created a very lengthy loan process for loan applicant clients. For example, a loan file typically spent 60+ days in loan processing before getting the clear to close from underwriting because of the number of reviews made by loan underwriters, the addition of new loan conditions by underwriters, lack of a sense of urgency found to exist pervasively throughout the loan fulfillment operations Centers (regional operatations Centers or centralized processing and underwriting Centers) back and forth of a loan file.", "advice": "While the interaction of banking employees within the bank setting environment is very good, the integration of the bank software with the mortgage software is not good. The number of prospective clients for the bank seems nearly limitless at times, but the inefficiency of the mortgage division, especially in regards to the loan fulfillment Ops Centers and loan origination software make it extremely difficult to complete a loan. Because of these huge barriers existing for the mortgage origination folks, it is impossible to provide an efficient loan experience for bank clients, as well as obtaining new clients outside of the bank’s internal clientele. The problems existing in just those areas (loan fulfillment underwriting and processing, and loan software and its integration with the bank’s many internal software programs) alone create a huge mess that continually prevents loan origination staff from being able to provide bank clients with a good loan experience due to the lack of efficient loan fulfillment operations and computer-glitch filled loan software used by the bank for the mortgage division. These are both unbelievably inefficent. In fact, so much so to the point that the bank should strongly consider a complete overhaul of the mortgage division, thereby requiring a new software system and loan fulfillment operations plan for its loan origination and fulfillment software, loan processing and underwriting SOP’s, and nearly everything as it relates to loan fulfillment operations. It was incredibly disappointing to realize how much potential was being wasted by the bank in its mortgage business channel because the potential existing for the bank within the mortgage industry seems nearly inexhaustible. However, the inefficiency existing within its loan Ops appears equally challenging, too. If the bank could solve its loan fulfillment issues, which are daunting and significant, then without a doubt the bank could dominate the mortgage industry. However, I do not believe that the bank will make the mortgage division a priority and I think they already recognize the enormity of the problems plaguing their mortgage division and are unwillingly to commit to the effort needed to correct the loan fulfillment of its loan operations."}, {"title": "Good Employer", "text": "Pros Number of branch locations; relocation possiblities; benefits; paternal and maturnal LOA (maturity LOA 4 mo 100% base pay); discounts Cons Lack of Brand acceptance by local community in PNW; lack of investing in community involvement save for up in the Bellevue, Seattle, Issaquah area Advice to Management Do more for the local communities in every demographic of Washington State. I would love to see more activity and financial support in Thurston and Pierce counties as we have a lot of employees and branches there.", "rating": 5, "pros": "Number of branch locations; relocation possiblities; benefits; paternal and maturnal LOA (maturity LOA 4 mo 100% base pay); discounts", "cons": "Lack of Brand acceptance by local community in PNW; lack of investing in community involvement save for up in the Bellevue, Seattle, Issaquah area", "advice": "Do more for the local communities in every demographic of Washington State. I would love to see more activity and financial support in Thurston and Pierce counties as we have a lot of employees and branches there."}]