[{"title": "Order packer", "text": "Pros good benefits, good pay, no HR Cons petty work drama, high school level cattiness", "rating": 5, "pros": "good benefits, good pay, no HR", "cons": "petty work drama, high school level cattiness", "advice": null}, {"title": "Engineer", "text": "Pros Great company to work for. Cons Profit orientated, need based company", "rating": 3, "pros": "Great company to work for.", "cons": "Profit orientated, need based company", "advice": null}, {"title": "Best at what they do", "text": "Pros No company have I ever worked with care more about the client. Generous company with great benefits. Cons Struggle with effective communication between departments and especially with so many folks being decentralized.", "rating": 5, "pros": "No company have I ever worked with care more about the client. Generous company with great benefits.", "cons": "Struggle with effective communication between departments and especially with so many folks being decentralized.", "advice": null}, {"title": "Ok", "text": "Pros 5 day work week no overtime Cons No overtime. No merit increases Advice to Management Think about your employees", "rating": 3, "pros": "5 day work week no overtime", "cons": "No overtime. No merit increases", "advice": "Think about your employees"}, {"title": "There OK", "text": "Pros The Pay was good but. Cons Way to many hours required Advice to Management Treat employees more fair", "rating": 5, "pros": "The Pay was good but.", "cons": "Way to many hours required", "advice": "Treat employees more fair"}, {"title": "Good", "text": "Pros Discount and friendly environment Cons Slow times of year", "rating": 5, "pros": "Discount and friendly environment", "cons": "Slow times of year", "advice": null}, {"title": "decent entry level", "text": "Pros good pay for starters Cons sometimes have to stay beyond your hours", "rating": 5, "pros": "good pay for starters", "cons": "sometimes have to stay beyond your hours", "advice": null}, {"title": "Dont go there", "text": "Pros Nothing at all while there Cons None at all. All ok Advice to Management Suppott staff andvtheir decisions always", "rating": 1, "pros": "Nothing at all while there", "cons": "None at all. All ok", "advice": "Suppott staff andvtheir decisions always"}, {"title": "Best Image editing service provider", "text": "Pros All kinds of image editing service provider like- clipping path, background removal service, car image editing service, color correction service, masking service, retouching service and so on. Cons Best service with low cost. Advice to Management Thanks for creating such as a place for designer.", "rating": 5, "pros": "All kinds of image editing service provider like- clipping path, background removal service, car image editing service, color correction service, masking service, retouching service and so on.", "cons": "Best service with low cost.", "advice": "Thanks for creating such as a place for designer."}, {"title": "Sehr happy, guter Arbeitgeber", "text": "Pros Gutes Arbeitsklima Nette Kollegen Spannende Aufgaben Sehr großes Potenzial Zufriedene Kunden Cons Clark ist ein Startup. Man muss damit umgehen können, dass Dinge schnell umgesetzt werden und auch von den Mitarbeitern ein schnelles Umschalten verlangt wird.", "rating": 5, "pros": "Gutes Arbeitsklima", "cons": "Clark ist ein Startup. Man muss damit umgehen können, dass Dinge schnell umgesetzt werden und auch von den Mitarbeitern ein schnelles Umschalten verlangt wird.", "advice": null}]