[{"title": "Challenging work, autonomous roles.", "text": "Pros Interesting business idea with real clients. CEO has deep knowledge of the space and hands-on knowledge of the tech itself. Lots of autonomy in the role and the opportunity to shape the business as it grows. Flexible working culture (WFH policy etc) and friendly colleagues. Cons Not everyone in the business seemed cut out for a job in a start-up (it’s definitely not a corporate environment). The issue seems to have resolved in recent months with some of those people leaving but it was a problem for a while. Advice to Management Focus on bringing in the right type of people into the organisation - cultural fit as well as technical ability.", "rating": 5, "pros": "Interesting business idea with real clients. CEO has deep knowledge of the space and hands-on knowledge of the tech itself. Lots of autonomy in the role and the opportunity to shape the business as it grows. Flexible working culture (WFH policy etc) and friendly colleagues.", "cons": "Not everyone in the business seemed cut out for a job in a start-up (it’s definitely not a corporate environment). The issue seems to have resolved in recent months with some of those people leaving but it was a problem for a while.", "advice": "Focus on bringing in the right type of people into the organisation - cultural fit as well as technical ability."}, {"title": "Maybe not...", "text": "Pros 1. Learn some Latin quotes and Latex 2. Good office location (but for long?) 3. People from very different work backgrounds 4. Get ego boost with Bitcoin hype Cons 1. Super high staff turnover 2. Low salaries, no benefits, struggling with funding 3. Arrogant management 4. Strange culture Advice to Management Have been waiting for results in tech and revenue for long.", "rating": 1, "pros": "1. Learn some Latin quotes and Latex", "cons": "1. Super high staff turnover", "advice": "Have been waiting for results in tech and revenue for long."}, {"title": "Has potential", "text": "Pros Good research work/possibilities, plenty to learn if you're willing to, interesting work overall. CEO is respectable and definitely understands the domain well. Career progression proportional to skill and effort you put in, which is nice. One of the few \"serious\" blockchain companies, so you're generally working on \"bleeding-edge\" tech/concepts in crypto and distributed systems and other fun stuff. Great thing to gain experience in as they're very in-demand and useful skills. Cons Early stage startup so some ups and downs. Some bad hires in the past, bit chaotic. Advice to Management Spend more time vetting candidates, more communication needed in general.", "rating": 5, "pros": "Good research work/possibilities, plenty to learn if you're willing to, interesting work overall. CEO is respectable and definitely understands the domain well. Career progression proportional to skill and effort you put in, which is nice.", "cons": "Early stage startup so some ups and downs. Some bad hires in the past, bit chaotic.", "advice": "Spend more time vetting candidates, more communication needed in general."}, {"title": "Good idea, bad execution", "text": "Pros business idea is interesting, very nice central office location, few nice and competent colleagues, flexi time and work from home, number of holidays Cons A few very rude and arrogant colleagues destroy it for everybody. Most of the developers have left already. The tech is (ironically!) pretty boring, high staff turnover, below market compensation, ceo thinks he is a technical person but is far from it, employees not trusted by management, mishandling of private data, and very little upskilling. Advice to Management get rid of all the toxic people to create a company where people enjoy working and want to stay longer.", "rating": 1, "pros": "business idea is interesting, very nice central office location, few nice and competent colleagues, flexi time and work from home, number of holidays", "cons": "A few very rude and arrogant colleagues destroy it for everybody. Most of the developers have left already. The tech is (ironically!) pretty boring, high staff turnover, below market compensation, ceo thinks he is a technical person but is far from it, employees not trusted by management, mishandling of private data, and very little upskilling.", "advice": "get rid of all the toxic people to create a company where people enjoy working and want to stay longer."}, {"title": "software developer", "text": "Pros Intelligent coworkers, interesting projects, lots to learn Cons less interactions with interns, not enough salary", "rating": 5, "pros": "Intelligent coworkers, interesting projects, lots to learn", "cons": "less interactions with interns, not enough salary", "advice": null}]