[{"title": "Overall a great experience", "text": "Pros Good management Great training Nice employees Age group youre selling to is nice Good balance Cons Not that many hours Sometimes pressure to meet targets Style is hard for teenagers to wear", "rating": 5, "pros": "Good management", "cons": "Not that many hours", "advice": null}, {"title": "Hard work", "text": "Pros Flexible and fun. New experiences Cons Not enough pay work on Saturday Advice to Management Pay more", "rating": 1, "pros": "Flexible and fun. New experiences", "cons": "Not enough pay work on Saturday", "advice": "Pay more"}, {"title": "Difficult to make your quota. Older employees will block you at the cash", "text": "Pros good employee discount nice manager nice clothing, clean store Cons minimum wage. The long time employees \"park\" themselves at the cash register and ring in all the sales under their names so you will have zero sales for the day. In fact they were quite mean spirited and taunted the new employees. Awful experience actually. No one should be treated like this ! When the manager turned around or went in the back office, they would harass the new people. Advice to Management Be on hand to watch what is happening ! Give someone new a chance to succeed. Those mission statements do not mean anything if you allow someone new to be bullied.", "rating": 1, "pros": "good employee discount", "cons": "minimum wage.", "advice": "Be on hand to watch what is happening ! Give someone new a chance to succeed."}, {"title": "Assistant Manager", "text": "Pros It has been great working at Cleo. I started working here 3 weeks ago and the Cleo experience has been great. I would recommend this company to everyone. The assistant manager's position comes with a lot of responsibility. Most importantly \"visual setup\" of the store is key. You have to do a flip of the store every 3 weeks or so. But overall the experience so far has been great. I would love to grow with this company as time goes by. Cons - less people working - visual setup requires a lot of work so i suggest that there should be enough people to do it Advice to Management More people should be hired! There arn't enough people working at one store.", "rating": 5, "pros": "It has been great working at Cleo. I started working here 3 weeks ago and the Cleo experience has been great. I would recommend this company to everyone. The assistant manager's position comes with a lot of responsibility. Most importantly \"visual setup\" of the store is key. You have to do a flip of the store every 3 weeks or so. But overall the experience so far has been great. I would love to grow with this company as time goes by.", "cons": "- less people working", "advice": "More people should be hired! There arn't enough people working at one store."}, {"title": "Sales Associate", "text": "Pros -Manager & assistant manager were very kind and caring at my specific location -Friendly atmosphere -Learning things here is not difficult Cons -Not enough works per week or sometimes no hours at all -High expectations for the location that my store was", "rating": 3, "pros": "-Manager & assistant manager were very kind and caring at my specific location", "cons": "-Not enough works per week or sometimes no hours at all", "advice": null}, {"title": "Assistant Buyer", "text": "Pros The culture is mostly positive and my buying coworkers were great Cons -ZERO opportunities for growth -very poor pay and no raises -expected to volunteer our free time -GMM is very demotivating and belittling of staff, and generally treats people terribly -high turnover rate in staff Advice to Management Employees who are given opportunities and are encouraged, motivated, promoted and developed will stay.", "rating": 1, "pros": "The culture is mostly positive and my buying coworkers were great", "cons": "-ZERO opportunities for growth", "advice": "Employees who are given opportunities and are encouraged, motivated, promoted and developed will stay."}, {"title": "Cleo", "text": "Pros -Flexible hours for students - Discounts on clothing Cons - no room for growth -poor pay Advice to Management You need more opportunities for people to grow in the company", "rating": 3, "pros": "-Flexible hours for students", "cons": "- no room for growth", "advice": "You need more opportunities for people to grow in the company"}, {"title": "Not much good for me", "text": "Pros Good employee discount, a few good coworkers Cons Nice clothes, but seem really expensive. Sales are ALWAYS happening (probably good, otherwise I don't think a lot of people would shop there). My specific store doesn't seem to have much of a team atmosphere. Feels really cliquey. I'm a cashier and somehow expected to sell at least a couple hundred of clothing. Unsure how when I'm constantly behind the cash desk. Advice to Management Talk to your employees for reasons other than doling out work. Encourage a team atmosphere. Yes, I get that sales are a huge thing, but so is employee morale. If that goes down, drive to sell goes down.", "rating": 3, "pros": "Good employee discount, a few good coworkers", "cons": "Nice clothes, but seem really expensive. Sales are ALWAYS happening (probably good, otherwise I don't think a lot of people would shop there). My specific store doesn't seem to have much of a team atmosphere. Feels really cliquey. I'm a cashier and somehow expected to sell at least a couple hundred of clothing. Unsure how when I'm constantly behind the cash desk.", "advice": "Talk to your employees for reasons other than doling out work. Encourage a team atmosphere. Yes, I get that sales are a huge thing, but so is employee morale. If that goes down, drive to sell goes down."}, {"title": "Unfriendly and Cold", "text": "Pros Nice co-workers and discount on the clothing Cons Store manager was really rude. They don't train much.", "rating": 1, "pros": "Nice co-workers and discount on the clothing", "cons": "Store manager was really rude. They don't train much.", "advice": null}, {"title": "Large demand", "text": "Pros Pay well great base hours Cons Was feast or famon when it came to product", "rating": 5, "pros": "Pay well great base hours", "cons": "Was feast or famon when it came to product", "advice": null}, {"title": "Excellent Company", "text": "Pros Good work/life balance, great people, upper management is excellent Cons pay is ok, could be better. Not a lot of room for growth", "rating": 5, "pros": "Good work/life balance, great people, upper management is excellent", "cons": "pay is ok, could be better. Not a lot of room for growth", "advice": null}, {"title": "Great", "text": "Pros Great advancement opportunities Supportive culture as long as you participate in it. You have a voice and are not just a number Cons Tough segment of retail to be in while the economy is uncertain. You must be mindful of work life balance. You are in charge of that.", "rating": 5, "pros": "Great advancement opportunities", "cons": "Tough segment of retail to be in while the economy is uncertain.", "advice": null}, {"title": "Store Manager", "text": "Pros excellent training. great communication between head office and stores Cons extremely high expectations for operating hours,", "rating": 5, "pros": "excellent training. great communication between head office and stores", "cons": "extremely high expectations for operating hours,", "advice": null}, {"title": "Assistant Manager", "text": "Pros Great teamwork Head Office employees are always there to help Cons Need a better benefits plan Advice to Management Need more incentives for employees", "rating": 3, "pros": "Great teamwork", "cons": "Need a better benefits plan", "advice": "Need more incentives for employees"}, {"title": "Good management, good Culture, Flexibility", "text": "Pros Fashion world, Deal with new customers Cons Friendly environment, lots of thing to learn Advice to Management Give opportunity for growing", "rating": 5, "pros": "Fashion world, Deal with new customers", "cons": "Friendly environment, lots of thing to learn", "advice": "Give opportunity for growing"}, {"title": "It was okay", "text": "Pros -Learn a lot about sales Cons -Need to hire more people to take on work load -Better treatment needed", "rating": 3, "pros": "-Learn a lot about sales", "cons": "-Need to hire more people to take on work load", "advice": null}, {"title": "good company", "text": "Pros depending on the location you work at, mine has very nice coworkers. everyone is very caring. Cons even though you are given goals, you don't get commission. we should be at least be given some form of incentive to make our targets for each shift. Advice to Management please come up with some sort of incentive for reaching our targets/goals, and not just give us cleo cash for sales of more than $500. not everyone wants to buy from cleo, even if you work there.", "rating": 5, "pros": "depending on the location you work at, mine has very nice coworkers. everyone is very caring.", "cons": "even though you are given goals, you don't get commission. we should be at least be given some form of incentive to make our targets for each shift.", "advice": "please come up with some sort of incentive for reaching our targets/goals, and not just give us cleo cash for sales of more than $500. not everyone wants to buy from cleo, even if you work there."}, {"title": "Company sacrifices quality to make a buck", "text": "Pros The location where i worked was filled with fabulous people who were good at and had fun with their jobs. actual store level employees are absolutely NOT the problem Cons Quality is nowhere near a top concern, if product is damaged when it is received its still put out for customers to buy. the buyers seem to buy willy-nilly with no concern for the quality of the work, the fit or the fabric. The way product comes in is disastrous for the environment, items are double and triple bagged. its nearly impossible to get a raise no matter how hard you work. there are too many corporate employees, at times it seems that anyone in the home office who actually has specific responsibilities has an assistant who has an assistant. no credit is given where credit is due. promotions are promised again and again to keep \"valued\" associates from quitting but are rarely followed through on. store level management is always being restructured. Advice to Management Open your eyes and look at all the talent you have in your stores. If you truly want us to keep making money in the long run, give those people what they deserve and you will be rewarded by their hard work.", "rating": 3, "pros": "The location where i worked was filled with fabulous people who were good at and had fun with their jobs. actual store level employees are absolutely NOT the problem", "cons": "Quality is nowhere near a top concern, if product is damaged when it is received its still put out for customers to buy. the buyers seem to buy willy-nilly with no concern for the quality of the work, the fit or the fabric. The way product comes in is disastrous for the environment, items are double and triple bagged. its nearly impossible to get a raise no matter how hard you work. there are too many corporate employees, at times it seems that anyone in the home office who actually has specific responsibilities has an assistant who has an assistant. no credit is given where credit is due. promotions are promised again and again to keep \"valued\" associates from quitting but are rarely followed through on. store level management is always being restructured.", "advice": "Open your eyes and look at all the talent you have in your stores. If you truly want us to keep making money in the long run, give those people what they deserve and you will be rewarded by their hard work."}, {"title": "Enviroment is very good", "text": "Pros it's a good enviroment to work in. OK employee discount. Very flexible if you need a few days off, unpaid of course, but a lot of flexibility. You don't deal with a lot of crazy customers, 90% of them are very polite. Cons No too much room fo growth. Company seems not to care much for good employees. Not a good sale structure bonus or competitions, they seem poor and not exciting enough to give that extra push for its employees to go a bit further on sales.", "rating": 3, "pros": "it's a good enviroment to work in.", "cons": "No too much room fo growth.", "advice": null}, {"title": "A very good experience, they work to give you ownership of your position and your store", "text": "Pros Help you to take ownership of your store, take pride in your store and staff. Great manager meetings several times of the year so you can meet other managers from different stores in different provinces. Fun presentation of new season fashions made to the managers to take back and present to the staff. The owners of the store made stops into the store and were very hands on with management and staff. A great place to work, fun fashion, fun people, good staff discounts. Cons Mall hours/working stats etc. Just the usual staffing issues you would find in any store in any mall. No overtime for management, salaried employees, can work you lots, but do try to give you time for your time. The usual, in any clothing store, targets to make, can get to be a bit hard on the staff, pitting them against each other,although they wouldn't describe it as such, it is to challenge the staff. Advice to Management I would ask that the buyers have practical on the floor experience, so they know what the normal woman is looking for in fashion. Many times some of the new arrivals you knew were destined to be sell offs at discount, because of the personal taste of the buyer.This applies to all women's fashion outlets not just Cleo, as you will notice that you see the same or very much the same designs/color stories on many of the competitors racks. Looks like they are buying at the same place to fill their stores. Now you are only one upping by price, not creating the individual look most women want when shopping for clothing and accessories.", "rating": 5, "pros": "Help you to take ownership of your store, take pride in your store and staff.", "cons": "Mall hours/working stats etc. Just the usual staffing issues you would find in any store in any mall.", "advice": "I would ask that the buyers have practical on the floor experience, so they know what the normal woman is looking for in fashion. Many times some of the new arrivals you knew were destined to be sell offs at discount, because of the personal taste of the buyer.This applies to all women's fashion outlets not just Cleo, as you will notice that you see the same or very much the same designs/color stories on many of the competitors racks. Looks like they are buying at the same place to fill their stores. Now you are only one upping by price, not creating the individual look most women want when shopping for clothing and accessories."}]