[{"title": "special place", "text": "Pros Cockroach considers each person's perspective, making you a contributor to all aspects of the companies success. Cons at a loss on this one", "rating": 5, "pros": "Cockroach considers each person's perspective, making you a contributor to all aspects of the companies success.", "cons": "at a loss on this one", "advice": null}, {"title": "revolutionary company", "text": "Pros - Great open source project - Great team - running a big revolution to shake up databases Cons - startup company with some risk", "rating": 5, "pros": "- Great open source project", "cons": "- startup company with some risk", "advice": null}, {"title": "Great place to work!", "text": "Pros Greatly value the product as well as the people that make Cockroach Labs such an amazing place to work. An additional factor is the founders. All three founders come from a history of contributing to the open source world – two of the founders created the GIMP from their dorm room in 1995. This lends to a culture that is open, transparent, where individuals can self-manage and are held accountable for the work they do. Also, solid work/life balance with dedicated 20% time called Free Fridays. Cons No downsides at this time. Advice to Management Management is doing a great job in ensuring that they are open and transparent with communication. Continue to share and listen to your employees as we grow. It's a component that we all value!", "rating": 5, "pros": "Greatly value the product as well as the people that make Cockroach Labs such an amazing place to work. An additional factor is the founders. All three founders come from a history of contributing to the open source world – two of the founders created the GIMP from their dorm room in 1995. This lends to a culture that is open, transparent, where individuals can self-manage and are held accountable for the work they do. Also, solid work/life balance with dedicated 20% time called Free Fridays.", "cons": "No downsides at this time.", "advice": "Management is doing a great job in ensuring that they are open and transparent with communication. Continue to share and listen to your employees as we grow. It's a component that we all value!"}, {"title": "Excellent startup in all ways", "text": "Pros Top-notch engineers building important products. Truly open and constructive culture. Lots of autonomy and opportunity to learn and make a serious impact. Cons For a startup of this size, no cons.", "rating": 5, "pros": "Top-notch engineers building important products. Truly open and constructive culture. Lots of autonomy and opportunity to learn and make a serious impact.", "cons": "For a startup of this size, no cons.", "advice": null}]