[{"title": "Great company to work for.", "text": "Pros Company truck, people are down to earth, family oriented business really want people to stay with the company. Yearly raises and bonus. Cons On-call on some weekends. This company is an emergency leak repair company for the refinery industry so they never close down. Advice to Management Keep doing what your doing!", "rating": 5, "pros": "Company truck, people are down to earth, family oriented business really want people to stay with the company. Yearly raises and bonus.", "cons": "On-call on some weekends. This company is an emergency leak repair company for the refinery industry so they never close down.", "advice": "Keep doing what your doing!"}, {"title": "Quality Analysts", "text": "Pros Work life balance and great benefits Cons The are no cons to be discussed here Advice to Management great job", "rating": 5, "pros": "Work life balance and great benefits", "cons": "The are no cons to be discussed here", "advice": "great job"}, {"title": "Colt", "text": "Pros Great place to work and good environment. Cons Complex structure and slow moving Advice to Management Nothing", "rating": 5, "pros": "Great place to work and good environment.", "cons": "Complex structure and slow moving", "advice": "Nothing"}, {"title": "Stick to Europe", "text": "Pros Great fibre network in Europe. Good portfolio of network services. Cons Service Delivery/Support lacks communications to end client post sale. Allows everyone in the chain to look bad. UK support hour only. Advice to Management Beef up communication to all customers worldwide and extend support hours to 24x7.", "rating": 3, "pros": "Great fibre network in Europe. Good portfolio of network services.", "cons": "Service Delivery/Support lacks communications to end client post sale. Allows everyone in the chain to look bad. UK support hour only.", "advice": "Beef up communication to all customers worldwide and extend support hours to 24x7."}, {"title": "salesmanager", "text": "Pros big raises and six figure bonuses Cons they require constant updates about your personal life Advice to Management none at this time", "rating": 5, "pros": "big raises and six figure bonuses", "cons": "they require constant updates about your personal life", "advice": "none at this time"}, {"title": "Sales - EMEA", "text": "Pros Fantastic pension, some great colleagues and excellent communication from the company. Social side is great and respected by the firm. Cons Far too many reorgs. Senior management often lacking in original thought. Latest reorg has created a silo'd environment and will have to be resolved by yet another reorg in a couple of quarters. Advice to Management Stop carrying our reorgs, they destroy morale and create a more confused, process driven business.", "rating": 3, "pros": "Fantastic pension, some great colleagues and excellent communication from the company. Social side is great and respected by the firm.", "cons": "Far too many reorgs. Senior management often lacking in original thought. Latest reorg has created a silo'd environment and will have to be resolved by yet another reorg in a couple of quarters.", "advice": "Stop carrying our reorgs, they destroy morale and create a more confused, process driven business."}, {"title": "like in games of thrones", "text": "Pros well paid, good benefits, nothing more to add Cons confusing management choices. business units are one against the other incompetence form the management. Advice to Management listen to the employees, stop beeing obsessed in apparence and not in talent.", "rating": 1, "pros": "well paid, good benefits, nothing more to add", "cons": "confusing management choices. business units are one against the other incompetence form the management.", "advice": "listen to the employees, stop beeing obsessed in apparence and not in talent."}, {"title": "software Engineer", "text": "Pros work life balance, ample opportunities to learn and grow Cons changes in senior management and dicisions Advice to Management NA", "rating": 5, "pros": "work life balance, ample opportunities to learn and grow", "cons": "changes in senior management and dicisions", "advice": "NA"}, {"title": "Great top management", "text": "Pros The board are almost all really great people. Clever and approachable Cons Middle management can be weak. Advice to Management Ask more questions.", "rating": 3, "pros": "The board are almost all really great people. Clever and approachable", "cons": "Middle management can be weak.", "advice": "Ask more questions."}, {"title": "Neither the best nor the worst company", "text": "Pros Good exposure to technology Free transportation and food Cons No job security - Even when a division is profitable, the company do fire employees as part of cost cutting Poor work life balance (this depends entirely on your manager and the team you are part of)", "rating": 3, "pros": "Good exposure to technology", "cons": "No job security - Even when a division is profitable, the company do fire employees as part of cost cutting", "advice": null}, {"title": "Good", "text": "Pros work life balance is good. Cons Too many changes in management Too much redundant employees Advice to Management NA", "rating": 3, "pros": "work life balance is good.", "cons": "Too many changes in management", "advice": "NA"}, {"title": "Service Manager", "text": "Pros Always busy in an environment where you cannot stand still if you want to get ahead. Cons Process issues can frustrate, as can the constant changes.", "rating": 3, "pros": "Always busy in an environment where you cannot stand still if you want to get ahead.", "cons": "Process issues can frustrate, as can the constant changes.", "advice": null}, {"title": "Network Engineer", "text": "Pros Good manager and good culture. Cons Most of the operation is manual. Using not good product.", "rating": 5, "pros": "Good manager and good culture.", "cons": "Most of the operation is manual.", "advice": null}, {"title": "not for opinionated people", "text": "Pros good benefits, good salaries, conveniently located offices Cons horrible company culture, internal bullying by teamleaders and managers, friends being promoted over best qualifications, likes \"yes-men and -women\" Advice to Management listen to the people, don´t send out surveys and then those with negative feedback / bury the results", "rating": 1, "pros": "good benefits, good salaries, conveniently located offices", "cons": "horrible company culture, internal bullying by teamleaders and managers, friends being promoted over best qualifications, likes \"yes-men and -women\"", "advice": "listen to the people, don´t send out surveys and then those with negative feedback / bury the results"}, {"title": "Colt Technology London", "text": "Pros good products, strong exec level management, financially secure, due to being owned by Fidelity. Decent new offices located in Shoreditch, fair sales targets, decent commission plan Cons nothing more than any other mid size company with legacy systems, and a few jobsworths Advice to Management keep focusing on core strengths, slow down on new business sales recruiting, we have too many", "rating": 5, "pros": "good products, strong exec level management, financially secure, due to being owned by Fidelity. Decent new offices located in Shoreditch, fair sales targets, decent commission plan", "cons": "nothing more than any other mid size company with legacy systems, and a few jobsworths", "advice": "keep focusing on core strengths, slow down on new business sales recruiting, we have too many"}, {"title": "Best at Colt", "text": "Pros One of the best company who gives good life style balance Cons Hope the company is trying level best to get to next level and wishing not to fail", "rating": 5, "pros": "One of the best company who gives good life style balance", "cons": "Hope the company is trying level best to get to next level and wishing not to fail", "advice": null}, {"title": "Graduate Experience at Colt", "text": "Pros People - everyone is friendly, knowledgeable and driven to achieve both individually and company wide. Leadership - The exec leadership team sit 5 levels above me, and I am a graduate. They are always open to discussion and ideas which is something I personally love. Strategy - Our strategy is driven into us and everyone works towards it. A good example is our drive to increase our NPS score which we have, to be the highest Telco! Growth - The company is growing which is exciting, but it also means there are opportunities to grow your career as an individual with many internal recruitment opportunities. Cons None for me, I enjoy what I do!", "rating": 5, "pros": "People - everyone is friendly, knowledgeable and driven to achieve both individually and company wide.", "cons": "None for me, I enjoy what I do!", "advice": null}, {"title": "Account Manager", "text": "Pros Solid network base, nice local people, fair salary package Cons Overly complicated structure, politically driven management Advice to Management Review and address where you can spare on resources and where you shouldn't (eg support...)", "rating": 3, "pros": "Solid network base, nice local people, fair salary package", "cons": "Overly complicated structure, politically driven management", "advice": "Review and address where you can spare on resources and where you shouldn't (eg support...)"}, {"title": "Worst company to work", "text": "Pros Good work life balance,benefits are good Cons No guarantee on job , company will fire at any time, without any reason Advice to Management NA", "rating": 1, "pros": "Good work life balance,benefits are good", "cons": "No guarantee on job , company will fire at any time, without any reason", "advice": "NA"}, {"title": "It was one of good company", "text": "Pros Good Salary free food free cab Extra allowance apart from CTC Cons NO JOB SECURITY No Onsite No Good Management No Proper utilisation of resource or purchased License. Indian mentality management -only cost saving agenda Advice to Management Try to expand Colt not go for sell colt. Dont save cost by firing Employees( works more then 12 + years)", "rating": 1, "pros": "Good Salary", "cons": "NO JOB SECURITY", "advice": "Try to expand Colt not go for sell colt."}, {"title": "Its degrading day by day.", "text": "Pros A lot of hands on experience and opportunities. Good Salary. Good employee benefits. Work Life balance. Cons Too much and too many organizational changes.", "rating": 3, "pros": "A lot of hands on experience and opportunities.", "cons": "Too much and too many organizational changes.", "advice": null}, {"title": "No Guarantee on your Job", "text": "Pros Good work life balance and leave policy. Cons No IT Process Volatile decisions not looking at long term. No Guarantee on Job they will terminate with in an hour. Need to work many technologies as project changes their decisions quickly with out employee concern. Advice to Management Please hire good quality vendor for food.", "rating": 1, "pros": "Good work life balance and leave policy.", "cons": "No IT Process", "advice": "Please hire good quality vendor for food."}, {"title": "Good Company to work", "text": "Pros Good Salary & Bonus structure.. Cons Not a good Higher Management Advice to Management ..", "rating": 5, "pros": "Good Salary & Bonus structure..", "cons": "Not a good Higher Management", "advice": ".."}, {"title": "Technical Analyst in Barcelona - Customer Service", "text": "Pros Great career and training opportunities if you work hard. Cons You need to be tech-savy to work here Advice to Management Focus more on daily/weekly recognition. Small details matter.", "rating": 5, "pros": "Great career and training opportunities if you work hard.", "cons": "You need to be tech-savy to work here", "advice": "Focus more on daily/weekly recognition. Small details matter."}, {"title": "Great Exposure", "text": "Pros Employee Friendly Organisation, Multi Country Exposure Cons The environment is Constantly Changing Advice to Management Its almost 5 years I left Colt, so no Advice to current Management", "rating": 5, "pros": "Employee Friendly Organisation, Multi Country Exposure", "cons": "The environment is Constantly Changing", "advice": "Its almost 5 years I left Colt, so no Advice to current Management"}, {"title": "Telecoms/ Tech company review", "text": "Pros Unfortunately, due to lack of career opportunities I left but decided to write this review so others can learn from my experience over the past 11 years working at Colt A lot of your experience will be determined by those around …  you rather than the company as a whole. Colt predominantly focuses on the UK and EU customers and more recently Asia -------------------------------------------------------------- I worked in the UK, London Office Carl Grivner, CEO. He knows what he is doing, comes across as humble and has sensible plans. they are certainly working hard to have a diverse set of people to work for the company unfortunately they are losing the skills and experience of employees replacing new for old (recruiting interns/ grads and slowly and quietly making employees who have been around for 7+ years redundant) which is clever if you think about it paying a lot less and saving money for the business. He Also emphasizes that Colt has a role to play in society with the work they do around CSR which was actually something that was started by the previous CEO Rakesh Bhasin Learn on the job. You don’t need to be up to your eye balls in fancy qualifications to do most of the jobs. teams are so varied you have to just have a good attitude and work hard to get it. Diversity. People don’t care about your background, ethnicity or anything like that – it’s what you bring to the table Work Hours are flexible and you can work from home depending on your role The People. On the whole they are a nice bunch of people to work with. They are always busy but are approachable and you will often find one person having multiple roles Work Environment. It’s quite good to be fair, they have invested heavily in a new office (in London) and more up to date equipment (Laptops) Cons Okay, so now you know about Colt it’s become apparent that it is very hard to climb the corporate ladder. Each company has its own large hierarchy with hundreds of people working for it; due to the numbers involved it is often the case of not what you do but rather “who” you know which will allow you to progress. You can get someone incredibly talented at but will never get chance to move up and really shine due to the odds against them – this means that good people leave as they aren’t progressing as quickly as could have been. Based on what I’ve seen people usually leave the firm after 1-2 years (sometimes just after 1 year) at lower levels as it dawns on them that you are playing a numbers game. Politics. Okay, I’ve yet to work for any company where people don’t play politics; it’s a fact of life. Unfortunately I feel that those that have made it to pretty good positions (VP, Director level) are reluctant to do good job and end up falling into the politics game. I hear very senior people saying “work together as one company” but in reality in each team managers are playing politics and looking after their own interests. No one from very high up ever visits the ‘ground troops’ and so they are out of touch of what it’s like back on the floor (I assume they are always in important meetings being told everything is fine). Pay and bonuses. I said this a few years ago and it’s still the same – unless you are one of the lucky few forget about being handed a cheque with a long number on it. Those days are well and truly over….infact they never existed in Colt Sure, some lucky senior people will get a big reward but most of us are just well paid grunts. Speaking of which the pay is not amazing, however when you work it out per hour it’s honestly not above and beyond any other place. My contract states my working hours are 9-5. Every day I work 08:30 – 18:30, which is alright (it used to be a lot worse 3 years ago!). I don’t get rewarded for all those extra hours though so it makes my bonus almost insulting each year. Every year people go into “the room” expecting to be told you’ve just got a big fat pay check and every year you get told “here is your 0.5% pay rise and £100 bonus”. G Annual reviews. Seriously – there isn’t any point if I’m honest. There isn’t a structured career path for most to take. It’s like most jobs – take your seat, work hard based on your role, think outside the box by making stuff better and learn some things along the way. There isn’t anything I’m aware of where they have a structured career path, despite HR making out there is such a thing. My manager is woeful at best; it’s like taking career advice from a fast food manager with politics thrown into the mix. Leadership. Same as everywhere else I’ve been. Lots of managers but not natural leaders. A lot of managers are not real leaders, despite what they view themselves as; happy to delegate and be the chief getting paid the most but somehow avoid listening to concerns, helping nurture talent, provide knowledge to those below, working with other teams. Usually a case of “I’m in charge do what I say” rather than “I have something to teach”. Pigeon Holed. People feel like they are stuck in certain roles and are not given the chance to move. A complete “us and them” attitude – both don’t know what is really involved by either side. You made it! Now you can read about that dreaded one star rating that makes you question if the whole company is rotten to the core (it’s not; it’s down to who you end up working with, promise). :)Show Less Advice to Management Advice to Management Take the time to go back to the grass roots - there are lots of rough diamonds that are being hidden by a political layer of middle managers. A lot of these people are being lost as they never get a chance to shine.", "rating": 1, "pros": "Unfortunately, due to lack of career opportunities I left but decided to write this review so others can learn from my experience over the past 11 years working at Colt", "cons": "Okay, so now you know about Colt it’s become apparent that it is very hard to climb the corporate ladder. Each company has its own large hierarchy with hundreds of people working for it; due to the numbers involved it is often the case of not what you do but rather “who” you know which will allow you to progress. You can get someone incredibly talented at but will never get chance to move up and really shine due to the odds against them – this means that good people leave as they aren’t progressing as quickly as could have been. Based on what I’ve seen people usually leave the firm after 1-2 years (sometimes just after 1 year) at lower levels as it dawns on them that you are playing a numbers game.", "advice": "Advice to Management"}, {"title": "slow growth and old folks away from current technologies", "text": "Pros Free cab , free meals, work life balance Cons appraisals even for a <3 yrs exp ranges in 5%-10%. Even for 10 years exp who are working as Tech lead or lead analyst have salary range around 1M that is very low as per the market trends right now. No one knows even about automation , forgot about analytics. Senior jealous when you learn new high tech. Advice to Management There is nothing is your hand right now and Colt is falling apart. It is a company best fit for retirement.", "rating": 3, "pros": "Free cab , free meals, work life balance", "cons": "appraisals even for a <3 yrs exp ranges in 5%-10%. Even for 10 years exp who are working as Tech lead or lead analyst have salary range around 1M that is very low as per the market trends right now.", "advice": "There is nothing is your hand right now and Colt is falling apart. It is a company best fit for retirement."}, {"title": "worst company in world", "text": "Pros food was free at my time night allowances Cons managment is very happy to come to know about your personal life hr is not responsive team leads are dumps or worst don't join colt join any where in world i gave officially resign but they did not accept that's why i take a legal action on company Advice to Management management is need to understand what employee want. management should understand from employee company is running if good employee left so any thing happens. but here in colt management in god as they understand ....", "rating": 1, "pros": "food was free at my time", "cons": "managment is very happy to come to know about your personal life", "advice": "management is need to understand what employee want."}, {"title": "Enjoy working there", "text": "Pros Pay well.....and there is an opportunity to earn money, they have a strategy which does seem to be working. Good bunch of people there as well. Pension is very good Cons Everything is London not that flexible on location, limited portfolio and not very uk focused in terms of the offerings which is a down side", "rating": 5, "pros": "Pay well.....and there is an opportunity to earn money, they have a strategy which does seem to be working. Good bunch of people there as well. Pension is very good", "cons": "Everything is London not that flexible on location, limited portfolio and not very uk focused in terms of the offerings which is a down side", "advice": null}, {"title": "Best", "text": "Pros Learning environment process oriented company Cons No negative about this company Advice to Management Keep it up team.", "rating": 5, "pros": "Learning environment process oriented company", "cons": "No negative about this company", "advice": "Keep it up team."}, {"title": "Colt on my view", "text": "Pros Its a good Company to work, Good culture, and employee friendly. You gets the option to work from home as well. cab facilities are available as well. Having a good work life balance. Cons Less options to learn new things.", "rating": 5, "pros": "Its a good Company to work, Good culture, and employee friendly. You gets the option to work from home as well. cab facilities are available as well. Having a good work life balance.", "cons": "Less options to learn new things.", "advice": null}, {"title": "Infrastructure architect", "text": "Pros Good working condition Work life balance Cons Innovative products lacking and less services and product portfolio Advice to Management Increase product portfolio and quick time to market", "rating": 5, "pros": "Good working condition", "cons": "Innovative products lacking and less services and product portfolio", "advice": "Increase product portfolio and quick time to market"}, {"title": "Confused with direction and strategy", "text": "Pros Good salary and flexible working environment Cons 1) Senior management seems to be confused about the strategy and direction so there are always changes and restructures \"Hire and Fire\" i have been here short while and have seen 3-4 restructures. So if job security is paramount for you then don't work for colt.... 2) Too many ex BT in senior positions and they keep each other protected - the \"inner circle\" sort of thing Advice to Management Please think about a firm strategy and stick to it. When you hire people invest in them and keep them onboard through ups and downs rather than just throwing them out as and when things change - so much for being \"Agile\". Too many expansion programmes without a clear picture on ROI which tells me Fidelity is going to pull the plug anytime", "rating": 1, "pros": "Good salary and flexible working environment", "cons": "1) Senior management seems to be confused about the strategy and direction so there are always changes and restructures \"Hire and Fire\" i have been here short while and have seen 3-4 restructures. So if job security is paramount for you then don't work for colt....", "advice": "Please think about a firm strategy and stick to it. When you hire people invest in them and keep them onboard through ups and downs rather than just throwing them out as and when things change - so much for being \"Agile\". Too many expansion programmes without a clear picture on ROI which tells me Fidelity is going to pull the plug anytime"}, {"title": "Great company", "text": "Pros Flexible working time, very good teams Cons Too many platforms and processes for similar tasks", "rating": 3, "pros": "Flexible working time, very good teams", "cons": "Too many platforms and processes for similar tasks", "advice": null}, {"title": "Good company", "text": "Pros Salary Colt offers is good. Cons There are no major cons as per se. Advice to Management Be actively engaged with each member.", "rating": 5, "pros": "Salary Colt offers is good.", "cons": "There are no major cons as per se.", "advice": "Be actively engaged with each member."}, {"title": "Good Company", "text": "Pros Lets your prove yourself.. Good package offered. Cons Not applicable - so far the experience has been good", "rating": 5, "pros": "Lets your prove yourself.. Good package offered.", "cons": "Not applicable - so far the experience has been good", "advice": null}, {"title": "Positive progress in culture, structure and strategy - a good place to work.", "text": "Pros I enjoy working at Colt, and throughout my 4+ years here I have seen some meaningful and lasting positive change. It feels now that the company has the right leadership in place, a transparent strategy, the right culture has been established, and the outlook is optimistic with clear plans for growth (this was not the case when I joined). Over the last couple of years Colt has done several things to demonstrate that it is moving away from the traditional, tired telecoms image and moving into the 21st century: the new head office building in London has had a hugely positive impact on the culture (and refurbished offices in overseas locations), the appointment of females into some leadership positions has demonstrated that this is a forward thinking company and upgrading the branding and online presence and initiatives has improved the external image. I have been given the opportunity to grow my career in colt, having had 3 positions and each being a development for my career. I would recommend working here to anyone who wants the opportunity to step up and to challenge the status quo. If you are looking for a role in a team where you can fly under the radar this isn’t the place for you! Cons Systems and processes mirror that of a much larger company and you wouldn't expect this from a 4-5k employee business, although this is a known fact and improvements are being made. Advice to Management Continue to work on simplifying processes, systems and policies.", "rating": 5, "pros": "I enjoy working at Colt, and throughout my 4+ years here I have seen some meaningful and lasting positive change. It feels now that the company has the right leadership in place, a transparent strategy, the right culture has been established, and the outlook is optimistic with clear plans for growth (this was not the case when I joined). Over the last couple of years Colt has done several things to demonstrate that it is moving away from the traditional, tired telecoms image and moving into the 21st century: the new head office building in London has had a hugely positive impact on the culture (and refurbished offices in overseas locations), the appointment of females into some leadership positions has demonstrated that this is a forward thinking company and upgrading the branding and online presence and initiatives has improved the external image.", "cons": "Systems and processes mirror that of a much larger company and you wouldn't expect this from a 4-5k employee business, although this is a known fact and improvements are being made.", "advice": "Continue to work on simplifying processes, systems and policies."}, {"title": "Hired and dismissed due to redundancy", "text": "Pros Good compensation, as long as you have enough luck to keep your position. Cons Dismissal even before hiring due to internal transition/transformation, and positions becoming redundant. Advice to Management Better planning, more responsibility ...", "rating": 1, "pros": "Good compensation, as long as you have enough luck to keep your position.", "cons": "Dismissal even before hiring due to internal transition/transformation, and positions becoming redundant.", "advice": "Better planning, more responsibility ..."}, {"title": "Good company to work for overall", "text": "Pros Casual dress code, possibility to work remotely from home or other locations, relaxed atmosphere, good company events: i.e: charity events, parties, options for training. Cons Salaries not that high, a lot of politics. Advice to Management Management should be selected and reviewed more carefully", "rating": 5, "pros": "Casual dress code, possibility to work remotely from home or other locations, relaxed atmosphere, good company events: i.e: charity events, parties, options for training.", "cons": "Salaries not that high, a lot of politics.", "advice": "Management should be selected and reviewed more carefully"}, {"title": "Great company", "text": "Pros The colt team, Pension plan and Location you can visit Cons When I worked there it was truly a great place to be so I have to say NONE Advice to Management Your team is everything, treat them well", "rating": 3, "pros": "The colt team, Pension plan and Location you can visit", "cons": "When I worked there it was truly a great place to be so I have to say NONE", "advice": "Your team is everything, treat them well"}, {"title": "Perfect place to grow and work", "text": "Pros good environment and work place Cons cannot see any cons as can see every thing positive around Advice to Management Keep evolving with new technologies and challenges.", "rating": 5, "pros": "good environment and work place", "cons": "cannot see any cons as can see every thing positive around", "advice": "Keep evolving with new technologies and challenges."}, {"title": "Senior Director", "text": "Pros Great people with great values Cons Continuous Cost pressure and organisational changes Advice to Management Listen to your staff", "rating": 3, "pros": "Great people with great values", "cons": "Continuous Cost pressure and organisational changes", "advice": "Listen to your staff"}, {"title": "Colt pros and vs", "text": "Pros Salary, bonus, nice colleagues, remote work Cons Incompetent line management, cronyism, changes for the sake of changing, really bad way to deal with communication and changes: changes are not ( if at all) communicate clearly and mainly are keep as closed information available only to some subjects /groups (read \"friends of the boss\") generating insecurity to the rest of the people. Advice to Management Improve clarity and fairness in the promotion system and communication with employees", "rating": 3, "pros": "Salary, bonus, nice colleagues, remote work", "cons": "Incompetent line management, cronyism, changes for the sake of changing, really bad way to deal with communication and changes: changes are not ( if at all) communicate clearly and mainly are keep as closed information available only to some subjects /groups (read \"friends of the boss\") generating insecurity to the rest of the people.", "advice": "Improve clarity and fairness in the promotion system and communication with employees"}, {"title": "Good work environment, no stress", "text": "Pros Very good work environment, young and dynamic Cons Based on my experience and compaired to other organizations I can't remember at the moment any particular con for this company. You do your job, you have the tools to do it and you leave on time everyday.", "rating": 5, "pros": "Very good work environment, young and dynamic", "cons": "Based on my experience and compaired to other organizations I can't remember at the moment any particular con for this company. You do your job, you have the tools to do it and you leave on time everyday.", "advice": null}, {"title": "Fun but flawed", "text": "Pros Big strategy change. Exciting times. New management team promising. Great offices. Cool location. Great people. Not many slackers. Cons Redundancies are managed very poorly. I have not been made redundant, so this is not sour grapes. I have seen colleagues around me leave. Their departure was very poorly managed to point of being liable. Advice to Management Don't forget the workers! The business strategy needs to match roles put at risk. At the moment they do not.", "rating": 3, "pros": "Big strategy change. Exciting times. New management team promising. Great offices. Cool location. Great people. Not many slackers.", "cons": "Redundancies are managed very poorly. I have not been made redundant, so this is not sour grapes. I have seen colleagues around me leave. Their departure was very poorly managed to point of being liable.", "advice": "Don't forget the workers! The business strategy needs to match roles put at risk. At the moment they do not."}, {"title": "Opportunity", "text": "Pros The people, it's a supportive and open culture that wants you to succeed. The business has a sense of energy to drive some real cultural change. The Leadership are visible and engaged with the whole workforce. Cons Complexity around systems and processes can take time to navigate.", "rating": 5, "pros": "The people, it's a supportive and open culture that wants you to succeed. The business has a sense of energy to drive some real cultural change. The Leadership are visible and engaged with the whole workforce.", "cons": "Complexity around systems and processes can take time to navigate.", "advice": null}, {"title": "Enterprise Sales", "text": "Pros Great culture within Colt. Senior management team are fantastic, approachable and engage with all employees in order to improve Colt as a company. Reputation amongst customers and within the industry combined with a fantastic product set make for a fantastic company to work in sales for. Cons Although a flexible working scheme is in place, it's certainly not the most flexible I've seen. Having said this the offices are fantastic which compensate this slightly. Advice to Management Keep innovating and keep providing employees the chance to engage and help shape Colt.", "rating": 5, "pros": "Great culture within Colt. Senior management team are fantastic, approachable and engage with all employees in order to improve Colt as a company. Reputation amongst customers and within the industry combined with a fantastic product set make for a fantastic company to work in sales for.", "cons": "Although a flexible working scheme is in place, it's certainly not the most flexible I've seen. Having said this the offices are fantastic which compensate this slightly.", "advice": "Keep innovating and keep providing employees the chance to engage and help shape Colt."}, {"title": "Diabolical", "text": "Pros Great network in London and competitive salaries Cons Hire and fire. Terrible off-net strategy. Political culture. Managed by spreadsheet. Inflexible working. Advice to Management Stop managing by spreadsheet and fix the off-net strategy if you truly want to compete.", "rating": 3, "pros": "Great network in London and competitive salaries", "cons": "Hire and fire. Terrible off-net strategy. Political culture. Managed by spreadsheet. Inflexible working.", "advice": "Stop managing by spreadsheet and fix the off-net strategy if you truly want to compete."}, {"title": "Network and Voice services for Europe, Asia and US", "text": "Pros Great people and a challenger culture Good work / life balance with flexible workplace as standard policy Ability to change roles and move forward Cons Processes and systems can get in the way of getting things done Still some pockets of the business are reactive and slow-moving Advice to Management Reward innovation and customer focus, promote those who really deliver but not just in the way they always have. Keep things moving but provide time to review and improve.", "rating": 5, "pros": "Great people and a challenger culture", "cons": "Processes and systems can get in the way of getting things done", "advice": "Reward innovation and customer focus, promote those who really deliver but not just in the way they always have. Keep things moving but provide time to review and improve."}, {"title": "Manager", "text": "Pros Work is challenging and hence learning is high! Cons Job risk is very high.", "rating": 3, "pros": "Work is challenging and hence learning is high!", "cons": "Job risk is very high.", "advice": null}, {"title": "Lead Analyst", "text": "Pros Balance in Professional and Personal Life. Management is very Kind. Cons I have not seen any cons till date. Advice to Management The Management has been always kind to me.", "rating": 5, "pros": "Balance in Professional and Personal Life. Management is very Kind.", "cons": "I have not seen any cons till date.", "advice": "The Management has been always kind to me."}, {"title": "Ideas", "text": "Pros Work life balance, good transport Cons Takes 3 hours in commuting Advice to Management Na", "rating": 5, "pros": "Work life balance, good transport", "cons": "Takes 3 hours in commuting", "advice": "Na"}, {"title": "Work life balancing", "text": "Pros work time is very comfortable Cons Lack of good Leadership", "rating": 3, "pros": "work time is very comfortable", "cons": "Lack of good Leadership", "advice": null}, {"title": "Challenging times", "text": "Pros Work life balance, Talented employees Cons Very political as company not doing well Layoffs and frequent leadership changes (again!) Advice to Management Please stabilize the company Give strategy time", "rating": 1, "pros": "Work life balance, Talented employees", "cons": "Very political as company not doing well", "advice": "Please stabilize the company"}, {"title": "Specialist -Network", "text": "Pros Its a good organization to work Cons Slow working in terms if delivering project Advice to Management No Politics please..", "rating": 5, "pros": "Its a good organization to work", "cons": "Slow working in terms if delivering project", "advice": "No Politics please.."}, {"title": "Exciting Changes!", "text": "Pros Exciting changes happening not only to be the best customer orientated company in the market but also a big focus on internal Culture! Happy to have the chance to work in such a international divers company with good salary & benefits. Cons People who are in the same function for many years and are not willing to change or help find resolutions for their complaints. Advice to Management Keep doing what you are doing, but please keep communicating!", "rating": 5, "pros": "Exciting changes happening not only to be the best customer orientated company in the market but also a big focus on internal Culture! Happy to have the chance to work in such a international divers company with good salary & benefits.", "cons": "People who are in the same function for many years and are not willing to change or help find resolutions for their complaints.", "advice": "Keep doing what you are doing, but please keep communicating!"}, {"title": "Colt Review", "text": "Pros Employee benefits are above market Cons Coordination between departments can help to enhance employee experience Advice to Management NA", "rating": 5, "pros": "Employee benefits are above market", "cons": "Coordination between departments can help to enhance employee experience", "advice": "NA"}, {"title": "Best job I've had", "text": "Pros Great people, office & product. Leadership has improved recently too! Less Steve McClaren and more Brian Clough Cons Some shocking senior management in the past, however this has improved recently. Largely finance driven which can be frustrating. Advice to Management Keep up the good work and promote from within.", "rating": 5, "pros": "Great people, office & product. Leadership has improved recently too! Less Steve McClaren and more Brian Clough", "cons": "Some shocking senior management in the past, however this has improved recently. Largely finance driven which can be frustrating.", "advice": "Keep up the good work and promote from within."}, {"title": "Good Organisation to work with", "text": "Pros Great learning experience and work life balance Cons Employee empowerment could be better", "rating": 5, "pros": "Great learning experience and work life balance", "cons": "Employee empowerment could be better", "advice": null}, {"title": "Great business with great plans", "text": "Pros It's a really great time to join Colt right now. With a new leadership team and renewed strategy the company is really going places. The challenger culture work ethic empowers everyone to drive change across the business no matter what level you work at. Cons None that I can think of Advice to Management Keep doing what you are doing", "rating": 5, "pros": "It's a really great time to join Colt right now. With a new leadership team and renewed strategy the company is really going places. The challenger culture work ethic empowers everyone to drive change across the business no matter what level you work at.", "cons": "None that I can think of", "advice": "Keep doing what you are doing"}, {"title": "Senior software engineer", "text": "Pros Experience was good and nice Cons very unpredictable work environment .Sometimes too busy, sometimes too laid back.", "rating": 5, "pros": "Experience was good and nice", "cons": "very unpredictable work environment .Sometimes too busy, sometimes too laid back.", "advice": null}, {"title": "KVH (Colt) is what you make of it", "text": "Pros They paid for my training and due to fairly regular turnover, there were chances to move from one department to another. I liked my immediate managers and thought they were generally on-the-ball and good people to learn from. Cons Frequent changes in senior management meant that there was lots of reorganization going on. The CEO was a bit of a goofball. He and the crew he brought in seemed to just be hanging out until something better came along but in the meanwhile were determined to look busy by dreaming up ill-conceived plans that were more suited to University of Iowa MBAs. Advice to Management Listen to people closer to the customers.", "rating": 5, "pros": "They paid for my training and due to fairly regular turnover, there were chances to move from one department to another. I liked my immediate managers and thought they were generally on-the-ball and good people to learn from.", "cons": "Frequent changes in senior management meant that there was lots of reorganization going on. The CEO was a bit of a goofball. He and the crew he brought in seemed to just be hanging out until something better came along but in the meanwhile were determined to look busy by dreaming up ill-conceived plans that were more suited to University of Iowa MBAs.", "advice": "Listen to people closer to the customers."}, {"title": "Network Architect", "text": "Pros Excellent place to work and prosper. Cons Too many leadership direction shifts. Advice to Management Retain your knowledge assets.", "rating": 5, "pros": "Excellent place to work and prosper.", "cons": "Too many leadership direction shifts.", "advice": "Retain your knowledge assets."}, {"title": "Colt", "text": "Pros Colt is operating in a dynamic environment with a good scale and international footprint which is very motivating. The strategy is good Cons Colt brand is low so it is always a challenge to be visible in a market that is dominated by Orange Advice to Management Colt should strengthen the team spirit in an international environment where the majority of our contacts are via phone", "rating": 5, "pros": "Colt is operating in a dynamic environment with a good scale and international footprint which is very motivating. The strategy is good", "cons": "Colt brand is low so it is always a challenge to be visible in a market that is dominated by Orange", "advice": "Colt should strengthen the team spirit in an international environment where the majority of our contacts are via phone"}, {"title": "I love the work environment and it was my passion to work there.", "text": "Pros Flexible hours of working and good learning opportunities. High work load and new technology help to enrich experience. Cons Salary Market correction not accurate, loveable one get hike irrespective of harworker Advice to Management Please help the one who really want to work and grow with you.", "rating": 5, "pros": "Flexible hours of working and good learning opportunities. High work load and new technology help to enrich experience.", "cons": "Salary Market correction not accurate, loveable one get hike irrespective of harworker", "advice": "Please help the one who really want to work and grow with you."}, {"title": "Account Director", "text": "Pros Great team , great product Set , forward thinking , Challenging Company Cons there are none to speak of Advice to Management Keep going", "rating": 5, "pros": "Great team , great product Set , forward thinking , Challenging Company", "cons": "there are none to speak of", "advice": "Keep going"}, {"title": "Company", "text": "Pros Great initiatives launched, trendy new offices and some very talented and creative employees Cons New wave of management are only number driven and lack integrity. Many people operating with personal agendas. Too many vacancies are filled externally rather than using home grown talent Advice to Management Understand the complexities and make decisions based on facts. Remember employees are your principal resource.", "rating": 3, "pros": "Great initiatives launched, trendy new offices and some very talented and creative employees", "cons": "New wave of management are only number driven and lack integrity.", "advice": "Understand the complexities and make decisions based on facts. Remember employees are your principal resource."}, {"title": "A telecom with investment and ambition", "text": "Pros Excellent European and Asian infrastructure Investing heavily in sales resource and assets Challenging itself to change Credible leadership Cons Ambition equals challenge and no business changes easily so you need resolve Needs to simplify its processes and systems, which is in development, but will take time Advice to Management Continue to review strategy, align with the market and focus to ensure execution of the investment delivers solid returns for employees and share holders", "rating": 5, "pros": "Excellent European and Asian infrastructure", "cons": "Ambition equals challenge and no business changes easily so you need resolve", "advice": "Continue to review strategy, align with the market and focus to ensure execution of the investment delivers solid returns for employees and share holders"}, {"title": "Great People", "text": "Pros The people make Colt, without the good support it would just be like any other company. Cons Too many 'confidential information' even though we are now one of our challenge culture levers is Transparency Advice to Management Don;t just think about cost saves all the time", "rating": 3, "pros": "The people make Colt, without the good support it would just be like any other company.", "cons": "Too many 'confidential information' even though we are now one of our challenge culture levers is Transparency", "advice": "Don;t just think about cost saves all the time"}, {"title": "Shafted", "text": "Pros I struggle to find any reason why I would recommend this company to anyone. It's certainly no longer the company that I joined. Cons No pay rises. Forced in to a role I didn't want to take. Forced to be on call 24x7x365. No TOIL. Had ficve managers on 12 months. My last manager didn't listen to me. Senior mgmt replaced five of my team in Europe with two in India, leaving me to do *all* the hardware maintenance. Advice to Management If you're going to reduce team size, don't reduce them based on one manager's decision, especially when he doesn't know what my team does. An 80% reduction in staffing means things are not going to be fixed.", "rating": 1, "pros": "I struggle to find any reason why I would recommend this company to anyone. It's certainly no longer the company that I joined.", "cons": "No pay rises. Forced in to a role I didn't want to take. Forced to be on call 24x7x365. No TOIL. Had ficve managers on 12 months. My last manager didn't listen to me. Senior mgmt replaced five of my team in Europe with two in India, leaving me to do *all* the hardware maintenance.", "advice": "If you're going to reduce team size, don't reduce them based on one manager's decision, especially when he doesn't know what my team does. An 80% reduction in staffing means things are not going to be fixed."}, {"title": "Best For People who Wants to Learn", "text": "Pros 1. Very Dynamic Company from all the angles - Management, Technology, Finance, Human Resource, Investment, Marketing and Project Management. 2. If you've learning instinct this the best place to Learn and Grow. 3. Great Benefits - Shift allowance, Free 2 times Food, Free Cab Facilities, Internet Reimbursement and option of Out of Office once in a week etc etc... Technology savvy - Up-to the mark with best product running in Market. Salary best in Market. Handsome increment compare to others in Market. Great Vendor Support also for Full Time Employees. Great Year end Parties and outing. Cons - HR Department is the Laziest and worst. Most of the HR guys and consult are always in confusion state. - Bounding among Employees is missing - As every one is busy and in his/her work. - Very rare Fun Activities, so not good for freshers. - No Process and Documentation is available for anything. - Innovation is something which is very Less. - Hell amount of unnecessary tools which actually not required for a single scope of work - ITSR, ITSM and siebel etc etc... Advice to Management Please stream line the processes and stop making unnecessary investments, Look for innovative people.", "rating": 5, "pros": "1. Very Dynamic Company from all the angles - Management, Technology, Finance, Human Resource, Investment, Marketing and Project Management.", "cons": "- HR Department is the Laziest and worst. Most of the HR guys and consult are always in confusion state.", "advice": "Please stream line the processes and stop making unnecessary investments, Look for innovative people."}, {"title": "Great ambitions held back by legacy business", "text": "Pros Amazing metro network assets in more than 40 global cities. Right vision for the future of network services Exceptional CEO Cons Constant leadership changes at top Execution far behind the strategy Legacy business and network is constant distraction from vision Advice to Management stay focused and execute on the vision get control of petty politics and conflicts driven by the past put budget behind innovation", "rating": 3, "pros": "Amazing metro network assets in more than 40 global cities.", "cons": "Constant leadership changes at top", "advice": "stay focused and execute on the vision"}, {"title": "Good work life balance", "text": "Pros - Good Work life balance - Good environment - Relax and do your work.. No pressure of wprk Cons -Nothing new to learn - Old people with narrow minded mine set", "rating": 3, "pros": "- Good Work life balance", "cons": "-Nothing new to learn", "advice": null}, {"title": "Sales", "text": "Pros Company has invested in extensive Pan European Network and Data Centre assets, with recent acquisitions extending reach to Asia & America. Lots of great people working in a matrix organisation, serving customers Cons Withdrawal from IT portfolio. Lack of investment in effective IT infrastructure, which results in complex and inefficient manual working practices, poor customer services. Lack of sales support, distracting direct sales from revenue generating activities Advice to Management Greater focus on customer service, investing in systems to improve working practices. Listen to your employees, who are more aware of business challenges than expensive external consultants", "rating": 3, "pros": "Company has invested in extensive Pan European Network and Data Centre assets, with recent acquisitions extending reach to Asia & America. Lots of great people working in a matrix organisation, serving customers", "cons": "Withdrawal from IT portfolio. Lack of investment in effective IT infrastructure, which results in complex and inefficient manual working practices, poor customer services. Lack of sales support, distracting direct sales from revenue generating activities", "advice": "Greater focus on customer service, investing in systems to improve working practices. Listen to your employees, who are more aware of business challenges than expensive external consultants"}, {"title": "Great atmosphere", "text": "Pros Great bunch of people within Colt which allow you to help out in any way you can, across all functions should you want to. Cons Some management can be very short sighted and only look within their team, missing the bigger picture. Advice to Management Listen to, and help engage with staff when they have advice/ideas, even if you say no, as this helps them feel more welcome, rather than just your robot.", "rating": 5, "pros": "Great bunch of people within Colt which allow you to help out in any way you can, across all functions should you want to.", "cons": "Some management can be very short sighted and only look within their team, missing the bigger picture.", "advice": "Listen to, and help engage with staff when they have advice/ideas, even if you say no, as this helps them feel more welcome, rather than just your robot."}, {"title": "lots of change", "text": "Pros friendly, fast changing, plenty of opportunities for learning Cons maybe too much change, focus lacking for the future and a big time of change and re-setting priorities", "rating": 3, "pros": "friendly, fast changing, plenty of opportunities for learning", "cons": "maybe too much change, focus lacking for the future and a big time of change and re-setting priorities", "advice": null}, {"title": "Market Disruptor", "text": "Pros Heavy investment in new high bandwidth optical services Cons Internal processes, already improving to be online.", "rating": 5, "pros": "Heavy investment in new high bandwidth optical services", "cons": "Internal processes, already improving to be online.", "advice": null}, {"title": "Great company, on the up", "text": "Pros Friendly, growing company with a fantastic strategy and vision Cons Lots of change- love it or hate it!", "rating": 5, "pros": "Friendly, growing company with a fantastic strategy and vision", "cons": "Lots of change- love it or hate it!", "advice": null}, {"title": "CMO", "text": "Pros The people, our compelling strategy and the desire to transform in a dynamic environment Cons I really can't think of any Advice to Management If you can keep up with a dynamic and sometimes pressurized environment - you will enjoy Colt more than any other place you have been!!!!", "rating": 5, "pros": "The people, our compelling strategy and the desire to transform in a dynamic environment", "cons": "I really can't think of any", "advice": "If you can keep up with a dynamic and sometimes pressurized environment - you will enjoy Colt more than any other place you have been!!!!"}, {"title": "Challenger Colt IQ Network", "text": "Pros Investing in new people; modernizing the network; focusing on high bandwidth; high performance challenger culture Cons legacy IT systems; no company car in Sales in Germany Advice to Management internal brand building required", "rating": 5, "pros": "Investing in new people; modernizing the network; focusing on high bandwidth; high performance challenger culture", "cons": "legacy IT systems; no company car in Sales in Germany", "advice": "internal brand building required"}, {"title": "Human Resources", "text": "Pros Great Work life Balance. Very Employee friendly organization. Free meals and Transportation Cons None that I've experienced so far Advice to Management Keep up the good work", "rating": 5, "pros": "Great Work life Balance. Very Employee friendly organization. Free meals and Transportation", "cons": "None that I've experienced so far", "advice": "Keep up the good work"}, {"title": "Employee Friendly", "text": "Pros Good for flexibility and learning Cons Management changes too often too little time", "rating": 5, "pros": "Good for flexibility and learning", "cons": "Management changes too often too little time", "advice": null}, {"title": "Good, fair employer", "text": "Pros Flexible working environment, good supportive colleagues, company moving forward Cons Nothing in particular; generally positive", "rating": 5, "pros": "Flexible working environment, good supportive colleagues, company moving forward", "cons": "Nothing in particular; generally positive", "advice": null}, {"title": "good - ish", "text": "Pros people, products and willingness to work together Cons no ambition or money for investment at the time Advice to Management stick to a plan", "rating": 5, "pros": "people, products and willingness to work together", "cons": "no ambition or money for investment at the time", "advice": "stick to a plan"}, {"title": "Has potential to be a great company but slow moving", "text": "Pros good pay good benefits, health /pension/ bonus/ Allows flexible working from home in some cases but will depend on manager Cons career progression isn't easy expected to work endlessly constant change of strategy but perhaps that's starting to improve", "rating": 3, "pros": "good pay", "cons": "career progression isn't easy", "advice": null}, {"title": "Game of Thrones", "text": "Pros work- life balance and the people who work at colt make it bearable Cons constant change in leadership teams..for a company thats 25 years old it hasn't really achieved much Advice to Management Ditch the bravado and accept you need to start with a blank page", "rating": 3, "pros": "work- life balance and the people who work at colt make it bearable", "cons": "constant change in leadership teams..for a company thats 25 years old it hasn't really achieved much", "advice": "Ditch the bravado and accept you need to start with a blank page"}, {"title": "Good Company", "text": "Pros Good Company, as they provide Lunch dinner and sometimes breakfast if you are in night shift. plus night allowance. Cons Little bit corporate politics, just focused on your work Advice to Management All good", "rating": 5, "pros": "Good Company, as they provide Lunch dinner and sometimes breakfast if you are in night shift. plus night allowance.", "cons": "Little bit corporate politics, just focused on your work", "advice": "All good"}, {"title": "Challenger culture", "text": "Pros Great people, mix of cultures, good energy and room to develop yourself! Cons The people who are moaning all the time and >10 years in the same role and don't understand a company adapting to todays standards. Advice to Management Keep up the energy!", "rating": 5, "pros": "Great people, mix of cultures, good energy and room to develop yourself!", "cons": "The people who are moaning all the time and >10 years in the same role and don't understand a company adapting to todays standards.", "advice": "Keep up the energy!"}, {"title": "Feels like they're finally onto a good thing....", "text": "Pros Working with like minded, engaged people who believe in the direction and strategy Colt now has in place. As a business they are investing heavily in their infrastructure but are mindful that without good people, the network wont function. Powerful culture change in progress which is making room for the people who want to be there and who want to excel. Cons At times the changes that occur feel pretty cut throat and are still happening more than would be expected. Advice to Management I think the company is craving a period of stability", "rating": 5, "pros": "Working with like minded, engaged people who believe in the direction and strategy Colt now has in place. As a business they are investing heavily in their infrastructure but are mindful that without good people, the network wont function. Powerful culture change in progress which is making room for the people who want to be there and who want to excel.", "cons": "At times the changes that occur feel pretty cut throat and are still happening more than would be expected.", "advice": "I think the company is craving a period of stability"}, {"title": "Amazing", "text": "Pros Work life balance, employee friendly Cons none as they are best Advice to Management None", "rating": 5, "pros": "Work life balance, employee friendly", "cons": "none as they are best", "advice": "None"}, {"title": "Great colleagues", "text": "Pros Very talented people Great package and benefits Increasingly structured and roadmap for simplification Cons Too much change Too political Advice to Management Reduce the politics and reward according to achievement not perception or personal favour", "rating": 5, "pros": "Very talented people", "cons": "Too much change", "advice": "Reduce the politics and reward according to achievement not perception or personal favour"}, {"title": "Technical Lead", "text": "Pros Good work life balance & work culture Cons Growth opportunities are limited Limited management opportunities in Bangalore", "rating": 5, "pros": "Good work life balance & work culture", "cons": "Growth opportunities are limited", "advice": null}, {"title": "Lead Technical Engineer Capital Markets", "text": "Pros Salary shift work/life balance Cons Progress plan, management, portunities, future not clear", "rating": 5, "pros": "Salary shift work/life balance", "cons": "Progress plan, management, portunities, future not clear", "advice": null}, {"title": "Opinion", "text": "Pros Excellent company. Excellent service and service deployment. Excellent people Cons All those rumours about the company to be acquire or sold...... Advice to Management No advise", "rating": 3, "pros": "Excellent company. Excellent service and service deployment. Excellent people", "cons": "All those rumours about the company to be acquire or sold......", "advice": "No advise"}, {"title": "New starter", "text": "Pros A superbly well organised company with full employee alignment to the strategy from senior directors to support staff. Excellent network with class-leading delivery and after sales service. Staff are encouraged to continually approach their roles with initiative and when something isn't right, approach the powers that be to fix it. Cons Some challenges that I have faced are related to the geography that I work in from the perspective of lack of network coverage and market awareness compared to London which has traditionally been our core. I'm challenging myself to try and change that! Advice to Management Please keep faith in the staff that show the right behaviours and allow them time to deliver.", "rating": 5, "pros": "A superbly well organised company with full employee alignment to the strategy from senior directors to support staff. Excellent network with class-leading delivery and after sales service. Staff are encouraged to continually approach their roles with initiative and when something isn't right, approach the powers that be to fix it.", "cons": "Some challenges that I have faced are related to the geography that I work in from the perspective of lack of network coverage and market awareness compared to London which has traditionally been our core. I'm challenging myself to try and change that!", "advice": "Please keep faith in the staff that show the right behaviours and allow them time to deliver."}, {"title": "On the right track", "text": "Pros It's taken 3 years to simplify the business and achieve real clarity on the the business direction, this change has been difficult but necessary. Lot's of really passionate people and some good Execs in place. Cons Involving people in the change still isn't natural for the Executive, even the new ones. Over-reliance on bringing in senior people from outside of the company, mostly BT Global Services. Advice to Management Trust your people more, involve them earlier and give them some freedom. When exiting people treat them with more respect.", "rating": 3, "pros": "It's taken 3 years to simplify the business and achieve real clarity on the the business direction, this change has been difficult but necessary. Lot's of really passionate people and some good Execs in place.", "cons": "Involving people in the change still isn't natural for the Executive, even the new ones. Over-reliance on bringing in senior people from outside of the company, mostly BT Global Services.", "advice": "Trust your people more, involve them earlier and give them some freedom. When exiting people treat them with more respect."}, {"title": "Working in Colt as a Contractor is pathetic", "text": "Pros No pros in Colt as a Contractor. It's the worst company I have seen. If you like to be a slave then join colt. Cons As a Contractor you need to stay in office for 9 and half hours if there is work or not. They want to execute a project but don't know the requirements and also how to execute. They will not share any info. With minimum information we need to work. They treat contractors as slaves. No respect. They provide free food for permenant guys and not for contractors. Any one who wants to join colt as contractors beware please don't join. You will regret . I left with in 10days.", "rating": 1, "pros": "No pros in Colt as a Contractor. It's the worst company I have seen.", "cons": "As a Contractor you need to stay in office for 9 and half hours if there is work or not.", "advice": null}, {"title": "A Great Opportunity", "text": "Pros Plenty of experiences and opportunities if willing to embrace the Colt culture. Great visability all the way up to Senior Management. Friendly environment where we are challenged daily. Associates are given responsibility from the start and can take ownership of projects. Cons None which are obvious, however there are always the abrasions when not everyone embraces the culture change.", "rating": 5, "pros": "Plenty of experiences and opportunities if willing to embrace the Colt culture. Great visability all the way up to Senior Management. Friendly environment where we are challenged daily. Associates are given responsibility from the start and can take ownership of projects.", "cons": "None which are obvious, however there are always the abrasions when not everyone embraces the culture change.", "advice": null}, {"title": "Things move too slowly, political environment", "text": "Pros some really helpful and intelligent people, senior management team is excellent strong financial backing Cons Mid management gets messy and too many people are ready to throw each other under the bus for personal gains. Most people are more concerned about their career progression than achieving company goals Too many processes and hurdles to jump before you can actually do your job Too bureaucratic - things move way too slowly and delay timelines Referring back to earlier point about inadequacy of the mdi management - the progression is very slow in the company - impossible for a junior employee to get a respectable pay rise or job progression because the managers never support as they have also been stuck at their job for a long time Training and development is actually discouraged because of budget cuts (that happen every month). Advice to Management Please see through the mid-management level politics and encourage progression within the company. A lot of hardworking bright people have been victims of the politics and pushed out of the business for someone else's progression. Encourage mandatory development training.", "rating": 3, "pros": "some really helpful and intelligent people,", "cons": "Mid management gets messy and too many people are ready to throw each other under the bus for personal gains.", "advice": "Please see through the mid-management level politics and encourage progression within the company. A lot of hardworking bright people have been victims of the politics and pushed out of the business for someone else's progression. Encourage mandatory development training."}, {"title": "Good Company to work for", "text": "Pros Good and transparent management, perks and benefits are good. Salary industry standard. Cons Company is not achevring any aggressive revenue target for so long. Advice to Management business transformation is required. Please stop the legacy voice business if it's not returning a exponential growth.", "rating": 5, "pros": "Good and transparent management, perks and benefits are good. Salary industry standard.", "cons": "Company is not achevring any aggressive revenue target for so long.", "advice": "business transformation is required. Please stop the legacy voice business if it's not returning a exponential growth."}, {"title": "Tecnichal Support", "text": "Pros Good team, work environment, lifestyle in Barcelona Cons Working Shift hours with no option of change Advice to Management listen more to employee issues regarding working hours", "rating": 3, "pros": "Good team, work environment, lifestyle in Barcelona", "cons": "Working Shift hours with no option of change", "advice": "listen more to employee issues regarding working hours"}, {"title": "Good workplace if you focus on your work and team", "text": "Pros Excellent Teamwork Good salary and benefits Flexible hours and work from home Amazing VDI infrastructure so I could work even from an iPad on the go Cons Constant changes and uncertainty not always properly handled by the management levels Communication never flows freely at all levels so people never knows truly what's going on Advice to Management Effective communication to all employees is necessary to improve the work environment", "rating": 5, "pros": "Excellent Teamwork", "cons": "Constant changes and uncertainty not always properly handled by the management levels", "advice": "Effective communication to all employees is necessary to improve the work environment"}, {"title": "Really excellent place to work!", "text": "Pros Great people and teams - lots of L & D options and career growth - great compensation - great social and charity activities Cons Nothing that comes to mind Advice to Management Keep up the great job!", "rating": 5, "pros": "Great people and teams - lots of L & D options and career growth - great compensation - great social and charity activities", "cons": "Nothing that comes to mind", "advice": "Keep up the great job!"}, {"title": "Company without any direction", "text": "Pros Good work balance Less job pressure fix timings Cons Management dont know which direction to choose No vision of company Very limited parameter of work Many Layoffs due to management wrong decisions No stability Frequent reorganization Huge Internal politics No measurement for KPPs No technology enhancements for employees Lot of unnecessary events due to which employee productivity reduces Advice to Management Hire some good management people with vision and direction", "rating": 1, "pros": "Good work balance", "cons": "Management dont know which direction to choose", "advice": "Hire some good management people with vision and direction"}, {"title": "credit controller", "text": "Pros Multicultural company nice atmosphere Cons not many opportunities to grow", "rating": 5, "pros": "Multicultural company nice atmosphere", "cons": "not many opportunities to grow", "advice": null}, {"title": "Good for sometime", "text": "Pros 1) Good Employee benefits 2) Flexibility in work environment Cons 1) Slow career growth 2) Company Strategy changes too frequently Advice to Management Need to communicate very clearly company strategy to all strata of employees.", "rating": 5, "pros": "1) Good Employee benefits", "cons": "1) Slow career growth", "advice": "Need to communicate very clearly company strategy to all strata of employees."}, {"title": "Senior Technical Lead", "text": "Pros Great work culture. Dynamic Management Cons Too many changes in the work space. Advice to Management ggh", "rating": 5, "pros": "Great work culture. Dynamic Management", "cons": "Too many changes in the work space.", "advice": "ggh"}, {"title": "I've never felt that full-blown at work", "text": "Pros Many opportunities for employees to connect/express with ELT. Rewards for hard work are a reality here. You really feel recognized and you feel that you can talk freely. Cons Since it's a multi-national company : the opportunities to gather teams spread across the continent are too rare. Colleagues who see each other at least once a year will much more into Teamwork! Advice to Management Retaining talents and people must be a focus because some people are ready to give their lives for this company and because of a roadblock along the way or a frustration we let them go instead of sitting down with them and see how we could place them somewhere else in the company.", "rating": 5, "pros": "Many opportunities for employees to connect/express with ELT.", "cons": "Since it's a multi-national company : the opportunities to gather teams spread across the continent are too rare. Colleagues who see each other at least once a year will much more into Teamwork!", "advice": "Retaining talents and people must be a focus because some people are ready to give their lives for this company and because of a roadblock along the way or a frustration we let them go instead of sitting down with them and see how we could place them somewhere else in the company."}, {"title": "Changing Times", "text": "Pros A driven and fun company who aspire to be the most customer oriented business in our industry... Colt has an open and transparent \"Challenger Culture\" where people makes things happen in an environment where they feel empowered, where they do not wait for someone to give them permission, where they see barriers as something to break through, not a reason to stop. A company that is actively seeking opportunities to grow and become a true leader in our market. Cons Colt is not for those people who want an easy life...", "rating": 5, "pros": "A driven and fun company who aspire to be the most customer oriented business in our industry...", "cons": "Colt is not for those people who want an easy life...", "advice": null}, {"title": "good to work for time being", "text": "Pros good work life balance, flexible timing Cons job security , management is not good.", "rating": 3, "pros": "good work life balance, flexible timing", "cons": "job security , management is not good.", "advice": null}, {"title": "Interesting experience", "text": "Pros Excellent people, high level of technical expertise. Good managers, but were replaced often because of program I was in turned out to be 1 year behind schedule. Cons Telco culture is very different from IT culture. Management was vague or ouright lying about people getting fired due to a certain project. Advice to Management Let failure be an option – don't have people be afraid of admitting things aren't going as well as they might have made it out to be. Telco business is completely different from IT services – seemed this was not recognized. Drop 90's slideshows about COLT values.", "rating": 5, "pros": "Excellent people, high level of technical expertise. Good managers, but were replaced often because of program I was in turned out to be 1 year behind schedule.", "cons": "Telco culture is very different from IT culture. Management was vague or ouright lying about people getting fired due to a certain project.", "advice": "Let failure be an option – don't have people be afraid of admitting things aren't going as well as they might have made it out to be. Telco business is completely different from IT services – seemed this was not recognized. Drop 90's slideshows about COLT values."}, {"title": "slow growth", "text": "Pros Work environment is very much relaxed. Cons slow growth at all levels, you need to wait for more then 3 years for your promotion. Advice to Management Keep employee happy by giving motivation", "rating": 5, "pros": "Work environment is very much relaxed.", "cons": "slow growth at all levels, you need to wait for more then 3 years for your promotion.", "advice": "Keep employee happy by giving motivation"}, {"title": "Good place to work. But not for too long. Extremely long waits to get a promotion.", "text": "Pros Relaxed working environment.. Good paymaster.. Recognition for hard work.. Extremely friendly and helpful employees.. learning from mistakes is encouraged.. Cons Extremely Slow growth. 10 years to become a manager...!!! Old crowd because of which they aren't up to date with latest technology.. Lots of cost cutting going on.. 2 organisational changes in the last 6 months..! Processes are not documented.. So there's no fixed way to handle a problem Advice to Management Start hiring young talent. Too many organisational changes confuse the employees.", "rating": 3, "pros": "Relaxed working environment..", "cons": "Extremely Slow growth. 10 years to become a manager...!!!", "advice": "Start hiring young talent."}, {"title": "Network Engineer", "text": "Pros Great place to work in Cons None so far now :) Advice to Management None", "rating": 5, "pros": "Great place to work in", "cons": "None so far now :)", "advice": "None"}, {"title": "Massive change recently", "text": "Pros Very focused on where it's going; trying hard to change culture; good place to work Cons Continual change takes some getting used to", "rating": 5, "pros": "Very focused on where it's going; trying hard to change culture; good place to work", "cons": "Continual change takes some getting used to", "advice": null}, {"title": "Great place to work", "text": "Pros Great people and after years of attempting different business growth strategy has eventually found the right approach. Excellent worldwide diversity with an exciting mix of cultures Has streamlined management tower to reduce complexity, on the right path Cons Process burden in many areas (finance, operations, product dev), operates like a large company Difficult to move internally between functions Empowerment not very well distributed down the ranks Not very good with gender diversity and equal pay Advice to Management Execute the strategy without distraction Remove process complexity in key areas (delivery, finance approvals, ...) Promote job rotation, secondment to countries, hire millennial- invest in people", "rating": 5, "pros": "Great people and after years of attempting different business growth strategy has eventually found the right approach.", "cons": "Process burden in many areas (finance, operations, product dev), operates like a large company", "advice": "Execute the strategy without distraction"}, {"title": "Colt", "text": "Pros Good place to work with. Cons Growth has an issue in colt", "rating": 5, "pros": "Good place to work with.", "cons": "Growth has an issue in colt", "advice": null}, {"title": "Workred as Analyst", "text": "Pros Good salary and benefits, flexibility working time Cons Bad communication politic, bad management, no real driven change in the company to solve problems, no training, bad team spirit, ask questions but the right ones!", "rating": 3, "pros": "Good salary and benefits, flexibility working time", "cons": "Bad communication politic, bad management, no real driven change in the company to solve problems, no training, bad team spirit, ask questions but the right ones!", "advice": null}, {"title": "Would not recommend", "text": "Pros Lots of talented and nice work colleagues in Barcelona Cons - very stressful work environment - no support from management - bad organisation and no possibility to move up Advice to Management Customer support is a backbone of this company and you are loosing customers if the support can't keep up with the demands. Start investing in your people, they might surprise you.", "rating": 3, "pros": "Lots of talented and nice work colleagues in Barcelona", "cons": "- very stressful work environment", "advice": "Customer support is a backbone of this company and you are loosing customers if the support can't keep up with the demands. Start investing in your people, they might surprise you."}, {"title": "Very Bad work practices. À lala company", "text": "Pros Good lunches along with recreation facilities, very good HR, hygiene at workplace Cons Very bad way of approaching issues.. Employees generally fight on the floor itself.. There is no discussion over a poinr only argument...Dog eat Dog environment...Not at all suitable for a human being. Advice to Management Every company have issues but the way Colt management is approaching them is not right at all...It will only get bigger and worst", "rating": 1, "pros": "Good lunches along with recreation facilities, very good HR, hygiene at workplace", "cons": "Very bad way of approaching issues.. Employees generally fight on the floor itself.. There is no discussion over a poinr only argument...Dog eat Dog environment...Not at all suitable for a human being.", "advice": "Every company have issues but the way Colt management is approaching them is not right at all...It will only get bigger and worst"}, {"title": "Good company", "text": "Pros Flexibility in work environment. You can get independent hand to work. Cons Management is a bit slow in taking crucial decisions. Low salary according to work. Advice to Management Work faster for better results. Trust your employees.", "rating": 3, "pros": "Flexibility in work environment. You can get independent hand to work.", "cons": "Management is a bit slow in taking crucial decisions.", "advice": "Work faster for better results. Trust your employees."}, {"title": "Great Company", "text": "Pros Although there has been a number of changes over the years, there are still great people to work with. Would say to any one give them a chance Cons Too many changes in to short a time.Needs a bit of time to consolidate the structures they have put in place and not change again in a year Advice to Management Management I had were extremely supportive over the years I was there. Again some great people in middle management who really care", "rating": 5, "pros": "Although there has been a number of changes over the years, there are still great people to work with. Would say to any one give them a chance", "cons": "Too many changes in to short a time.Needs a bit of time to consolidate the structures they have put in place and not change again in a year", "advice": "Management I had were extremely supportive over the years I was there. Again some great people in middle management who really care"}, {"title": "Bad management", "text": "Pros good pension good location working from home possibility nice office flexibility Cons bad management left on on your own no directives no help bad HR", "rating": 1, "pros": "good pension", "cons": "bad management", "advice": null}, {"title": "Solution Manager", "text": "Pros Good work life balance, great people. Reasonable pay and great culture. Cons Constant restructuring at the time I was there, getting rid of many good people through redundancies and attrition and wondering why customer projects were delayed or quality of solutions dropped. Advice to Management Take good care of your people , they are your best asset.", "rating": 3, "pros": "Good work life balance, great people. Reasonable pay and great culture.", "cons": "Constant restructuring at the time I was there, getting rid of many good people through redundancies and attrition and wondering why customer projects were delayed or quality of solutions dropped.", "advice": "Take good care of your people , they are your best asset."}, {"title": "Good pay and benefits, difficult sales job most of the time.", "text": "Pros Good pay, good benefits, they look after you as an employee. Cons They make selling unnecessarily tedious and difficult, in terms of processing a sale, and what has to happen for that order to get through administrative hell to get work going for the customer. The delay between they say yes and pay, to when they have their product in working order, is tooooooo long. Seriously too long. I can't spend hours with a customer who is freaking out about when they're going to have their product when I'm trying to sell to other potential customers. You know? Advice to Management Simplify the process for customers. Shorten the delivery time by a lot, and if a customer is paying for fast-track, don't put fast-track through the same slow process. Remove the obstacles to selling. Make life much, much easier on your salespeople. I've never seen a more complicated process.", "rating": 5, "pros": "Good pay, good benefits, they look after you as an employee.", "cons": "They make selling unnecessarily tedious and difficult, in terms of processing a sale, and what has to happen for that order to get through administrative hell to get work going for the customer. The delay between they say yes and pay, to when they have their product in working order, is tooooooo long. Seriously too long. I can't spend hours with a customer who is freaking out about when they're going to have their product when I'm trying to sell to other potential customers. You know?", "advice": "Simplify the process for customers. Shorten the delivery time by a lot, and if a customer is paying for fast-track, don't put fast-track through the same slow process. Remove the obstacles to selling. Make life much, much easier on your salespeople. I've never seen a more complicated process."}, {"title": "Fantastic local team", "text": "Pros Superb local collaboration, but indifferent shared services Cons no career progression opportunities, even for long tenure and experience. Advice to Management Actually recognise talent, do not just say it.", "rating": 3, "pros": "Superb local collaboration, but indifferent shared services", "cons": "no career progression opportunities, even for long tenure and experience.", "advice": "Actually recognise talent, do not just say it."}, {"title": "Good place to work despite constant change", "text": "Pros Expect to work hard but the rewards are there for those that do, new management team look like they will bring the much needed stability to a company that has been in a never ending reorganisation Cons Too much change, expect to use many tools so if you can remember 20 different passwords for 20 different systems you will be ok!", "rating": 5, "pros": "Expect to work hard but the rewards are there for those that do, new management team look like they will bring the much needed stability to a company that has been in a never ending reorganisation", "cons": "Too much change, expect to use many tools so if you can remember 20 different passwords for 20 different systems you will be ok!", "advice": null}, {"title": "Unstable enviroment", "text": "Pros Salary is compatible with the market, although there is not much additional benefits other than the basic. Environment is very international and you have opportunity to deal with people from other countries. Cons There are too many organization changes and overall work environment is very unstable and stressful. There is no enough training and opportunity for career development. Advice to Management There have been so many changes in the organization and so many position being made redundant, that it is very difficult for the employees to keep their motivation.", "rating": 3, "pros": "Salary is compatible with the market, although there is not much additional benefits other than the basic. Environment is very international and you have opportunity to deal with people from other countries.", "cons": "There are too many organization changes and overall work environment is very unstable and stressful. There is no enough training and opportunity for career development.", "advice": "There have been so many changes in the organization and so many position being made redundant, that it is very difficult for the employees to keep their motivation."}, {"title": "Analyst", "text": "Pros Good employer with good benefits Cons Long hours but worth it Advice to Management think about the benefits to employees", "rating": 5, "pros": "Good employer with good benefits", "cons": "Long hours but worth it", "advice": "think about the benefits to employees"}, {"title": "Business improvement", "text": "Pros Good team work, very knowledgeable individuals, opportunities to work in projects across multiple geografies and business areas. Some good senior execs. Cons Constant change and some pet projects by some managers make change difficult to achieve. Not enough hard evidence driven improvement projects.", "rating": 1, "pros": "Good team work, very knowledgeable individuals, opportunities to work in projects across multiple geografies and business areas. Some good senior execs.", "cons": "Constant change and some pet projects by some managers make change difficult to achieve. Not enough hard evidence driven improvement projects.", "advice": null}, {"title": "Company waste my career!!", "text": "Pros Transport,food,good culture.I met different people with good attitudes. Cons No room for learners they have a specific routine and they follow blindly....sorry if you have active mind!! Advice to Management Think twice before you make any decision......", "rating": 1, "pros": "Transport,food,good culture.I met different people with good attitudes.", "cons": "No room for learners they have a specific routine and they follow blindly....sorry if you have active mind!!", "advice": "Think twice before you make any decision......"}, {"title": "good company to work. work life balance is good.", "text": "Pros good company to work. work life balance is too good. Cons no new idea/innovation or approach because no one left the company.", "rating": 5, "pros": "good company to work. work life balance is too good.", "cons": "no new idea/innovation or approach because no one left the company.", "advice": null}, {"title": "Curious place", "text": "Pros Some good marketing and sales professionals. Nice people. Change of CEO and firing some of the less proficient management augurs well. Good offshore team Cons IT in UK tended to be waffle and not solution focussed. A lot of square pegs in round holes. Need to restructure and rationalise Advice to Management Develop solution orientated mindset. Be prepared to cut out the deadwood; more than fair share of staff out of their depth in IT", "rating": 3, "pros": "Some good marketing and sales professionals. Nice people. Change of CEO and firing some of the less proficient management augurs well. Good offshore team", "cons": "IT in UK tended to be waffle and not solution focussed. A lot of square pegs in round holes. Need to restructure and rationalise", "advice": "Develop solution orientated mindset. Be prepared to cut out the deadwood; more than fair share of staff out of their depth in IT"}, {"title": "Sales Enablement", "text": "Pros Great people and global strategy Cons none which I've experienced Advice to Management Keep on strategy", "rating": 5, "pros": "Great people and global strategy", "cons": "none which I've experienced", "advice": "Keep on strategy"}, {"title": "Sales", "text": "Pros The salary was pretty decent for Spain. Working target based also without any support to reach it and even then got sabotaged out of personal interest from management. Some nice people there but defiantly a minority I would avoid the Germans they seem to stick together to protect their incompetence but their sales people are a joke. Pasieve people copy pasting till they get their numbers Cons Really bad management they can not communicate at all. You will have to adapt and ask everything a couple times without any result mostly. Do not want to make people better but just look how they can go up them self . A lot of micro management trying to go to the top through sweet talking to the right persons. Incompetent people getting over payed especially sales managers just need to talk to him and you know enough... no soft skills there or hard skills or a vision of were to go even. basically lacking intelligence Advice to Management Clean out your departaments and make some hard decision if you do not see this than the fault probably with you. Communicate better , be fair the same changes for everybody, train yourself so will have meaningful things to bring to the table and improve your employees", "rating": 1, "pros": "The salary was pretty decent for Spain. Working target based also without any support to reach it and even then got sabotaged out of personal interest from management. Some nice people there but defiantly a minority I would avoid the Germans they seem to stick together to protect their incompetence but their sales people are a joke. Pasieve people copy pasting till they get their numbers", "cons": "Really bad management they can not communicate at all. You will have to adapt and ask everything a couple times without any result mostly. Do not want to make people better but just look how they can go up them self . A lot of micro management trying to go to the top through sweet talking to the right persons. Incompetent people getting over payed especially sales managers just need to talk to him and you know enough... no soft skills there or hard skills or a vision of were to go even. basically lacking intelligence", "advice": "Clean out your departaments and make some hard decision if you do not see this than the fault probably with you. Communicate better , be fair the same changes for everybody, train yourself so will have meaningful things to bring to the table and improve your employees"}, {"title": "ok", "text": "Pros Telco , well payed. City job Happy hour Cons Made redundant. Short term goals Nothing else !", "rating": 3, "pros": "Telco , well payed.", "cons": "Made redundant.", "advice": null}, {"title": "No the best sales career to embrace", "text": "Pros Very good salary and amazing benefits.One of the best companies to work for in Barcelona from this point of view. Nice talented people in the sales area and some sales managers with years of experience. A good school for sales if you like tough love Cons Inconsistent with all decisions, has changed so many times that the sales don't even know what to sale anymore Lack of career path, horrible useless HR department, they are incapable of even delivering a piece of paper Implementing projects is a huge issue as service delivery receives orders late and wrong, order entry is crap and Central Ordering in Barcelona the worst team ever making sales difficult and maintaining relationship with the customer even more so Complete lack of marketing demand generation and no actual plan", "rating": 3, "pros": "Very good salary and amazing benefits.One of the best companies to work for in Barcelona from this point of view.", "cons": "Inconsistent with all decisions, has changed so many times that the sales don't even know what to sale anymore", "advice": null}, {"title": "Klare Ausrichtung fehlt", "text": "Pros good salary, flexible working (home office) possible Cons no one left in the company", "rating": 1, "pros": "good salary, flexible working (home office) possible", "cons": "no one left in the company", "advice": null}, {"title": "Nice company to work", "text": "Pros good company environment & work culture . Cons no such cons in colt", "rating": 5, "pros": "good company environment & work culture .", "cons": "no such cons in colt", "advice": null}, {"title": "Engineer", "text": "Pros Nyc Salary, Lunch and Commutation Free. Work Life balance Cons No Recreation Facility in the company", "rating": 5, "pros": "Nyc Salary, Lunch and Commutation Free. Work Life balance", "cons": "No Recreation Facility in the company", "advice": null}, {"title": "Good company to work with", "text": "Pros Good work life balance. Excellent Management Cons Workflow adherence. Retrospective corrective actions Advice to Management Remove silos. Focus on sales", "rating": 5, "pros": "Good work life balance. Excellent Management", "cons": "Workflow adherence. Retrospective corrective actions", "advice": "Remove silos. Focus on sales"}, {"title": "Data center", "text": "Pros Very good to work for data center has a lot to learn different applications I made lots of friends I will recommend colt for anyone that wants a career in data center Cons The pay for contractors was not much Advice to Management I think having more training for staff will be beneficial", "rating": 5, "pros": "Very good to work for data center has a lot to learn different applications I made lots of friends I will recommend colt for anyone that wants a career in data center", "cons": "The pay for contractors was not much", "advice": "I think having more training for staff will be beneficial"}, {"title": "Work life balance is good", "text": "Pros You will enjoy work life balance Cons Very few opportunity for growth", "rating": 5, "pros": "You will enjoy work life balance", "cons": "Very few opportunity for growth", "advice": null}, {"title": "Great experience in the past, new management is giving bad sensations for what future will have the company.", "text": "Pros Good environment, good mates and good salary. Pioneer on new technology but sometimes, to save money, they spend more because of bad choice on new vendor/system. Cons Employee motivation is getting worse because of managment decision and not known future plans. This is affecting day by day activities. Advice to Management You are loosing many good employee and who will stay in the company has no more motivation.", "rating": 3, "pros": "Good environment, good mates and good salary. Pioneer on new technology but sometimes, to save money, they spend more because of bad choice on new vendor/system.", "cons": "Employee motivation is getting worse because of managment decision and not known future plans. This is affecting day by day activities.", "advice": "You are loosing many good employee and who will stay in the company has no more motivation."}, {"title": "Company lacking direction", "text": "Pros Work life balance Cab and food facility Office Timings best compared to other companies (8-5) UK work culture, Professional culture Roles and responsibilities clearly defined Cons Slow time to market changes Politics at Middle management layer which creates gap between SMT and working force Frequent organization changes Poor opportunities for Job rotation,inter department movements,trainings etc.. Advice to Management Retain people with skills create stable working culture Track and execute company's strategy till it's acheived", "rating": 3, "pros": "Work life balance", "cons": "Slow time to market changes", "advice": "Retain people with skills"}, {"title": "A shadow of its former self.....", "text": "Pros - The people – some of the best in the industry and also what makes you get up and come into the office - When you work within a virtual team, the interaction is great - You can WFH or in the office – as long as you get the job done  - if you just want to earn a wage for the considerable future and not bothered about career, then this is a great place to be.  - Since Rakesh Bhasin has left, there has been some improvement – the poor exCO talent (Simon Walsh, Mark Leonard) have also thankfully gone - Cons - All signs are that Colt are getting ready to be sold – why else would Carl Grivner become CEO – he has a proven track record of preparing companies for a sale - Colt believe the answer to everything is to outsource – all European IP Engineers are practically not there anymore – function moved to India and customers are not best pleased. The volume of talent that has left Colt is unreal - all in the name of getting costs down. - Just mention Planet Operate to anyone in Operations – this is what happens when you buy a Lada and expect Ferrari performance  - No proper HR policy – they basically make it up as you go along –  – senior management has been halved to get rid of high earners on the payroll – 2 respected UK Sales Directors “left the business”, however the truth was more that Colt engineered their exit – everyone was shocked when they left and the way it was handled was very poor.  - Absolutely zero career progression – unless you are liked, you will not progress in Colt – they do not invest in proper training, but want to you to complete course via their online portal –  - Company is obsessed with monthly targets for revenue – numbers is all they are interested in and there is a ridiculous amount of pressure on everyone to achieve this when systems and process are simply not up to the job  - Too many people in high positions but not able to give direction – the company is rudderless the majority of times.  - There is a cycle of every two years that the strategy will change – and normally this is followed by job cuts as the management realise they need to show good numbers  - people are not willing to give an opinion for fear of being managed out of the business - Colt has lost some exceptional talent over the years due their inability to attract and retain those people – more to the point, those people have just had enough of the way that Colt works, operates and treats people. Advice to Management it could be the industry's worst kept secret - just come clean if Colt is being sold. Doing things on the cheap to make the numbers is not working - you have lost so much excellence in talent in the hope that the great off-shoring plan works, but it has caused nothing but problems and anxiety. A company that thinks it is an adult, but behaves like a nonchalant teenager", "rating": 3, "pros": "- The people – some of the best in the industry and also what makes you get up and come into the office", "cons": "- All signs are that Colt are getting ready to be sold – why else would Carl Grivner become CEO – he has a proven track record of preparing companies for a sale", "advice": "it could be the industry's worst kept secret - just come clean if Colt is being sold."}, {"title": "Hopefully I'll never work in a company as bad!", "text": "Pros Salary - usually overpaid for all positions Good benefits schemes - food card and medical insurance Cons Negative, toxic environment created by everyone being overpaid, so the turnover is low and people don't leave because they can't find other opportunities for the salary, therefore everyone is unmotivated and thinks negatively of the company. Too many managers and executives in unworthy positions, creating bad decisions. - - Organisational change is constant due to so many bad ways of doing things, they are looking to improve things but they don´t know where to start and it just gets worse. Company is always looking to lower costs which is a bad sign, always moving jobs to countries for less salary (india and romania) Training is never adequate so most of the time people make countless errors and the management cannot see the flaws. Old systems, using the cheapest versions without proper training, not helping in daily work. Little social events, no relationships among employees. It's a do your job and go home environment. Advice to Management Take advice from people lower down the organisation who can clearly see the improvements that need to be made in the company. Ensure that the company's best people are your managers, and not at the bottom of the chain. Provide proper training to employees, create good social atmosphere. Make less organisational change, more stability and realise that you always get what you pay for in terms of offshoring more jobs.", "rating": 1, "pros": "Salary - usually overpaid for all positions", "cons": "Negative, toxic environment created by everyone being overpaid, so the turnover is low and people don't leave because they can't find other opportunities for the salary, therefore everyone is unmotivated and thinks negatively of the company.", "advice": "Take advice from people lower down the organisation who can clearly see the improvements that need to be made in the company. Ensure that the company's best people are your managers, and not at the bottom of the chain. Provide proper training to employees, create good social atmosphere. Make less organisational change, more stability and realise that you always get what you pay for in terms of offshoring more jobs."}, {"title": "Ongoing changes", "text": "Pros Good salaries and career opportunities within the company, possibility to negotiate your salary, nice work environment in general. Good bonus scheme. Cons There are many manual processes triggering human errors, customer dissatisfaction and employees frustration. The re-structure processes are not very well communicated and work on try and fail basis without a clear plan. Advice to Management Be more coherent with the changes within the organisation", "rating": 3, "pros": "Good salaries and career opportunities within the company, possibility to negotiate your salary, nice work environment in general. Good bonus scheme.", "cons": "There are many manual processes triggering human errors, customer dissatisfaction and employees frustration. The re-structure processes are not very well communicated and work on try and fail basis without a clear plan.", "advice": "Be more coherent with the changes within the organisation"}, {"title": "Good but changeable", "text": "Pros fast, fidelity, culture, growing DC business Cons change, change, change, change, change", "rating": 3, "pros": "fast, fidelity, culture, growing DC business", "cons": "change, change, change, change, change", "advice": null}, {"title": "Head of Ordering and Strategic programmes", "text": "Pros Career opportunities, learning opportunities, SSC in a nice city as Barcelona Cons I do not see any cons", "rating": 3, "pros": "Career opportunities, learning opportunities, SSC in a nice city as Barcelona", "cons": "I do not see any cons", "advice": null}, {"title": "Good Company", "text": "Pros Good work life balance and good compensation. Cons No vertical growth and stagnancy after some time.", "rating": 3, "pros": "Good work life balance and good compensation.", "cons": "No vertical growth and stagnancy after some time.", "advice": null}, {"title": "Colt Technology Services", "text": "Pros reactive , great people , Superb Product Cons internal Processes are too complicated Advice to Management Simplify", "rating": 5, "pros": "reactive , great people , Superb Product", "cons": "internal Processes are too complicated", "advice": "Simplify"}, {"title": "Bad company to work for especially when its gone to spain the HR are really crap no experience of dealing with people", "text": "Pros Good company but employees in spain are making this company really bad, very unexprienced cheap employees in spain are dragging this company down Cons If this company wanys to progress it needs to come back to UK and stop employing cheap labour in spain its making the conpany go down. The HR are very unexprienced. Advice to Management Bring back to UK", "rating": 3, "pros": "Good company but employees in spain are making this company really bad, very unexprienced cheap employees in spain are dragging this company down", "cons": "If this company wanys to progress it needs to come back to UK and stop employing cheap labour in spain its making the conpany go down. The HR are very unexprienced.", "advice": "Bring back to UK"}, {"title": "Great place to work", "text": "Pros Great opportunity in work good peers management follow open door no cabin policy at director level Cons not thought of having such a great place after 5 yrs Advice to Management keep the work going at the same pace with fidelity took over", "rating": 5, "pros": "Great opportunity in work", "cons": "not thought of having such a great place after 5 yrs", "advice": "keep the work going at the same pace with fidelity took over"}, {"title": "Great work and life balance", "text": "Pros Work life balance Open culture Good peers Cons No growth Slow in progress Lack in vision", "rating": 5, "pros": "Work life balance", "cons": "No growth", "advice": null}, {"title": "Employee satisfaction", "text": "Pros The Good Environment of Colt is the best pros and this is the one reason for everyone to work in colt. Cons You might face some kind of Politics there in colt but that is something which is almost all the places.", "rating": 5, "pros": "The Good Environment of Colt is the best pros and this is the one reason for everyone to work in colt.", "cons": "You might face some kind of Politics there in colt but that is something which is almost all the places.", "advice": null}, {"title": "Nice to work with colt but for 2 years only", "text": "Pros CTC good , work life balance , 35 paid leave Cons In hand salary very low, politics, no training , no learning, old tools n technology used, cost cutting, low increment, old employees minting money only, Advice to Management Consider equally to everyone", "rating": 3, "pros": "CTC good , work life balance , 35 paid leave", "cons": "In hand salary very low, politics, no training , no learning, old tools n technology used, cost cutting, low increment, old employees minting money only,", "advice": "Consider equally to everyone"}, {"title": "New leadership is a breath of fresh air", "text": "Pros Fantastic people, great exposure to technology and various routes to market. Solid team environment, regardless of geography. Strong leadership (since early 2016) was welcomed and much needed. An infectious 'can do' attitude from some of the best telecoms professionals in the industry. Customer orientated business. Cons There is a company wide concern that the damage may have been done under previous senior leadership team i.e. declining revenue, layers of operational complexity, loss of customers and churn of large contracts. Feels like Colt are being shaped up for a sale. Revenue grab, slash of pricing, cross charging customers and refocusing on 'core' business. Advice to Management Invest in your people, they in turn will focus on the customer and then the revenue will follow. Continue with simplification and focus on the core business.", "rating": 5, "pros": "Fantastic people, great exposure to technology and various routes to market. Solid team environment, regardless of geography. Strong leadership (since early 2016) was welcomed and much needed. An infectious 'can do' attitude from some of the best telecoms professionals in the industry. Customer orientated business.", "cons": "There is a company wide concern that the damage may have been done under previous senior leadership team i.e. declining revenue, layers of operational complexity, loss of customers and churn of large contracts. Feels like Colt are being shaped up for a sale. Revenue grab, slash of pricing, cross charging customers and refocusing on 'core' business.", "advice": "Invest in your people, they in turn will focus on the customer and then the revenue will follow. Continue with simplification and focus on the core business."}, {"title": "overall good employer , facilities", "text": "Pros good facilities great learning comp off flexi timing Cons work pressure Politics Mostly Production support work", "rating": 5, "pros": "good facilities", "cons": "work pressure", "advice": null}, {"title": "Good Company to work.", "text": "Pros Work Life Balance is the best part of COLT. Cons Very much process oriented organization.You need to be particular all changing process with your work.", "rating": 5, "pros": "Work Life Balance is the best part of COLT.", "cons": "Very much process oriented organization.You need to be particular all changing process with your work.", "advice": null}, {"title": "Senior Manager Finance", "text": "Pros Multi cultural experience, 13 countries plus SSC in India Extensive business likes exposure Cons Strategy changes oftenly not clear competitive position found", "rating": 5, "pros": "Multi cultural experience, 13 countries plus SSC in India", "cons": "Strategy changes oftenly not clear competitive position found", "advice": null}, {"title": "Good work experience", "text": "Pros Great salary,good opportunities,generally helpful people Cons No career path,no trainings,very weak HR,very frequent changes,no clear vision Advice to Management relook at having only one location in India instead of two", "rating": 3, "pros": "Great salary,good opportunities,generally helpful people", "cons": "No career path,no trainings,very weak HR,very frequent changes,no clear vision", "advice": "relook at having only one location in India instead of two"}, {"title": "Senior Engineer", "text": "Pros For a fresher the average salary is above the market just that. If you are retiring then this is the place and no hectic envionment + work life balance. Cons No learning, living in a different planet altogether, less yearly hikes 6-9 % for average rating which 99% get, No investment on new tech or upgrades for old software. If you stay 4-5 Years you are out of the market already.Your CTC and in hand salary has a lot of difference e.g. for 10 LPA the in hand was 60K/monthly Advice to Management Give training and upgrade on new tools and tech.", "rating": 3, "pros": "For a fresher the average salary is above the market just that.", "cons": "No learning, living in a different planet altogether, less yearly hikes 6-9 % for average rating which 99% get, No investment on new tech or upgrades for old software. If you stay 4-5 Years you are out of the market already.Your CTC and in hand salary has a lot of difference e.g. for 10 LPA the in hand was 60K/monthly", "advice": "Give training and upgrade on new tools and tech."}, {"title": "Program analyst", "text": "Pros Gud work life balance Free cabs and meals Gud learning environment Cons Not a gud company to work more than 2 year Advice to Management Do appraisal on the basis of performance", "rating": 5, "pros": "Gud work life balance", "cons": "Not a gud company to work more than 2 year", "advice": "Do appraisal on the basis of performance"}, {"title": "Great benefits but no direction", "text": "Pros Benefits are excellent. Very corporate, polished and professional. Some great people working there although the ones who made it a great place to work have mostly left Cons Constant change of direction leave staff wondering if they know what senior management know what they are doing (clearly they don't). CEO was ok bloke but should have gone years ago. Same old with current CEO. Colt continues to wander aimlessly in markets dominated by companies who have clear strategies and stick to them Advice to Management Decide what you are and stick to it. Release about a third of people. Too many journeymen (and women)", "rating": 3, "pros": "Benefits are excellent. Very corporate, polished and professional. Some great people working there although the ones who made it a great place to work have mostly left", "cons": "Constant change of direction leave staff wondering if they know what senior management know what they are doing (clearly they don't). CEO was ok bloke but should have gone years ago. Same old with current CEO. Colt continues to wander aimlessly in markets dominated by companies who have clear strategies and stick to them", "advice": "Decide what you are and stick to it. Release about a third of people. Too many journeymen (and women)"}, {"title": "European Account Manager", "text": "Pros Strong Product set, clients want to do business with Colt and hardwork does deliver results. Allow home working, new strategy supports driven individuals. Cons Processes can be cumbersome but individuals are happy to support.", "rating": 5, "pros": "Strong Product set, clients want to do business with Colt and hardwork does deliver results.", "cons": "Processes can be cumbersome but individuals are happy to support.", "advice": null}, {"title": "Good", "text": "Pros All good with working in colt Cons Nothing to explain much, only smt has to be explorable", "rating": 5, "pros": "All good with working in colt", "cons": "Nothing to explain much, only smt has to be explorable", "advice": null}, {"title": "Colt", "text": "Pros Flexible, varied work environment. Strong new senior leadership team Cons lack of career progression. lack of growth in recent years and frequent u-turns on strategy", "rating": 3, "pros": "Flexible, varied work environment. Strong new senior leadership team", "cons": "lack of career progression. lack of growth in recent years and frequent u-turns on strategy", "advice": null}, {"title": "Positive changes", "text": "Pros New CEO Carl Griviner is a very positive force who is making significant changes that are positive for the company going forward Cons The middle management team are now better but some of the most senior team need to be changed to deliver what Carl wants. Advice to Management Have a hard long look at what the most senior team are delivering themselves.", "rating": 5, "pros": "New CEO Carl Griviner is a very positive force who is making significant changes that are positive for the company going forward", "cons": "The middle management team are now better but some of the most senior team need to be changed to deliver what Carl wants.", "advice": "Have a hard long look at what the most senior team are delivering themselves."}, {"title": "Changing Times", "text": "Pros A good competitive offering. As a pan European telco with its own fibre they can deliver a strongly differentiated solution with great SLA's - and they can win on price when they need to. Decent package with eye watering good pension contributions and health care insurance. Cons They are strongly rumoured to be up for sale - Level3 and AT&T are the rumoured acquirers. Too much uncertainty cramping enthusiasm. Too little invested In people development. Advice to Management Come clean on take over rumours and if you need more down sizing to be fit for sale get on and get it done.", "rating": 5, "pros": "A good competitive offering. As a pan European telco with its own fibre they can deliver a strongly differentiated solution with great SLA's - and they can win on price when they need to.", "cons": "They are strongly rumoured to be up for sale - Level3 and AT&T are the rumoured acquirers. Too much uncertainty cramping enthusiasm. Too little invested", "advice": "Come clean on take over rumours and if you need more down sizing to be fit for sale get on and get it done."}, {"title": "Colt are OK", "text": "Pros International exposure; huge investment in infrastructure Cons Political; continuous strategy changes; Fidelity ownership Advice to Management Pick a strategy and stick to it for at least a few months", "rating": 3, "pros": "International exposure; huge investment in infrastructure", "cons": "Political; continuous strategy changes; Fidelity ownership", "advice": "Pick a strategy and stick to it for at least a few months"}, {"title": "Career Suicide", "text": "Pros Nothing..Just initial offer stating handsome salary Cons The salary offered is just a lie...The actual is less HR department is pathetic..No idea what they are doing, The management is a joke and their policies as well. Showing you false dreams in beginning and then leading to your career murder. Advice to Management Stop fooling people , specially your employees. Have a bit of humanity", "rating": 1, "pros": "Nothing..Just initial offer stating handsome salary", "cons": "The salary offered is just a lie...The actual is less", "advice": "Stop fooling people , specially your employees."}, {"title": "Good Organization", "text": "Pros Great work life balance, employee friendly, great perks, looks out for employee's comfort, well defined processes. Cons Since it's a process driven company work can be monotonous. Lesser Growth opportunities.", "rating": 5, "pros": "Great work life balance, employee friendly, great perks, looks out for employee's comfort, well defined processes.", "cons": "Since it's a process driven company work can be monotonous. Lesser Growth opportunities.", "advice": null}, {"title": "Good", "text": "Pros Earlier lots of benefits were there Cons Now salary hike is very less", "rating": 3, "pros": "Earlier lots of benefits were there", "cons": "Now salary hike is very less", "advice": null}, {"title": "ok-ish", "text": "Pros good benefits. laid back. some good technical people around Cons too laid back for me. Advice to Management wake up.", "rating": 3, "pros": "good benefits. laid back. some good technical people around", "cons": "too laid back for me.", "advice": "wake up."}, {"title": "Good organisation to work for so far", "text": "Pros Good organisation to work for Cons lots of organisation structural changes Advice to Management NA", "rating": 5, "pros": "Good organisation to work for", "cons": "lots of organisation structural changes", "advice": "NA"}, {"title": "Best For Career Starters, will give a boost", "text": "Pros First Of All, good work life balance.Best in terms of initial hike from previous employer.In starting you will love to be here, but don't love it so much that by the end you find it difficult to move ahead.Keep looking for certifications from outside, but in terms of hike or for starters it's the best, but just don't get stuck to it. Cons Management is getting worse day by day due to recent crunch which was not there before.Dont work for more then 2 years else your skill set will degrade and you will find yourself nowhere because of your comfort level Advice to Management Stop doing politics, letting your employees sit with old version applications and degrading will not help Colt.", "rating": 3, "pros": "First Of All, good work life balance.Best in terms of initial hike from previous employer.In starting you will love to be here, but don't love it so much that by the end you find it difficult to move ahead.Keep looking for certifications from outside, but in terms of hike or for starters it's the best, but just don't get stuck to it.", "cons": "Management is getting worse day by day due to recent crunch which was not there before.Dont work for more then 2 years else your skill set will degrade and you will find yourself nowhere because of your comfort level", "advice": "Stop doing politics, letting your employees sit with old version applications and degrading will not help Colt."}, {"title": "Associate Networkengeer", "text": "Pros Good employee to work with. Most of the manager is evaluating the employee correctly. Cons In Colt Japan we don't have enough resource so that overtime work is happening in most of the team. Advice to Management Need more employee to work with. Most of the team have resource issue and that made the project / daily work not on time.", "rating": 3, "pros": "Good employee to work with.", "cons": "In Colt Japan we don't have enough resource so that overtime work is happening in most of the team.", "advice": "Need more employee to work with."}, {"title": "technical lead", "text": "Pros work life balance is good. Cons poor work quality. monotonous work. No personal growth Advice to Management wake up to the new technologies and implement the same", "rating": 3, "pros": "work life balance is good.", "cons": "poor work quality. monotonous work. No personal growth", "advice": "wake up to the new technologies and implement the same"}, {"title": "Treatment to Long term contractors", "text": "Pros The company was good, however during the last 2 years it has become worse place to work Cons Due to all the internal politics, they are treating their employees very badly. Even using Vendors for political reasons, the Management are fighting among themselves using these long terms vendors as an excuse. Advice to Management Such a management is not worth it no matter what. The company will never maintain good resources with all the bickering & politics. All employees and vendors will loose faith in the company", "rating": 1, "pros": "The company was good, however during the last 2 years it has become worse place to work", "cons": "Due to all the internal politics, they are treating their employees very badly. Even using Vendors for political reasons, the Management are fighting among themselves using these long terms vendors as an excuse.", "advice": "Such a management is not worth it no matter what. The company will never maintain good resources with all the bickering & politics. All employees and vendors will loose faith in the company"}, {"title": "Good company to work for", "text": "Pros Great work life balance, employee friendly, great perks, looks out for employee's comfort. Cons Management lags the competent approach, looking at market and talent inside the company has lot more potential which is under utilized.", "rating": 5, "pros": "Great work life balance, employee friendly, great perks, looks out for employee's comfort.", "cons": "Management lags the competent approach, looking at market and talent inside the company has lot more potential which is under utilized.", "advice": null}, {"title": "Good", "text": "Pros Work Life Balance and mostly weekends are off Cons Difficult to approach SMT, Promotions are slow Advice to Management provide same benefits to Indian employees as in UK or Europe, e.g maternity leaves", "rating": 5, "pros": "Work Life Balance and mostly weekends are off", "cons": "Difficult to approach SMT, Promotions are slow", "advice": "provide same benefits to Indian employees as in UK or Europe, e.g maternity leaves"}, {"title": "senior technical lead", "text": "Pros good is company , we balance work and life Cons management is not good about decision making", "rating": 5, "pros": "good is company , we balance work and life", "cons": "management is not good about decision making", "advice": null}, {"title": "Love it!", "text": "Pros - nice place to work, plenty of possibilities for career development - encourages learning - global exposure Cons Frequent changes, but can also be taken advantage of, as opportunities", "rating": 5, "pros": "- nice place to work, plenty of possibilities for career development", "cons": "Frequent changes, but can also be taken advantage of, as opportunities", "advice": null}, {"title": "Sales Account Executive", "text": "Pros flexibility, innovation, grow, x, x Cons changes, x, y, z, m", "rating": 3, "pros": "flexibility, innovation, grow, x, x", "cons": "changes, x, y, z, m", "advice": null}, {"title": "Could be much better with what they invest in org", "text": "Pros Facilities like Cabs, Work-life balance, average compensation Cons Bureaucracy, very slow growth, No good market value after working here for more than 3-4 years, Advice to Management Don't push entire work to tech leads/Sr engineers. Need to take care of escalations, mails by self too. Need to become leaders rather than just bosses.", "rating": 3, "pros": "Facilities like Cabs, Work-life balance, average compensation", "cons": "Bureaucracy, very slow growth, No good market value after working here for more than 3-4 years,", "advice": "Don't push entire work to tech leads/Sr engineers. Need to take care of escalations, mails by self too. Need to become leaders rather than just bosses."}, {"title": "Regional sales manager", "text": "Pros Ability to make flexible work decision with the management trusts individual to decide, challenging landscape and fulfilling work pace to projects. Cons Limited human resources as culture of company is such where people refuses to take work ownership makes progress harder to fulfill Advice to Management Unbaised work appraisal to review individual's work and to retain employees through rewards that are truly rewarding.", "rating": 3, "pros": "Ability to make flexible work decision with the management trusts individual to decide, challenging landscape and fulfilling work pace to projects.", "cons": "Limited human resources as culture of company is such where people refuses to take work ownership makes progress harder to fulfill", "advice": "Unbaised work appraisal to review individual's work and to retain employees through rewards that are truly rewarding."}, {"title": "Good Place to work", "text": "Pros its Good place to work, Work life balance Cons Sometime little politics will pull you down", "rating": 5, "pros": "its Good place to work, Work life balance", "cons": "Sometime little politics will pull you down", "advice": null}, {"title": "Excelllent Company", "text": "Pros Stability is prime concern. Need to review. Cons Need to remove middle management Advice to Management Please fire to middle management after that company will improve.", "rating": 5, "pros": "Stability is prime concern. Need to review.", "cons": "Need to remove middle management", "advice": "Please fire to middle management after that company will improve."}, {"title": "Network Engineer", "text": "Pros Good work culture, ac cabs and free meals Cons Management unstable, job security unsure Advice to Management nothing", "rating": 5, "pros": "Good work culture, ac cabs and free meals", "cons": "Management unstable, job security unsure", "advice": "nothing"}, {"title": "Tech lead", "text": "Pros Good work life balance Cons Very little downside, almost none Advice to Management Management should take note of good candidate and promote them.", "rating": 5, "pros": "Good work life balance", "cons": "Very little downside, almost none", "advice": "Management should take note of good candidate and promote them."}, {"title": "Interesting times", "text": "Pros Flexible working, good people to work with. Cons Poor incentive plan processes and recognition.", "rating": 3, "pros": "Flexible working, good people to work with.", "cons": "Poor incentive plan processes and recognition.", "advice": null}, {"title": "All of this has happened before. And it will happen again.", "text": "Pros Timely and good payment with benefits (Ticket restaurant, private health insurance, pension plan), opportunities to work interdisciplinary and develop sideways. Cons The usual games of politics you can find in any corporate environment. If the manager likes you, you can sky-rocket. If not, your development might suffer. Constant changes! Though changes are good and necessary to survive, going in circles isn't. We seem to be going back to where we were 5 years ago. Advice to Management Stop re-branding every 6 months. Nobody even knows what department they are working in anymore! And don't be afraid of showing the door to the right people. Sometimes it seems like stating that you're in the union gives you a free pass to not having to work.", "rating": 5, "pros": "Timely and good payment with benefits (Ticket restaurant, private health insurance, pension plan), opportunities to work interdisciplinary and develop sideways.", "cons": "The usual games of politics you can find in any corporate environment. If the manager likes you, you can sky-rocket. If not, your development might suffer.", "advice": "Stop re-branding every 6 months. Nobody even knows what department they are working in anymore!"}, {"title": "Good Place to Work", "text": "Pros Hands down, the Work Life balance is amazing. The people are what makes you feel like working for this organization (though depends on whom you are working with; but Hey!! isn't that how it is everywhere; you get a mix of them right !! :) ) The management is great too (including the mid-management). Again, as they say - \"You cannot choose your boss.\" So, totally depends whom you are working with, people may have different opinion… My colleagues and Leaders are some of the friendliest and most helpful people I have ever met. Management is very supportive of work/life balance. It is awesome to work for a company that values its employees so highly. I love how open and honest our CEO and his direct reports are with employees - knowing what is going on makes me feel like I'm part of the team and play a role in its success. Provides great opportunities to employees for Personal Development by investing in learning needs of employees and giving lot of exposure to employees to contribute and return to Society by volunteering in CSR Activities and making tangible change by the contribution. Cons Can sometimes be a little conservative and slow. Very budget conscious. Curious choices where company spends and where it does not. Advice to Management You guys are great. It's an enriching experience to work here. India is in an exciting phase and am glad to be a part of it. I love my job and this company. Keep up the current direction and don't be afraid to cut ties with those who no longer bring passion to the job. The market is changing and we need all of those bright minds pushing us forward!", "rating": 5, "pros": "Hands down, the Work Life balance is amazing. The people are what makes you feel like working for this organization (though depends on whom you are working with; but Hey!! isn't that how it is everywhere; you get a mix of them right !! :) ) The management is great too (including the mid-management). Again, as they say - \"You cannot choose your boss.\" So, totally depends whom you are working with, people may have different opinion… My colleagues and Leaders are some of the friendliest and most helpful people I have ever met. Management is very supportive of work/life balance. It is awesome to work for a company that values its employees so highly.", "cons": "Can sometimes be a little conservative and slow. Very budget conscious. Curious choices where company spends and where it does not.", "advice": "You guys are great. It's an enriching experience to work here. India is in an exciting phase and am glad to be a part of it."}, {"title": "Manager - IT support", "text": "Pros Good Work Life Balance and lots of Opportunities to work on new Technologies Cons Frequently changes in Management Team and high attrition rates", "rating": 5, "pros": "Good Work Life Balance and lots of Opportunities to work on new Technologies", "cons": "Frequently changes in Management Team and high attrition rates", "advice": null}, {"title": "Good for individual growth", "text": "Pros good place to work. BLR office and people are very friendly Cons each and everything driven from GGN office Advice to Management too much of re-org in Colt which loose your interest", "rating": 3, "pros": "good place to work. BLR office and people are very friendly", "cons": "each and everything driven from GGN office", "advice": "too much of re-org in Colt which loose your interest"}, {"title": "Great company...but in transition", "text": "Pros Ability to advance + prove yourself Many global sites...UK, pan-Europe, India Fantastic Learning & Development team Cons Constant change, eg, business model, focus of business, often restructuring Often not clear to workforce the strategic direction of the business Advice to Management Beware change fatigue amongst workforce Be clear, be proud about where the business is going next Have more technical awareness training for non-technical staff so emerging technologies, etc. are understood and put into context", "rating": 3, "pros": "Ability to advance + prove yourself", "cons": "Constant change, eg, business model, focus of business, often restructuring", "advice": "Beware change fatigue amongst workforce"}, {"title": "Company struggling", "text": "Pros 8-5 shift, free cab, meals, work from home once a week, ample leaves Cons little learning, no development, constant fear of job loss, too much politics, bosses with low IQ. Projects are kicked off and no business comes. Advice to Management management is new, and struggling to keep the company running", "rating": 3, "pros": "8-5 shift, free cab, meals, work from home once a week, ample leaves", "cons": "little learning, no development, constant fear of job loss, too much politics, bosses with low IQ. Projects are kicked off and no business comes.", "advice": "management is new, and struggling to keep the company running"}, {"title": "Great place to work- Should advertise more", "text": "Pros Benefits and perks are at par with the best names in industry. Some of the benefits are better than the hyped employers. Should advertise more! Cons They can do better at retention.", "rating": 5, "pros": "Benefits and perks are at par with the best names in industry. Some of the benefits are better than the hyped employers. Should advertise more!", "cons": "They can do better at retention.", "advice": null}, {"title": "Colt India", "text": "Pros Good benefits and work culture Cons Long term growth prospects needs to be improved", "rating": 5, "pros": "Good benefits and work culture", "cons": "Long term growth prospects needs to be improved", "advice": null}, {"title": "Technical analyst", "text": "Pros Good packages health card plus restaurant card and international atmosphere. Cons No clear projects views and teams often left wandering with not own seat and desk. I won't advice it for a career path just useful for a experience starting from a scratch. Advice to Management Care more about their stuff and set up clear goals and productive merits in order to manage better the Company.", "rating": 3, "pros": "Good packages health card plus restaurant card and international atmosphere.", "cons": "No clear projects views and teams often left wandering with not own seat and desk.", "advice": "Care more about their stuff and set up clear goals and productive merits in order to manage better the Company."}, {"title": "IP Lead Coordinator", "text": "Pros Good salary and some autonomous for being a shared center in Barcelona/Spain. Cons Sr managment has very unclear view of how to grow business. Every year they try to cut 8-10% of the staff (as they see this as the negative part on the balance sheet).", "rating": 3, "pros": "Good salary and some autonomous for being a shared center in Barcelona/Spain.", "cons": "Sr managment has very unclear view of how to grow business. Every year they try to cut 8-10% of the staff (as they see this as the negative part on the balance sheet).", "advice": null}, {"title": "Good company with poor management", "text": "Pros Good to start career with Good pay master Free lunch and cab facility Good infrastructure Rewards and recognitions Cons Vision and mission keeps on changing Does not encourage IJP ( they are almost fixed) Low quality in job profiles Does not want to learn from its competitors Job security is very low Stagnant Management, does not provide much growing opportunities to lower hierarchy employees Advice to Management Please encourage automations and new technology to compete in industry. Adopt best practices and encourage your employees to avail good internal opportunities for growth", "rating": 3, "pros": "Good to start career with", "cons": "Vision and mission keeps on changing", "advice": "Please encourage automations and new technology to compete in industry. Adopt best practices and encourage your employees to avail good internal opportunities for growth"}, {"title": "In Transition", "text": "Pros Good benefits. Internal communications are constant and well presented by the management team. Always informed. Cons In constant change. Management team are always changing values. There isn't a constant message or story to tell your customers. Not as customer focused as the staff would like. Great at forming strategy, but poor on execution. Advice to Management Focus on the basics, Truly look after your customers. Simplify the systems and process to add value so that the employees can do their day jobs.", "rating": 3, "pros": "Good benefits. Internal communications are constant and well presented by the management team. Always informed.", "cons": "In constant change. Management team are always changing values. There isn't a constant message or story to tell your customers. Not as customer focused as the staff would like. Great at forming strategy, but poor on execution.", "advice": "Focus on the basics, Truly look after your customers. Simplify the systems and process to add value so that the employees can do their day jobs."}, {"title": "A good place to work - there over 7 years", "text": "Pros The people at Colt (called 'Colties' within the company) are great to work with, and are encouraged to be open and helpful, which generally they live up to. I worked with colleagues from all around Europe and offshore teams in India, pretty autonomously, and found the work involving and rewarding. I always felt that Colt were engaged with their employees and took their interests into account when making business decisions. There is a good work/life balance, and the pension arrangements were very generous, especially for a greybeard like me ! Cons I went full circle with Colt - headhunted in, redundancy out. The company has recently de-listed from the FTSE and has returned to private ownership in the form of the principal investor, Fidelity. This contributed to the exit from particular market sectors and led to a lot of redundancies - my entire team is gone. Advice to Management Some of the high level strategic decisions about addressing the market didn't work out, but I wouldn't presume to give advice about that - my feeling is that the call would have been made on the best data available to the senior management team at the time - hindsight is 20/20 !", "rating": 5, "pros": "The people at Colt (called 'Colties' within the company) are great to work with, and are encouraged to be open and helpful, which generally they live up to. I worked with colleagues from all around Europe and offshore teams in India, pretty autonomously, and found the work involving and rewarding. I always felt that Colt were engaged with their employees and took their interests into account when making business decisions. There is a good work/life balance, and the pension arrangements were very generous, especially for a greybeard like me !", "cons": "I went full circle with Colt - headhunted in, redundancy out. The company has recently de-listed from the FTSE and has returned to private ownership in the form of the principal investor, Fidelity. This contributed to the exit from particular market sectors and led to a lot of redundancies - my entire team is gone.", "advice": "Some of the high level strategic decisions about addressing the market didn't work out, but I wouldn't presume to give advice about that - my feeling is that the call would have been made on the best data available to the senior management team at the time - hindsight is 20/20 !"}, {"title": "So-So only bcoz of general shift timings", "text": "Pros Good shift timing but in fanance dept too much work load . Cons No work life balance..no flexibility to work from home", "rating": 3, "pros": "Good shift timing but in fanance dept too much work load .", "cons": "No work life balance..no flexibility to work from home", "advice": null}, {"title": "Used to be a great company", "text": "Pros - good salary structure, best on indian soil maybe - good learning opportunities for 3 to 6 yrs experience - free cab and lunch, although i didn't utilize either - good office infrastructure Cons job prospects and security unclear for now Advice to Management please decide on a vision and stick to it, in my almost 6 yrs, i saw 5 different visions", "rating": 5, "pros": "- good salary structure, best on indian soil maybe", "cons": "job prospects and security unclear for now", "advice": "please decide on a vision and stick to it, in my almost 6 yrs, i saw 5 different visions"}, {"title": "Best Place to Work", "text": "Pros 1. You will get to learn more and widen your horizon 2. Effective Top Engagement and Mid-Level Management 3. With New CEO we can look forward for best 4. Transparent Communications from CXO's and Top Management 5. Best Work Life Balance 6. You will be rewarded for best work and initiatives. Cons 1. Changes in Business Operating Model 2. Lack of Ownership in some areas", "rating": 5, "pros": "1. You will get to learn more and widen your horizon", "cons": "1. Changes in Business Operating Model", "advice": null}, {"title": "good", "text": "Pros best place for mid career Cons nothing to comment on this Advice to Management too many process can be minimized for betterment", "rating": 5, "pros": "best place for mid career", "cons": "nothing to comment on this", "advice": "too many process can be minimized for betterment"}, {"title": "old fashion Telecom company", "text": "Pros Good benefits (pension, holidays) good balance work- life Sense of community encouraged by HR Cons middle aged work force too process-oriented// not automated enough customer experience is not in the company's mindset at all Advice to Management simplify the operations- be innovative as you are a utility provider and nothing distinguish COLT from its competition", "rating": 1, "pros": "Good benefits (pension, holidays)", "cons": "middle aged work force", "advice": "simplify the operations- be innovative as you are a utility provider and nothing distinguish COLT from its competition"}, {"title": "Good Company", "text": "Pros work life balace, good polices Cons not much technical work to learn Advice to Management try to focus on internal resourse rather then hiring wrong people on higher pay", "rating": 3, "pros": "work life balace, good polices", "cons": "not much technical work to learn", "advice": "try to focus on internal resourse rather then hiring wrong people on higher pay"}, {"title": "Good employer for Spain", "text": "Pros Good compensations and flexible working hours including working from home (depends on manager approval). Possible to use your own laptop with some compensation. Pay is OK for Spain, however i other locations it might not be as good. Cons No \"strategy\" for how to advance the company. Very bad at communicating. Projects run overtime by months, get renamed into something else, and continue to overrun. Managed Services is being sold to another company. Advice to Management Learn to communicate with your employees. Please find a way to actually deliver projects, and no, you are not an agile company when you take months to make a change.", "rating": 3, "pros": "Good compensations and flexible working hours including working from home (depends on manager approval).", "cons": "No \"strategy\" for how to advance the company.", "advice": "Learn to communicate with your employees."}, {"title": "Nice company to work for", "text": "Pros Good perks, good health cover. Cons The company has not performed well in the past couple of years, impacting annual bonuses", "rating": 5, "pros": "Good perks, good health cover.", "cons": "The company has not performed well in the past couple of years, impacting annual bonuses", "advice": null}, {"title": "Company review", "text": "Pros Nil.. there is nothing good about this company. Cons company doesnt have a good leadership. Strategy keeps changing.", "rating": 3, "pros": "Nil.. there is nothing good about this company.", "cons": "company doesnt have a good leadership. Strategy keeps changing.", "advice": null}, {"title": "Project Manager", "text": "Pros Great Company to work for, flexible benefits and great work/life balance Cons several restructures in past few years", "rating": 5, "pros": "Great Company to work for, flexible benefits and great work/life balance", "cons": "several restructures in past few years", "advice": null}, {"title": "Management", "text": "Pros Flexibility with time, salaries aren't bad Cons Management need to be changed, it's horrible the way they threat you Advice to Management Change it", "rating": 3, "pros": "Flexibility with time, salaries aren't bad", "cons": "Management need to be changed, it's horrible the way they threat you", "advice": "Change it"}, {"title": "Colt", "text": "Pros International company / London / Telecomunication Cons nothing, it's a very good conpany to grow up", "rating": 5, "pros": "International company / London / Telecomunication", "cons": "nothing, it's a very good conpany to grow up", "advice": null}, {"title": "a fair to middling experience", "text": "Pros Colt has some great technology pluses and had, until recently, a full spectrum of product and service offerings in the network, IT managed services, and data centre spaces. The company offers competitive salaries and a great pension and benefits package. Cons For not such a large organisation, Colt has some of the hallmarks of a very large company, e.g. bureaucracy, shifts in strategy/direction, and going multiple directions at once without the left hand knowing what the right is doing. It can be frustrating. Advice to Management Let projects run their course and stop lurching from one \"great idea\" to the next \"great idea\" without waiting to see any results from the first or even allowing it to complete.", "rating": 3, "pros": "Colt has some great technology pluses and had, until recently, a full spectrum of product and service offerings in the network, IT managed services, and data centre spaces. The company offers competitive salaries and a great pension and benefits package.", "cons": "For not such a large organisation, Colt has some of the hallmarks of a very large company, e.g. bureaucracy, shifts in strategy/direction, and going multiple directions at once without the left hand knowing what the right is doing. It can be frustrating.", "advice": "Let projects run their course and stop lurching from one \"great idea\" to the next \"great idea\" without waiting to see any results from the first or even allowing it to complete."}, {"title": "good company to work", "text": "Pros Good company to work .....good salary Cons No future of company and limited growth options", "rating": 5, "pros": "Good company to work .....good salary", "cons": "No future of company and limited growth options", "advice": null}, {"title": "Senior Analyst - Operations", "text": "Pros Good for women, work life balance Cons Transport is troublesome, Food is worse", "rating": 5, "pros": "Good for women, work life balance", "cons": "Transport is troublesome, Food is worse", "advice": null}, {"title": "Specialist", "text": "Pros flexible work hour. good relationship in the team Cons frequent restructuring. there is no clear direction on SMT", "rating": 3, "pros": "flexible work hour. good relationship in the team", "cons": "frequent restructuring. there is no clear direction on SMT", "advice": null}, {"title": "Good conditions but unstable enviroment", "text": "Pros good salaries compared to other companies, good benefits like ticket restaurant and private health insurance, nice building and location. Cons Too much changes and reorgs. Not a stable enviroment. Internal organization is chaotic, too many teams, workflow isn't fluent. The processes are difficult, too many systems and oldfashioned programs. You get stuck in a salary range, hard to develop Advice to Management Come down to the field and see what is happening and how employees are feeling", "rating": 3, "pros": "good salaries compared to other companies, good benefits like ticket restaurant and private health insurance, nice building and location.", "cons": "Too much changes and reorgs. Not a stable enviroment. Internal organization is chaotic, too many teams, workflow isn't fluent. The processes are difficult, too many systems and oldfashioned programs. You get stuck in a salary range, hard to develop", "advice": "Come down to the field and see what is happening and how employees are feeling"}, {"title": "not clear strategy , all time firing people", "text": "Pros Good colleagues, you have a better enviroment. The balance work - life is very good home work benefits Cons where is this company going !!!!!!!!!!!!!! all time with excuses, they are firing people", "rating": 1, "pros": "Good colleagues, you have a better enviroment. The balance work - life is very good", "cons": "where is this company going !!!!!!!!!!!!!!", "advice": null}, {"title": "Could be an amazing company...", "text": "Pros Good salary, good colleagues, and possibilities to evoluate Cons There's no direction, no long term strategy, lack of vision coming from management, a cost cutting policy nearly permanent, and reorganizations nearly every 6 months", "rating": 3, "pros": "Good salary, good colleagues, and possibilities to evoluate", "cons": "There's no direction, no long term strategy, lack of vision coming from management, a cost cutting policy nearly permanent, and reorganizations nearly every 6 months", "advice": null}, {"title": "Barcelona", "text": "Pros Salary competitive although not as much as a few years back. Good contract and beneits like ticket restaurant, health insurance and pension. Varied roles. Cons Far too many changes or structure over the last 4 years. Employees now worn out. Looks like this year the company will be drastically streamlining and general rumour is in prep to sell on. Hard to progress once you hit certain pay grade. Advice to Management Look down more-", "rating": 3, "pros": "Salary competitive although not as much as a few years back. Good contract and beneits like ticket restaurant, health insurance and pension. Varied roles.", "cons": "Far too many changes or structure over the last 4 years. Employees now worn out. Looks like this year the company will be drastically streamlining and general rumour is in prep to sell on.", "advice": "Look down more-"}, {"title": "colt review", "text": "Pros work life balance, good working culture Cons no growth, higher people only think of their growth Advice to Management should give growth to middle level employees too, HR has no connectivity with employees", "rating": 3, "pros": "work life balance, good working culture", "cons": "no growth, higher people only think of their growth", "advice": "should give growth to middle level employees too, HR has no connectivity with employees"}, {"title": "Enough with the experiments, let’s get back to being a Telecom company", "text": "Pros Knowledge base and working relationship of colleagues in Operations and Engineering, salary, pension, flexibility in working i.e. WFH, TOIL, Flexi hours, some strong management in Operations up until SMT. Empowerment to make decisions quickly at a technical level. We still have some very good customer - hanging in just in case we turn a corner :) Cons The whole 'Enterprise Services' experiment was a disaster, how the CEO ever managed to keep his job after that shambles I really don't know. SMT managed to turn a silk purse of a Telecoms company into a pigs ear of a Cloud, IT service, Data storage Frankenstein monster of a company. Advice to Management Get back to basics - WE ARE A TELCO - We were a very good one at one point. Wonder if there is anyone dynamic enough in the SMT to get us back to what we are good at. Bring in fresh blood at all levels. Stop sacking good engineers. Move HR from India back to Euro (The whole company would like that).", "rating": 3, "pros": "Knowledge base and working relationship of colleagues in Operations and Engineering, salary, pension, flexibility in working i.e. WFH, TOIL, Flexi hours, some strong management in Operations up until SMT. Empowerment to make decisions quickly at a technical level. We still have some very good customer - hanging in just in case we turn a corner :)", "cons": "The whole 'Enterprise Services' experiment was a disaster, how the CEO ever managed to keep his job after that shambles I really don't know. SMT managed to turn a silk purse of a Telecoms company into a pigs ear of a Cloud, IT service, Data storage Frankenstein monster of a company.", "advice": "Get back to basics - WE ARE A TELCO - We were a very good one at one point. Wonder if there is anyone dynamic enough in the SMT to get us back to what we are good at. Bring in fresh blood at all levels. Stop sacking good engineers. Move HR from India back to Euro (The whole company would like that)."}, {"title": "Team Lead", "text": "Pros Good work life balance,Free food,transport Cons Management,Politics.No vision at all.Bangalore is treated as a back office for Gurgaon.No senior management presence in bangalore Advice to Management Reduce politics try to work together", "rating": 3, "pros": "Good work life balance,Free food,transport", "cons": "Management,Politics.No vision at all.Bangalore is treated as a back office for Gurgaon.No senior management presence in bangalore", "advice": "Reduce politics try to work together"}, {"title": "about Colt", "text": "Pros Very dynamic company in continuous change with new opportunities arising frequently. Career growth possibilities. Cons Old systems and tools generating a lot of manual work and human mistakes.", "rating": 5, "pros": "Very dynamic company in continuous change with new opportunities arising frequently. Career growth possibilities.", "cons": "Old systems and tools generating a lot of manual work and human mistakes.", "advice": null}, {"title": "Colt SSE", "text": "Pros Good Facilities; Work Lie Balance Cons Not vertical Career Growth. Mid Sized team getting saturated.", "rating": 5, "pros": "Good Facilities; Work Lie Balance", "cons": "Not vertical Career Growth. Mid Sized team getting saturated.", "advice": null}, {"title": "Opened for new technologies and techniques but poor in managing projects.", "text": "Pros Smart tech people but majoriry are consultants. Feedback listened but in vain. Tends to put people in the right place but after peole request. Cons Way too many staff that are paid for excel work. Sorry but wy too man indians. Slow processing of administrative issues. Advice to Management Revise your low cost hiring policy", "rating": 3, "pros": "Smart tech people but majoriry are consultants. Feedback listened but in vain. Tends to put people in the right place but after peole request.", "cons": "Way too many staff that are paid for excel work. Sorry but wy too man indians. Slow processing of administrative issues.", "advice": "Revise your low cost hiring policy"}, {"title": "Good place to work", "text": "Pros Very good place to work from all aspects. work and personal life balanced. Salary and work environment is very good. Communication and interaction with the people is good. Cons Process wise, its still stream lining. apart from this I found it very good.", "rating": 5, "pros": "Very good place to work from all aspects. work and personal life balanced. Salary and work environment is very good. Communication and interaction with the people is good.", "cons": "Process wise, its still stream lining. apart from this I found it very good.", "advice": null}, {"title": "Good organization to work with", "text": "Pros Work life balance is very good. Salary is moderate to high, Leaves are enough and can also be carry forwarded, Learning opportunity is ample, Transport service is very good Cons Some senior management people doesn't look confident with the action they have taken; Lots of organisational change, Unstability Advice to Management Please set up some goal/vision which looks realistic and achievable", "rating": 5, "pros": "Work life balance is very good. Salary is moderate to high, Leaves are enough and can also be carry forwarded, Learning opportunity is ample, Transport service is very good", "cons": "Some senior management people doesn't look confident with the action they have taken; Lots of organisational change, Unstability", "advice": "Please set up some goal/vision which looks realistic and achievable"}, {"title": "Good place to progress your career", "text": "Pros Company itself is divided in 4 business unit that are well differentiated. Databases are well structured and sensible data is really well managed. Benefits are really good too. Cons No transparency with their employees, every 2 years company do a restructuring process which fires a lot of people. Advice to Management Be more transparent with your employees.", "rating": 3, "pros": "Company itself is divided in 4 business unit that are well differentiated. Databases are well structured and sensible data is really well managed. Benefits are really good too.", "cons": "No transparency with their employees, every 2 years company do a restructuring process which fires a lot of people.", "advice": "Be more transparent with your employees."}, {"title": "Lost its way", "text": "Pros Good pay, flexible working and some blue chip clients Cons Way too many to list Advice to Management Stop stifling the talent", "rating": 1, "pros": "Good pay, flexible working and some blue chip clients", "cons": "Way too many to list", "advice": "Stop stifling the talent"}, {"title": "Technical analyst", "text": "Pros nice environment for work and for someone who really need to learn, teamwork, Cons Management is an issue. Real Communication issue with HR especially feedback Advice to Management .", "rating": 3, "pros": "nice environment for work and for someone who really need to learn, teamwork,", "cons": "Management is an issue. Real Communication issue with HR especially feedback", "advice": "."}, {"title": "nice place to work with very negative outlook on the company's future", "text": "Pros good place to work, good balance work / private life, very good salari + benefits Cons blind management, too many changes in so little time. no clear strategy.", "rating": 3, "pros": "good place to work, good balance work / private life, very good salari + benefits", "cons": "blind management, too many changes in so little time. no clear strategy.", "advice": null}, {"title": "Projects", "text": "Pros Can do approach to get things done. Active supportive manager. The people made the company. Team approach across was the reason things got done. Salaries and Pension was good Cons Politics spoilt a friendly active and creative environment. Need to decide what business they are in and focus on achieving Advice to Management Make the most of the people in the business and draw on their talents. Decide what business you want to be in and then deliver", "rating": 3, "pros": "Can do approach to get things done. Active supportive manager. The people made the company. Team approach across was the reason things got done. Salaries and Pension was good", "cons": "Politics spoilt a friendly active and creative environment. Need to decide what business they are in and focus on achieving", "advice": "Make the most of the people in the business and draw on their talents. Decide what business you want to be in and then deliver"}, {"title": "Good if you have stamina", "text": "Pros If you're willing to roll up your sleeves, you can easily be given the opportunity to drive bottom line results. Cons The super-heros of the status quo still keep the company anchored in the past, defend the \"we've always done it like this\" / \"you don't understand, it's so complicated\"...you'll need high stamina to make a difference.", "rating": 3, "pros": "If you're willing to roll up your sleeves, you can easily be given the opportunity to drive bottom line results.", "cons": "The super-heros of the status quo still keep the company anchored in the past, defend the \"we've always done it like this\" / \"you don't understand, it's so complicated\"...you'll need high stamina to make a difference.", "advice": null}, {"title": "grey future", "text": "Pros multicultural environment, high benefits. Cons most of depts will be migrated to SSC Romania in a few years.", "rating": 3, "pros": "multicultural environment, high benefits.", "cons": "most of depts will be migrated to SSC Romania in a few years.", "advice": null}, {"title": "Company has gone from best to good and heading towards bad due to indian Management", "text": "Pros Work life balance, facilities, insurance, mid size company, if you like little high salary job as compared to the market for less work, you can go for COLT. If you need an increment better resign and ask for a raise otherwise you will end up long and long discussions. Cons The whole company is divided into silo, too many and frequent organisation changes, Management talks about vision but they don't have any vision. Too much bureaucracy between the departments. You will see company going for too many cost cutting practices, CEO, MD India, HR India dying for small savings and more efficiency and also you will see costly acquisitions, branding, parties, everyday zoomba classes :P:P. This is so controversial. good luck joining COLT. Advice to Management HR India sucks. too many people for small task. it used to be better one but current HR leadership has forgotten that HR is facilitator and not a controller. This is strange that all decisions taken by CEO has failed in past and he was never accountable for any of the failures. and some other guy as sacked. Its time to give your seat to someone else.", "rating": 3, "pros": "Work life balance, facilities, insurance, mid size company, if you like little high salary job as compared to the market for less work, you can go for COLT. If you need an increment better resign and ask for a raise otherwise you will end up long and long discussions.", "cons": "The whole company is divided into silo, too many and frequent organisation changes, Management talks about vision but they don't have any vision. Too much bureaucracy between the departments.", "advice": "HR India sucks. too many people for small task. it used to be better one but current HR leadership has forgotten that HR is facilitator and not a controller."}, {"title": "Marketing Manager", "text": "Pros Flexible working and easy day to day tasks. Cons Management support and detailed business understanding, processes, culture. Advice to Management A business is built from the grounds up not top down.", "rating": 1, "pros": "Flexible working and easy day to day tasks.", "cons": "Management support and detailed business understanding, processes, culture.", "advice": "A business is built from the grounds up not top down."}, {"title": "a company that is going places", "text": "Pros great people to work with Cons too many changes for changes sake Advice to Management focus on delivering to the customer - not all the SLA targets that HAVE to be met", "rating": 5, "pros": "great people to work with", "cons": "too many changes for changes sake", "advice": "focus on delivering to the customer - not all the SLA targets that HAVE to be met"}, {"title": "Work Culture", "text": "Pros Good Work culture. Ample to learn. Easy to reach the Management Cons System is obsolete....need to upgrade.... Advice to Management Kindly update the system and appraisal system should be changed......", "rating": 3, "pros": "Good Work culture. Ample to learn. Easy to reach the Management", "cons": "System is obsolete....need to upgrade....", "advice": "Kindly update the system and appraisal system should be changed......"}, {"title": "Network analyst agent", "text": "Pros you have a good package and some good trainers about Siebel software but not about networking specific subject which is shortlisted for some people and it seems briefings badly organized. Cons The environment initially can appear professionally but after a while you realize that they have some management issues and projects are very confusing and some team leaders do not have a clue how to lead a group and the project itself. Often the employees working in without a own seat and desk and pilgrimage inside the Company is usual, which is not professional point from the Company. There is no possibility of progression career in this branch in Barcelona. Advice to Management It is better create clear and effective projects and take more in consideration the working employees conditions to create a quality working environment. Others good advice is to create a career programs and benefits for the best employees.", "rating": 3, "pros": "you have a good package and some good trainers about Siebel software but not about networking specific subject which is shortlisted for some people and it seems briefings badly organized.", "cons": "The environment initially can appear professionally but after a while you realize that they have some management issues and projects are very confusing and some team leaders do not have a clue how to lead a group and the project itself. Often the employees working in without a own seat and desk and pilgrimage inside the Company is usual, which is not professional point from the Company. There is no possibility of progression career in this branch in Barcelona.", "advice": "It is better create clear and effective projects and take more in consideration the working employees conditions to create a quality working environment. Others good advice is to create a career programs and benefits for the best employees."}, {"title": "Moving Downwards", "text": "Pros Work life Balance for most of the profiles Limited Work Home Facility Fairly Good HR Free Meals, CAB Good Pay Cons Too many Org changes May get acquired by another Company anytime Colt is happy spend tons of money on long term contract resources rather than getting FTEs Advice to Management Stop wasting money of useless Projects, Acquisition and Contract resources", "rating": 3, "pros": "Work life Balance for most of the profiles", "cons": "Too many Org changes", "advice": "Stop wasting money of useless Projects, Acquisition and Contract resources"}, {"title": "Italian technical network analyst", "text": "Pros IT is known Company in the networking sector, it can be interesting working there for a short period but it has lackness in employees management. Cons Mismanagement CEO in this Company who are completely disconnected with most of employees, lacks of career paths and technical project have lackness of future programming and developing ones.", "rating": 3, "pros": "IT is known Company in the networking sector, it can be interesting working there for a short period but it has lackness in employees management.", "cons": "Mismanagement CEO in this Company who are completely disconnected with most of employees, lacks of career paths and technical project have lackness of future programming and developing ones.", "advice": null}, {"title": "No more a great place to work", "text": "Pros Flexible work Culture Salary is on the higher side Good managers but in pockets Cons Too many Org changes & too often These days it is all about Politics in this Org Will be sold by 2017", "rating": 3, "pros": "Flexible work Culture", "cons": "Too many Org changes & too often", "advice": null}, {"title": "Colt's pros&cons", "text": "Pros Flexible working, pension plan, nice office furniture Cons Top down approach, very conservative", "rating": 3, "pros": "Flexible working, pension plan, nice office furniture", "cons": "Top down approach, very conservative", "advice": null}, {"title": "Marketing Director", "text": "Pros good brand, good assets, good capabilities, good people, a long term Telco in the european market focused on multinational companies Cons too processed oriented, it is hard to be customer focus and also long term strategy is having too many and too frecuent changes.", "rating": 5, "pros": "good brand, good assets, good capabilities, good people, a long term Telco in the european market focused on multinational companies", "cons": "too processed oriented, it is hard to be customer focus and also long term strategy is having too many and too frecuent changes.", "advice": null}, {"title": "I cannot wait to leave", "text": "Pros Early working hours. Showers are available. Generous salary Cons Confused Management. Micro Management.Lack of Trust especially between to the two main regions. Poor Communication. Advice to Management Sack all Directors, sack 50% of middle management and bring in fresh input from competitors or FMCG.", "rating": 1, "pros": "Early working hours. Showers are available. Generous salary", "cons": "Confused Management. Micro Management.Lack of Trust especially between to the two main regions. Poor Communication.", "advice": "Sack all Directors, sack 50% of middle management and bring in fresh input from competitors or FMCG."}, {"title": "Great Development, poor Retainment", "text": "Pros Colt offers employees a lot of opportunities to grow and learn Good salaries and great additional benefits Multinational environment with high possibilities to travel various locations Cons Once up-skilled and developed Colt doesn't try to retain talent Good people leave to competition Too many changes and no clear strategy Advice to Management Focus on delivering a vision/strategy to the end until it brings benefits Invest in future Retain talent Promote based on performance not based on \"Who you know/like\"", "rating": 3, "pros": "Colt offers employees a lot of opportunities to grow and learn", "cons": "Once up-skilled and developed Colt doesn't try to retain talent", "advice": "Focus on delivering a vision/strategy to the end until it brings benefits"}, {"title": "Good conditions, horrible management", "text": "Pros Good salary higher than almost any other company in Barcelona with similar roles, international atmosphere with interesting colleagues, flexible holidays, Cons Horrible management with no direction, one month they do one thing, the next month they completely reverse it. Sucking up to your manager gets you higher in the company (not competence). Break times micro managed up to the minute (feels like kindergarten). UK head office has no idea what's going on in Barcelona. Advice to Management Keep a steady course, judge workers based on competence and output as opposed to micromanaging them, use people's skills way better many people are working under their level, provide a career path and trainings", "rating": 3, "pros": "Good salary higher than almost any other company in Barcelona with similar roles, international atmosphere with interesting colleagues, flexible holidays,", "cons": "Horrible management with no direction, one month they do one thing, the next month they completely reverse it. Sucking up to your manager gets you higher in the company (not competence). Break times micro managed up to the minute (feels like kindergarten). UK head office has no idea what's going on in Barcelona.", "advice": "Keep a steady course, judge workers based on competence and output as opposed to micromanaging them, use people's skills way better many people are working under their level, provide a career path and trainings"}, {"title": "Good telecom company", "text": "Pros Transparent culture Customer focused Result oriented Give ownership to employees Cons None at the moment None at the moment None at the moment", "rating": 5, "pros": "Transparent culture", "cons": "None at the moment", "advice": null}, {"title": "Accounts payable analyst", "text": "Pros Good working hours. At 6 everyone is out of office. In general, respectful with personal life. It is a good and comfortable company to work at, especially if you are looking for work life balance. Flexibility in start time, 1h lunch and possibility to work remotely for 2 days a week. Great non monetary benefit package Cons Very mature company. In general, people working at the office have been there for many years, which makes them sometimes a bit too comfortable. there is not a fixed structure with regards to promotions or bonus, always subject to what your manager thinks and budget allocated for the year, not so abundant lately. This demotivates people not so much for the amount of money received, but for the low grade given to justify the low bonus amount. There are constant organizational changes that affect directly to employees, generating a stressful atmosphere definitely not nice to work in. Advice to Management Slow down on changes. Employees lose focus and motivation if organizational changes are performed at a rate of one every couple of months. Fix a reward structure that truly motivates people to do better. If the same grade, salary and benefits are always received, there is no incentive to outperform, grow or even stay in the company.", "rating": 3, "pros": "Good working hours. At 6 everyone is out of office. In general, respectful with personal life. It is a good and comfortable company to work at, especially if you are looking for work life balance. Flexibility in start time, 1h lunch and possibility to work remotely for 2 days a week. Great non monetary benefit package", "cons": "Very mature company. In general, people working at the office have been there for many years, which makes them sometimes a bit too comfortable. there is not a fixed structure with regards to promotions or bonus, always subject to what your manager thinks and budget allocated for the year, not so abundant lately. This demotivates people not so much for the amount of money received, but for the low grade given to justify the low bonus amount.", "advice": "Slow down on changes. Employees lose focus and motivation if organizational changes are performed at a rate of one every couple of months. Fix a reward structure that truly motivates people to do better. If the same grade, salary and benefits are always received, there is no incentive to outperform, grow or even stay in the company."}, {"title": "A Decent company", "text": "Pros Good Work Culture, Career Growth, Free Food, Free Cab, Shift timings(UK/General), Technology and CEO. Double salary for working during holidays, Pay structure, Bonus. Cons No place to stay during re-org or work force reduction, Only 2 days work from home in a week.", "rating": 5, "pros": "Good Work Culture, Career Growth, Free Food, Free Cab, Shift timings(UK/General), Technology and CEO. Double salary for working during holidays, Pay structure, Bonus.", "cons": "No place to stay during re-org or work force reduction, Only 2 days work from home in a week.", "advice": null}, {"title": "Too Intense and Too Much Change", "text": "Pros Lots of good, smart people. Good opportunity to work across Europe. Cons They need a new CEO and to replace most of the executive leadership. This company is very political, and very intense. The structures do not work, and they are constantly re-orging in order to fix it. The problem is that the leadership is not the right ones to fix it. Plus you don't have a minute to think. It's always get this done or else we won't meet our numbers. If they did more true thinking and less doing, they'd be more successful. Plus they aren't great at integrating new people in and highly favour the incompetent who have been there for years doing poor jobs. Advice to Management Sack the CEO and most of the leadership.", "rating": 1, "pros": "Lots of good, smart people. Good opportunity to work across Europe.", "cons": "They need a new CEO and to replace most of the executive leadership. This company is very political, and very intense. The structures do not work, and they are constantly re-orging in order to fix it. The problem is that the leadership is not the right ones to fix it. Plus you don't have a minute to think. It's always get this done or else we won't meet our numbers. If they did more true thinking and less doing, they'd be more successful. Plus they aren't great at integrating new people in and highly favour the incompetent who have been there for years doing poor jobs.", "advice": "Sack the CEO and most of the leadership."}, {"title": "Colt", "text": "Pros Overall a good bunch of people. Lots going on so varied opportunities for career development. Good work life balance. Flexible benefits system allows you to purchase extra leave or add extra to your pension etc if you wish to. Cons Lack of corporate focus. Too many half completed initiatives. Lots of talented people who are not recognised or utililsed to their potential. Advice to Management Prioritise what you want to achieve and ensure sufficient resources are applied to those targets. Trying to do too many things results in none of them being done properly.", "rating": 3, "pros": "Overall a good bunch of people. Lots going on so varied opportunities for career development. Good work life balance. Flexible benefits system allows you to purchase extra leave or add extra to your pension etc if you wish to.", "cons": "Lack of corporate focus. Too many half completed initiatives. Lots of talented people who are not recognised or utililsed to their potential.", "advice": "Prioritise what you want to achieve and ensure sufficient resources are applied to those targets. Trying to do too many things results in none of them being done properly."}, {"title": "Review", "text": "Pros Nice company to work for Cons Hierarchy level is too long fir promotions Advice to Management Need to limit the branding changes that Happen each alternate years", "rating": 5, "pros": "Nice company to work for", "cons": "Hierarchy level is too long fir promotions", "advice": "Need to limit the branding changes that Happen each alternate years"}, {"title": "Review", "text": "Pros Nice company to work with. WFH alongwith nice pay check Cons Management can improve and there can be more growth opportunity. Advice to Management Nothing as such", "rating": 5, "pros": "Nice company to work with. WFH alongwith nice pay check", "cons": "Management can improve and there can be more growth opportunity.", "advice": "Nothing as such"}, {"title": "Technical Lead", "text": "Pros work life balance free cab free food Cons management issues nothing other then this Advice to Management nothing", "rating": 3, "pros": "work life balance free cab free food", "cons": "management issues nothing other then this", "advice": "nothing"}, {"title": "If you fail to plan, you plan to fail", "text": "Pros pretty professional environment, used to work in a Call Center as a \"Customer Service Advisor\", but somehow they managed to not ever, not even once, mention the words \"Call Center\", the whole environment felt professional, we had to wear suits and tie, even though no client ever saw us, acceptable pay, benefits of meal vouchers, clear goals, good communication with direct supervisor/management team, lots of training, felt like company was investing in me (not me personally, but rather the whole department), they also had additional 30-minute break periods in addition to the usual 1-hour lunch break, which you could take in accordance with your team members and your supervisor Cons typical Windows world, lots of unnecessary meetings and beating around the bush, some pretty nasty 12-hour night shifts more often than not, office location was far from city center Advice to Management communicate target numbers more openly, less meetings with entire staff and upper management, foster more out-of-work activities with colleagues", "rating": 3, "pros": "pretty professional environment, used to work in a Call Center as a \"Customer Service Advisor\", but somehow they managed to not ever, not even once, mention the words \"Call Center\", the whole environment felt professional, we had to wear suits and tie, even though no client ever saw us, acceptable pay, benefits of meal vouchers, clear goals, good communication with direct supervisor/management team, lots of training, felt like company was investing in me (not me personally, but rather the whole department), they also had additional 30-minute break periods in addition to the usual 1-hour lunch break, which you could take in accordance with your team members and your supervisor", "cons": "typical Windows world, lots of unnecessary meetings and beating around the bush, some pretty nasty 12-hour night shifts more often than not, office location was far from city center", "advice": "communicate target numbers more openly, less meetings with entire staff and upper management, foster more out-of-work activities with colleagues"}, {"title": "positibe", "text": "Pros Good for freshers and would recommend it. Cons Increment is difficult to get.", "rating": 5, "pros": "Good for freshers and would recommend it.", "cons": "Increment is difficult to get.", "advice": null}, {"title": "Continuous change, but never really moving forward", "text": "Pros Good benefits, some industry respected subject matters experts, service delivery really committing to customers, flexible working (although this was dependent on your individual manager). Cons Divisions working in silos, poor senior management, trying to 'bespoke' everything for customers made extra work for lots of teams. Chasing revenue, even if no margin in that business at year end. Lack of corporate identity. Advice to Management Simplify things, processes, systems.", "rating": 3, "pros": "Good benefits, some industry respected subject matters experts, service delivery really committing to customers, flexible working (although this was dependent on your individual manager).", "cons": "Divisions working in silos, poor senior management, trying to 'bespoke' everything for customers made extra work for lots of teams. Chasing revenue, even if no margin in that business at year end. Lack of corporate identity.", "advice": "Simplify things, processes, systems."}, {"title": "So much potential ...", "text": "Pros Good salary and benefits Work/life balance is good Cons Too much continual change with no positive outcome Advice to Management Get a new CEO", "rating": 3, "pros": "Good salary and benefits", "cons": "Too much continual change with no positive outcome", "advice": "Get a new CEO"}, {"title": "Engineer at COLT", "text": "Pros Big company lot of exposure Cons not much left in UK, most of the work has been outsourced Advice to Management Keep employee in confidence, too many redundancies, overhauling and bla bla", "rating": 3, "pros": "Big company lot of exposure", "cons": "not much left in UK, most of the work has been outsourced", "advice": "Keep employee in confidence, too many redundancies, overhauling and bla bla"}, {"title": "Perhaps Colt has had it", "text": "Pros Some good people. Off shore team (India) very capable (more could be off shored). Marketing/sales function seemed to be rising to the challenge of attracting more business. I would recommend Colt if you need a job. For younger career orientated folk there are inevitably some opportunities to stepping stone into another telco. Cons IT and related technology seemed to be at odds with the commercial needs of a cash conscious company in a tough low margin market. A lot of deadwood in the UK characterized by basic errors promoted by 'internal experts' as best practice. It is unclear why Colt as an organisation would be attractive to a major player e.g. no incentive for a major player to buy up capability they already have access to. Current, CxO level management lack the competencies, courage and conviction required to meet the challenge ..... in fairness can an organisation of the size and pedigree of Colt feasibly attract the caliber of an innovative inspiring leader who can steer the company to a hugely profitable and innovative organisation. So perhaps Colt's best strategy is muddle through with the crumbs from the table, making modest profit along the way for the mid to long term ? An apt analogy is \"Colt is a small fish living in a large pond over populated with predators ..... whether extinct, on the endangered list or evolving further up the food chain ?\" I leave you to do your own research and reach your own conclusions. Advice to Management Time to wake up and smell the coffee and accept that perhaps the people that have driven down the road to get Colt to where it is today need to be replaced. Needs a serious look to see if Colt as an organisation can grow it;s share price or is it time to accept that it is operating at it's potential.", "rating": 1, "pros": "Some good people. Off shore team (India) very capable (more could be off shored).", "cons": "IT and related technology seemed to be at odds with the commercial needs of a cash conscious company in a tough low margin market.", "advice": "Time to wake up and smell the coffee and accept that perhaps the people that have driven down the road to get Colt to where it is today need to be replaced. Needs a serious look to see if Colt as an organisation can grow it;s share price or is it time to accept that it is operating at it's potential."}, {"title": "Technical Analyst", "text": "Pros Good Place to work Cons Sometimes you get tired of the routine work", "rating": 5, "pros": "Good Place to work", "cons": "Sometimes you get tired of the routine work", "advice": null}, {"title": "Interesting", "text": "Pros Nice offices and good training's, but not very good overall experience. The working from home policy (2 days per week) is very very good and helps the employees a lot Cons Some questionable top management decisions. The managers are not the best for the job in my opinion.", "rating": 3, "pros": "Nice offices and good training's, but not very good overall experience. The working from home policy (2 days per week) is very very good and helps the employees a lot", "cons": "Some questionable top management decisions. The managers are not the best for the job in my opinion.", "advice": null}, {"title": "Administration lead", "text": "Pros Colt provides professional working environment and great benefits. Cons I have not found any", "rating": 1, "pros": "Colt provides professional working environment and great benefits.", "cons": "I have not found any", "advice": null}, {"title": "Amazing Experience..!!", "text": "Pros Good Work, Policies, Salaries, Technical Trainings, Sports, Annual bash(Family Day) and many other events...n yes Meals and Cab Facility too!!! Cons Lot of designations and variable in CTC..! Advice to Management Nothing..", "rating": 5, "pros": "Good Work, Policies, Salaries, Technical Trainings, Sports, Annual bash(Family Day) and many other events...n yes Meals and Cab Facility too!!!", "cons": "Lot of designations and variable in CTC..!", "advice": "Nothing.."}, {"title": "Very good company in Delhi NCR region..", "text": "Pros Good Management Learning , New Technology..Customer interaction.. Cons All well set..Nothing bad..Attraction rate is very low", "rating": 5, "pros": "Good Management Learning , New Technology..Customer interaction..", "cons": "All well set..Nothing bad..Attraction rate is very low", "advice": null}, {"title": "amateurs", "text": "Pros like in most of the reviews a decent salary compared to the market and to other shared service centers. Cons i have the impression i work for a company of the 80s, the management style can´t be more obsolete, with just a few exceptions, its obvious management is mediocre to useless, 1 of 3 (if not 1 of 2) persons is looking for a job in my department Advice to Management CEO should resign", "rating": 3, "pros": "like in most of the reviews", "cons": "i have the impression i work for a company of the 80s, the management style can´t be more obsolete, with just a few exceptions, its obvious management is mediocre to useless, 1 of 3 (if not 1 of 2) persons is looking for a job in my department", "advice": "CEO should resign"}, {"title": "Experience", "text": "Pros Food facility is very good same stands for cab facility Cons Never work as a trainee here they will ask to leave after 6 months Advice to Management Dont spoil future of freshers", "rating": 3, "pros": "Food facility is very good same stands for cab facility", "cons": "Never work as a trainee here they will ask to leave after 6 months", "advice": "Dont spoil future of freshers"}, {"title": "It has been great time", "text": "Pros Big corporate environment and big customers. You can learn a lot at the beginning. Cons Lack of career improvement after some years. Advice to Management Thinks are not properly managed right now. A lot of mistakes and changes.", "rating": 3, "pros": "Big corporate environment and big customers. You can learn a lot at the beginning.", "cons": "Lack of career improvement after some years.", "advice": "Thinks are not properly managed right now. A lot of mistakes and changes."}, {"title": "Lack of direction", "text": "Pros In general the salaries and benefits are better than the local market. One of the few companies where you get an annual increase and a bonus. In some roles the job flexibility is great (Working from home, shift pattern, etc.) Great people! Cons No leadership direction. We change brand every couple of years, we change values every year, we redress the same presentations every year in the hope to get it right. There are too many cooks in the kitchen and no chef. We spend millions trying to implement new tools and then give up half way through. So we end up with 5 different ordering systems and 3 ticketing systems. Advice to Management Make a decision and stick to it. Stop wasting money listening to consultants and start listening to your internal talent. Stop buying systems built for companies bigger than Colt. Look for a start-up invest in them and get a decent end to end system.", "rating": 3, "pros": "In general the salaries and benefits are better than the local market. One of the few companies where you get an annual increase and a bonus.", "cons": "No leadership direction. We change brand every couple of years, we change values every year, we redress the same presentations every year in the hope to get it right.", "advice": "Make a decision and stick to it."}, {"title": "Poor management", "text": "Pros Good possibility for promotion, good pay and benefits Cons Management is awful (backstabbing, most of them not caring about employees, just on their own personal appearance). Advice to Management Improve your staff!", "rating": 3, "pros": "Good possibility for promotion, good pay and benefits", "cons": "Management is awful (backstabbing, most of them not caring about employees, just on their own personal appearance).", "advice": "Improve your staff!"}, {"title": "I have mixed experiences working for this company.", "text": "Pros Great colleagues, good benefits, good salary Cons Managers are not the best Advice to Management Listen to the people", "rating": 3, "pros": "Great colleagues, good benefits, good salary", "cons": "Managers are not the best", "advice": "Listen to the people"}, {"title": "A very competitive Network Service Provider", "text": "Pros It is Business Oriented only Cons It has EMEA coverage only Advice to Management no idea at this point", "rating": 3, "pros": "It is Business Oriented only", "cons": "It has EMEA coverage only", "advice": "no idea at this point"}, {"title": "Good team", "text": "Pros Excellent team, good customer focus Cons Very siloed business, lack of clear strategy Advice to Management Need to get teams working together more", "rating": 5, "pros": "Excellent team, good customer focus", "cons": "Very siloed business, lack of clear strategy", "advice": "Need to get teams working together more"}]