[{"title": "Awesome place to solve hard problems", "text": "Pros Lots of challenges to be solved daily. We’re constantly innovating and it’s exciting to be a part of. What we’re doing is hard and it’s the right environment for doing hard things: tons of transparency, little red tape and lots of collaboration. Cons Despite the size we’ve grown to and the money we’ve raised, things are still early and there’s a lot to be figured out. It’s exciting but can be exhausted. Be ready for the marathon, not the quick win. Advice to Management We need more office space.", "rating": 5, "pros": "Lots of challenges to be solved daily. We’re constantly innovating and it’s exciting to be a part of. What we’re doing is hard and it’s the right environment for doing hard things: tons of transparency, little red tape and lots of collaboration.", "cons": "Despite the size we’ve grown to and the money we’ve raised, things are still early and there’s a lot to be figured out. It’s exciting but can be exhausted. Be ready for the marathon, not the quick win.", "advice": "We need more office space."}, {"title": "Part of Something Special", "text": "Pros Joined Common a few months ago and loving it. Talented group of people with great senior leadership. Cons Nothing big yet though if we don't scale our teams fast enough i can see some potential issues popping up down the line. Advice to Management Lets get some better snacks plz.", "rating": 5, "pros": "Joined Common a few months ago and loving it. Talented group of people with great senior leadership.", "cons": "Nothing big yet though if we don't scale our teams fast enough i can see some potential issues popping up down the line.", "advice": "Lets get some better snacks plz."}, {"title": "Great work environment, inspiring vision, incredibly smart employees", "text": "Pros I don't come from a start-up world, and I have to say I was a little scared when I accepted my position at Common. I couldn't have been more wrong in my fears. Common provides an exceptional work environment, driven by incredibly passionate and intelligent employees. Everybody works hard and is respectful of each other's talents, time, and sensibilities. Unlike the stereotypes of a typical start-up, there's a real respect for work-life balance, and the company is driven by true work ethic and a belief that we're providing for the future of housing in cities, with no ego coming into play. It's refreshing to look forward to coming into work every morning. Cons None that come to mind yet. Advice to Management Keep doing what you're doing; it's fostering a great environment.", "rating": 5, "pros": "I don't come from a start-up world, and I have to say I was a little scared when I accepted my position at Common. I couldn't have been more wrong in my fears.", "cons": "None that come to mind yet.", "advice": "Keep doing what you're doing; it's fostering a great environment."}, {"title": "Fantastic!", "text": "Pros Love working at Common. One big family Cons No big cons of note", "rating": 5, "pros": "Love working at Common. One big family", "cons": "No big cons of note", "advice": null}]