[{"title": "Survival of the fittest", "text": "Pros I have met some of the most hard working and smart individuals here. You just need to ask for help when you need it. The key to thriving in Comodo is the willingness to learn and the ability to adapt and work hard. This position is not for you if you sit and wait for work to come across your desk. -Be proactive and utilize the resources around you. - Be willing to learn the process, follow it and then implement solutions to problems you come across. - Always be willing to try new things, outside of your job description. -When you are not doing anything, people will notice and you will be fired. Don't be afraid to step out of your shell and absorb everything around you. Learn how to read data even if it's not in your description. There are so many resources around that will help you thrive in your position at Comodo. Learn to solve problems. Your contributions will be acknowledged and you will be given the opportunity to develop your role further. Cons I honestly don't believe there are any cons. I knew I wanted to pursue my passion and resigned from my position.", "rating": 5, "pros": "I have met some of the most hard working and smart individuals here. You just need to ask for help when you need it. The key to thriving in Comodo is the willingness to learn and the ability to adapt and work hard. This position is not for you if you sit and wait for work to come across your desk.", "cons": "I honestly don't believe there are any cons. I knew I wanted to pursue my passion and resigned from my position.", "advice": null}, {"title": "Sales executive", "text": "Pros If you live in NJ, this may be better than working at a gas station. Cons The sales culture is from the 90s - strip clubs and blow. The software is buggy and does not scale. Advice to Management Fix your internal processes, write secure code and don't expect paying customers to debug for you.", "rating": 1, "pros": "If you live in NJ, this may be better than working at a gas station.", "cons": "The sales culture is from the 90s - strip clubs and blow. The software is buggy and does not scale.", "advice": "Fix your internal processes, write secure code and don't expect paying customers to debug for you."}, {"title": "Great company!", "text": "Pros Positive energy and great culture. Creative and fun environment. Great location. The best part is that we are in an industry that is vital to almost every company around the world. Cons There are no cons. Ever since I started here I have been treated with nothing but respect. No cons at all.", "rating": 5, "pros": "Positive energy and great culture. Creative and fun environment. Great location. The best part is that we are in an industry that is vital to almost every company around the world.", "cons": "There are no cons. Ever since I started here I have been treated with nothing but respect. No cons at all.", "advice": null}, {"title": "Sales Rep", "text": "Pros Work with a lot great people including the ex CIOs in major government agencies. The other sales reps and managers are awesome and very happy to help with anything you need. The security software and containment is game changing for the entire IT world. Free fruit every morning is nice. Cons Software updates are frequent and not always smooth. They have more than 30 solutions and give training For only 1 week mostly focused on 1 solution. It is up to you to study and ask for help from the veterans. The crm and dialing system can be quite clunky. Advice to Management Test updates better and hold ongoing training for the reps. Build a whitelist into the file group variables for ITSM.", "rating": 5, "pros": "Work with a lot great people including the ex CIOs in major government agencies. The other sales reps and managers are awesome and very happy to help with anything you need. The security software and containment is game changing for the entire IT world. Free fruit every morning is nice.", "cons": "Software updates are frequent and not always smooth. They have more than 30 solutions and give training For only 1 week mostly focused on 1 solution. It is up to you to study and ask for help from the veterans. The crm and dialing system can be quite clunky.", "advice": "Test updates better and hold ongoing training for the reps. Build a whitelist into the file group variables for ITSM."}, {"title": "Outside Sales Rep", "text": "Pros none... it's a horrible company. Horrible leadership, and products hat just don't work. PLEASE READE THE BELOW review about the person who was hired to WRITE FAKE GLASSDOOR REVIEWS!!!! Cons Every outside sales person is REQUIRED to log EVERY CALL, MESSAGE and EMAIL!!! The entire outside sales force is managed as if they were an junior insides sales rep. I'm 100% serious and literal, every DIAL and keystroke must be logged on a home grown CRM... which is outrageously slow. Advice to Management Hire someone who doesn't manage every seasoned outside rep as a junior inside telemarketer. Also, stop lying about your products that don't work... they are SMB point-products, not enterprise solutions. The products need FWs to be open/any/any to work... NO ENTERPRISE COMPANY ALLOWS THAT.", "rating": 1, "pros": "none... it's a horrible company. Horrible leadership, and products hat just don't work.", "cons": "Every outside sales person is REQUIRED to log EVERY CALL, MESSAGE and EMAIL!!! The entire outside sales force is managed as if they were an junior insides sales rep. I'm 100% serious and literal, every DIAL and keystroke must be logged on a home grown CRM... which is outrageously slow.", "advice": "Hire someone who doesn't manage every seasoned outside rep as a junior inside telemarketer."}, {"title": "First Corporate Sales Job", "text": "Pros This is my first experience working in a corporate environment after graduating college and I couldn't be more happy. Obviously you come to work, to work. Do your job. I have not had any negative experiences here, so I am confused as to why some of the reviews are so negative. This being my first sales job, I can honestly say I have great support here and I am crushing it because of that and that I enjoy coming to work because of the people I work with. Cons I don't have any negative comments", "rating": 5, "pros": "This is my first experience working in a corporate environment after graduating college and I couldn't be more happy. Obviously you come to work, to work. Do your job. I have not had any negative experiences here, so I am confused as to why some of the reviews are so negative.", "cons": "I don't have any negative comments", "advice": null}, {"title": "Approach with great caution..... Dangerous conditions lie within this Company", "text": "Pros Some really great people. None at the executive level Cons The lack of courage and ethics by CEO and executive team. Don't miss reading the comment from the person who was hired to write reviews on Glassdoor as just one example of lack of ethics Advice to Management The only advice is to the workers. Trust your instincts. It does feel wrong because it is wrong. The CEO has no moral or ethical compass. Run, the grass is greener anywhere else.", "rating": 1, "pros": "Some really great people. None at the executive level", "cons": "The lack of courage and ethics by CEO and executive team. Don't miss reading the comment from the person who was hired to write reviews on Glassdoor as just one example of lack of ethics", "advice": "The only advice is to the workers. Trust your instincts. It does feel wrong because it is wrong. The CEO has no moral or ethical compass. Run, the grass is greener anywhere else."}, {"title": "Run away", "text": "Pros My manager was nice. The technology really is imaginative. Other than that a pretty negative experience. Cons VP is horrible! Absolutely not an enterprise class Sales organization. Also if you're not in the New Jersey office don't expect any kind of help or training. Advice to Management Get a new VP if you want anyone to stick around. Stop micromanaging people to death and instead take the management approach of asking what is or isn't working and finding out how you can help close business.", "rating": 1, "pros": "My manager was nice. The technology really is imaginative. Other than that a pretty negative experience.", "cons": "VP is horrible! Absolutely not an enterprise class Sales organization. Also if you're not in the New Jersey office don't expect any kind of help or training.", "advice": "Get a new VP if you want anyone to stick around. Stop micromanaging people to death and instead take the management approach of asking what is or isn't working and finding out how you can help close business."}, {"title": "Nice people, great work atmosphere...", "text": "Pros The best thing about working at Comodo is that you get to work with the best of security professionals and experts. It's a great team and the work atmosphere is simply superb. Cons Don't want to count the negatives...I always like discussing the positives.", "rating": 5, "pros": "The best thing about working at Comodo is that you get to work with the best of security professionals and experts. It's a great team and the work atmosphere is simply superb.", "cons": "Don't want to count the negatives...I always like discussing the positives.", "advice": null}, {"title": "sell certs or get fired", "text": "Pros parking, coffee, desk, gym, lunchroom/fridge Cons lack of training, lead generation, cold calls, warm leads are from people who got fired Advice to Management longer training", "rating": 3, "pros": "parking, coffee, desk, gym, lunchroom/fridge", "cons": "lack of training, lead generation, cold calls, warm leads are from people who got fired", "advice": "longer training"}, {"title": "Business analyst", "text": "Pros the pros were that I was hired to write positive glassdoor reviews all day Cons I think my day to day work should speak for itself, I was hired to write reviews on social media sites about comodo Advice to Management don't hire people to write fake glassdoor, FB, IG reviews and then fire them when actual employees write honest reviews reflecting the mistreatment and horrible company culture that is permeated throughout all of comodo", "rating": 1, "pros": "the pros were that I was hired to write positive glassdoor reviews all day", "cons": "I think my day to day work should speak for itself, I was hired to write reviews on social media sites about comodo", "advice": "don't hire people to write fake glassdoor, FB, IG reviews and then fire them when actual employees write honest reviews reflecting the mistreatment and horrible company culture that is permeated throughout all of comodo"}, {"title": "I am celebrating my 2nd anniversary in Comodo this weekend", "text": "Pros All set to celebrate my second anniversary in Comodo, I can't but write this review to mention about those colleagues, extremely nice people, who have made it great for me in Comodo. A great company that has a perfect work atmosphere and professional ambiance. Cons Don't know what to say. I like to focus on the positives!", "rating": 5, "pros": "All set to celebrate my second anniversary in Comodo, I can't but write this review to mention about those colleagues, extremely nice people, who have made it great for me in Comodo. A great company that has a perfect work atmosphere and professional ambiance.", "cons": "Don't know what to say. I like to focus on the positives!", "advice": null}, {"title": "Good company, good work atmosphere", "text": "Pros I have completed ten months here, at Comodo. This is a good company for all software guys. The work atmosphere is really good and helps you evolve into a better professional. I have liked working here, among some very good teammates and leaders. Am happy to be part of the Comodo team. Cons I have heard about some minor issues pertaining to transportation provided to employees, but since I have never had to depend on it, I can't make any statement about that.", "rating": 5, "pros": "I have completed ten months here, at Comodo. This is a good company for all software guys. The work atmosphere is really good and helps you evolve into a better professional. I have liked working here, among some very good teammates and leaders. Am happy to be part of the Comodo team.", "cons": "I have heard about some minor issues pertaining to transportation provided to employees, but since I have never had to depend on it, I can't make any statement about that.", "advice": null}, {"title": "There are ample growth opportunities here", "text": "Pros In the last 8 years here at Comodo, I have seen that the company offers ample growth opportunities to people who want to grow professionally. This is applicable not just to sales and marketing, but to all the different departments. There are many people who have made the most of this and have managed to rise to unforeseen heights in their career. Comodo, no doubt, is the best company for professionals. Cons Sorry, I can't and won't say anything negative about this company...I simply love Comodo!!!", "rating": 5, "pros": "In the last 8 years here at Comodo, I have seen that the company offers ample growth opportunities to people who want to grow professionally. This is applicable not just to sales and marketing, but to all the different departments. There are many people who have made the most of this and have managed to rise to unforeseen heights in their career. Comodo, no doubt, is the best company for professionals.", "cons": "Sorry, I can't and won't say anything negative about this company...I simply love Comodo!!!", "advice": null}, {"title": "Lucky to be part of Comodo", "text": "Pros I joined Comodo in June 2009. So, by June 2017, I would be completing eight years in the company. I began with the sales team and then, with my technical experience, I became a part of the tech team when a vacancy came up. I have thoroughly enjoyed being here because here, at Comodo, work is part of growing up. Yes, I am happy that Comodo has given me ample opportunities to evolve into a good professional. Cons Some juniors have been heard complaining of the pay structure here at Comodo, though I personally don't feel the same. I guess the company decides all this based on various criteria, including professional caliber and efficiency.", "rating": 5, "pros": "I joined Comodo in June 2009. So, by June 2017, I would be completing eight years in the company. I began with the sales team and then, with my technical experience, I became a part of the tech team when a vacancy came up. I have thoroughly enjoyed being here because here, at Comodo, work is part of growing up. Yes, I am happy that Comodo has given me ample opportunities to evolve into a good professional.", "cons": "Some juniors have been heard complaining of the pay structure here at Comodo, though I personally don't feel the same. I guess the company decides all this based on various criteria, including professional caliber and efficiency.", "advice": null}, {"title": "It's definitely a good place to work, but...", "text": "Pros This is my 4th job in the IT industry. I have completed 16 months here at Comodo and this is my 17th month. I am happy with my work here and am also happy about the work atmosphere, the teamwork, the pay-structure, the professionalism and the approach shown by the management. I am also impressed with the opportunities that the company provides an individual with, as regards professional growth. No wonder Comodo continues to be one among the best-ranked companies today. Cons The one thing that I didn't like about Comodo is the pick-up and drop facility they provide to employees. It's sometimes irregular and unreliable as well. Hope something is done about it.", "rating": 5, "pros": "This is my 4th job in the IT industry. I have completed 16 months here at Comodo and this is my 17th month. I am happy with my work here and am also happy about the work atmosphere, the teamwork, the pay-structure, the professionalism and the approach shown by the management. I am also impressed with the opportunities that the company provides an individual with, as regards professional growth. No wonder Comodo continues to be one among the best-ranked companies today.", "cons": "The one thing that I didn't like about Comodo is the pick-up and drop facility they provide to employees. It's sometimes irregular and unreliable as well. Hope something is done about it.", "advice": null}, {"title": "I like being associated with Comodo, got to learn a lot of things...", "text": "Pros After having worked in Comodo for two years, I would say I like it when someone speaks of me associating with me the company. Comodo has a reputation of its own, on the international level and it makes me feel proud that I have associated with this company. I have also got the chance to learn lots of things while being here, at Comodo. It's not just technical things, I have also got the chance to learn team-building skills and professional discipline. I am sure it would help me in future, in my profession. Cons Sometimes the total atmosphere at Comodo seems cold and formal. This is one thing I don't like about the company, but I guess there could be valid reasons for it...maybe the nature of the work and the workload people have...", "rating": 5, "pros": "After having worked in Comodo for two years, I would say I like it when someone speaks of me associating with me the company. Comodo has a reputation of its own, on the international level and it makes me feel proud that I have associated with this company. I have also got the chance to learn lots of things while being here, at Comodo. It's not just technical things, I have also got the chance to learn team-building skills and professional discipline. I am sure it would help me in future, in my profession.", "cons": "Sometimes the total atmosphere at Comodo seems cold and formal. This is one thing I don't like about the company, but I guess there could be valid reasons for it...maybe the nature of the work and the workload people have...", "advice": null}, {"title": "Comodo for those who are determined to take their career to great heights", "text": "Pros In the last eight years, I have seen lots of things, mostly good things, happening at Comodo. More than the technical advancements and the company's attainments in the marketing areas as well, it's something else that I am impressed with. Many young IT guys, who just drifted into Comodo planning to stay for a year or so, earn some quick buck, add to their experience and then move on to other places, have stayed on and have ended up being real professionals. They are all now part of the Comodo family and would perhaps stick on here for years. They know they can take their careers to great heights if they continue to work on here... Cons The Cons? Sorry, no comments!!!", "rating": 5, "pros": "In the last eight years, I have seen lots of things, mostly good things, happening at Comodo. More than the technical advancements and the company's attainments in the marketing areas as well, it's something else that I am impressed with. Many young IT guys, who just drifted into Comodo planning to stay for a year or so, earn some quick buck, add to their experience and then move on to other places, have stayed on and have ended up being real professionals. They are all now part of the Comodo family and would perhaps stick on here for years. They know they can take their careers to great heights if they continue to work on here...", "cons": "The Cons? Sorry, no comments!!!", "advice": null}, {"title": "My experience with Comodo is over-all good", "text": "Pros I have been in Comodo for just about four months and I am over-all satisfied. I am not in a position to comment too authentically, but I do like the work atmosphere. Cons Sometimes I feel some of my colleagues are a bit formal, maybe it's due to their work-load. But most of them are friendly.", "rating": 5, "pros": "I have been in Comodo for just about four months and I am over-all satisfied. I am not in a position to comment too authentically, but I do like the work atmosphere.", "cons": "Sometimes I feel some of my colleagues are a bit formal, maybe it's due to their work-load. But most of them are friendly.", "advice": null}, {"title": "This is my third year at Comodo, as part of the marketing team", "text": "Pros The day I arrived at Comodo for my interview, I was all tensed up. But five minutes after I came in, I was surprised to find myself totally relaxed. Everyone, from the receptionist to the HR and management people, made me feel relaxed and at home. Today, when I am into my third year here at Comodo, I see it as sort of another home. It's all like a family- my team, the other teams and almost everyone here. I enjoy working here as it gives me a totally new kind of professional fulfillment. Never had this kind of an experience anywhere else. Cons I think I wouldn't be able to say anything negative, even if there happen to be some very minor issues...Honestly speaking, I have never encountered anything negative here at Comodo.", "rating": 5, "pros": "The day I arrived at Comodo for my interview, I was all tensed up. But five minutes after I came in, I was surprised to find myself totally relaxed. Everyone, from the receptionist to the HR and management people, made me feel relaxed and at home. Today, when I am into my third year here at Comodo, I see it as sort of another home. It's all like a family- my team, the other teams and almost everyone here. I enjoy working here as it gives me a totally new kind of professional fulfillment. Never had this kind of an experience anywhere else.", "cons": "I think I wouldn't be able to say anything negative, even if there happen to be some very minor issues...Honestly speaking, I have never encountered anything negative here at Comodo.", "advice": null}, {"title": "This is where real professionals are made", "text": "Pros I have been working at Comodo for 7 years now, and I am not looking for another job! Pros Being in Comodo for the last 7 years has taught me many valuable lessons regarding professionalism. I can now say, with confidence and with some pride, that I have over the years evolved into a real good professional, thanks to my experience working with Comodo. I should say that this happened because I got the chance to work with some of the best professionals in the IT industry. The work culture at Comodo too has contributed greatly to this. Thanks, Comodo. Comodo indeed is the place where real professionals are made. Cons Nothing negative to say about the company...", "rating": 5, "pros": "I have been working at Comodo for 7 years now, and I am not looking for another job!", "cons": "Nothing negative to say about the company...", "advice": null}, {"title": "Great place to be in...", "text": "Pros Pros Today I have completed six months at Comodo. I feel elated and satisfied; no other company has given the kind of job satisfaction that I have got from this Comodo job. I am almost sure that I would continue to work here for a long time. I could meet many people who have been working here for years now. Really a great place to work, for all IT professionals... Cons Not the place for easy-going, lazy people who just want to go on doing nothing...", "rating": 5, "pros": "Pros", "cons": "Not the place for easy-going, lazy people who just want to go on doing nothing...", "advice": null}, {"title": "C for Comodo, C for Camaraderie, C for Competence, C for Complete Security", "text": "Pros When I joined Comodo, I was not sure how it would end up. I had had some bitter experiences working with some really 'big' companies and I was wondering if Comodo would also end up that way, with me walking out in maybe a couple of months or so. But my calculations went wrong. In just a couple of months, I could make myself an integral part of the team and the work that we were doing. Perfect teamwork it is at Comodo. You get to learn new things every day and you understand camaraderie and competence in a newer way. No wonder Comodo is able to give complete security to its clients... Cons How can I bring myself to write something negative about a company where I enjoy working? I haven't yet come across anything that I dislike or hate about Comodo.", "rating": 5, "pros": "When I joined Comodo, I was not sure how it would end up. I had had some bitter experiences working with some really 'big' companies and I was wondering if Comodo would also end up that way, with me walking out in maybe a couple of months or so. But my calculations went wrong. In just a couple of months, I could make myself an integral part of the team and the work that we were doing. Perfect teamwork it is at Comodo. You get to learn new things every day and you understand camaraderie and competence in a newer way. No wonder Comodo is able to give complete security to its clients...", "cons": "How can I bring myself to write something negative about a company where I enjoy working? I haven't yet come across anything that I dislike or hate about Comodo.", "advice": null}, {"title": "I love the work environment, feel there is lot of scope for someone like me", "text": "Pros Well, this is my fourth IT job and what I liked the best about Comodo is the work environment. I would want to call it awesome. Yes, it's awesome indeed, in my opinion (if that counts). We have seniors here who give us all the guidance that we need, with utmost patience. The regular sittings that we have with the technical guys also helps a lot in understanding the company and its products. It's a very informal, friendly atmosphere here at Comodo and I have never felt bored, not even for one single minute. For someone like me, who wants to learn something new every day and who wants to evolve into a good professional, Comodo offers much scope... Cons I don't think I found anything in the last fifteen months that would make me want to leave Comodo. But if you want me to state the cons, all that I can say is that this is not the place for those who want to sit idle doing nothing and earn their pay from someone else's efforts. You have to work hard, but don't worry, you would never lose anything by working hard at Comodo.", "rating": 5, "pros": "Well, this is my fourth IT job and what I liked the best about Comodo is the work environment. I would want to call it awesome. Yes, it's awesome indeed, in my opinion (if that counts). We have seniors here who give us all the guidance that we need, with utmost patience. The regular sittings that we have with the technical guys also helps a lot in understanding the company and its products. It's a very informal, friendly atmosphere here at Comodo and I have never felt bored, not even for one single minute. For someone like me, who wants to learn something new every day and who wants to evolve into a good professional, Comodo offers much scope...", "cons": "I don't think I found anything in the last fifteen months that would make me want to leave Comodo. But if you want me to state the cons, all that I can say is that this is not the place for those who want to sit idle doing nothing and earn their pay from someone else's efforts. You have to work hard, but don't worry, you would never lose anything by working hard at Comodo.", "advice": null}, {"title": "Nutty place", "text": "Pros Some of the people were nice. Work was interesting. Cons Sarcastic, nasty management who doesn't have a clue about marketing.Pretty pathetic, actually. Advice to Management Stay home.", "rating": 1, "pros": "Some of the people were nice. Work was interesting.", "cons": "Sarcastic, nasty management who doesn't have a clue about marketing.Pretty pathetic, actually.", "advice": "Stay home."}, {"title": "Not what they make it out to be", "text": "Pros Work with really good people. This is the perfect stepping stone job. Get in, get your experience, get out. Simple as that. Cons There's a Ton but the biggest is working for the CEO. Hard to work for someone who is such an unlikeable person. Advice to Management When you make your own employees write good reviews you know you are not doing well", "rating": 1, "pros": "Work with really good people. This is the perfect stepping stone job. Get in, get your experience, get out. Simple as that.", "cons": "There's a Ton but the biggest is working for the CEO. Hard to work for someone who is such an unlikeable person.", "advice": "When you make your own employees write good reviews you know you are not doing well"}, {"title": "A life learning experience", "text": "Pros It was a learning experience. Sales job with quotas. You have three months of probation and if you dont hit the quota you are gone. Basic jist of it. They say it cost money to keep you on that seat in the office. You have to produce. Or you are done Cons Honestly, I speaked my truth on the Pros because that is exactly what it is. If you enjoy calling 120-180 calls a day trying to sell to people than its the job for you. Remember this, you are only as good as your last sell.", "rating": 1, "pros": "It was a learning experience. Sales job with quotas. You have three months of probation and if you dont hit the quota you are gone. Basic jist of it. They say it cost money to keep you on that seat in the office. You have to produce. Or you are done", "cons": "Honestly, I speaked my truth on the Pros because that is exactly what it is. If you enjoy calling 120-180 calls a day trying to sell to people than its the job for you. Remember this, you are only as good as your last sell.", "advice": null}, {"title": "Superb company", "text": "Pros everything is good good salary good incentives Cons give more salary repect the employee's", "rating": 5, "pros": "everything is good", "cons": "give more salary", "advice": null}, {"title": "Exactly what you make it.", "text": "Pros Comodo is a place where you can make as much as you are willing to work for. This shop is truly a place where if you define success in dollars, this is the right place to earn them. Comodo IS a sales job in nuclear hot industry- the cyber security landscape is a mess and there is 100% a need for the solution they provide. My direct boss is 100% a class act and would go to bat for any of his guys that gave him the effort he asked- the same goes for majority of the sales team. In my year there, I watched many transition into success while creating key structure and foundations for the recruits and hiring classes to come. This was truly a fun and exciting roller coaster- I am glad I was a part of it and will miss aspects of it. Cons The cons are what you make of them; the sales culture at Comodo is fast pace and quota driven- once again, this is a sales job. If you are good at your job, there are no cons from a sales perspective. The only downside was the ability, or lack of ability to move a ball downfield within upper management- the oversight of internal talent is a shame. Comodo has a great \"farm system\", once again, this speaks to the inside sales directors natural ability to lead and coach- this internal talent that is drawn out and coached is sometimes neglected; but with their training, business processes, and industry knowledge that Comodo provides to their employees they only make them ideal candidates for other firms. Advice to Management Start paying attention to internal talent- a lot of it is sitting in front of you. Do not let other firms benefit from the time, effort, and resources you put into your teams.", "rating": 5, "pros": "Comodo is a place where you can make as much as you are willing to work for. This shop is truly a place where if you define success in dollars, this is the right place to earn them. Comodo IS a sales job in nuclear hot industry- the cyber security landscape is a mess and there is 100% a need for the solution they provide.", "cons": "The cons are what you make of them; the sales culture at Comodo is fast pace and quota driven- once again, this is a sales job. If you are good at your job, there are no cons from a sales perspective.", "advice": "Start paying attention to internal talent- a lot of it is sitting in front of you. Do not let other firms benefit from the time, effort, and resources you put into your teams."}, {"title": "Run, don't walk", "text": "Pros The people, meaning my co-workers, were great. Everyone supports one another and tries hard to help each other succeed. Pay is okay, but not competitive in this industry. Cons CEO is involved in everything, he micro-manages people. Having a direct boss means nothing, the CEO can come in at any time and greatly change the direction of your work and your boss can do nothing about it. You can get pulled into projects that you have no experience with and then are on the hook if they don't succeed. CEO has never worked at another company, and has been the found and CEO of this company since it was built. It is his way or the highway, and he thinks he is an expert on everything. You hire people so they can help you grow, and fill in the weaknesses of the company. CEO is far to into the weeds. CEO should be working on strategy and positioning the company, not checking to see where you logged in from every single day. Direction changes every day. One day the focus will be X product, next day focus will be on Y product. Very hard to plan, execute successfully and receive results in this type of atmosphere. If you are in the Silicon Vally office you are screwed. No one in our HQ respects you or believes you are working hard. They are slowly picking that team off one by one. Insurance is ridiculously overpriced, company doesn't cover much. Advice to Management Get a board of directors, have the CEO drop to a CTO and let the heads of each department take ownership and be in charge. Create a plan and strategy and stick to it, don't wish wash.", "rating": 3, "pros": "The people, meaning my co-workers, were great. Everyone supports one another and tries hard to help each other succeed.", "cons": "CEO is involved in everything, he micro-manages people. Having a direct boss means nothing, the CEO can come in at any time and greatly change the direction of your work and your boss can do nothing about it. You can get pulled into projects that you have no experience with and then are on the hook if they don't succeed.", "advice": "Get a board of directors, have the CEO drop to a CTO and let the heads of each department take ownership and be in charge. Create a plan and strategy and stick to it, don't wish wash."}, {"title": "Laughable", "text": "Pros I can't think of any. I need out of this place it is an absolute joke. The only thing management is good at is managing their reputation. Just look at all the fake reviews to counter the real ones on this very site. All real reviews followed by 1 or 2'reviews by HR or the CEO himself. If you want favorable reviews read the real ones and learn from what is consistently being said. Cons Signing the offer letter and following through. Do not waste time here. Comodo invents products that other companies have brought to market at least 1-2 years early and think they will take market share. the products don't work and what's being designed is not what the market needs or wants. It's what some engineer outside the US thinks is cool. When they are 0 sales they come down hard on everyone. Advice to Management Stick to certs do nothing else.", "rating": 1, "pros": "I can't think of any. I need out of this place it is an absolute joke. The only thing management is good at is managing their reputation. Just look at all the fake reviews to counter the real ones on this very site. All real reviews followed by 1 or 2'reviews by HR or the CEO himself. If you want favorable reviews read the real ones and learn from what is consistently being said.", "cons": "Signing the offer letter and following through. Do not waste time here. Comodo invents products that other companies have brought to market at least 1-2 years early and think they will take market share. the products don't work and what's being designed is not what the market needs or wants. It's what some engineer outside the US thinks is cool.", "advice": "Stick to certs do nothing else."}, {"title": "Great Opportunity for quick advancement", "text": "Pros I started in the end of 2015, within one year I almost doubled my base salary and now have the opportunity to work with enterprise level companies and can easily double my yearly earnings. The company is quickly growing and will be expanding at a rapid rate. Great opportunity to continue your career in the security industry or to start building. Moral in the office is amazing, free massages, office party's, company trips and dinners, etc. Cons Tough work. You have to work hard to build a pipeline and learn a lot about the Internet Security/ Software security Industry. Can be stressful at times in the security sales environment. Advice to Management Keep going on the path you have been for the last year. I am very happy with the direction the company and Industry are going.", "rating": 5, "pros": "I started in the end of 2015, within one year I almost doubled my base salary and now have the opportunity to work with enterprise level companies and can easily double my yearly earnings. The company is quickly growing and will be expanding at a rapid rate. Great opportunity to continue your career in the security industry or to start building. Moral in the office is amazing, free massages, office party's, company trips and dinners, etc.", "cons": "Tough work. You have to work hard to build a pipeline and learn a lot about the Internet Security/ Software security Industry. Can be stressful at times in the security sales environment.", "advice": "Keep going on the path you have been for the last year. I am very happy with the direction the company and Industry are going."}, {"title": "Chaotic short term vision with poor execution.", "text": "Pros If you keep your head down and are not visible then you can survive at this company. Most of the long timers are yes-men/women. Cons Difficult place to accomplish anything long term ( greater than 12 months ). Most of the people get a shock when they start and then within a few months they depart. Advice to Management When you hire experienced people, let them use their skill and expertise to help the company. Develop a vision and plan. Communicate the vision and plan to employees. Allow them to execute and do not change direction constantly.", "rating": 3, "pros": "If you keep your head down and are not visible then you can survive at this company. Most of the long timers are yes-men/women.", "cons": "Difficult place to accomplish anything long term ( greater than 12 months ). Most of the people get a shock when they start and then within a few months they depart.", "advice": "When you hire experienced people, let them use their skill and expertise to help the company. Develop a vision and plan. Communicate the vision and plan to employees. Allow them to execute and do not change direction constantly."}, {"title": "Smb capable security solutions at best - the experienced and enterprise focused person should steer clear", "text": "Pros Passionate sales and developer teams though they are disconnected, misguided and significantly inexperienced. The quitting process is refined and well practiced. 20 words are needed for review and I can't think of any other pros. Cons Strong lack of leadership in sales. Engineering lacks focus and clear direction. No sales execution plans that actually scale. Not an ethical place to work. Turnover is expected and the norm here. QA is severely lacking within the products. Nearly entire support team quit; there is no real expertise within support. 2016 yielded 0 happy customers on the security products. Advice to Management Don't invest in outside / field sales, stick with inside sales and smb deals. Use your own products, all of them, everywhere. Respect employees. They are people not sprockets. Products don't build companies, people build companies.", "rating": 1, "pros": "Passionate sales and developer teams though they are disconnected, misguided and significantly inexperienced.", "cons": "Strong lack of leadership in sales. Engineering lacks focus and clear direction. No sales execution plans that actually scale.", "advice": "Don't invest in outside / field sales, stick with inside sales and smb deals."}, {"title": "The worst", "text": "Pros -Benefits -Great co-workers -Somewhat modern office w/ decent ammenities Cons -The CEO is an egotistical doofus -They're extremely cheap with commission payouts (any chance to screw you, bet your butt they will capitalize) Advice to Management Jump ship", "rating": 1, "pros": "-Benefits", "cons": "-The CEO is an egotistical doofus", "advice": "Jump ship"}, {"title": "Unethical Place To Work - Could Damage Your Career", "text": "Pros There are no PROs at this company. Cons Unethical place to work, lots of people come and go here, the products don't work and there is zero customer support. The model here is to collect money from customers if you can and then abandon them with products that don't live up to the expectations. If you are considering joining, look into the health care benefits which are very high and ask if you will be micro-managed by the CEO. Also ask if you will just be a worker bee like a factory worker or will be able to contribute your ideas to improve the company. Read all the reviews on Comodo. They are all true. Advice to Management Stick to SSL Security and don't do anything else.", "rating": 1, "pros": "There are no PROs at this company.", "cons": "Unethical place to work, lots of people come and go here, the products don't work and there is zero customer support. The model here is to collect money from customers if you can and then abandon them with products that don't live up to the expectations.", "advice": "Stick to SSL Security and don't do anything else."}, {"title": "I honestly don't understand all of the bad reviews", "text": "Pros I’ve been working here for approx. 1 year. I have never had a problem. You come to work to WORK. Don’t get involved in watercooler chat so to speak and just make your money and you will always be happy with what you get out of it. Cons I wish it had more opportunity for advancement in different offices.", "rating": 5, "pros": "I’ve been working here for approx. 1 year. I have never had a problem. You come to work to WORK. Don’t get involved in watercooler chat so to speak and just make your money and you will always be happy with what you get out of it.", "cons": "I wish it had more opportunity for advancement in different offices.", "advice": null}, {"title": "Happy with my decision - Massive opportunity!", "text": "Pros Differentiated technology that is not only relevant but much needed in the cybersecurity space. Sales leadership understands the market and how to deliver enterprise solutions. Comodo is building a fantastic field team of A-players and empowering us with the tools we need to get the job done. The culture here is both enthusiastic and collaborative. It's very exciting to be part of the Eastern US team! Cons All organizations have room for improvement. There is a very large list of solutions at Comodo - some having overlapping functionality. This is confusing. Work is being done to clarify the messaging and value proposition, particularly within the enterprise suite. Also there are some internal operational processes that need refinement in order to accommodate the needs of a dynamic and scalable enterprise sales organization.", "rating": 5, "pros": "Differentiated technology that is not only relevant but much needed in the cybersecurity space. Sales leadership understands the market and how to deliver enterprise solutions. Comodo is building a fantastic field team of A-players and empowering us with the tools we need to get the job done. The culture here is both enthusiastic and collaborative. It's very exciting to be part of the Eastern US team!", "cons": "All organizations have room for improvement. There is a very large list of solutions at Comodo - some having overlapping functionality. This is confusing. Work is being done to clarify the messaging and value proposition, particularly within the enterprise suite. Also there are some internal operational processes that need refinement in order to accommodate the needs of a dynamic and scalable enterprise sales organization.", "advice": null}, {"title": "Solid Chance to Grow", "text": "Pros There are a lot of opportunities for a challenger here. Cons Old location was closer to mall but the space is better in Clifton location", "rating": 5, "pros": "There are a lot of opportunities for a challenger here.", "cons": "Old location was closer to mall but the space is better in Clifton location", "advice": null}, {"title": "This is a New Comodo", "text": "Pros Comodo is evolving into a legit advanced enterprise security player that can really deliver for the customer. Security people get the difference with the objective: Strong security with no impact on the user experience and work, and easy to manage. Big time investment has been made into the whole solution stack from endpoint to SSL, and when a customer needs something they get it fast because of the HUGE number of tech/engineers and drive to keep customers happy. A really good sales culture is forming. And sales gets what it needs to make the customer happy. I also like the new sales strategy that is ALOT more effective and respectful. All about making the customer successful. New management is awesome and just gets it. I see we are on to something big, and we are bringing in really really great people it seems every week. Our new marketing SVP and team now here to help give the company the look it deserves to make it easier to see what we do. Best thing here though is all the people. such an awesome group! Cons We are still evolving. That means a lot of work to be done. Have to be more resourceful than ever, and it's kind of like a startup that way and many times we don't have all the marketing materials needed. Need a new website refresh to make it more clear on our real value, because it's not easy to understand now. Just growing pains. Advice to Management Make our branding more reflective of the default-deny value, and how everything we do from endpoint to SSL. Need more materials big time to help us spread the good word. Keep hiring great people like recently.", "rating": 5, "pros": "Comodo is evolving into a legit advanced enterprise security player that can really deliver for the customer. Security people get the difference with the objective: Strong security with no impact on the user experience and work, and easy to manage. Big time investment has been made into the whole solution stack from endpoint to SSL, and when a customer needs something they get it fast because of the HUGE number of tech/engineers and drive to keep customers happy.", "cons": "We are still evolving. That means a lot of work to be done. Have to be more resourceful than ever, and it's kind of like a startup that way and many times we don't have all the marketing materials needed. Need a new website refresh to make it more clear on our real value, because it's not easy to understand now. Just growing pains.", "advice": "Make our branding more reflective of the default-deny value, and how everything we do from endpoint to SSL. Need more materials big time to help us spread the good word. Keep hiring great people like recently."}, {"title": "Good Opportunity For Growth and Knowledge", "text": "Pros Working at Comodo Cyber Security has giving me the chance to grow in the sales. Since being at Comodo I've learn so much from so many people that are here. The CEO is a knowledgeable person and when it comes to Security he is the person to listen to. I see that there are negative reviews on here, but i'll be frank.... Those reviews are from people that couldn't make it in sales. Sales is all about numbers and if your not able to Sale then this is not for you.It's a shame that people go on here and shame Comdoo for that... Come see Comodo for yourself and see the ROCK Stars that are here doing it every month over and over $$$$$$$ Cons Lets be honest no JOB is perfect and if I had to put a Con it would be to get better coffee lol.I've been in Comodo for 6 years and since then we we have grown to what we are today and that a Cyber Security Firm. Better products, Better Marketing, Surpass Symantec by 5 quarters in the SSL division, Opened an office in California, made it to the Gartner and IDC report!, so many great things has happen and will happen lets keep moving up hill. Advice to Management More training on how to better yourself in Sales, President Club fro over achievers in Sales. Rather than that keep up the GREAT work!!!", "rating": 5, "pros": "Working at Comodo Cyber Security has giving me the chance to grow in the sales. Since being at Comodo I've learn so much from so many people that are here. The CEO is a knowledgeable person and when it comes to Security he is the person to listen to. I see that there are negative reviews on here, but i'll be frank.... Those reviews are from people that couldn't make it in sales. Sales is all about numbers and if your not able to Sale then this is not for you.It's a shame that people go on here and shame Comdoo for that... Come see Comodo for yourself and see the ROCK Stars that are here doing it every month over and over $$$$$$$", "cons": "Lets be honest no JOB is perfect and if I had to put a Con it would be to get better coffee lol.I've been in Comodo for 6 years and since then we we have grown to what we are today and that a Cyber Security Firm. Better products, Better Marketing, Surpass Symantec by 5 quarters in the SSL division, Opened an office in California, made it to the Gartner and IDC report!, so many great things has happen and will happen lets keep moving up hill.", "advice": "More training on how to better yourself in Sales, President Club fro over achievers in Sales. Rather than that keep up the GREAT work!!!"}, {"title": "What a mess!", "text": "Pros My boss was great, but she was the exception. Well-respected in core industry of SSL certificates. Cons Low pay, zero communication, tons of turnover. People are let go on a whim. Enterprise products are more hype than substance. CEO seems to think he can \"will\" his company to pivot without providing a shred of true leadership in that direction. Every 3 months there are different people, different strategies, different tactics. Anti-malware products are unknown in the industry. Advice to Management Sell the company to someone who can succeed with it.", "rating": 1, "pros": "My boss was great, but she was the exception. Well-respected in core industry of SSL certificates.", "cons": "Low pay, zero communication, tons of turnover. People are let go on a whim. Enterprise products are more hype than substance. CEO seems to think he can \"will\" his company to pivot without providing a shred of true leadership in that direction. Every 3 months there are different people, different strategies, different tactics. Anti-malware products are unknown in the industry.", "advice": "Sell the company to someone who can succeed with it."}, {"title": "Balanced mix of veterans and freshers...a good feel", "text": "Pros This is my fifth month at Comodo...I work full time here What I liked the most about Comodo is the balanced mix, when it comes to choosing employees. We have in all our teams experienced veterans as well as freshers plus there are the ones like me too, people with a few years of experience. I can learn from seniors and can teach juniors...am evolving in the process into a better professional. It's a good feel being part of such a team... Cons There is not the usual heirarchy kind of thing at Comodo. No one plays the typical bosses though there are people who are responsible and answerable for different teams.", "rating": 5, "pros": "This is my fifth month at Comodo...I work full time here", "cons": "There is not the usual heirarchy kind of thing at Comodo. No one plays the typical bosses though there are people who are responsible and answerable for different teams.", "advice": null}, {"title": "Good work environment, friendly guys, immense scope...", "text": "Pros What I liked the most is the work environment. It's good and I'd even call it 'great'. Proper guidance and encouragement to think out of the box is what makes things tick for employees here. The employees are all friendly. Point to be noted- there are no bosses here, they are all friends for you. I found the company providing ample scope for betterment as a professional...Thanks to Comodo, I am now a better professional. I am sure I will eventualy evolve into an even better professional... Cons For those who want their professional lives to be caught up in all those silly processes and procedures which they'd love to call office etiquette, Comodo is definitely not the place. It's also not the place for those who want to laze away their time and earn money by doing nothing...mind it, the Comodo guys will make you work before they pay you, but you are definitely going to enjoy your work... Advice to Management Build the work environment more friendly within the team members", "rating": 5, "pros": "What I liked the most is the work environment. It's good and I'd even call it 'great'. Proper guidance and encouragement to think out of the box is what makes things tick for employees here. The employees are all friendly. Point to be noted- there are no bosses here, they are all friends for you. I found the company providing ample scope for betterment as a professional...Thanks to Comodo, I am now a better professional. I am sure I will eventualy evolve into an even better professional...", "cons": "For those who want their professional lives to be caught up in all those silly processes and procedures which they'd love to call office etiquette, Comodo is definitely not the place. It's also not the place for those who want to laze away their time and earn money by doing nothing...mind it, the Comodo guys will make you work before they pay you, but you are definitely going to enjoy your work...", "advice": "Build the work environment more friendly within the team members"}, {"title": "A stepping stone toward your career but not advisable as a long term opportunity", "text": "Pros Decent salary, monthly bonus, exposure to critical technologies in the internet security space that is beneficial to your overall career, free fruit in the morning (before it's gone), free coffee and tea via keurig machine. Nice co-workers, good job security in this position. Decent benefits. Cons No career growth within the company as technical support, some managers will admit that you will need to find another job if you are seeking growth. You will be expected to support a lot of products and new products with little to no documentation or warning. Rotating overnight cellphone support. Advice to Management Offer your tech support department growth opportunities especially if you want to retain great talent, calm down on releasing new products and focus on fixing your core products first.", "rating": 3, "pros": "Decent salary, monthly bonus, exposure to critical technologies in the internet security space that is beneficial to your overall career, free fruit in the morning (before it's gone), free coffee and tea via keurig machine. Nice co-workers, good job security in this position. Decent benefits.", "cons": "No career growth within the company as technical support, some managers will admit that you will need to find another job if you are seeking growth. You will be expected to support a lot of products and new products with little to no documentation or warning. Rotating overnight cellphone support.", "advice": "Offer your tech support department growth opportunities especially if you want to retain great talent, calm down on releasing new products and focus on fixing your core products first."}, {"title": "Sales", "text": "Pros People have fun. You can depend on your Co workers. Cons Spend way too much money on \"top of the line \" sales people and management who never get anything done. It frustrates committed employees who NEVER see a raise. Advice to Management Get your priorities straight and open your eyes. Why can we sew you ate being milked but you can't?", "rating": 3, "pros": "People have fun. You can depend on your Co workers.", "cons": "Spend way too much money on \"top of the line \" sales people and management who never get anything done. It frustrates committed employees who NEVER see a raise.", "advice": "Get your priorities straight and open your eyes. Why can we sew you ate being milked but you can't?"}, {"title": "Alert: unethical practices, EEOC notified", "text": "Pros Because there are no rules of conduct, employees are essentially free to expand their roles in whichever ways they see fit. A great opportunity to act aggressively, attempt a coup. Cons I was targeted and judged unfairly, although I exceeded all key performance metrics. The employees I managed had very little motivation and rarely heeded my direction. New marketing outposts were established and quickly grew into viable teams but were summarily disbanded and the offices shut down. Women are simply not treated fairly, a sad fact that led me to file several complaints. Please note that a frightening majority of the positive Glassdoor reviews are fraudulent, as this practice was mandated from senior management. There are more lawyers on site than HR representatives, as the HR department is comprised of old-empire helmets: this company farms out its human resources (imagine?). The free market will dictate Comodo's future: inferior products and unethical promotion and strong armed sales tactics will lead current customers to look elsewhere for superior products. Advice to Management None.", "rating": 1, "pros": "Because there are no rules of conduct, employees are essentially free to expand their roles in whichever ways they see fit. A great opportunity to act aggressively, attempt a coup.", "cons": "I was targeted and judged unfairly, although I exceeded all key performance metrics. The employees I managed had very little motivation and rarely heeded my direction. New marketing outposts were established and quickly grew into viable teams but were summarily disbanded and the offices shut down. Women are simply not treated fairly, a sad fact that led me to file several complaints. Please note that a frightening majority of the positive Glassdoor reviews are fraudulent, as this practice was mandated from senior management. There are more lawyers on site than HR representatives, as the HR department is comprised of old-empire helmets: this company farms out its human resources (imagine?). The free market will dictate Comodo's future: inferior products and unethical promotion and strong armed sales tactics will lead current customers to look elsewhere for superior products.", "advice": "None."}, {"title": "inside sales", "text": "Pros You can make money if you're motivated. Greet people, they do care how well you do. They also have fun with the job and each other. If you are looking for a stable sales position this is it. Cons What I considered long hours. Must know what you're getting yourself into and enjoy talking to people and be able to handle constant rejection. Advice to Management I thought management did a great job of explaining the job and supporting. I think they have a strong formula for success it's just not a job for everyone.", "rating": 5, "pros": "You can make money if you're motivated. Greet people, they do care how well you do. They also have fun with the job and each other. If you are looking for a stable sales position this is it.", "cons": "What I considered long hours. Must know what you're getting yourself into and enjoy talking to people and be able to handle constant rejection.", "advice": "I thought management did a great job of explaining the job and supporting. I think they have a strong formula for success it's just not a job for everyone."}, {"title": "Stay away to protect your sanity", "text": "Pros Freedom to do what you want. With no supervision. Heslth Benefits are good. Cons Pay is extremely low. Lack of accountability no supervision, no guidelines. Low class employees & management with no work ethic, nlanguage with no morals and who all use filthy, nasty foul language from the owner down to the call center manager and her underlings. Place is stocked with boozers, partners who screw around together and up each other's arses. Toxic toxic low life environment. Crass owner and management. Advice to Management Fix that place of a joke?² Waste of employee's time and efforts. Employee is not appreciated. Cesspool from top down. It starts and ends there so no change is in order. Hire quality, be quality so that you're not v constantly hiring.. Very high turnover rate.", "rating": 1, "pros": "Freedom to do what you want. With no supervision. Heslth Benefits are good.", "cons": "Pay is extremely low. Lack of accountability no supervision, no guidelines. Low class employees & management with no work ethic, nlanguage with no morals and who all use filthy, nasty foul language from the owner down to the call center manager and her underlings. Place is stocked with boozers, partners who screw around together and up each other's arses. Toxic toxic low life environment. Crass owner and management.", "advice": "Fix that place of a joke?² Waste of employee's time and efforts. Employee is not appreciated. Cesspool from top down. It starts and ends there so no change is in order. Hire quality, be quality so that you're not v constantly hiring.. Very high turnover rate."}, {"title": "software engineer", "text": "Pros there is no pros at Comodo Cons upper management is very bad", "rating": 1, "pros": "there is no pros at Comodo", "cons": "upper management is very bad", "advice": null}, {"title": "Not what it's made out to be", "text": "Pros Not sure if there are any pros in working for the company itself besides fruit and coffee/tea in the morning. Building security guard is awesome! Cons I worked at Comodo for 2 months. In that time I learned ALL MANAGEMENT is absolutely terrible. My \"team lead\" does/did NOTHING to assist. On the contrary, she would just walk around gossiping all day and over-analyzing how many times you got up or how long you were in the restroom. It's literally like being back in high school, nothing but drama. Management talks down on other employees, specifically new ones. The ONE team lead who is actually helpful, I'd always get up and go to him for any questions. - When you first begin on the floor after 1 week of terrible \"training\" they throw you out on the sales floor to fend for yourself. They give you quotas that are not only unrealistic but also lower than what they actually require of you to reach in order to keep the job. So unless you surpass your quota for the first three months, you'll be fired. Several people who met their quotas every month had still not received any raises after working there for over 1 year. - It just seems like people get fired everyday. The hiring manager who I met ONCE at only my interview was fired literally 2 days after my group began \"training\". Before I left, only 2 people out of my whole group were left. By now, I'm sure they've been let go as well. Literally, if management \"doesn't like you\" you're guaranteed to get fired. - Bottomline, this isn't a good opportunity. You're promised this awesome job that turns out to be a joke. I left a great job with a wonderful company for promises that were never kept. Advice to Management There's no hope. Actual PROFESSIONAL management needs to be put in place. However, that won't ever happen with the CEO being as terrible as he is. The management is a perfect reflection of the CEO.", "rating": 1, "pros": "Not sure if there are any pros in working for the company itself besides fruit and coffee/tea in the morning. Building security guard is awesome!", "cons": "I worked at Comodo for 2 months. In that time I learned ALL MANAGEMENT is absolutely terrible. My \"team lead\" does/did NOTHING to assist. On the contrary, she would just walk around gossiping all day and over-analyzing how many times you got up or how long you were in the restroom. It's literally like being back in high school, nothing but drama. Management talks down on other employees, specifically new ones. The ONE team lead who is actually helpful, I'd always get up and go to him for any questions. - When you first begin on the floor after 1 week of terrible \"training\" they throw you out on the sales floor to fend for yourself. They give you quotas that are not only unrealistic but also lower than what they actually require of you to reach in order to keep the job. So unless you surpass your quota for the first three months, you'll be fired. Several people who met their quotas every month had still not received any raises after working there for over 1 year. - It just seems like people get fired everyday. The hiring manager who I met ONCE at only my interview was fired literally 2 days after my group began \"training\". Before I left, only 2 people out of my whole group were left. By now, I'm sure they've been let go as well. Literally, if management \"doesn't like you\" you're guaranteed to get fired. - Bottomline, this isn't a good opportunity. You're promised this awesome job that turns out to be a joke. I left a great job with a wonderful company for promises that were never kept.", "advice": "There's no hope. Actual PROFESSIONAL management needs to be put in place. However, that won't ever happen with the CEO being as terrible as he is. The management is a perfect reflection of the CEO."}, {"title": "Product Management", "text": "Pros Innovative and growth focused. Technical leader, crucial in the Security space.. Strong Patent portfolio, competitive compensation and healthcare, and (so far) nice people.. =) Cons US-based, but global company, with NJ HQ, makes it difficult for CA time zone. Investment in Human Resources would help Comodo achieve 'parity' with Silicon Valley work environment expectations and culture.", "rating": 5, "pros": "Innovative and growth focused. Technical leader, crucial in the Security space..", "cons": "US-based, but global company, with NJ HQ, makes it difficult for CA time zone.", "advice": null}, {"title": "Sales", "text": "Pros The people are nice. I think with the new CRO and others he brought on, they're trying to run sales like a real organization. Focus on marketing the endpoint should help build brand awareness. Cons For a sales org, salesforce.com is a must. Comodo uses a tool called V-tiger. It's clunky and has 10% of the functionality of sfdc. They also don't have an exchange server. You can't look up people's email addresses in the company in outlook, they reply on a spreadsheet. You also can't sync your calendar to your phone without buying a 3rd party app. No one outside of the ssl world knows comodo, especially in the endpoint enterprise space, but I think that'll change. Advice to Management Bring in a CEO and board who have experience.", "rating": 3, "pros": "The people are nice. I think with the new CRO and others he brought on, they're trying to run sales like a real organization. Focus on marketing the endpoint should help build brand awareness.", "cons": "For a sales org, salesforce.com is a must. Comodo uses a tool called V-tiger. It's clunky and has 10% of the functionality of sfdc.", "advice": "Bring in a CEO and board who have experience."}, {"title": "Software- SEO Services", "text": "Pros Good place to start your career and there are many learning opportunities. Cons Try to provide employees some recentral activities", "rating": 5, "pros": "Good place to start your career and there are many learning opportunities.", "cons": "Try to provide employees some recentral activities", "advice": null}, {"title": "Short stay, worst company I ever worked for.", "text": "Pros Do not apply to this company Cons The company expect you to learn all there products in a one week training. If you do not pass there test they will terminate you. Very high turn around. Don't waste your time. Advice to Management You need to hirer a new trainer. The one you have is horrible. It's bad enough you only give one week training. But to have your trainer late every day is worst.", "rating": 1, "pros": "Do not apply to this company", "cons": "The company expect you to learn all there products in a one week training. If you do not pass there test they will terminate you. Very high turn around. Don't waste your time.", "advice": "You need to hirer a new trainer. The one you have is horrible. It's bad enough you only give one week training. But to have your trainer late every day is worst."}, {"title": "DO NOT WASTE YOUR TIME!", "text": "Pros \"Resume` filler\" is about the only pro I can think of, but management refuses to write simple recommendations no matter how good a relationship you think you might have with managers/team-leaders. Coffee and fruit provided Cons If there was a way to not give any stars I would explore that option. Just a terrible work experience all around. Comodo simply tries to steal clients from their competitors with ULTRA-AGGRESSIVE calling and sales tactics. You are expected to make 120-150 calls every day and log about 3 hours of talk time. Longer than 15 minute breaks are frowned-upon. This place is the sweatshop of call-centers. And you are on top of one another, can barely hear yourself think most of the time. Highly unprofessional in every aspect.  One of the biggest regrets I have was wasting over a year of my 20's at this joke of a sales job. Might as well be tele-marketing. Not a true inside sales environment when leads are absolutely destroyed from being called multiple times a day from different reps. Some companies claimed they were called 60 times a month. Management is virtually non-existent. Only care about your most recent sales numbers and that is ALL. Very short leash, extremely high turnover, very little guidance from team leads. Even the tenured managers only care about their own tenured reps, and feed them leads/sales once in a while. Managers should be helping reps close deals! not micro-managing and checking calls and talk time every few hours, announcing them for everyone to hear. One week of LOUSY in-house \"training\" where you learn the bare-minimum of the product set. WORST marketing team, cant even call them marketing, as they spend most of their efforts tracking call numbers of sales reps and reporting them to management. Company never spends money on advertising or getting their name out there, other than on their own websites. OH and they deploy dirt cheap promotions that undercut sales reps deals by turning a 1-2K sale into $100-$300 sales. Reps lose sales to re-sellers of the company. As you can see I can probably keep writing all day about the CONS OF COMODO, but I have better things to do, working at a REAL COMPANY now. Good luck! Advice to Management Do the opposite of everything you are doing now.", "rating": 1, "pros": "\"Resume` filler\" is about the only pro I can think of, but management refuses to write simple recommendations no matter how good a relationship you think you might have with managers/team-leaders.", "cons": "If there was a way to not give any stars I would explore that option. Just a terrible work experience all around. Comodo simply tries to steal clients from their competitors with ULTRA-AGGRESSIVE calling and sales tactics. You are expected to make 120-150 calls every day and log about 3 hours of talk time. Longer than 15 minute breaks are frowned-upon. This place is the sweatshop of call-centers. And you are on top of one another, can barely hear yourself think most of the time. Highly unprofessional in every aspect.", "advice": "Do the opposite of everything you are doing now."}, {"title": "Would Not advise to work here", "text": "Pros They seem to care about you and want you to grow in the position you are in or to a better one. Cons Micro Management is not nice and everything they make you feel is all fake. There is not growth your salary is horribly low and they don't listen. The ones that do listen have no memory of the conversations that you have which means nothing will get done. They think they are the best thing out there but the only thing they are good for is very low prices. Advice to Management Leave the people alone to do what they need to and stop pretending that you know everything in the world which you do not.", "rating": 1, "pros": "They seem to care about you and want you to grow in the position you are in or to a better one.", "cons": "Micro Management is not nice and everything they make you feel is all fake. There is not growth your salary is horribly low and they don't listen. The ones that do listen have no memory of the conversations that you have which means nothing will get done. They think they are the best thing out there but the only thing they are good for is very low prices.", "advice": "Leave the people alone to do what they need to and stop pretending that you know everything in the world which you do not."}, {"title": "it was alright", "text": "Pros money was good, paid pretty well the commission was great, coworkers were friendly. Cons management sucks they do not care enough about the new people who come in for them to be successful in the company Advice to Management there is no type of training to prepare some yo work in comodo they just throw you into the fire and you you gotta figure it out yourself", "rating": 3, "pros": "money was good, paid pretty well the commission was great, coworkers were friendly.", "cons": "management sucks they do not care enough about the new people who come in for them to be successful in the company", "advice": "there is no type of training to prepare some yo work in comodo they just throw you into the fire and you you gotta figure it out yourself"}, {"title": "Marketing Analyst", "text": "Pros Hours were good, Pay was decent for recent college graduate, Health Benefits were ok, Cons No orientation, No Training, Really bad systems they use and make in house, Advice to Management Become a real marketing deparment dont be cheap", "rating": 3, "pros": "Hours were good, Pay was decent for recent college graduate, Health Benefits were ok,", "cons": "No orientation, No Training, Really bad systems they use and make in house,", "advice": "Become a real marketing deparment dont be cheap"}, {"title": "Great learning curve. Vision changes often and sometimes at a whim", "text": "Pros A lot of opportunity to own your own projects and a great learning opportunity Cons A lot of sudden structure and vision changes. Undervalued at times. Advice to Management Awknowledge your hard working employees who have contributed great things and stick around. Provide more team building and company events. When employees are shown appreciation they enjoy working more", "rating": 3, "pros": "A lot of opportunity to own your own projects and a great learning opportunity", "cons": "A lot of sudden structure and vision changes. Undervalued at times.", "advice": "Awknowledge your hard working employees who have contributed great things and stick around. Provide more team building and company events. When employees are shown appreciation they enjoy working more"}, {"title": "Good place to start off", "text": "Pros Great place to get a start in your sales career. Office is right next to Newport mall and makes for an easy commute. Cons Revolving door as are many of these types of sales organizations. Could be stressful to hit quota. Lots of cold calling. Advice to Management Try and incorporate a better culture and learn more about your employees rather than just hire and fire if people don't work out.", "rating": 3, "pros": "Great place to get a start in your sales career. Office is right next to Newport mall and makes for an easy commute.", "cons": "Revolving door as are many of these types of sales organizations. Could be stressful to hit quota. Lots of cold calling.", "advice": "Try and incorporate a better culture and learn more about your employees rather than just hire and fire if people don't work out."}, {"title": "Good job", "text": "Pros The company is an interesting place to work with many different parts moving at the same time need to be quick and adaptable to thrive. Cons Under appreciated you really need to Lear what it is that you are required to to and continue to prove youraelf Advice to Management To be open minded and respectful show you approate the employees you have and reward them for work and the effort they have done so far for the company.", "rating": 3, "pros": "The company is an interesting place to work with many different parts moving at the same time need to be quick and adaptable to thrive.", "cons": "Under appreciated you really need to Lear what it is that you are required to to and continue to prove youraelf", "advice": "To be open minded and respectful show you approate the employees you have and reward them for work and the effort they have done so far for the company."}, {"title": "I really didn't like working there", "text": "Pros My small marketing team was a pleasure to work with. The office was never very busy, so there were no late work nights. Cons I was told I'd have a certain function on the marketing team, but ended up doing something completely different. There was no training or guidance from senior employees. Some of the people in different departments were some of the worst people I've ever met. The CEO was a pain to deal with - he insisted on daily meetings, gave no guidance, and was very critical of everyone. The company had no structure in general. I only ever spoke with my \"boss\" twice - once for a phone interview and once when he asked me how my day was in the kitchen.", "rating": 3, "pros": "My small marketing team was a pleasure to work with.", "cons": "I was told I'd have a certain function on the marketing team, but ended up doing something completely different.", "advice": null}, {"title": "Big company with friendly culture", "text": "Pros The company takes care of its employee. You work with a diverse team of knowledgeable experts. There will always be people trying to cut corners and whining about everything. For professionals, this company as good as others in the industry. Cons I wish there was a better orientation period to familiarize new recruits with Comodo products. Advice to Management Have recreational days so that it brings more life to the workplace.", "rating": 5, "pros": "The company takes care of its employee. You work with a diverse team of knowledgeable experts. There will always be people trying to cut corners and whining about everything. For professionals, this company as good as others in the industry.", "cons": "I wish there was a better orientation period to familiarize new recruits with Comodo products.", "advice": "Have recreational days so that it brings more life to the workplace."}, {"title": "Glassdoor needs to take down the bogus reviews", "text": "Pros Their has been a mandate by senior management to have a member of the it staff put up a good review for every negative true review their is. Cons I think this practice says it all. This company is awful on every way. Advice to Management Let the reviews stand and change", "rating": 1, "pros": "Their has been a mandate by senior management to have a member of the it staff put up a good review for every negative true review their is.", "cons": "I think this practice says it all. This company is awful on every way.", "advice": "Let the reviews stand and change"}, {"title": "A joke", "text": "Pros Many of the account managers are innocent and good people. Cons Terrible company headed by a cheap pompous CEO with the people skills of a rock. Half the team leads and sales managers are not fit to work at Home Depot. Advice to Management Go public so that shareholders can control the company instead of being drowned by Melih's sporadic decision making and inept business sense.", "rating": 1, "pros": "Many of the account managers are innocent and good people.", "cons": "Terrible company headed by a cheap pompous CEO with the people skills of a rock. Half the team leads and sales managers are not fit to work at Home Depot.", "advice": "Go public so that shareholders can control the company instead of being drowned by Melih's sporadic decision making and inept business sense."}, {"title": "Account Manager", "text": "Pros nothing at all, there is absolutely no positive to working at this company unless you consider a horrible CEO and crappy working environment positive, i sure do not Cons there are no cons to working at comodo, it is legal slave labor, unrealistic quotas with an egotistical CEO who has no idea of how to deal with anybody. He (Melih) is a greedy egotistical incompetent individual Advice to Management sell the company and stay far far away from anything considered a company, never run a company again", "rating": 1, "pros": "nothing at all, there is absolutely no positive to working at this company unless you consider a horrible CEO and crappy working environment positive, i sure do not", "cons": "there are no cons to working at comodo, it is legal slave labor, unrealistic quotas with an egotistical CEO who has no idea of how to deal with anybody. He (Melih) is a greedy egotistical incompetent individual", "advice": "sell the company and stay far far away from anything considered a company, never run a company again"}, {"title": "One of the worst Companies to work for", "text": "Pros Absolutely nothing. If you worked here, you will never forget the Waste Of time. Cons This company is a joke. If you have the misfortune to work for a company like this, I feel for you. Look at all the reviews. The negative reviews are so extreme that people just hated working here. The CEO is insane and an egotistical jerk that thinks he is steve jobs. He goes around telling people how he is so great at everything and that he reads all the books out there. The issues this company had starts with him. He is just looking to make money and don't care for anyone and sadly will not contribute to society in any positive manner. Advice to Management How hard is it to treat people better? You are hurting people and their families.", "rating": 1, "pros": "Absolutely nothing. If you worked here, you will never forget the Waste Of time.", "cons": "This company is a joke. If you have the misfortune to work for a company like this, I feel for you. Look at all the reviews. The negative reviews are so extreme that people just hated working here. The CEO is insane and an egotistical jerk that thinks he is steve jobs. He goes around telling people how he is so great at everything and that he reads all the books out there. The issues this company had starts with him. He is just looking to make money and don't care for anyone and sadly will not contribute to society in any positive manner.", "advice": "How hard is it to treat people better? You are hurting people and their families."}, {"title": "Supervisor", "text": "Pros Great boss who tried to support their team. Cons Poor structure, no concept of process. Terrible morale and no HR department. CEO is extremely perplexed and changes his mind on a whim. I was told numerous times if he did not like you then he would fire you.", "rating": 1, "pros": "Great boss who tried to support their team.", "cons": "Poor structure, no concept of process. Terrible morale and no HR department. CEO is extremely perplexed and changes his mind on a whim. I was told numerous times if he did not like you then he would fire you.", "advice": null}, {"title": "TERRIBLE MANAGEMENT/ DO NOT WORK HERE", "text": "Pros compensation and work hours were decent. Cons Poor Management. There wasnt enough training, The so called \"team lead\" did not know how to lead but complain that the new employees dont know any of the products yet even if its only been 2 weeks. They treat the new employees terribly. Upper management wont do anything to help. Youre basically on your own after one week of training. They were terribile with training, if you dont know anything by two weeks your done. They had favoritism as well. Shady people. Advice to Management They should have longer training. Better team leads that actually know how to be a team leader. Micro manage the team leads instead of the new employees. Should know how to help the new employees and give positive reinforicement instead of complaints. This is why there is a high turnover rate. People fire and hire. Noticed they stay no longer than 2 months.", "rating": 3, "pros": "compensation and work hours were decent.", "cons": "Poor Management. There wasnt enough training, The so called \"team lead\" did not know how to lead but complain that the new employees dont know any of the products yet even if its only been 2 weeks. They treat the new employees terribly. Upper management wont do anything to help. Youre basically on your own after one week of training. They were terribile with training, if you dont know anything by two weeks your done. They had favoritism as well. Shady people.", "advice": "They should have longer training. Better team leads that actually know how to be a team leader. Micro manage the team leads instead of the new employees. Should know how to help the new employees and give positive reinforicement instead of complaints. This is why there is a high turnover rate. People fire and hire. Noticed they stay no longer than 2 months."}, {"title": "Sales Rep.", "text": "Pros Good compensation and opportunity to move up in the company for high performers. Great co-workers always willing to help and answer questions. CEO very involved, you can expect him to ask you to pitch him at some point. Fruit and coffee every day doesn't hurt. Cons There are a lot of products to learn and not a lot of training. They had been putting some effort into sales training recently but need to make it ongoing. Consistent low performers do get fired but they are given ample time and opportunity to prove themselves. Advice to Management My advice to management is to have quick once a month training on selling and closing. Also trainings on different products since we offer over 25 different products. It is difficult for people to sell what they don't understand. Advice for new hires is to invest extra time at home in learning to sell in general and the products. Comodo needs a marketing team that gets the brand known. They shouldn't be only running numbers and judging the sales team.", "rating": 5, "pros": "Good compensation and opportunity to move up in the company for high performers. Great co-workers always willing to help and answer questions. CEO very involved, you can expect him to ask you to pitch him at some point. Fruit and coffee every day doesn't hurt.", "cons": "There are a lot of products to learn and not a lot of training. They had been putting some effort into sales training recently but need to make it ongoing. Consistent low performers do get fired but they are given ample time and opportunity to prove themselves.", "advice": "My advice to management is to have quick once a month training on selling and closing. Also trainings on different products since we offer over 25 different products. It is difficult for people to sell what they don't understand. Advice for new hires is to invest extra time at home in learning to sell in general and the products. Comodo needs a marketing team that gets the brand known. They shouldn't be only running numbers and judging the sales team."}, {"title": "Sales", "text": "Pros None whatsoever. They suck A-Z Cons This is not a real company. It's more like a mafia style run operation, with illegal activities happening right and left. Owner is from Turkey and he operates with with the mindsets that respecting laws is optional. I would not want my worst enemy to work here.", "rating": 1, "pros": "None whatsoever. They suck A-Z", "cons": "This is not a real company. It's more like a mafia style run operation, with illegal activities happening right and left. Owner is from Turkey and he operates with with the mindsets that respecting laws is optional. I would not want my worst enemy to work here.", "advice": null}, {"title": "Cut throat environment", "text": "Pros They are in a brand new building in Clifton. (They moved from Jersey City, which was apparently a much better location). The technology is state of the art. Cons They don't have enough engineers supporting their infrastructure. They have totally ridiculous expectations of what an employee should be able to do, and they provide ZERO training or guidance. As a sys-admin, I was expected to be an expert in networking, security, windows, gentoo linux (which nobody knows), desktop support, programming, email, applications, data centers, cabling and proprietary systems. Advice to Management Stop treating people like garbage.", "rating": 1, "pros": "They are in a brand new building in Clifton. (They moved from Jersey City, which was apparently a much better location). The technology is state of the art.", "cons": "They don't have enough engineers supporting their infrastructure. They have totally ridiculous expectations of what an employee should be able to do, and they provide ZERO training or guidance. As a sys-admin, I was expected to be an expert in networking, security, windows, gentoo linux (which nobody knows), desktop support, programming, email, applications, data centers, cabling and proprietary systems.", "advice": "Stop treating people like garbage."}, {"title": "Management", "text": "Pros Opportunities for Growth and very respectful work environment. Cons People don't last. They can't handle the job on the shoulders.", "rating": 3, "pros": "Opportunities for Growth and very respectful work environment.", "cons": "People don't last. They can't handle the job on the shoulders.", "advice": null}, {"title": "Challenging & Rewarding experiences", "text": "Pros - Challenging Projects, great for fresh out of college graduates - CEO mentorship, he will teach you how to make money - You will learn how to be profitable, which is a great resume booster - You get a chance to work in a team with different strengths - A lot of opportunities for growth in your career Cons - Lack of company events (bowling, happy hour, etc.) Advice to Management There should be more cohesive flow of information from upper management to their employees.", "rating": 5, "pros": "- Challenging Projects, great for fresh out of college graduates", "cons": "- Lack of company events (bowling, happy hour, etc.)", "advice": "There should be more cohesive flow of information from upper management to their employees."}, {"title": "My experience with Comodo is good.", "text": "Pros Great scope for career in the security industry. Learnt about new terms such as SSL. Friendly peer group Supportive management Cons Compensation Team activities Promotions are slow Advice to Management If skilled people could be identified earlier and duly rewarded, it will motivate them better.", "rating": 5, "pros": "Great scope for career in the security industry.", "cons": "Compensation", "advice": "If skilled people could be identified earlier and duly rewarded, it will motivate them better."}, {"title": "Stay away goals are set high to ensure higher turn over rate !!!", "text": "Pros Getting fired, football pool was great! Cons Leaving my Job to come there place is a grave yard for sale s rep to go and die Advice to Management Shutdown scrap the company management used to give inbound sales to certain people and take a cut thats how bad it is I survived 5months in those five months the trainer was fired during training class the vp was fired during training class the recruiting department was fired before my first month the guy from hr that does the firing go t fired thwn they downsized to Clifton from downtown jersey city", "rating": 1, "pros": "Getting fired, football pool was great!", "cons": "Leaving my Job to come there place is a grave yard for sale s rep to go and die", "advice": "Shutdown scrap the company management used to give inbound sales to certain people and take a cut thats how bad it is I survived 5months in those five months the trainer was fired during training class the vp was fired during training class the recruiting department was fired before my first month the guy from hr that does the firing go t fired thwn they downsized to Clifton from downtown jersey city"}, {"title": "RUN FOREST RUN; Seriously don't work there!", "text": "Pros Free coffee and fruit in the morning…seriously thats it though Cons Every other aspect; no leadership, no mentoring, no strategy, unrealistic, mind-baffling quota…its a cold-calling telesales job where you are making over 120 calls a day and getting through to no one because its essentially calling a phonebook. The marketing dept. is also a joke; lets throw sh*t at the wall and see what sticks..absolutely a farce..if you need the money short term I guess go for it but if you have other options take them and/or never stop looking for another place..total debacle from start to finish. Advice to Management lol--this is comical..get out of your own way..monkeys can't sell bananas.", "rating": 1, "pros": "Free coffee and fruit in the morning…seriously thats it though", "cons": "Every other aspect; no leadership, no mentoring, no strategy, unrealistic, mind-baffling quota…its a cold-calling telesales job where you are making over 120 calls a day and getting through to no one because its essentially calling a phonebook. The marketing dept. is also a joke; lets throw sh*t at the wall and see what sticks..absolutely a farce..if you need the money short term I guess go for it but if you have other options take them and/or never stop looking for another place..total debacle from start to finish.", "advice": "lol--this is comical..get out of your own way..monkeys can't sell bananas."}, {"title": "Comodo is a revolving door..hit your unrealistic quota or expect to be fired or quit within 5 months. Worst company.", "text": "Pros They hire almost everyone with decent 30k salary. Free coffee and fruit daily. Cons The job is telemarketing cold calling which people hate. No incoming calls because Comodo has a terrible reputation. Even if your a good salesperson the support team with destroy many of your deals by being rude to customers. They fire almost everyone. No job security or positive reinforcement. Pressure with scares of losing your job every few weeks. You will be fired or quit within 5-6 months most people last 1-2 months. Terrible commute alot of traffic coming from surrounding areas. Advice to Management The system of treating your salespeople bad with constant uncertainty of having a job doesn't motivate people to do better, just burns people out. Stop firing so many people and build upon some good sales people. Hint only 2-3 people hit quota a month out of 25 people.", "rating": 1, "pros": "They hire almost everyone with decent 30k salary.", "cons": "The job is telemarketing cold calling which people hate.", "advice": "The system of treating your salespeople bad with constant uncertainty of having a job doesn't motivate people to do better, just burns people out. Stop firing so many people and build upon some good sales people. Hint only 2-3 people hit quota a month out of 25 people."}, {"title": "Work life is balanced and sensible goals to achieve.", "text": "Pros I like working here because the company's working hours and schedules didn't affect my personal life. I had these issues in my previous company but Comodo helped me in that regards. Besides helpful co-workers and my job role, there isn't much to be said about. It's going ok so far, and still learning. Cons There is no choice of food in the cafe and overall work environment lacks professional touch. It can be better. Employee recreational activities are limited. Advice to Management Add more recreational games to beat job stress.", "rating": 3, "pros": "I like working here because the company's working hours and schedules didn't affect my personal life. I had these issues in my previous company but Comodo helped me in that regards. Besides helpful co-workers and my job role, there isn't much to be said about. It's going ok so far, and still learning.", "cons": "There is no choice of food in the cafe and overall work environment lacks professional touch. It can be better. Employee recreational activities are limited.", "advice": "Add more recreational games to beat job stress."}, {"title": "This company is completely dysfunctional", "text": "Pros They are profitable. They pay well. They have great antivirus technology. Cons Management is completely arbitrary. I wasn't able to spend time doing the job for which I was hired because I had to fight fires and cover for others who weren't doing their jobs. It felt like I was hired just to take blame. Advice to Management Focus on your core products. Be more sensitive to the real operational issues that are slowing down development.", "rating": 1, "pros": "They are profitable. They pay well. They have great antivirus technology.", "cons": "Management is completely arbitrary. I wasn't able to spend time doing the job for which I was hired because I had to fight fires and cover for others who weren't doing their jobs. It felt like I was hired just to take blame.", "advice": "Focus on your core products. Be more sensitive to the real operational issues that are slowing down development."}, {"title": "Mediocre earning potential, high employee turnover", "text": "Pros Competitive initial salary with bumps for hitting initial quotas. Paid training. Nice building (even if it is pretty much empty) and all the free coffee you can drink. Semi-supportive management (for more read cons). My experience was generally positive. Cons Extremely high employee turnover, I saw dozens of people hired and let go during my tenure. Management was supportive but understand that they are \"supportive\" until you miss a quota. Depending on which dept. you're in, expect 2/3 of the people you were trained with to be gone within the first month. Long story short, expect to be let go within the first 3 months. Quotas are unrealistic and few sales people hit their number on a month to month basis. Instead of working on new sales strategies and promotions they insist on hounding potential customers (check customer reviews elsewhere, they go far more in depth). Sales is a \"set it and forget it\" mentality, create the order, forget the client and move on. Advice to Management Good luck.", "rating": 3, "pros": "Competitive initial salary with bumps for hitting initial quotas. Paid training. Nice building (even if it is pretty much empty) and all the free coffee you can drink. Semi-supportive management (for more read cons). My experience was generally positive.", "cons": "Extremely high employee turnover, I saw dozens of people hired and let go during my tenure. Management was supportive but understand that they are \"supportive\" until you miss a quota. Depending on which dept. you're in, expect 2/3 of the people you were trained with to be gone within the first month. Long story short, expect to be let go within the first 3 months.", "advice": "Good luck."}, {"title": "Telemarketing and spam blasts. Hit your unrealistic quota, or you are fired.", "text": "Pros Fun atmosphere minus the telemarketing. Free coffee and fruit. The CEO is generous with buying food for everyone. Most people there are fun to be around. Incentives for hitting quota. Cons Hilarious turnover rate. Yes, it's true, most of these positive reviews are fake. I saw these reviews before I was hired, and then fired and I should have listened. I feel like the marketing department writes these review (you can tell by the similar positive reviews and grammar style). It must look so bad the upper management tells others to write these reviews. I have not met a \"3 year employee\", let alone 1 year employee even for management. You get a 1 week paid training class. The website vtiger you use to manage the clients you spam is TERRIBLE and is not explained well at all in training. The system goes down often. You have to hit a certain number of sales your first month or you are fired. The majority of people you train with will either get fired or quit. When you train, take a look at the floor and people working ... the \"face\" of Comodo will be quite different than what you saw before in 1 week. They only care about an order number or credit card from a client. Advice to Management You're only wasting more money by hiring, then firing. There needs to be a longer training period other than what an SSL is. I understand you learn most on the floor, but it's unrealistic to expect workers to produce a number, then suddenly expect them to cross sell other expensive products that we have no idea what the are. Fix your coding and software (your SSL's are not always compatible), and quit spamming the same clients 100 times a day. We have lost more business to hounding clients through telemarkerting than anything else.", "rating": 1, "pros": "Fun atmosphere minus the telemarketing. Free coffee and fruit. The CEO is generous with buying food for everyone. Most people there are fun to be around. Incentives for hitting quota.", "cons": "Hilarious turnover rate. Yes, it's true, most of these positive reviews are fake. I saw these reviews before I was hired, and then fired and I should have listened. I feel like the marketing department writes these review (you can tell by the similar positive reviews and grammar style). It must look so bad the upper management tells others to write these reviews. I have not met a \"3 year employee\", let alone 1 year employee even for management.", "advice": "You're only wasting more money by hiring, then firing. There needs to be a longer training period other than what an SSL is. I understand you learn most on the floor, but it's unrealistic to expect workers to produce a number, then suddenly expect them to cross sell other expensive products that we have no idea what the are. Fix your coding and software (your SSL's are not always compatible), and quit spamming the same clients 100 times a day. We have lost more business to hounding clients through telemarkerting than anything else."}, {"title": "Sickening", "text": "Pros -pay if you can stand to work there Cons -terrible commute - spam telemarketing people that know who we are because we have already called them 300 times. - SUPER high turnover, I was hired with 10 other people, all fired/quit within 2 months. Advice to Management Do not spam call potential clients, calling the same people every other day is not the way to do business. Sometimes calling 3-4 times in the same day. should probably just switch the business model you guys are doing - the shotgun approach to sales - use generic presentation on the phone 150 times per day does not work.", "rating": 3, "pros": "-pay if you can stand to work there", "cons": "-terrible commute", "advice": "Do not spam call potential clients, calling the same people every other day is not the way to do business. Sometimes calling 3-4 times in the same day."}, {"title": "Horrible Experience Stay Far Away", "text": "Pros Pay , Location , Basic Call Center Experience Cons Staff doesn't care about you at all . If you don't meet your goals the first month they throw you out there you are fired ! They only care about unrealistic goals in a very tough and limited selling market . It feels like your working your butt off for little to no compensation . Its not worth it . Also , they only give you one week of training and expect you to produce immediately when there is so much that you need to know before getting on the phones.", "rating": 1, "pros": "Pay , Location , Basic Call Center Experience", "cons": "Staff doesn't care about you at all . If you don't meet your goals the first month they throw you out there you are fired ! They only care about unrealistic goals in a very tough and limited selling market . It feels like your working your butt off for little to no compensation . Its not worth it .", "advice": null}, {"title": "Absolute Joke of a Company", "text": "Pros You're in the same boat with the other employees. Cons Everything. Fake reviews on this site are very entertaining. This is the WORST place ever to work. Advice to Management Hire someone else to run the company and go away. You are evil, go back to where you came from.", "rating": 1, "pros": "You're in the same boat with the other employees.", "cons": "Everything. Fake reviews on this site are very entertaining. This is the WORST place ever to work.", "advice": "Hire someone else to run the company and go away. You are evil, go back to where you came from."}, {"title": "I enjoy working here", "text": "Pros The company is convenient to work. Very flexible top management. Streamlined job roles. And, most of all it's a new lesson every day to be here. I recommend Comodo to my level best. Cons Transit is bit difficult by car and the parking area is not spacious as it should be. Advice to Management Need more space for parking, if possible", "rating": 5, "pros": "The company is convenient to work.", "cons": "Transit is bit difficult by car and the parking area is not spacious as it should be.", "advice": "Need more space for parking, if possible"}, {"title": "I learnt the nuances of SSL industry from the best CA.", "text": "Pros Introduced me to the world of SSL Professional work atmosphere Streamlined deadlines Supportive management Cons More employee benefits should be added, in the near future. Advice to Management Glad that I could be part of this company.", "rating": 5, "pros": "Introduced me to the world of SSL", "cons": "More employee benefits should be added, in the near future.", "advice": "Glad that I could be part of this company."}, {"title": "Hit quota or your fired!", "text": "Pros Great introduction to software and B2b sales Cons High pressure environment exacerbated by long work hours, inflexible management, and intense micro management. You Work from 9 to 6 and are expected to stay to 7 at least once a week. One hour lunch, and reprimands if you actually take your break. I'm posting this because the reviews on here are fake. They're trying to make comodo seem like a cool, fun progressive work environment but in reality it's grueling. If they want to be like Google or yelp they should let adults be adults and work instead of baby sitting your every move. The fact that almost everyone I work with has been there less than 6 months and most new hires don't pass the 1 month mark makes me wonder who these happy longer than 3 year employees are. Where are they, I'd love to meet them! Advice to Management Focus on developing the team you have instead of praying for magic sales genius new hires!", "rating": 1, "pros": "Great introduction to software and B2b sales", "cons": "High pressure environment exacerbated by long work hours, inflexible management, and intense micro management. You Work from 9 to 6 and are expected to stay to 7 at least once a week. One hour lunch, and reprimands if you actually take your break.", "advice": "Focus on developing the team you have instead of praying for magic sales genius new hires!"}, {"title": "Don't do it!!!!!!!", "text": "Pros decent salary, free coffee, place to start career in software sales Cons CEO micro manages entire company, people get fired at the drop of a hat Advice to Management keep up the good work", "rating": 3, "pros": "decent salary, free coffee, place to start career in software sales", "cons": "CEO micro manages entire company, people get fired at the drop of a hat", "advice": "keep up the good work"}, {"title": "I'm glad that I chose Comodo", "text": "Pros Very professional approach Highly qualified project leads Visionary upper management Clear and concise goals for future development Ideal support lent by team members When I first chose Comodo, I had other alternatives but the professional work environment and commitment to their products impressed me. I'm glad I made the right choice and associated myself with this company. It's going good till now and I can hardly see myself working somewhere else. My kind office, professionally and personally. Cons Parking space in the premises should be expanded at the earliest. Consider expanding the cafetaria and maybe add more food outlets to rejuvenate during work Advice to Management Do consider my suggestion regarding cafetaria as most other employees feel the same.", "rating": 5, "pros": "Very professional approach", "cons": "Parking space in the premises should be expanded at the earliest.", "advice": "Do consider my suggestion regarding cafetaria as most other employees feel the same."}, {"title": "Job is good for new college grads to gain some work experience.", "text": "Pros An opportunity to make a lot of money. Salary is okay, especially with the extra 12k you can get in your first 3 months. Management and people are very friendly Cons The sales goal is to high. High turnover due to reps not making their goal. Advice to Management Lower the quota for each month so reps do not feel at loss of a job when they are not meeting such a high quota", "rating": 3, "pros": "An opportunity to make a lot of money. Salary is okay, especially with the extra 12k you can get in your first 3 months. Management and people are very friendly", "cons": "The sales goal is to high. High turnover due to reps not making their goal.", "advice": "Lower the quota for each month so reps do not feel at loss of a job when they are not meeting such a high quota"}, {"title": "Reliable employment", "text": "Pros Professional work environment Appropriate job roles Assertive project leads Prime location Close to transit rail Reliable employment without any lay-off issues and appropriate job role. Office is centrally located. Easy to commute but some of those in the top management should avoid micro management. My project lead is assertive and friendly, though. Cons Pay scale revisions in the company Micro management at different levels", "rating": 5, "pros": "Professional work environment", "cons": "Pay scale revisions in the company", "advice": null}, {"title": "Great opportunity", "text": "Pros The best senior management who recognizes our talent instantly Very good company to boost your resume because you can learn and hone your technical skills right here. Well connected by rail transit and close to the Mall. I love being in Jersey City and the office building looks great. Cons Employees need more vacation and sick time. Either it should be based on personal commitment and performance or be increased for everyone. Need better support from the technical team. Advice to Management Consider increasing leave time and organize teams in a way so that they can respond without individual interference. Otherwise, everything else is good in here.", "rating": 5, "pros": "The best senior management who recognizes our talent instantly", "cons": "Employees need more vacation and sick time. Either it should be based on personal commitment and performance or be increased for everyone.", "advice": "Consider increasing leave time and organize teams in a way so that they can respond without individual interference. Otherwise, everything else is good in here."}, {"title": "I would recommend Comodo to a friend", "text": "Pros Professional workplace Colleagues Nearby mall Hassle-free job role Cons Payscale revision could be made better Add a Starbucks if possible Advice to Management The work environment and job role favors fresh candidates to improvise themselves. I'm a fresher myself but my experienced colleagues say otherwise. Please try to solve it.", "rating": 5, "pros": "Professional workplace", "cons": "Payscale revision could be made better", "advice": "The work environment and job role favors fresh candidates to improvise themselves. I'm a fresher myself but my experienced colleagues say otherwise. Please try to solve it."}, {"title": "A company with a lot of potential for solid growth", "text": "Pros Rapid expansion in various areas Very stable in terms of compensation Access to unlimited technical resources Learner's hub for those who love to learn new stuff Highly goal oriented Cons Need a clarified hierarchy for employees Advice to Management I haven't accrued enough experience yet to advice the senior management.", "rating": 5, "pros": "Rapid expansion in various areas", "cons": "Need a clarified hierarchy for employees", "advice": "I haven't accrued enough experience yet to advice the senior management."}, {"title": "Don't be fooled!!!!!", "text": "Pros Good hours, free fruit and coffee in the morning Cons All of the reviews about this being an amazing company to work for, are written by management. TRUST ME. I've been working here for almost 4 months and have seen numerous people let go. THERE IS ZERO JOB SECURITY. They expect you to learn everything during a mediocre 3 day training, and then expect you to hit $3000 in sales your first month. Very few achieve that. Rather then actually helping reps on the phone by giving them tips, the managers will sit back and watch them fail The work environment is very high school. If you tell one person something, expect the whole floor to know by lunch. The managers play a big role in that. They want you to take them seriously, it being a corporate office and all, but then they're the ones huddled around a desk whispering about who said what. The rules there only apply to certain people. If you're liked, feel free to do as you please, if not tree very carefully. A week out of my own training, everyone in my class had already decided it was time to find another job. The turnover rate is like nothing I have ever seen before. Everyone has a \"quit before you get fired\" mentality. I initially thought I was going to be working for a respectable company doing important work. HA. It's telemarketing. Cold calling people who have no idea who we are literally 10 times a day!!!! I've had so many customers blatantly tell me that they would never do business with COMODO because of the way they harass people, \"that is no way to run a respectable business\" I was told. One even suggested that I pass that information on to the CEO. Avoid this if you can seriously. I plan to leave by the end of this month, that is if I'm not fired first. And in this place that's a real possibility. Fearing losing your job everyday is no way to live. Please don't look to this as a way if supporting yourself especially if you have children like I do. This place is no guarantee of anything!!!! There are only about 4 people in the sales floor that have been here over 6 months, that in itself should telling you something. Don't say I didn't warn you. Advice to Management Get better mangers who know how to show respect to everyone not just those they like. Develop a better training so that reps feel comfortable in their knowledge when they hit the floor. Actually help those you see struggling and don't just stand by and watch them hang themselves. You can't tell someone they haven't improved when you've never showed what areas need the most improvement.", "rating": 1, "pros": "Good hours, free fruit and coffee in the morning", "cons": "All of the reviews about this being an amazing company to work for, are written by management. TRUST ME. I've been working here for almost 4 months and have seen numerous people let go. THERE IS ZERO JOB SECURITY. They expect you to learn everything during a mediocre 3 day training, and then expect you to hit $3000 in sales your first month. Very few achieve that. Rather then actually helping reps on the phone by giving them tips, the managers will sit back and watch them fail The work environment is very high school. If you tell one person something, expect the whole floor to know by lunch. The managers play a big role in that. They want you to take them seriously, it being a corporate office and all, but then they're the ones huddled around a desk whispering about who said what. The rules there only apply to certain people. If you're liked, feel free to do as you please, if not tree very carefully. A week out of my own training, everyone in my class had already decided it was time to find another job. The turnover rate is like nothing I have ever seen before. Everyone has a \"quit before you get fired\" mentality.", "advice": "Get better mangers who know how to show respect to everyone not just those they like. Develop a better training so that reps feel comfortable in their knowledge when they hit the floor. Actually help those you see struggling and don't just stand by and watch them hang themselves. You can't tell someone they haven't improved when you've never showed what areas need the most improvement."}, {"title": "I found a good start at Comodo", "text": "Pros As a fresher, I got plenty of on-job experience here. Things I like about the company include, Highly skilled team leader Co-operative peer group Good assistance provided for freshers Challenging and suitable job role Cons I'm not happy with the compensation provided but I think there's scope to expand as my skill set develops.", "rating": 5, "pros": "As a fresher, I got plenty of on-job experience here. Things I like about the company include,", "cons": "I'm not happy with the compensation provided but I think there's scope to expand as my skill set develops.", "advice": null}, {"title": "Been here for so long yet it's a challenging experience even now", "text": "Pros One thing I love about the company is that eventhough I'm working here for more than four years now, every day feels like a new day. Our team faces plenty of new challenges and goals which keeps the energy levels high at all times. Besides, with the senior management and CEO implementing new ideas with an eye on the future, it's no wonder every team has to cope up with their vision which is a rewarding experience. The central location of the office allows easy commuting and the nearby mall is a great lunch spot. Excellent work environment, visionary management and a great product line-up! Cons Something that I miss here is the absence of Star Bucks and it's bit difficult to accommodate new joinees in our team whenever an expansion occurs. But, that's just me. Advice to Management The products have great value for consumers. Better marketing strategies will definitely take the concern to new heights.", "rating": 5, "pros": "One thing I love about the company is that eventhough I'm working here for more than four years now, every day feels like a new day. Our team faces plenty of new challenges and goals which keeps the energy levels high at all times.", "cons": "Something that I miss here is the absence of Star Bucks and it's bit difficult to accommodate new joinees in our team whenever an expansion occurs. But, that's just me.", "advice": "The products have great value for consumers. Better marketing strategies will definitely take the concern to new heights."}, {"title": "Efficient senior management and satisfactory employee benefits", "text": "Pros I'm glad that the senior management in Comodo is really efficient and they ideally address employee greivances at the earliest. The freedom that we employees enjoy and the ease of access provided to communicate with the CEO or anyone in a higher position than us is exhilirating. The employee benefits are satisfactory and throughout my term, I am always rewarded accordingly for my achievements. It feels good to be recognized for your hard work. Great job, keep going... Cons Creating a more standardized induction procedure for new employees will help them know about the company and its products instantly. Advice to Management Advice to senior management – It's the same what I have already mentioned. A better induction procedure for newcomers.", "rating": 5, "pros": "I'm glad that the senior management in Comodo is really efficient and they ideally address employee greivances at the earliest.", "cons": "Creating a more standardized induction procedure for new employees will help them know about the company and its products instantly.", "advice": "Advice to senior management – It's the same what I have already mentioned. A better induction procedure for newcomers."}, {"title": "A great place to work", "text": "Pros Ample space for self-development Better level of freedom to voice our opinion Comfortable work environment Individual attention Cons Organizing team outings will boost employees Advice to Management A better, more professional work atmosphere is required.", "rating": 5, "pros": "Ample space for self-development", "cons": "Organizing team outings will boost employees", "advice": "A better, more professional work atmosphere is required."}, {"title": "Happy to be a part of Comodo", "text": "Pros I love working at Comodo, because, - The management offers ample scope for growth in career. - I'm impressed with the professional approach of my team members and my team leader. - Senior managers are very casual and friendly to approach. - Young talents will find this to be a great place to learn lots. Cons I hardly have an idea on how other teams work. Advice to Management Need more and better interaction between the teams.", "rating": 5, "pros": "I love working at Comodo, because,", "cons": "I hardly have an idea on how other teams work.", "advice": "Need more and better interaction between the teams."}, {"title": "Comodo is a friendly place to work", "text": "Pros First of all, I enjoy working here because of the cool employees, who recognize my talent and encourage me. The work environment is versatile and team management is satisfactory, in my opinion. On the whole, it's a pleasure working at Comodo. Cons There's no thing seriously bad in here but the lack of proper parking facility in the venue where I worked, was definitely annoying. Advice to Management None at the moment", "rating": 5, "pros": "First of all, I enjoy working here because of the cool employees, who recognize my talent and encourage me. The work environment is versatile and team management is satisfactory, in my opinion. On the whole, it's a pleasure working at Comodo.", "cons": "There's no thing seriously bad in here but the lack of proper parking facility in the venue where I worked, was definitely annoying.", "advice": "None at the moment"}, {"title": "Comodo gave me an excellent career opportunity", "text": "Pros Definitely the best work atmosphere, friendly colleagues, flexible shifts and prime location facilitates transportation. Cons Work environment could be more structurized. Advice to Management None", "rating": 5, "pros": "Definitely the best work atmosphere, friendly colleagues, flexible shifts and prime location facilitates transportation.", "cons": "Work environment could be more structurized.", "advice": "None"}, {"title": "Career Killer...", "text": "Pros Nice location, in heart of Jersey City Pay was good, HR person who hired me was terrific (but she left the company too) It was a job and I needed one after being unemployed! Cons Just about every other negative review on this site reflects my own experiences there as an employee. Poor management, poor communication, no real leadership. Everyone seemed afraid of the CEO. I never saw him be mean to anyone though, but I can say he didn't know my name after I was there 5 months. There was a lot of turnover , particularly in sales. I worked with the sales team and I can say selling SSL's can be very tough when you are competing against much larger companies. Advice to Management Try to develop a more open, less fearful culture.", "rating": 1, "pros": "Nice location, in heart of Jersey City", "cons": "Just about every other negative review on this site reflects my own experiences there as an employee. Poor management, poor communication, no real leadership. Everyone seemed afraid of the CEO. I never saw him be mean to anyone though, but I can say he didn't know my name after I was there 5 months. There was a lot of turnover , particularly in sales. I worked with the sales team and I can say selling SSL's can be very tough when you are competing against much larger companies.", "advice": "Try to develop a more open, less fearful culture."}, {"title": "This Company Is Terrible to Work For, Avoid Working Here....You've Been Warned!", "text": "Pros Unfortunately, I can not think of anything positive to say. That is the honest truth. There were a few cool employees that worked there though. Cons CEO is awful!~ Upper management is horrible. Terrible environment to work, learn, and grow. You will not have a fulfilled career here unless you are friends with CEO or kiss up to him. CEO and Management thrieves on cursing, insulting and belittling employees in front of the entire staff with no hesitation. I've seen some good talent come and go. Very high turnover! This is truly an honest review about this company though I am no longer with them. Though I left on good terms, I would never recommend anyone to work for this company including a recent college grad. Advice to Management CEO truly should be in the background since he lacks people skills. Upper management should be throughly trained or removed depending on individual performance and circumstances. Proper training for sales staff for improved success. Better benefits/pay should be extended.", "rating": 1, "pros": "Unfortunately, I can not think of anything positive to say. That is the honest truth. There were a few cool employees that worked there though.", "cons": "CEO is awful!~ Upper management is horrible. Terrible environment to work, learn, and grow. You will not have a fulfilled career here unless you are friends with CEO or kiss up to him. CEO and Management thrieves on cursing, insulting and belittling employees in front of the entire staff with no hesitation. I've seen some good talent come and go. Very high turnover! This is truly an honest review about this company though I am no longer with them. Though I left on good terms, I would never recommend anyone to work for this company including a recent college grad.", "advice": "CEO truly should be in the background since he lacks people skills. Upper management should be throughly trained or removed depending on individual performance and circumstances. Proper training for sales staff for improved success. Better benefits/pay should be extended."}, {"title": "Come here if you like uncertainty of your work/job.", "text": "Pros We get to do a lot more that our role. From small tasks to big, learning is a huge part of why I am still here. Good people. Cons 1. Micro management- you have to love being told what to do everyday- that too by the CEO 2. Survival on your mind: I work 60% of the time, rest of the time goes into worrying if I will survive this month or not. 3. Change in direction:- Change and new ideas are always great, but not when they happen everyday- that too from the CEO 4. Humiliation:- Anyone who is still here including me will tell you that you have to have a thick skin to take the harsh words from Melih (CEO) every other day. 5. Survival of the fittest: Don't be surprised if someone throws you under the bus without reason. This happens here all the time. 6. Lay-off: Advice to Management Let people take ownership. TO C-suite: Don't setup your people to fail, but rather help them succeed. Stop getting a kick out of people failing.", "rating": 1, "pros": "We get to do a lot more that our role. From small tasks to big, learning is a huge part of why I am still here.", "cons": "1. Micro management- you have to love being told what to do everyday- that too by the CEO", "advice": "Let people take ownership."}, {"title": "A company with a lot of potential undergoing reboot", "text": "Pros Investing in new areas No VC money Profitable, stable Lots of technical resources Cons A start-up environment with all that implies. Advice to Management Continue to revise process and establish more formal structures", "rating": 5, "pros": "Investing in new areas", "cons": "A start-up environment with all that implies.", "advice": "Continue to revise process and establish more formal structures"}, {"title": "Great company and visionary upper management.", "text": "Pros You are expected to come in do good work, and then go home and have a life. Flexible and supportive management and great coworkers. CEOs door is always open and is very casual and friendly with every single employee. He is very energetic and brilliant visionary. Cons No Starbucks coffee to keep us awake and parking is a hassle. Mass transit is the way to go... Advice to Management Explore and give more options for training current employees.", "rating": 5, "pros": "You are expected to come in do good work, and then go home and have a life. Flexible and supportive management and great coworkers. CEOs door is always open and is very casual and friendly with every single employee. He is very energetic and brilliant visionary.", "cons": "No Starbucks coffee to keep us awake and parking is a hassle. Mass transit is the way to go...", "advice": "Explore and give more options for training current employees."}, {"title": "Work hard, make success", "text": "Pros Management is very brilliant - possibly most, also great environment, lots of encouragement between the workers. Encouraged to work hard, very much, and great rewards if you are a success. CEO is definitely brilliant, pushes you to sell by his minds power to help, very encouraging. Close to the mall. Cons Some of the slower workers and sellers may feel as if they are letting CEO down. Often feel bad for fellow workers who sell dumb, sell slow, sell like they are not part of purpose. Advice to Management Could crack down on irresponsible employees more. \"Pizza Friday\" cruel joke.", "rating": 5, "pros": "Management is very brilliant - possibly most, also great environment, lots of encouragement between the workers. Encouraged to work hard, very much, and great rewards if you are a success. CEO is definitely brilliant, pushes you to sell by his minds power to help, very encouraging. Close to the mall.", "cons": "Some of the slower workers and sellers may feel as if they are letting CEO down. Often feel bad for fellow workers who sell dumb, sell slow, sell like they are not part of purpose.", "advice": "Could crack down on irresponsible employees more. \"Pizza Friday\" cruel joke."}, {"title": "Good place to get your toes wet", "text": "Pros i don't know what its like now, but when i worked there the people in my department were the best. to this day, im still close with several people i worked with. ability to try out new things Cons upper management, no flexibility in work, minimal PTO so don't ever want a vacation day or get sick, health insurance doesnt kick in for months and when it does its expensive, high turnover rate Advice to Management Pay more attention to your employees. They get too burned out and stop producing. You've obviously spammed the board with positive reviews (you can't go from 1-3 stars for years and then in the same week add in dozens of 5 star reviews.. its kind of obvious) - rather than spamming saying all these great things you do for employees and how you're a great place to work, why not make that true? I remember one day an employee got fired just cause the CEO was having a bad day. And a running joke with the sales team that 50 would start on a monday morning and there was a 10% chance that one would be left at the end of the week. Stick to a plan. As one other reviewer posted, there'd be plenty of times you'd get a task, you'd stay late wanting to get that task completed - and by the time you'd show back up in the morning that whole idea was scrapped and it was something new.", "rating": 3, "pros": "i don't know what its like now, but when i worked there the people in my department were the best. to this day, im still close with several people i worked with. ability to try out new things", "cons": "upper management, no flexibility in work, minimal PTO so don't ever want a vacation day or get sick, health insurance doesnt kick in for months and when it does its expensive, high turnover rate", "advice": "Pay more attention to your employees. They get too burned out and stop producing. You've obviously spammed the board with positive reviews (you can't go from 1-3 stars for years and then in the same week add in dozens of 5 star reviews.. its kind of obvious) - rather than spamming saying all these great things you do for employees and how you're a great place to work, why not make that true? I remember one day an employee got fired just cause the CEO was having a bad day. And a running joke with the sales team that 50 would start on a monday morning and there was a 10% chance that one would be left at the end of the week. Stick to a plan. As one other reviewer posted, there'd be plenty of times you'd get a task, you'd stay late wanting to get that task completed - and by the time you'd show back up in the morning that whole idea was scrapped and it was something new."}, {"title": "The Sad Reality of Working for Comodo!!!", "text": "Pros Most of the people that Join Comodo (in Sales) are inexperienced however they are eager to learn, Most of the lower level employees are the biggest asset this company has The CEO is a Brilliant Engineer Cons 1) Comodo is owned by a Brilliant Engineer, However, his ego is the one driving the Company to the ground 2) For starters, there is no TRAINING whatsoever. New Hires are expected to sit in a cube and sell over the phone without product knowledge, nor any suggested easy to understand selling techniques. That is because NOBODY there has any. 3) Because of the new hires inexperience and eagerness, they are taken advantage off. The reduced commissions, declined payment on closed deals, and lack of support from Sr Sales Members is the deal of the day. 4) Some of the Senior Sales People are constantly conducting \"under the table\" deals, leaving the new hires without a chance to earn money nor make quota. Is all about them making money, they do not care who they hurt in the process.... Talking about KARMA!!!! 5) There are a couple of talented and skilled people still working at Comodo, however they are afraid of loosing their jobs. Therefore, this diamonds in disguise purposely hide at the bottom/ middle of the ladder because they are afraid of becoming the \"CEO's Flavor Of The Month\". This means that the CEO because of his obsessive compulsive nature, will start focusing on you, walking around your desk, asking you questions in front of everyone that only try to challenge your intelligence while comparing it to his own. The result, if the he gets bored or finds out you can outshine him, the chances of getting fired are very high. 6) Comodo also have A LOT of uneducated and incompetent people employed. These individuals are occupying positions that are key cornerstones for the success of the company. If anyone that has any values or education end up working with/or for them, soon ends up learning absolutely nothing because they do not have anything solid to offer. As a matter of fact I think you will forget anything good you had learned in the past 7) Upper Management is blind on one side, with a CEO that has a huge unsupported Ego and by conclusion a lot of Greed. The only person that tries to work on the many issues and try to make it better, is tired of being blocked by the CEO, therefore tired of trying. Advice to Management To the CEO: YOU ARE A BRILLIANT Engineer, However, you are not a good at TALENT MANAGER. Please stick to Engineering and allow other people with real skills, experience and proven records, to handle other areas of the company. LISTEN TO YOUR EMPLOYEES!!!! and read the reviews in this website. If you do read the reviews objectively and analyze the common areas where the company is lacking, and make the necessary changes, only then COMODO will be truly successful. Instead of trying to create a smoke mirror for outside talent to believe that COMODO is an excellent workplace, by leaving fake happy reviews in this site. Eventually and if they get hired, they will too find out of the reality of Comodo, will quit or get fired and then you will have even more negative reviews. Fire all the maggots holding your key positions in the company because you think they are loyal, the reality is they are NOT. And spend some extra dollars on hiring Real, Proven, Track Record, TALENT you will see the return value at the end!!! but most importantly , given them Autonomy and LET THEM WORK.", "rating": 1, "pros": "Most of the people that Join Comodo (in Sales) are inexperienced however they are eager to learn,", "cons": "1) Comodo is owned by a Brilliant Engineer, However, his ego is the one driving the Company to the ground", "advice": "To the CEO: YOU ARE A BRILLIANT Engineer, However, you are not a good at TALENT MANAGER."}, {"title": "Could've, would've, should've", "text": "Pros Good for folks looking to break into the IT industry and can't get hired anywhere else for lack of experience, knowledge, and connections. Cons Extremely poor vision by upper management, treating employees like they are completely replaceable which has resulted in a failure to retain top talent. Advice to Management Stop blaming others for your own shortfalls. 15 months ago you were coming off your best quarter ever....then b/c you failed to respond accordingly to a massive and high profile security breach you fired the talent that got you those results. You've burned through a countless number of employees; at some point you need to look in the mirror.", "rating": 1, "pros": "Good for folks looking to break into the IT industry and can't get hired anywhere else for lack of experience, knowledge, and connections.", "cons": "Extremely poor vision by upper management, treating employees like they are completely replaceable which has resulted in a failure to retain top talent.", "advice": "Stop blaming others for your own shortfalls. 15 months ago you were coming off your best quarter ever....then b/c you failed to respond accordingly to a massive and high profile security breach you fired the talent that got you those results. You've burned through a countless number of employees; at some point you need to look in the mirror."}, {"title": "Comodo employee", "text": "Pros It provide the drive and determination to succeed, and in return Comodo provide the resources and proper environment to ensure such success is achieved. Cons Infrastructure can be little more improved..................", "rating": 5, "pros": "It provide the drive and determination to succeed, and in return Comodo provide the resources and proper environment to ensure such success is achieved.", "cons": "Infrastructure can be little more improved..................", "advice": null}, {"title": "My Dream company - even better than I expected", "text": "Pros Excellent work environment. Tons of flexibility. Loads of suport. Friendly, warm, smart colleagues. Good work. Growing company, lots of great products ! Cons sometimes communication is hard between the offices because of the time difference", "rating": 5, "pros": "Excellent work environment. Tons of flexibility. Loads of suport. Friendly, warm, smart colleagues. Good work. Growing company, lots of great products !", "cons": "sometimes communication is hard between the offices because of the time difference", "advice": null}, {"title": "Great Innovative Products in a Perfect Work Environment", "text": "Pros Comodo employees have a strong bonding amongst collegues and the core values of the company bind them together. Work life is great ! There are lots of products offered by Comodo and being a part of this company and helping it to improve is a greal feeling ! Cons If you do not get your hands on the right opportunity, then you might feel stuck. You should be willing to work and be a part of great organization, then there won't be any problem", "rating": 5, "pros": "Comodo employees have a strong bonding amongst collegues and the core values of the company bind them together. Work life is great ! There are lots of products offered by Comodo and being a part of this company and helping it to improve is a greal feeling !", "cons": "If you do not get your hands on the right opportunity, then you might feel stuck. You should be willing to work and be a part of great organization, then there won't be any problem", "advice": null}, {"title": "Current Employee", "text": "Pros comodo services are available to help customers provide the most efficient time to market possible, making deployment of all solutions as effective as possible. Cons Nothing to say but infrastructure can be better", "rating": 5, "pros": "comodo services are available to help customers provide the most efficient time to market possible, making deployment of all solutions as effective as possible.", "cons": "Nothing to say but infrastructure can be better", "advice": null}, {"title": "The Real Comodo", "text": "Pros You are given ample training on product knowledge Great People Cons Upper Management is poor. What type of company: A) Tells their sales floor they are looking to expand to 200 B) Then, fires most the 60 in one quarters C) Blames the sales team when their is a major breach with a reseller D) REFUSES to bring light on a serious issue in the breach and hopes it goes away E) Fires the VP of Sales after his previous quarter was the best in company history by far F) Brings in a puppet to improve productivity but creates a cancerous atmospher instead G) Tells the sales floor that a reduced commission plan was a great deal H) Makes horrible youtube videos that expect to go viral on how great the company is I) Blames poor sales numbers when dialer works only a quarter of the day J-X) I think you get the point Z) Has the CEO dismiss all reviews because he knows its that bad and if forced to go on Glassdoor to try to make his company look better and say how great his company is. Obviously, according to him, there is nothing wrong with his company since there are no cons. I find that laughable. His approval rating is at a dismal 3% until he has his henchman write reviews all on the same day. Good concerted effort to have the drones do your bidding. Guess what? People can still see all the bad ones on the previous 10 pages. ZZZZZZZZZZZZZZZZZZZZZZZZZZZZ!!!!!!! P.S. I quit by myself because I knew there was no bright future in this place. Advice to Management Stop turning the blind eye to your failures. If you accept and try to fix what's wrong and make the company greater. Just because 20,000 amateur windows users download your zweak free anti-virus doesn't mean that sophisticated users are going to buy your certificates based on that merit alone. Another big piece of advice is to invest in marketing. Pay a few dollars and it will reward you later.", "rating": 1, "pros": "You are given ample training on product knowledge", "cons": "Upper Management is poor. What type of company:", "advice": "Stop turning the blind eye to your failures. If you accept and try to fix what's wrong and make the company greater. Just because 20,000 amateur windows users download your zweak free anti-virus doesn't mean that sophisticated users are going to buy your certificates based on that merit alone. Another big piece of advice is to invest in marketing. Pay a few dollars and it will reward you later."}, {"title": "This is a Joke of a Company to work for. Look at all the feedbacks and join at your own risk!", "text": "Pros There are some good people in this company but they are stuck in the positions they are due to high politics. Cons Employees here are afraid when they are going to get fired. So its not about \"if\" but \"when\"! I guess everyone will have that one company in their lifetime that ranks as the worst company they have worked for. This bites the cake for me folks. These guys took me from a good job I had and made the offer so good that I was thinking I was set for life. Needless to say, I didn't know I was part of an experiment by the CEO for a new office and a 3 month trial. As a person in Marketing, I was suddenly given sales functionality. Was also given some unqualified boss to micro manage me. Suddenly, I had a boss that was afraid for his job and his boss that was also afraid of losing his job. They all got let go soon after I was let go. It was depressing to work here and I was looking for the door after the 1st month. The CEO was just involved with everything and during meetings, he talked as if he could do your job better than you. Now that is motivation, right? A CEO that tells you how he can do every single job in a company better than anyone there. I really don't know where to end on this company. Be very advised and read these reviews posted by people. This CEO is about making some quick money and it is not about the people that work for him. So don't expect much if you end up working for COMODO. It is just a bad company in every way you can think and I was not even in Sales. On a last note, the HR director told me how they had 88% turnover rate from employees. That means if you last a year, you are a rare commodity in this company. Advice to Management Nothing will be changed until they can get a new CEO. Since this is a private company, I doubt that is going to happen.", "rating": 1, "pros": "There are some good people in this company but they are stuck in the positions they are due to high politics.", "cons": "Employees here are afraid when they are going to get fired. So its not about \"if\" but \"when\"! I guess everyone will have that one company in their lifetime that ranks as the worst company they have worked for. This bites the cake for me folks. These guys took me from a good job I had and made the offer so good that I was thinking I was set for life. Needless to say, I didn't know I was part of an experiment by the CEO for a new office and a 3 month trial. As a person in Marketing, I was suddenly given sales functionality. Was also given some unqualified boss to micro manage me. Suddenly, I had a boss that was afraid for his job and his boss that was also afraid of losing his job. They all got let go soon after I was let go.", "advice": "Nothing will be changed until they can get a new CEO. Since this is a private company, I doubt that is going to happen."}, {"title": "REVOLVING DOOR! You can't possibly succeed here!", "text": "Pros Nice location near the mall. Very good product to be sold. Cons Non-existent training, favoritism, totally dishonest managment team. As someone else mentioned, it's amazing how a few \"stars\" can get quality leads that turn into big sales, while others can hardly make quota. Even out the playing field so that others can become stars too! In this economy people are eager to do a good job, but if they're asked to leave without being given a fighting chance you're only hurting yourself. Advice to Management We all know the bottom line is about making money, so provide better training and give qualifed leads to everyone so that your staff can have a fighting chance! If you invest time in people they will be able to give you the return on your investment. But this revolving door policy only ensures that you have a constant barage of people in and out of the business. Does that make any sense at all!!", "rating": 1, "pros": "Nice location near the mall. Very good product to be sold.", "cons": "Non-existent training, favoritism, totally dishonest managment team. As someone else mentioned, it's amazing how a few \"stars\" can get quality leads that turn into big sales, while others can hardly make quota. Even out the playing field so that others can become stars too! In this economy people are eager to do a good job, but if they're asked to leave without being given a fighting chance you're only hurting yourself.", "advice": "We all know the bottom line is about making money, so provide better training and give qualifed leads to everyone so that your staff can have a fighting chance! If you invest time in people they will be able to give you the return on your investment. But this revolving door policy only ensures that you have a constant barage of people in and out of the business. Does that make any sense at all!!"}, {"title": "A Company Fraught with Nepotism, Mismanagement and Outrageously High Turnover", "text": "Pros A great location adjacent to the mall and convenient to all rail transportation. There is potential to add some skills to your resume. It is a desirable, high-growth industry. Cons Doors are constantly closed with back stabbing and unprofessional behavior going on and people looking the other way afraid to say anything for fear of losing their jobs. The motto is shut up and put up or you’re fired. At any given moment they will tap you on the shoulder and tell you to leave within the hour. You have never seen a revolving door like this in your life. Everyone here is actively looking to get out and miserable. You can expect to hear screaming matches berating employees in public on a regular basis, doors slamming, and unprofessional behavior all around. Advice to Management Stop churning through people; it's disgusting especially in this economy. Get rid of the CEO and his brother and replace them with experienced business people who have training in ethics, HR and management. People should care about other people in order to succeed but this CEO doesn’t get it because all he sees are dollar signs for himself. Someone should be watching!", "rating": 1, "pros": "A great location adjacent to the mall and convenient to all rail transportation. There is potential to add some skills to your resume. It is a desirable, high-growth industry.", "cons": "Doors are constantly closed with back stabbing and unprofessional behavior going on and people looking the other way afraid to say anything for fear of losing their jobs. The motto is shut up and put up or you’re fired. At any given moment they will tap you on the shoulder and tell you to leave within the hour. You have never seen a revolving door like this in your life. Everyone here is actively looking to get out and miserable. You can expect to hear screaming matches berating employees in public on a regular basis, doors slamming, and unprofessional behavior all around.", "advice": "Stop churning through people; it's disgusting especially in this economy. Get rid of the CEO and his brother and replace them with experienced business people who have training in ethics, HR and management. People should care about other people in order to succeed but this CEO doesn’t get it because all he sees are dollar signs for himself. Someone should be watching!"}, {"title": "Relief on leaving", "text": "Pros Advancement can be quick if you're liked by senior management. Technically there is the scope to pick up new skills and boost your resume. Location by the Mall is handy, and the links from Manhattan by PATH are great. Cons From the CEO down the place is full of cliques. Step on the wrong toes and you will quickly find yourself removed from the company. Trying to effect any sort of change depends utterly on the buy-in of the CEO, he micromanages everything, and interferes in every last decision. You can tell how well your employment is going by the amount of interest he shows in you. The day he tells you he's not interested is the day you're getting fired! People are fired officially for one reason, but there is always a sub-context. Within the technical side there are certain primadonna individuals who hold incredibly levels of power, and you cross them at your peril. They refuse to share key information, and when you push the issue they run home crying and your find yourself on the edge of being removed. A lot of the senior managers are total yes men and women, they are so weak and pathetic it's hard to do anything, it is a frustrating place to work. The harder you try the less rewards you find on offer. Training is non existent, career development is at the whim of the CEO, you may get a more impressive title, but you won't get any benefits or an increase in salary. The worst thing though are the cliques, you're either in or you're out. If you get into one, and then find yourself out then your days are numbered. I worked that out for myself and was already looking elsewhere when the axe fell on me. The convenient location for the Mall and transport aren't enough to overcome the horrors of working for Comodo. Advice to Management Remove Melih and the bulk of the Executives, and bring in proper management and controls. It could be a good company, but is ruined by endless micromanagement, nasty minded cliques, and a complete lack of direction.", "rating": 1, "pros": "Advancement can be quick if you're liked by senior management. Technically there is the scope to pick up new skills and boost your resume. Location by the Mall is handy, and the links from Manhattan by PATH are great.", "cons": "From the CEO down the place is full of cliques. Step on the wrong toes and you will quickly find yourself removed from the company. Trying to effect any sort of change depends utterly on the buy-in of the CEO, he micromanages everything, and interferes in every last decision. You can tell how well your employment is going by the amount of interest he shows in you. The day he tells you he's not interested is the day you're getting fired! People are fired officially for one reason, but there is always a sub-context. Within the technical side there are certain primadonna individuals who hold incredibly levels of power, and you cross them at your peril. They refuse to share key information, and when you push the issue they run home crying and your find yourself on the edge of being removed. A lot of the senior managers are total yes men and women, they are so weak and pathetic it's hard to do anything, it is a frustrating place to work. The harder you try the less rewards you find on offer. Training is non existent, career development is at the whim of the CEO, you may get a more impressive title, but you won't get any benefits or an increase in salary. The worst thing though are the cliques, you're either in or you're out. If you get into one, and then find yourself out then your days are numbered. I worked that out for myself and was already looking elsewhere when the axe fell on me. The convenient location for the Mall and transport aren't enough to overcome the horrors of working for Comodo.", "advice": "Remove Melih and the bulk of the Executives, and bring in proper management and controls. It could be a good company, but is ruined by endless micromanagement, nasty minded cliques, and a complete lack of direction."}, {"title": "Work for this company at your own risk!", "text": "Pros There are some good people working at the company that wants to do a lot more but are held back. Cons I don't know where to begin to be honest with you! This Company will rank as the worst company I have ever worked for. Once I joined, they quickly changed my role which was already a warning sign. Why would you hire me for one thing and then quickly change my responsibility to where I am not experienced in? Apparently, this is the norm here, which i learned once I started talking to others there. People only last few months there. The CEO is very hard to work with and will pressure you to make revenue from day 1. Unreal expectation and a terrible work atmosphere. Work here are your own rick! Advice to Management Respect people and let people do their jobs without micro managing.", "rating": 1, "pros": "There are some good people working at the company that wants to do a lot more but are held back.", "cons": "I don't know where to begin to be honest with you! This Company will rank as the worst company I have ever worked for. Once I joined, they quickly changed my role which was already a warning sign. Why would you hire me for one thing and then quickly change my responsibility to where I am not experienced in? Apparently, this is the norm here, which i learned once I started talking to others there. People only last few months there. The CEO is very hard to work with and will pressure you to make revenue from day 1. Unreal expectation and a terrible work atmosphere. Work here are your own rick!", "advice": "Respect people and let people do their jobs without micro managing."}, {"title": "A horrible company and terrible place to work", "text": "Pros My commute is great only 15 minutes and the building is nice. Overall, it's nice being in Jersey City and the cafeteria is right downstairs and the mall is right next door., Cons This is one of the worst companies anyone could work for. The CEO is an arrogant obnoxious individual who should be deported back to where he came from. The whole upper management team needs to be replaced. The salary and benefits are awful and the vacation time and sick days are awful as well. Heed my warning; you don't want to work here. Advice to Management Fire the CEO and replace the whole upper management team. Try making products that actually work and stop treating customers like they don't know anything. Write a business plan and stick with it and fire HR as well.", "rating": 1, "pros": "My commute is great only 15 minutes and the building is nice. Overall, it's nice being in Jersey City and the cafeteria is right downstairs and the mall is right next door.,", "cons": "This is one of the worst companies anyone could work for. The CEO is an arrogant obnoxious individual who should be deported back to where he came from. The whole upper management team needs to be replaced. The salary and benefits are awful and the vacation time and sick days are awful as well. Heed my warning; you don't want to work here.", "advice": "Fire the CEO and replace the whole upper management team. Try making products that actually work and stop treating customers like they don't know anything. Write a business plan and stick with it and fire HR as well."}, {"title": "How did I end up here?", "text": "Pros The only reason to work at this place will be the experience that you gain within the world of IT sales. You will learn in a fast paced environment. This job is great for college graduates who really don't know any better to be perfectly honest. Cons Where do we start. First off the salary is very low, commissions are not that good. On average its a 40k/year job if you are able to hit goal. Not much for the work performed. You will be on a dialer all day long so burnout will eventually happen which is fine with management. Once you are fired or quit your leads will be given to the salespeople that your manager likes. This will enable those representatives to hit goal much easier and keep them from being fired. Politics is huge in this place. Furthermore, the attendance system is barbaric. You can thank former reps who abused the policy for that. Now its your cross to bear. Every movement is tracked. There is absolutely no trust in this company between the workers and management. You will be called out for using the bathroom too much so hope you don't get sick in this place. Finally if you are able to survive the training class (90% of your classmates will be gone in less than 2 months) which is taught by one of the most despicable people on the face of the earth you will be rewarded with constant visits from the director who will ask you how close you are to goal. I hope you like numbers because that's all you will ever be in this place. NO MATTER WHAT. If you are looking for security it is best to look elsewhere. If you survive do not get comfortable, this is a dead end job, don't forget it because its too easy to become complacent in this tough job market. Trust me you are worth more than this. Advice to Management Your plan to gain market share will ultimately fail due to poor implementation and constant strategy shifts. You lost already and you know you have to milk the existing customers who don't know any better. Your best representatives will leave when the economy gets better so you better treat them right. NO wonder you moved....nobody in the queens empire wanted to work with you. Keep exploiting the American Worker and eventually you will have to find workers in Bulgaria. (inside joke)", "rating": 1, "pros": "The only reason to work at this place will be the experience that you gain within the world of IT sales. You will learn in a fast paced environment. This job is great for college graduates who really don't know any better to be perfectly honest.", "cons": "Where do we start. First off the salary is very low, commissions are not that good. On average its a 40k/year job if you are able to hit goal. Not much for the work performed. You will be on a dialer all day long so burnout will eventually happen which is fine with management. Once you are fired or quit your leads will be given to the salespeople that your manager likes. This will enable those representatives to hit goal much easier and keep them from being fired. Politics is huge in this place. Furthermore, the attendance system is barbaric. You can thank former reps who abused the policy for that. Now its your cross to bear. Every movement is tracked. There is absolutely no trust in this company between the workers and management. You will be called out for using the bathroom too much so hope you don't get sick in this place. Finally if you are able to survive the training class (90% of your classmates will be gone in less than 2 months) which is taught by one of the most despicable people on the face of the earth you will be rewarded with constant visits from the director who will ask you how close you are to goal. I hope you like numbers because that's all you will ever be in this place. NO MATTER WHAT. If you are looking for security it is best to look elsewhere. If you survive do not get comfortable, this is a dead end job, don't forget it because its too easy to become complacent in this tough job market. Trust me you are worth more than this.", "advice": "Your plan to gain market share will ultimately fail due to poor implementation and constant strategy shifts. You lost already and you know you have to milk the existing customers who don't know any better. Your best representatives will leave when the economy gets better so you better treat them right. NO wonder you moved....nobody in the queens empire wanted to work with you. Keep exploiting the American Worker and eventually you will have to find workers in Bulgaria. (inside joke)"}, {"title": "It is what you make it", "text": "Pros Certainly there are lots of bad reviews here. Some accurate, some exaggerrated, some false. Because Comodo lacks the structure of companies of similar size, there is opportunity to gain very valuable experience if you take the initiative. Also, the potential to acquire a position that may not be a perfect match for your experience is greater here. Comodo is open minded about who they hire mainly because they have to be. overall, if you are savvy enough, comodo can be a great stepping stone in your career and a nice resume builder. Cons salaries are indeed subpar although they were raised. the lack of structure is a hinderance to growth. The CEO is the type of guy who would rather make 2 mil a year doing tings HIS way instead of 10 mil a year doing things the right way. he seemed to be a unrealistic in his expectations (i suspect because he has never really worked for anyone else at a high level). The overall lack of focus or structure unfortunately effects management as well. The entrepreneurial environment requires managers that can prioritize thier personal goals with the necessary functions of thier role - a challenge that is not always met. the turnover is astounding but had improved over my tenure there. Although it is a pretty convenient and \"easy\" place to work, there is no real growth/development plan for employees. Its a job, not a career which is unfortunate because the industry has a tremendous amount of potential. And lastly, when a new potential employer called to verify former employment, HR never returned the calls. Advice to Management trust each other to do your jobs and hold each other accountable. do everything you have to do to go public, answering to stockholders will straighten out the kinks and put the company on track for true long term growth. short term - maybe bring in an organizational consultant. good luck.", "rating": 3, "pros": "Certainly there are lots of bad reviews here. Some accurate, some exaggerrated, some false. Because Comodo lacks the structure of companies of similar size, there is opportunity to gain very valuable experience if you take the initiative. Also, the potential to acquire a position that may not be a perfect match for your experience is greater here. Comodo is open minded about who they hire mainly because they have to be. overall, if you are savvy enough, comodo can be a great stepping stone in your career and a nice resume builder.", "cons": "salaries are indeed subpar although they were raised. the lack of structure is a hinderance to growth. The CEO is the type of guy who would rather make 2 mil a year doing tings HIS way instead of 10 mil a year doing things the right way. he seemed to be a unrealistic in his expectations (i suspect because he has never really worked for anyone else at a high level). The overall lack of focus or structure unfortunately effects management as well. The entrepreneurial environment requires managers that can prioritize thier personal goals with the necessary functions of thier role - a challenge that is not always met. the turnover is astounding but had improved over my tenure there. Although it is a pretty convenient and \"easy\" place to work, there is no real growth/development plan for employees. Its a job, not a career which is unfortunate because the industry has a tremendous amount of potential. And lastly, when a new potential employer called to verify former employment, HR never returned the calls.", "advice": "trust each other to do your jobs and hold each other accountable. do everything you have to do to go public, answering to stockholders will straighten out the kinks and put the company on track for true long term growth. short term - maybe bring in an organizational consultant. good luck."}, {"title": "widespread nepotism and 0 job security", "text": "Pros good location, growing industry, good people Cons unlevel playing field on sales floor, company pretends it is a level playing field however inbound leads and qualified leads were handed to \"cronies\" in hush, hush manner, everyone was judged on same quota but certain \"cronies\" handed qualifed leads, I was gien less than 90 day's before fired for no reason, I don't know why they hire people if they just gonna fire them without a chance. The month I was there everyone busted there but's to win sales contest,.... 2 day's before the end of month manger's cronie was handed big deal, took the order and finished month with 2 sales and took cash contest prize, nobody was told lead was handed to them under the carpet, but everyone knew it... mananging director praised cronie for \" hard work\"... we all wanted to puke... that is standard operating procedure my whole time there, don't let them ruin your spirt and say your not good at sales, winner's where picked and chosen my whole time I was there. period... upper magament so disconnected they pretend favoritism wansn't happening, so sales people pretended to work, hence dead sales floor with no energy and just a few people making calls............ 25 k salary, no 401 k match, $450 month to insure family Advice to Management get some leadership, give people a chance to make it,", "rating": 3, "pros": "good location, growing industry, good people", "cons": "unlevel playing field on sales floor, company pretends it is a level playing field however inbound leads and qualified leads were handed to \"cronies\" in hush, hush manner, everyone was judged on same quota but certain \"cronies\" handed qualifed leads, I was gien less than 90 day's before fired for no reason, I don't know why they hire people if they just gonna fire them without a chance. The month I was there everyone busted there but's to win sales contest,.... 2 day's before the end of month manger's cronie was handed big deal, took the order and finished month with 2 sales and took cash contest prize, nobody was told lead was handed to them under the carpet, but everyone knew it... mananging director praised cronie for \" hard work\"... we all wanted to puke... that is standard operating procedure my whole time there, don't let them ruin your spirt and say your not good at sales, winner's where picked and chosen my whole time I was there. period... upper magament so disconnected they pretend favoritism wansn't happening, so sales people pretended to work, hence dead sales floor with no energy and just a few people making calls............ 25 k salary, no 401 k match, $450 month to insure family", "advice": "get some leadership, give people a chance to make it,"}, {"title": "Don't believe the good news. This is a horrible company.", "text": "Pros The Newport Mall is right next door and makes a great time for lunch breaks. My commute to work only takes 20 minutes since I'm coming from Jersey. Co-workers are great and although we are all looking for new jobs, at least we have each other. Cons The CEO needs to go since he has no clue how to run a company. He is an engineer by trade and not a good one at that. All of the executive management team from the CEO to VP's treat us like garbage and believe we are all incapable. Going to work everyday is like going to prison and we are treated like prisoners. Advice to Management Fire the CEO and the entire executive management team. Try to make products that actually do work and you won't hear all the complaints we get on a daily basis. All in all a horrible culture and a terrible place to work.", "rating": 1, "pros": "The Newport Mall is right next door and makes a great time for lunch breaks. My commute to work only takes 20 minutes since I'm coming from Jersey. Co-workers are great and although we are all looking for new jobs, at least we have each other.", "cons": "The CEO needs to go since he has no clue how to run a company. He is an engineer by trade and not a good one at that. All of the executive management team from the CEO to VP's treat us like garbage and believe we are all incapable. Going to work everyday is like going to prison and we are treated like prisoners.", "advice": "Fire the CEO and the entire executive management team. Try to make products that actually do work and you won't hear all the complaints we get on a daily basis. All in all a horrible culture and a terrible place to work."}, {"title": "A horrible company and a horrible Sr. Management Team", "text": "Pros The light rail is great for getting to work. The building is nice as well as the convenience of the mall being next door and the cafeteria on the ground floor. My co-workers are supportive and knowledgeable and friendly. We are all looking for new jobs since no one likes working here. Cons From the CEO to Senior Management, we are all treated awfully. The benefits are awful as well as the pay. It's such a horrible place to work that the turnover rate must be in the high 90's. The CEO is a stuck up person who doesn't belong running a company and although there is new HR, they don't or can't make things better. We are all treated like inferior workers and although we try our best and know our stuff it isn't good enough. Advice to Management Sell the company or fire the CEO and the whole upper management team. Make products that people like and that actually work and things might get better. Too bad no one listens and there are no business plans in place.", "rating": 1, "pros": "The light rail is great for getting to work. The building is nice as well as the convenience of the mall being next door and the cafeteria on the ground floor. My co-workers are supportive and knowledgeable and friendly. We are all looking for new jobs since no one likes working here.", "cons": "From the CEO to Senior Management, we are all treated awfully. The benefits are awful as well as the pay. It's such a horrible place to work that the turnover rate must be in the high 90's. The CEO is a stuck up person who doesn't belong running a company and although there is new HR, they don't or can't make things better. We are all treated like inferior workers and although we try our best and know our stuff it isn't good enough.", "advice": "Sell the company or fire the CEO and the whole upper management team. Make products that people like and that actually work and things might get better. Too bad no one listens and there are no business plans in place."}, {"title": "A Place no one wants to work at", "text": "Pros The mall being next door is great for lunchtime and my commute with the car isn't bad at all. Overall, the office is somewhat decent and we have view of Manhattan and the water. My co-workers are great and we all get along. Cons This is one of the most corrupt indecent companies I have ever worked for. All my co-workers are looking for new jobs and everyone from the CEO to Upper Management has no clue what they are doing. Morale is the lowest you will find at any company and firings take place on a daily basis. Advice to Management Sell the company or just file for bankruptcy which you are near. There are no business plans and everyone who is lower than upper management wants to leave. They hire good people who know what they are doing but due to the culture of the company they are not allowed to.", "rating": 1, "pros": "The mall being next door is great for lunchtime and my commute with the car isn't bad at all. Overall, the office is somewhat decent and we have view of Manhattan and the water. My co-workers are great and we all get along.", "cons": "This is one of the most corrupt indecent companies I have ever worked for. All my co-workers are looking for new jobs and everyone from the CEO to Upper Management has no clue what they are doing. Morale is the lowest you will find at any company and firings take place on a daily basis.", "advice": "Sell the company or just file for bankruptcy which you are near. There are no business plans and everyone who is lower than upper management wants to leave. They hire good people who know what they are doing but due to the culture of the company they are not allowed to."}, {"title": "A Terrible Company", "text": "Pros The commute is good from all over NJ and from NYC via the Path train. The building is nice right on the waterfront and the mall being next door is great. Co-workers although miserable and looking for new jobs are there for moral support. Cons The whole upper management team must go. The CEO has no clue how to run a company and it shows by the people he hires. The benefits are awful and the morale of everyone is terrible. They fire people on a daily basis and enjoy doing so. The CEO is an engineer by trade and he should stick to that. If you polled everyone in the company, they would say he is a stuck up arrogant person. Advice to Management Sell the company or replace the CEO. Comodo is a horrible place to work and senior management has no clue what is going on. There are no business plans which need to get done and we are all treated like babies. Soon people will see if they haven't seen already that the products don't work.", "rating": 1, "pros": "The commute is good from all over NJ and from NYC via the Path train. The building is nice right on the waterfront and the mall being next door is great. Co-workers although miserable and looking for new jobs are there for moral support.", "cons": "The whole upper management team must go. The CEO has no clue how to run a company and it shows by the people he hires. The benefits are awful and the morale of everyone is terrible. They fire people on a daily basis and enjoy doing so. The CEO is an engineer by trade and he should stick to that. If you polled everyone in the company, they would say he is a stuck up arrogant person.", "advice": "Sell the company or replace the CEO. Comodo is a horrible place to work and senior management has no clue what is going on. There are no business plans which need to get done and we are all treated like babies. Soon people will see if they haven't seen already that the products don't work."}, {"title": "If you are a masochist you will come to work for Comodo, a horrible company to work for.", "text": "Pros it's next to the Jersey City Mall. You can see the New York City skyline from here. Easy to access from public transportation. Great place to work for if you are in need of inducing a heart attack, stroke or at the very least an ulcer!! Cons You are treated like an indignant slave. You have no rights. The commission structure is horrible. (Management touts it as amazing). You cannot move from your phone or the dialer all day - or trust me - you'll pay for it. HR constantly uses fear tactics. There is ABSOLUTELY NO JOB STABILITY HERE. You are indespensible and can be let go ANYTIME and management let's you know that - daily. The benefit package is horrendous. Management is constantly looming over you - they look scared - and they make you fear for your job every moment. Never believe that if you sell your job is safe - IT'S NOT. Making quota means NOTHING. There is constant turn-over. People get fired here DAILY. Advice to Management I wonder what kind of person are you when you make incompetent decisions on hiring the type of Management you have??? Do you honestly REALLY CARE about the future of your company? Are you getting ready to sell and are just looking to gain market share without caring about your employees futures? DO YOU CARE?", "rating": 1, "pros": "it's next to the Jersey City Mall. You can see the New York City skyline from here. Easy to access from public transportation. Great place to work for if you are in need of inducing a heart attack, stroke or at the very least an ulcer!!", "cons": "You are treated like an indignant slave. You have no rights. The commission structure is horrible. (Management touts it as amazing). You cannot move from your phone or the dialer all day - or trust me - you'll pay for it. HR constantly uses fear tactics. There is ABSOLUTELY NO JOB STABILITY HERE. You are indespensible and can be let go ANYTIME and management let's you know that - daily. The benefit package is horrendous. Management is constantly looming over you - they look scared - and they make you fear for your job every moment. Never believe that if you sell your job is safe - IT'S NOT. Making quota means NOTHING. There is constant turn-over. People get fired here DAILY.", "advice": "I wonder what kind of person are you when you make incompetent decisions on hiring the type of Management you have??? Do you honestly REALLY CARE about the future of your company? Are you getting ready to sell and are just looking to gain market share without caring about your employees futures? DO YOU CARE?"}, {"title": "Worst Company in the world to work for", "text": "Pros The only good thing is there are some nice people there but not in senior management. There are no other pros to speak of unless there are no other jobs available to you. Cons The cheapest company around. Extremely uncaring leadership and they treat employees like resources instead of people. They are too indecisive of what to do and the CEO has the worst ego anyone has ever seen. He wants to manage every aspect of the company and constantly changes his mind. The morale there stinks everyone wonders when they will be fired. Advice to Management Sell the company or replace senior management with competent people. Get a real CEO with practical business experience and hiring new fiance and HR.", "rating": 1, "pros": "The only good thing is there are some nice people there but not in senior management. There are no other pros to speak of unless there are no other jobs available to you.", "cons": "The cheapest company around. Extremely uncaring leadership and they treat employees like resources instead of people. They are too indecisive of what to do and the CEO has the worst ego anyone has ever seen. He wants to manage every aspect of the company and constantly changes his mind. The morale there stinks everyone wonders when they will be fired.", "advice": "Sell the company or replace senior management with competent people. Get a real CEO with practical business experience and hiring new fiance and HR."}, {"title": "Worst and Horrible Company", "text": "Pros The office is right next door to the mall which isn't bad. My commute is decent coming from Jersey and the waterfront is right nearby. My co-workers are there for moral support and we work together in this horrible company. Cons This is one of the worst companies I have ever worked for. The CEO is an arrogant person who has no morals and likes to berate people. HR is horrible also as well as finance. They fire their top people and hire recent college graduates for next to nothing in pay. The benefits as well as the pay is awful. Advice to Management Sell the company or get rid of the CEO, Finance and HR. The products do not work and customer complaints keep coming in. Try for some innovation and then get acquired.", "rating": 1, "pros": "The office is right next door to the mall which isn't bad. My commute is decent coming from Jersey and the waterfront is right nearby. My co-workers are there for moral support and we work together in this horrible company.", "cons": "This is one of the worst companies I have ever worked for. The CEO is an arrogant person who has no morals and likes to berate people. HR is horrible also as well as finance. They fire their top people and hire recent college graduates for next to nothing in pay. The benefits as well as the pay is awful.", "advice": "Sell the company or get rid of the CEO, Finance and HR. The products do not work and customer complaints keep coming in. Try for some innovation and then get acquired."}, {"title": "Worst company in the market to work for", "text": "Pros My commute isn't bad just take the light rail. All in all, my co-workers are very supportive even though we are all looking for new positions outside this horrible company. The building is nice and the cafeteria and the mall next door is great. Cons Sell the company and get rid of the CEO, HR and finance. We are all treated horribly and every minute someone is getting let go of. All of our moral is terrible and we hate coming to work. The pay is awful and the benefits and the vacation policy is one of the worst in the industry. Advice to Management Get rid of the CEO, HR and Finance and then sell the company. Stop treating your employees so awful and since the products don't work dump them. It is only a matter of time before your company folds. Overall, no one should interview or even consider this company for employment.", "rating": 1, "pros": "My commute isn't bad just take the light rail. All in all, my co-workers are very supportive even though we are all looking for new positions outside this horrible company. The building is nice and the cafeteria and the mall next door is great.", "cons": "Sell the company and get rid of the CEO, HR and finance. We are all treated horribly and every minute someone is getting let go of. All of our moral is terrible and we hate coming to work. The pay is awful and the benefits and the vacation policy is one of the worst in the industry.", "advice": "Get rid of the CEO, HR and Finance and then sell the company. Stop treating your employees so awful and since the products don't work dump them. It is only a matter of time before your company folds. Overall, no one should interview or even consider this company for employment."}, {"title": "Worst Company anyone could work for", "text": "Pros The mall is next door which makes for a great lunch time break. My commute is great just hopping on the light rail. The building is nice and the office is decent. My co-workers are there for moral support since we all need it. Additionally, the view from our floor is great. Cons The management team including the CEO needs to sell the company or get out. All employees are treated horribly and everyone is afraid of losing their job at any minute. HR treats us like babies and they should be thrown out as well. This is one of the worst companies I have ever worked for in my life. Everyone is looking for a new position outside the company. All in all, a terrible management team and a worst CEO anyone could work for, Advice to Management Sell the company since the products don't work and either write a business plan and let the CEO, Finance and HR leave the company. Verisign is number one and they will continue to take customers away.", "rating": 1, "pros": "The mall is next door which makes for a great lunch time break. My commute is great just hopping on the light rail. The building is nice and the office is decent. My co-workers are there for moral support since we all need it. Additionally, the view from our floor is great.", "cons": "The management team including the CEO needs to sell the company or get out. All employees are treated horribly and everyone is afraid of losing their job at any minute. HR treats us like babies and they should be thrown out as well. This is one of the worst companies I have ever worked for in my life. Everyone is looking for a new position outside the company. All in all, a terrible management team and a worst CEO anyone could work for,", "advice": "Sell the company since the products don't work and either write a business plan and let the CEO, Finance and HR leave the company. Verisign is number one and they will continue to take customers away."}, {"title": "A horrible place to work and a horrible management team", "text": "Pros The commute was great for me and the mall for lunch was right next door. My co-workers were great and the building is nice. Cons The whole management team should be replaced. The CEO is clueless on how to run a business. Additionally, HR and finance which basically is the same department needs to get thrown out of the company. There is so much discrimination there and the company is run like a prison camp. The vacation days are awful and their badge system of getting in and out of the office is like a prison. No one in their right mind should want to work here. Advice to Management Sell the company since there is no business plan and the products don't work. Replace the CEO, HR and Finance. Learn to treat your employees with respect and not like rats. Overall the company should fold.", "rating": 1, "pros": "The commute was great for me and the mall for lunch was right next door. My co-workers were great and the building is nice.", "cons": "The whole management team should be replaced. The CEO is clueless on how to run a business. Additionally, HR and finance which basically is the same department needs to get thrown out of the company. There is so much discrimination there and the company is run like a prison camp. The vacation days are awful and their badge system of getting in and out of the office is like a prison. No one in their right mind should want to work here.", "advice": "Sell the company since there is no business plan and the products don't work. Replace the CEO, HR and Finance. Learn to treat your employees with respect and not like rats. Overall the company should fold."}, {"title": "One of the worst companies I have ever worked for in my life", "text": "Pros The commute to work is only 15 minutes and the mall is right next door in the same building. Other than that, the office is somewhat decent and my coworkers are great. Cons This is a horrible company to work for. The CEO is clueless and HR is unprofessional and treats employees horribly. Everyone with a C title should be let go from the company. I'm also going to include the VP of Finance and HR. The vacation policy as well as sick policy is awful and the benefits are subpar. I can't think of anything else to say but the company should be sold or fold. The products don't work and all the time we get customer complaints. Advice to Management Sell the company or just let it fold. Let go of the CEO, the VP of HR/Finance and all the other people who don't belong there. Stop treating your employees like they are slaves and learn how to run a business. Half the time I'm telling my customers to try another company.", "rating": 1, "pros": "The commute to work is only 15 minutes and the mall is right next door in the same building. Other than that, the office is somewhat decent and my coworkers are great.", "cons": "This is a horrible company to work for. The CEO is clueless and HR is unprofessional and treats employees horribly. Everyone with a C title should be let go from the company. I'm also going to include the VP of Finance and HR. The vacation policy as well as sick policy is awful and the benefits are subpar. I can't think of anything else to say but the company should be sold or fold. The products don't work and all the time we get customer complaints.", "advice": "Sell the company or just let it fold. Let go of the CEO, the VP of HR/Finance and all the other people who don't belong there. Stop treating your employees like they are slaves and learn how to run a business. Half the time I'm telling my customers to try another company."}, {"title": "Horrible Company to work for", "text": "Pros My co-workers are there for moral support and together we stick together. The commute is good and the building is nice. Other than that, the mall is right next door. Cons This is the worst company I have ever worked for. Everyone from the CEO to finance to HR are incapable of running a company. There is no opportunity for advancement the pay is horrible and the benefits are awful. Their vacation policy has to rank as the lowest in the industry and we are all treated horribly. The CEO is in his own world and doesn't see reality. The products don't work and trying to market them doesn't help. Advice to Management Sell the company or just go out of business. Replace the CEO, HR and Finance and have some sort of a business plan. Simply put you will get what you deserve eventually.", "rating": 1, "pros": "My co-workers are there for moral support and together we stick together. The commute is good and the building is nice. Other than that, the mall is right next door.", "cons": "This is the worst company I have ever worked for. Everyone from the CEO to finance to HR are incapable of running a company. There is no opportunity for advancement the pay is horrible and the benefits are awful. Their vacation policy has to rank as the lowest in the industry and we are all treated horribly. The CEO is in his own world and doesn't see reality. The products don't work and trying to market them doesn't help.", "advice": "Sell the company or just go out of business. Replace the CEO, HR and Finance and have some sort of a business plan. Simply put you will get what you deserve eventually."}, {"title": "Run like Rats from this place", "text": "Pros My commute is okay and the building is nice. The office is somewhat decent and my coworkers are great people. Cons The management needs to go. I have no clue how they are staying in business. The CEO lives in a different world and HR could care less about anybody. It's time to sell the company or replace the CEO. Advice to Management Sell the company and actually make products that work. The whole upper management team needs to be replaced and thrown out. They have no business sense or know how to treat employees. Everyone I know here is looking for a new job.", "rating": 1, "pros": "My commute is okay and the building is nice. The office is somewhat decent and my coworkers are great people.", "cons": "The management needs to go. I have no clue how they are staying in business. The CEO lives in a different world and HR could care less about anybody. It's time to sell the company or replace the CEO.", "advice": "Sell the company and actually make products that work. The whole upper management team needs to be replaced and thrown out. They have no business sense or know how to treat employees. Everyone I know here is looking for a new job."}]