[{"title": "Most interesting IT Job with the best Team in Berlin", "text": "Pros - great Team - great company - great challenges - ability to have a huge impact Cons I can´t think of any Advice to Management keep the good work up!!", "rating": 5, "pros": "- great Team", "cons": "I can´t think of any", "advice": "keep the good work up!!"}, {"title": "Great place to work, great team, great product", "text": "Pros - responsabilities - challenges - great team - great work condition: drinks, coffee, weekly team meals! Cons - so efficient that it could be more 'human and funny' sometimes Advice to Management Continue like this and create a little bit more communication between Devs and Ops", "rating": 5, "pros": "- responsabilities", "cons": "- so efficient that it could be more 'human and funny' sometimes", "advice": "Continue like this and create a little bit more communication between Devs and Ops"}, {"title": "Super junges, motiviertes Team!", "text": "Pros - Gute, offene Arbeitsatmosphäre - Jeder im Team ist kritikfähig - Unternehmen entwickelt sich jeden Monat gut weiter Cons - Teilweise etwas lange Arbeitszeiten Advice to Management - Weiter so!", "rating": 5, "pros": "- Gute, offene Arbeitsatmosphäre", "cons": "- Teilweise etwas lange Arbeitszeiten", "advice": "- Weiter so!"}, {"title": "#1 in B2B Travel", "text": "Pros - Unterstützen starkes Builders Mindest - Flache Hierachie Cons - Office hat etwas wenig Platz inzwischen", "rating": 5, "pros": "- Unterstützen starkes Builders Mindest", "cons": "- Office hat etwas wenig Platz inzwischen", "advice": null}, {"title": "Wahnsinnig engagiertes Gründer-Team", "text": "Pros - sehr, sehr flache Hierarchien - volle transparenz - extrem kluges, aber auch nettes team - after-work bier ab 18 uhr - büro ist extrem zentral direkt am rosa-luxemburg platz Cons - team ist wenn es drauf ankommt schon sehr viel am arbeiten Advice to Management - weiter so, wäre gerne dabei geblieben", "rating": 5, "pros": "- sehr, sehr flache Hierarchien", "cons": "- team ist wenn es drauf ankommt schon sehr viel am arbeiten", "advice": "- weiter so, wäre gerne dabei geblieben"}, {"title": "Full transparency, high responsibility and lots of fun", "text": "Pros Incredible start-up environment! If you are looking for something fast paced - where an idea will be put into action by the end of day, then Comtravo would be the perfect fit for you. The management recognises talent and allows self development in a direction desired by the employee. International atmosphere, great colleagues, lots of benefits and team buildings. You will laugh a lot and have a great time! Cons Not much to say here! Advice to Management Keep it up!", "rating": 5, "pros": "Incredible start-up environment!", "cons": "Not much to say here!", "advice": "Keep it up!"}]