[{"title": "Opportunity to redefine an entire industry", "text": "Pros - Leadership team (Solid background with prior history of entrepreneurial success) - Opportunity (The small business insurance space is ripe for disruption and we are one of the first players) - People (Hardworking yet fun international team) - VCs ( Funded by some of the top VCs in the country) Cons - Not for everyone. You need to be comfortable working in a super fast paced environment, which means taking on significant ownership, making quick decisions and executing fast and often.", "rating": 5, "pros": "- Leadership team (Solid background with prior history of entrepreneurial success)", "cons": "- Not for everyone. You need to be comfortable working in a super fast paced environment, which means taking on significant ownership, making quick decisions and executing fast and often.", "advice": null}, {"title": "Product Manager", "text": "Pros CoverWallet is a growing startup with plenty of opportunities for it's employees. I would say these opportunities to grow are mainly due to three factors: - Sufficient funding and solid metrics that suggest a promising future - Yet to be disrupted industry. Insurance for SMEs is a bit behind the FinTech wave making CoverWallet an industry first - Above points 1 and 2. Top people. Both from a professional point of view (just look at the LinkedIn profiles of employees) and personal that generates a geat ambiance. Bonus: Great office with lots of perks and salmon bagels on Friday's :) Cons It's demanding. Not from an hours point of view (work balance is very good) but you always have to perform very well.", "rating": 5, "pros": "CoverWallet is a growing startup with plenty of opportunities for it's employees. I would say these opportunities to grow are mainly due to three factors:", "cons": "It's demanding. Not from an hours point of view (work balance is very good) but you always have to perform very well.", "advice": null}, {"title": "A great opportunity to make a difference", "text": "Pros The company is taking an innovative approach to changing the way small businesses understand, manage, and buy insurance. It's a fun environment and you can really make a difference. Cons It's a start up so you have commit yourself to helping make it a success.", "rating": 5, "pros": "The company is taking an innovative approach to changing the way small businesses understand, manage, and buy insurance. It's a fun environment and you can really make a difference.", "cons": "It's a start up so you have commit yourself to helping make it a success.", "advice": null}, {"title": "Coolest startup to work for", "text": "Pros Excellent team and products, growth momentum on insurance market. Working with cutting-edge web technologies. International, based both in USA and Europe. Cons Not interesting for those who do not like fun at work!", "rating": 5, "pros": "Excellent team and products, growth momentum on insurance market. Working with cutting-edge web technologies. International, based both in USA and Europe.", "cons": "Not interesting for those who do not like fun at work!", "advice": null}]