[{"title": "Point of Sale cashier", "text": "Pros There is a progressive, upbeat vibe in the store. This is at the direction of the store manager. There are ongoing opportunities to earn moral boosters, like jean passes. There are honest pushes for customer survey completion and new credit enrollment yet no penalty for lack thereof. They work with any schedule you are willing to work. Everyone is welcome and even though many employees are challenging, training to their deficiencies is done with kindness and respect! Cons The pay is not progressive. It does not seem to increase with merit based upon regular, timely attendance, or high performance. Advice to Management You really are getting more than what you are paying for from most of the workers at our South Sarasota store. It would be nice for you to demonstrate it with a bonus!", "rating": 5, "pros": "There is a progressive, upbeat vibe in the store. This is at the direction of the store manager. There are ongoing opportunities to earn moral boosters, like jean passes. There are honest pushes for customer survey completion and new credit enrollment yet no penalty for lack thereof. They work with any schedule you are willing to work. Everyone is welcome and even though many employees are challenging, training to their deficiencies is done with kindness and respect!", "cons": "The pay is not progressive. It does not seem to increase with merit based upon regular, timely attendance, or high performance.", "advice": "You really are getting more than what you are paying for from most of the workers at our South Sarasota store. It would be nice for you to demonstrate it with a bonus!"}, {"title": "STAY FAR AWAWY", "text": "Pros Amount of time off and leave. Cons Salary, management, review process, work environment, culture, training...... Advice to Management Retire and hire younger more business driven upper management. Its overdue.", "rating": 1, "pros": "Amount of time off and leave.", "cons": "Salary, management, review process, work environment, culture, training......", "advice": "Retire and hire younger more business driven upper management. Its overdue."}, {"title": "STD Claim Manager", "text": "Pros Free parking on premise. Get to wear jeans. Cons Customers complaining to you all day. Little pay increases. Not much opportunity for advancement.", "rating": 3, "pros": "Free parking on premise. Get to wear jeans.", "cons": "Customers complaining to you all day. Little pay increases. Not much opportunity for advancement.", "advice": null}, {"title": "Trainee Review", "text": "Pros There is a chance to grow Cons When in training you are not able to earn Commission.", "rating": 3, "pros": "There is a chance to grow", "cons": "When in training you are not able to earn Commission.", "advice": null}, {"title": "Self - employed", "text": "Pros Updates daily nice to receive by email Cons Contract when up u need to find another job Advice to Management Be more proactive", "rating": 5, "pros": "Updates daily nice to receive by email", "cons": "Contract when up u need to find another job", "advice": "Be more proactive"}, {"title": "Compassionate Corporate Culture", "text": "Pros What I like most is the culture of compassion nurtured throughout the company. That culture starts at the top and ripples throughout. Cons None that I can think of. Advice to Management Continue to recruit and educate students on college campuses because our nation will be dire need of more care for the aging population.", "rating": 5, "pros": "What I like most is the culture of compassion nurtured throughout the company. That culture starts at the top and ripples throughout.", "cons": "None that I can think of.", "advice": "Continue to recruit and educate students on college campuses because our nation will be dire need of more care for the aging population."}, {"title": "Started part time went full time", "text": "Pros The people that I work with are fantastic. The stress level is low and the management team is willing to work with you. Cons Just wish the job paid better", "rating": 5, "pros": "The people that I work with are fantastic. The stress level is low and the management team is willing to work with you.", "cons": "Just wish the job paid better", "advice": null}, {"title": "Awesome", "text": "Pros Great company to work for Cons Rotating shifts is the only draw back", "rating": 5, "pros": "Great company to work for", "cons": "Rotating shifts is the only draw back", "advice": null}, {"title": "Certified opt Tech", "text": "Pros Not retail and short Saturday no Sunday none Cons No benefits including paid time off", "rating": 1, "pros": "Not retail and short Saturday no Sunday none", "cons": "No benefits including paid time off", "advice": null}, {"title": "32 Hours a week", "text": "Pros Yes. It is an okay job very simple get in do your job and go home and repeat it all over again. Cons Management is always changing how they want things done with back stock and where it is stored in the back they need to figure out a better solution to back stock. Advice to Management Management is good they have meetings every night to discuss how much shipment with grocery and gm side was received and any spefic details about features or stocking wise.", "rating": 5, "pros": "Yes. It is an okay job very simple get in do your job and go home and repeat it all over again.", "cons": "Management is always changing how they want things done with back stock and where it is stored in the back they need to figure out a better solution to back stock.", "advice": "Management is good they have meetings every night to discuss how much shipment with grocery and gm side was received and any spefic details about features or stocking wise."}, {"title": "Marketing consultant", "text": "Pros Flexibility, pay, training, and benefits Cons No direction, dying print media, high stress", "rating": 3, "pros": "Flexibility, pay, training, and benefits", "cons": "No direction, dying print media, high stress", "advice": null}, {"title": "Teaching assistant", "text": "Pros Flexible works schedule can make your life easier Cons salary is very low compare to your work", "rating": 5, "pros": "Flexible works schedule can make your life easier", "cons": "salary is very low compare to your work", "advice": null}, {"title": "Current Checks", "text": "Pros Average employer in an assembly line work area. The supervisors, team leads, and fellow workers seem to be friendly and respectful to others. Cons It seems employees work Long hours and receive low pay and they expect their employees to work over time at the last minute. If an employee is injured they find a way to fire them. Advice to Management Listen to employee issues, give them a much deserved pay raise. Without employees you would not have a company. They work hard and go the extra mile.", "rating": 1, "pros": "Average employer in an assembly line work area. The supervisors, team leads, and fellow workers seem to be friendly and respectful to others.", "cons": "It seems employees work Long hours and receive low pay and they expect their employees to work over time at the last minute. If an employee is injured they find a way to fire them.", "advice": "Listen to employee issues, give them a much deserved pay raise. Without employees you would not have a company. They work hard and go the extra mile."}, {"title": "Good", "text": "Pros it is good and high salary Cons bad work life balance", "rating": 5, "pros": "it is good and high salary", "cons": "bad work life balance", "advice": null}, {"title": "data entry customer services", "text": "Pros the best reason ofwork to current is good Cons the downsides of working at current is good n easy for me Advice to Management no", "rating": 5, "pros": "the best reason ofwork to current is good", "cons": "the downsides of working at current is good n easy for me", "advice": "no"}, {"title": "Good exposure. Can explore new things.", "text": "Pros Good exposure. Can explore new things. Cons Nothing much to say. Everything is good Advice to Management Need time", "rating": 3, "pros": "Good exposure. Can explore new things.", "cons": "Nothing much to say. Everything is good", "advice": "Need time"}, {"title": "this is a nice company", "text": "Pros it provide a good plateform for growth Cons the sallary is not satisfactory", "rating": 3, "pros": "it provide a good plateform for growth", "cons": "the sallary is not satisfactory", "advice": null}, {"title": "overview experience", "text": "Pros Excellent place to work and lot of support we can expect from Mercuryminds Cons till date no downsides I have faced Advice to Management not necessary, as we getting our expectation fulfilled by the organization", "rating": 5, "pros": "Excellent place to work and lot of support we can expect from Mercuryminds", "cons": "till date no downsides I have faced", "advice": "not necessary, as we getting our expectation fulfilled by the organization"}, {"title": "good", "text": "Pros pay, people in the business Cons manager, employee practices not good", "rating": 3, "pros": "pay, people in the business", "cons": "manager, employee practices not good", "advice": null}, {"title": "good environment ro work", "text": "Pros friendly staff where u can ask any problems related to your work. Cons bad management and there is no growth in terms of money as well as in terms of kowledge", "rating": 3, "pros": "friendly staff where u can ask any problems related to your work.", "cons": "bad management and there is no growth in terms of money as well as in terms of kowledge", "advice": null}, {"title": "Good", "text": "Pros Salary, Work Environment, Good Projects, Professional Growth Cons Timings, Sunday is also working, I'm satisfied with my work so I don't find any cons more. Advice to Management Good", "rating": 3, "pros": "Salary, Work Environment, Good Projects, Professional Growth", "cons": "Timings, Sunday is also working, I'm satisfied with my work so I don't find any cons more.", "advice": "Good"}, {"title": "great company", "text": "Pros Employee friendly, open culture, great HR Cons bit of politics , have to work beyond 8 hours", "rating": 5, "pros": "Employee friendly, open culture, great HR", "cons": "bit of politics , have to work beyond 8 hours", "advice": null}, {"title": "Good", "text": "Pros Good job but more stress Cons They wont see talent", "rating": 3, "pros": "Good job but more stress", "cons": "They wont see talent", "advice": null}]