[{"title": "Fast growing FinTech doing amazing things with technology", "text": "Pros Fast pace, friendly, fun-natured environment. Ambitious, smart and collaborative people. Cons It's a place to get things done and delivering value to users, not wait until the next steering committee meeting. If that sounds like an environment for you then great, but it's not for everyone.", "rating": 5, "pros": "Fast pace, friendly, fun-natured environment. Ambitious, smart and collaborative people.", "cons": "It's a place to get things done and delivering value to users, not wait until the next steering committee meeting. If that sounds like an environment for you then great, but it's not for everyone.", "advice": null}, {"title": "Great Company with an amazing product!", "text": "Pros - Exciting and challenging product and roadmap  - Plenty of development opportunities as part of the company's growth  - Smart, ambitious and fun people to work with Cons - Gotta to love the high paced startup environment!", "rating": 5, "pros": "- Exciting and challenging product and roadmap", "cons": "- Gotta to love the high paced startup environment!", "advice": null}, {"title": "Great project, great people, and an exciting place to be!", "text": "Pros * Really great project to be involved in - everyone from Engineering, to Operations, to Marketing - is pulling together in the same direction to genuinely shake up the finance industry for the better. * Hard work, but amazing amounts of room to grow - there’s a lot of flexibility to showcase what you do and what you like doing. There’s also a lot of company-paid-for opportunity to read, attend workshops, and chat with experts in the field. * Great team! Everyone is really friendly and it’s *generally* a flat hierarchy - you can talk to anyone and they’ll be happy to discuss ideas and what's going on more broadly. Cons * Moving fast all the time - I personally enjoy this and enjoy the opportunity to work quickly, dip into new projects, and learn new things. It has the potential to be a bit intense.", "rating": 5, "pros": "* Really great project to be involved in - everyone from Engineering, to Operations, to Marketing - is pulling together in the same direction to genuinely shake up the finance industry for the better.", "cons": "* Moving fast all the time - I personally enjoy this and enjoy the opportunity to work quickly, dip into new projects, and learn new things. It has the potential to be a bit intense.", "advice": null}, {"title": "Great team, fun culture, big ambitions", "text": "Pros - Refreshing to move here from a big company - there are no politics. Just a friendly team who support each other - The culture is hard to beat. From nerf guns and ping pong tournaments to its open-door policy in terms of suggestions for new benefits to offer staff - The job opportunity is rare. The company has big ambitions to disrupt the banking industry - not really surprising they're getting a lot of attention and big-name investors - Very strong 'learning' emphasis - everyone challenges each other to learn more and share ideas. And there is budget to back it up, if you want to go on courses etc - Decent set of benefits, especially for a startup Cons This is not a job for the faint-hearted. The company is moving fast, building something people haven't seen before, and disrupting an entire sector - that's exciting, but not easy. That means standards are high and the quality of team members is high - you're expected to fail often, learn fast, and seek constant development. That's not something that comes naturally to everyone - so you need to think about whether that sounds like you, before taking the plunge. Advice to Management As the company grows, make sure you hire more senior staff to spread the load - so that junior employees still get personal time with the CEO and directors. Not a problem now, but will be a challenge down the line.", "rating": 5, "pros": "- Refreshing to move here from a big company - there are no politics. Just a friendly team who support each other", "cons": "This is not a job for the faint-hearted. The company is moving fast, building something people haven't seen before, and disrupting an entire sector - that's exciting, but not easy.", "advice": "As the company grows, make sure you hire more senior staff to spread the load - so that junior employees still get personal time with the CEO and directors. Not a problem now, but will be a challenge down the line."}, {"title": "Fantastic company with potential!", "text": "Pros - Super fast paced environment - Great team of ambitious people - Amazing opportunity to learn lots and fast - Generous wellbeing allowance Cons Sometimes the pressure and long hours get to you (but it's temporary because the company is growing very quickly) Advice to Management Pay attention to your employees' well-being - giving them a monthly allowance is not all it takes!", "rating": 5, "pros": "- Super fast paced environment", "cons": "Sometimes the pressure and long hours get to you (but it's temporary because the company is growing very quickly)", "advice": "Pay attention to your employees' well-being - giving them a monthly allowance is not all it takes!"}, {"title": "Imagine (yourself at) Curve", "text": "Pros There is a massive movement around FinTech these days, and if you want to be part of that movement, there is no better company to join than Curve. Our product aims to reduce the fragmentation and converge all your money in one single place; it’s super complicated and ambitious. I’ve worked for other companies where the product’s complexity was not even near Curve’s. And therefore, I am being challenged and learning a lot every day since I joined Curve. We are still a small team, so if you do want to be a rock star and make meaningful contributions to our superb product, now it’s the right time to join. Despite being a small team, we have a lot of people from different countries and cultures, which creates an incredible and unique environment to work. Everyone is friendly and there's a collaborative culture across the entire company. Conditions are excellent, from your favourite laptop to books you need, you just need to ask. Snacks, water, coffee, everything is provided, not to mention the great location (Shoreditch, at the moment). Cons Not a Cons in my opinion, but might be for others. There are probably three types of rock stars: - They are a genius, and they work hard (aka, Unicorns) - They are genius - They work incredibly hard to achieve the expected results You will get everything you need to succeed. However, Curve is a start-up moving fast and making history, that is not achievable by just working from 9 am to 5 pm.", "rating": 5, "pros": "There is a massive movement around FinTech these days, and if you want to be part of that movement, there is no better company to join than Curve.", "cons": "Not a Cons in my opinion, but might be for others. There are probably three types of rock stars:", "advice": null}, {"title": "Great team, exciting product", "text": "Pros I really enjoy working here, every day is different and there are plenty of opportunities to learn. Cons I work a CS shift every other weekend (in exchange for a day in lieu)", "rating": 5, "pros": "I really enjoy working here, every day is different and there are plenty of opportunities to learn.", "cons": "I work a CS shift every other weekend (in exchange for a day in lieu)", "advice": null}]