[{"title": "content", "text": "Pros Nice collegues. You have the possibility to be creative and autonomous. Good Job. Cons lately chaotic and challengeing. you have to be very flexible.", "rating": 5, "pros": "Nice collegues. You have the possibility to be creative and autonomous. Good Job.", "cons": "lately chaotic and challengeing. you have to be very flexible.", "advice": null}, {"title": "Very bad decisions", "text": "Pros Good and kind colleagues, coffee Cons I worked there for some years and it used to be a good company, even though they had problems to stay afloat they were human. It became really bad, especially for women, a sexist environment and bad decisions and unqualified bullshitters are elected as decision makers. Advice to Management get rid of the loud mouthed empty people and try to put your trust into good people.", "rating": 1, "pros": "Good and kind colleagues, coffee", "cons": "I worked there for some years and it used to be a good company, even though they had problems to stay afloat they were human. It became really bad, especially for women, a sexist environment and bad decisions and unqualified bullshitters are elected as decision makers.", "advice": "get rid of the loud mouthed empty people and try to put your trust into good people."}, {"title": "A start-up dynamic in a structured company", "text": "Pros Very nice work environment, very nice collegues. DaWanda knows how to take care of their employees! If you're willing to and show what you can do, you can quickly get responsabilities and learn a lot. We're quite independant in our work, but thanks to a flat hierarchie we can easily get feedbacks from the management on what we do if necessary. Changes based on test & learn processes, and new projects happen quite often, so that we don't get bored! On most of all, we all work on a great product created to empower people to live their passion and stimulate creativity! Cons We are still somehow dependant on a old product which has to be fixed gradually. Depending on the people, the companies values are not understood the same way, this can lead to unpleasant situations. Advice to Management Keep up the good work! They were many improvement these last past months and I believe DaWanda is on a good way :)", "rating": 5, "pros": "Very nice work environment, very nice collegues. DaWanda knows how to take care of their employees!", "cons": "We are still somehow dependant on a old product which has to be fixed gradually.", "advice": "Keep up the good work! They were many improvement these last past months and I believe DaWanda is on a good way :)"}, {"title": "IT department", "text": "Pros Good evironment, many nationalities, freedom. Cons Poor IT management, lots of legacy, mobile not priority Advice to Management Give more attention and feedback to the teams.", "rating": 3, "pros": "Good evironment, many nationalities, freedom.", "cons": "Poor IT management, lots of legacy, mobile not priority", "advice": "Give more attention and feedback to the teams."}, {"title": "Terrible terrible!", "text": "Pros Nice colleagues, good balcony Work-life balance is good if you learn your place and know you'll never leave your post so you might as well leave at 17, because no-one cares. Cons They promise and promise but never do anything to deliver on those promises. Teamleads have no idea what they are doing, they have the job because they are friends with other teamleads or management and completely rely on the input of lower level employees but will never give them credit. Promise you (there we go again) improvement and growth, but in the end they are the only ones making better money and having better chances . Advice to Management Show up, guide your teamleads and value also the lower employees.", "rating": 1, "pros": "Nice colleagues, good balcony", "cons": "They promise and promise but never do anything to deliver on those promises. Teamleads have no idea what they are doing, they have the job because they are friends with other teamleads or management and completely rely on the input of lower level employees but will never give them credit. Promise you (there we go again) improvement and growth, but in the end they are the only ones making better money and having better chances .", "advice": "Show up, guide your teamleads and value also the lower employees."}, {"title": "Terrible people", "text": "Pros They have a free beer fridge and the managers don't notice if you don't turn up. Cons They lie, cheat and don't value their staff.", "rating": 1, "pros": "They have a free beer fridge and the managers don't notice if you don't turn up.", "cons": "They lie, cheat and don't value their staff.", "advice": null}, {"title": "Good from far, but far from good", "text": "Pros Work-Life balance A nice looking office The Snuggery The Marketing/PR/Design department: Thanks to you I was part of building the most-loved German brand, and I am very proud of it! The PR: the brand is so strong that no negative glassdoor article will have any influence on the press coverage. The further away from management, the better life is, as is shown in the ratings on Glassdoor Cons The *most successful* people at DaWanda are those who complain the whole time, but stay quiet when the decision makers are in the room. The worst time was when the sale/merger/exit/closure? of DaWanda fell through: The communication in the corridors was awful, everyone knew how much money was put into what, how little is on the bank account, that marketing presentations for investors were overblown, that fake roadmaps to please investors were put in place, bills were not paid, etc. Many people were fired, many left on their own account for better job security, their ethics, and no more negativity. Advice to Management I hope DaWanda is not the next Enron. You need to do so much more in order for the corridor talk to stop (i.e. exchange your most-trusted employees). Although it was at first interesting to hear all the gossip to know what is truly going on, it was at the same time awful and embarrassing to find out that I was working for such a company.", "rating": 1, "pros": "Work-Life balance", "cons": "The *most successful* people at DaWanda are those who complain the whole time, but stay quiet when the decision makers are in the room.", "advice": "I hope DaWanda is not the next Enron."}, {"title": "Lack of focus", "text": "Pros Some good colleagues. Work Life balance. Interesting product. Cons Somente terrible colleagues with a huge lack of soft skills. Overconfidence. Management is changing priorities all the time and lack focus. No long term plans. A lot of conflicts among people that impacts team and individual performance. Management only shows up to explain Hard decisions that were taken. Advice to Management Be close to the people. Focus on the business and long term plan. Vanish all the toxic employees you have.", "rating": 3, "pros": "Some good colleagues.", "cons": "Somente terrible colleagues with a huge lack of soft skills. Overconfidence.", "advice": "Be close to the people."}, {"title": "I love working at DaWanda", "text": "Pros I feel like I get the respect I work for. The teams I work with (and the teams I work in) do also feel very family-style - we do care for each other and we all have the same goal: making DaWanda rock. Cons Just like in every company, not literally everybody is as highly motivated as I'd like to have. That's human. Advice to Management Listen a bit more to the employees; slightly raise the number of company events, become slightly more transparent.", "rating": 5, "pros": "I feel like I get the respect I work for. The teams I work with (and the teams I work in) do also feel very family-style - we do care for each other and we all have the same goal: making DaWanda rock.", "cons": "Just like in every company, not literally everybody is as highly motivated as I'd like to have. That's human.", "advice": "Listen a bit more to the employees; slightly raise the number of company events, become slightly more transparent."}, {"title": "Bound to fail", "text": "Pros Good work/life balance Some friendly people Cons Overconfident people with lack of perspective Egocentrism Financial problems Low salary Advice to Management Saving the day approach is bound to fail. Low-hanging fruits won't save Dawanda, neither the overconfident developers.", "rating": 3, "pros": "Good work/life balance", "cons": "Overconfident people with lack of perspective", "advice": "Saving the day approach is bound to fail. Low-hanging fruits won't save Dawanda, neither the overconfident developers."}, {"title": "No long term plan and financial issues", "text": "Pros HR departement is looking after the staff and trying to motivate them. Cons Management doesn't have a long term plan. Strategy changing every month from full spend to budget cuts. Very loud and overcrowded office without air conditioning, at summer over 30C. No standard processes and lack of structures. Employees are coming and going after a few months. There is a strong \"we\" against \"them\" culture. Older team members are not supporting new starters. Advice to Management Try to look further than 2-3 months. Focus on the basics first. Interns and students are won't develop the company to the next level.", "rating": 3, "pros": "HR departement is looking after the staff and trying to motivate them.", "cons": "Management doesn't have a long term plan.", "advice": "Try to look further than 2-3 months."}, {"title": "Disorganised chaos", "text": "Pros - Apart from a nice office, good work/life balance and friendly colleagues, the main pro was leaving and never having to return. Cons - Senior management unfriendly, distant yet controlling, and seriously lacking in people skills. - Limited and confused direction. - Erratic spending and planning. - A lot of micro-managing from senior management, which created a tense atmosphere. - No clarity or openness - rumours were the only way to find out what was actually going on. - CEOs generally awkward around employees. Advice to Management - More respect for employees. - Senior management should be more approachable. - Have a clear, defined and achievable plan for the future.", "rating": 1, "pros": "- Apart from a nice office, good work/life balance and friendly colleagues, the main pro was leaving and never having to return.", "cons": "- Senior management unfriendly, distant yet controlling, and seriously lacking in people skills.", "advice": "- More respect for employees."}, {"title": "It all comes to people in your team", "text": "Pros Great overall company culture Flexible work hours Pretty good coffee and soft drinks Nice office Cons Team was overblown, everyone hated each other for no reason Strong \"us vs them\" attitude toward new workers Chaotic structure Advice to Management Pay more attention to your loyal and productive workers", "rating": 3, "pros": "Great overall company culture", "cons": "Team was overblown, everyone hated each other for no reason", "advice": "Pay more attention to your loyal and productive workers"}, {"title": "Tolles Arbeitsklima und viele Chancen", "text": "Pros Gutes Arbeitsklima, Gehalt war OK, Entwicklungsmoeglichkeiten, flache Hierachien Cons Kommunikation Procedere nicht optimal, Information nicht transparent genug Advice to Management Mehr Transparenz", "rating": 5, "pros": "Gutes Arbeitsklima, Gehalt war OK, Entwicklungsmoeglichkeiten, flache Hierachien", "cons": "Kommunikation Procedere nicht optimal, Information nicht transparent genug", "advice": "Mehr Transparenz"}, {"title": "Viele eigene Gestaltungsmöglichkeiten, gutes Klima", "text": "Pros \"Was ich an DaWanda besonders schätze ist das Produkt an sich und die Themen, die sich daraus ergeben. Die Hierarchien sind flach, mein Teamlead ist für mich immer ansprechbar. Die Kollegen sind super und die Gesamtatmosphäre ist freundlich und höflich - das habe ich so bisher in keiner anderen Firma erlebt. Ich kann mich gut mit meinen Ideen einbringen und einiges verwirklichen. Wenn man selbst aktiv wird, sind auch Wechsel innerhalb der Firma zu anderen Aufgabenbereichen möglich und es gab auch schon Mitarbeiter, die nach einiger Zeit in anderen Firmen wieder zurückgekommen sind.\" Cons Manchmal werden Entscheidungen eher kurzfristig getroffen und müssen dann auch kurzfristig umgesetzt werden.", "rating": 5, "pros": "\"Was ich an DaWanda besonders schätze ist das Produkt an sich und die Themen, die sich daraus ergeben. Die Hierarchien sind flach, mein Teamlead ist für mich immer ansprechbar. Die Kollegen sind super und die Gesamtatmosphäre ist freundlich und höflich - das habe ich so bisher in keiner anderen Firma erlebt. Ich kann mich gut mit meinen Ideen einbringen und einiges verwirklichen.", "cons": "Manchmal werden Entscheidungen eher kurzfristig getroffen und müssen dann auch kurzfristig umgesetzt werden.", "advice": null}, {"title": "Tolles Arbeitsklima und viele Chancen", "text": "Pros Das Arbeitsklima ist sehr gut, nette Kollegen und flache Hierarchien. Jeder engagierte Mitarbeiter bekommt seine Chance sich weiter zu entwickeln, man kann sich aus jeder Position nach oben arbeiten wenn gute Arbeitsleistung erbracht wird. Auch als Praktikant gibt es die Chance auf Festanstellung. Bevor jemand Externes auf eine höhere Position eingestellt wird schaut man erst nach einer internen Nachbesetzung. Absolut fairer Umgang von oben und immer eine offene Tür bei Problemen. Zudem kann man die Erfüllung seiner Aufgaben relativ frei gestalten und neue Vorschläge finden gehör. Von Anfang an wurde mir großes Vertrauen entgegen gebracht und dazu gehört auch flexibles arbeiten. Cons Mittlerweile ist das Unternehmen schon sehr groß und deshalb kennt man nicht mehr jede Kollegin/Kollegen. Die Zusammenarbeit der Abteilungen muss noch verbessert werden. Advice to Management Den neuen Weg der besseren Transparenz beibehalten.", "rating": 5, "pros": "Das Arbeitsklima ist sehr gut, nette Kollegen und flache Hierarchien. Jeder engagierte Mitarbeiter bekommt seine Chance sich weiter zu entwickeln, man kann sich aus jeder Position nach oben arbeiten wenn gute Arbeitsleistung erbracht wird. Auch als Praktikant gibt es die Chance auf Festanstellung. Bevor jemand Externes auf eine höhere Position eingestellt wird schaut man erst nach einer internen Nachbesetzung.", "cons": "Mittlerweile ist das Unternehmen schon sehr groß und deshalb kennt man nicht mehr jede Kollegin/Kollegen.", "advice": "Den neuen Weg der besseren Transparenz beibehalten."}, {"title": "Vielseitige Aufgaben und angenehme Arbeitsatmosphäre", "text": "Pros Die Aufgabenbereiche im Sales-Bereich sind sehr vielseitig und spannend und es wird bei persönlichen Projekten auf eigene Interessensschwerpunkte eingegangen Es herrscht eine kollegiale und angenehme Arbeitsatmosphäre, so dass auch mit Vorgesetzten auf einer Ebene kommuniziert werden kann und diese immer ein offenes Ohr haben Cons Der Informationsfluss innerhalb der Firma könnte noch besser werden, so dass alle an einem Projekt Beteiligten immer auf dem gleichen Stand sind", "rating": 5, "pros": "Die Aufgabenbereiche im Sales-Bereich sind sehr vielseitig und spannend und es wird bei persönlichen Projekten auf eigene Interessensschwerpunkte eingegangen", "cons": "Der Informationsfluss innerhalb der Firma könnte noch besser werden, so dass alle an einem Projekt Beteiligten immer auf dem gleichen Stand sind", "advice": null}, {"title": "Change is good!", "text": "Pros DaWanda enables creative people to make a living from their skills and passion, a purpose which I find extremely appealing. The business model is based on shared success - DaWanda as a company can only succeed when DaWanda sellers are successful. Therefore, it is encouraging to see that DaWanda has been implementing many changes with the ultimate goal to become a more customer centric organization. Furthermore, it is pretty awesome to work with talented and creative people with so many great ideas and an intrinsic motivation to deliver great customer value. While goals are ambitious and challenging at times, overall, I find my work-live balance to be well intact- due to flexible working hours, the possibility to work from home as well as a general agreement that working overtime should be the exception, not the rule. Cons Change is good and necessary, yet it always creates friction and unfortunately comes with the loss of some good people along the way. Internal communication at DaWanda is far from perfect, yet I see progress - but it’s still a long way to go. This applies also to collaboration between teams which ranges from non-existent to super awesome. I think DaWanda needs to better retain talented people by, among other things, offering guidance on making a career at DaWanda. With more than 200 people working here, it should be possible to provide many people with exiting career opportunities within the company. I see that development plans are being implemented now in many teams which I believe is a step in the right direction. Advice to Management Foster internal collaboration and communication and continue to drive change to make DaWanda an even more customer centric product and company.", "rating": 5, "pros": "DaWanda enables creative people to make a living from their skills and passion, a purpose which I find extremely appealing. The business model is based on shared success - DaWanda as a company can only succeed when DaWanda sellers are successful. Therefore, it is encouraging to see that DaWanda has been implementing many changes with the ultimate goal to become a more customer centric organization. Furthermore, it is pretty awesome to work with talented and creative people with so many great ideas and an intrinsic motivation to deliver great customer value. While goals are ambitious and challenging at times, overall, I find my work-live balance to be well intact- due to flexible working hours, the possibility to work from home as well as a general agreement that working overtime should be the exception, not the rule.", "cons": "Change is good and necessary, yet it always creates friction and unfortunately comes with the loss of some good people along the way. Internal communication at DaWanda is far from perfect, yet I see progress - but it’s still a long way to go. This applies also to collaboration between teams which ranges from non-existent to super awesome.", "advice": "Foster internal collaboration and communication and continue to drive change to make DaWanda an even more customer centric product and company."}, {"title": "Spannende Aufgaben und endlich wieder eine Vision", "text": "Pros spannende Aufgaben, super Kollegen, Teamzusammenhalt, Startup Flair (mit positiven und negativen Aspekten), Grillparties, Herausforderungen in den Aufgaben, immer wieder Abwechslung, moderne Arbeitsformen (agile, an Spotify angepasst) Cons - die aktuelle finanzielle Lage, auch wenn diese sich etwas gebessert hat - Wenig Führungserfahrung (was sich gerade etwas ändert, da die Führung ausgetauscht wurde) - keine besondere Büroausstattung Advice to Management Weiter so! Nicht aufgeben, die Änderungen wirken langsam", "rating": 5, "pros": "spannende Aufgaben, super Kollegen, Teamzusammenhalt, Startup Flair (mit positiven und negativen Aspekten), Grillparties, Herausforderungen in den Aufgaben, immer wieder Abwechslung, moderne Arbeitsformen (agile, an Spotify angepasst)", "cons": "- die aktuelle finanzielle Lage, auch wenn diese sich etwas gebessert hat", "advice": "Weiter so! Nicht aufgeben, die Änderungen wirken langsam"}, {"title": "Dem Untergang nahe!", "text": "Pros War früher mal eine ganz besonders besondere Firma, die die kleinen Firmen, mit ihren liebevoll handgefertigten Produkten sehr unterstützt hatte. Cons Kleine Führungsriege, die sich nur selbst unterstützt aber nicht für DaWanda da ist. Mobbing ist dort an der Tagesordnung. Ein kommen und gehen von Mitarbeitern. Unfreundlich zu Kunden. Ständig technische Probleme, die die Kunden ausbaden müssen. Advice to Management Führung auswechseln. Ein gemeinsames Ziel zusammen erarbeiten. Mobbing unterbinden. Wieder mehr Freundlichkeit untereinander und zu Kunden.", "rating": 1, "pros": "War früher mal eine ganz besonders besondere Firma, die die kleinen Firmen, mit ihren liebevoll handgefertigten Produkten sehr unterstützt hatte.", "cons": "Kleine Führungsriege, die sich nur selbst unterstützt aber nicht für DaWanda da ist. Mobbing ist dort an der Tagesordnung. Ein kommen und gehen von Mitarbeitern. Unfreundlich zu Kunden. Ständig technische Probleme, die die Kunden ausbaden müssen.", "advice": "Führung auswechseln. Ein gemeinsames Ziel zusammen erarbeiten. Mobbing unterbinden. Wieder mehr Freundlichkeit untereinander und zu Kunden."}, {"title": "Unfreundliches Mobbing Team", "text": "Pros Nette Plattform. 2 nette Kollegen, die auch nicht mehr da sind. Cons Alles wird nach und nach durch ungeschultes Team zerstört. DaWanda wird bald pleite gehen. Sie sind unfreundlich zu Kunden. Ständig technische Probleme. Advice to Management Ein Ziel vor Augen.", "rating": 1, "pros": "Nette Plattform. 2 nette Kollegen, die auch nicht mehr da sind.", "cons": "Alles wird nach und nach durch ungeschultes Team zerstört.", "advice": "Ein Ziel vor Augen."}, {"title": "Positive Arbeitsumgebung", "text": "Pros Wirklicher Gemeinschaftssinn. DaWanda hat einen Zweck und ist nicht nur ein Marktplatz. Es hilft tausenden Leuten, ihre handgefertigten Produkte zu verkaufen, ihre eigenen Unternehmen zu gründen und zu tun, was sie wirklich lieben. Real sense of community. DaWanda has a real purpose beyond being a marketplace. It is helping thousands of people sell their handmade products, set up their own businesses and do what they really love. Cons Bewegt sich was Technik angeht sehr langsam Moves really slowly with respect to technology", "rating": 5, "pros": "Wirklicher Gemeinschaftssinn. DaWanda hat einen Zweck und ist nicht nur ein Marktplatz. Es hilft tausenden Leuten, ihre handgefertigten Produkte zu verkaufen, ihre eigenen Unternehmen zu gründen und zu tun, was sie wirklich lieben.", "cons": "Bewegt sich was Technik angeht sehr langsam", "advice": null}, {"title": "Toller Arbeitgeber!", "text": "Pros sehr aufgeschlossene, kreative, ehrgeizige Menschen interessante Aufgaben schönes Produkt internationales Umfeld very open, creative, driven people interesting tasks nice product international environment Cons Die Organisation muss noch am Kommunikationsfluss arbeiten, nichts, was man nicht korrigieren kann. the organisation still has to work on communication flows, nothing that can't be fixed", "rating": 5, "pros": "sehr aufgeschlossene, kreative, ehrgeizige Menschen", "cons": "Die Organisation muss noch am Kommunikationsfluss arbeiten, nichts, was man nicht korrigieren kann.", "advice": null}]