[{"title": "Great company!", "text": "Pros Great company to work for! The sky is the limit in terms of career growth potential . You are in charge of your career. Free coffee as well. Cons None so far other than 401k can be a lot better.", "rating": 5, "pros": "Great company to work for! The sky is the limit in terms of career growth potential . You are in charge of your career. Free coffee as well.", "cons": "None so far other than 401k can be a lot better.", "advice": null}, {"title": "Great Place to start your career - Carefully read the cons", "text": "Pros These folks know exactly what they are doing. They set high standards, and consistently deliver. Their project expectations and planning is excellent. The top level management folks are extremely smart and have a great sense of vision and planning. If you go to company social events (which are very frequent by the way), it is quite easy to have conversations with upper management people (Partners). Deloitte's hiring pattern is very consistent. For the young starters, they hire smart, well spoken, and subtly aggressive candidates. They have excellent training and knowledge management. They have a well oiled and empowered HR and Tech Support group. Things get done pretty fast. Their paid time off program is really great, and pretty straight forward. No messing about. They have a big social responsibility program that encourages volunteering. It also presents a great opportunity for youngsters to take event organizing responsibilities. This can be very very useful. Once, I volunteered for an event where we painted rooms for an orphanage center. There was a young guy who did the organizing. We were 10-12 people, with 3 senior executives actually doing paintwork. Quite unique. I have personally seen that Deloitte's top talents tend to start young, spend a 3-4 years, then take a hiatus to pursue a Graduate Degree (typically an MBA). The firm sometimes re-hires these consultants after their MBA with generous financial incentives. They offer much better packages to folks graduating from top universities. Sometimes they can offer huge joining bonuses. I worked in the IT consulting division.They tend to get top-end projects. On projects, the average age seems pretty low. A lot of 20-somethings, then there are a handful of 30-40 year old people and some senior Management folks. Beginner salaries can be a bit low. (which is expected. It takes some time to build credibility in the Consulting business) Overall, a great place to start your professional career. If you pay attention, you will get seasoned very quickly. Cons Work-life balance can become poor, especially during tight project timelines (This is expected in the Consulting Business). The employees have a significant amount of \"firm-internal\" training and knowledge contribution tasks. There are annual goal expectations. It can get tedious if you continuously work on high demand projects. There is intense competition, especially during targeted promotion/milestone years. There can be some backstabbing. It's part of the experience. It is not as bad as it sounds, and seems manageable. A lot of times, being young and inexperienced has it's flaws. The company has a simple way of seasoning consultants. They get pushed into high pressure situations, and they learn fast, and quickly start managing their own work. But they tend to be blind towards intricate details, especially in complicated IT product implementations. This has an interesting effect. If someone is able to do the hands-on work, everyone else tries to piggy-back on that person for their actual work. The hands-on guy gets overwhelmed, and others try to use him/her as a key resource. -- I personally went through a crunch project, and found a number of people \"managing expectations\" (piggy backing), while a handful of people actually knew the end-to-end solution and did the hands-on work. This created a lot more work and mental anguish than needed. Because of the expressed pressure, the hands-on guys have a hard time building and growing their reputation and subsequent performance evaluation rating. This also affects the project execution timelines. IMPORTANT: Make sure you thoroughly read through your employment agreement and understand the implications. In recent years, they have started hiring for specific projects ONLY. This falls under a particular \"AMS service line\". In this case, if your assigned project gets into a problem, you are exposed to the risk of employment termination. Their HR and Management are very helpful, and they will try to get you a new project. But there are several constraints like location, your skills, and limited time. I went through this, and it was somewhat unnerving. This was one of the reasons I ended up leaving the company. Advice to Management I have high regards for the Senior Management in this company. I think they are the market leaders in the industry, especially with their consistent high standards. Personally, I think they should strongly encourage some \"end-to-end\" hands-on responsibility in the IT consulting division. There are very few hands-on guys. I have seen a lot of segregation of duties between people that causes endless heartburn during crunch project timelines.", "rating": 5, "pros": "These folks know exactly what they are doing. They set high standards, and consistently deliver.", "cons": "Work-life balance can become poor, especially during tight project timelines (This is expected in the Consulting Business). The employees have a significant amount of \"firm-internal\" training and knowledge contribution tasks. There are annual goal expectations. It can get tedious if you continuously work on high demand projects.", "advice": "I have high regards for the Senior Management in this company. I think they are the market leaders in the industry, especially with their consistent high standards."}, {"title": "Analyst", "text": "Pros Amazing company with great management Cons Overall had a great experience", "rating": 5, "pros": "Amazing company with great management", "cons": "Overall had a great experience", "advice": null}, {"title": "tax", "text": "Pros great place to start a career Cons everyone you work with in young and unexperienced Advice to Management pay more", "rating": 5, "pros": "great place to start a career", "cons": "everyone you work with in young and unexperienced", "advice": "pay more"}, {"title": "Consultant", "text": "Pros Great benefits and great people Cons Long hours and low pay out of college", "rating": 5, "pros": "Great benefits and great people", "cons": "Long hours and low pay out of college", "advice": null}, {"title": "Sr auditor", "text": "Pros Great learning experience and opportunities for career. Learned a lot. I saw a lot of big companies financials Fiona did that I would never have been exposed to had I not been at deloitte Cons No work life balance. They expect you to sit at your desk (table in a conference room) all day even when finished with work and make you stay ridiculously long hours even if u work is done for the day. Advice to Management Give your people more work life balance. Don’t create such a negative culture where people aren’t there to help others and they are always talking down to you or bad ab others.", "rating": 5, "pros": "Great learning experience and opportunities for career. Learned a lot. I saw a lot of big companies financials Fiona did that I would never have been exposed to had I not been at deloitte", "cons": "No work life balance. They expect you to sit at your desk (table in a conference room) all day even when finished with work and make you stay ridiculously long hours even if u work is done for the day.", "advice": "Give your people more work life balance. Don’t create such a negative culture where people aren’t there to help others and they are always talking down to you or bad ab others."}, {"title": "Loved Deloitte", "text": "Pros Very employee centric. Lots of smart people. Amazing benefits (6 weeks PTO for a Manager, $500 annual fitness subsidy, nearly 3 weeks of US Holidays, training opportunities at Deloitte University, Family Leave to name a few). By far the best company I have ever worked for over. Only reason I left was to pursue an amazing opportunity. Cons Didn't come across any in my time there. Advice to Management Keep focusing on your employees! The constant communication stream from the C-Suite and focus on employee stories on the Deloittenet home pages provided a constant reminder of how Deloitte was taking caring of employees across the world both professionally and when tragedies and national disasters impacted their personal lives.", "rating": 5, "pros": "Very employee centric. Lots of smart people. Amazing benefits (6 weeks PTO for a Manager, $500 annual fitness subsidy, nearly 3 weeks of US Holidays, training opportunities at Deloitte University, Family Leave to name a few). By far the best company I have ever worked for over. Only reason I left was to pursue an amazing opportunity.", "cons": "Didn't come across any in my time there.", "advice": "Keep focusing on your employees! The constant communication stream from the C-Suite and focus on employee stories on the Deloittenet home pages provided a constant reminder of how Deloitte was taking caring of employees across the world both professionally and when tragedies and national disasters impacted their personal lives."}, {"title": "Deloitte Consulting", "text": "Pros Benefits, time off, work environment are all stellar. Lots of company communication and training opportunities. Cons Seem unsure of what business is coming down the pipeline or if there are people to fill open roles.", "rating": 5, "pros": "Benefits, time off, work environment are all stellar. Lots of company communication and training opportunities.", "cons": "Seem unsure of what business is coming down the pipeline or if there are people to fill open roles.", "advice": null}, {"title": "Senior Consultant", "text": "Pros benefits, fast paced, lots of opportunities to advance Cons travel, low pay, no work - life fit", "rating": 5, "pros": "benefits, fast paced, lots of opportunities to advance", "cons": "travel, low pay, no work - life fit", "advice": null}, {"title": "campus hire", "text": "Pros Great place to work for with dynamic people Cons no work life balance for the employees Advice to Management focus on improving ppl's quality of life", "rating": 5, "pros": "Great place to work for with dynamic people", "cons": "no work life balance for the employees", "advice": "focus on improving ppl's quality of life"}, {"title": "Former Consultant, moved internal", "text": "Pros Great benefits and vacation. Love the people Cons once you move internal, career path is not as established.", "rating": 5, "pros": "Great benefits and vacation. Love the people", "cons": "once you move internal, career path is not as established.", "advice": null}, {"title": "Manager", "text": "Pros opportunities for advancement are evident Cons long hours and high utilization rates which were not directly recognized in compensation", "rating": 5, "pros": "opportunities for advancement are evident", "cons": "long hours and high utilization rates which were not directly recognized in compensation", "advice": null}, {"title": "Deloitte Consulting Technology Senior Consultant", "text": "Pros Work-Life Balance, Supportive Leaders, Challenging Work, Great employee benefits Cons Travels, Compensation, Slow Career Growth/Promotions Advice to Management Allow top performers to rise faster in the firm", "rating": 5, "pros": "Work-Life Balance, Supportive Leaders, Challenging Work, Great employee benefits", "cons": "Travels, Compensation, Slow Career Growth/Promotions", "advice": "Allow top performers to rise faster in the firm"}, {"title": "Great Place to Learn and Grow", "text": "Pros Big network, good benefits, and interesting work Cons Guidance programs unstructured, often work long hours without recognition, and experience very dependent on senior managers you work with", "rating": 5, "pros": "Big network, good benefits, and interesting work", "cons": "Guidance programs unstructured, often work long hours without recognition, and experience very dependent on senior managers you work with", "advice": null}, {"title": "Practical Trianee", "text": "Pros Good Working Condition, professional collegues Cons High pressure, low pay at first year.", "rating": 5, "pros": "Good Working Condition, professional collegues", "cons": "High pressure, low pay at first year.", "advice": null}, {"title": "Be prepared to work, but co-workers make it better.", "text": "Pros Compensation is high, but you'll earn it. You get experience across a wide swath of the inddustry/technology. Great place to start a career when you're unsure of what exactly you want to do. Cons Depending on your project, long inflexible hours. Advice to Management Keep it up, but try to keep the 'community' fee after 2nd year BTA.", "rating": 5, "pros": "Compensation is high, but you'll earn it. You get experience across a wide swath of the inddustry/technology. Great place to start a career when you're unsure of what exactly you want to do.", "cons": "Depending on your project, long inflexible hours.", "advice": "Keep it up, but try to keep the 'community' fee after 2nd year BTA."}, {"title": "Positive experience", "text": "Pros Lots of opportunity for professional growth and development. There are a lot of very bright and social junior practitioners, which makes work more enjoyable. Cons Solutions aren’t particularly innovative and leadership can sometimes plays a large role in inhibiting practitioners from achieving their potential. Junior practitioners can sometimes get stuck on painfully boring projects for long periods of time. Advice to Management Let practitioners rotate projects more frequently in federal", "rating": 5, "pros": "Lots of opportunity for professional growth and development. There are a lot of very bright and social junior practitioners, which makes work more enjoyable.", "cons": "Solutions aren’t particularly innovative and leadership can sometimes plays a large role in inhibiting practitioners from achieving their potential. Junior practitioners can sometimes get stuck on painfully boring projects for long periods of time.", "advice": "Let practitioners rotate projects more frequently in federal"}, {"title": "Cool", "text": "Pros Upper Management takes care of the people Cons Super long hours most of the year", "rating": 5, "pros": "Upper Management takes care of the people", "cons": "Super long hours most of the year", "advice": null}, {"title": "Very good company to work for", "text": "Pros Great compensation, fun projects, smart people Cons Major travel. I traveled 4 days a week for almost 1 year.", "rating": 5, "pros": "Great compensation, fun projects, smart people", "cons": "Major travel. I traveled 4 days a week for almost 1 year.", "advice": null}, {"title": "Consultant (Federal Technology)", "text": "Pros - Flexible work environment, leadership flexible on when you take PTO (depending on team and manager) - Lots of PTO - Opportunity to get involved in any initiatives of your interest - Flexibility to switch roles if you prove you're able to do the work - Leadership is very supportive in helping you and getting to where you want to go Cons - In order to get a good rating and consistently stay a top performer, need to devote good amount of extra time outside of business hours - Client environment can be slow (federal) - Hierarchical structure can limit your mobility or transfer requests, and certain sectors of the firm seem to be more exclusive Advice to Management Rethink pay structure for technical roles in order to attract and retain top technical talent (which has been communicated as a need), including for developers and designers Streamline funding process for attending conferences and other professional development events for practitioners", "rating": 5, "pros": "- Flexible work environment, leadership flexible on when you take PTO (depending on team and manager)", "cons": "- In order to get a good rating and consistently stay a top performer, need to devote good amount of extra time outside of business hours", "advice": "Rethink pay structure for technical roles in order to attract and retain top technical talent (which has been communicated as a need), including for developers and designers"}, {"title": "Senior Consultant", "text": "Pros Amazing support and resources. Management will typically fight in your corner Cons They give you a lot of PTO that you are not allowed or expected to take. And if you take it, it could have negative impacts to your performance reviews", "rating": 5, "pros": "Amazing support and resources. Management will typically fight in your corner", "cons": "They give you a lot of PTO that you are not allowed or expected to take. And if you take it, it could have negative impacts to your performance reviews", "advice": null}, {"title": "summer associate internship", "text": "Pros good company environment as well as other stuff Cons not that much actually at Deloitte", "rating": 5, "pros": "good company environment as well as other stuff", "cons": "not that much actually at Deloitte", "advice": null}, {"title": "IAM Consultant", "text": "Pros Best company to work for. Lots of training, lots of opportunities, benefits. Cons Promotion path can get subjective and is dependent on your connections with management.", "rating": 5, "pros": "Best company to work for. Lots of training, lots of opportunities, benefits.", "cons": "Promotion path can get subjective and is dependent on your connections with management.", "advice": null}, {"title": "Audit Assistant", "text": "Pros Great work flexibility, good benefits. The best and the brightest work here, and it shows. Cons Just below industry pay. You have to set boundaries as far as how much work you can handle, because they will keep giving it to you until you say you've had enough.", "rating": 5, "pros": "Great work flexibility, good benefits. The best and the brightest work here, and it shows.", "cons": "Just below industry pay. You have to set boundaries as far as how much work you can handle, because they will keep giving it to you until you say you've had enough.", "advice": null}, {"title": "Great for starting out!", "text": "Pros The community is great, the trainings are great, flexible work hours, working as a jr. consultant you get guidance from your manager and seniors, you learn a lot of things from different industries, and they also challenge you to keep growing every year Cons Time management skills are a must, and still, long work hours are usual in this field of work,", "rating": 5, "pros": "The community is great, the trainings are great, flexible work hours, working as a jr. consultant you get guidance from your manager and seniors, you learn a lot of things from different industries, and they also challenge you to keep growing every year", "cons": "Time management skills are a must, and still, long work hours are usual in this field of work,", "advice": null}, {"title": "A great company to work for", "text": "Pros Flexibility, salary, stability, culture, people Cons The hours can definitely be too long", "rating": 5, "pros": "Flexibility, salary, stability, culture, people", "cons": "The hours can definitely be too long", "advice": null}, {"title": "Business Technology Analyst", "text": "Pros Travel, cross-industry experience, learning opportunities. Cons A lot of time away from home.", "rating": 5, "pros": "Travel, cross-industry experience, learning opportunities.", "cons": "A lot of time away from home.", "advice": null}, {"title": "Internal Finance", "text": "Pros Solid pay, great benefits, great w/l balance, new office location near Union Station Cons Slow upward mobility for internal positions.", "rating": 5, "pros": "Solid pay, great benefits, great w/l balance, new office location near Union Station", "cons": "Slow upward mobility for internal positions.", "advice": null}, {"title": "Tax associate", "text": "Pros Great perks to being a full-time employee. Cons Day to day can get a bit boring. Advice to Management Provide more honest feedback to young staff.", "rating": 5, "pros": "Great perks to being a full-time employee.", "cons": "Day to day can get a bit boring.", "advice": "Provide more honest feedback to young staff."}, {"title": "Great Company to work but beware of a few things", "text": "Pros Deloitte makes sure you are extremely well prepared to face the customer and challenges around the consulting world. If you have been to other consulting firms (non-big4) you'll notice that you never got such great information to get a head start. The firm sets high standards, consistently deliver and invests heavily on their branding and make sure you are prepared to deliver that within their expectations. Top level management are extremely smart and have a great sense of vision and planning. It is quite easy to have conversations with upper management people, most people keep open door policies and they will try to help you in any way they can. Deloitte University is a fantastic facility and the company invested heavily there and all the training you get there are top notch. You will find that Deloitte is on this business to win big and if you are able to network well you will grow easily on the firm. The benefits package is very good, pretty standard across the industry. The company has multiple mobile apps which makes your life a lot easier. Timesheets, expense reports, meeting/desk reservations can be done easily from your mobile phone. There are no delays on payment of expenses unless you have something that is really out of policy. There is a hotline for ANY question you may have and they resolve everything in 1 phone call. Cons I have found that even with a very big network outside the firm that connected me to people inside the firm, it can be hard to get staffed. They have a system where you look for project opportunities but that system is often outdated and you can not know who is hiring for specific jobs. A lot of people, specially senior managers and partners are often way too busy to respond to your e-mail and sometimes they will not even get into a phone call with you unless someone else referred you. There is intense competition and back-stabbing happens all the time and faster than you can think. One little honest mistake spreads quicker than a great achievement. Once you have done something that others claimed to be bad, it is hard to get your image back and you won't be invited to projects. You'll slowly sink if you don't play the political game. HR and your resource manager are very nice to you, and they will try to help you to get into a project. However, you must be flexible and willing to work on something you don't master. I personally don't like the idea of begging for work while you can see everyone else is busy. However, take advantage to learn a different skill. I ended up leaving because I could not survive a political game within a small group. Work/life balance is not truly there. There isn't a way to implement this easily in consulting. However, you should never expect someone to be available after hours and to work in the weekend. Even worse is hold someone accountable and stab them in the back if they had personal commitments on a weekend where you decided on a Friday afternoon that you need someone to work on a presentation that needed to be done on Monday morning. This can be something doable for young kids but not for employees with families. Advice to Management I do not think Senior Management is doing a bad job, in fact, it is the total opposite. They are aiming high and they will hit their goals, especially with their consistent high standards. I would advise to make sure partners are held accountable for the resources they hire. If you hired someone, you should make sure that the person can find the way around. This will not happen if you don't answer emails or phone calls. There are very few hands-on guys and those willing to be hands on are often pushed to the side and can become bored quickly. Make sure that work/life balance is set properly. Don't allow partners and senior managers to force people out of their weekend/evening plans with last minute requests and expect them to drop their family plans to work on a proposal (for example).", "rating": 5, "pros": "Deloitte makes sure you are extremely well prepared to face the customer and challenges around the consulting world. If you have been to other consulting firms (non-big4) you'll notice that you never got such great information to get a head start. The firm sets high standards, consistently deliver and invests heavily on their branding and make sure you are prepared to deliver that within their expectations.", "cons": "I have found that even with a very big network outside the firm that connected me to people inside the firm, it can be hard to get staffed. They have a system where you look for project opportunities but that system is often outdated and you can not know who is hiring for specific jobs.", "advice": "I do not think Senior Management is doing a bad job, in fact, it is the total opposite. They are aiming high and they will hit their goals, especially with their consistent high standards."}, {"title": "Great Company to work but beware of a few things", "text": "Pros Deloitte makes sure you are extremely well prepared to face the customer and challenges around the consulting world. If you have been to other consulting firms (non-big4) you'll notice that you never got such great information to get a head start. The firm sets high standards, consistently deliver and invests heavily on their branding and make sure you are prepared to deliver that within their expectations. Top level management are extremely smart and have a great sense of vision and planning. It is quite easy to have conversations with upper management people, most people keep open door policies and they will try to help you in any way they can. Deloitte University is a fantastic facility and the company invested heavily there and all the training you get there are top notch. You will find that Deloitte is on this business to win big and if you are able to network well you will grow easily on the firm. The benefits package is very good, pretty standard across the industry. The company has multiple mobile apps which makes your life a lot easier. Timesheets, expense reports, meeting/desk reservations can be done easily from your mobile phone. There are no delays on payment of expenses unless you have something that is really out of policy. There is a hotline for ANY question you may have and they resolve everything in 1 phone call. Cons I have found that even with a very big network outside the firm that connected me to people inside the firm, it can be hard to get staffed. They have a system where you look for project opportunities but that system is often outdated and you can not know who is hiring for specific jobs. A lot of people, specially senior managers and partners are often way too busy to respond to your e-mail and sometimes they will not even get into a phone call with you unless someone else referred you. There is intense competition and back-stabbing happens all the time and faster than you can think. One little honest mistake spreads quicker than a great achievement. Once you have done something that others claimed to be bad, it is hard to get your image back and you won't be invited to projects. You'll slowly sink if you don't play the political game. HR and your resource manager are very nice to you, and they will try to help you to get into a project. However, you must be flexible and willing to work on something you don't master. I personally don't like the idea of begging for work while you can see everyone else is busy. However, take advantage to learn a different skill. I ended up leaving because I could not survive a political game within a small group. Work/life balance is not truly there. There isn't a way to implement this easily in consulting. However, you should never expect someone to be available after hours and to work in the weekend. Even worse is hold someone accountable and stab them in the back if they had personal commitments on a weekend where you decided on a Friday afternoon that you need someone to work on a presentation that needed to be done on Monday morning. This can be something doable for young kids but not for employees with families. Advice to Management I do not think Senior Management is doing a bad job, in fact, it is the total opposite. They are aiming high and they will hit their goals, especially with their consistent high standards. I would advise to make sure partners are held accountable for the resources they hire. If you hired someone, you should make sure that the person can find the way around. This will not happen if you don't answer emails or phone calls. There are very few hands-on guys and those willing to be hands on are often pushed to the side and can become bored quickly. Make sure that work/life balance is set properly. Don't allow partners and senior managers to force people out of their weekend/evening plans with last minute requests and expect them to drop their family plans to work on a proposal (for example).", "rating": 5, "pros": "Deloitte makes sure you are extremely well prepared to face the customer and challenges around the consulting world. If you have been to other consulting firms (non-big4) you'll notice that you never got such great information to get a head start. The firm sets high standards, consistently deliver and invests heavily on their branding and make sure you are prepared to deliver that within their expectations.", "cons": "I have found that even with a very big network outside the firm that connected me to people inside the firm, it can be hard to get staffed. They have a system where you look for project opportunities but that system is often outdated and you can not know who is hiring for specific jobs.", "advice": "I do not think Senior Management is doing a bad job, in fact, it is the total opposite. They are aiming high and they will hit their goals, especially with their consistent high standards."}, {"title": "auditor", "text": "Pros loved it what a great company Cons it was ok but i liked it", "rating": 5, "pros": "loved it what a great company", "cons": "it was ok but i liked it", "advice": null}, {"title": "Excellent place to start your career", "text": "Pros Great company to start your career- learn a ton working with different people on different projects. Ability to move around/get different roles/positions if you try hard enough. People are smart and great to work with. Cons Can be cut throat at times, depending on what project you're on.", "rating": 5, "pros": "Great company to start your career- learn a ton working with different people on different projects. Ability to move around/get different roles/positions if you try hard enough. People are smart and great to work with.", "cons": "Can be cut throat at times, depending on what project you're on.", "advice": null}, {"title": "Great place to start your career!", "text": "Pros Great place for self-starters interested in charting the direction of their own careers, committed mentors genuinely interested in your development, unrivaled opportunities and resources Cons Access to opportunities significantly impacted by the breadth of your network, high pressure to dedicate unbillable time to extracurricular activities", "rating": 5, "pros": "Great place for self-starters interested in charting the direction of their own careers, committed mentors genuinely interested in your development, unrivaled opportunities and resources", "cons": "Access to opportunities significantly impacted by the breadth of your network, high pressure to dedicate unbillable time to extracurricular activities", "advice": null}, {"title": "Tax Consultant", "text": "Pros a great place to start your career Cons crazy hours during busy season", "rating": 5, "pros": "a great place to start your career", "cons": "crazy hours during busy season", "advice": null}, {"title": "Great place to work", "text": "Pros Experience, benefits, culture, growth, networking Cons Hierarchical, long hours, lots of documentation", "rating": 5, "pros": "Experience, benefits, culture, growth, networking", "cons": "Hierarchical, long hours, lots of documentation", "advice": null}, {"title": "working with the best", "text": "Pros working with the best- makes it a joy to get things done Cons working with the best- means everyone is very driven and somewhat high strung Advice to Management continue finding ways to teach people how a) master the basics so we don't get bogged down in details b) relax so we don't set unrealistic expectations", "rating": 5, "pros": "working with the best- makes it a joy to get things done", "cons": "working with the best- means everyone is very driven and somewhat high strung", "advice": "continue finding ways to teach people how a) master the basics so we don't get bogged down in details b) relax so we don't set unrealistic expectations"}, {"title": "Stellar overall experience at Deloitte", "text": "Pros Work with great people in collaborative culture. Strong professional development program. Very flexible work environment. Excellent benefits. Cons In consulting, work is not always predictable, due to client demands. Can be heavy travel. Advice to Management Continue to prioritize professional development, work-life fit, employee benefits, and contributions to society.", "rating": 5, "pros": "Work with great people in collaborative culture. Strong professional development program. Very flexible work environment. Excellent benefits.", "cons": "In consulting, work is not always predictable, due to client demands. Can be heavy travel.", "advice": "Continue to prioritize professional development, work-life fit, employee benefits, and contributions to society."}, {"title": "Manager", "text": "Pros smart people and interesting work Cons stressful, long hours, rigorous travel", "rating": 5, "pros": "smart people and interesting work", "cons": "stressful, long hours, rigorous travel", "advice": null}, {"title": "Good for self starters, intellectually curious", "text": "Pros Smart people, diversity of tasks, learning opportunities Cons Onus on you to find projects. Good opportunities can come randomly.", "rating": 5, "pros": "Smart people, diversity of tasks, learning opportunities", "cons": "Onus on you to find projects. Good opportunities can come randomly.", "advice": null}, {"title": "Consultant.", "text": "Pros Competitive Salaries Good Work Environment Good Social Activities Cons Networking is the base here, so people not good at it wont survive Work Life Balance goes for a toss", "rating": 5, "pros": "Competitive Salaries", "cons": "Networking is the base here, so people not good at it wont survive", "advice": null}, {"title": "Senior Project Controller", "text": "Pros clear cut career path and opportunities Cons lots of work, bad work life balance", "rating": 5, "pros": "clear cut career path and opportunities", "cons": "lots of work, bad work life balance", "advice": null}, {"title": "Manager", "text": "Pros Good culture, people you would want to be friends with. Travel (if you're young and like points and miles) Cons Travel (if you're over it and have a family). Little to no feedback in the year-end process. Advice to Management Too many rules and red tape with promotions. People that have been in their position get promoted after 3-4 years just because they've been in the role that long (and don't deserve the promotion); others don't get promoted quick enough.", "rating": 5, "pros": "Good culture, people you would want to be friends with. Travel (if you're young and like points and miles)", "cons": "Travel (if you're over it and have a family). Little to no feedback in the year-end process.", "advice": "Too many rules and red tape with promotions. People that have been in their position get promoted after 3-4 years just because they've been in the role that long (and don't deserve the promotion); others don't get promoted quick enough."}, {"title": "Recruiter Role in Technology", "text": "Pros There are a lot of good people Cons No real career progression or potential for increased compensation Advice to Management Focus more on the value your recruiters bring to build the company vs. cost cutting", "rating": 5, "pros": "There are a lot of good people", "cons": "No real career progression or potential for increased compensation", "advice": "Focus more on the value your recruiters bring to build the company vs. cost cutting"}, {"title": "Sr. SAP Consultant", "text": "Pros Carrier opportunities, good compensation and good leadership Cons Work life balance, frequent travel", "rating": 5, "pros": "Carrier opportunities, good compensation and good leadership", "cons": "Work life balance, frequent travel", "advice": null}, {"title": "Good Place to work", "text": "Pros Good hike,Work life balance,many talented people Cons Some accounts no work from home", "rating": 5, "pros": "Good hike,Work life balance,many talented people", "cons": "Some accounts no work from home", "advice": null}, {"title": "Anonymous", "text": "Pros Great starting place to boost your career, exposure to different industries, challenging projects, working with bright and type A people, your week goes by so quickly that you don't have time to get bored and goof off, and you also do learn lots in a short time frame Cons Unpredictable working hours, expect to work through weekends and late hours to meet client demands, it becomes a game of favorites as you look to decide whether to stay until PPMD level, while the firm promotes owning your career, the reality is that you end up on projects where there is a need, it doesn't matter what your interests are, firm is about profitability so the more client hours you can charge, the better it is for the firm, hence the long hours where you end up eating most of it anyway since most projects don't have enough hours budgeted", "rating": 5, "pros": "Great starting place to boost your career, exposure to different industries, challenging projects, working with bright and type A people, your week goes by so quickly that you don't have time to get bored and goof off, and you also do learn lots in a short time frame", "cons": "Unpredictable working hours, expect to work through weekends and late hours to meet client demands, it becomes a game of favorites as you look to decide whether to stay until PPMD level, while the firm promotes owning your career, the reality is that you end up on projects where there is a need, it doesn't matter what your interests are, firm is about profitability so the more client hours you can charge, the better it is for the firm, hence the long hours where you end up eating most of it anyway since most projects don't have enough hours budgeted", "advice": null}, {"title": "Happy at Deloitte", "text": "Pros Great training, opportunities, programs for work/life balance Cons Hard to differentiate your performance because you work with many outstanding people. High expectations to consistency improve on great work", "rating": 5, "pros": "Great training, opportunities, programs for work/life balance", "cons": "Hard to differentiate your performance because you work with many outstanding people. High expectations to consistency improve on great work", "advice": null}, {"title": "Great Long Term Value", "text": "Pros Great long term value for the NPV of a partnership, excellent compensation relative to industry Cons Hard work hours, sacrifice via travel away from home if married/with family. Advice to Management Flexibility is key to maintaining employees", "rating": 5, "pros": "Great long term value for the NPV of a partnership, excellent compensation relative to industry", "cons": "Hard work hours, sacrifice via travel away from home if married/with family.", "advice": "Flexibility is key to maintaining employees"}, {"title": "Great learning opportunities but very political", "text": "Pros - Great learning opportunities - Interesting client projects - Smart colleagues Cons - Travel heavy lifestyle (could be a plus for some) - Political environment - Inconsistent clients and project managers Advice to Management Deloitte is such large company, it's hard to implement changes from the top down. \"Culture\" is a funny word when you have 200,000 employees. There's enough information out there about Deloitte that you probably don't have to read it in this review.", "rating": 3, "pros": "- Great learning opportunities", "cons": "- Travel heavy lifestyle (could be a plus for some)", "advice": "Deloitte is such large company, it's hard to implement changes from the top down. \"Culture\" is a funny word when you have 200,000 employees. There's enough information out there about Deloitte that you probably don't have to read it in this review."}, {"title": "Review from a current employee.", "text": "Pros I like that there is room for advancement. Cons Easy to get lost amongst a sea of faces.", "rating": 5, "pros": "I like that there is room for advancement.", "cons": "Easy to get lost amongst a sea of faces.", "advice": null}, {"title": "Consultant", "text": "Pros Challenging; Great Co-workers; Constant room for development; Promoted quickly; Good pay; Diverse experience with Systems Development Lifecycle on Enterprise System Projects; Overall very good if you are a hard worker and highly motiviated in your career. Cons Work-life balance; Many co-worker prioritize work over everything; Up or out; Over competitiveness amongst employees/teams creates more problems instead of better solutions for clients Advice to Management Respect time off from work; Try to improve working hours; Create more opportunities for great workers to stay at a particular level, not everyone wants to rush to partner.", "rating": 5, "pros": "Challenging; Great Co-workers; Constant room for development; Promoted quickly; Good pay; Diverse experience with Systems Development Lifecycle on Enterprise System Projects; Overall very good if you are a hard worker and highly motiviated in your career.", "cons": "Work-life balance; Many co-worker prioritize work over everything; Up or out; Over competitiveness amongst employees/teams creates more problems instead of better solutions for clients", "advice": "Respect time off from work; Try to improve working hours; Create more opportunities for great workers to stay at a particular level, not everyone wants to rush to partner."}, {"title": "Technology Manager", "text": "Pros -Transparency -Upward Mobility -Flexible Work Life Balance -Transparent Communication with Leadership -It's in leadership's best interest for everyone to succeed so I always feel set up for success while still being challenged -Maternity / Paternity Benefits Cons -Some staffing situations are out of your control - Have to work on the projects leadership sells which is the same for all Consulting firms Advice to Management Keep engaging with the folks on the ground.", "rating": 5, "pros": "-Transparency", "cons": "-Some staffing situations are out of your control - Have to work on the projects leadership sells which is the same for all Consulting firms", "advice": "Keep engaging with the folks on the ground."}, {"title": "Advisory Consultant", "text": "Pros Great company! Exposure to different industries, amazing benefits, travel to different parts of the country! Exposure to upper management. Company will provide industry specific trainings! Cons None really, you know what you're getting into if you're working for Deloitte or any big 4, if you haven't done your research and think it's hard to work then you're not a good fit.", "rating": 5, "pros": "Great company! Exposure to different industries, amazing benefits, travel to different parts of the country! Exposure to upper management. Company will provide industry specific trainings!", "cons": "None really, you know what you're getting into if you're working for Deloitte or any big 4, if you haven't done your research and think it's hard to work then you're not a good fit.", "advice": null}, {"title": "Junior accountant executive", "text": "Pros Good mula and hommie i love that cozy environment. It is a cool place to build your baby career. Ez Cons Too much work. You aint have a free time when the tax season starts. There are no Ez money. 2ez", "rating": 3, "pros": "Good mula and hommie i love that cozy environment. It is a cool place to build your baby career. Ez", "cons": "Too much work. You aint have a free time when the tax season starts. There are no Ez money. 2ez", "advice": null}, {"title": "Don't come in unless you are a Manager or above.", "text": "Pros Lots of benefits to include paying for certs, well being pay, and gift cards are rewards. Cons Information regarding promotion and how pay is determined is kept hidden. Promotions are only give in August and when your raise is less than inflation they will say it is due to a level cap that doesn't exist. Also, your career is not in your nor your supervisors hands but is determined by a \"coach\" who may or may not care about you. Advice to Management Be more open about the processes and allow people to drive their own careers with this knowledge. This should be part of in processing not something an employee should find out through the grapevine.", "rating": 3, "pros": "Lots of benefits to include paying for certs, well being pay, and gift cards are rewards.", "cons": "Information regarding promotion and how pay is determined is kept hidden. Promotions are only give in August and when your raise is less than inflation they will say it is due to a level cap that doesn't exist. Also, your career is not in your nor your supervisors hands but is determined by a \"coach\" who may or may not care about you.", "advice": "Be more open about the processes and allow people to drive their own careers with this knowledge. This should be part of in processing not something an employee should find out through the grapevine."}, {"title": "Wonderufl", "text": "Pros Wonderful. What else can you say? Cons Never anything negative to say", "rating": 5, "pros": "Wonderful. What else can you say?", "cons": "Never anything negative to say", "advice": null}, {"title": "Associate Solution Advisor", "text": "Pros Good culture and environment. Work life balance is good. Cons A little bit of stress in few projects but manageable.", "rating": 5, "pros": "Good culture and environment. Work life balance is good.", "cons": "A little bit of stress in few projects but manageable.", "advice": null}, {"title": "Sr consultant", "text": "Pros good company, efficient people, calm environment Cons lack of planning, and decision making", "rating": 3, "pros": "good company, efficient people, calm environment", "cons": "lack of planning, and decision making", "advice": null}, {"title": "Senior Accountant", "text": "Pros Company charge card working for the top accounting firms Cons lengthy work days and too much work with little to no time for in between naps Advice to Management give employees a pillow and blanket during orientation", "rating": 5, "pros": "Company charge card", "cons": "lengthy work days and too much work with little to no time for in between naps", "advice": "give employees a pillow and blanket during orientation"}, {"title": "Senior Manager", "text": "Pros Great Benefits and lot to learn Cons Gets very political at high levels", "rating": 5, "pros": "Great Benefits and lot to learn", "cons": "Gets very political at high levels", "advice": null}, {"title": "Senior Consultant", "text": "Pros Good salary and perks, training opportunities Cons work life balance that too depends on project Advice to Management leadership is quite open to the feedback", "rating": 5, "pros": "Good salary and perks, training opportunities", "cons": "work life balance that too depends on project", "advice": "leadership is quite open to the feedback"}, {"title": "Great training upon which to build", "text": "Pros Great benefits for parents and families; fantastic generalist training ground; lots of very good people to learn from; generally an ethically sound place to work and be associated with. Cons No opportunity for innovation or singular thought; very difficult/impossible to get international placements; need to be willing to play the politics to get ahead", "rating": 5, "pros": "Great benefits for parents and families; fantastic generalist training ground; lots of very good people to learn from; generally an ethically sound place to work and be associated with.", "cons": "No opportunity for innovation or singular thought; very difficult/impossible to get international placements; need to be willing to play the politics to get ahead", "advice": null}, {"title": "Data Analytics Consultant", "text": "Pros 1. Challenging tasks 2. Exposures to different industries Cons 1. Aggressive people 2. Utilization focused", "rating": 3, "pros": "1. Challenging tasks", "cons": "1. Aggressive people", "advice": null}, {"title": "Overall OK experience", "text": "Pros Flexible hours; Work Life balance; different clients and different projects that provides different experiences; Able to work from home; colleagues are usually nice and intelligent people Cons LOTS OF TRAVELING; have little say for what kind of project that you get on; little career development support from the company", "rating": 3, "pros": "Flexible hours; Work Life balance; different clients and different projects that provides different experiences; Able to work from home; colleagues are usually nice and intelligent people", "cons": "LOTS OF TRAVELING; have little say for what kind of project that you get on; little career development support from the company", "advice": null}, {"title": "SAP Senior Consultant Plant Maintenance", "text": "Pros Fantastic exposure towards technology and managerial expertise for an employee. Pay is Competitive and have very good benefits as well. Cons Promotion process has become very stringent and for moving up the ladder the expectations are ever increasing. Advice to Management Dont bring too many barriers for promoting people.", "rating": 5, "pros": "Fantastic exposure towards technology and managerial expertise for an employee. Pay is Competitive and have very good benefits as well.", "cons": "Promotion process has become very stringent and for moving up the ladder the expectations are ever increasing.", "advice": "Dont bring too many barriers for promoting people."}, {"title": "Great place to start career", "text": "Pros Great place to start career Cons Not great pay, tough hours for busy season", "rating": 3, "pros": "Great place to start career", "cons": "Not great pay, tough hours for busy season", "advice": null}, {"title": "Amazing company to work for!", "text": "Pros Challenging, meaningful work, and endless opportunities for growth if you are willing to put in the effort. Deloitte definitely has great benefits too (e.g. 25 days of PTO each year, extended Holidays, top-notch family/parental leave, well-being subsidy, etc). The experience you will gain from working here will take you far in your career. Cons I guess if you don't have the kind of work ethic Deloitte expects out of its employee's, this could be a tough environment for you; otherwise, no cons I can think of.", "rating": 5, "pros": "Challenging, meaningful work, and endless opportunities for growth if you are willing to put in the effort. Deloitte definitely has great benefits too (e.g. 25 days of PTO each year, extended Holidays, top-notch family/parental leave, well-being subsidy, etc). The experience you will gain from working here will take you far in your career.", "cons": "I guess if you don't have the kind of work ethic Deloitte expects out of its employee's, this could be a tough environment for you; otherwise, no cons I can think of.", "advice": null}, {"title": "Audit Associate", "text": "Pros Great people and awesome clients to work with Cons Long hours and lower pay initially", "rating": 5, "pros": "Great people and awesome clients to work with", "cons": "Long hours and lower pay initially", "advice": null}, {"title": "Tax Senior", "text": "Pros great flexibility in terms of work location and hours of work Cons overall office morale is pretty low Advice to Management create an inclusive team environment", "rating": 3, "pros": "great flexibility in terms of work location and hours of work", "cons": "overall office morale is pretty low", "advice": "create an inclusive team environment"}, {"title": "Tax Senior", "text": "Pros great flexibility in terms of work location and hours of work Cons overall office morale is pretty low Advice to Management create an inclusive team environment", "rating": 3, "pros": "great flexibility in terms of work location and hours of work", "cons": "overall office morale is pretty low", "advice": "create an inclusive team environment"}, {"title": "DC Manager", "text": "Pros 1. Work life balance 2. Continuous learning experience 3. New challenges 4. Excellent compensation 5. Great growth opportunities Cons None to report at the moment.", "rating": 5, "pros": "1. Work life balance", "cons": "None to report at the moment.", "advice": null}, {"title": "Technology Consultant", "text": "Pros Professional development, fast-paced environment with lots of opportunities to grow Cons No work life balance, constant travel and long hours", "rating": 5, "pros": "Professional development, fast-paced environment with lots of opportunities to grow", "cons": "No work life balance, constant travel and long hours", "advice": null}, {"title": "Great firm, but is bureaucratic and more public sector-driven", "text": "Pros Great place to start your career and build networks. Cons Very bureaucratic partly because it is a huge firm. A lot of the awarded work is within the public sector, which tends to be a lot drier and less \"sexy.\" The likelihood of you being assigned a project within the public sector during your first few years at Deloitte are quite high.", "rating": 5, "pros": "Great place to start your career and build networks.", "cons": "Very bureaucratic partly because it is a huge firm. A lot of the awarded work is within the public sector, which tends to be a lot drier and less \"sexy.\" The likelihood of you being assigned a project within the public sector during your first few years at Deloitte are quite high.", "advice": null}, {"title": "Manager", "text": "Pros Pay is good, PTO is excellent Cons Working in matrix management where the managers do not understand how that works. Need to be on someone's coat tails to move up Advice to Management Get rid of ridiculous performance appraisal process, apply the processes that the C-suite promotes", "rating": 5, "pros": "Pay is good, PTO is excellent", "cons": "Working in matrix management where the managers do not understand how that works. Need to be on someone's coat tails to move up", "advice": "Get rid of ridiculous performance appraisal process, apply the processes that the C-suite promotes"}, {"title": "Overall good place to work", "text": "Pros Good training and foundation for career Cons long hours and no bonus for work", "rating": 5, "pros": "Good training and foundation for career", "cons": "long hours and no bonus for work", "advice": null}, {"title": "Good", "text": "Pros Career Growth, team work, exposure Cons Many hours of work without a good pay", "rating": 3, "pros": "Career Growth, team work, exposure", "cons": "Many hours of work without a good pay", "advice": null}, {"title": "Senior Manager", "text": "Pros PTO benefits, Bonus and 401K Cons Work life balance is not good.", "rating": 3, "pros": "PTO benefits, Bonus and 401K", "cons": "Work life balance is not good.", "advice": null}, {"title": "ok place to work", "text": "Pros Clear career path. People will notice if you are performing well. Cons Consulting work sucks. Often work the client does not want to do. Wide range of abilities of colleagues. Means a few people pull most the weight. They also get noticed and rewarded.", "rating": 3, "pros": "Clear career path. People will notice if you are performing well.", "cons": "Consulting work sucks. Often work the client does not want to do.", "advice": null}, {"title": "Consulting", "text": "Pros Management is great and extremely competent team atmosphere lives up to the company's reputation Cons You must set your own boundaries. Work will consume you if you do not do so. Advice to Management More flexibility", "rating": 5, "pros": "Management is great and extremely competent team atmosphere lives up to the company's reputation", "cons": "You must set your own boundaries. Work will consume you if you do not do so.", "advice": "More flexibility"}, {"title": "Good benefits", "text": "Pros The company provides good benefits (salary, healthcare, PTO, etc) Cons You need to find a good balance between your professional and your personal lives.", "rating": 5, "pros": "The company provides good benefits (salary, healthcare, PTO, etc)", "cons": "You need to find a good balance between your professional and your personal lives.", "advice": null}, {"title": "Audit Assistant", "text": "Pros Name value of Deloitte sure doesn't disappoint - even as a first year auditor, the learning curve is steep and you learn the ins and outs of the basic core of a business, how it runs, how it shouldn't run, and have the opportunity to interact with individuals ranging from staff accountant to corporate controller to VP of finance. For anyone with a business/economics/accounting background, this is an awesome start to your career. People on your team are extremely smart individuals who have stayed and are still employed for a reason. Granted, there may be differences of opinion and experiences depending on which client and team you are assigned to. But it really is what you make of it out of your own career, as no one is going to teach you how to steer your own ship. Fantastic experience so far, haven't stopped learning, and everyday is a challenge. Cons Nothing to complain about", "rating": 5, "pros": "Name value of Deloitte sure doesn't disappoint - even as a first year auditor, the learning curve is steep and you learn the ins and outs of the basic core of a business, how it runs, how it shouldn't run, and have the opportunity to interact with individuals ranging from staff accountant to corporate controller to VP of finance. For anyone with a business/economics/accounting background, this is an awesome start to your career. People on your team are extremely smart individuals who have stayed and are still employed for a reason. Granted, there may be differences of opinion and experiences depending on which client and team you are assigned to.", "cons": "Nothing to complain about", "advice": null}, {"title": "Stay away", "text": "Pros Part of Deloitte, which has great benefits. Cons Work environment is very disjointed. Leadership doesn’t know what they are doing. Company culture almost non-existent. Advice to Management Figure out the business strategy first before you can lead the rest of the company.", "rating": 3, "pros": "Part of Deloitte, which has great benefits.", "cons": "Work environment is very disjointed. Leadership doesn’t know what they are doing. Company culture almost non-existent.", "advice": "Figure out the business strategy first before you can lead the rest of the company."}, {"title": "What Work/Life Balance ?", "text": "Pros Good benefits as far as health insurance and Personal time off or sick days and pension for vested employees as well as professional white collar work environment. Pay is average for industry but above average if you have not worked for a professional services firm before. Cons The firm says it is big on work life balance, valuing employees and touts itself as a great place for women to work but the reality is women are not paid the same as men doing the same job, there is not work life balance, women delay having a family until after they make partner so their career is not siderailed on the professional side. They say you are valuable for ten years, then when they need to downsize, you are not valuable. Advice to Management Treat your good employees like humans and like you would want to be treated not like a perfunctory HR initiative.", "rating": 5, "pros": "Good benefits as far as health insurance and Personal time off or sick days and pension for vested employees as well as professional white collar work environment. Pay is average for industry but above average if you have not worked for a professional services firm before.", "cons": "The firm says it is big on work life balance, valuing employees and touts itself as a great place for women to work but the reality is women are not paid the same as men doing the same job, there is not work life balance, women delay having a family until after they make partner so their career is not siderailed on the professional side. They say you are valuable for ten years, then when they need to downsize, you are not valuable.", "advice": "Treat your good employees like humans and like you would want to be treated not like a perfunctory HR initiative."}, {"title": "Strong training, culture, and opportunity; mediocre pay and some mistrust", "text": "Pros The company is definitely a powerhouse and is so huge that you could literally do anything if you position yourself correctly. Things are always changing, but they do put in effort to keep the employees in the know. There are many learning opportunities and the company invests as much as you put in. The people are great - some a-type tougher personalities, but generally a really easy bunch to get along with at all levels. Cons The pay isn't anything special for the job. You'll have to work hard and long to get up to a place of feeling like you're making what you're worth. Also, management is strong but can definitely be mistrusting. Advice to Management If an employee has made it through the process to get here, trust them and give them real responsibility.", "rating": 5, "pros": "The company is definitely a powerhouse and is so huge that you could literally do anything if you position yourself correctly. Things are always changing, but they do put in effort to keep the employees in the know. There are many learning opportunities and the company invests as much as you put in. The people are great - some a-type tougher personalities, but generally a really easy bunch to get along with at all levels.", "cons": "The pay isn't anything special for the job. You'll have to work hard and long to get up to a place of feeling like you're making what you're worth. Also, management is strong but can definitely be mistrusting.", "advice": "If an employee has made it through the process to get here, trust them and give them real responsibility."}, {"title": "Deloitte hired a mediocre legal firm GGS incapable of handling critical immigration maters", "text": "Pros - Variety of projects is good - Competitive and helpful peer group Cons - For alien workers, Immigration assistance is mediocre, often laid-back and ignorant of the critical timelines. - No work life balance Advice to Management Either push immigration firm to adhere to timelines or bring an efficient firm that can handle these matters well", "rating": 3, "pros": "- Variety of projects is good", "cons": "- For alien workers, Immigration assistance is mediocre, often laid-back and ignorant of the critical timelines.", "advice": "Either push immigration firm to adhere to timelines or bring an efficient firm that can handle these matters well"}, {"title": "Tax Senior", "text": "Pros Work life balance. Fringe benefits. Coworkers. Great PTO. Cons Salary. Some long nights. Some technology could be better. Advice to Management Pay your people who are worth it more.", "rating": 5, "pros": "Work life balance.", "cons": "Salary.", "advice": "Pay your people who are worth it more."}, {"title": "Great place to work", "text": "Pros Deloitte cares about all employees and their families. I have been with the firm for almost 8 years and plan on another 8! Cons Typical consulting firm issues, size, work life balance, etc, however Deloitte has done and continues to do a great job at correcting and it really shows. Advice to Management Thank you for all that you do!", "rating": 5, "pros": "Deloitte cares about all employees and their families. I have been with the firm for almost 8 years and plan on another 8!", "cons": "Typical consulting firm issues, size, work life balance, etc, however Deloitte has done and continues to do a great job at correcting and it really shows.", "advice": "Thank you for all that you do!"}, {"title": "One of the best places to work", "text": "Pros Networking is a buzz word. People are willing to connect and share their knowledge and experiences. Perfect work/life balance! Cons Only had positive experiences during my tenure", "rating": 5, "pros": "Networking is a buzz word. People are willing to connect and share their knowledge and experiences. Perfect work/life balance!", "cons": "Only had positive experiences during my tenure", "advice": null}, {"title": "Great Place to Start Career", "text": "Pros Great Pay, great people to start career with Cons Bad 401k match policy, must report/ track all financial relationships to comply with audit side of firm even if youre not in audit", "rating": 5, "pros": "Great Pay, great people to start career with", "cons": "Bad 401k match policy, must report/ track all financial relationships to comply with audit side of firm even if youre not in audit", "advice": null}, {"title": "Great place", "text": "Pros The people are great to work with. Cons Worst 401k match i have seen. Hard to get of projects once you start. Advice to Management Need to explain to recruits that this not a traditional consultant job. This will benefit the expectations of the company and of the potencial new employees", "rating": 5, "pros": "The people are great to work with.", "cons": "Worst 401k match i have seen. Hard to get of projects once you start.", "advice": "Need to explain to recruits that this not a traditional consultant job. This will benefit the expectations of the company and of the potencial new employees"}, {"title": "Great experience", "text": "Pros Experience in both the work you do and the people you work with are second to none. Cons Long hours and demanding work.", "rating": 5, "pros": "Experience in both the work you do and the people you work with are second to none.", "cons": "Long hours and demanding work.", "advice": null}, {"title": "Review", "text": "Pros Good people to work with Cons Work a lot, pay isn't great for the work", "rating": 3, "pros": "Good people to work with", "cons": "Work a lot, pay isn't great for the work", "advice": null}, {"title": "Great place to start your career", "text": "Pros Structured career program for undergraduate hires Diverse set of clients across different industries Smart co-workers Cons Gets political the higher you get in the pyramid Talks work life balance but doesn't walk the talk Advice to Management Better structure to help people reach the more senior positions", "rating": 5, "pros": "Structured career program for undergraduate hires", "cons": "Gets political the higher you get in the pyramid", "advice": "Better structure to help people reach the more senior positions"}, {"title": "Deloitte Advisory", "text": "Pros Ability to move up is plentiful and well-defined Cons Travel, politics, project staffing is not always ideal for lower staff Advice to Management NA", "rating": 5, "pros": "Ability to move up is plentiful and well-defined", "cons": "Travel, politics, project staffing is not always ideal for lower staff", "advice": "NA"}, {"title": "Manager", "text": "Pros Career growth and colleagues are amazing Cons Path to partner or director can be daunting for some. It’s a trek but well worth it! Advice to Management Best in class", "rating": 5, "pros": "Career growth and colleagues are amazing", "cons": "Path to partner or director can be daunting for some. It’s a trek but well worth it!", "advice": "Best in class"}, {"title": "Pays below industry average", "text": "Pros Travel and frequent flyer benefits Consultants and senior consultants are fun to work with Cons Very competitive environment even among managers (No one wants to look bad and will throw you under the bus to make themselves look better.) Managers often wait until the last minute to make decisions which leads to unnecessarily stressful situations Other companies in the same industry pay much higher for less work There is almost no work-life balance", "rating": 5, "pros": "Travel and frequent flyer benefits", "cons": "Very competitive environment even among managers (No one wants to look bad and will throw you under the bus to make themselves look better.)", "advice": null}, {"title": "Audit Senior Assistant", "text": "Pros 5 weeks PTO, maternal and paternal benefits, public accounting experience, infinite resources Cons Long hours, understaffed, inconsistent schedule", "rating": 3, "pros": "5 weeks PTO, maternal and paternal benefits, public accounting experience, infinite resources", "cons": "Long hours, understaffed, inconsistent schedule", "advice": null}, {"title": "Great Jumpstart to Career", "text": "Pros Fun, young office culture. Good work-life balance. Impressive colleagues. Many diverse training opportunities. Cons Limited mobility in some cases to new projects.", "rating": 5, "pros": "Fun, young office culture. Good work-life balance. Impressive colleagues. Many diverse training opportunities.", "cons": "Limited mobility in some cases to new projects.", "advice": null}, {"title": "Audit Senior", "text": "Pros Well rounded and established company Cons not competitive salaries compared to private or other firms", "rating": 5, "pros": "Well rounded and established company", "cons": "not competitive salaries compared to private or other firms", "advice": null}, {"title": "Audit Senior", "text": "Pros Well rounded and established company Cons not competitive salaries compared to private or other firms", "rating": 5, "pros": "Well rounded and established company", "cons": "not competitive salaries compared to private or other firms", "advice": null}, {"title": "Lot of opportunities if you know the right people", "text": "Pros good compensation at the bottom and top levels Cons If you know the right partner/director then you are favored over someone doing better client work Need to network into any decent role moderate compensation at the middle levels", "rating": 5, "pros": "good compensation at the bottom and top levels", "cons": "If you know the right partner/director then you are favored over someone doing better client work", "advice": null}, {"title": "Senior Analyst", "text": "Pros Good working environment. Work life balance tends to lean towards the “work” side very often. Found myself taking a lot of work home with me. Salary & benefits are top of the line. Cons No close contact to management. There is also very little you can do to get a promotion unless your clients refer to you as a god. Advice to Management Work with your new hires more. Convey to them your expectations and how to manage work load in a clear fashion.", "rating": 5, "pros": "Good working environment. Work life balance tends to lean towards the “work” side very often. Found myself taking a lot of work home with me.", "cons": "No close contact to management. There is also very little you can do to get a promotion unless your clients refer to you as a god.", "advice": "Work with your new hires more. Convey to them your expectations and how to manage work load in a clear fashion."}, {"title": "Great company, with great people and benefits. A lot of hard work, but the Company rewards their people well.", "text": "Pros -Working with smart, motivated people -Variety in content of work depending on your service line -Dynamic work environment -Strong investment in people and resources for people by leadership Cons -work life balance is challenging in the client service profession -at times, a high stress environment Other than those two items, no major cons", "rating": 5, "pros": "-Working with smart, motivated people", "cons": "-work life balance is challenging in the client service profession", "advice": null}, {"title": "Great culture!", "text": "Pros Great learning opportunities and friendly people who have a great work-life balance. To me, this is the best place to jump start one's career because you get exposed to different types of projects right from the beginning. Cons Depending on which office you are in, you may feel differently about how much attention you get. I'm in a smaller office so I feel as though I've had a lot of career support. It might be different at a bigger office.", "rating": 5, "pros": "Great learning opportunities and friendly people who have a great work-life balance. To me, this is the best place to jump start one's career because you get exposed to different types of projects right from the beginning.", "cons": "Depending on which office you are in, you may feel differently about how much attention you get. I'm in a smaller office so I feel as though I've had a lot of career support. It might be different at a bigger office.", "advice": null}, {"title": "10 Year Program Manager", "text": "Pros Excellent working environment, strong values from staff, middle management, and executive leadership. Cons Large partnership makes getting work done internal to firm a difficult task. Advice to Management Continue to drive transformational change -- vision is correct, drive analytics, automation, standardized processes to achieve higher value for clients.", "rating": 5, "pros": "Excellent working environment, strong values from staff, middle management, and executive leadership.", "cons": "Large partnership makes getting work done internal to firm a difficult task.", "advice": "Continue to drive transformational change -- vision is correct, drive analytics, automation, standardized processes to achieve higher value for clients."}, {"title": "Slickly managed reputation; reality much grimmer...", "text": "Pros Since it's the world's largest services firm, you'll find lots of colleagues and there will be many you like. The firm clearly cares about its reputation--here on Glassdoor, and everywhere else--so it does all the surface stuff to be well regarded. Cons NOT a firm of ideas. Never knows the difference between a good idea and a bad one; an old one and a new one; a valid one and a phony one. Impossible to find actual scholars at this firm. ENTIRELY a sales culture. That's what is prized here: selling multi-million dollar engagements, then delivering months or years of ordinary implementation work. Separately, it is a DO BE culture... Everyone is expected to be polite, enthusiastic, and to evidence a can-do attitude, even when they are being asked to do dumb stuff. This makes it very hard to be constructively critical in any way that leads to growth. Advice to Management Try humility. Since the firm is so large, it confuses its scale with actual skill. It also assumes it got so large by being smart. Instead, it simply was the ONLY audit firm that in the post-Enron period that kept its consulting arm. This allowed them to swiftly be bigger than both the biggest consulting firms AND the biggest audit firms. Yet the decision to maintain their consulting arm was not made out of bravery or brilliance--all the partners at the time simply refused to contribute the money needed to split the firm up. So they're lucky, not smart. Now they delude themselves into thinking they are brilliant. Given their extraordinary lack of intellectual curiosity and depth, this is kind of unbearable if you want to be in a thoughtful firm.", "rating": 1, "pros": "Since it's the world's largest services firm, you'll find lots of colleagues and there will be many you like.", "cons": "NOT a firm of ideas. Never knows the difference between a good idea and a bad one; an old one and a new one; a valid one and a phony one. Impossible to find actual scholars at this firm.", "advice": "Try humility. Since the firm is so large, it confuses its scale with actual skill. It also assumes it got so large by being smart. Instead, it simply was the ONLY audit firm that in the post-Enron period that kept its consulting arm. This allowed them to swiftly be bigger than both the biggest consulting firms AND the biggest audit firms. Yet the decision to maintain their consulting arm was not made out of bravery or brilliance--all the partners at the time simply refused to contribute the money needed to split the firm up."}, {"title": "Sr Manager", "text": "Pros great learning environment, lot of opportunities Cons You are on your own, and you can forget family life", "rating": 5, "pros": "great learning environment, lot of opportunities", "cons": "You are on your own, and you can forget family life", "advice": null}, {"title": "Advisory Consultant", "text": "Pros Decent pay out of college Young environment Cons Your experience will depend heavily on what team you land on", "rating": 5, "pros": "Decent pay out of college", "cons": "Your experience will depend heavily on what team you land on", "advice": null}, {"title": "Great company with a few catches", "text": "Pros High caliber of talent Fortune 500 clients Growth opportunities Learning opportunies Cons Travel 80-100% Required 'firm building\" work - internal support activities such as white papers - expected on top of client work that is used as differentiator in performance rating If you find a good network, staffing is easier but you will have a hard time if you don't get into a good network of Sr. Mgrs or Partners Advice to Management Make more effort with working mothers, support during personal life times of transition", "rating": 5, "pros": "High caliber of talent", "cons": "Travel 80-100%", "advice": "Make more effort with working mothers, support during personal life times of transition"}, {"title": "Senior Consultant", "text": "Pros Start class and onboarding program, diversity Cons Manipulative senior leadership, no respect for work-life balance, everyone gets promoted on the same timeline regardless of performance (no incentive to do well), terrible performance review process Advice to Management Identify and get rid off the senior partners / managers that treat people terribly and would make lots of women at the firm say #metoo.", "rating": 1, "pros": "Start class and onboarding program, diversity", "cons": "Manipulative senior leadership, no respect for work-life balance, everyone gets promoted on the same timeline regardless of performance (no incentive to do well), terrible performance review process", "advice": "Identify and get rid off the senior partners / managers that treat people terribly and would make lots of women at the firm say #metoo."}, {"title": "Excellent place to start your career", "text": "Pros Flexible environment along with caring teams Cons Only some will be given awards.", "rating": 5, "pros": "Flexible environment along with caring teams", "cons": "Only some will be given awards.", "advice": null}, {"title": "Great place, even better people", "text": "Pros Awesome people to work with. Management will push you to perform but is approachable if you need a resource. The opportunity to work with some of the brightest people. Cons Pressure to stay within budget. Routine work. Advice to Management N/A", "rating": 5, "pros": "Awesome people to work with. Management will push you to perform but is approachable if you need a resource. The opportunity to work with some of the brightest people.", "cons": "Pressure to stay within budget. Routine work.", "advice": "N/A"}, {"title": "Deloitte", "text": "Pros A good place to work Cons Needs constant networking for progression", "rating": 5, "pros": "A good place to work", "cons": "Needs constant networking for progression", "advice": null}, {"title": "Sr. Administrative Assistant", "text": "Pros Great benefits, snacks, & decent pay Cons No performance evaluation, no goal setting, no growth, administrative managers do nothing, Advice to Management Get rid of the administrative managers, figure out the strengths of team members", "rating": 3, "pros": "Great benefits, snacks, & decent pay", "cons": "No performance evaluation, no goal setting, no growth, administrative managers do nothing,", "advice": "Get rid of the administrative managers, figure out the strengths of team members"}, {"title": "Senior Auditor", "text": "Pros Great people, learned a lot, well prepared for my next job. Cons Long hours, sometimes work is tedious. Advice to Management Try to staff people on jobs near their homes.", "rating": 5, "pros": "Great people, learned a lot, well prepared for my next job.", "cons": "Long hours, sometimes work is tedious.", "advice": "Try to staff people on jobs near their homes."}, {"title": "IT Consultant - UNIX Admin", "text": "Pros Year end bonuses, holiday perks, and employee appreciation gifts. SUPERB Military appreciation and benefits. Cons If you’re a full time contractor you’ll be stuck getting paid less than what you’re worth until the end of their fiscal year where they’ll review how much more you should be paid. From my experience there was no negotiation, my salary fate was to be decided by my team lead and project manager. When they do finally decide on your new salary you won’t get paid the new amount until the new compensation statements are published. The new compensation statements are usually published toward the end of the summer. Do the math on how much you’ll miss out on if you’re promoted right after a new compensation statement was just published. The benefits are great but there are companies that can do you better. The team I worked with was phenomenal and that was the reason I stayed as long as I did but never again. Advice to Management In regards to government contractors treat them more fairly compensation-wise.", "rating": 5, "pros": "Year end bonuses, holiday perks, and employee appreciation gifts. SUPERB Military appreciation and benefits.", "cons": "If you’re a full time contractor you’ll be stuck getting paid less than what you’re worth until the end of their fiscal year where they’ll review how much more you should be paid. From my experience there was no negotiation, my salary fate was to be decided by my team lead and project manager. When they do finally decide on your new salary you won’t get paid the new amount until the new compensation statements are published. The new compensation statements are usually published toward the end of the summer. Do the math on how much you’ll miss out on if you’re promoted right after a new compensation statement was just published. The benefits are great but there are companies that can do you better. The team I worked with was phenomenal and that was the reason I stayed as long as I did but never again.", "advice": "In regards to government contractors treat them more fairly compensation-wise."}, {"title": "Technical Consultant", "text": "Pros Great place, great people & great culture Cons Apart from your performance, the career growth depends a lot on how well you build your network in the company. Network is something one will always here!", "rating": 5, "pros": "Great place, great people & great culture", "cons": "Apart from your performance, the career growth depends a lot on how well you build your network in the company. Network is something one will always here!", "advice": null}, {"title": "Business Technology Analyst / Data Analyst", "text": "Pros Culture,People ,Network , Awesome life Cons Nothing specific to be told", "rating": 5, "pros": "Culture,People ,Network , Awesome life", "cons": "Nothing specific to be told", "advice": null}, {"title": "Great employer if you have an entrepreneurial mind", "text": "Pros Leadership talks the talk and walks the walk Great autonomy given to all employees Very flat \"hierarchy\". Employees are empowered Assumes employees are professionals and will know how to do the right thing Great focus on work life balance and benefits Cons Can sometimes feel like an \"old boys club\" Getting big fast, needs to keep its focus on its employees", "rating": 5, "pros": "Leadership talks the talk and walks the walk", "cons": "Can sometimes feel like an \"old boys club\"", "advice": null}, {"title": "Consultant - Project Controller", "text": "Pros High level of access to executive management. Cons The role's administrative duties are abundant. Advice to Management Consolidate role around technology, increase pay, merge with greater consulting practice.", "rating": 5, "pros": "High level of access to executive management.", "cons": "The role's administrative duties are abundant.", "advice": "Consolidate role around technology, increase pay, merge with greater consulting practice."}, {"title": "NIce Company", "text": "Pros the company is very nice. No issues. Many events. Employee Satisfaction. Cons NO free food. Needs lot of travelling. Advice to Management The company is awesome. Great work. WOuld love to work again", "rating": 5, "pros": "the company is very nice. No issues. Many events. Employee Satisfaction.", "cons": "NO free food. Needs lot of travelling.", "advice": "The company is awesome. Great work. WOuld love to work again"}, {"title": "Great First Job", "text": "Pros Alt Travel and the BA/C community Cons High utilization req and ridiculously poor talent review process Advice to Management Re-Reinvent Talent Management", "rating": 5, "pros": "Alt Travel and the BA/C community", "cons": "High utilization req and ridiculously poor talent review process", "advice": "Re-Reinvent Talent Management"}, {"title": "Analyst", "text": "Pros Smart and hard working team Cons Lack of transparency across company Advice to Management NA", "rating": 5, "pros": "Smart and hard working team", "cons": "Lack of transparency across company", "advice": "NA"}, {"title": "Stressfull", "text": "Pros There are lots of opportunities to learn and can be a pleasant experience if you are lucky enough to be on a good team. Cons The environment can be very stressful and supervisors unsupportive, I had just one excellent supervisor and that person was let go, while all the other stressful supervisors stay around.", "rating": 1, "pros": "There are lots of opportunities to learn and can be a pleasant experience if you are lucky enough to be on a good team.", "cons": "The environment can be very stressful and supervisors unsupportive, I had just one excellent supervisor and that person was let go, while all the other stressful supervisors stay around.", "advice": null}, {"title": "You’re just a number here, and no amount of work is ever enough", "text": "Pros High salary, travel points, and variety of work. Great benefits and digital ways of working, always have the latest tools. Cons You don’t have work-life balance, and it’s tough to find a group of consistent people who care about your career path and well-being Advice to Management Stop over promising to clients", "rating": 3, "pros": "High salary, travel points, and variety of work. Great benefits and digital ways of working, always have the latest tools.", "cons": "You don’t have work-life balance, and it’s tough to find a group of consistent people who care about your career path and well-being", "advice": "Stop over promising to clients"}, {"title": "Deloitte US", "text": "Pros Excellent firm with outstanding leaders Cons Usual challenges that come with a Big4 firm. If you are ready for those, then there are no cons. :)", "rating": 5, "pros": "Excellent firm with outstanding leaders", "cons": "Usual challenges that come with a Big4 firm. If you are ready for those, then there are no cons. :)", "advice": null}, {"title": "Federal Technology Consultant", "text": "Pros - Worklife balance (most government clients allow only 40-45 hrs/week) - Great people and culture - Benefits: paid lunches, paid happy hours, paid late night Ubers, pre-tax transportation, 401k match, parental leave - Deloitte University is a top-notch training facility Cons - Internal firm initiatives are required - Year-end review is all about who knows you, rather than your performance", "rating": 5, "pros": "- Worklife balance (most government clients allow only 40-45 hrs/week)", "cons": "- Internal firm initiatives are required", "advice": null}, {"title": "Cutting edge, great benefits, no work-life balance", "text": "Pros Working with Deloitte Digital, you are always at the forefront of technology, digital, IoT and analytics. Good pay and great benefits, amazing people. Great opportunities if you're the type to go after them. Cons Work-life balance is a huge problem. Leadership is trying to make it better, but projects are always understaffed to lower costs and the team has to make up for it. Advice to Management Get more involved with training and coaching, find a way to make work hours more reasonable for technology projects", "rating": 5, "pros": "Working with Deloitte Digital, you are always at the forefront of technology, digital, IoT and analytics. Good pay and great benefits, amazing people. Great opportunities if you're the type to go after them.", "cons": "Work-life balance is a huge problem. Leadership is trying to make it better, but projects are always understaffed to lower costs and the team has to make up for it.", "advice": "Get more involved with training and coaching, find a way to make work hours more reasonable for technology projects"}, {"title": "Good but Demanding", "text": "Pros Great learning opportunity Visibility to partners and senior management Fun place to be at on Fridays Amazing perks Cons Long hours Lots of travel if you are not into it", "rating": 5, "pros": "Great learning opportunity", "cons": "Long hours", "advice": null}, {"title": "Not bad", "text": "Pros Good diversity of work, good people Cons Pay could be better, long hours", "rating": 5, "pros": "Good diversity of work, good people", "cons": "Pay could be better, long hours", "advice": null}, {"title": "Advisory Consultant", "text": "Pros Deloitte really takes care of their employees and depending on which team you are in, they take extra steps to making you feel part of the company. I got to work on different great clients. Big learning curve. Great University & training Cons I was always expected to spend 9-10 hours a day working, even if I didn't have work to do or we were waiting for stuff from the client. I didn't like the work I was doing because Accounting just isn't for me. Advice to Management My manager was amazing and made sure to build relationships with every team member. However, getting staffed on clients year round is hard if your or another manager does not free up you calendar", "rating": 5, "pros": "Deloitte really takes care of their employees and depending on which team you are in, they take extra steps to making you feel part of the company. I got to work on different great clients. Big learning curve. Great University & training", "cons": "I was always expected to spend 9-10 hours a day working, even if I didn't have work to do or we were waiting for stuff from the client. I didn't like the work I was doing because Accounting just isn't for me.", "advice": "My manager was amazing and made sure to build relationships with every team member. However, getting staffed on clients year round is hard if your or another manager does not free up you calendar"}, {"title": "Great brand with limited follow through", "text": "Pros Great brand name in consulting industry Campus reputation at the top of the big 4 Diverse set of services-based opportunities Exit options are solid Cons Losing share in consulting while rapidly trying to transform go to market strategy Low morale because profitability issues and mix of work changing Culture of favoritism and emphasis on internal office projects vs. client service Partner track opportunities quickly dissolving with margin dilution Inferiority complex vs top tier strategy shops Persistent losses on global opportunities vs. lower tier firms Performance management system (irpm) flawed Stuck in the 90’s mind set. 7 day work weeks with travel Advice to Management See above", "rating": 3, "pros": "Great brand name in consulting industry", "cons": "Losing share in consulting while rapidly trying to transform go to market strategy", "advice": "See above"}, {"title": "Tax Consultant I and II", "text": "Pros Great place to start a career Cons Different teams have different busy seasons. If you get on a team that has the most you will still be getting the same pay as one that doesnt work as much. Vice versa if you are on a team that doesnt work as much you could be penalized for doing your job that just doesnt have as many hours as someone less competent on the large teams", "rating": 5, "pros": "Great place to start a career", "cons": "Different teams have different busy seasons. If you get on a team that has the most you will still be getting the same pay as one that doesnt work as much. Vice versa if you are on a team that doesnt work as much you could be penalized for doing your job that just doesnt have as many hours as someone less competent on the large teams", "advice": null}, {"title": "Work Environment", "text": "Pros Great place to work for in regards to learning opportunities. It also offers great family leave program. Cons Hours can get very long, especially during busy season", "rating": 5, "pros": "Great place to work for in regards to learning opportunities. It also offers great family leave program.", "cons": "Hours can get very long, especially during busy season", "advice": null}, {"title": "Salesforce Practice Sr Consultant", "text": "Pros Leading edge work in Enterprise Consulting Space. SF practice is growing, so plenty of project opportunities. Also a good partnership with SF helps, stay up to date with the latest innovations in SF Cons Non existent bench makes staffing and ramping up difficult on projects. Salary hike per year is pathetic. Firm has no retention strategy. Work life balance is non-existent Advice to Management Need higher pay. Need work-life balance. Need better recruitment ans staffing policy", "rating": 3, "pros": "Leading edge work in Enterprise Consulting Space. SF practice is growing, so plenty of project opportunities. Also a good partnership with SF helps, stay up to date with the latest innovations in SF", "cons": "Non existent bench makes staffing and ramping up difficult on projects. Salary hike per year is pathetic. Firm has no retention strategy. Work life balance is non-existent", "advice": "Need higher pay. Need work-life balance. Need better recruitment ans staffing policy"}, {"title": "consulting Intern", "text": "Pros Great company. Lots of opportunity, Strong leadership Cons Just a number for many years before you can become somebody that makes executive decisions", "rating": 5, "pros": "Great company. Lots of opportunity, Strong leadership", "cons": "Just a number for many years before you can become somebody that makes executive decisions", "advice": null}, {"title": "GREAT!", "text": "Pros people were awesome and great community Cons no major cons that need to be talked abotu", "rating": 5, "pros": "people were awesome and great community", "cons": "no major cons that need to be talked abotu", "advice": null}, {"title": "Senior Consultant", "text": "Pros Compensation and perks. Available career opportunities but lacked many top tier clients within advisory Cons Taking leave of absence will jeopardize your career. This company does not live up to their culture and what they say. Management will easily let you go if you take a temporary leave.", "rating": 1, "pros": "Compensation and perks. Available career opportunities but lacked many top tier clients within advisory", "cons": "Taking leave of absence will jeopardize your career. This company does not live up to their culture and what they say. Management will easily let you go if you take a temporary leave.", "advice": null}, {"title": "Path to partner is all-consuming", "text": "Pros Great benefits, good variety of work, diverse colleagues and leaders Cons Pay is below market until you make partner. The career path to partnership is all-consuming for many colleagues, meaning competition rather than collaboration are more strongly valued. Strong sales culture, so everyone is selling, selling, selling, sometimes disadvantaging delivery scope/timelines. Delivery talent much less valued than sales. Advice to Management Allow a greater share of profits to trickle down to non-partners in the form of competitive compensation.", "rating": 3, "pros": "Great benefits, good variety of work, diverse colleagues and leaders", "cons": "Pay is below market until you make partner. The career path to partnership is all-consuming for many colleagues, meaning competition rather than collaboration are more strongly valued. Strong sales culture, so everyone is selling, selling, selling, sometimes disadvantaging delivery scope/timelines. Delivery talent much less valued than sales.", "advice": "Allow a greater share of profits to trickle down to non-partners in the form of competitive compensation."}, {"title": "You need to work here", "text": "Pros Professionals who are highly intelligent and possess exceptional integrity. Cons The workload was high and led to burnout.", "rating": 5, "pros": "Professionals who are highly intelligent and possess exceptional integrity.", "cons": "The workload was high and led to burnout.", "advice": null}, {"title": "Best place for your career growth", "text": "Pros Excellent environment and many opportunities for leaning and growth, constant training to keep the employees' skill relevant. Opportunity to move and work in different departments and/or location, including overseas. The new office location is very inspiring with full of new technologies at all level, kitchen every where and Bistro/Starbuck exclusive for Employees. Good benefits and flexibility to work away from the office Cons Depending on the role and area of expertise, you may be required to work long hours during busy season. Work-life-balance may not always be feasible especially when you have kids.", "rating": 5, "pros": "Excellent environment and many opportunities for leaning and growth, constant training to keep the employees' skill relevant. Opportunity to move and work in different departments and/or location, including overseas. The new office location is very inspiring with full of new technologies at all level, kitchen every where and Bistro/Starbuck exclusive for Employees.", "cons": "Depending on the role and area of expertise, you may be required to work long hours during busy season.", "advice": null}, {"title": "Meh", "text": "Pros There are a lot of opportunities to grow at Deloitte and they do compensate well. Cons Project dependent there are always those people that do not work and fly under the radar. Management only cares about themselves and not necessarily your work load or work life balance. Office politics are obviously always at play. Advice to Management acknowledge complaints. If someone is frustrated to the point of bringing a complaint to you there is usually a legitimate reason.", "rating": 3, "pros": "There are a lot of opportunities to grow at Deloitte and they do compensate well.", "cons": "Project dependent there are always those people that do not work and fly under the radar. Management only cares about themselves and not necessarily your work load or work life balance. Office politics are obviously always at play.", "advice": "acknowledge complaints. If someone is frustrated to the point of bringing a complaint to you there is usually a legitimate reason."}, {"title": "Great Initial Pay and Great New Hires", "text": "Pros Great pay, great flexibility, personable new hires, strong and supportive alumni base. Cons Promotions take a minimum of 2-3 years regardless of performance. I purposely left out my \"Consultant\" title on emails so superiors wouldn't judge me based on my title and judge me based on the quality of my work. Within a year I was then placed in Senior Consultant/Manager roles. However, I was receiving the same pay as a Consultant because of the promotion terms. Advice to Management If you make someone act as a Senior Consultant or Manager... Pay them like one.", "rating": 5, "pros": "Great pay, great flexibility, personable new hires, strong and supportive alumni base.", "cons": "Promotions take a minimum of 2-3 years regardless of performance. I purposely left out my \"Consultant\" title on emails so superiors wouldn't judge me based on my title and judge me based on the quality of my work. Within a year I was then placed in Senior Consultant/Manager roles. However, I was receiving the same pay as a Consultant because of the promotion terms.", "advice": "If you make someone act as a Senior Consultant or Manager... Pay them like one."}, {"title": "Nice people and culture", "text": "Pros Great people to work with. Cons Lot of office politics and favoritism", "rating": 5, "pros": "Great people to work with.", "cons": "Lot of office politics and favoritism", "advice": null}, {"title": "Good First Job", "text": "Pros A lot of resources to leverage Cons Brutal structure focused on who you know, instead of your work product.", "rating": 3, "pros": "A lot of resources to leverage", "cons": "Brutal structure focused on who you know, instead of your work product.", "advice": null}, {"title": "First Job out of college - Great Opportunity", "text": "Pros Excellent learning environment, loved my team (but we were smaller in comparison to some of the larger Deloitte divisions), and offered a plethora of opportunities for continuing your education. It was the perfect start to my career Cons Poor compensation compared to other engineering consultant employment opportunities and the work environment can be very competitive, driving competition between teammate, which made busy season a very difficult and upsetting time Advice to Management Respect all factors of Deloitte's business - just because one division doesn't generate the same revenue as another, doesn't mean the employees aren't working just as hard", "rating": 5, "pros": "Excellent learning environment, loved my team (but we were smaller in comparison to some of the larger Deloitte divisions), and offered a plethora of opportunities for continuing your education. It was the perfect start to my career", "cons": "Poor compensation compared to other engineering consultant employment opportunities and the work environment can be very competitive, driving competition between teammate, which made busy season a very difficult and upsetting time", "advice": "Respect all factors of Deloitte's business - just because one division doesn't generate the same revenue as another, doesn't mean the employees aren't working just as hard"}, {"title": "Best Organisation to Work For", "text": "Pros Work Life Balance Loads of Learning Best Peers Cons Slow Growth Ladder More Micro Management", "rating": 5, "pros": "Work Life Balance", "cons": "Slow Growth Ladder", "advice": null}, {"title": "Great Company", "text": "Pros 1. Excellent people 2. Great Team Dynamics Cons 1. Too rigid in the projects you get", "rating": 5, "pros": "1. Excellent people", "cons": "1. Too rigid in the projects you get", "advice": null}, {"title": "Great if you're in it for the long haul", "text": "Pros Good benefits, lots of resources availible Cons Very hard to find resources to get training's, salaries not as big as smaller firms, definitely a fratty culture with obvious nepotism in places", "rating": 3, "pros": "Good benefits, lots of resources availible", "cons": "Very hard to find resources to get training's, salaries not as big as smaller firms, definitely a fratty culture with obvious nepotism in places", "advice": null}, {"title": "Great Experience", "text": "Pros -Willing to help out Cons -Often times didn't have work to do Advice to Management -Be more orgnaized", "rating": 5, "pros": "-Willing to help out", "cons": "-Often times didn't have work to do", "advice": "-Be more orgnaized"}, {"title": "Tax Consultant", "text": "Pros Great company to start a career and very competitive Cons It is demanding and fast pace which is not for everyone", "rating": 5, "pros": "Great company to start a career and very competitive", "cons": "It is demanding and fast pace which is not for everyone", "advice": null}, {"title": "Good learning, bad impact", "text": "Pros Great learning opportunities and mentorship Cons Client work is often ignored by clients", "rating": 5, "pros": "Great learning opportunities and mentorship", "cons": "Client work is often ignored by clients", "advice": null}, {"title": "Deloitte Audit Senior Associate", "text": "Pros Great learning experience, constant growth opportunity, challenges you to develop as a professional, the company is invested in developing employees (trainings are offered throughout the year), opportunity for promotion each year Cons Promotion and salary increase is very political. if you are not a top performer or not a favorite good luck getting recognized", "rating": 3, "pros": "Great learning experience, constant growth opportunity, challenges you to develop as a professional, the company is invested in developing employees (trainings are offered throughout the year), opportunity for promotion each year", "cons": "Promotion and salary increase is very political. if you are not a top performer or not a favorite good luck getting recognized", "advice": null}, {"title": "Tax Associate", "text": "Pros A lot of opportunities. Work with different member firms and service lines. Cons Work load is too intensive Advice to Management Hire more people", "rating": 5, "pros": "A lot of opportunities. Work with different member firms and service lines.", "cons": "Work load is too intensive", "advice": "Hire more people"}, {"title": "Accounting Intern", "text": "Pros Great people at all levels and divisions. Many Experiences Cons hard to relocate to a different office Advice to Management N?A", "rating": 5, "pros": "Great people at all levels and divisions. Many Experiences", "cons": "hard to relocate to a different office", "advice": "N?A"}, {"title": "selected bad review of one organization - not reflective of firm as a whole! Deloitte is a great company to work for!!!", "text": "Pros Most of the people are amazing, smart, talented, and team workers. The firm provides pension - something so few do these days. They have long extended leave for taking care of a new baby or family member in need of care....amazingly long leave for this!!! Very thoughtful. NEARLY all the very high leaders are exceptional, in fact, corporate-wide - we have exceptional national leaders!!!!! Within Services, in some cases - the trend of horrible bosses with visual favoritism of just one or two individuals continues - especially in the Federal space. This is NOT the norm within Deloitte as a whole. This company is wonderful and offers for some, an opportunity for growth. In Services, this is not the case, in fact the MD says continually that you will not become a Sr. Manager, or above - might as well look elsewhere in Deloitte. Benefits are great, although we have increasing (as expected) cost each year for health benefits, and less is covered by health care each year. This is not the firm's fault - it is the expense of having insurance. Cons Millennials are favored over all others!!!! So if you are a job-hopping millennial, this is the place for you. If you are from any other generation, you will take a back seat, although your insight is respected. Extreme work hours, very low to no raises or bonuses on services side of business with extreme favoritism of one or two individuals over others that work tremendously hard throughout the year. MD who actually will not or does not speak to those in his organization as they are beneath his stature (not a PPMD). If you want to get out of services - it is next to impossible without a good contact at a higher level....in our organization, our MD wouldn't be bothered with your career if you are not a 'favorite' Advice to Management Read the Talent reviews - these are not one-0ff situations within this particular group - in fact, the MD has not posted or shared the last one or two Talent review results, since the one prior had lots of derogatory comments about his management (or lack thereof) style. He chose to ignore the results (with the exception of holding meetings - where he wasn't in attendance to fix this- no fixes resulted)!!!!", "rating": 5, "pros": "Most of the people are amazing, smart, talented, and team workers. The firm provides pension - something so few do these days. They have long extended leave for taking care of a new baby or family member in need of care....amazingly long leave for this!!! Very thoughtful. NEARLY all the very high leaders are exceptional, in fact, corporate-wide - we have exceptional national leaders!!!!!", "cons": "Millennials are favored over all others!!!! So if you are a job-hopping millennial, this is the place for you. If you are from any other generation, you will take a back seat, although your insight is respected.", "advice": "Read the Talent reviews - these are not one-0ff situations within this particular group - in fact, the MD has not posted or shared the last one or two Talent review results, since the one prior had lots of derogatory comments about his management (or lack thereof) style. He chose to ignore the results (with the exception of holding meetings - where he wasn't in attendance to fix this- no fixes resulted)!!!!"}, {"title": "Senior Consultant", "text": "Pros Great professional growth, plenty of opportunities to learn new tools and technologies, it is perfect if you are willing to invest a lot of time in your career advancement Cons Poor work-life balance, lots of traveling, extremely high expectation of hours you should work on a week. Standard project hours is 45 and on top of that you are expected to contribute 10-15 hrs a week to internal initiatives.", "rating": 5, "pros": "Great professional growth, plenty of opportunities to learn new tools and technologies, it is perfect if you are willing to invest a lot of time in your career advancement", "cons": "Poor work-life balance, lots of traveling, extremely high expectation of hours you should work on a week. Standard project hours is 45 and on top of that you are expected to contribute 10-15 hrs a week to internal initiatives.", "advice": null}, {"title": "Supportive and ethical", "text": "Pros Generally supportive and ethical people Cons Boring projects and poor work-life balance", "rating": 5, "pros": "Generally supportive and ethical people", "cons": "Boring projects and poor work-life balance", "advice": null}, {"title": "Great Benefits", "text": "Pros Best benefits I've ever had Cons Can be political at times", "rating": 5, "pros": "Best benefits I've ever had", "cons": "Can be political at times", "advice": null}, {"title": "Great Place to Start Your Career", "text": "Pros Collaboration with extremely bright, driven and talented people Potential to acquire a lot of experience quickly because of rotation to multiple projects Excellent development and mentorship of entry level employees (Analysts) Cons Work/life balance is difficult to maintain, especially when trying to start a family, and particularly difficult on women To be staffed on challenging and interesting projects there are many times that who you know is more important than your capabilities Employee review process not transparent enough Advice to Management Be more proactive in addressing work life balance concerns for employees, which can help reduce employee turnover due to family reasons Employee rating and compensation approaches need more transparency", "rating": 3, "pros": "Collaboration with extremely bright, driven and talented people", "cons": "Work/life balance is difficult to maintain, especially when trying to start a family, and particularly difficult on women", "advice": "Be more proactive in addressing work life balance concerns for employees, which can help reduce employee turnover due to family reasons"}, {"title": "Deloitte IT", "text": "Pros Good place to work, always growing and fasted paced. The latest technology and great benefits. Cons Working for the company was an awesome experience but I would say management Advice to Management I have no advice for management", "rating": 5, "pros": "Good place to work, always growing and fasted paced. The latest technology and great benefits.", "cons": "Working for the company was an awesome experience but I would say management", "advice": "I have no advice for management"}, {"title": "Consultant", "text": "Pros Deloitte offers a wide range of opportunities in many fields of interest which allows employees the to experience all aspects of what Deloitte has to offer. Cons As a large company, it could be hard to develop the \"out-front\" experience one would hope to obtain.", "rating": 5, "pros": "Deloitte offers a wide range of opportunities in many fields of interest which allows employees the to experience all aspects of what Deloitte has to offer.", "cons": "As a large company, it could be hard to develop the \"out-front\" experience one would hope to obtain.", "advice": null}, {"title": "Consultant", "text": "Pros A significant amount of paid time off and vacation. Cons Work-life balance is not very good.", "rating": 3, "pros": "A significant amount of paid time off and vacation.", "cons": "Work-life balance is not very good.", "advice": null}, {"title": "Best career opportunity in a lifetime.", "text": "Pros Working with some of the smartest people in the industry - you learn a lot! Cons The size of the firm has made it more bureaucratic and political. Advice to Management Keep investing in top talent and opportunities for growth.", "rating": 5, "pros": "Working with some of the smartest people in the industry - you learn a lot!", "cons": "The size of the firm has made it more bureaucratic and political.", "advice": "Keep investing in top talent and opportunities for growth."}, {"title": "Strategy & Operations", "text": "Pros Leader in health care consulting, significant investment in personal and professional development Cons Difficult lifestyle to sustain for long term", "rating": 5, "pros": "Leader in health care consulting, significant investment in personal and professional development", "cons": "Difficult lifestyle to sustain for long term", "advice": null}, {"title": "Salesforce Developer", "text": "Pros You will learn things .Good team Cons Bad Salary ! More like a cheap labour program ! Got 1200 $ for promotion (Felt like part of deloitte slave program) Advice to Management Do some research on salary levels for salesforce", "rating": 3, "pros": "You will learn things .Good team", "cons": "Bad Salary !", "advice": "Do some research on salary levels for salesforce"}, {"title": "Tech Consultant", "text": "Pros Great place to start your career. Amazing and smart people focused on growing others. Lots of opportunities for personal growth Great Experience Cons Work Life Balance varies from project to project, have personally experienced less than satisfactory", "rating": 5, "pros": "Great place to start your career. Amazing and smart people focused on growing others.", "cons": "Work Life Balance varies from project to project, have personally experienced less than satisfactory", "advice": null}, {"title": "Working at Deloitte for your first job", "text": "Pros Experienced and professional company with excellent staff. They make an effort to teach you and offer you opportunities to try new things. Cons Such a big company can lead to you not understanding how your fitting into the whole. A lot of \"red tape\" around your work. Advice to Management Help young employees see where they can go in the company and how they are affecting the operations so they feel important.", "rating": 5, "pros": "Experienced and professional company with excellent staff. They make an effort to teach you and offer you opportunities to try new things.", "cons": "Such a big company can lead to you not understanding how your fitting into the whole. A lot of \"red tape\" around your work.", "advice": "Help young employees see where they can go in the company and how they are affecting the operations so they feel important."}, {"title": "Work-life balance claims are disingenuous", "text": "Pros PTO Medical/dental/vision benefits Pension Generous travel allowance (stayed at the Ritz Carlton on the regular) Cons PTO (I'll explain below) Work-life balance Up-or-out culture You do indeed get a lot of PTO, however, that PTO counts against you because it hits the main metric that is your everything statistic which is utilization. Basically, in order to take a care free vacation you have to work twice as hard to offset those non-productive PTO hours so your utilization rate will remain high. My last year there I was at ~125% utilization, had stellar feedback from my director and senior manager, and still only received an \"average\" rating. I saw many good, hard-working people get put on a performance improvement plan because their utilization rate wasn't at a suicidal level... I think the only reason Deloitte wins Working Mother Best Place to Work and other similar awards that imply the firm has a solid work-life balance approach is due to the option to go part-time. Part-timers have a supreme amount of flexibility so sure, if they are taking those people into account then yeah, the work-life balance is amazing. However, for those of us that were full-time, you're nothing more than a hour billing machine to be oiled and milked for every last penny. I had some nights that I worked so hard and long that it didn't make sense to go to bed to only get an hour of sleep before I had to hop in the shower and get ready for my next day. The culture is very clique driven. If you work outside of the mothership (DC area) you are at a severe disadvantage because you can't participate in the popularity contest that drives finding project work. People would brag about working on Christmas, Thanksgiving, and other holidays because that's what is expected of you if you want to advance. I stayed for a few years to get some resume beef and some excellent experience, then I had to move on otherwise the job was going to literally kill me. Advice to Management How about we be honest with ourselves when it comes to work-life balance? Maybe set the expectation that until you get to senior manager, it's going to be a slobber-knocker in the lower ranks to get promoted. Basically, the culture is like playing one long, boring, arduous game of Survivor and I think that needs to change.", "rating": 3, "pros": "PTO", "cons": "PTO (I'll explain below)", "advice": "How about we be honest with ourselves when it comes to work-life balance? Maybe set the expectation that until you get to senior manager, it's going to be a slobber-knocker in the lower ranks to get promoted. Basically, the culture is like playing one long, boring, arduous game of Survivor and I think that needs to change."}, {"title": "Senior Assistant", "text": "Pros Great Learning and great craeer path Cons Worst worka and personal life balance", "rating": 3, "pros": "Great Learning and great craeer path", "cons": "Worst worka and personal life balance", "advice": null}, {"title": "Tiring", "text": "Pros Good training and learning opportunities Cons Low salary and less appreciation for work done. Advice to Management Huge wage gap between employees who do the same job.", "rating": 3, "pros": "Good training and learning opportunities", "cons": "Low salary and less appreciation for work done.", "advice": "Huge wage gap between employees who do the same job."}, {"title": "Working there is what you make up it at Deloitte but best to be Single with no Family", "text": "Pros Benefits, Salary, latest technology, innovative, peers are the best I have worked with. More company wide Holidays so that everyone can have a real break from work. Cons Stuffy, bureaucratic, process intense, Work Life balance difficult at times. One PPMD with a problem is more important than 1000 non PPDM with another problem. Better to be seen working on a problem with no results than to sit down and have an open conversation on a solution. Buying of software too many times not based on the best Application but on which app can generate more money to Deloitte Consulting. Better to be extraverted and loud than introverted and a producer. Advice to Management Deloitte has a good culture of training it's employees. DU is a great facility where you can brush up on many managerial skills. Your co-workers are the best and really are top notch. However, You can bust your butt and do good work in your primary duties and never be promoted unless you take on a second job at Deloitte doing extra credit work. To advance at Deloitte, you must sacrifice your family, work on your PTO, answer email on the weekend and at nights, be at one meeting online and answering email in the background. You must over extended yourself. That is the Deloitte way. The goal is to see how much you can give of yourself to Deloitte before you crack and have to leave. Some never do while others leave after a few years. Now you don' have to do these things I mentioned but you won' t progress unless you do. Some will take these comments negative and some will not. It just what you want out of life. But i loved my time there. However, at Deloitte you do own your career. If you not self motivated and highly adapt a change you will not make it.", "rating": 5, "pros": "Benefits, Salary, latest technology, innovative, peers are the best I have worked with. More company wide Holidays so that everyone can have a real break from work.", "cons": "Stuffy, bureaucratic, process intense, Work Life balance difficult at times. One PPMD with a problem is more important than 1000 non PPDM with another problem. Better to be seen working on a problem with no results than to sit down and have an open conversation on a solution. Buying of software too many times not based on the best Application but on which app can generate more money to Deloitte Consulting. Better to be extraverted and loud than introverted and a producer.", "advice": "Deloitte has a good culture of training it's employees. DU is a great facility where you can brush up on many managerial skills. Your co-workers are the best and really are top notch. However, You can bust your butt and do good work in your primary duties and never be promoted unless you take on a second job at Deloitte doing extra credit work. To advance at Deloitte, you must sacrifice your family, work on your PTO, answer email on the weekend and at nights, be at one meeting online and answering email in the background. You must over extended yourself. That is the Deloitte way. The goal is to see how much you can give of yourself to Deloitte before you crack and have to leave. Some never do while others leave after a few years. Now you don' have to do these things I mentioned but you won' t progress unless you do. Some will take these comments negative and some will not. It just what you want out of life. But i loved my time there. However, at Deloitte you do own your career. If you not self motivated and highly adapt a change you will not make it."}, {"title": "Deloitte DBA", "text": "Pros Great benefits in terms of health Cons Long working hours, not recommending anyone Advice to Management NA", "rating": 3, "pros": "Great benefits in terms of health", "cons": "Long working hours, not recommending anyone", "advice": "NA"}, {"title": "Consultant", "text": "Pros Amazing, smart, and social group of people to work with. Great benefits. Cons Mandatory firm initiatives, working 40 hours a week is discouraged Advice to Management None", "rating": 3, "pros": "Amazing, smart, and social group of people to work with. Great benefits.", "cons": "Mandatory firm initiatives, working 40 hours a week is discouraged", "advice": "None"}, {"title": "Manager working at Deloitte Consulting in Los Angeles area", "text": "Pros Great culture, people, benefits, compensation, work/life balance Cons Long hours, travel, internal initiatives,", "rating": 5, "pros": "Great culture, people, benefits, compensation, work/life balance", "cons": "Long hours, travel, internal initiatives,", "advice": null}, {"title": "Good Exposure. Bad Work-life balance", "text": "Pros Amazing People Powerful Teams Good Exposure to new technologies in diverse industrial environments Cons Low effort-to-pay ratio Hours are completely dictated by clients and could be very long Advice to Management Share a greater part of your margin with the employees to create more value", "rating": 5, "pros": "Amazing People", "cons": "Low effort-to-pay ratio", "advice": "Share a greater part of your margin with the employees to create more value"}, {"title": "Great", "text": "Pros Great experience all around really terrific Cons No cons, all around really terrific Advice to Management Pay more please", "rating": 5, "pros": "Great experience all around really terrific", "cons": "No cons, all around really terrific", "advice": "Pay more please"}, {"title": "Brilliant company to work for", "text": "Pros Good salary hikes. Work is fast paced. Cons Work life balance is not so great at peak project periods.", "rating": 5, "pros": "Good salary hikes. Work is fast paced.", "cons": "Work life balance is not so great at peak project periods.", "advice": null}, {"title": "Great experience and lots of perks in office", "text": "Pros Love the perks and benefits of the office, lots of room for growth and development. And lots of opportunities to travel Cons Working remotely and globally is challenging with a company as big as Deloitte. Building connections and relationships is difficult via email and skype.", "rating": 5, "pros": "Love the perks and benefits of the office, lots of room for growth and development. And lots of opportunities to travel", "cons": "Working remotely and globally is challenging with a company as big as Deloitte. Building connections and relationships is difficult via email and skype.", "advice": null}, {"title": "Great experience and lots of perks in office", "text": "Pros Love the perks and benefits of the office, lots of room for growth and development. And lots of opportunities to travel Cons Working remotely and globally is challenging with a company as big as Deloitte. Building connections and relationships is difficult via email and skype.", "rating": 5, "pros": "Love the perks and benefits of the office, lots of room for growth and development. And lots of opportunities to travel", "cons": "Working remotely and globally is challenging with a company as big as Deloitte. Building connections and relationships is difficult via email and skype.", "advice": null}, {"title": "Project Delivery Senior Analyst", "text": "Pros Great benefits: 401k, health care, dental, health subsidy Cons Seem to only promote people that are best friends with the manager. Advice to Management Focus more on good work and not socializing.", "rating": 3, "pros": "Great benefits: 401k, health care, dental, health subsidy", "cons": "Seem to only promote people that are best friends with the manager.", "advice": "Focus more on good work and not socializing."}, {"title": "Associate", "text": "Pros Good place to start a career Cons Lots of long hours for little pay", "rating": 5, "pros": "Good place to start a career", "cons": "Lots of long hours for little pay", "advice": null}, {"title": "Consultant", "text": "Pros Good culture Good growth opportunities Good client projects Cons None that I can think of", "rating": 5, "pros": "Good culture", "cons": "None that I can think of", "advice": null}, {"title": "Audit Senior Assistant", "text": "Pros Amazing company with tons of opportunity and reach Cons Very large corporate structure has it's disadvantages such as inefficiencies in production", "rating": 5, "pros": "Amazing company with tons of opportunity and reach", "cons": "Very large corporate structure has it's disadvantages such as inefficiencies in production", "advice": null}, {"title": "Assistant Manager", "text": "Pros Excellent work environment Helpful colleagues Work Life Balance Cons Politics in process Difficult to move to a different process", "rating": 5, "pros": "Excellent work environment", "cons": "Politics in process", "advice": null}, {"title": "information security specialist", "text": "Pros Drive to share and complement my experience. Cons Openness to absorb and give back. Advice to Management Openness in understanding client pressing issues.", "rating": 5, "pros": "Drive to share and complement my experience.", "cons": "Openness to absorb and give back.", "advice": "Openness in understanding client pressing issues."}, {"title": "Senior Manager", "text": "Pros Best place to work, lots of intelligent folks Cons Nothing so far, improvement 401K contribution", "rating": 5, "pros": "Best place to work, lots of intelligent folks", "cons": "Nothing so far, improvement 401K contribution", "advice": null}, {"title": "Good to learn skills early on in career", "text": "Pros structured projects, good compensation package, global brand name Cons Dated methodologies, management does not inspire", "rating": 3, "pros": "structured projects, good compensation package, global brand name", "cons": "Dated methodologies, management does not inspire", "advice": null}, {"title": "Starting my career at Deloitte", "text": "Pros The people you work with at Deloitte are phenomenal. One of the best places to start your career in accounting or professional services; there are so many great opportunities. Deloitte also invests in you and wants to help you grow as leader and help development your technical skills. Cons Somewhat difficult work life balance, but the company is becoming more flexible. Also compensation and benefits offset the longer work hours.", "rating": 5, "pros": "The people you work with at Deloitte are phenomenal. One of the best places to start your career in accounting or professional services; there are so many great opportunities. Deloitte also invests in you and wants to help you grow as leader and help development your technical skills.", "cons": "Somewhat difficult work life balance, but the company is becoming more flexible. Also compensation and benefits offset the longer work hours.", "advice": null}, {"title": "SR specialist", "text": "Pros multiple project opportunities available with Deloitte consulting Cons you have to find own project, does not feel stable, way to many compliances need to be done yearly. Advice to Management too many compliance training.", "rating": 3, "pros": "multiple project opportunities available with Deloitte consulting", "cons": "you have to find own project, does not feel stable, way to many compliances need to be done yearly.", "advice": "too many compliance training."}, {"title": "Great Company", "text": "Pros For a really large organization, Deloitte tries to make it feel small. They urge frequent check-ins with employees and mentors. This allows for constant feedback and personal growth. Cons These guys work hard, but try to be flexible. However its hard to be flexible when the client/customer comes first and are going through an issue. Advice to Management Communication of strategy was great! Keep it up!", "rating": 5, "pros": "For a really large organization, Deloitte tries to make it feel small. They urge frequent check-ins with employees and mentors. This allows for constant feedback and personal growth.", "cons": "These guys work hard, but try to be flexible. However its hard to be flexible when the client/customer comes first and are going through an issue.", "advice": "Communication of strategy was great! Keep it up!"}, {"title": "D&T", "text": "Pros High-pace environment. Access to a vast network of people and information resources. Cons May require a heavy travel schedule.", "rating": 3, "pros": "High-pace environment. Access to a vast network of people and information resources.", "cons": "May require a heavy travel schedule.", "advice": null}, {"title": "Good", "text": "Pros I really appreciated the training and the time spent on tax technical. I did not care for the hours worked . Cons The speaks hours were not consistent with the company motto. I would suggest that people consider this before accepting a job . Advice to Management Work more", "rating": 3, "pros": "I really appreciated the training and the time spent on tax technical. I did not care for the hours worked .", "cons": "The speaks hours were not consistent with the company motto. I would suggest that people consider this before accepting a job .", "advice": "Work more"}, {"title": "audit in-charge", "text": "Pros meeting new people at the various clients and learning about different business models. getting experience in supervising others and teaching them how to do the job. lots of pto Cons not super rewarding work, very long hours, not a great 401k match, the people i worked with were very arrogant and think they're smarter than they are. not paid enough considering the hours we work Advice to Management 70-100+ hour weeks are just not sustainable, no matter how much \"flexibility\" is given or how much PTO is given. Also the audit salary is way too low given these hours.", "rating": 3, "pros": "meeting new people at the various clients and learning about different business models. getting experience in supervising others and teaching them how to do the job. lots of pto", "cons": "not super rewarding work, very long hours, not a great 401k match, the people i worked with were very arrogant and think they're smarter than they are. not paid enough considering the hours we work", "advice": "70-100+ hour weeks are just not sustainable, no matter how much \"flexibility\" is given or how much PTO is given. Also the audit salary is way too low given these hours."}, {"title": "Great company to work for", "text": "Pros Great company to work for Cons Constant travel is often required", "rating": 5, "pros": "Great company to work for", "cons": "Constant travel is often required", "advice": null}, {"title": "Audit Senior Assistant", "text": "Pros Good perks and benefits (Marketplace, concierge for busy season, fitness subsidy) Cons Within audit line, there is no work/life balance which promotes burnout. There is a lack of understanding or empathy within resource management about personal circumstances (they send you wherever then want whenever they want to). Mobility can be a challenge, and your prospects depend highly on the teams you are on. Some teams within the firm are known to have a toxic culture, as is resource management, and performance metrics lack transparency, unless you have a team that is very invested in your personal development. Advice to Management Promote greater work/life balance and empathy from tenured performers in resource management to prevent high turnover among employees. Utilization rates and hours should be valued as less important than the actual value-add provided by employees. Performance should be measured and compensated with more transparency.", "rating": 3, "pros": "Good perks and benefits (Marketplace, concierge for busy season, fitness subsidy)", "cons": "Within audit line, there is no work/life balance which promotes burnout. There is a lack of understanding or empathy within resource management about personal circumstances (they send you wherever then want whenever they want to). Mobility can be a challenge, and your prospects depend highly on the teams you are on. Some teams within the firm are known to have a toxic culture, as is resource management, and performance metrics lack transparency, unless you have a team that is very invested in your personal development.", "advice": "Promote greater work/life balance and empathy from tenured performers in resource management to prevent high turnover among employees. Utilization rates and hours should be valued as less important than the actual value-add provided by employees. Performance should be measured and compensated with more transparency."}, {"title": "Good experience", "text": "Pros very competitive environment, but very rewarding and you can learn a lot from it Cons sometimes you have to work very intensive hours Advice to Management great management and mentors", "rating": 5, "pros": "very competitive environment, but very rewarding and you can learn a lot from it", "cons": "sometimes you have to work very intensive hours", "advice": "great management and mentors"}, {"title": "Sr. Consultant", "text": "Pros Challenging projects, Intellectual colleagues, Fast-paced environment Cons Getting stuck with a project for a long time makes work monotonous with little learning", "rating": 5, "pros": "Challenging projects, Intellectual colleagues, Fast-paced environment", "cons": "Getting stuck with a project for a long time makes work monotonous with little learning", "advice": null}, {"title": "Senior Financial Analyst", "text": "Pros The knowledge pick up is great!! Cons Easy to get looked over for promotion", "rating": 3, "pros": "The knowledge pick up is great!!", "cons": "Easy to get looked over for promotion", "advice": null}, {"title": "Senior Financial Analyst", "text": "Pros The knowledge pick up is great!! Cons Easy to get looked over for promotion", "rating": 3, "pros": "The knowledge pick up is great!!", "cons": "Easy to get looked over for promotion", "advice": null}, {"title": "Ok", "text": "Pros Job Satisfaction & good opportunities in the marketplace Cons No work-life balance ; long hours Advice to Management Stress on work life balance", "rating": 3, "pros": "Job Satisfaction & good opportunities in the marketplace", "cons": "No work-life balance ; long hours", "advice": "Stress on work life balance"}, {"title": "Executive Recruiter", "text": "Pros very collaborative culture, good work life balance Cons I have nothing to add here", "rating": 5, "pros": "very collaborative culture, good work life balance", "cons": "I have nothing to add here", "advice": null}, {"title": "Best place to launch your career", "text": "Pros Work life balance, culture, client exposure Cons Travel, new feedback system not very transparent Advice to Management Transparent feedback", "rating": 5, "pros": "Work life balance, culture, client exposure", "cons": "Travel, new feedback system not very transparent", "advice": "Transparent feedback"}, {"title": "Opportunity to keep growing", "text": "Pros Ability to manage and evolve own career, focus on new and emerging technologies to solve clients toughest challenges Cons Evolving career model can sometimes be at odds with more traditional path to partner", "rating": 5, "pros": "Ability to manage and evolve own career, focus on new and emerging technologies to solve clients toughest challenges", "cons": "Evolving career model can sometimes be at odds with more traditional path to partner", "advice": null}, {"title": "Sexual harassment", "text": "Pros Great opportunities to develop skills, knowledge, work with teams and clients on interesting challenges. Cons I reported serious sexual harassment by a partner, and senior leadership did nothing. They protected him, instead of helping me. It was unconscionable considering the company’s curated image of inclusion, ethics, and support of women. Advice to Management Deal with harassers, stop sweeping this problem under the rug.", "rating": 3, "pros": "Great opportunities to develop skills, knowledge, work with teams and clients on interesting challenges.", "cons": "I reported serious sexual harassment by a partner, and senior leadership did nothing. They protected him, instead of helping me. It was unconscionable considering the company’s curated image of inclusion, ethics, and support of women.", "advice": "Deal with harassers, stop sweeping this problem under the rug."}, {"title": "Consulant", "text": "Pros Good culture, people, location and learn a lot Cons Overworked, poor work life balance, firm initiatives take a lot of time", "rating": 3, "pros": "Good culture, people, location and learn a lot", "cons": "Overworked, poor work life balance, firm initiatives take a lot of time", "advice": null}, {"title": "Manager", "text": "Pros Flexibility. Stability. Variety of projects. Lots of investment in education and continuous improvement. Feel like they are really innovating in the space. Cons Feel underpaid compared to peer firms, wish we had better supporting infrastructure (knowledge sharing, etc) to make our jobs easier Advice to Management Invest in systems and capabilities to better unite the firm", "rating": 5, "pros": "Flexibility. Stability. Variety of projects. Lots of investment in education and continuous improvement. Feel like they are really innovating in the space.", "cons": "Feel underpaid compared to peer firms, wish we had better supporting infrastructure (knowledge sharing, etc) to make our jobs easier", "advice": "Invest in systems and capabilities to better unite the firm"}, {"title": "Associate Consultant", "text": "Pros Great experience and Nice workspace Cons A little bit busy but fruitful", "rating": 5, "pros": "Great experience and Nice workspace", "cons": "A little bit busy but fruitful", "advice": null}, {"title": "Strong Company Culture", "text": "Pros They do a lot for you as an employee. Lots of great perks for those who work very hard. If you like the taste of company koolaid you'll be in heaven. Cons Most people are great, but end up working for a bad egg and you will go down in flames. It only takes one partner to speak poorly about you to end your prospects of promotion.", "rating": 5, "pros": "They do a lot for you as an employee. Lots of great perks for those who work very hard. If you like the taste of company koolaid you'll be in heaven.", "cons": "Most people are great, but end up working for a bad egg and you will go down in flames. It only takes one partner to speak poorly about you to end your prospects of promotion.", "advice": null}, {"title": "Many opportunities, political environment", "text": "Pros Opportunities for upward movement, work with talented co-workers, support for continuing education, flexibility to work from home Cons Large global organization can be difficult to navigate, very political environment Advice to Management Invest more time in listening and responding to the advice and complaints of employees.", "rating": 5, "pros": "Opportunities for upward movement, work with talented co-workers, support for continuing education, flexibility to work from home", "cons": "Large global organization can be difficult to navigate, very political environment", "advice": "Invest more time in listening and responding to the advice and complaints of employees."}, {"title": "advisory", "text": "Pros you get opportunities to work on different types of projects Cons sometimes it's hard to find the projects you're very fits to, especially under the pressure of your utilization goals", "rating": 5, "pros": "you get opportunities to work on different types of projects", "cons": "sometimes it's hard to find the projects you're very fits to, especially under the pressure of your utilization goals", "advice": null}, {"title": "Sr Consultant", "text": "Pros Great company, a lot of perks, lovely people, fantastic learning opportunities Cons Pay discrepancy is too large in the Bay Area between Deloitte and Industry", "rating": 5, "pros": "Great company, a lot of perks, lovely people, fantastic learning opportunities", "cons": "Pay discrepancy is too large in the Bay Area between Deloitte and Industry", "advice": null}, {"title": "Great place to start your career", "text": "Pros Great place to gain experience at the start of your career Cons Difficult to stand out from the crowd and warrant more than the moderate pay raises Advice to Management Provide greater incentives to keep top talent", "rating": 5, "pros": "Great place to gain experience at the start of your career", "cons": "Difficult to stand out from the crowd and warrant more than the moderate pay raises", "advice": "Provide greater incentives to keep top talent"}, {"title": "Good salary, Work from home", "text": "Pros Good salary, Work from home Good salary, Work from home Cons more work , no work life balance more work , no work life balance", "rating": 5, "pros": "Good salary, Work from home Good salary, Work from home", "cons": "more work , no work life balance more work , no work life balance", "advice": null}, {"title": "audit senior", "text": "Pros you learn a lot of things, work for big clients and have a lot of responsibilities Cons There is not life-balance, there is a lot of pressure at work. Advice to Management no advice to management", "rating": 3, "pros": "you learn a lot of things, work for big clients and have a lot of responsibilities", "cons": "There is not life-balance, there is a lot of pressure at work.", "advice": "no advice to management"}, {"title": "Associate", "text": "Pros Culture and firm wide attitude is optimistic Cons At times, becomes of administrative burden, progress was slow", "rating": 5, "pros": "Culture and firm wide attitude is optimistic", "cons": "At times, becomes of administrative burden, progress was slow", "advice": null}, {"title": "Deloitte", "text": "Pros Best work culture for launching a career Cons Poor Work-life balance. Long work hours", "rating": 5, "pros": "Best work culture for launching a career", "cons": "Poor Work-life balance. Long work hours", "advice": null}, {"title": "Analytics\" Consultant", "text": "Pros -Access to extremely intelligent people. -Deloitte University and the learnings available to you is amazing. -Career growth is exponential compared to industry. Cons -You don't do any real Analytics work as an \"Analytics Consultant\". -Expected to work 70+ hours all year round on top of traveling every single week. Every season is busy season. -Also expected to attend every single networking event and party. Absolutely 0 work life balance. -Pay is a joke when you break it down hourly. -In my opinion, the people in my office were mostly unfriendly and unhelpful. Only talked to you in order to use you or back stab you. -Awful office politics.", "rating": 3, "pros": "-Access to extremely intelligent people.", "cons": "-You don't do any real Analytics work as an \"Analytics Consultant\".", "advice": null}, {"title": "Deloitte Consulting", "text": "Pros Lots of opportunity to work with really smart people Cons Lot of company politics to navigate", "rating": 3, "pros": "Lots of opportunity to work with really smart people", "cons": "Lot of company politics to navigate", "advice": null}, {"title": "Risk Advisory", "text": "Pros Many intelligent and talented employees, and a great place to sharpen networking skills. Cons In Advisory, there is no consensus or common approach to risk management. Each major PPMD has their own approach and toolkit, which leads to internal confusion and lack of consistent go-to-market strategy. PPMDs in charge of building new practice areas lack fundamental knowledge of industry dynamics and needs, and tend to focus on trying to sell solutions that will make the most money rather than solve client problems or satisfy real-life needs. PPMDs tend to resist or ignore the advice and recommendations of industry practitioners. Advice to Management Be open to recommendations and advice of experienced hires who have pragmatic knowledge of specific industries and client needs. Respect the time it takes to build a new practice area and build a portfolio of clients and projects (minimum two to three years), or don't attempt to expand. If a new practice area is struggling to grow, don't just jettison managers and senior managers, rather look at the approach being taken by the PPMD in charge of building the new area to determine if course correction is warranted.", "rating": 3, "pros": "Many intelligent and talented employees, and a great place to sharpen networking skills.", "cons": "In Advisory, there is no consensus or common approach to risk management. Each major PPMD has their own approach and toolkit, which leads to internal confusion and lack of consistent go-to-market strategy. PPMDs in charge of building new practice areas lack fundamental knowledge of industry dynamics and needs, and tend to focus on trying to sell solutions that will make the most money rather than solve client problems or satisfy real-life needs. PPMDs tend to resist or ignore the advice and recommendations of industry practitioners.", "advice": "Be open to recommendations and advice of experienced hires who have pragmatic knowledge of specific industries and client needs. Respect the time it takes to build a new practice area and build a portfolio of clients and projects (minimum two to three years), or don't attempt to expand. If a new practice area is struggling to grow, don't just jettison managers and senior managers, rather look at the approach being taken by the PPMD in charge of building the new area to determine if course correction is warranted."}, {"title": "Project Controller", "text": "Pros Dynamic and progressive firm with good benefits. Always improving how and what they do so you learn a lot. Training programs are great and plentiful. Cons Can be hard to balance work/life at times. Ever increasing work load and not staffing up fast enough is common. Project/client teams can be very demanding and expect 24/7 responses. Advice to Management Establish better guidelines for project team to limit night/weekend demands.", "rating": 5, "pros": "Dynamic and progressive firm with good benefits. Always improving how and what they do so you learn a lot. Training programs are great and plentiful.", "cons": "Can be hard to balance work/life at times. Ever increasing work load and not staffing up fast enough is common. Project/client teams can be very demanding and expect 24/7 responses.", "advice": "Establish better guidelines for project team to limit night/weekend demands."}, {"title": "Great Experience", "text": "Pros - learn a lot fast - People are super cool and willing to help - A lot of responsibility given to analyst - Great deal flow from variety of industries Cons - HUGE learning curve - hours are MISEARABLE - Analaysts are on 6-7 deals at a time - pay is eh especially for amount of work being done - Advice to Management - increase pay and hire more analysts to spread work out", "rating": 3, "pros": "- learn a lot fast", "cons": "- HUGE learning curve", "advice": "- increase pay and hire more analysts to spread work out"}, {"title": "Not a positive experience", "text": "Pros They company pays well. I also liked their application tools to track time and expenses. Cons Partners and Directors pull managers in opposing directions and then blame you. No work life balance. Projects are staffed with people with little experience. Fake it till you make approach. Way too much company overhead while on a project. Advice to Management It’s seems like a fine fit for others so no advice. I would rather work at a boutique consulting company.", "rating": 1, "pros": "They company pays well. I also liked their application tools to track time and expenses.", "cons": "Partners and Directors pull managers in opposing directions and then blame you. No work life balance. Projects are staffed with people with little experience. Fake it till you make approach. Way too much company overhead while on a project.", "advice": "It’s seems like a fine fit for others so no advice. I would rather work at a boutique consulting company."}, {"title": "Valuation Associate", "text": "Pros Wide project diversity and fields for specialization within valuation. Cons Work life balance can be tough during busy season (as expected) and the environment can be a bit tense during this time.", "rating": 3, "pros": "Wide project diversity and fields for specialization within valuation.", "cons": "Work life balance can be tough during busy season (as expected) and the environment can be a bit tense during this time.", "advice": null}, {"title": "Great Place to work..", "text": "Pros employee friendly company .. specially for women Cons nothing much to mention in specific", "rating": 5, "pros": "employee friendly company .. specially for women", "cons": "nothing much to mention in specific", "advice": null}, {"title": "Tax Inter", "text": "Pros Great Pay and learned a lot. Also many activities to become acclimated with the company. Cons No cons for this employer", "rating": 5, "pros": "Great Pay and learned a lot. Also many activities to become acclimated with the company.", "cons": "No cons for this employer", "advice": null}, {"title": "Senior Tax Consultant", "text": "Pros Great learning experience and training program Cons Hard to have work life balance", "rating": 5, "pros": "Great learning experience and training program", "cons": "Hard to have work life balance", "advice": null}, {"title": "The Only Company I've Ever Worked For", "text": "Pros Extensive benefits and resources. The best place to start your career and build your network Cons Your function means nothing. They often lack work for your desired area", "rating": 5, "pros": "Extensive benefits and resources. The best place to start your career and build your network", "cons": "Your function means nothing. They often lack work for your desired area", "advice": null}, {"title": "Deloitte", "text": "Pros Great place to start your career. You get great experience, and have the option to either stay and grow within the form, or take your experience to a new job. Cons Long hours, sometimes unrealistic expectations.", "rating": 5, "pros": "Great place to start your career. You get great experience, and have the option to either stay and grow within the form, or take your experience to a new job.", "cons": "Long hours, sometimes unrealistic expectations.", "advice": null}, {"title": "Deloitte", "text": "Pros Great place to start your career. You get great experience, and have the option to either stay and grow within the form, or take your experience to a new job. Cons Long hours, sometimes unrealistic expectations.", "rating": 5, "pros": "Great place to start your career. You get great experience, and have the option to either stay and grow within the form, or take your experience to a new job.", "cons": "Long hours, sometimes unrealistic expectations.", "advice": null}, {"title": "Deloitte", "text": "Pros You learn a lot and get tons of experience. Fast paced. Cons Long hours and for poor pay. You have to teach yourself a lot and be self motivated to keep up.", "rating": 3, "pros": "You learn a lot and get tons of experience. Fast paced.", "cons": "Long hours and for poor pay. You have to teach yourself a lot and be self motivated to keep up.", "advice": null}, {"title": "Good", "text": "Pros Benefits, education, career, growth, people Cons Hours, vacation, demands, year end", "rating": 5, "pros": "Benefits, education, career, growth, people", "cons": "Hours, vacation, demands, year end", "advice": null}, {"title": "Manager", "text": "Pros Great place to work with benefits - the hours can be demanding, but supportive leadership to help balance and manage Cons Work life balance at a consulting firm is hard", "rating": 5, "pros": "Great place to work with benefits - the hours can be demanding, but supportive leadership to help balance and manage", "cons": "Work life balance at a consulting firm is hard", "advice": null}, {"title": "Deloitte", "text": "Pros Great benefits and salary benefits Cons Culture is okay and just like the other big 4", "rating": 5, "pros": "Great benefits and salary benefits", "cons": "Culture is okay and just like the other big 4", "advice": null}, {"title": "Tech Risk Advisory Manager", "text": "Pros Fantastic people and great experience working with F100 companies across all industries Cons Low margins on audit engagements translates to low salary for the hours you are working Advice to Management Keep investing in your people and hammer the pros of employee benefits (Fitness subsidy, PTO, Applause awards) that all roll up into the compensation package to staff.", "rating": 5, "pros": "Fantastic people and great experience working with F100 companies across all industries", "cons": "Low margins on audit engagements translates to low salary for the hours you are working", "advice": "Keep investing in your people and hammer the pros of employee benefits (Fitness subsidy, PTO, Applause awards) that all roll up into the compensation package to staff."}, {"title": "Great place to work", "text": "Pros Deloitte offers excellent flexibility, competitive benefits, above average pay, and the opportunity to work on interesting clients with talented coworkers. Cons The company requires long hours and busy season the demand is very high. Some senior manager, directors, and partners do not fully embrace flexibility, and it can be difficult to change teams. Advice to Management Keep focusing on flexibility.", "rating": 5, "pros": "Deloitte offers excellent flexibility, competitive benefits, above average pay, and the opportunity to work on interesting clients with talented coworkers.", "cons": "The company requires long hours and busy season the demand is very high. Some senior manager, directors, and partners do not fully embrace flexibility, and it can be difficult to change teams.", "advice": "Keep focusing on flexibility."}, {"title": "Good", "text": "Pros Good place to work and learn Cons Understand how to navigate a matrix", "rating": 5, "pros": "Good place to work and learn", "cons": "Understand how to navigate a matrix", "advice": null}, {"title": "Consultant", "text": "Pros Great people to work with and has great training programs to learn Cons Competitive and long hours with a lot of travel", "rating": 5, "pros": "Great people to work with and has great training programs to learn", "cons": "Competitive and long hours with a lot of travel", "advice": null}, {"title": "Senior Consultant", "text": "Pros Opportunity to own career, grow, network, learn, and work with interesting clients. Cons I felt like an unreasonable level of loyalty was demanded of me on a specific project I was working on. If I was going to switch projects then I would have had to burn a bridge. Switching projects should be normal.", "rating": 5, "pros": "Opportunity to own career, grow, network, learn, and work with interesting clients.", "cons": "I felt like an unreasonable level of loyalty was demanded of me on a specific project I was working on. If I was going to switch projects then I would have had to burn a bridge. Switching projects should be normal.", "advice": null}]