[{"title": "Awesoneness", "text": "Pros fun, happy, active, organized, cool Cons bad, sad, moody, uptight, arrogant", "rating": 3, "pros": "fun, happy, active, organized, cool", "cons": "bad, sad, moody, uptight, arrogant", "advice": null}, {"title": "Could be better.", "text": "Pros Staff meal on shift of £6, however as the in store price goes up, the staff meal value doesn't. Free coffee on shift, which is great because the coffee is delicious. Fantastic friendly team. Cons Marketing is poorly communicated from head office to team members. Senior management make no effort to speak to team members and are not approachable or friendly. They expect very high standards and work even on minimum wage. Website/career portal discusses 'great career opportunities' even though no one has been sent on a training programme in the past 12 months in my store. Constantly changing branding/food items to keep up with pret/starbucks etc. Instead of actually communicating to customers what they enjoy etc. Prices/sizes/recipes change allll the time. The stores in Scotland do not look as modern or fresh as the stores in England, they look a bit outdated. Always complaining about waste being high, but then not having enough variety. Which is paradoxical. Advice to Management Spend more time planning campaigns and changes to make launches exciting and impactful and exciting for customers, not a change every 2 weeks. If you pride your company on it's development opportunities, offer them. Re-invest on branding and marketing in Scotland and the stores may perform better.", "rating": 5, "pros": "Staff meal on shift of £6, however as the in store price goes up, the staff meal value doesn't.", "cons": "Marketing is poorly communicated from head office to team members.", "advice": "Spend more time planning campaigns and changes to make launches exciting and impactful and exciting for customers, not a change every 2 weeks."}, {"title": "Customer Host", "text": "Pros Variable shifts, training, team was nice. Cons There is a lot of cleaning and pressure. Advice to Management Increase the pay.", "rating": 3, "pros": "Variable shifts, training, team was nice.", "cons": "There is a lot of cleaning and pressure.", "advice": "Increase the pay."}, {"title": "So much potential", "text": "Pros Free food and delicious coffee, some cool people to work with Cons The company has been through a lot in the last few years and is in need of a stable leadership team", "rating": 5, "pros": "Free food and delicious coffee, some cool people to work with", "cons": "The company has been through a lot in the last few years and is in need of a stable leadership team", "advice": null}, {"title": "Team member", "text": "Pros Staff food limit £6 daily (prices are going up but limit is the same) Cons Way too much stress/pressure for minimum wages pay Not worth it Unfortunately many good and hardworking people left because they have been used too much (getting payed less and doing free extra hours) Advice to Management Dont use your team as slaves Pay them what the deserve and what they are worth", "rating": 3, "pros": "Staff food limit £6 daily (prices are going up but limit is the same)", "cons": "Way too much stress/pressure for minimum wages pay", "advice": "Dont use your team as slaves"}, {"title": "Quite disorienting", "text": "Pros The working hours: the restaurants close at 8 or 9pm. Friendly collegues. I like the fact that they donate not sold food to charity. Cons They can ask you sometimes to change restaurant, so you can go to work for a week in another area of London. Managers are a bit bossy, but this depends from the restaurant. Advice to Management More control on the managers of the restaurant, they can be a bit bossy sometimes and scare other workers. It's not their restaurant!", "rating": 3, "pros": "The working hours: the restaurants close at 8 or 9pm. Friendly collegues. I like the fact that they donate not sold food to charity.", "cons": "They can ask you sometimes to change restaurant, so you can go to work for a week in another area of London. Managers are a bit bossy, but this depends from the restaurant.", "advice": "More control on the managers of the restaurant, they can be a bit bossy sometimes and scare other workers. It's not their restaurant!"}, {"title": "BAD AT MANAGEMENT", "text": "Pros free food when closing. but nothing. a lot of shops do this as well. Cons really bad management. 1. My manager agree with me to be a barista, because i had already known a lot and have good connect with my coffee customers, but the area manager transfer his fd to my shop to be barista, i have to teach her everything about my shop. then some customers still point me to make coffee for them, they dont like new one. 2. i am an experience staff, and always help the shop when teammate calls sick, everyone go on holiday i tend to do double shift, but suddenly cut back on my hours, they give new staffs for 37 hours a week, i just get 6.5 hours a day, if i can remember my contract is 35 hours a week, not for 32.5 a week. 3. when I help everything and working hard, but management seemed like they dont care, so would be losing loyal employees. a lot of good managers and team memeber quit, just is to mean this company have to spend on time and money to train new managers and members. 4. always cut back on hours, management dont think about food cost, always waste a lot food everyday, some people told me that we are not allowed ordering less food by area manager, coz we cant let our shop too empty, so if we cut back on some food waste, memeber can get more hours, we have enough staffs work together, give good service, sometime we dont have enough staffs at same time, one person have to do 2 people work, how come? what is the point? Advice to Management give us balance and fair work environment.", "rating": 3, "pros": "free food when closing. but nothing. a lot of shops do this as well.", "cons": "really bad management.", "advice": "give us balance and fair work environment."}, {"title": "OK place to work", "text": "Pros Staff meals. Worked with some great teams and made some good friends. Had some good managers. Cons Also worked with some horrendous people. Company has been undergoing a lot of changes in management. Some senior managers are extremely over zealous thinking they are war generals instead of actually selling sandwiches. Very dependent on the store manager as to whether you enjoy your time there. Pay nowhere near enough, that may be changing gradually with the new CEO.", "rating": 3, "pros": "Staff meals. Worked with some great teams and made some good friends. Had some good managers.", "cons": "Also worked with some horrendous people. Company has been undergoing a lot of changes in management. Some senior managers are extremely over zealous thinking they are war generals instead of actually selling sandwiches. Very dependent on the store manager as to whether you enjoy your time there.", "advice": null}, {"title": "Retail Team Member", "text": "Pros - Diverse Staff - Experience in food retail. - Well furnished and decent standards. - Free meals. Cons - Intensive fast paced work. - Minimum wage. Advice to Management - Head Office need to support managers and employees more, to ease the pressure.", "rating": 3, "pros": "- Diverse Staff", "cons": "- Intensive fast paced work.", "advice": "- Head Office need to support managers and employees more, to ease the pressure."}, {"title": "Great company", "text": "Pros Team work and great benefit Cons Salary is just basic paid", "rating": 5, "pros": "Team work and great benefit", "cons": "Salary is just basic paid", "advice": null}, {"title": "modern day slavery if you want to work at eat", "text": "Pros work with great people instore. free lunch Cons not good pay. long hours no gratitude from senior management head office. always complaining. have to work a lot for poor pay. Advice to Management treat stuff better. they are the ones working to make the money to full your pockets with bonuses which staff do not see and impossible to get. they have a better understanding what customers want as they are there day in day out", "rating": 1, "pros": "work with great people instore. free lunch", "cons": "not good pay. long hours no gratitude from senior management head office. always complaining. have to work a lot for poor pay.", "advice": "treat stuff better. they are the ones working to make the money to full your pockets with bonuses which staff do not see and impossible to get. they have a better understanding what customers want as they are there day in day out"}, {"title": "First class employer?", "text": "Pros Easy start with supportive colleagues. Cons Good first job but limited opportunity to grow", "rating": 3, "pros": "Easy start with supportive colleagues.", "cons": "Good first job but limited opportunity to grow", "advice": null}, {"title": "Poor pay, and no real career progression", "text": "Pros Free food at the end of the shift if you are closing and flexible hours. Specially if you are doing early mornings. Cons Poor management at area manager level. The pay is also very low. Customers can be demanding and rude. No real career progression. Advice to Management Listen to your staff and offer a real coaching strategy to keep the talent within the business.", "rating": 3, "pros": "Free food at the end of the shift if you are closing and flexible hours. Specially if you are doing early mornings.", "cons": "Poor management at area manager level.", "advice": "Listen to your staff and offer a real coaching strategy to keep the talent within the business."}, {"title": "Kitchen Leader", "text": "Pros early shifts, £6 lunch allowance. Cons not really any cons", "rating": 5, "pros": "early shifts, £6 lunch allowance.", "cons": "not really any cons", "advice": null}, {"title": "General Manager", "text": "Pros Good opportunities to grow for the team if lucky enough to work for the right shop/area at the right time. Free food. Cons What started as a family business is now being run by a group of senior managers bullying their way into transforming the company into Pret. The team is expected to work unlimited numbers of hours, being paid peanuts and being given a hard time if refusing to do so. The company is clearly going south. It is not clear what the company is all about except a desperate attempt to make money copying competition. It seems pretty obvious that the lack of personality and originality is the reason why it doesn’t take off... who wants to go to the second rate version of a big brand? If people want Pret, they’ll go to Pret. The morale in the stores doesn’t help of course. Miserable, exhausted staff, working under pressure and fear to be the next one to go... which doesn’t seem to be a problem since an ex friend/colleague from Pret/Itsu will happily join to replace us. Advice to Management Be nice. People work for people they like, not for people they’re scared of. Give your teams the tools to be successful instead of expecting them to make magic under threats and fear. Be humble. Because you were successful in a previous company, doesn’t mean you can come in and treat everyone like ****. Especially considering the fact it hasn’t proven to be helpful to turn the company around.", "rating": 1, "pros": "Good opportunities to grow for the team if lucky enough to work for the right shop/area at the right time.", "cons": "What started as a family business is now being run by a group of senior managers bullying their way into transforming the company into Pret. The team is expected to work unlimited numbers of hours, being paid peanuts and being given a hard time if refusing to do so.", "advice": "Be nice. People work for people they like, not for people they’re scared of."}, {"title": "Customs host", "text": "Pros Very friendly n always motivated Cons Need to improve more of they stander Advice to Management Need more management", "rating": 5, "pros": "Very friendly n always motivated", "cons": "Need to improve more of they stander", "advice": "Need more management"}, {"title": "Customer Host", "text": "Pros Friendly colleagues Free Lunch and Hot Drinks Busy environment Cons Poor management Never received great training", "rating": 3, "pros": "Friendly colleagues", "cons": "Poor management", "advice": null}, {"title": "Kitchen leader", "text": "Pros Excellent experience with customers, food preparation Lots of things u can learn Cons not good hourly pay rate", "rating": 5, "pros": "Excellent experience with customers, food preparation", "cons": "not good hourly pay rate", "advice": null}, {"title": "Eat jobs", "text": "Pros - Got to take leftover stock home - Got free coffees Cons - Didn't seem to value employees, there was a certain instance where a customer was racist to an employee and the employee got in trouble for sticking up for themselves - Expected to work a lot of free overtime - When employees voiced concerns over their job, their opinions were often ignored - A lot of bureaucracy - Bad management Advice to Management Listen to your employees, value them more otherwise they will leave", "rating": 1, "pros": "- Got to take leftover stock home", "cons": "- Didn't seem to value employees, there was a certain instance where a customer was racist to an employee and the employee got in trouble for sticking up for themselves", "advice": "Listen to your employees, value them more otherwise they will leave"}, {"title": "Very good", "text": "Pros Hardworking and lively atmosphere, very helpful. Cons Too busy and sometimes would get very stressfull", "rating": 5, "pros": "Hardworking and lively atmosphere, very helpful.", "cons": "Too busy and sometimes would get very stressfull", "advice": null}, {"title": "Barista", "text": "Pros Teamwork, friendship, free coffee, staff meal Cons Pay, long working hours, double shifts Advice to Management Fair salary", "rating": 3, "pros": "Teamwork, friendship, free coffee, staff meal", "cons": "Pay, long working hours, double shifts", "advice": "Fair salary"}, {"title": "Friendly Workplace", "text": "Pros Workmates is friendly and teach me how to work there. Cons I don't know for other people but i feel schedule is inflexible.", "rating": 5, "pros": "Workmates is friendly and teach me how to work there.", "cons": "I don't know for other people but i feel schedule is inflexible.", "advice": null}, {"title": "Don't bother yourself", "text": "Pros Discount on the food And really that all I can think about if I'm honest. I have to write a minimum of 20 words and I really can't think Cons Racism I was physically attached by one of the members of staff and called a monkey. I had to get the police involved. I then moved another site and the bullying continued. Advice to Management Don't have Manager or site managers that are racist simple", "rating": 1, "pros": "Discount on the food", "cons": "Racism", "advice": "Don't have Manager or site managers that are racist simple"}, {"title": "Customer host that runs the shop!!?!?!", "text": "Pros None I can think of. Cons Bullying. Seen 5 starters come and go, most left in tears. supervisor shortage so they push you to run the evening shifts with no training and on minimum wage. Basically it's a full time constant cleaning job with pressure coming from head office onto the store manager who then takes it out on his staff. Lastly, they try to screw u out of money by working late and 'forgetting' to add it to your time sheet. Ridiculous low shop budgets. Don't work for them.... soul destroying. Advice to Management More staff training needed at the beginning of employment... not 3 months into the job!", "rating": 1, "pros": "None I can think of.", "cons": "Bullying. Seen 5 starters come and go, most left in tears. supervisor shortage so they push you to run the evening shifts with no training and on minimum wage. Basically it's a full time constant cleaning job with pressure coming from head office onto the store manager who then takes it out on his staff. Lastly, they try to screw u out of money by working late and 'forgetting' to add it to your time sheet. Ridiculous low shop budgets. Don't work for them.... soul destroying.", "advice": "More staff training needed at the beginning of employment... not 3 months into the job!"}, {"title": "Great team awful company", "text": "Pros Great team work , company provides lots of training courses Cons Low pay long hours impossible targets higher management rude and think bullying is good way to manage people Advice to Management Don't bully your employees and revise. Company's targets to meet actual conditions of market", "rating": 3, "pros": "Great team work , company provides lots of training courses", "cons": "Low pay long hours impossible targets higher management rude and think bullying is good way to manage people", "advice": "Don't bully your employees and revise. Company's targets to meet actual conditions of market"}, {"title": "No no no", "text": "Pros There aren't any pros in this place Cons Very hard physical job, I'm a sport person, and I lost 6 kg working there. Managers push too much, schedules are caray and always different, and the payment is not worth it. No bonus, no paid overtime (and you cannot go home until you finish your duties), and the lunch they offer is definitelly not enough for such a long and hard day. Advice to Management Take more care of your employees.", "rating": 1, "pros": "There aren't any pros in this place", "cons": "Very hard physical job, I'm a sport person, and I lost 6 kg working there.", "advice": "Take more care of your employees."}, {"title": "Overworked and undervalued", "text": "Pros Good locations, free lunches and coffee Cons Hard work with little recognition or reward Advice to Management Value your employees", "rating": 3, "pros": "Good locations, free lunches and coffee", "cons": "Hard work with little recognition or reward", "advice": "Value your employees"}, {"title": "A little like Hell and Ground Hog Day", "text": "Pros £6 food allowance . Really nice customers Cons All communication from management negative . Very rude sarcastic managers who emphasise the negative in all situations . Unable to deal with any kind of complaint, seems unable to grasp the basic fundamentals of a complaint. Whatever duty you do, it will be criticised and then you will be told you took to long. No cleaning rota in place so cleaning used as punishment. Only ever saw one person being trained whilst I was there for 10 months. Also they move you around with only 18 hours notice. Managers don't respond when you say 'Good Morning ' . Lots of shouting and bullying of staff humiliating and degrading treatment. Also other languages regularly spoken. Advice to Management Just because managers have worked for Pret doesn't mean they are competent or good. When you have 20% of managers from another company isn't that a hostile takeover ? Managers should be trained for the role they are carrying out .", "rating": 1, "pros": "£6 food allowance . Really nice customers", "cons": "All communication from management negative . Very rude sarcastic managers who emphasise the negative in all situations . Unable to deal with any kind of complaint, seems unable to grasp the basic fundamentals of a complaint. Whatever duty you do, it will be criticised and then you will be told you took to long. No cleaning rota in place so cleaning used as punishment. Only ever saw one person being trained whilst I was there for 10 months. Also they move you around with only 18 hours notice. Managers don't respond when you say 'Good Morning ' . Lots of shouting and bullying of staff humiliating and degrading treatment. Also other languages regularly spoken.", "advice": "Just because managers have worked for Pret doesn't mean they are competent or good. When you have 20% of managers from another company isn't that a hostile takeover ? Managers should be trained for the role they are carrying out ."}, {"title": "costumer host", "text": "Pros You get lunch and breakfast if you have to work on early shifts. Also you get all the hot drinks that you want during your shift. Cons You don't have many days off. It's usual to work for more than 40 hours a week, even 50 hours with just one day off a week.", "rating": 3, "pros": "You get lunch and breakfast if you have to work on early shifts. Also you get all the hot drinks that you want during your shift.", "cons": "You don't have many days off. It's usual to work for more than 40 hours a week, even 50 hours with just one day off a week.", "advice": null}, {"title": "Just like working in Asia", "text": "Pros Discount and £6 lunch. Sometimes also £2 breakfast . Cons Need to do too many things at the same time. So nothing get done properly and people get exhausted. Which leads to more people leaving and short on staff and more pressure on the new staff. Everything for the minimum wage. No one cares about the team members. It's all about the customers. But do more things for the customers is somehow not allowed,because that's not the policy or rules . Advice to Management People would work more efficiently when they are happy or at least feel appreciated. And don't nagging us about the policies which you should follow but rarely did.", "rating": 1, "pros": "Discount and £6 lunch. Sometimes also £2 breakfast .", "cons": "Need to do too many things at the same time. So nothing get done properly and people get exhausted. Which leads to more people leaving and short on staff and more pressure on the new staff. Everything for the minimum wage. No one cares about the team members. It's all about the customers. But do more things for the customers is somehow not allowed,because that's not the policy or rules .", "advice": "People would work more efficiently when they are happy or at least feel appreciated. And don't nagging us about the policies which you should follow but rarely did."}, {"title": "General Manager", "text": "Pros Management role has a good holiday pack (25 working days+bank holidays), sick pay in full, 50% off in all the branches Cons Due to rebranding few years ago, the company took a mortgage to finance the whole process and pressure is high to achieve targets, part of the senior management don't know your name and identify you as store performance, salary low for the amount of pressure that you get as store manager Advice to Management Improve salary and pay by hour rate, turnover is high due to competitor paying more.", "rating": 3, "pros": "Management role has a good holiday pack (25 working days+bank holidays), sick pay in full, 50% off in all the branches", "cons": "Due to rebranding few years ago, the company took a mortgage to finance the whole process and pressure is high to achieve targets, part of the senior management don't know your name and identify you as store performance, salary low for the amount of pressure that you get as store manager", "advice": "Improve salary and pay by hour rate, turnover is high due to competitor paying more."}, {"title": "Barista", "text": "Pros Great Team Great Environment Good Food, which you can take for free if you are closing, and if it wont go to charity. 6 pounds allowance for meal Great place to develop your management skills Cons Should be better paid High Turnover due to that", "rating": 3, "pros": "Great Team", "cons": "Should be better paid", "advice": null}, {"title": "Customer host", "text": "Pros Manager was great and nice Cons Shift runner was lazy and ate most of the stock once the manager went home", "rating": 1, "pros": "Manager was great and nice", "cons": "Shift runner was lazy and ate most of the stock once the manager went home", "advice": null}, {"title": "Can be exciting", "text": "Pros Lovely food Energetic Free food - if you're doing the closing shift you can take anything that won't last til next trading day home Vast majority in central London locations Cons Long hours Heavy lifting Wages low Ridiculously implemented mystery diner bonus scheme High staff turnover Understaffed Advice to Management Raise wages Give higher pay as you increase responsibility Better training More communication", "rating": 3, "pros": "Lovely food", "cons": "Long hours", "advice": "Raise wages"}, {"title": "very difficult", "text": "Pros - some free food - some nice people - easy to get Cons - you are expected to work at top speed at all times which can be exhausting - salary Advice to Management pay your staff better", "rating": 1, "pros": "- some free food", "cons": "- you are expected to work at top speed at all times which can be exhausting", "advice": "pay your staff better"}, {"title": "My Review", "text": "Pros £6 a day to spend on lunch. The range of food and flavours is good. Cons Giving me less amount of hours that I'm contracted to work means I get less pay. Advice to Management N/A", "rating": 5, "pros": "£6 a day to spend on lunch.", "cons": "Giving me less amount of hours that I'm contracted to work means I get less pay.", "advice": "N/A"}, {"title": "It's ok ...", "text": "Pros Free lunch, good people to work with , great and fun team Cons long working hours sometimes the budget can be unrealistic", "rating": 3, "pros": "Free lunch, good people to work with , great and fun team", "cons": "long working hours", "advice": null}, {"title": "Terrible Place to Work", "text": "Pros A £6 lunch allowance. No other pros. Cons A bullying culture all the way from the top, all the way down to management. Unrealistic sales targets, and a constant expectation to reduce costs (labour, waste, etc) even when it's impossible. They place barriers for career advancement on people who have families and other responsibilities outside of work, because they expect you to be \"fully flexible\" - that is to say, A SLAVE. Advice to Management Treat your workers with dignity.", "rating": 1, "pros": "A £6 lunch allowance. No other pros.", "cons": "A bullying culture all the way from the top, all the way down to management. Unrealistic sales targets, and a constant expectation to reduce costs (labour, waste, etc) even when it's impossible. They place barriers for career advancement on people who have families and other responsibilities outside of work, because they expect you to be \"fully flexible\" - that is to say, A SLAVE.", "advice": "Treat your workers with dignity."}, {"title": "AM", "text": "Pros free lunch and no more words Cons basic salary. AM earns less than a SR, unacceptable! provide training to new GMs coming from pret/itsu even some of them are incompetent no life balance: 50 hrs pw and a lot of time spent for free no internal development lack of training. Development and learning/training unit...out Let's wait if the new Chief can re-build this ruined company Advice to Management communication and follow the stores. the stores are not number growing in lfl, but people. ASK listen and follow", "rating": 1, "pros": "free lunch and no more words", "cons": "basic salary. AM earns less than a SR, unacceptable!", "advice": "communication and follow the stores."}, {"title": "Good Team", "text": "Pros Good Team, Progression Career-wise if you work hard Cons low basic salary High turn-over Physical job", "rating": 3, "pros": "Good Team, Progression Career-wise if you work hard", "cons": "low basic salary", "advice": null}, {"title": "Overall, not too great", "text": "Pros Good team, very sociable Nice food Somewhat flexible 50% discount when not working Cons Low wage in comparison to amount of work Long hours and psychically demanding work Endless rules and unrealistic standards Advice to Management More transparency with staff; ask for staff and customer opinions on changes because some seem a bit ridiculous. Prevent managers from taking advantage of staff and working way more hours than contracted", "rating": 3, "pros": "Good team, very sociable", "cons": "Low wage in comparison to amount of work", "advice": "More transparency with staff; ask for staff and customer opinions on changes because some seem a bit ridiculous."}, {"title": "Terrible", "text": "Pros the only pro is that u get lunch free Cons Its like slave labour , they make u stay and don't pay you for it and looking to report them to the officials because since i started working there i been forced to stay at least an hour over time so I've done 8 hours free work which to me is a lot of money had to leave due to that.", "rating": 1, "pros": "the only pro is that u get lunch free", "cons": "Its like slave labour , they make u stay and don't pay you for it and looking to report them to the officials because since i started working there i been forced to stay at least an hour over time so I've done 8 hours free work which to me is a lot of money had to leave due to that.", "advice": null}, {"title": "Not a good place to work at", "text": "Pros No pros whatsoever. Employees are treated like rubbish Cons Bullying culture coming from the head office. Ridiculous expectations (trying to make profit without investing and without staff). Advice to Management If you want to run a shop, you need to have staff working in it. Common sense, please.", "rating": 1, "pros": "No pros whatsoever. Employees are treated like rubbish", "cons": "Bullying culture coming from the head office. Ridiculous expectations (trying to make profit without investing and without staff).", "advice": "If you want to run a shop, you need to have staff working in it. Common sense, please."}, {"title": "Do not apply!!", "text": "Pros Silly company with no pros whatsoever Cons Totally agree with the recent review. Have been working in the company for a year and already seen so many changes. Changes which are all down to people from Pret. There is A LOT of bullying culture in the shops...mostly from general and area managers.General managers are pressurized to hit targets and if they don't they get blamed. In turn,they themselves start blaming the shift runners and assistant managers for not increasing the sales...rather than actually working together as a team,some managers prefer just to point finger at staff and blame them on failures. Also,there are a lot of changes on payments...most people now only on minimum wage...no chance for pay rise! Never ever apply!! Advice to Management Close this silly company. All you do is copy Pret with awful results! Unless you start actually treating your staff with respect you will continue to lose people!", "rating": 1, "pros": "Silly company with no pros whatsoever", "cons": "Totally agree with the recent review. Have been working in the company for a year and already seen so many changes. Changes which are all down to people from Pret. There is A LOT of bullying culture in the shops...mostly from general and area managers.General managers are pressurized to hit targets and if they don't they get blamed. In turn,they themselves start blaming the shift runners and assistant managers for not increasing the sales...rather than actually working together as a team,some managers prefer just to point finger at staff and blame them on failures. Also,there are a lot of changes on payments...most people now only on minimum wage...no chance for pay rise! Never ever apply!!", "advice": "Close this silly company. All you do is copy Pret with awful results! Unless you start actually treating your staff with respect you will continue to lose people!"}, {"title": "Bullying culture", "text": "Pros There are no pros to working for EAT. if you are considering applying here I would advise you don't. Cons They are now just trying to copy pret completely. All the new head office management are from pret. They are unfairly sacking people so they can bring their friends from pret. They told all shops to hire more people 6 months ago now they are demanding managers start to get rid of people because they want to cut the wages bill. Same story with waste targets. There is a horrible bullying culture starting to run through the company which starts from the top. They want everyone to work like machines for minimum wage. So I'm summary if you want a job where you are expected to do the work of three people and get paid the legal minimum whilst getting treated like rubbish and then potentially sacked for no reason, then EAT is the place for you. Don't put yourself through it guys there is plenty of companies out there that provide better jobs than with these jokers. Advice to Management Good luck trying to turn the company in to a carbon copy of pret. I hope your strategy of bringing all your friends fails. The way you are treating people is morally and occasionally legally wrong. I hope you get buried in employment tribunals and go bankrupt.", "rating": 1, "pros": "There are no pros to working for EAT. if you are considering applying here I would advise you don't.", "cons": "They are now just trying to copy pret completely. All the new head office management are from pret. They are unfairly sacking people so they can bring their friends from pret. They told all shops to hire more people 6 months ago now they are demanding managers start to get rid of people because they want to cut the wages bill. Same story with waste targets. There is a horrible bullying culture starting to run through the company which starts from the top. They want everyone to work like machines for minimum wage. So I'm summary if you want a job where you are expected to do the work of three people and get paid the legal minimum whilst getting treated like rubbish and then potentially sacked for no reason, then EAT is the place for you. Don't put yourself through it guys there is plenty of companies out there that provide better jobs than with these jokers.", "advice": "Good luck trying to turn the company in to a carbon copy of pret. I hope your strategy of bringing all your friends fails. The way you are treating people is morally and occasionally legally wrong. I hope you get buried in employment tribunals and go bankrupt."}, {"title": "6 years, made lots of friends!!", "text": "Pros Opportunities to grow. If you work hard and care about what you do, you can go far. Depending on your area manager, they care about people. Free food and a decent bonus scheme. Cons Too much change with very little notice. Restrictions on labour spend leads to a lot of over worked, tired managers and customer hosts. Advice to Management Better communication on product launches. Don't expect what we've previously learned as standards to change over night! Employ new area managers with better people skills.", "rating": 5, "pros": "Opportunities to grow. If you work hard and care about what you do, you can go far.", "cons": "Too much change with very little notice. Restrictions on labour spend leads to a lot of over worked, tired managers and customer hosts.", "advice": "Better communication on product launches. Don't expect what we've previously learned as standards to change over night! Employ new area managers with better people skills."}, {"title": "Customer Host", "text": "Pros Opportunities to grow. If you work hard and care about what you do, you can go far. Depending on your area manager, they care about people. Free food and a decent bonus scheme. Cons Too much change with very little notice. Restrictions on labour spend leads to a lot of over worked, tired managers and customer hosts. Advice to Management Better communication on product launches. Don't expect what we've previously learned as standards to change over night! Employ new area managers with better people skills.", "rating": 5, "pros": "Opportunities to grow. If you work hard and care about what you do, you can go far.", "cons": "Too much change with very little notice. Restrictions on labour spend leads to a lot of over worked, tired managers and customer hosts.", "advice": "Better communication on product launches. Don't expect what we've previously learned as standards to change over night! Employ new area managers with better people skills."}, {"title": "Customer Host", "text": "Pros Free hot drinks and daily allowance of food Cons Quite high staff turnover at my store and the quality of staff varies too much, resulting in some staff working a lot to cover those who lack the initiative and motivation Advice to Management Select job applicants more carefully and only hire those who show the requisite quality/attitude/commitment after completing the 3-month probation.", "rating": 3, "pros": "Free hot drinks and daily allowance of food", "cons": "Quite high staff turnover at my store and the quality of staff varies too much, resulting in some staff working a lot to cover those who lack the initiative and motivation", "advice": "Select job applicants more carefully and only hire those who show the requisite quality/attitude/commitment after completing the 3-month probation."}, {"title": "Dissapointing", "text": "Pros free food - not much else to put here but it keeps saying to put more word.... ¯\\_(ツ)_/¯ Cons Lead you on to keep you coming in, but really going nowhere fast! Advice to Management Stop discrimination against us!", "rating": 1, "pros": "free food - not much else to put here but it keeps saying to put more word.... ¯\\_(ツ)_/¯", "cons": "Lead you on to keep you coming in, but really going nowhere fast!", "advice": "Stop discrimination against us!"}, {"title": "Experience as a Customer host.", "text": "Pros Multitask, it helps you to develop your customer attention level. Cons Extremely demanding and requires concentration on every task. Undercover customers can be very annoying while evaluating.", "rating": 3, "pros": "Multitask, it helps you to develop your customer attention level.", "cons": "Extremely demanding and requires concentration on every task. Undercover customers can be very annoying while evaluating.", "advice": null}, {"title": "CUSTOMER SERVICE HOST", "text": "Pros - free lunch - meet new people - improve your english skills if you're new in the country Cons - atmosphere depends on the moody people - changeable rota, each week - no sick days Advice to Management hire people who really want to work, not lazy people for who the rest have to do most of the work", "rating": 3, "pros": "- free lunch", "cons": "- atmosphere depends on the moody people", "advice": "hire people who really want to work, not lazy people for who the rest have to do most of the work"}, {"title": "current review", "text": "Pros Free Food is one good pros other than that i have not seen any other pros Cons will update soon on this matter its been one month all ready", "rating": 5, "pros": "Free Food is one good pros other than that i have not seen any other pros", "cons": "will update soon on this matter its been one month all ready", "advice": null}, {"title": "Ok company...but", "text": "Pros If you're lucky with your manager,you can be promoted very quickly. Was promoted before I even finished with my probation period; started my shift runners training on my 4th month in the company Cons Don't expect to be paid more than a minimum wage!! Even shift runners only make around £8 p/h. Disgraceful!!! Advice to Management If you want to keep your good staff, start paying the London Living Wage!!!!!", "rating": 3, "pros": "If you're lucky with your manager,you can be promoted very quickly. Was promoted before I even finished with my probation period; started my shift runners training on my 4th month in the company", "cons": "Don't expect to be paid more than a minimum wage!! Even shift runners only make around £8 p/h. Disgraceful!!!", "advice": "If you want to keep your good staff, start paying the London Living Wage!!!!!"}, {"title": "Under new management", "text": "Pros Great food allowance and nice people. Cons Can be hard work at times.", "rating": 5, "pros": "Great food allowance and nice people.", "cons": "Can be hard work at times.", "advice": null}, {"title": "customer host", "text": "Pros free drink and meal during the shift Cons very busy during lunch time", "rating": 3, "pros": "free drink and meal during the shift", "cons": "very busy during lunch time", "advice": null}, {"title": "Good starting point", "text": "Pros Easy to get employed if you speak some English, no experience required Small teams of people, easy to create a bond Managers are usually quite lenient and you can customize your working hours to an extend Easy to evolve through the company Cons Minimum wage and the demands rise while the wage doesn't Management cares more about the customers than the own employees You are expendable. This is a London based company and you can easily be replaced by the thousands other young people looking for work Advice to Management Make an effort to keep your employees. I don't understand how it's preferable to hire and train new people instead of keeping your already trained people happy enough to stay in your company.", "rating": 3, "pros": "Easy to get employed if you speak some English, no experience required", "cons": "Minimum wage and the demands rise while the wage doesn't", "advice": "Make an effort to keep your employees. I don't understand how it's preferable to hire and train new people instead of keeping your already trained people happy enough to stay in your company."}, {"title": "EAT", "text": "Pros you are meeting a new people, learn how to work as a team. Cons Sometimes you have to push other, to do something..", "rating": 3, "pros": "you are meeting a new people, learn how to work as a team.", "cons": "Sometimes you have to push other, to do something..", "advice": null}, {"title": "customer host", "text": "Pros You can get food sometimes free hot drinks Cons i had an unpleasant experience with the manager. People were leaving and she needed to employ many in the same time, so we got poor training, and also bad attitude. Advice to Management Understand that we are people, treat us nice so we will treat you the same. Don't expect any respect if you don't offer.", "rating": 3, "pros": "You can get food sometimes", "cons": "i had an unpleasant experience with the manager. People were leaving and she needed to employ many in the same time, so we got poor training, and also bad attitude.", "advice": "Understand that we are people, treat us nice so we will treat you the same. Don't expect any respect if you don't offer."}, {"title": "ESCAPE FROM THIS COMPANY!", "text": "Pros the £6 allowance meal in the break Cons Lots of work for the minimum wage, no organisation at all! They will try to take advance from the ppl who come from another country, I do not recommend work here", "rating": 1, "pros": "the £6 allowance meal in the break", "cons": "Lots of work for the minimum wage, no organisation at all!", "advice": null}, {"title": "Well if you have to pay your bills...", "text": "Pros Finally raised the wages up Cons Guess why so many people leave the company...?", "rating": 3, "pros": "Finally raised the wages up", "cons": "Guess why so many people leave the company...?", "advice": null}, {"title": "Bad Experience from the beggining", "text": "Pros If you have to pay your bill and don´t want to buy food anymore (at the end of the day usually there are stock that goes to charity, to waste, or to you. Cons Really bad manager, staff blaming against each other... poor experience Advice to Management Treat your staff with respect, sometimes a smle could be amazing as well.", "rating": 1, "pros": "If you have to pay your bill and don´t want to buy food anymore (at the end of the day usually there are stock that goes to charity, to waste, or to you.", "cons": "Really bad manager, staff blaming against each other... poor experience", "advice": "Treat your staff with respect, sometimes a smle could be amazing as well."}, {"title": "Good atmosphere", "text": "Pros £6 worth of lunch Discount on food Cons co workers are a bit mean Advice to Management check to see if your workers have a healthy relationship with each other", "rating": 5, "pros": "£6 worth of lunch", "cons": "co workers are a bit mean", "advice": "check to see if your workers have a healthy relationship with each other"}, {"title": "Bullying culture", "text": "Pros Shift Food allowance. Possible to move up if you're a favourite. Cons 6 am start, accepted bullying culture, minimum wage, uneducated migrants who are managers but don't have a clue how to effectively manage a team of bullies. Advice to Management Sort out you're team of bullies. Ask new starters how they feel about the job and team instead of asking you're team of bullies how new starters are getting on. Read books about management and go on management courses", "rating": 1, "pros": "Shift Food allowance. Possible to move up if you're a favourite.", "cons": "6 am start, accepted bullying culture, minimum wage, uneducated migrants who are managers but don't have a clue how to effectively manage a team of bullies.", "advice": "Sort out you're team of bullies. Ask new starters how they feel about the job and team instead of asking you're team of bullies how new starters are getting on. Read books about management and go on management courses"}, {"title": "terrible work place", "text": "Pros 6 pounds allowance, 50% staff discount Cons they don't pay for break, pay is very low, too much work to do", "rating": 1, "pros": "6 pounds allowance, 50% staff discount", "cons": "they don't pay for break, pay is very low, too much work to do", "advice": null}, {"title": "Terrible", "text": "Pros Flexibility in working shifts. Lots of free food at the end of the day. The meal allowance allows you to get free lunch during your shift, however read more about this in the cons. Cons No one cares about you, even if you get that impression, forget it! Especially people in charge like head office. Break unpaid. £6 allowance guarantees you a sandwich if you're lucky because the prices are expensive. They hire EVERYONE and I mean everyone. You don't speak English? Fine with us! You don't seem to smile or be interested in anything? Fine with us! They promote a lot and it might seem like a good thing but it's not, because sometimes you find a manager that knows less than you and is not able to be a manager. No way of getting a bonus! Only if your shop earns a lot of money and they like, and that surely doesn't depend on you. Advice to Management Start caring about your employees and maybe you will be a bit more appreciated. It's a shame.", "rating": 1, "pros": "Flexibility in working shifts.", "cons": "No one cares about you, even if you get that impression, forget it! Especially people in charge like head office.", "advice": "Start caring about your employees and maybe you will be a bit more appreciated. It's a shame."}, {"title": "Really good atmosphere", "text": "Pros Good fun, customers and staff alike are friendly. I worked in a busy store so there was never a dull moment. When I worked there there was a bonus of £1 per hour if your store did well which really made a difference. They are keen to help you progress your career with them, training for barista and so on. They wash your uniform for you which is great! Cons 6am start times for morning shifts, can be hard being on your feet all day.", "rating": 5, "pros": "Good fun, customers and staff alike are friendly. I worked in a busy store so there was never a dull moment. When I worked there there was a bonus of £1 per hour if your store did well which really made a difference. They are keen to help you progress your career with them, training for barista and so on. They wash your uniform for you which is great!", "cons": "6am start times for morning shifts, can be hard being on your feet all day.", "advice": null}, {"title": "Customer Host at Eat", "text": "Pros None except 6£ food allowance per shift Cons Supressed paid breaks, now employees have to wash their shirts, hours and shifts negociated when signing the contract are not respected, no real training provided, not even 1minute break when 5 hours shift or less.", "rating": 1, "pros": "None except 6£ food allowance per shift", "cons": "Supressed paid breaks, now employees have to wash their shirts, hours and shifts negociated when signing the contract are not respected, no real training provided, not even 1minute break when 5 hours shift or less.", "advice": null}, {"title": "Great company and team", "text": "Pros Was very easy to work in the company, had a great team and the GM. The application process had 3 stages - application online, phone interview and the assessment centre. The main thing is to show your enthusiasm! Cons Not as highly paid, but still okay. Sometimes was asked to stay longer, but since it's an hourly paid position, it was not a big problem. Advice to Management Keep doing the great job! The assessment centre in London is great fun, hope you are keeping it up.", "rating": 5, "pros": "Was very easy to work in the company, had a great team and the GM. The application process had 3 stages - application online, phone interview and the assessment centre. The main thing is to show your enthusiasm!", "cons": "Not as highly paid, but still okay. Sometimes was asked to stay longer, but since it's an hourly paid position, it was not a big problem.", "advice": "Keep doing the great job! The assessment centre in London is great fun, hope you are keeping it up."}, {"title": "EAT customer host", "text": "Pros In-house recruiter thus offers strong growth potential within the company. Cons Lack of care fo staff, poorly paid, wasteful ethos, huge staff turnover.", "rating": 1, "pros": "In-house recruiter thus offers strong growth potential within the company.", "cons": "Lack of care fo staff, poorly paid, wasteful ethos, huge staff turnover.", "advice": null}, {"title": "Terrible!!", "text": "Pros - You can bring home food at the end of the day - 6 pounds for lunch in store But this is about it Cons - Dishonest - They say they will increase your salary to appear that you are getting paid more but they will stop paying breaks so in fact you will actually end up earning less. - Terrible pay - You only get 30 minutes break (which will very soon be unpaid) - Sometimes you are not told by management what days and hours you will be working until the day before. - You are pretty much a cleaner that also makes coffee Advice to Management Pay your staff more, find more competent and better trained managers and keep paying for breaks.", "rating": 1, "pros": "- You can bring home food at the end of the day", "cons": "- Dishonest - They say they will increase your salary to appear that you are getting paid more but they will stop paying breaks so in fact you will actually end up earning less.", "advice": "Pay your staff more, find more competent and better trained managers and keep paying for breaks."}, {"title": "glorified cleaner", "text": "Pros paid breaks/£6 food allowancper day (will stop shortly}free coffee/tea(for now) Cons un reachable bonus scheme,poor training,weak management,poor recruitment system,no trust/support from managers and head office., Advice to Management listen/support and trust your staff.treat everyone equally stop having favourites,", "rating": 1, "pros": "paid breaks/£6 food allowancper day (will stop shortly}free coffee/tea(for now)", "cons": "un reachable bonus scheme,poor training,weak management,poor recruitment system,no trust/support from managers and head office.,", "advice": "listen/support and trust your staff.treat everyone equally stop having favourites,"}, {"title": "Worst Place i ve worked", "text": "Pros You can have a paid break of 30m and eat for free. Cons Low Salary, Low chance to grow up, low culture. Stupid Manager and Supervisors A lot of Clean Work", "rating": 1, "pros": "You can have a paid break of 30m and eat for free.", "cons": "Low Salary, Low chance to grow up, low culture.", "advice": null}, {"title": "Good money for living", "text": "Pros Friendly people, fun working environment, no politicians, delicious food, soups, sandwich, hot pots, breakfast menu, English food, salad, yogurts. staff meal, airport heathrow fun place to work. Cons London, heathrow t5, British airways. Advice to Management Good management, understanding, helpful, friendly.", "rating": 5, "pros": "Friendly people, fun working environment, no politicians, delicious food, soups, sandwich, hot pots, breakfast menu, English food, salad, yogurts. staff meal, airport heathrow fun place to work.", "cons": "London, heathrow t5, British airways.", "advice": "Good management, understanding, helpful, friendly."}, {"title": "Thankless", "text": "Pros free food allowance- ok hours. Cons worked into the ground, low pay, glorified cleaner, co workers dont speak english Advice to Management value employees", "rating": 3, "pros": "free food allowance- ok hours.", "cons": "worked into the ground, low pay, glorified cleaner, co workers dont speak english", "advice": "value employees"}, {"title": "It demoralizes you.", "text": "Pros 6 pounds to eat everyday. 30 minute break every 5 hours. Cons Inhuman salary for the effort.", "rating": 1, "pros": "6 pounds to eat everyday.", "cons": "Inhuman salary for the effort.", "advice": null}, {"title": "Stay Away", "text": "Pros £6 worth of quality food for lunch, £2 breakfast if you start before 6.30, benefit website allowing you to get discounts ( to be launched mid November) Cons I have started working for EAT about 10 months ago as GM, and I was really excited. My 4 weeks training was not great, I had loads of gaps they showed up once I started to run my own shop. I have learned everything pretty much as soon as I went to my own branch. Now I have decided to leave company, for numerous reasons. Communication between head office and management is really poor. Head office only care about making profits, they don't care about employees. Every day job gets harder, as expectations raise. Once you have a leaver, you need to prepare yourself for 2- 3 weeks of being understaffed as nobody in company has CH to help you, and recruitment team takes long time to fill vacancies and if they finally manage, there always will be a problem so either they will tell to new starter wrong time for 1st shift or new starter does not have bank details, and they will blame you as someone who did wrong, because they expect you to check. But reasonably, people arriving in London from foreign countries will tell you everything you'd like to hear because they need a job, they need money... They have not increased managers pay this year and they were the only one company to do so, and as a reason as mentioned above - to secure profits. Loads of pressure on SSRs. They want to open new shops and expand but they don't look after shops they already have. Long hours, loads of tasks to complete, hard to keep new starters as nobody wants to work soooo hard for 6.90 while they can go to Costa, Morrisons or Starbucks who already raise pay to £8 ph in London and job is much easier and not so demanding. Advice to Management Management start to listen to their employees and appreciate them, because if you don't, somebody else will.", "rating": 1, "pros": "£6 worth of quality food for lunch, £2 breakfast if you start before 6.30, benefit website allowing you to get discounts ( to be launched mid November)", "cons": "I have started working for EAT about 10 months ago as GM, and I was really excited. My 4 weeks training was not great, I had loads of gaps they showed up once I started to run my own shop. I have learned everything pretty much as soon as I went to my own branch. Now I have decided to leave company, for numerous reasons.", "advice": "Management start to listen to their employees and appreciate them, because if you don't, somebody else will."}, {"title": "Inadequate", "text": "Pros Free meals (but see later). Possibilities of carreer progression (dependent on shop, manager, and luck). Altough, being a manager can be very tough, with no help from the company, so I'm not sure if this counts as 'pro'. Cons I have worked many years with the company. The job was hard, and not for everybody, but that was to be expected. What isn't, is that the company wasn't helping its people at all - in fact, made it harder for them to do their job. There are scarsely enough people at the shops (and it was getting worse-and-worse during my employement), yet the expectations from the staff are higher and higher. I've spent countless hours working for free: if I had to open the shop, and I wanted to do it on time, I had to get there half an hour earlier. When I have closed the shop, it took at least half an hour extra to the things which were minimally required. We could not even have dreamt about having some extra time to do deep cleaning, or to tidy up with paperwork. While the management smiled in our faces, they have actually treated us as we were totally incompetent: they have micromanaged every little aspect of how we do our job, and acted as it was our laziness that we could not cope with the amount of work that has to be done. Also, because we cannot use our common sense but had to listen of how we should run the shop, our job was much harder (of course we could not afford to listen to them in everything, if we do everything as they wanted us to do, that would have been a disaster). Simply there isn't enough people and time to do things by the book, we had to cut corners if wanted to keep up with the peace. And it's not like that if I was slow: all my colleagues, during all those years, have faced the same problems. When I have joined, there were separate positions for team member, barista, kitchen leader etc. My manager didn't even let me on the coffee machine in the first two weeks. Now, every newcomer is required to do a lot more from the beginning. There is even a position called shift runner, when the person have to act as the shop manager, when the real one is not here (and that is not for extreme cases, but on a regular, every day basis, unless the manager is willing work from dusk till dawn). This shift runner position gives a slight increase in pay for those hours when the person is the acting manager. The trick is, anyone can be a shift runner, almost straight from the street, after a two session training and the test. This not only sounds chaotic, but it is: to be an effective store manager, people need valuble experience, which they can gain in years. Putting junior people into these positions seems like a desperate attempt from the company to cut costs. There are shops that are without a manager for months, and being run by baristas, floor managers, shift runners, people, who don't get recongnition for their effort - it is expected from them. The area managers can see, what is going on, but they don't / not allowed to do anything about it. In fact, they don't want to report that things in their area are not going good, because the company doesn't like those who dare to open their mouth about what is happening. Also, why expecting us to do all our job, they don't help us at all. I have heard about a shop, where on langer out of the two was not working and have not been serviced for over a week! Temperature was a yearly issue in the summer, as the air conditioning unit would have to replaced. Every summer, when we started complaining about temperatures over 30-35 degrees Celsius (even more in kitchen), the company was stalling for time until the summer was over. Finally, after many years, it have been replaced. I was taking it more-or-less allright, but my colleagues were not good with high temperatures. On occassion we asked our area manager if we can put a standing fan from Argos, to help us out on the tills during lunchtime. Our request was denied, citing that the fan did not fit into the shops image. Of course, our area manager did not have to work his back off every day in that heat. During the years I have also seen, how things were taken away (altough this happens everywhere): first, full time people were contracted 40 hours, that went down to 35 (they still work 40, or even more hours, but when they go on holiday, they will only get payed for their contracted hours). First we had access to food, iced drinks, now even the battled water has been taken away (yes, we were asked to pay for battled water if did not wanted to drink from the tap). It wasn't better for the shop managers, either: my manager had to cancel her holiday multiple times, because the company refused to give us more people to help out, citing that our budget won't allow it. That is another point: when I've started, people got bonus based on a mistery shopper programme. Every shop had equal chance, we just had to be nice to customers. Simple. Then, they took it away for at least a year, and later re-introduced another programme: a given shop had to beat it's target budget by 5%, so that people can get bonus. My shop was unable to even reach the budget because of the incresed competition around us, and because, with less and less people to serve customers, nobody wanted to stand in long queues and have chosen the competition instead (which made matters progressively worse). So, despite working hard, I haven't had any bonus for years. The screening process for new applicants is also inadequate. Shop managers cannot choose, who ever they want to work with, instead they will get who ever has been sent from the head office. The screening process focuses on how cool and relaxed people look, and not on how sincere or hardworking they will be. Because of this, I have seen many new candidates who should never have been allowed to work with us, and I'm sure that many people who would have been a great help have been declined, just because they were not so chatty and not having a big mouth. Also, the company employs many store managers who are treating their staff very bad, and unless they do something extreme, there is now way they will be removed. Since the company rewards those managers who make the numbers, some managers are willing to go very far, and make their people suffer (but, I'm sure that this happens with other companies, too). One time we had to go to the head office for some sort of training. They told us that 'Now you can finally tell us how to do things better, we listen to your opinion!\". What they did was, they have given us a paper where we had to do give at least 5 reasons of what is essential to be a customer host. Now, this is how much they care about our opinion, and how ridiculous can they be, instead of helping us by giving us more people to work with. Well, they treat as very nicely, but they also turn their backs on us. And also, we are expected to be happy all time, regardless of what is happening. People who dare to complain about their daily struggles, are unpopular ,and if they happen to be shop managers,they can expect lots of nagging from management and area managers. Also, managerial positions are quite shaky: since most managers don't have the resources to do everything by the book, random inspections can turn out to be very bad for them, and after a couple for those, the company has every right to get rid of them. So most people just force their biggest smile when they have to deal with their superiors - they not going to get help anyway. Things have turned noticably worse after the owners decided to sell the company out for investors. There are countless many things, which I'm not going put here. Also, for fairness, I have to say, that not all shops are the same. In some shops, its better, in some places, it might be even worse. The places I have worked, it was bad. Every collague, who left my shop, felt relieved once they have stopped working for EAT, including me. I have seen countless people come and go, but literally there is not single person whom I know and has any fond memories of the time spent there. I would say that every day I have spent there, was a struggle. I guess that says it all. Advice to Management Since their role is to make as much profit as possible with any legal (if not moral) means necessary, they doing a pretty good job. Some of them probably have a knowledge of what is going on, I'm just guessing how hard it is on their conscience.", "rating": 3, "pros": "Free meals (but see later). Possibilities of carreer progression (dependent on shop, manager, and luck). Altough, being a manager can be very tough, with no help from the company, so I'm not sure if this counts as 'pro'.", "cons": "I have worked many years with the company. The job was hard, and not for everybody, but that was to be expected. What isn't, is that the company wasn't helping its people at all - in fact, made it harder for them to do their job. There are scarsely enough people at the shops (and it was getting worse-and-worse during my employement), yet the expectations from the staff are higher and higher. I've spent countless hours working for free: if I had to open the shop, and I wanted to do it on time, I had to get there half an hour earlier. When I have closed the shop, it took at least half an hour extra to the things which were minimally required. We could not even have dreamt about having some extra time to do deep cleaning, or to tidy up with paperwork. While the management smiled in our faces, they have actually treated us as we were totally incompetent: they have micromanaged every little aspect of how we do our job, and acted as it was our laziness that we could not cope with the amount of work that has to be done. Also, because we cannot use our common sense but had to listen of how we should run the shop, our job was much harder (of course we could not afford to listen to them in everything, if we do everything as they wanted us to do, that would have been a disaster).", "advice": "Since their role is to make as much profit as possible with any legal (if not moral) means necessary, they doing a pretty good job. Some of them probably have a knowledge of what is going on, I'm just guessing how hard it is on their conscience."}, {"title": "Working at EAT", "text": "Pros Great Environmnet, multinational colleagues, friendly managers, amazing food, opportunities for progress and development Cons - - - - - -", "rating": 5, "pros": "Great Environmnet, multinational colleagues, friendly managers, amazing food, opportunities for progress and development", "cons": "- - - - - -", "advice": null}, {"title": "good", "text": "Pros training, staff engagment, valued, respected Cons work life balance, no other cons", "rating": 5, "pros": "training, staff engagment, valued, respected", "cons": "work life balance, no other cons", "advice": null}, {"title": "apply here to spend 80% of your time cleaning", "text": "Pros - free food that otherwise would be sent to waste. - 50% staff discount - easy job to get Cons - extreme amounts of pressure on customer hosts. - peasant like minimum wage pay - management expect forensic level clean whilst working extremely quickly - many co-workers speak poor english therefore will be difficult to understand each other. Advice to Management -Create true and proper job titles to attract the right people. do not advertise jobs as customer host when in actual fact 70-80% of our time is spent cleaning and being in the kitchen. - management should install a higher pay rate to sort out high labour turnover. - I am currently looking for a more rewarding job.", "rating": 1, "pros": "- free food that otherwise would be sent to waste.", "cons": "- extreme amounts of pressure on customer hosts.", "advice": "-Create true and proper job titles to attract the right people. do not advertise jobs as customer host when in actual fact 70-80% of our time is spent cleaning and being in the kitchen."}, {"title": "the worst job I've ever had", "text": "Pros Free lunch Provided - I cannot think of anything else good to say Cons The business has 2 clear areas of focus: , 1)to reduce its weekly labour spend, this unfortunately, is to the detriment of customer service and team welfare and well being 2) Pret, so focussed on what its main competitor is doing, no clear strategy of its own The senior management team create a culture of fear and pressure, everyone is afraid to speak out and have an opinion Advice to Management if you focussed on developing and retaining the people that work within the brand, this would improve customer service, which in turn would drive sales and then naturally bring your labour spend in line. Create a strategy to deliver a strong brand experience that identifies EAT rather than focus on what Pret are doing and try to copy it", "rating": 1, "pros": "Free lunch Provided - I cannot think of anything else good to say", "cons": "The business has 2 clear areas of focus: , 1)to reduce its weekly labour spend, this unfortunately, is to the detriment of customer service and team welfare and well being", "advice": "if you focussed on developing and retaining the people that work within the brand, this would improve customer service, which in turn would drive sales and then naturally bring your labour spend in line. Create a strategy to deliver a strong brand experience that identifies EAT rather than focus on what Pret are doing and try to copy it"}, {"title": "Satisfactory", "text": "Pros The people (customer) are friendly and do get along even with new staff member as well as old ones, the fresh daily food, and the beautiful atmosphere Cons Inadequate resources through out the branches and short of staffs in most cases. Advice to Management Listen to advice from staff sometimes", "rating": 3, "pros": "The people (customer) are friendly and do get along even with new staff member as well as old ones, the fresh daily food, and the beautiful atmosphere", "cons": "Inadequate resources through out the branches and short of staffs in most cases.", "advice": "Listen to advice from staff sometimes"}, {"title": "OK place to work", "text": "Pros Generally flexible with shifts, Good team to work with, free food at break and after work, Bank holidays off or an extra holiday day instead. Cons Managers moved around a lot, Not fussy enough about who they hire so you get people turning up for a few shifts then disappearing. Advice to Management Be a lot more careful and selective about who you hire, the interview system is a bit of a joke.", "rating": 3, "pros": "Generally flexible with shifts, Good team to work with, free food at break and after work, Bank holidays off or an extra holiday day instead.", "cons": "Managers moved around a lot, Not fussy enough about who they hire so you get people turning up for a few shifts then disappearing.", "advice": "Be a lot more careful and selective about who you hire, the interview system is a bit of a joke."}, {"title": "Customer Host", "text": "Pros Good environment; good team; you can grow quickly Cons less money; disorganized; you don't know your shift until 1 day before", "rating": 3, "pros": "Good environment; good team; you can grow quickly", "cons": "less money; disorganized; you don't know your shift until 1 day before", "advice": null}, {"title": "I quit after 2 months of my work there", "text": "Pros 50% off on food at any time outside of work and 6 pounds allowance during your work plus free tea and coffee Cons I hate them and will never use their service again. I quit after 2 months as any other work is better than this. You don't know your position in store till you will not start work for them. If you will unlucky as I was you will work on kitchen. Customer services? Work on till? Forgot about this then. You have to do food for the company. Ridiculous amount of food. 400 sandwiches plus yoghurt till midday half an hour break and general cleaning of kitchen. You will have kitchen porter job for 6.60 per hour. After every shift I was too tired to enjoy rest of my day. Never again. Advice to Management Stop saving money by expecting more and more staff to do by single person. Employ more people to each store.", "rating": 1, "pros": "50% off on food at any time outside of work and 6 pounds allowance during your work plus free tea and coffee", "cons": "I hate them and will never use their service again. I quit after 2 months as any other work is better than this. You don't know your position in store till you will not start work for them. If you will unlucky as I was you will work on kitchen. Customer services? Work on till? Forgot about this then. You have to do food for the company. Ridiculous amount of food. 400 sandwiches plus yoghurt till midday half an hour break and general cleaning of kitchen. You will have kitchen porter job for 6.60 per hour. After every shift I was too tired to enjoy rest of my day. Never again.", "advice": "Stop saving money by expecting more and more staff to do by single person. Employ more people to each store."}, {"title": "Good!", "text": "Pros Free food when you are closing Cons Hard shifts when you are opening", "rating": 3, "pros": "Free food when you are closing", "cons": "Hard shifts when you are opening", "advice": null}, {"title": "Worst job I've had so far.", "text": "Pros Free food after work, chose my own hours. Cons Rediculous tasks that need to be done at a rediculous pace, boring and the pay was crap!!!! They expect way tooo much from their employers. Worst job I ever had, felt like I was a damn cleaner.", "rating": 3, "pros": "Free food after work, chose my own hours.", "cons": "Rediculous tasks that need to be done at a rediculous pace, boring and the pay was crap!!!! They expect way tooo much from their employers. Worst job I ever had, felt like I was a damn cleaner.", "advice": null}, {"title": "Customer Service Host", "text": "Pros There is a lot of flexibility, loads of good people, great fun customer interaction, delicious free food, good career progression. Cons Management treat like a cog in the machine, pay is poor, asked to do pointless tasks that nobody benefits from.", "rating": 5, "pros": "There is a lot of flexibility, loads of good people, great fun customer interaction, delicious free food, good career progression.", "cons": "Management treat like a cog in the machine, pay is poor, asked to do pointless tasks that nobody benefits from.", "advice": null}, {"title": "Assistant Manager", "text": "Pros You can be a manager quickly here. But consider, that it is not without a reason. Being a manager here sucks, so they keep quiting. Cons This company is just simpy the worst. If you would work in retail, do not expect to be treated like a human. You may not realise it at the beggining. It is a fancy interview, then if you get hired a 'fun' induction day. But then you will realise that it just simpy degrade, humiliate and exhaust you. The company sets unreacheable targets to the shops, and listens to no advise or opinions from shop managers or employees. They are keep cutting the paid hours, so basicly one person will have more and more thing to do. If you do the things the way you should by company rules (etc. you don't start to mop or clean equipments while you are still open, but close to closing), you will not be able to serve customers in time, or finish closing the shop in time. And if you are not finished, you are expected to stay and work unpaid to finish everything. You will not know your shifts in advamce, sometimes only a day before. It means that if you are open 7 days a week, you just simply can not plan any freetime activity. Also, it is common, that you are in the closing team, you finish late evening (8-10pm), and next day you have to be there, opening the shop at 5-6am. Also, do not think that you will have a great company behind you. There are no company events whatsoever. Not even a Christmas party. Only for the office staff sometimes. I think each and every retail fast food chain job is unpaid, unfair, and should not stay that way anyway, but EAT. is the worst, trust me. As a jobseeker, I can only advise to avoid this place, and as a customer, the same. Do not let this company to treat their employees the way they do. Advice to Management To the retail managers: quit, it will make you feel great, you can not let this job take your lives anymore. To the head office: work more than one day in the shops, and than think again the whole cutting-the-labour thing. And maybe hire someone for the head of finance, who can make good decisions for the long run, not killing your staff who faces your customers.", "rating": 1, "pros": "You can be a manager quickly here. But consider, that it is not without a reason. Being a manager here sucks, so they keep quiting.", "cons": "This company is just simpy the worst. If you would work in retail, do not expect to be treated like a human. You may not realise it at the beggining. It is a fancy interview, then if you get hired a 'fun' induction day. But then you will realise that it just simpy degrade, humiliate and exhaust you.", "advice": "To the retail managers: quit, it will make you feel great, you can not let this job take your lives anymore. To the head office: work more than one day in the shops, and than think again the whole cutting-the-labour thing. And maybe hire someone for the head of finance, who can make good decisions for the long run, not killing your staff who faces your customers."}, {"title": "working at EAT", "text": "Pros I had the chance to improve my personal growth and my professional experience. Cons every day is a challenge in satisfying customers with an excellent service and a smile! Advice to Management keep working like that and always give your best", "rating": 5, "pros": "I had the chance to improve my personal growth and my professional experience.", "cons": "every day is a challenge in satisfying customers with an excellent service and a smile!", "advice": "keep working like that and always give your best"}, {"title": "Getting worst by days", "text": "Pros Daily meals £6 to choose from the shop, some flexibility, good to start if you don't know English, good opportunity for foreigners to start something Cons Not paid overtime, not enough staff to do the job properly and constant fear from disciplinary as the standards are ridiculous and you are expected to work more than you are paid for. Disappointed and feel like I wasted my time and never felt appreciated. No more bonuses, no more free water. No stimul to work. There is some chance for development but that only applies if you work in London as they tend to send you around different shops and use you as they pleased. Very high staff turnover which makes your work impossible to do properly. If you get a good manager then it is worth it but in most of the cases management doesn't care and only want without giving back. There is nobody to talk to or to raise concerns as everything depends on your GM. Advice to Management Listen to your staff and respond adequately. Try to make the place better for them to avoid so many people leaving without really wanting to leave. I don't recomend this place", "rating": 1, "pros": "Daily meals £6 to choose from the shop, some flexibility, good to start if you don't know English, good opportunity for foreigners to start something", "cons": "Not paid overtime, not enough staff to do the job properly and constant fear from disciplinary as the standards are ridiculous and you are expected to work more than you are paid for. Disappointed and feel like I wasted my time and never felt appreciated. No more bonuses, no more free water. No stimul to work. There is some chance for development but that only applies if you work in London as they tend to send you around different shops and use you as they pleased. Very high staff turnover which makes your work impossible to do properly. If you get a good manager then it is worth it but in most of the cases management doesn't care and only want without giving back. There is nobody to talk to or to raise concerns as everything depends on your GM.", "advice": "Listen to your staff and respond adequately. Try to make the place better for them to avoid so many people leaving without really wanting to leave."}, {"title": "Excellent Manager, but doesn't always seem to be the case", "text": "Pros The shop I worked in had a great team, but some of the shops seemed to have managers that pushed everyone really hard and didn't appreciate them. Flexible hours and a £1 per hour bonus if your shop meets its targets. Opportunities to train and progress Cons Early starts are a bit of a pain", "rating": 5, "pros": "The shop I worked in had a great team, but some of the shops seemed to have managers that pushed everyone really hard and didn't appreciate them. Flexible hours and a £1 per hour bonus if your shop meets its targets. Opportunities to train and progress", "cons": "Early starts are a bit of a pain", "advice": null}, {"title": "People Centric Family Rooted Food Business", "text": "Pros People development and food offer is constantly updated. If you like constant innovation than this is the company for you. Cons Can be hit or miss depending on the area manager you work with. Can have a tendency to focus on filling gaps quickly rather than with the right people. Advice to Management People team is weak with current People director meaning that ceiling has been met in terms of people innovation.", "rating": 5, "pros": "People development and food offer is constantly updated. If you like constant innovation than this is the company for you.", "cons": "Can be hit or miss depending on the area manager you work with. Can have a tendency to focus on filling gaps quickly rather than with the right people.", "advice": "People team is weak with current People director meaning that ceiling has been met in terms of people innovation."}, {"title": "is getung worse every year", "text": "Pros It is a small company , it's okay to grow and grab something better later Cons make employees work long hours, and each end of finacial year, cut hours , decreases the quality and becomes hell work under those conditions . since the owners sold most of the shares, they focused on opening more stores and forgot how important employees and customers . the budget for employees is low for a company that makes its production in the shop Advice to Management I have seen many people leave the company in my last year, all tired of the constant pressure and low salaries offered compared to closest competitors. the money you save to put pressure on their employees will be spent on training new employees", "rating": 1, "pros": "It is a small company , it's okay to grow and grab something better later", "cons": "make employees work long hours, and each end of finacial year, cut hours , decreases the quality and becomes hell work under those conditions .", "advice": "I have seen many people leave the company in my last year, all tired of the constant pressure and low salaries offered compared to closest competitors."}, {"title": "Never work here", "text": "Pros Best reason is it is a job that pays, you get a £6 meal allowance and you meet some really nice people. Cons The managers don't give a toss about you or anyone expect them. There is rampant racism throughout the stores. You don't get paid holidays you have had authorised and they forget to give you the week off. Worst of all they send a photocopy of your P45, not the original. Advice to Management Buck up your ideas and listen to staff, otherwise you are gonna get a wakeup call and be in deep trouble.", "rating": 1, "pros": "Best reason is it is a job that pays, you get a £6 meal allowance and you meet some really nice people.", "cons": "The managers don't give a toss about you or anyone expect them. There is rampant racism throughout the stores. You don't get paid holidays you have had authorised and they forget to give you the week off. Worst of all they send a photocopy of your P45, not the original.", "advice": "Buck up your ideas and listen to staff, otherwise you are gonna get a wakeup call and be in deep trouble."}, {"title": "Worst salary, bad communication and absolutely disorganised", "text": "Pros Everyone can become manager!the only thing you need to do is go to work and show only 10% of commitment and they will give you the possibility to start your training. A good benefit is £6 of staff meal everyday, water and hot drinks as much as you want and the possibility to work flexible hours. Cons Salary does not reflect the amount of workload and pressure and the bonuses are very poor (speaking from a managerial position). The HR department and Head Office do not support the line managers, who are forced to work up to 50 hours a week, paid only for 40. Customer hosts, lead baristas and trainers are pushed until a breaking point. The Company is asking them to much for too less (minimum wage for the first 3 months and 6.50 up to 7.15 afterwards), maybe forgetting that they are the heart and soul of every shop. Advice to Management It is hard to be a manager underpaid but try to respect the people working with you....they are people even if they are expected to perform as robots", "rating": 1, "pros": "Everyone can become manager!the only thing you need to do is go to work and show only 10% of commitment and they will give you the possibility to start your training.", "cons": "Salary does not reflect the amount of workload and pressure and the bonuses are very poor (speaking from a managerial position). The HR department and Head Office do not support the line managers, who are forced to work up to 50 hours a week, paid only for 40.", "advice": "It is hard to be a manager underpaid but try to respect the people working with you....they are people even if they are expected to perform as robots"}, {"title": "big bold and beautiful......", "text": "Pros its like yoru out with friend in a coffee shop having a chat that just goes on and on.. more people join and leave the conversation.  we play we joke we laugh but best of all we are a family... Cons i feel we work for are team not the company we work hard for the people that will suffer if we don't its not all about the company wanting us to do well but us not wanting are team to in trouble. Advice to Management the less staff the slower the service people = money", "rating": 5, "pros": "its like yoru out with friend in a coffee shop having a chat that just goes on and on.. more people join and leave the conversation.", "cons": "i feel we work for are team not the company we work hard for the people that will suffer if we don't its not all about the company wanting us to do well but us not wanting are team to in trouble.", "advice": "the less staff the slower the service people = money"}, {"title": "Limited career opportunities in head office & general lack of support", "text": "Pros A lot of the employees were genuinely lovely to work with, and in certain departments you do get an opportunity to try new things. There is also a level of autonomy that self starters like myself would thrive off of. Cons It's very difficult to gain respect even if you work yourself over. Senior Management doesn't care at all for your professional development if they might have to pay for it, even if the ROI is demonstrably larger. Salary against the amount of work required is also questionable. \"Values\" are generic safeguards and don't seem to match reality. Attempts made to match these are weak. Advice to Management Work needs to be done to motivate the Head Office staff (too much effort put into retail & production teams) - salaries need to be reviewed and snr management need to understand the value of development. Recently there has been more effort put in to concerned areas, but they need to follow through and not waste valuable time as the brand has massive potential!", "rating": 3, "pros": "A lot of the employees were genuinely lovely to work with, and in certain departments you do get an opportunity to try new things. There is also a level of autonomy that self starters like myself would thrive off of.", "cons": "It's very difficult to gain respect even if you work yourself over. Senior Management doesn't care at all for your professional development if they might have to pay for it, even if the ROI is demonstrably larger. Salary against the amount of work required is also questionable. \"Values\" are generic safeguards and don't seem to match reality. Attempts made to match these are weak.", "advice": "Work needs to be done to motivate the Head Office staff (too much effort put into retail & production teams) - salaries need to be reviewed and snr management need to understand the value of development. Recently there has been more effort put in to concerned areas, but they need to follow through and not waste valuable time as the brand has massive potential!"}, {"title": "started as a good job but went down hill very fast", "text": "Pros half the staff you work with are nice. good to get food. Cons half of the staff are two faced the company is very backwards in terms of sales Advice to Management loom out for the some people in the company who lie a lot and take on board everyone ideas", "rating": 3, "pros": "half the staff you work with are nice. good to get food.", "cons": "half of the staff are two faced the company is very backwards in terms of sales", "advice": "loom out for the some people in the company who lie a lot and take on board everyone ideas"}, {"title": "Horrendous", "text": "Pros None what so ever, have to make this twenty words. There are none. Cons Bullying Underpaid Overworked I worked for EAT for a long time. What a waste. They are awful employers. I even heard the HR manager moan about people with grievances, saying \"why don't they just do their job\" she was amazed that there were so many grievances but if that's her attitude then what does she expect. Foul woman, she might want to try actually looking at why there were so many other than complain about them. My most recent manager was a unpleasant woman. The problem with EAT is that they don't appreciate the people that work for them, it's a bit of an \"old boys club\" where if you are \"in\" your fine, if not then watch your back. I would not recommend working for EAT. Advice to Management For CEO, please take a look at your senior managment team and start again. There are people out there in the world who would benefit the company and staff much more than the current ones. Bullies are not acceptable at any level, let alone managment.", "rating": 1, "pros": "None what so ever, have to make this twenty words. There are none.", "cons": "Bullying", "advice": "For CEO, please take a look at your senior managment team and start again. There are people out there in the world who would benefit the company and staff much more than the current ones. Bullies are not acceptable at any level, let alone managment."}, {"title": "Poor", "text": "Pros Staff meal was good. Clean uniform. Nice customers. Cons I worked in Terminal 5 branch and encountered racist abuse and bullying from co workers due to their similar ethnicity. As I was not Indian I was treated horribly and never encountered such a thing. The management used to suffocate you and did not allow staff to go to the bathroom. Advice to Management Stop favouritism towards same ethnicity and providing them opportunities to grow were other races do not get the same treatment.", "rating": 3, "pros": "Staff meal was good. Clean uniform. Nice customers.", "cons": "I worked in Terminal 5 branch and encountered racist abuse and bullying from co workers due to their similar ethnicity. As I was not Indian I was treated horribly and never encountered such a thing.", "advice": "Stop favouritism towards same ethnicity and providing them opportunities to grow were other races do not get the same treatment."}, {"title": "It was awesome experience but the working environment inside the company is bad", "text": "Pros if you wants to earn money this company is good to work if you get chance to work because management team at store level are racist and would only recommended thier race people. Cons nothing changeable at work, simple customer service and you go Advice to Management need to have good management team instead of racist people", "rating": 1, "pros": "if you wants to earn money this company is good to work if you get chance to work because management team at store level are racist and would only recommended thier race people.", "cons": "nothing changeable at work, simple customer service and you go", "advice": "need to have good management team instead of racist people"}, {"title": "Good company but terrible choice of shop managers", "text": "Pros It's is a fun place to work, great for meeting new people and for building a set of skills to help make things easier. Holiday time is fantastic and great rate of pay as well. Cons The training system is useless/non-existant, managers care for nobody but themselves and laugh at the idea of having to actually work, no time for a social life because they work you six days a week and barely remember to pay you right. Advice to Management Manager training needs to be brought in/improved upon, programme a system that automatically creates a rota that fits with everybody's availability.", "rating": 1, "pros": "It's is a fun place to work, great for meeting new people and for building a set of skills to help make things easier. Holiday time is fantastic and great rate of pay as well.", "cons": "The training system is useless/non-existant, managers care for nobody but themselves and laugh at the idea of having to actually work, no time for a social life because they work you six days a week and barely remember to pay you right.", "advice": "Manager training needs to be brought in/improved upon, programme a system that automatically creates a rota that fits with everybody's availability."}, {"title": "disaster", "text": "Pros the best reason of working for EAT is you do get pay by working for EAT. Cons different store has different style, that is not a standard you can follow. training is the worst part in the company. and if you do not book your holiday in adervance, you would lose your holiday due to poor management. Advice to Management well, if they listern, they would listern at the beginning.", "rating": 1, "pros": "the best reason of working for EAT is you do get pay by working for EAT.", "cons": "different store has different style, that is not a standard you can follow. training is the worst part in the company. and if you do not book your holiday in adervance, you would lose your holiday due to poor management.", "advice": "well, if they listern, they would listern at the beginning."}, {"title": "The most un rewarding job i have had in the catering buisness.", "text": "Pros The free coffee and staff food allowance and most of the staff is ok. Cons Lack of support,trust and respect from the managers.The high staff turnover,badly done rotas,short staffed on busy shifts and being expected to do many many duties in the same time.Not being given time to train new people,having to book all my holidays a year ahead so i will get them,polish spoken in front of other staff even managers do that.In general a very bad managed place. Advice to Management Comunication needs to be improved,stop having favourites,listen more to the staff,respect the staff,treat the staff with more respect,make sure people speak only english as it states in the staff hand book,stop taking the loyal staff for granted,", "rating": 1, "pros": "The free coffee and staff food allowance and most of the staff is ok.", "cons": "Lack of support,trust and respect from the managers.The high staff turnover,badly done rotas,short staffed on busy shifts and being expected to do many many duties in the same time.Not being given time to train new people,having to book all my holidays a year ahead so i will get them,polish spoken in front of other staff even managers do that.In general a very bad managed place.", "advice": "Comunication needs to be improved,stop having favourites,listen more to the staff,respect the staff,treat the staff with more respect,make sure people speak only english as it states in the staff hand book,stop taking the loyal staff for granted,"}, {"title": "General Manager", "text": "Pros free lunch, discount ... Cons Company totally forgot, they need people to run the business!!! There is so much pressure from area managers down to general managers down to staff... No support at all from AM, moment you speak out, your life will become hell. No motivation, no recognition ... Managers working too many overtimes, not paid at all ... Turnover of people in company is very high, everyone with clear mind running away ... This makes it even harder, as we just ending up with training new people ....", "rating": 1, "pros": "free lunch, discount ...", "cons": "Company totally forgot, they need people to run the business!!! There is so much pressure from area managers down to general managers down to staff...", "advice": null}, {"title": "Learning experience although overworked", "text": "Pros Lovely international colleagues, nice free food, nice customers in general. Cons Understaffed, sometimes they run out of materials and it takes a long time to get them or you have to go to another shop which could be far away to get them. Pressure to have everything ready by a certain time even when you are understaffed and trying your best to fill the gaps. Salary not so good, difficult to get above 7 pounds per hour. Advice to Management Increase the salary, have more people working in the shops", "rating": 3, "pros": "Lovely international colleagues, nice free food, nice customers in general.", "cons": "Understaffed, sometimes they run out of materials and it takes a long time to get them or you have to go to another shop which could be far away to get them. Pressure to have everything ready by a certain time even when you are understaffed and trying your best to fill the gaps. Salary not so good, difficult to get above 7 pounds per hour.", "advice": "Increase the salary, have more people working in the shops"}, {"title": "Really bad company, rhey expect you to do a lot of things for very low salary", "text": "Pros £6 food allowance, quick development Cons Lack of staff, we needed more people all the time, no communication, no positive feedback, big expectations for low salary. Like manager you have to work a lot of hours for free. If you don not agree with it and want to have personal life as well, your area manager puts you on his black list and tries you dismiss u as soon as possible Advice to Management Feedback is really important, people are not robots, increase salary to reward peoples' hards work.", "rating": 1, "pros": "£6 food allowance, quick development", "cons": "Lack of staff, we needed more people all the time, no communication, no positive feedback, big expectations for low salary.", "advice": "Feedback is really important, people are not robots, increase salary to reward peoples' hards work."}, {"title": "Great First Impressions then down hill", "text": "Pros Good food allowence £6, Most shops Mon-Fri finish before 6, great initial training its hard to thinking about pros when there isnt many Cons head of retail and Area Managers demand big results but do not give you the labour or the people to achieve them. They make you feel insignificant but if it wasnt for us they woudnt have stores running at all. The make you fell down because they dont offer any praise or recognition, if the area manager doesnt like you they make you feel that your not worthy to work for them, I felt my area manager was rude but i know from others she wasnt to nice about me behind close doors but to my face was all friendly. i would not recommed this company what so ever Advice to Management people talk we hear everything eventualy, we are running your stores invest some time in to helping us instead of being so negative, Positive feedback goes along way too", "rating": 1, "pros": "Good food allowence £6, Most shops Mon-Fri finish before 6, great initial training", "cons": "head of retail and Area Managers demand big results but do not give you the labour or the people to achieve them. They make you feel insignificant but if it wasnt for us they woudnt have stores running at all. The make you fell down because they dont offer any praise or recognition, if the area manager doesnt like you they make you feel that your not worthy to work for them, I felt my area manager was rude but i know from others she wasnt to nice about me behind close doors but to my face was all friendly. i would not recommed this company what so ever", "advice": "people talk we hear everything eventualy, we are running your stores invest some time in to helping us instead of being so negative, Positive feedback goes along way too"}, {"title": "Good team", "text": "Pros - Nice team member and good atmosphere Cons - Not enough staff - No health and safety correctly explained to staff - i should make 100 baguettes by myself, baking the pastry and bring down the soups in 2 hours 30 ( i precised that i am a girl) and sometime because it was busy downstairs my manager called me to go to help, like i wasn't busy enough. - I was working for 3 persons - Got a bad mentions when i lett , i dont know why cause i have always given my best and thats how they said thank you to me, not very nice - very small changing room ( we were chanhing in the customer toilet) Advice to Management Should respect your staff more!!!", "rating": 1, "pros": "- Nice team member and good atmosphere", "cons": "- Not enough staff", "advice": "Should respect your staff more!!!"}, {"title": "Working for EAT is a learning experience.", "text": "Pros Good wages, flexible rota, friendly staff in all the branches. Cons They paid monthly, which for people like students could be a problem. Advice to Management Staff in leadership position should give more feedback about every shore the normal staff do, in order to they can relate their performance with the whole shop perfomance.", "rating": 5, "pros": "Good wages, flexible rota, friendly staff in all the branches.", "cons": "They paid monthly, which for people like students could be a problem.", "advice": "Staff in leadership position should give more feedback about every shore the normal staff do, in order to they can relate their performance with the whole shop perfomance."}, {"title": "Not too bad.", "text": "Pros Cool Management, good coworkers, flexible schedule. When Robert isn't in the restaurant things tend to go a lot more smoothly. Cons The tapas section of the menu is a little large, which tends to pursuade people to compile a few of them for their dinner rathen thane ntrees. Advice to Management Make the tapas section of the menu smaller so customers feel more compelled to order entree's rather than appetizers and salads.", "rating": 3, "pros": "Cool Management, good coworkers, flexible schedule. When Robert isn't in the restaurant things tend to go a lot more smoothly.", "cons": "The tapas section of the menu is a little large, which tends to pursuade people to compile a few of them for their dinner rathen thane ntrees.", "advice": "Make the tapas section of the menu smaller so customers feel more compelled to order entree's rather than appetizers and salads."}, {"title": "EAT - good if you have no experience", "text": "Pros occasionally work with some nice people EAT offer there staff a £5.50 lunch allowance which is generous. Staff are fed and you are entitled to free hot drinks and water whilst at work and 50% off everything when you are not at work, at any store. Some people there are genuinely mad and that is very fun to be around, especially in Regent Street. Cons unpaid overtime (expected) poor communication poor area managers lack of respect for staff hard work for poor salary All of the above. The hours can be gruelling, morning shifts start at 6am! Get to go home early, but its still tough work. Managers are always expected to work longer hours for free. Mine never gets any time back and its really unrewarding work. Area managers don't seem to care much about the people. We are meant to have a EAT BUZZ. They don't know what this means Advice to Management Stop recruiting internally and bring in some decent management teams Treat staff with respect Stop looking for ways to sack people, look to develop instead", "rating": 3, "pros": "occasionally work with some nice people", "cons": "unpaid overtime (expected)", "advice": "Stop recruiting internally and bring in some decent management teams"}, {"title": "GM AT EAT LTD", "text": "Pros GOOD WORKING HOURS most store M- F and close b4 6 Cons NOT MUCH RECOGNITION OR PRAISE Advice to Management Real praise does wonders", "rating": 3, "pros": "GOOD WORKING HOURS most store M- F and close b4 6", "cons": "NOT MUCH RECOGNITION OR PRAISE", "advice": "Real praise does wonders"}]