[{"title": "Account Executive", "text": "Pros -New leadership in the office has has had an impact, as it has become a much more stable, supportive and positive environment. Definitely making an effort to employees and trying out new things for office morale. -Provides opportunities and options to explore different realms - whether its creative, paid, digital or planning. -Opportunities to work on a high-profile accounts. -Compensation is catching up with the rest of the industry. -If you're willing to put in the time and the work, you will be rewarded and provided more responsibility. Cons -As with any agency, client demands can be challenging and lead to long work hours and unrealistic asks. Advice to Management Continue listening to your employees and making sure to put their needs in line with client needs.", "rating": 5, "pros": "-New leadership in the office has has had an impact, as it has become a much more stable, supportive and positive environment. Definitely making an effort to employees and trying out new things for office morale.", "cons": "-As with any agency, client demands can be challenging and lead to long work hours and unrealistic asks.", "advice": "Continue listening to your employees and making sure to put their needs in line with client needs."}, {"title": "Former Employee", "text": "Pros Loved how genuine everyone is to help you out or let you know more about them as an intern. The management is fantastic and hope to work here again someday. Cons none :) great company to work for! Advice to Management Keep up the great work of managers being open to talking to people starting out. Great lunch n'learns, atmosphere, verticals to move.", "rating": 5, "pros": "Loved how genuine everyone is to help you out or let you know more about them as an intern. The management is fantastic and hope to work here again someday.", "cons": "none :) great company to work for!", "advice": "Keep up the great work of managers being open to talking to people starting out. Great lunch n'learns, atmosphere, verticals to move."}, {"title": "Downward spiral", "text": "Pros Some of the best and the brightest people Major brand names Great insurance/benefits Cons You will be overworked and burned out, and management will do nothing to help you. It's not even their fault... there is literally nothing they can do. The Edelman (agency) model is flawed at it's core. The obsession with \"growth\" and profit means that the firm runs lean and is constantly and purposefully understaffed. High margins are of utmost importance. Junior staff suffers the most. Pay is not competitive for what is being asked of you. Bad behavior is often rewarded. Advice to Management Quit. You all seem totally miserable.", "rating": 3, "pros": "Some of the best and the brightest people", "cons": "You will be overworked and burned out, and management will do nothing to help you. It's not even their fault... there is literally nothing they can do. The Edelman (agency) model is flawed at it's core. The obsession with \"growth\" and profit means that the firm runs lean and is constantly and purposefully understaffed. High margins are of utmost importance. Junior staff suffers the most. Pay is not competitive for what is being asked of you. Bad behavior is often rewarded.", "advice": "Quit. You all seem totally miserable."}, {"title": "Try, try again", "text": "Pros The people you get the opportunity to work with are phenomenal. They are talented, smart, ambitious and wonderful - you also get the opportunity to work with amazing clients and on some really awesome projects. Cons You have to have a good manager and a manager that is an advocate for you, or else you will completely fail here. Much of the senior leadership loves to hear themselves talk, without much listening and consideration from the mid level staff. Even though this is an agency, you will ALWAYS work long hours, with no breaks, even on holidays as clients will never be pushed back on for unrealistic asks/many managers do not care if their direct reporters are overburdened by work. The environment is also not very understanding of any flaws that happen in the day to day being human, leaving an unrealistic expectation of perfection that impossible to achieve. Advice to Management Reevaluate the way you utilize your staff, respect work life balance and don’t treat people like they’re another cog in the wheel", "rating": 3, "pros": "The people you get the opportunity to work with are phenomenal. They are talented, smart, ambitious and wonderful - you also get the opportunity to work with amazing clients and on some really awesome projects.", "cons": "You have to have a good manager and a manager that is an advocate for you, or else you will completely fail here. Much of the senior leadership loves to hear themselves talk, without much listening and consideration from the mid level staff. Even though this is an agency, you will ALWAYS work long hours, with no breaks, even on holidays as clients will never be pushed back on for unrealistic asks/many managers do not care if their direct reporters are overburdened by work. The environment is also not very understanding of any flaws that happen in the day to day being human, leaving an unrealistic expectation of perfection that impossible to achieve.", "advice": "Reevaluate the way you utilize your staff, respect work life balance and don’t treat people like they’re another cog in the wheel"}, {"title": "Intern", "text": "Pros Great Intern community-about 5-8 interns at a time in the office. Great community and ability to attend events Snacks and drinks provided in office Cons No parking or bus pass", "rating": 5, "pros": "Great Intern community-about 5-8 interns at a time in the office.", "cons": "No parking or bus pass", "advice": null}, {"title": "Account Executive", "text": "Pros Super empowering place that allows you to work with the biggest brands/Fortune 500 companies if you show interest. Being a global firm, you can work in offices around the globe when traveling. Cons Communication from leadership to junior level staff could improve. Advice to Management Being the biggest and arguably best firm in the world, Edelman should create strong retention programs to help prevent other firms from successfully recruiting staff.", "rating": 5, "pros": "Super empowering place that allows you to work with the biggest brands/Fortune 500 companies if you show interest. Being a global firm, you can work in offices around the globe when traveling.", "cons": "Communication from leadership to junior level staff could improve.", "advice": "Being the biggest and arguably best firm in the world, Edelman should create strong retention programs to help prevent other firms from successfully recruiting staff."}, {"title": "Have realistic expectations", "text": "Pros - You have an opportunity work with very smart people that come from a host of backgrounds (marketing, PR, advertising) - Transparent management (monthly all-hands) - It’s really a great place for an entry-level person to start and gain the most experience Cons - Tech is an unevolved practice with old guard clients, therefore aren’t winning business with emerging tech companies - For positioning themselves as an integrated marketing communications firm, Edelman tends to operate in very siloed practices that make it impossible to get anything done in a timely manner - The review process is horrific; would advise that new employees schedule weekly or bi- weekly meetings with your manager and archive copious notes to use when it comes time for you annual review (which feels like you’re writing a senior thesis) - As with any firm, Edelman is a revolving door. - Systematically an overall cold culture - Salary base pay is a joke (in comparison to what other Bay Area- based agencies offer) unless you have good negotiating skills.", "rating": 5, "pros": "- You have an opportunity work with very smart people that come from a host of backgrounds (marketing, PR, advertising)", "cons": "- Tech is an unevolved practice with old guard clients, therefore aren’t winning business with emerging tech companies", "advice": null}, {"title": "No faith and high turnover rate", "text": "Pros Cool location, bus to train stations, generally nice people Cons Little room for growth, can take forever to move up. Also, no tolerance for any mistake, even the most minor. Saw lots of people called at night and told to not come back the next day. Offices/cubes were then cleaned up of all personal items and those were messengered to the employee. Like they couldn't get rid of the person fast enough. Not good for morale. Advice to Management Allow people to be people - no one is perfect. Events for the company are nice, but back that up with some guidance, mentoring and patience. It took a long time for me to rise and I was held back once because of a minor, minor mistake. People aren't perfect! Better packages would be helpful as well.", "rating": 1, "pros": "Cool location, bus to train stations, generally nice people", "cons": "Little room for growth, can take forever to move up. Also, no tolerance for any mistake, even the most minor. Saw lots of people called at night and told to not come back the next day. Offices/cubes were then cleaned up of all personal items and those were messengered to the employee. Like they couldn't get rid of the person fast enough. Not good for morale.", "advice": "Allow people to be people - no one is perfect. Events for the company are nice, but back that up with some guidance, mentoring and patience. It took a long time for me to rise and I was held back once because of a minor, minor mistake. People aren't perfect! Better packages would be helpful as well."}, {"title": "You Are Just Another Number", "text": "Pros - Hundreds of people in one office; therefore, there are numerous networking opportunities. - Clearly defined growth opportunities and career pathing, which used to not be the case. Edelman has made this a priority in recent years. - Competitive benefits, but they don't reward top talent like other agencies. Cons - They have competitive benefits, but they don't reward top talent like other agencies. They pride themselves on being an independent company with fewer restrictions/red tape, but given the name on the door, they'll let you walk and hire cheaper talent before rewarding those that pour their blood, sweat and tears into the agency. - In reference to employees' concern about turnover, the office president said during an employee staff meeting that, \"I see human capital go up and down the elevators every day.\" Management will say they care about you, but at the end of the day, know that you are just another number that can, and will, be replaced. - Senior staffers are all co-workers AND friends; therefore, if there's a problem at work between a junior staffer and senior staffer... the junior staffer will lose EVERY time. Advice to Management Please, please listen to the junior staffers. Give them a voice and take their thoughts to heart. Retain your top talent and know that the people you let walk out the door are actual human-beings, not just another number you've written off.", "rating": 3, "pros": "- Hundreds of people in one office; therefore, there are numerous networking opportunities.", "cons": "- They have competitive benefits, but they don't reward top talent like other agencies. They pride themselves on being an independent company with fewer restrictions/red tape, but given the name on the door, they'll let you walk and hire cheaper talent before rewarding those that pour their blood, sweat and tears into the agency.", "advice": "Please, please listen to the junior staffers. Give them a voice and take their thoughts to heart. Retain your top talent and know that the people you let walk out the door are actual human-beings, not just another number you've written off."}, {"title": "Company gives clients good advice, but can't follow its own advice in managing employees", "text": "Pros - name brand clients - quick learning - stretch opportunities Cons - Expectations for roles and therefore promotions are unclear. The amount of work and level of commitment varies by group. Even within a group, expectations are still unclear and uneven. - The company celebrates women in leadership, but it actually missed a goal it set for itself originally. 42 percent of women in leadership isn't impressive when the company is built on the backs of an employee base that's 72% female. You don't have a pipeline problem, you have a desertion problem. - The maternity leave policy improved, but is still largely considered a disability. Advice to Management Make the annual review system actually connected to performance and compensation; the current 360s are a model of how to evade accountability. Write job descriptions with clear goals and expectations. Have a global P&L so departments and geographic offices aren't fighting over chunks of a client's business. Come up with a consistent way of communicating with your own employees (there were at least five platforms to use when I left). Pay your entry level assistant account executives enough money to support themselves in New York.", "rating": 3, "pros": "- name brand clients", "cons": "- Expectations for roles and therefore promotions are unclear. The amount of work and level of commitment varies by group. Even within a group, expectations are still unclear and uneven.", "advice": "Make the annual review system actually connected to performance and compensation; the current 360s are a model of how to evade accountability. Write job descriptions with clear goals and expectations. Have a global P&L so departments and geographic offices aren't fighting over chunks of a client's business. Come up with a consistent way of communicating with your own employees (there were at least five platforms to use when I left). Pay your entry level assistant account executives enough money to support themselves in New York."}, {"title": "Toxic atmosphere created by upper management and HR.", "text": "Pros Some really good brands to work on and talented people in various depts. Cons Upper creative management is clueless to what goes on and good people leave because there is no career path for growth unless you're a favorite. HR is just as bad as they have a double standard on complaints to protect upper management. Advice to Management Stop playing favorites and political games and start being creative.", "rating": 3, "pros": "Some really good brands to work on and talented people in various depts.", "cons": "Upper creative management is clueless to what goes on and good people leave because there is no career path for growth unless you're a favorite. HR is just as bad as they have a double standard on complaints to protect upper management.", "advice": "Stop playing favorites and political games and start being creative."}, {"title": "Mixed Bag", "text": "Pros Edelman is a unique organization. We have exceptional people working here, the brands are fantastic, and I do believe senior management is well intentioned. The client work is interesting, and you do get to play a heavy hand in owning campaign work, pitching to clients, and partnering across other specialisms, which is great. Cons No clear career path. No real relationship with HR or your manager to understand growth opportunities. Things move so fast sometimes, it is hard to see what you actually contribute, or, people on the account teams will talk down to you. You do also have to work on weekends. Advice to Management Fairly obvious a ton of folks are overlooked and undervalued. Managers are not doing a job enough job of checking in with employees, and being honest about workloads.", "rating": 3, "pros": "Edelman is a unique organization. We have exceptional people working here, the brands are fantastic, and I do believe senior management is well intentioned. The client work is interesting, and you do get to play a heavy hand in owning campaign work, pitching to clients, and partnering across other specialisms, which is great.", "cons": "No clear career path. No real relationship with HR or your manager to understand growth opportunities. Things move so fast sometimes, it is hard to see what you actually contribute, or, people on the account teams will talk down to you. You do also have to work on weekends.", "advice": "Fairly obvious a ton of folks are overlooked and undervalued. Managers are not doing a job enough job of checking in with employees, and being honest about workloads."}, {"title": "Slavery work", "text": "Pros Fun people to work with because of same age group / generation. Made a few good friends from different walks of life. Somewhat decent benefits to 'feed' us for our excruciating work that we do. Depending on which client you support, you will get some if not, lots of goodies for take home. Cons Your title/rank doesn't mean a thing! Ridiculously low pay considering the amount of work we do. It also depends on which department and client you support. You're treated like a slave! What is lunch break? Oh, and be prepared to go to the office at odd hours when everyone at your side of the world is still asleep. Better yet, don't sleep! Some coworkers are snotty divas who think they own you and boss you around-the-clock even though you don't report to them. Managers are empathic, but that's about it. Not a lot of mentorship throughout and advancement within the company is sparse. Either suck it up and wait for your review and hope for the best, or they wait for you to quit. Raise is also a laughable amount no matter how long and how hard you've worked. Advice to Management Pay your employees better. It's okay to treat them like slaves, but having a nice title, working really hard and long hours, along with a low pay, doesn't blend so well.", "rating": 1, "pros": "Fun people to work with because of same age group / generation. Made a few good friends from different walks of life. Somewhat decent benefits to 'feed' us for our excruciating work that we do. Depending on which client you support, you will get some if not, lots of goodies for take home.", "cons": "Your title/rank doesn't mean a thing! Ridiculously low pay considering the amount of work we do. It also depends on which department and client you support. You're treated like a slave! What is lunch break? Oh, and be prepared to go to the office at odd hours when everyone at your side of the world is still asleep. Better yet, don't sleep! Some coworkers are snotty divas who think they own you and boss you around-the-clock even though you don't report to them. Managers are empathic, but that's about it. Not a lot of mentorship throughout and advancement within the company is sparse. Either suck it up and wait for your review and hope for the best, or they wait for you to quit. Raise is also a laughable amount no matter how long and how hard you've worked.", "advice": "Pay your employees better. It's okay to treat them like slaves, but having a nice title, working really hard and long hours, along with a low pay, doesn't blend so well."}, {"title": "Planner", "text": "Pros there are great people and a healthy culture Cons depending on the account or team, there can be a very heavy workload Advice to Management more focus on levels 1-3", "rating": 5, "pros": "there are great people and a healthy culture", "cons": "depending on the account or team, there can be a very heavy workload", "advice": "more focus on levels 1-3"}, {"title": "A great place to be comfortable doing uninspiring work", "text": "Pros Amazing coworkers, chill vibe compared to most ad agencies, decent company benefits Cons No matter what they tell you, this is still a PR shop, and work suffers because of that. Clients won't let you out of that PR \"lane\" because they already have other creative agencies, and as such, you spend a lot of time putting together decks for lackluster ideas that probably won't get produced. The creative department is also EXCEPTIONALLY top-heavy (everyone's a VP), meaning opportunities for growth are few and far between. This is not a place to build up your book, it's a place to build a comfortable living and start a family, which can really hurt creatives who are looking for more in their career. Advice to Management Be advocates for creatives, push back on clients, and be honest when recruiting creatives about what Edelman is, and the timeframe (10 years) for where it (might, possibly, but probably not) will go.", "rating": 3, "pros": "Amazing coworkers, chill vibe compared to most ad agencies, decent company benefits", "cons": "No matter what they tell you, this is still a PR shop, and work suffers because of that. Clients won't let you out of that PR \"lane\" because they already have other creative agencies, and as such, you spend a lot of time putting together decks for lackluster ideas that probably won't get produced. The creative department is also EXCEPTIONALLY top-heavy (everyone's a VP), meaning opportunities for growth are few and far between.", "advice": "Be advocates for creatives, push back on clients, and be honest when recruiting creatives about what Edelman is, and the timeframe (10 years) for where it (might, possibly, but probably not) will go."}, {"title": "I am not the exception-there is a lot of GOOD", "text": "Pros I have worked at Edelman for more than five years and it's upsetting to see so many people on here bashing the company and saying that anyone who might write something positive is lying-I hope more people who have positive things get on here and write about their experiences. I have a manager who leads me and encourages me to share ideas or challenge the current way of doing things. I work in an office where there is a lot of good happening and I know I'm not alone. It's easy to get on here anonymously and bash and be critical-if you hate it so much LEAVE! YOU ARE THE PROBLEM. I appreciate working for a company that gives me generous time off, has a number of different employee welfare and culture benefits, pays me fairly and gives me the runway to grow. I also think as a company what we have done around supporting the people needing help in Houston as well as our response after Charlottesville is important and reflects my personal values and makes me proud to work at Edelman. Cons I think that we don't do a good job of showing our best work-as some reviewers have said it's \"just a PR shop\"-also PR isn't a bad word it's our heritage! There are over 600 creative people who work at Edelman globally and there is a lot of great work happening but if we aren't seeing it internally and able to talk about it then how is the outside world going to know. I do think our most senior leaders need to be more visible and have open dialogue with employees about things they have been challenged on in employee surveys or some of the things that some people have chosen to spray all over Glassdoor instead of trying to work with their leadership teams and HR. Advice to Management Be more visible and open with your communications. Show the work-it inspires!", "rating": 5, "pros": "I have worked at Edelman for more than five years and it's upsetting to see so many people on here bashing the company and saying that anyone who might write something positive is lying-I hope more people who have positive things get on here and write about their experiences. I have a manager who leads me and encourages me to share ideas or challenge the current way of doing things. I work in an office where there is a lot of good happening and I know I'm not alone.", "cons": "I think that we don't do a good job of showing our best work-as some reviewers have said it's \"just a PR shop\"-also PR isn't a bad word it's our heritage! There are over 600 creative people who work at Edelman globally and there is a lot of great work happening but if we aren't seeing it internally and able to talk about it then how is the outside world going to know. I do think our most senior leaders need to be more visible and have open dialogue with employees about things they have been challenged on in employee surveys or some of the things that some people have chosen to spray all over Glassdoor instead of trying to work with their leadership teams and HR.", "advice": "Be more visible and open with your communications. Show the work-it inspires!"}, {"title": "Needs improvement", "text": "Pros Excellent Creative Directors Nice open office with great views Good location Cons This is a PR agency that wants to be full service but lots of things at the current moment prevent this: Poor communications between internal departments. There are a lot of disconnects between what's been bought and what creative is supposed to do. Together the earned, paid, media team, project management team, account service team, and creative never know what is happening. Low budgets = low quality. The budgets promised to the client are too low to do high quality work. Dishonest when hiring. The creative recruitment team will promise you things to get you in the door. Then they don't happen. When you try to talk with them after you are hired they are MIA. There is no one else there HR?? to help deliver on these promises. Advice to Management Create a better internal structure for communication. Increase budgets and production for better quality. Hire better internal creative recruiters that are accountable for their word.", "rating": 3, "pros": "Excellent Creative Directors", "cons": "This is a PR agency that wants to be full service but lots of things at the current moment prevent this:", "advice": "Create a better internal structure for communication."}, {"title": "Consumer Practice, Edelman Chicago", "text": "Pros The large office allows for many networking opportunities Cons They overwork entry-level positions. I didn't know any better when I was first starting off in my career, so I stuck through it for three years, but it was three of the worst years of my life. I worked 8 a.m. - 8 p.m. every day, and they ignored my requests for help with my workload. And, many managers in the consumer department are poorly trained, leading to many unhappy employees. One of my managers yelled at me, unprofessionally, fairly often. When I talked to HR about the problem, they said they'd find a solution, but it never got better. Advice to Management Train the managers better. Watch the hours for entry-level employees. You can only overwork them so much until they burn out.", "rating": 1, "pros": "The large office allows for many networking opportunities", "cons": "They overwork entry-level positions. I didn't know any better when I was first starting off in my career, so I stuck through it for three years, but it was three of the worst years of my life. I worked 8 a.m. - 8 p.m. every day, and they ignored my requests for help with my workload. And, many managers in the consumer department are poorly trained, leading to many unhappy employees. One of my managers yelled at me, unprofessionally, fairly often. When I talked to HR about the problem, they said they'd find a solution, but it never got better.", "advice": "Train the managers better. Watch the hours for entry-level employees. You can only overwork them so much until they burn out."}, {"title": "Collaborative and creative place to work", "text": "Pros Lots of smart and creative people. Welcoming and supportive environment. Cons Open floor plan may be less ideal for some.", "rating": 5, "pros": "Lots of smart and creative people. Welcoming and supportive environment.", "cons": "Open floor plan may be less ideal for some.", "advice": null}, {"title": "Good not great", "text": "Pros Amazing resources that are always available to you. Pride in working for a company that is a leader in the industry. The variety and types of clients Edelman has can't be beat. Cons It's extremely difficult to move to other teams and offices even if your interest and strengths lie elsewhere", "rating": 5, "pros": "Amazing resources that are always available to you. Pride in working for a company that is a leader in the industry. The variety and types of clients Edelman has can't be beat.", "cons": "It's extremely difficult to move to other teams and offices even if your interest and strengths lie elsewhere", "advice": null}, {"title": "Account Executive", "text": "Pros Amazingly smart people, fun atmosphere, great clients, incredible work and accounts Cons Long hours, horrible pay, little recognition, takes a while to move up Advice to Management Junior staff does 80% of the work. Appreciate them or they'll leave.", "rating": 5, "pros": "Amazingly smart people, fun atmosphere, great clients, incredible work and accounts", "cons": "Long hours, horrible pay, little recognition, takes a while to move up", "advice": "Junior staff does 80% of the work. Appreciate them or they'll leave."}, {"title": "Assistant Account Executive", "text": "Pros Work with amazing brands and leaders in the industry Cons High turnover amongst junior stuff", "rating": 5, "pros": "Work with amazing brands and leaders in the industry", "cons": "High turnover amongst junior stuff", "advice": null}, {"title": "Fingers crossed the newer Digital leads will clean house", "text": "Pros Supportive President who will hopefully take this PR firm into the Digital future. Beautiful location, free ice cream and other basic agency perks you find elsewhere. Cons The \"Mean Girls environment\" that one reviewer stated is 100% true especially on the Chicago Consumer team. They are the worst, very exclusive and borderline bullying attitude. Collectively, the behavior seems like those so fearful of not \"getting\" digital and losing their relevance that they treat any from a real digital background as second class citizens. This behavior is apparent from the top - down. From AAEs all the way up to the SVP/EVPs. I think that Edelman works more on investment plans to find room for PR folks on Digital SOWs then profitable work. It's not sustainable for an agency with already record high billable rates. Advice to Management There is promise there - they just have to clean house with the old guard holding on for dear life.", "rating": 3, "pros": "Supportive President who will hopefully take this PR firm into the Digital future. Beautiful location, free ice cream and other basic agency perks you find elsewhere.", "cons": "The \"Mean Girls environment\" that one reviewer stated is 100% true especially on the Chicago Consumer team. They are the worst, very exclusive and borderline bullying attitude. Collectively, the behavior seems like those so fearful of not \"getting\" digital and losing their relevance that they treat any from a real digital background as second class citizens. This behavior is apparent from the top - down. From AAEs all the way up to the SVP/EVPs. I think that Edelman works more on investment plans to find room for PR folks on Digital SOWs then profitable work. It's not sustainable for an agency with already record high billable rates.", "advice": "There is promise there - they just have to clean house with the old guard holding on for dear life."}, {"title": "Senior Vice President", "text": "Pros Strong growth culture across the board Cons Senior Leadership is not inspiring Advice to Management Quit creating more and ore made-up titles to pacify the career goals of middle management.", "rating": 3, "pros": "Strong growth culture across the board", "cons": "Senior Leadership is not inspiring", "advice": "Quit creating more and ore made-up titles to pacify the career goals of middle management."}, {"title": "Great place to work", "text": "Pros great people, fun work and the ability to as autonomous as you like! Cons operational processes need to be streamlined", "rating": 5, "pros": "great people, fun work and the ability to as autonomous as you like!", "cons": "operational processes need to be streamlined", "advice": null}, {"title": "Senior Account Supervisor", "text": "Pros Get to work with the best thought-leaders in the industry, big clients, international opportunities; Great leadership team Cons The NYC office is mired in politics, moving past the AS/AM level is not merit-based anymore but it's favoritism/cronyism. Hence, one can more often than not find themselves with a line manager that is not interested in great work or let alone helping you grow, but that is purely in it for themselves. One mistake and you get thrown under the bus. Eat or be eaten mentality. Advice to Management P&L structure is a hindrance and cause for most of the politics that is poisening the workplace culture; The leadership/executive team has all the best intentions at heart, and the values they hold dear are certainly great, but they need to open their eyes to the fact that follow-through down to the AAE level is NOT happening.", "rating": 3, "pros": "Get to work with the best thought-leaders in the industry, big clients, international opportunities; Great leadership team", "cons": "The NYC office is mired in politics, moving past the AS/AM level is not merit-based anymore but it's favoritism/cronyism. Hence, one can more often than not find themselves with a line manager that is not interested in great work or let alone helping you grow, but that is purely in it for themselves. One mistake and you get thrown under the bus. Eat or be eaten mentality.", "advice": "P&L structure is a hindrance and cause for most of the politics that is poisening the workplace culture; The leadership/executive team has all the best intentions at heart, and the values they hold dear are certainly great, but they need to open their eyes to the fact that follow-through down to the AAE level is NOT happening."}, {"title": "Billing Coordinator", "text": "Pros Lots of great perks from happy hours, to transportation reimbursement, gym membership reimbursement, great benefits 401k, health, vision, dental. Great family oriented culture to work for. Flexible with job relocation. Cons Really cannot think of anything. I was going to say pay, however I must be honest that you get paid what you earn. If you want to get paid more you really have to have a great attitude, show up on time, turn out great work consistently. I really wouldn't expect anything other than this in order to be compensated satisfactorily anywhere else, so why not here? Advice to Management Reward you infrastructure departments, they are the life line of the entire company worldwide. AR, AP, Billing, Contracts, Legal, etc.", "rating": 5, "pros": "Lots of great perks from happy hours, to transportation reimbursement, gym membership reimbursement, great benefits 401k, health, vision, dental. Great family oriented culture to work for. Flexible with job relocation.", "cons": "Really cannot think of anything. I was going to say pay, however I must be honest that you get paid what you earn. If you want to get paid more you really have to have a great attitude, show up on time, turn out great work consistently. I really wouldn't expect anything other than this in order to be compensated satisfactorily anywhere else, so why not here?", "advice": "Reward you infrastructure departments, they are the life line of the entire company worldwide. AR, AP, Billing, Contracts, Legal, etc."}, {"title": "Great Culture and Place to Work", "text": "Pros Fun culture. Great, smart team of account managers and creatives. Cons Bandwidth is limited sometimes. Long hours.", "rating": 5, "pros": "Fun culture.", "cons": "Bandwidth is limited sometimes.", "advice": null}, {"title": "Great company for smart, hard working people", "text": "Pros I get to work with the smartest, most creative people in the business. If you know how to ask for opportunities - and can tie ideas back to how it will help the business - you'll succeed here. If you're willing to work longer hours for big new business opportunities or raise your hand for new opportunities, this is the place for you. If you're aggressive about finding a mentor and learning, you'll love Edelman. The Edelman brand has great cache. The network is huge - and the name recognition is excellent. Cons I am disappointed to see some of the other reviews; the experiences they describe are so different than mine. I do think Edelman is only for a certain type of person. No one is going to give you a roadmap for your career at Edelman - you really need to carve your own path.", "rating": 5, "pros": "I get to work with the smartest, most creative people in the business.", "cons": "I am disappointed to see some of the other reviews; the experiences they describe are so different than mine. I do think Edelman is only for a certain type of person. No one is going to give you a roadmap for your career at Edelman - you really need to carve your own path.", "advice": null}, {"title": "Great Company If You Fit Into the Culture", "text": "Pros Great resume builder if you plan on working in PR. Cons Lacks diversity on several levels. If you are a person of color good luck fitting into the corporate culture and trying to find a mentor (I have heard some of the conversations from mid-level managers) If you aren't a prep you better get started looking and acting the part. Advice to Management Get out of the box.", "rating": 3, "pros": "Great resume builder if you plan on working in PR.", "cons": "Lacks diversity on several levels. If you are a person of color good luck fitting into the corporate culture and trying to find a mentor (I have heard some of the conversations from mid-level managers) If you aren't a prep you better get started looking and acting the part.", "advice": "Get out of the box."}, {"title": "Senior Account Executive", "text": "Pros Some of the clients you work with are big names, the benefits are OK, and you have the stability of a large firm. Cons Avoid Edelman. No innovative spirit whatsoever, a lot of meetings about nothing, loads of unnecessary bureaucracy, way too much hesitation to challenge clients on bad ideas, bad office culture that values time sitting at your desk over actual output. Advice to Management Reorganization for the sake of it is bad. Stop.", "rating": 3, "pros": "Some of the clients you work with are big names, the benefits are OK, and you have the stability of a large firm.", "cons": "Avoid Edelman. No innovative spirit whatsoever, a lot of meetings about nothing, loads of unnecessary bureaucracy, way too much hesitation to challenge clients on bad ideas, bad office culture that values time sitting at your desk over actual output.", "advice": "Reorganization for the sake of it is bad. Stop."}, {"title": "Assistant Account Executive", "text": "Pros Great experience Good exposure in the industry Well Known company Cons Depends on your team how much you will like your job ( similar to many jobs ) Long work hours, demand alot of employees", "rating": 5, "pros": "Great experience", "cons": "Depends on your team how much you will like your job ( similar to many jobs )", "advice": null}, {"title": "Great Place to grow as intern", "text": "Pros they've mostly eliminated the heirarchy-based traditional company structure in favor of a horizontal, network-based organization that makes it so much easier to get involved in the projects you like and talk to phenomenal mentors Cons lower pay than standard for other interns in the industry Advice to Management consider showing your AAE's and AE's you value them a bit more by paying them better", "rating": 5, "pros": "they've mostly eliminated the heirarchy-based traditional company structure in favor of a horizontal, network-based organization that makes it so much easier to get involved in the projects you like and talk to phenomenal mentors", "cons": "lower pay than standard for other interns in the industry", "advice": "consider showing your AAE's and AE's you value them a bit more by paying them better"}, {"title": "Very Good for a Corporation", "text": "Pros Some pros include constant free food left over from catering events, open atmosphere to encourage conversations (see cons), and a clear strive to improve culture (see cons). Cons Much like many other places, there is a lot of criticism without the constructive conversations to help you improve, cutting costs across the firm often means \"restructuring\" and cutting back on employee culture activities/bonding opportunities. Advice to Management Management would benefit from being more of a coach to the younger staff, helping them improve and grow instead of just delegating work and getting upset when things aren't perfect. There could easily be more transparency across the firm and more interaction between departments.", "rating": 5, "pros": "Some pros include constant free food left over from catering events, open atmosphere to encourage conversations (see cons), and a clear strive to improve culture (see cons).", "cons": "Much like many other places, there is a lot of criticism without the constructive conversations to help you improve, cutting costs across the firm often means \"restructuring\" and cutting back on employee culture activities/bonding opportunities.", "advice": "Management would benefit from being more of a coach to the younger staff, helping them improve and grow instead of just delegating work and getting upset when things aren't perfect. There could easily be more transparency across the firm and more interaction between departments."}, {"title": "It's O.K. but for an agency \"O.K.\" means dying.", "text": "Pros The offices are pretty nice: clean, mostly quiet with a lot of opportunities for social zones. Office equipment is top notch especially computer hardware: however, the software is terrible usually with offices and divisions sharing a scant number of licenses or seats that would allow employees to take themselves to the next game. Client roster is impressive but any medium-sized advertising or tech agency can easily steal most of their clients. I know because I'm leaving to go to a smaller firm that's opening up a PR shop in two or three months. Cons Most of the employees aren't particularly bright: they don't know any software program other than Powerpoint. In fact, most of them don't even know Powerpoint really well. So, it's hard to give clients \"the best\" when an account executive in Digital doesn't know the difference between Photoshop and Microsoft Paint. You'll quickly find this out when an executive is standing in front of a room of some of the world's wealthiest, smartest, and powerful people with a presentation that looks like a hot mess. It's because, I swear, when it comes to pitches, proposals, wireframes and prototypes... the company employs like seven whole designers at any given moment. And parts of the senior leadership claims to be experts in esoteric and dubious advertising and marketing \"sciences\" but can't even write a lick of code. And we're not even talking about real programming. They don't even know how to do a regression analysis in Excel much less write a function in python or tweak the CSS of a site. And that makes it hard to sell to your clients when you don't even know what a KPI is, how to track it or the technology that makes it work. As they move into this \"communications marketing\" model, everyone should have a basic working knowledge of modern technology in the context of marketing, advertising and media. That means the company is paying an executive a large sum of money that everyone else has to produce and work even more to pay for these wastes of space. Certain employees are there because of nepotism. They're even worse than the know-nothings. That's because they are so insanely stupid they haven't even realized they were hired because of a family friend, spouse or they are related to the client. So, they think they actually know things. These people are morale and profit blackholes. I'm not sure why they aren't locked away on their own floor never to interact with the employees who actually work and are there based off merit but if you have to keep them, isolate them off to their own existence. They also claim you can apply inside of the company and grow as an individual but I've seen about 2 whole people move divisions in the 3-plus years I've been here. Advice to Management In all sincerity, I think you need to spend more time pushing your employees to show they are capable of growing and expanding Edelman as we wander farther into the digital and data-driven realm and fire or train those who don't. Also, you should probably double the size of your creative departments. And pay competitively. Seriously, a VP at Edelman makes about as much as a junior designer at Droga5.", "rating": 3, "pros": "The offices are pretty nice: clean, mostly quiet with a lot of opportunities for social zones.", "cons": "Most of the employees aren't particularly bright: they don't know any software program other than Powerpoint. In fact, most of them don't even know Powerpoint really well. So, it's hard to give clients \"the best\" when an account executive in Digital doesn't know the difference between Photoshop and Microsoft Paint.", "advice": "In all sincerity, I think you need to spend more time pushing your employees to show they are capable of growing and expanding Edelman as we wander farther into the digital and data-driven realm and fire or train those who don't. Also, you should probably double the size of your creative departments. And pay competitively."}, {"title": "Intern", "text": "Pros Edelman has good team culture and great clients that allow interns to learn a lot about the fast-paced environment of an agency and the Pr industry in general. Cons You will be expected to work late nights and sometimes even during the weekends, which makes it hard to have time for yourself and family. Advice to Management Managers were friendly and approachable", "rating": 5, "pros": "Edelman has good team culture and great clients that allow interns to learn a lot about the fast-paced environment of an agency and the Pr industry in general.", "cons": "You will be expected to work late nights and sometimes even during the weekends, which makes it hard to have time for yourself and family.", "advice": "Managers were friendly and approachable"}, {"title": "Edelman - happy but not challenged", "text": "Pros learning a lot, big name brands Cons cliquey, lack of creativity, too big", "rating": 5, "pros": "learning a lot, big name brands", "cons": "cliquey, lack of creativity, too big", "advice": null}, {"title": "Good company, but not for administrative staff", "text": "Pros Great benefits, innovative company, many opportunities for PR staff. Cons No career path for administrative employees. Backbone of company, but considered expendable. Focus entirely on PR staff for success. Advice to Management Provide career path and mentoring for non-PR staff.", "rating": 5, "pros": "Great benefits, innovative company, many opportunities for PR staff.", "cons": "No career path for administrative employees. Backbone of company, but considered expendable. Focus entirely on PR staff for success.", "advice": "Provide career path and mentoring for non-PR staff."}, {"title": "mixed bag", "text": "Pros probably still a good place to start out in traditional PR (provided you have multiple internships already behind you). consumer practice doing well, getting some more marketing assignments, vs. just straight PR. Cons gotta agree with prior post about lack of trust--this for a company known for its Trust Barometer study. when the numbers looked bad, good people were told to pack up. lack of training, lack of solid new business leadership.", "rating": 3, "pros": "probably still a good place to start out in traditional PR (provided you have multiple internships already behind you). consumer practice doing well, getting some more marketing assignments, vs. just straight PR.", "cons": "gotta agree with prior post about lack of trust--this for a company known for its Trust Barometer study. when the numbers looked bad, good people were told to pack up. lack of training, lack of solid new business leadership.", "advice": null}, {"title": "not the company it used to be", "text": "Pros The pay and benefits are good. That's about it. No training or advancement Cons No work life balance cannot take vacation. Cannot trust anyone Advice to Management Current managers need training on how to treat employees. They only care about themselves", "rating": 3, "pros": "The pay and benefits are good. That's about it. No training or advancement", "cons": "No work life balance cannot take vacation. Cannot trust anyone", "advice": "Current managers need training on how to treat employees. They only care about themselves"}, {"title": "Not a great place...need to be revamped...it is sinking", "text": "Pros The PTO The clients (they should really evaluate their billing and the work product closely; it doesn't match up) Some decent people The office (nice location) Interns--they are hopeful people Cons Leadership-- they do not take responsibility for the failing business. They pass blame. Also they need to learn objectivity. The favoritism is almost a person there. They keep bad managers in place when they know the incompetent people need to be let go. CEO---he needs people skills. He is so full of himself! He can't even look people in the eye when walking down the hall. And if he tells you he cares, you better not believe him. He leans too much on his HR person, who is a lying character. HR--- she should be labeled the gossiper of the office. She pretends to solve issues but she is the issue. How does a HR person who doesn't bring one cent to the business but is so involved in the accounts and its people. She also spends the company's money taking people out to lunch. Business-- this company doesn't know how to bring in new business especially some departments. Its leadership or lack of leadership are cry baby bullies. One department's idea of bringing in new business is going to other offices begging for leftovers. There is a senior level manager whose believes or demonstrates that lying, yelling and whining work. It works for her and it works in the Edelman South office. She should have been let go but they reward her with more money and titles. And the sad part about it is everyone knows. Over sellers but under achievers--- the clients better guard their budgets. That South office comes up with so much crap to sell that they forget what they need to sell---good sound counsel with results. Favoritism---it exists in the Edelman South office! Enough said. Gossiping---everyone talks and leadership sets the tone for that. Morale and spirit- there isn't any! Advice to Management Get training and start appreciating the people you have. They are so miserable there but they won't tell you because they are afraid of retaliation. Plus you won't listen. You are too busy being psychoanalysts or more like psychos. They need to bring into new leadership from the office. They do it for new business. Get some good leadership.", "rating": 1, "pros": "The PTO", "cons": "Leadership-- they do not take responsibility for the failing business. They pass blame. Also they need to learn objectivity. The favoritism is almost a person there. They keep bad managers in place when they know the incompetent people need to be let go.", "advice": "Get training and start appreciating the people you have. They are so miserable there but they won't tell you because they are afraid of retaliation. Plus you won't listen. You are too busy being psychoanalysts or more like psychos."}, {"title": "Too big to care", "text": "Pros The brand appeal to claim you work for the biggest firm in the world. Cons Highly political, combative environment rife with favoritism and nepotism. Bad behavior gets rewarded and good work gets overlooked. Advice to Management Focus on your people and clients first not the numbers.", "rating": 1, "pros": "The brand appeal to claim you work for the biggest firm in the world.", "cons": "Highly political, combative environment rife with favoritism and nepotism. Bad behavior gets rewarded and good work gets overlooked.", "advice": "Focus on your people and clients first not the numbers."}, {"title": "Senior Account Executive", "text": "Pros Culture, people, access to resources Cons Difficult to navigate/customize career path or make changes", "rating": 5, "pros": "Culture, people, access to resources", "cons": "Difficult to navigate/customize career path or make changes", "advice": null}, {"title": "The largest for a reason", "text": "Pros Great support system. Incredible talent. Strong leadership - but can depend on your location. Very good culture in most offices - especially places like San Francisco, Seattle and Chicago. No better place to cut your teeth. Great, great clients. Very strong creative and digital chops. Entrepreneurial. Cons Conflicts of interest can be counter productive. Very NY centered - making professional growth outside of NY challenging. Executive leadership can be a hit or miss with some overly ambitious. Advice to Management Work hard to be less NY centered as your best people are actually not there.", "rating": 5, "pros": "Great support system. Incredible talent. Strong leadership - but can depend on your location. Very good culture in most offices - especially places like San Francisco, Seattle and Chicago. No better place to cut your teeth. Great, great clients. Very strong creative and digital chops. Entrepreneurial.", "cons": "Conflicts of interest can be counter productive. Very NY centered - making professional growth outside of NY challenging. Executive leadership can be a hit or miss with some overly ambitious.", "advice": "Work hard to be less NY centered as your best people are actually not there."}, {"title": "In a word: NIGHTMARE.", "text": "Pros Far and away, biggest pro was LEAVING. Some of the international colleagues were excellent, but in each and every instance they were from acquisitions and not Edelman people. Cons This is by far the most ethically bankrupt, hostile and incestuous place I have worked in my entire career. You're hired for one job, given no flight path, no goals set, dismissive and absentee managers and then the backstabbing begins. There is no one to trust in this place. Seriously, no one. It's Lord of the Flies meets incompetency and rampant unethical behavior. There is NO reason to consider a position here. No fancy title, no promises of bonus or advancement, no salary--seriously nothing is worth it. If you want to work at a big agency - and you're junior (or senior for that matter) - go to Weber or a WPP, Publicis or Interpublic agency. The firm's monicker of communications marketing is a complete joke. It will not catch up to the creative agencies, because the talent and the ideas - and the competence - are not there. This shop is 1990s \"PR light\" and not to be taken seriously. There's far greater talent and collegial environments out there. Do not settle. PS: I'd question any of the overly positive Glassdoor reviews as placed by the company itself. If you don't take my advice - fine- just please consider this carefully before you dive into something you're bound to regret. Advice to Management Practice what you preach. Support your employees. Act like a family-run company not a corrupt enterprise that only cares about the bottom line.", "rating": 1, "pros": "Far and away, biggest pro was LEAVING. Some of the international colleagues were excellent, but in each and every instance they were from acquisitions and not Edelman people.", "cons": "This is by far the most ethically bankrupt, hostile and incestuous place I have worked in my entire career. You're hired for one job, given no flight path, no goals set, dismissive and absentee managers and then the backstabbing begins. There is no one to trust in this place. Seriously, no one. It's Lord of the Flies meets incompetency and rampant unethical behavior. There is NO reason to consider a position here. No fancy title, no promises of bonus or advancement, no salary--seriously nothing is worth it. If you want to work at a big agency - and you're junior (or senior for that matter) - go to Weber or a WPP, Publicis or Interpublic agency. The firm's monicker of communications marketing is a complete joke. It will not catch up to the creative agencies, because the talent and the ideas - and the competence - are not there. This shop is 1990s \"PR light\" and not to be taken seriously. There's far greater talent and collegial environments out there. Do not settle. PS: I'd question any of the overly positive Glassdoor reviews as placed by the company itself. If you don't take my advice - fine- just please consider this carefully before you dive into something you're bound to regret.", "advice": "Practice what you preach. Support your employees. Act like a family-run company not a corrupt enterprise that only cares about the bottom line."}, {"title": "Great company and wonderful culture", "text": "Pros The company culture is amazing-- people work hard and care about their work but have a great work/life balance Cons none that I can think of", "rating": 5, "pros": "The company culture is amazing-- people work hard and care about their work but have a great work/life balance", "cons": "none that I can think of", "advice": null}, {"title": "Great agency for growth opportunities", "text": "Pros great and smart people to work with. amazing opportunities to learn all about the world of PR and access to great creative minds. Cons Works to be done on inclusiveness and women leadership. Advice to Management Expand on women empowerment opportunities and leadership skills. More training.", "rating": 5, "pros": "great and smart people to work with. amazing opportunities to learn all about the world of PR and access to great creative minds.", "cons": "Works to be done on inclusiveness and women leadership.", "advice": "Expand on women empowerment opportunities and leadership skills. More training."}, {"title": "Great Place to Work", "text": "Pros Lots of room to move up and around. Lots of opportunities and clients. Established HR system. Cons Very rigid raise and promotion process since it's a large company. Difficult to move up without being aggressive.", "rating": 5, "pros": "Lots of room to move up and around. Lots of opportunities and clients. Established HR system.", "cons": "Very rigid raise and promotion process since it's a large company. Difficult to move up without being aggressive.", "advice": null}, {"title": "Intern", "text": "Pros Incredible experience, mentorship, fun and fast-paced working environment Cons Occasionally work some extra hours", "rating": 5, "pros": "Incredible experience, mentorship, fun and fast-paced working environment", "cons": "Occasionally work some extra hours", "advice": null}, {"title": "Edelman", "text": "Pros Exposed to top companies/clients/accounts, both national and international. Work with really smart, talented and driven people. You will learn a lot if you set yourself to it -- no one will baby you, this is the real world. Make good connections! Take advantage of \"coffee dates.\" If you don't get promoted, more than likely someone there will know someone else who might be willing to hire you. Become good friends with the HR peeps -- they can help. Don't treat interns badly, they might end up being your coworkers soon. Cons Long, long, long hours for the compensation. Don't expect to sit around and leave when you're supposed to. Don't not expected to get promoted just because people like you and you are a talented, hard worker, it really just depends on the business at time. Advice to Management Know who is worth keeping -- talented people have been let go because of lack of resources.", "rating": 5, "pros": "Exposed to top companies/clients/accounts, both national and international.", "cons": "Long, long, long hours for the compensation. Don't expect to sit around and leave when you're supposed to.", "advice": "Know who is worth keeping -- talented people have been let go because of lack of resources."}, {"title": "Solid Company with ethics", "text": "Pros Clients are taken care of and the advisors are experienced. Upper management encourages helping all clients no matter if they have investable money or not. The mission is educating people. Also Ric's books are given away free in an effort to educate. Cons No company is perfect but I cannot think of a meaningful area where the company is lacking. Clients get good and consistent advice. Advice to Management I trust that our leaders will continue to guide the firm through an industry that is changing rapidly due to technology.", "rating": 5, "pros": "Clients are taken care of and the advisors are experienced. Upper management encourages helping all clients no matter if they have investable money or not. The mission is educating people. Also Ric's books are given away free in an effort to educate.", "cons": "No company is perfect but I cannot think of a meaningful area where the company is lacking. Clients get good and consistent advice.", "advice": "I trust that our leaders will continue to guide the firm through an industry that is changing rapidly due to technology."}, {"title": "Culture Improving", "text": "Pros Big-name clients, diversity of work, good culture within Edelman at large, good vacation policy and holidays Cons High turnover, lacking leadership, lack of job descriptions, goals, and little clarity or transparency on organizational issues", "rating": 3, "pros": "Big-name clients, diversity of work, good culture within Edelman at large, good vacation policy and holidays", "cons": "High turnover, lacking leadership, lack of job descriptions, goals, and little clarity or transparency on organizational issues", "advice": null}, {"title": "Account Manager", "text": "Pros Best PR/Communications agency in the UK Cons Very dynamic agency not for everyone, but great for dynamic people", "rating": 5, "pros": "Best PR/Communications agency in the UK", "cons": "Very dynamic agency not for everyone, but great for dynamic people", "advice": null}, {"title": "Great Environment/Clients, Horrible Pay/Work-Life Balance", "text": "Pros Edelman really does hire the best, and in turn gets the best clients. The work we do is incredible. Everyone is so smart, passionate and on their game -- it's great to be around. There are really great resources and people in the network with every specialty of knowledge who are willing to help you. The integrated communications marketing approach is excellent, compared to other agencies, because you can offer and tap social specialists, paid specialists, research specialists, creatives, whatever you want, in-house. It can be easy or difficult to move to different practice areas or clients, all depending on your manager. Cons The work life balance is horrid. I'm personally very burnt out after 1.5 years and the pay is eh. Especially in the bay area, Edelman pays just the median for junior staff. It all totally depends on your assigned client mix though- some people have it easy, and some have it really hard... luck of the draw. Like other agencies, people dont build very deep friendships at work or really let their hair down. There's also a fairly high turn over rate - people are coming and going all the time Advice to Management Pay your staff better and they will actually stick around. I could deal with the bad work-life balance if I at least felt competitively compensated.", "rating": 3, "pros": "Edelman really does hire the best, and in turn gets the best clients. The work we do is incredible. Everyone is so smart, passionate and on their game -- it's great to be around. There are really great resources and people in the network with every specialty of knowledge who are willing to help you. The integrated communications marketing approach is excellent, compared to other agencies, because you can offer and tap social specialists, paid specialists, research specialists, creatives, whatever you want, in-house. It can be easy or difficult to move to different practice areas or clients, all depending on your manager.", "cons": "The work life balance is horrid. I'm personally very burnt out after 1.5 years and the pay is eh. Especially in the bay area, Edelman pays just the median for junior staff. It all totally depends on your assigned client mix though- some people have it easy, and some have it really hard... luck of the draw. Like other agencies, people dont build very deep friendships at work or really let their hair down. There's also a fairly high turn over rate - people are coming and going all the time", "advice": "Pay your staff better and they will actually stick around. I could deal with the bad work-life balance if I at least felt competitively compensated."}, {"title": "Assistant Account Executive", "text": "Pros There are extremely intelligent and creative people here that will contribute to some of the industry's best work. There is some great camaraderie within each of the practices (although not really between the practices). Also it's a great place to learn the PR ropes if you're an intern or early-employee. Cons Your experience here really depends on the team you're on. I personally had a terrible experience with my boss and team and since I was an entry-level employee, my concerns were not addressed or recognized appropriately with both the operations teams or HR. Additionally, I feel as though big-agency lifestyle does not foster room for professional growth for entry-level employees as there is such high-turnover in the industry. Entry-levelers are often looked down upon by senior staff in terms of speaking up to insert their ideas. If you are an AAE in consumer, you're probably shipping product and organizing excels/decks for most of the time, rather than getting hands-on experience in PR. Advice to Management Recognize your junior staff more and utilize their bright minds from the get-go. Edelman hires extremely intelligent individuals because the work that Edelman does is top-notch, but there is a huge culture failure and HIGH burn-out rate that will lead employees to seek better opportunities.", "rating": 3, "pros": "There are extremely intelligent and creative people here that will contribute to some of the industry's best work. There is some great camaraderie within each of the practices (although not really between the practices). Also it's a great place to learn the PR ropes if you're an intern or early-employee.", "cons": "Your experience here really depends on the team you're on. I personally had a terrible experience with my boss and team and since I was an entry-level employee, my concerns were not addressed or recognized appropriately with both the operations teams or HR.", "advice": "Recognize your junior staff more and utilize their bright minds from the get-go. Edelman hires extremely intelligent individuals because the work that Edelman does is top-notch, but there is a huge culture failure and HIGH burn-out rate that will lead employees to seek better opportunities."}, {"title": "Great place to work, but long road to proper promotions", "text": "Pros Young, fun work environment. Most who work here are intelligent, eloquent and love what they do. There are multiple team bonding activities and events to get to know your peers. Cons Top heavy management that rely on junior staff to do their job for half the pay. Advice to Management Promote junior staff in a timely manner! Postponing a promotion when they are \"nearly there\" vs. having faith in their competencies is just discouraging and causes a lot of turnover.", "rating": 5, "pros": "Young, fun work environment. Most who work here are intelligent, eloquent and love what they do. There are multiple team bonding activities and events to get to know your peers.", "cons": "Top heavy management that rely on junior staff to do their job for half the pay.", "advice": "Promote junior staff in a timely manner! Postponing a promotion when they are \"nearly there\" vs. having faith in their competencies is just discouraging and causes a lot of turnover."}, {"title": "Very good experience - Professional & fun.", "text": "Pros Big, established agency with big, established, long-term clients. Thoughtful, strategic & smart in business approach. Vast array of work and relatively diverse workforce. Cons Typical large agency complaints - takes a long time and way too many people to get simple things done, endless meetings about other meetings, annoying agency acronyms, conservative decision making, etc. Advice to Management Place more value in experience and character rather than pedigree. Promote from within, but week out the BSers.", "rating": 5, "pros": "Big, established agency with big, established, long-term clients. Thoughtful, strategic & smart in business approach. Vast array of work and relatively diverse workforce.", "cons": "Typical large agency complaints - takes a long time and way too many people to get simple things done, endless meetings about other meetings, annoying agency acronyms, conservative decision making, etc.", "advice": "Place more value in experience and character rather than pedigree. Promote from within, but week out the BSers."}, {"title": "Assistant Account Executive", "text": "Pros the culture (ice cream Fridays, Lunch & Learns), big-name clients, exciting campaign work and opportunities to move around Cons the pay is low for junior staff, while there is somewhat of a \"work-life-balance\", don't expect to work 9-to-5 as a junior staff. Advice to Management Pay junior level employees more for their work", "rating": 5, "pros": "the culture (ice cream Fridays, Lunch & Learns), big-name clients, exciting campaign work and opportunities to move around", "cons": "the pay is low for junior staff, while there is somewhat of a \"work-life-balance\", don't expect to work 9-to-5 as a junior staff.", "advice": "Pay junior level employees more for their work"}, {"title": "Project Manager", "text": "Pros Great Opportunities, super smart people Cons Not everyone is easy to work with", "rating": 5, "pros": "Great Opportunities, super smart people", "cons": "Not everyone is easy to work with", "advice": null}, {"title": "NY Office Sucks", "text": "Pros Great colleagues at peer level, full service firm, good training for AAE-SAE levels but then gets too specialized. Access to cutting edge offerings and if you luck out on a client, the work can be challenging in a good way. Cons Horrible leadership - disingenuous and full of lip service that they never walk the talk on. Thought it would be a good place for women to advance their careers but you only get ahead if you suck up and blindly agree with everything senior execs say. The female leaders are maybe the worst offenders and can be down right rude. If your not a working mom, your expected to work weekends and late nights without any acknowledgement or appreciation. Would not recommend this place to anyone wanting to build their career on merit and who doesn't want to brown nose their way up the ladder. Also, unless your a 'creative,' no one really cares about you, you won't get paid as much, and your job will basically be to pander to them and take care of grunt work. Advice to Management Make client account teams feel important, and don't be so hypocritical, preachy and insincere.", "rating": 1, "pros": "Great colleagues at peer level, full service firm, good training for AAE-SAE levels but then gets too specialized. Access to cutting edge offerings and if you luck out on a client, the work can be challenging in a good way.", "cons": "Horrible leadership - disingenuous and full of lip service that they never walk the talk on. Thought it would be a good place for women to advance their careers but you only get ahead if you suck up and blindly agree with everything senior execs say. The female leaders are maybe the worst offenders and can be down right rude. If your not a working mom, your expected to work weekends and late nights without any acknowledgement or appreciation. Would not recommend this place to anyone wanting to build their career on merit and who doesn't want to brown nose their way up the ladder. Also, unless your a 'creative,' no one really cares about you, you won't get paid as much, and your job will basically be to pander to them and take care of grunt work.", "advice": "Make client account teams feel important, and don't be so hypocritical, preachy and insincere."}, {"title": "Typical of agency, but in good company", "text": "Pros 1. You are surrounded by brilliant, experienced, connected people. The exposure you get to your employees and top tier clients is unrivaled. 2. If you have a good boss, you have a lot of clarity into the promotion process. Cons 1. It's agency, so it's high pressure and competitive. 2. It can be hard to get promoted.", "rating": 5, "pros": "1. You are surrounded by brilliant, experienced, connected people. The exposure you get to your employees and top tier clients is unrivaled.", "cons": "1. It's agency, so it's high pressure and competitive.", "advice": null}, {"title": "Group Creative Director", "text": "Pros Great environment to learn as a Junior to Mid level PR executive or manager. Cons Challenging environment for anyone being hired for non-core competencies of the group, such as advertising or Digital advertising (purely from a creative independence perspective). Advice to Management Transparency is required in interactions with employees.", "rating": 3, "pros": "Great environment to learn as a Junior to Mid level PR executive or manager.", "cons": "Challenging environment for anyone being hired for non-core competencies of the group, such as advertising or Digital advertising (purely from a creative independence perspective).", "advice": "Transparency is required in interactions with employees."}, {"title": "Account Executive", "text": "Pros Great sense of camaraderie. Co-workers are by far the best part about working at Edelman. We've become friends through our open floor seating, constant collaboration on cross-division projects, and team outings. Cons Salaries are low in PR. Advice to Management Ensure a work-life balance.", "rating": 5, "pros": "Great sense of camaraderie. Co-workers are by far the best part about working at Edelman. We've become friends through our open floor seating, constant collaboration on cross-division projects, and team outings.", "cons": "Salaries are low in PR.", "advice": "Ensure a work-life balance."}, {"title": "SAS", "text": "Pros Great people and great work life balance. Cons Depending on client and integrated team set-up, getting work done is sometimes difficult", "rating": 3, "pros": "Great people and great work life balance.", "cons": "Depending on client and integrated team set-up, getting work done is sometimes difficult", "advice": null}, {"title": "Research Analyst", "text": "Pros Great work environment with incredibly intelligent people. Oppurtunities to work on interesting and Fortune 500 companies. Free gear is given out sometimes Cons Almost no opportunity to advance unless you are manager's favorite. Sometimes people fall through the cracks if have a quieter personality. Advice to Management Focus more on employees and training new hires so they do not get left behind. Management needs to do a better job of delegating tasks so can be more knowledgeable in the future.", "rating": 3, "pros": "Great work environment with incredibly intelligent people. Oppurtunities to work on interesting and Fortune 500 companies. Free gear is given out sometimes", "cons": "Almost no opportunity to advance unless you are manager's favorite. Sometimes people fall through the cracks if have a quieter personality.", "advice": "Focus more on employees and training new hires so they do not get left behind. Management needs to do a better job of delegating tasks so can be more knowledgeable in the future."}, {"title": "Account Executive", "text": "Pros Typically a good work/life balance, fun workplace-wide events like happy hours and volunteer trips, good vacation time, engaged managers, notable + name-recognition clients Cons Very client-first attitude vs. employee-first, limited transparency with upper management, outdated review system (360 degree reviews, can only be promoted each year at Sept. even if positive review during the check-ins in February), pay is on the lower side Advice to Management Engage a bit more with lower-level employees to foster relationships and encourage them to stay. Consider changing the review system and paying a bit more for salaries to retain top talent to keep them at the company as they grow.", "rating": 5, "pros": "Typically a good work/life balance, fun workplace-wide events like happy hours and volunteer trips, good vacation time, engaged managers, notable + name-recognition clients", "cons": "Very client-first attitude vs. employee-first, limited transparency with upper management, outdated review system (360 degree reviews, can only be promoted each year at Sept. even if positive review during the check-ins in February), pay is on the lower side", "advice": "Engage a bit more with lower-level employees to foster relationships and encourage them to stay. Consider changing the review system and paying a bit more for salaries to retain top talent to keep them at the company as they grow."}, {"title": "Drop the Politics", "text": "Pros Provides great experience for young employees in learning the building blocks of comms marketing; high-level accounts; opportunity for growth in a worldwide network Cons Favortism persists and promos/awards not always based on quality of work done, especially at senior levels. Also, the company is going through a transition and not everyone understands their new roles. Pay isn't great compared to others in the industry, especially for the hours you put in. Advice to Management If it weren't for the politics, Edelman would be a great place to work long in the future.", "rating": 3, "pros": "Provides great experience for young employees in learning the building blocks of comms marketing; high-level accounts; opportunity for growth in a worldwide network", "cons": "Favortism persists and promos/awards not always based on quality of work done, especially at senior levels. Also, the company is going through a transition and not everyone understands their new roles. Pay isn't great compared to others in the industry, especially for the hours you put in.", "advice": "If it weren't for the politics, Edelman would be a great place to work long in the future."}, {"title": "Clickish Environment", "text": "Pros Flex work schedule - somewhat family friendly employee programs - various rewards, including work abroad client mix - strong roster of companies to represent Cons Tend to get rid of people to protect bottom line, but \"preach\" how they value and grow talent. Cut-throat, everyone is jockeying for promotion and will do whatever it takes, including lying and throwing colleagues under the bus Lots of talk with no true action to back up Advice to Management Hire senior leaders who know what they're doing and don't be afraid to get rid of those who are in over their heads", "rating": 3, "pros": "Flex work schedule - somewhat family friendly", "cons": "Tend to get rid of people to protect bottom line, but \"preach\" how they value and grow talent.", "advice": "Hire senior leaders who know what they're doing and don't be afraid to get rid of those who are in over their heads"}, {"title": "Vice President", "text": "Pros Great leadership, amazing job opportunities, focused on employee growth opportunities Cons Management is focused on bettering the culture. Being such a large office makes it more difficult for employees to connect.", "rating": 5, "pros": "Great leadership, amazing job opportunities, focused on employee growth opportunities", "cons": "Management is focused on bettering the culture. Being such a large office makes it more difficult for employees to connect.", "advice": null}, {"title": "Best of the best", "text": "Pros - Edelman, Seattle in particular, has a great culture - You get to work with some of the brightest and most driven people in the industry - There is a lot of room for growth! Edelman not only outlines what you need to do to go to the next level, but also provides continuous education opportunities through offsites, webinars, campaign recaps, etc. Cons - Depending on your client, you can work long hours, though my managers typically check in when they know that's the case, looking for how they can lower my workload - The pay isn't as great as in-house", "rating": 5, "pros": "- Edelman, Seattle in particular, has a great culture", "cons": "- Depending on your client, you can work long hours, though my managers typically check in when they know that's the case, looking for how they can lower my workload", "advice": null}, {"title": "Senior account esecutive", "text": "Pros Firm with great clients And opportunity To make a quick career growth. Cons The managers are demanding in terms of time needed from resources. Advice to Management Work on a better work-life balance for employees", "rating": 5, "pros": "Firm with great clients And opportunity To make a quick career growth.", "cons": "The managers are demanding in terms of time needed from resources.", "advice": "Work on a better work-life balance for employees"}, {"title": "Sr. Digital Project Manager", "text": "Pros Strong social media strategy, recognizable name in the PR industry, on-site cafeteria with grab & go purchase options. Cons Edelman Digital shares the typical issue that seems to be prevalent in PR firms or PR/advertising hybrid departments within PR firms. The PR Account Managers don't know how to function as Account Managers within the processes and industry best practices for advertising. They prefer to come up with 'castle-in-the-clouds' ideas and toss half-baked poorly-conceived project initiatives over the wall at their Project Management staff and then refuse to engage with any detail work, followup questions, or making strategic decisions necessary to align with greater client KPIs. Essentially, they do the work of a PR Account person, not the client-relationship management and strategic point of control work of an Advertising Account person. This puts undue stress on Project Management professionals who are used to industry best practices in division of labor. You go in looking for your Account Management counterpart only to continually be shoved into fulfilling that role yourself, when nowhere on your job description does it ever say you were supposed to be an Account Management hybrid PM in the first place. Advice to Management Take some time and really learn what the INDUSTRY thinks the role of Project Management professionals is, and adjust YOUR expectations to match that. If you want to staff the roles with combined AM/PMs, be prepared to pay a premium to attract the kind of professionals who can balance the diametrically-opposed skillsets and priorities of the AM & PM roles. In short, learn that AM's are the advocates of the client and always try to say yes; but PMs are the advocates of the *agency* and are SUPPOSED to say 'no' whenever necessary to prevent the Account Management team from giving away the shop. This was a few years ago, but if Duc Le is still running things, then chances are good they haven't figured this out yet. They just assume that their PMs will come in willing and able to work as Account Managers as well without the incremental salary bump that a true Digital PM/AM professional is worth in today's marketplace.", "rating": 3, "pros": "Strong social media strategy, recognizable name in the PR industry, on-site cafeteria with grab & go purchase options.", "cons": "Edelman Digital shares the typical issue that seems to be prevalent in PR firms or PR/advertising hybrid departments within PR firms. The PR Account Managers don't know how to function as Account Managers within the processes and industry best practices for advertising. They prefer to come up with 'castle-in-the-clouds' ideas and toss half-baked poorly-conceived project initiatives over the wall at their Project Management staff and then refuse to engage with any detail work, followup questions, or making strategic decisions necessary to align with greater client KPIs. Essentially, they do the work of a PR Account person, not the client-relationship management and strategic point of control work of an Advertising Account person.", "advice": "Take some time and really learn what the INDUSTRY thinks the role of Project Management professionals is, and adjust YOUR expectations to match that. If you want to staff the roles with combined AM/PMs, be prepared to pay a premium to attract the kind of professionals who can balance the diametrically-opposed skillsets and priorities of the AM & PM roles."}, {"title": "Think twice before going to Edelman", "text": "Pros There are some very smart and hard working people there. Edelman has some big name brands which can be fun to work on. Cons Hard and well-done work and long hours are not appreciated. What is appreciated? Being a yes-man. Sucking up to get ahead. I can't count the number of middle to senior management who I saw get promoted by sucking up to those above them. Their promotions and raises were not merit-based. Raises are a joke and Edelman is consistently paying under the national average - and they know they are. Turnover rate is very high (they also know this), but because of the name, you're incredibly replaceable, so they just don't care about you (most last less than 2 years). Definitely do a lot of research to see if this is the place for you. Advice to Management Stay at Edelman - you'll be a joke elsewhere and will actually have to work.", "rating": 1, "pros": "There are some very smart and hard working people there. Edelman has some big name brands which can be fun to work on.", "cons": "Hard and well-done work and long hours are not appreciated. What is appreciated? Being a yes-man. Sucking up to get ahead. I can't count the number of middle to senior management who I saw get promoted by sucking up to those above them. Their promotions and raises were not merit-based. Raises are a joke and Edelman is consistently paying under the national average - and they know they are. Turnover rate is very high (they also know this), but because of the name, you're incredibly replaceable, so they just don't care about you (most last less than 2 years). Definitely do a lot of research to see if this is the place for you.", "advice": "Stay at Edelman - you'll be a joke elsewhere and will actually have to work."}, {"title": "Account Supervisor", "text": "Pros Many resources, smart colleagues, wide range of clients. Cons Extremely demanding clients, lack of flexibility for employees wanting more variety in account mix. Advice to Management To keep talent, work with them to ensure they're happy with their account mix.", "rating": 5, "pros": "Many resources, smart colleagues, wide range of clients.", "cons": "Extremely demanding clients, lack of flexibility for employees wanting more variety in account mix.", "advice": "To keep talent, work with them to ensure they're happy with their account mix."}, {"title": "Meritocracy", "text": "Pros Lots of upward mobility for top performers. AMAZING people work here. I genuinely look forward to work everyday and that's because of the people. Bureaucracy exists, but easy to bypass with a few years of experience and relationships. Fast-moving environment, very entrepreneurial. If you point out a problem, the expectation is that you also provide a solution. Cons You're always going to get paid less at an agency, but you make up for that in interesting/high-profile client work. Advice to Management Continue to empower junior employees and reward ambitious top performers.", "rating": 5, "pros": "Lots of upward mobility for top performers. AMAZING people work here. I genuinely look forward to work everyday and that's because of the people. Bureaucracy exists, but easy to bypass with a few years of experience and relationships. Fast-moving environment, very entrepreneurial. If you point out a problem, the expectation is that you also provide a solution.", "cons": "You're always going to get paid less at an agency, but you make up for that in interesting/high-profile client work.", "advice": "Continue to empower junior employees and reward ambitious top performers."}, {"title": "Excellent company", "text": "Pros Edelman is an amazing company to work for. They value their employees and understand we are the most valuable asset they have. It's a fast-paced work environment which constantly pushes you to learn and expand your expertise. Cons There are not many cons to working at Edelman, the following are just minor suggestions to make the company even better: It would be nice if there was a buyback option for your unused PTO. Also, it would be great for the working parents to have daycare available.", "rating": 5, "pros": "Edelman is an amazing company to work for. They value their employees and understand we are the most valuable asset they have. It's a fast-paced work environment which constantly pushes you to learn and expand your expertise.", "cons": "There are not many cons to working at Edelman, the following are just minor suggestions to make the company even better: It would be nice if there was a buyback option for your unused PTO. Also, it would be great for the working parents to have daycare available.", "advice": null}, {"title": "Good experience", "text": "Pros Decent clients, good team, several folks to look up to/learn from Cons Bit of chaos in terms of whether the office was heading in the right direction. Felt like we were rebuilding without quite ever saying so.", "rating": 5, "pros": "Decent clients, good team, several folks to look up to/learn from", "cons": "Bit of chaos in terms of whether the office was heading in the right direction. Felt like we were rebuilding without quite ever saying so.", "advice": null}, {"title": "Good place to start your career", "text": "Pros Edelman Intelligence (formerly Edelman Berland) is a good place to start your career coming out of college, especially in the Rochester area. The company employs many recent graduates with a variety of different degrees. Employees and management tend to get along very well, and management genuinely cares about the well-being of their employees. Friendly, casual work environment with an open floor plan office layout. Work-life balance is good, with solid benefits and plenty of vacation days. Exposure to many high profile clients and PR campaigns. Edelman is a well-known company and looks good on your resume, as they are the world's largest privately-owned PR firm. Cons In Rochester, it feels as though our work is often under appreciated by account teams in various geo offices, as the finished product is sometimes not even shared with the Rochester team (even though we often do a lot of the heavy lifting). At a certain point (usually at the 2-3 mark), the company could do a better job of retaining junior level talent, as they often leave for better opportunities (more $). If a certain standard is met, entry level employees will receive a promotion within 1-2 years, with no clear career path after that. Work can be monotonous at times with little variety in a day (media monitoring reports, coding projects). It would be more beneficial for employees to understand how their work matters in the grand scheme of things and to be involved every step of the way rather than just a \"behind-the-scenes\" role. Advice to Management Micromanaging can be an issue, especially with employees that have experience and prefer a more \"hands off\" managing approach. At times, promises from management are not kept, such as cross-training between departments (Primary and Secondary Research teams). It would benefit everyone in the organization if management was more transparent across the board.(i.e.- future plans, growth opportunities, immediate needs, room for improvement, etc.). There are times where it feels like only certain members of the organization are \"in the know\" about important issues.", "rating": 3, "pros": "Edelman Intelligence (formerly Edelman Berland) is a good place to start your career coming out of college, especially in the Rochester area. The company employs many recent graduates with a variety of different degrees.", "cons": "In Rochester, it feels as though our work is often under appreciated by account teams in various geo offices, as the finished product is sometimes not even shared with the Rochester team (even though we often do a lot of the heavy lifting).", "advice": "Micromanaging can be an issue, especially with employees that have experience and prefer a more \"hands off\" managing approach."}, {"title": "great company overall, west coast management needs serious help.", "text": "Pros Client roster is excellent. Senior level clients are incredibly smart, focused and driven. Being independently owned allows the company to act for the long term and experiment, rather than focus so heavily on quarterly numbers. Mid-level staff (VP) and below are energetic, smart and genuinely seem to want to do the best they can. Cons “Optics” far outweigh \"results\". Speaking for the West Coast, one of the most political environments I have ever seen. Riddled with managers who seem to have never managed before. Senior management – especially in general marketing disciplines (not traditional PR) – seem to think their job is to spend on lunches, drinks, hotels and to parade around losses disguised as wins (read: low budget, mid level, one time project work that loses money. Client retreats after underwhelming work due to poor setup and poorly managed expectations.) Incredibly poor hiring track record for key roles: Consistently hiring (and then within a year firing) the wrong people with the wrong skill sets who are given the wrong responsibilities and the wrong reporting structure. It’s damaging to culture, morale and the work every single time. Promotions and raises are predicted (accurately) based on social media posts of senior management’s after work drinking buddies. Very cliquey. Advice to Management Look past the first layer who reports to you. Dig into who really grew the client, won the pitch, built the relationship, came up with the concept. Move promotion and raise decisions to committees outside of direct managers to combat favoritism. Look at track record of success and failures and promote/replace appropriately. Pay attention to North American feedback in glassdoor – pretty consistent in terms of work life balance, pay and especially politics.", "rating": 3, "pros": "Client roster is excellent. Senior level clients are incredibly smart, focused and driven.", "cons": "“Optics” far outweigh \"results\".", "advice": "Look past the first layer who reports to you. Dig into who really grew the client, won the pitch, built the relationship, came up with the concept."}, {"title": "I love this place", "text": "Pros Amazing people. Top tier clients. High performance culture. If you don't like like in the fast lane, Edelman is not the place for you. Clients can be very demanding and the agency bends to accommodate as much as possible. It encourages teams to constantly problem solve and identify alternative options. It's why most people who love the place stay and why those who don't, leave. Cons The office is a little outdated in places. It's hard to get to know everyone due to the size. It's also very quiet on most floors, would be nicer if there was more bustle around the building.", "rating": 5, "pros": "Amazing people. Top tier clients. High performance culture. If you don't like like in the fast lane, Edelman is not the place for you. Clients can be very demanding and the agency bends to accommodate as much as possible. It encourages teams to constantly problem solve and identify alternative options. It's why most people who love the place stay and why those who don't, leave.", "cons": "The office is a little outdated in places. It's hard to get to know everyone due to the size. It's also very quiet on most floors, would be nicer if there was more bustle around the building.", "advice": null}, {"title": "AAE", "text": "Pros Company Atmosphere - always something new to learn Cons Underpaid, over-worked, under appreciated. Extremely hard to balance all that is expected. Advice to Management Show more appreciation for Junior Level Staff - that's why the turnover rate is so high.", "rating": 5, "pros": "Company Atmosphere - always something new to learn", "cons": "Underpaid, over-worked, under appreciated. Extremely hard to balance all that is expected.", "advice": "Show more appreciation for Junior Level Staff - that's why the turnover rate is so high."}, {"title": "Great place to start a career", "text": "Pros There is room for growth, mentorship opportunities and career development options for junior staff across the board. Cons Very little negative to say - the name gets you places and the client roster can't be beat.", "rating": 5, "pros": "There is room for growth, mentorship opportunities and career development options for junior staff across the board.", "cons": "Very little negative to say - the name gets you places and the client roster can't be beat.", "advice": null}, {"title": "Great company, great people", "text": "Pros Edelman produces great work for its clients. Much of it in part because of how it treats its employees, like family. Cons Like any other agency, the culture is hyper focused on titles. This in turn creates imbalanced workloads and interesting office culture. Employees can also be paid better. Advice to Management Keep up the great work! The company is doing great things, the only thing that needs to follow is the appropriate pay for each employee.", "rating": 5, "pros": "Edelman produces great work for its clients. Much of it in part because of how it treats its employees, like family.", "cons": "Like any other agency, the culture is hyper focused on titles. This in turn creates imbalanced workloads and interesting office culture. Employees can also be paid better.", "advice": "Keep up the great work! The company is doing great things, the only thing that needs to follow is the appropriate pay for each employee."}, {"title": "vice president", "text": "Pros Smart people, good management, family-friendly culture Cons Intense pace, lack of focus on career development lead to high levels of attrition Advice to Management invest more in people", "rating": 5, "pros": "Smart people, good management, family-friendly culture", "cons": "Intense pace, lack of focus on career development lead to high levels of attrition", "advice": "invest more in people"}, {"title": "assistant Account Executive", "text": "Pros Edelman give you many opportunities to grow and get a mentor within the company - great company to work for. Cons As with many entry level PR job, the hours are long and the pay is short and that is it.", "rating": 5, "pros": "Edelman give you many opportunities to grow and get a mentor within the company - great company to work for.", "cons": "As with many entry level PR job, the hours are long and the pay is short and that is it.", "advice": null}, {"title": "Account Supervisor", "text": "Pros the people, companies values, office is nice, good perks Cons work-life balance is a little hard but this is pretty much any agency", "rating": 5, "pros": "the people, companies values, office is nice, good perks", "cons": "work-life balance is a little hard but this is pretty much any agency", "advice": null}, {"title": "The people make this company", "text": "Pros The people - you are surrounded by people who strive for the best work and are truly passionate about what they do. Cons Not really a con -- It's tough and competitive. There is no room for mediocrity. Advice to Management Continue transparency.", "rating": 5, "pros": "The people - you are surrounded by people who strive for the best work and are truly passionate about what they do.", "cons": "Not really a con -- It's tough and competitive. There is no room for mediocrity.", "advice": "Continue transparency."}, {"title": "Edelman Thoughts", "text": "Pros Some of the most creative and exciting work you will ever do is at this agency. They try to keep employees happy - parties, happy hours, bagels, etc. Cons Because there is such a degree of excellence to this job, the work-life balance can be a little lacking. The review process also needs a serious overhaul. Advice to Management Acknowledge when people are not meeting up to the standards of excellence", "rating": 5, "pros": "Some of the most creative and exciting work you will ever do is at this agency. They try to keep employees happy - parties, happy hours, bagels, etc.", "cons": "Because there is such a degree of excellence to this job, the work-life balance can be a little lacking. The review process also needs a serious overhaul.", "advice": "Acknowledge when people are not meeting up to the standards of excellence"}, {"title": "The BEST Organization I ever had the privilege to work for", "text": "Pros Support from EVERYONE, coworkers and management alike Cons Temporary role, would love to work there full time", "rating": 5, "pros": "Support from EVERYONE, coworkers and management alike", "cons": "Temporary role, would love to work there full time", "advice": null}, {"title": "Great People!", "text": "Pros The people that worked at Edelman remain some of my most favorite people on earth. The company, while corporate, really encouraged their employees to get along and love each other... which was great for when there were late nights. I even love some of my former clients! Cons Some really really really long hours. There were a few times that I was at the office well past midnight. Advice to Management none.", "rating": 5, "pros": "The people that worked at Edelman remain some of my most favorite people on earth. The company, while corporate, really encouraged their employees to get along and love each other... which was great for when there were late nights. I even love some of my former clients!", "cons": "Some really really really long hours. There were a few times that I was at the office well past midnight.", "advice": "none."}, {"title": "Very disappointing experience", "text": "Pros The relatively new office for Edelman Seattle (November 2014) offers spectacular views of the city while you regularly work 60+ hour weeks. The location of the office is conveniently downtown near numerous modes of public transport. There are smart, talented people, but that depends solely on your team. Edelman does have a great internal education program and health benefits. Cons The pay must increase to keep up with the increasing cost of living in the City of Seattle, particularly for junior staff. It is disappointing how many hours people would work for little compensation. At the very least offer a bus pass discount, as a majority of Seattle employees commute to work by bus. The work culture is uptight and stuffy to the point where I consistently felt like I was walking on eggshells. Teams, particularly on technology accounts, were cliquey and I was subjected to unprofessional behavior because of my junior position. Favoritism was rampant, particularly among mid and senior-level staff. Teams were weirdly staffed and senior management paid attention to only the larger, more prestigious accounts. Simply put, working here will drain you both mentally and physically. Advice to Management Treat junior executives with more respect, as they will ultimately become the future leaders of the company. Loosen up the culture and allow people to be themselves and more work from home opportunities. Depending on your team, I noticed many mid and senior-level executives did not assist junior staff in growing, which creates an evolving trap door of talent. Mid-level management, particularly Account Supervisors and Senior Account Executives must recognize that it is their responsibility to help colleagues both junior and senior to achieve team success. Offer better pay and benefits to keep up with the increasing cost of living. Senior management must spread their time and energy across ALL accounts.", "rating": 3, "pros": "The relatively new office for Edelman Seattle (November 2014) offers spectacular views of the city while you regularly work 60+ hour weeks. The location of the office is conveniently downtown near numerous modes of public transport. There are smart, talented people, but that depends solely on your team. Edelman does have a great internal education program and health benefits.", "cons": "The pay must increase to keep up with the increasing cost of living in the City of Seattle, particularly for junior staff. It is disappointing how many hours people would work for little compensation. At the very least offer a bus pass discount, as a majority of Seattle employees commute to work by bus. The work culture is uptight and stuffy to the point where I consistently felt like I was walking on eggshells. Teams, particularly on technology accounts, were cliquey and I was subjected to unprofessional behavior because of my junior position. Favoritism was rampant, particularly among mid and senior-level staff. Teams were weirdly staffed and senior management paid attention to only the larger, more prestigious accounts. Simply put, working here will drain you both mentally and physically.", "advice": "Treat junior executives with more respect, as they will ultimately become the future leaders of the company. Loosen up the culture and allow people to be themselves and more work from home opportunities. Depending on your team, I noticed many mid and senior-level executives did not assist junior staff in growing, which creates an evolving trap door of talent. Mid-level management, particularly Account Supervisors and Senior Account Executives must recognize that it is their responsibility to help colleagues both junior and senior to achieve team success. Offer better pay and benefits to keep up with the increasing cost of living. Senior management must spread their time and energy across ALL accounts."}, {"title": "Account Supervisor", "text": "Pros Best-in-class client names; Brilliant co-workers; Occasional opportunities to have agency over one's own career path internally; Flexible environment when it comes to needing to be out of the office (family emergencies, sick / WFH time, etc.) Cons Very political and secretive nature of communications and processes from senior executives leaves employees feeling directionless and at times unaware of their options; No internal communications with regard to standardizing essential procedures and expectations; Employees are expected to perform at the highest level of effort \"because you work for the best PR firm\" but are not compensated nearly as well as competitors and are eventually forced out to find the salaries they deserve. Advice to Management Be more transparent; Pay employees enough to encourage them to stay rather than create a revolving door of top talent.", "rating": 3, "pros": "Best-in-class client names; Brilliant co-workers; Occasional opportunities to have agency over one's own career path internally; Flexible environment when it comes to needing to be out of the office (family emergencies, sick / WFH time, etc.)", "cons": "Very political and secretive nature of communications and processes from senior executives leaves employees feeling directionless and at times unaware of their options; No internal communications with regard to standardizing essential procedures and expectations; Employees are expected to perform at the highest level of effort \"because you work for the best PR firm\" but are not compensated nearly as well as competitors and are eventually forced out to find the salaries they deserve.", "advice": "Be more transparent; Pay employees enough to encourage them to stay rather than create a revolving door of top talent."}, {"title": "Senior Content Producer", "text": "Pros I find Edelman to be an extremely supportive work environment, filled with amazing and talented colleagues that have become great friends as well. I look forward to coming to work everyday. Edelman as a company upholds some of the best values, specifically equality rights and family. Cons The company has been around for a while, and thus it is a large company and is set in some ways. Affecting change takes longer to see results because of this, but I believe anything is possible within these walls.", "rating": 5, "pros": "I find Edelman to be an extremely supportive work environment, filled with amazing and talented colleagues that have become great friends as well. I look forward to coming to work everyday. Edelman as a company upholds some of the best values, specifically equality rights and family.", "cons": "The company has been around for a while, and thus it is a large company and is set in some ways.", "advice": null}, {"title": "Senior Vice President", "text": "Pros Excellent talent pool and resources. Cons Work life balance could be improved. Advice to Management Invest more in talent retention.", "rating": 5, "pros": "Excellent talent pool and resources.", "cons": "Work life balance could be improved.", "advice": "Invest more in talent retention."}, {"title": "Amazing long-term company, with some kinks", "text": "Pros Best and brightest in the industry, offer ample growth opportunities Cons Long hours, office politics can feel toxic, employees can feel overburdened by workloads with unbalanced staffing at times Advice to Management Have frequent and transparent conversations with direct reports regarding goals and current performance", "rating": 5, "pros": "Best and brightest in the industry, offer ample growth opportunities", "cons": "Long hours, office politics can feel toxic, employees can feel overburdened by workloads with unbalanced staffing at times", "advice": "Have frequent and transparent conversations with direct reports regarding goals and current performance"}, {"title": "Check the trends graphs, this place is on the decline", "text": "Pros Some really great people. Casual work environment. Top clients (as dysfunctional as they may be). Respectable salary and benefits. Very challenging and lots of room for growth...to a point. Cons Leadership has become a joke. The guys in charge (and they are all guys) have no clear role or greater vision--they are a bunch of \"yes\" men with ADD who drop unfeasible ideas on the \"no\" women beneath them, who are then expected to tackle and execute problems based on reality. There is no autonomy or direction when it comes to one's career; to get ahead as a woman, you have to do whatever is asked of you regardless of your skills or areas of expertise. Instead of matching work to the person, the only criteria used is capacity and dependability, so as usual, the high performers suffer while the people who've proven useless coast along. Office politics are also insufferable--there is a galling amount of gossip and backstabbing among middle and upper management. As for junior staff, i think it's probably a decent place to be--as with most agencies, you'll end up doing the bulk of the labor while your billing rates are cheap, shoot up the ladder if you do a great job, then land in the pile of dung that is a management role. The real killer is seeing how the sausage is made. And all of this is to say nothing of some of the lunatics we work for. Advice to Management Hahaha. Right, advice to management. I'll save my characters.", "rating": 3, "pros": "Some really great people. Casual work environment. Top clients (as dysfunctional as they may be). Respectable salary and benefits. Very challenging and lots of room for growth...to a point.", "cons": "Leadership has become a joke. The guys in charge (and they are all guys) have no clear role or greater vision--they are a bunch of \"yes\" men with ADD who drop unfeasible ideas on the \"no\" women beneath them, who are then expected to tackle and execute problems based on reality. There is no autonomy or direction when it comes to one's career; to get ahead as a woman, you have to do whatever is asked of you regardless of your skills or areas of expertise. Instead of matching work to the person, the only criteria used is capacity and dependability, so as usual, the high performers suffer while the people who've proven useless coast along. Office politics are also insufferable--there is a galling amount of gossip and backstabbing among middle and upper management.", "advice": "Hahaha. Right, advice to management. I'll save my characters."}, {"title": "Great leadership opportunities", "text": "Pros Leadership path; working with some of the largest companies in the world; access to resources and experts Cons Low pay compared to other agencies; office politics can detract from great work; very large company (for a PR firm) which creates a lot of unnecessary bureaucracy Advice to Management Invest a little less in hiring senior leaders who don't actually do client work and spend a little more on paying your jr and mid level associates better so that they'll stick around", "rating": 3, "pros": "Leadership path; working with some of the largest companies in the world; access to resources and experts", "cons": "Low pay compared to other agencies; office politics can detract from great work; very large company (for a PR firm) which creates a lot of unnecessary bureaucracy", "advice": "Invest a little less in hiring senior leaders who don't actually do client work and spend a little more on paying your jr and mid level associates better so that they'll stick around"}, {"title": "Still in Love", "text": "Pros Incredible clients, smart team, awesome culture, opportunities to relocate Cons Compensation for entry and junior-level staff", "rating": 5, "pros": "Incredible clients, smart team, awesome culture, opportunities to relocate", "cons": "Compensation for entry and junior-level staff", "advice": null}, {"title": "With current Administrative management in place, Edelman Chicago is an unhealthy place for Administrative Assistants.", "text": "Pros casual environment, benefits, ability to work from home Cons Administrative Assistants are not given the opportunity to advance, as current Administrative management prefers to hire Executive Assistants from outside the agency, bypassing quality admins already at the agency. Since the Administrative management change within the past year, cronyism has been set into place. Unless you're a part of the cronyism machine, you will not be advanced. With micromanaging and other factors in place, Administrative management has created a stressful and negative environment for the admin team. Morale is currently at an all time low for the Administrative Assistants at Edelman Chicago. Advice to Management Best practice would be to hire unbiased Administrative management from outside the agency - someone who has proven management skills. The culture of any organization is shaped by the worst behavior the leader is willing to tolerate.", "rating": 1, "pros": "casual environment, benefits, ability to work from home", "cons": "Administrative Assistants are not given the opportunity to advance, as current Administrative management prefers to hire Executive Assistants from outside the agency, bypassing quality admins already at the agency.", "advice": "Best practice would be to hire unbiased Administrative management from outside the agency - someone who has proven management skills."}, {"title": "VP", "text": "Pros Great middle layer of smart, passionate, supportive people A-list clients Good pay and benefits Cons Highly political, backstabbing, passive aggressive, and sexist at the more senior levels; little tolerance for diversity of opinions; minimal talent recognition (promotions are based solely on how well employees manage up vs. excel at the work); massive inefficiency and disorganization throughout the organization has led to mismanagement and misappropriation of client $$$ resulting in major account losses; poor integration between digital and traditional PR capabilities; shady, unethical business practices routinely overlooked to maintain the status quo Advice to Management stand behind who you say you are and walk your talk; fire the senior managers who behave unethically; create actual transparency instead of merely paying lip service to it; place more emphasis on talent and work product and get rid of lazy under performers who had little value to the business", "rating": 1, "pros": "Great middle layer of smart, passionate, supportive people", "cons": "Highly political, backstabbing, passive aggressive, and sexist at the more senior levels; little tolerance for diversity of opinions; minimal talent recognition (promotions are based solely on how well employees manage up vs. excel at the work); massive inefficiency and disorganization throughout the organization has led to mismanagement and misappropriation of client $$$ resulting in major account losses; poor integration between digital and traditional PR capabilities; shady, unethical business practices routinely overlooked to maintain the status quo", "advice": "stand behind who you say you are and walk your talk; fire the senior managers who behave unethically; create actual transparency instead of merely paying lip service to it; place more emphasis on talent and work product and get rid of lazy under performers who had little value to the business"}, {"title": "Great client names, poor work environment", "text": "Pros You get to work on big name clients, which sometimes leads to interesting work; there are smart leaders who work there, who care about their teams, but that's a limited few Cons highly political structure; hr confuses perks for culture - having free ice cream on Fridays and free fruit does not mean you have a fun culture; junior staff is compensated poorly and routinely treated badly as Edelman never trains people to be good managers - they put all the focus on \"managing up,\" which can be a good thing, but when managers are allowed to see their staff as people to throw under buses, \"managing up\" doesn't work; while they say you \"own your career path,\" they put in numerous roadblocks to it - ultimately, your career is linked to your team lead and what they \"volun-tell\" you to do and which opportunities they give you Advice to Management train managers to be good managers and focus on creating a good work environment rather than adding more empty perks", "rating": 3, "pros": "You get to work on big name clients, which sometimes leads to interesting work; there are smart leaders who work there, who care about their teams, but that's a limited few", "cons": "highly political structure; hr confuses perks for culture - having free ice cream on Fridays and free fruit does not mean you have a fun culture; junior staff is compensated poorly and routinely treated badly as Edelman never trains people to be good managers - they put all the focus on \"managing up,\" which can be a good thing, but when managers are allowed to see their staff as people to throw under buses, \"managing up\" doesn't work; while they say you \"own your career path,\" they put in numerous roadblocks to it - ultimately, your career is linked to your team lead and what they \"volun-tell\" you to do and which opportunities they give you", "advice": "train managers to be good managers and focus on creating a good work environment rather than adding more empty perks"}, {"title": "Identity Crisis", "text": "Pros lots of smart people, impressive portfolio of clients, entrepreneurial environment Cons profit over people and clients too many layers of management with lots of turnover struggling to integrate digital and traditional PR employee bad behavior is excused -- if revenue is attached Advice to Management focus on client AND people - profits will follow", "rating": 3, "pros": "lots of smart people, impressive portfolio of clients, entrepreneurial environment", "cons": "profit over people and clients", "advice": "focus on client AND people - profits will follow"}, {"title": "Needs to focus on talent vs public perception", "text": "Pros A great community of diverse talent. Edelman is working hard to evolve to the needs of the market and establishing itself beyond old school PR Cons Maternity leave policy is horrible - two weeks paid unless you sign up for ST which is six. Sad because so many women are leaving at this stage of their career. I was also asked to work during my leave and not compensated because I was using vacation days to cover my leave. Horrible. Advice to Management Be more concerned with how you treat talent vs the public perception of the company. Internal politics are still horrible and HR in Chicago needs to be revamped.", "rating": 3, "pros": "A great community of diverse talent. Edelman is working hard to evolve to the needs of the market and establishing itself beyond old school PR", "cons": "Maternity leave policy is horrible - two weeks paid unless you sign up for ST which is six. Sad because so many women are leaving at this stage of their career. I was also asked to work during my leave and not compensated because I was using vacation days to cover my leave. Horrible.", "advice": "Be more concerned with how you treat talent vs the public perception of the company. Internal politics are still horrible and HR in Chicago needs to be revamped."}, {"title": "It Was Just \"Okay", "text": "Pros Some people were friendly and kind. They also have free ice cream treats every Friday and a snack cart that goes around the office every Tuesday and Thursday. Cons The office space is so painfully quiet. There isn't much life or excitement. I'm glad I only worked there on a temporary assignment. Advice to Management Take down the old-school cubicles and have an open office space.", "rating": 3, "pros": "Some people were friendly and kind. They also have free ice cream treats every Friday and a snack cart that goes around the office every Tuesday and Thursday.", "cons": "The office space is so painfully quiet. There isn't much life or excitement. I'm glad I only worked there on a temporary assignment.", "advice": "Take down the old-school cubicles and have an open office space."}, {"title": "tech team intern", "text": "Pros open working environment, good relationship and team building, many learning opportunities, seminars each week, many food haha. Cons need to work overtime, repeating workload sometimes, reach the learning glass ceiling after a period of time, need to travel sometimes, after work, sometimes you still need to answer clients' calls.", "rating": 5, "pros": "open working environment, good relationship and team building, many learning opportunities, seminars each week, many food haha.", "cons": "need to work overtime, repeating workload sometimes, reach the learning glass ceiling after a period of time, need to travel sometimes, after work, sometimes you still need to answer clients' calls.", "advice": null}, {"title": "Tough environment to succeed in", "text": "Pros Good clients, large company, many resources, good salaries Cons disgruntled employees, many people feel they aren't getting their \"due\" and push others down because of it. Very competitive, non-supportive environment Advice to Management Create a more constructive, supportive environment rather than one that is \"sink or swim.\"", "rating": 3, "pros": "Good clients, large company, many resources, good salaries", "cons": "disgruntled employees, many people feel they aren't getting their \"due\" and push others down because of it. Very competitive, non-supportive environment", "advice": "Create a more constructive, supportive environment rather than one that is \"sink or swim.\""}, {"title": "Senior account supervisor", "text": "Pros Clear path for career development, opportunities to change departments and practices Cons Client service brings high pressure Advice to Management Help account managers navigate the politics and challenges that comes with collaborating across departments (creative, analytics, crisis, etc.)", "rating": 5, "pros": "Clear path for career development, opportunities to change departments and practices", "cons": "Client service brings high pressure", "advice": "Help account managers navigate the politics and challenges that comes with collaborating across departments (creative, analytics, crisis, etc.)"}, {"title": "great first job!", "text": "Pros great organization structure. so many opportunities within one company. Cons not compensated well enough for what we do.", "rating": 5, "pros": "great organization structure. so many opportunities within one company.", "cons": "not compensated well enough for what we do.", "advice": null}, {"title": "Great learning experience", "text": "Pros Working at Edelman right out of college was like a masters degree in PR. You learn how to do things the right way on some of the best clients. You can take those frameworks and apply them to other companies or to your own consulting practice down the line. Cons Big company, impersonal, very traditional views on remote working/flexibility around work/life balance Advice to Management Adjust with the needs of the new workforce", "rating": 3, "pros": "Working at Edelman right out of college was like a masters degree in PR. You learn how to do things the right way on some of the best clients. You can take those frameworks and apply them to other companies or to your own consulting practice down the line.", "cons": "Big company, impersonal, very traditional views on remote working/flexibility around work/life balance", "advice": "Adjust with the needs of the new workforce"}, {"title": "Give it a year or two then GTFO", "text": "Pros Great training grounds for newbies. Excellent health benefits. There are some wicked smart people and attractive, big-name client accounts. Cons Be prepared to work yourself into a state of complete breakdown: both mental and physical. They pay a LOT of lip service to work/life balance but after a while you'll realize what a joke it is. Junior level staff will regularly work insane hours. When you accept a job here, ask yourself how long you think you can sustain 60 hour work weeks, or regular 14-16 hour days (not including having to constantly check your phone on days off and after hours), then plan your exit strategy accordingly. The pay is insulting. It is so low. They'll try to woo you with \"spot bonuses\" which amount to a few hundred dollars maybe once a year, a third of which goes to the government in taxes. Do not fall for it. Negotiate for the highest starting salary possible cause you'll be stuck there for a while. Promotions? If you are THE golden child, enjoy being promoted every year. However, if you don't fit their perfect Edel-mold or they are afraid of upsetting said golden child by promoting you over them, expect lots of nitpicky feedback in your reviews and plenty of colleagues throwing you under the bus in an effort to climb the corporate ladder. As far as ethics and the treatment of women: Sexist clients? Check. Junior level staff hooking up with sexist clients? Double check. Mean girls? Triple check. Men regularly getting promoted over women? Yup. Women being told to smile more and watch their tone? Ohhhhhh yes. Advice to Management You can't expect to sustain the growth you're currently experiencing while delivering quality service to clients if you continue to work your junior level employees into the ground for pay that is quite honestly disrespectful. Stop over-servicing your clients at the expense of the people who you will one day need to run your company.", "rating": 3, "pros": "Great training grounds for newbies. Excellent health benefits. There are some wicked smart people and attractive, big-name client accounts.", "cons": "Be prepared to work yourself into a state of complete breakdown: both mental and physical. They pay a LOT of lip service to work/life balance but after a while you'll realize what a joke it is. Junior level staff will regularly work insane hours. When you accept a job here, ask yourself how long you think you can sustain 60 hour work weeks, or regular 14-16 hour days (not including having to constantly check your phone on days off and after hours), then plan your exit strategy accordingly.", "advice": "You can't expect to sustain the growth you're currently experiencing while delivering quality service to clients if you continue to work your junior level employees into the ground for pay that is quite honestly disrespectful. Stop over-servicing your clients at the expense of the people who you will one day need to run your company."}, {"title": "Edelman Dallas is", "text": "Pros The leadership and vision is inspirational. Local leadership has changed a lot the past year for the better as there has been a true commitment to bring in top talent and grow the client base. Top performers are recognized and given the freedom to push their professional boundaries. Just alike all agencies you work hard and you will be rewarded. Great work-life balance and very happy to be here! Cons The company is growing quickly, and sometimes challenges are inevitable. Advice to Management Continue to strive for greatness, and have high expectations. I have seen the office improve 110% since February 2015 by doing so!!", "rating": 5, "pros": "The leadership and vision is inspirational. Local leadership has changed a lot the past year for the better as there has been a true commitment to bring in top talent and grow the client base. Top performers are recognized and given the freedom to push their professional boundaries. Just alike all agencies you work hard and you will be rewarded. Great work-life balance and very happy to be here!", "cons": "The company is growing quickly, and sometimes challenges are inevitable.", "advice": "Continue to strive for greatness, and have high expectations. I have seen the office improve 110% since February 2015 by doing so!!"}, {"title": "Edelman PR - consumer team", "text": "Pros Amazing work environment with great people who are constantly on your side and working with you to help you succeed and work you way up in the company. Big opportunities to manage up and prove your readiness for promotion. Cons As working at any agency, the pay is not incredible. However, there are opportunities for bonuses and pay raises. Often pretty crazy hours, 10-12 hour days, which I don't mind, but if you're looking for a 9-5 job, this isn't for you.", "rating": 5, "pros": "Amazing work environment with great people who are constantly on your side and working with you to help you succeed and work you way up in the company. Big opportunities to manage up and prove your readiness for promotion.", "cons": "As working at any agency, the pay is not incredible. However, there are opportunities for bonuses and pay raises. Often pretty crazy hours, 10-12 hour days, which I don't mind, but if you're looking for a 9-5 job, this isn't for you.", "advice": null}, {"title": "Diamond in the Ruff", "text": "Pros For being part of a large PR company, the office has a home town feel. People are warm and inviting. Work is exciting and very fast paced. Cons Salary should be higher as we do the same work other offices do but at a lower rate. Advice to Management Employees are the foundation to the overall company success.", "rating": 5, "pros": "For being part of a large PR company, the office has a home town feel. People are warm and inviting. Work is exciting and very fast paced.", "cons": "Salary should be higher as we do the same work other offices do but at a lower rate.", "advice": "Employees are the foundation to the overall company success."}, {"title": "Best of the best", "text": "Pros Edelman truly has the best talent in the industry. I am constantly amazed by the great work we put out and the teams I get the opportunity to collaborate with on a daily basis. The people are smart, intellectually curious and creative. Cons The company is growing quickly, and with that there are kinks to work out as you engage new talent. However, I do feel they are implementing the right processes and initiatives to succeed with the rapid growth. Advice to Management Continue striving for greatness.", "rating": 5, "pros": "Edelman truly has the best talent in the industry. I am constantly amazed by the great work we put out and the teams I get the opportunity to collaborate with on a daily basis. The people are smart, intellectually curious and creative.", "cons": "The company is growing quickly, and with that there are kinks to work out as you engage new talent. However, I do feel they are implementing the right processes and initiatives to succeed with the rapid growth.", "advice": "Continue striving for greatness."}, {"title": "Edelman Berland RITC", "text": "Pros I love working at Edelman Berland! Every project provides a new challenge, and the constant variation in clients and types of projects keeps things interesting. And I could not say enough positive things about the people. My co-workers at kind, respectful, and simply a pleasure to work with. Cons Nothing I can think of!", "rating": 5, "pros": "I love working at Edelman Berland! Every project provides a new challenge, and the constant variation in clients and types of projects keeps things interesting. And I could not say enough positive things about the people. My co-workers at kind, respectful, and simply a pleasure to work with.", "cons": "Nothing I can think of!", "advice": null}, {"title": "N/A", "text": "Pros Full-throttled agency for adrenalin seekers. People are smart as hell and determined to deliver their very best for an unrivaled client roster. Entrepreneurial culture that actively encourages experimentation and reasoned risk-taking. Doing a better job than any other firm in mastering the new realities. Cons Hard for senior people to orient when they first arrive. Advice to Management Keep at it", "rating": 5, "pros": "Full-throttled agency for adrenalin seekers. People are smart as hell and determined to deliver their very best for an unrivaled client roster. Entrepreneurial culture that actively encourages experimentation and reasoned risk-taking. Doing a better job than any other firm in mastering the new realities.", "cons": "Hard for senior people to orient when they first arrive.", "advice": "Keep at it"}, {"title": "Dysfunctional office, tone deaf corporate leadership", "text": "Pros - Opportunity to work with, and learn from, brilliant PR pros throughout the Edelman network - team members from Austin, New York and Seattle are particularly strong. - Profit sharing was a nice benefit -Good health/dental/vision insurance - Company matched 401K contributions Cons - Work-life balance is non-existent. The company pays a lot of lip service to the concept, and makes overtures to demonstrate a commitment to women in the workplace, but the day-to-day reality involved a lot of 60+ hour work weeks and constantly staying glued to my phone during off-hours. - Salaries - particularly at the junior level (AAE/AE/SAE) - were ridiculously low (much lower than average salaries paid by other DFW agencies). I felt terrible about the amount of work we piled on staff while providing marginal compensation. - Promotions are given twice a year, and personal performance plays a small role in determining advancement (it seemed that more emphasis was given to regional revenue/ P&L). -Digital expertise in Dallas is almost non-existent; heavy reliance on senior staff in Austin and other offices. -Corporate and local leadership don't seem to understand the Dallas market.. The agency has a lengthy track record of churning through general managers every 3-5 years, which resulted in two major bouts of staff turnover during my tenure. Advice to Management - Provide competitive salaries to your staff. They work incredibly hard. - Bring in local, senior talent to lead the office. Listen to them. What works in Silicon Valley or New York doesn't necessarily work in Dallas. - Focus on providing employees with real opportunities for work-life balance (hint: unless staff members are working on a major, time-sensitive campaign or a crisis, the office should be empty by 6:30 p.m.)", "rating": 3, "pros": "- Opportunity to work with, and learn from, brilliant PR pros throughout the Edelman network - team members from Austin, New York and Seattle are particularly strong.", "cons": "- Work-life balance is non-existent. The company pays a lot of lip service to the concept, and makes overtures to demonstrate a commitment to women in the workplace, but the day-to-day reality involved a lot of 60+ hour work weeks and constantly staying glued to my phone during off-hours.", "advice": "- Provide competitive salaries to your staff. They work incredibly hard."}, {"title": "Happy to be here", "text": "Pros Amazing culture; unbelievably smart people. I am constantly learning and growing and being challenged with new projects. Cons Semi difficult work life balance because clientele is some of the biggest and best in the world. These brands never sleep, so you're constantly on call. Cons of being the best at what you do. Advice to Management N/A", "rating": 5, "pros": "Amazing culture; unbelievably smart people. I am constantly learning and growing and being challenged with new projects.", "cons": "Semi difficult work life balance because clientele is some of the biggest and best in the world. These brands never sleep, so you're constantly on call. Cons of being the best at what you do.", "advice": "N/A"}, {"title": "Senior Account Executive", "text": "Pros Incredibly smart, talented and driven team - they are the best of the best. Perfection is expected to garner the best results possible for all clients. It's a fast-paced, challenging and exciting environment that pushes everyone to produce their best. I loved working there, learned a ton, received a lot of opportunity. I was never a better PR professional than while at Edelman (if only I wanted to work in PR long-term...). Pay is fair. Great internal training. Amazing female mentoring groups. Offices are fabulous. Cons There are a lot of levels and processes that don't always drive production. While upper mgmt pushes \"work/life\" balance, long hours are often expected to get the job done. In some practice groups, there can be a lot of cattiness and competition. Success is truly based on your team and manager. Advice to Management Keep expanding on EdelU, coaching for performance, etc., Take note of those that are talented, but may not fit into the exact role they were hired for - their managers should be encouraged to ID how their talent can be used for the betterment of Edelman vs. punish someone for not fitting into a mold. My position was wonderful, but unique to my role at the company / on my team. I had many peers that struggled.", "rating": 5, "pros": "Incredibly smart, talented and driven team - they are the best of the best. Perfection is expected to garner the best results possible for all clients. It's a fast-paced, challenging and exciting environment that pushes everyone to produce their best. I loved working there, learned a ton, received a lot of opportunity. I was never a better PR professional than while at Edelman (if only I wanted to work in PR long-term...). Pay is fair. Great internal training. Amazing female mentoring groups. Offices are fabulous.", "cons": "There are a lot of levels and processes that don't always drive production. While upper mgmt pushes \"work/life\" balance, long hours are often expected to get the job done. In some practice groups, there can be a lot of cattiness and competition. Success is truly based on your team and manager.", "advice": "Keep expanding on EdelU, coaching for performance, etc., Take note of those that are talented, but may not fit into the exact role they were hired for - their managers should be encouraged to ID how their talent can be used for the betterment of Edelman vs. punish someone for not fitting into a mold. My position was wonderful, but unique to my role at the company / on my team. I had many peers that struggled."}, {"title": "Communications research with a twist.", "text": "Pros Relationship with Edelman. High profile client base with complex communications challenges. Range of client types (tech, QSR, healthcare, education, etc.). Amazing opportunity for growth (promotions are merit based, not restricted to position openings). Great responsibility at junior levels. A place where researchers are consultants vs. data monkeys - high visibility within Edelman. Small / nimble team. Cons There is still a lot of educating (i.e. why research matters) within the walls of Edelman. Quick turn projects are becoming the norm vs. the exception - this leads to intense timelines and long hours. Leadership, skills and work ethics are not consistent across offices. Advice to Management Enable a culture that doesn't default to the automatic yes - empower people to say \"no, but....\" Ensure consistency across offices (leadership, skills, etc.) through project training.", "rating": 5, "pros": "Relationship with Edelman. High profile client base with complex communications challenges. Range of client types (tech, QSR, healthcare, education, etc.). Amazing opportunity for growth (promotions are merit based, not restricted to position openings). Great responsibility at junior levels. A place where researchers are consultants vs. data monkeys - high visibility within Edelman. Small / nimble team.", "cons": "There is still a lot of educating (i.e. why research matters) within the walls of Edelman. Quick turn projects are becoming the norm vs. the exception - this leads to intense timelines and long hours. Leadership, skills and work ethics are not consistent across offices.", "advice": "Enable a culture that doesn't default to the automatic yes - empower people to say \"no, but....\" Ensure consistency across offices (leadership, skills, etc.) through project training."}, {"title": "Great company with opportunity", "text": "Pros The work is incredibly interesting- this company works with top tier clients and does high quality work. I have loved working here and most of all enjoy the people I work with. There are a lot of talented people that work hard, but it is also a fun work environment with a ton of young people in the office. I honestly cannot say anything bad about where I work. The company is growing and there is a lot of potential to grow as long as you put the work in Cons Honestly, I love working here and I love the people I work with. No cons for me", "rating": 5, "pros": "The work is incredibly interesting- this company works with top tier clients and does high quality work. I have loved working here and most of all enjoy the people I work with. There are a lot of talented people that work hard, but it is also a fun work environment with a ton of young people in the office. I honestly cannot say anything bad about where I work. The company is growing and there is a lot of potential to grow as long as you put the work in", "cons": "Honestly, I love working here and I love the people I work with. No cons for me", "advice": null}, {"title": "Perks over Salary", "text": "Pros Lots of benefits/ office perks Cons salary does not meet national average. Advice to Management Pay your employees the average", "rating": 5, "pros": "Lots of benefits/ office perks", "cons": "salary does not meet national average.", "advice": "Pay your employees the average"}, {"title": "Edelman Berland: West Coast", "text": "Pros Fast-moving. High-profile clients. Work that has impact. Entrepreneurial environment. Work-hard, play-hard. Profile of West Coast team improving. Growing team. Relationship with Edelman is positive Cons Workload can be heavy at times. Occasional long hours. Some unstructured working (just make it happen!). Introverted personalities sometimes get overlooked. Advice to Management Continue to position Research and Analytics as central to good marketing. Clarify offering to clients.", "rating": 5, "pros": "Fast-moving.", "cons": "Workload can be heavy at times.", "advice": "Continue to position Research and Analytics as central to good marketing."}, {"title": "Best PR Firm in world. Learn and grow a lot for the cost of work-life balance.", "text": "Pros Smart, professional, fun people, fast paced. Cons Work-life balance. Having a family while working at Edelman can be difficult for some. Advice to Management Washington", "rating": 5, "pros": "Smart, professional, fun people, fast paced.", "cons": "Work-life balance. Having a family while working at Edelman can be difficult for some.", "advice": "Washington"}, {"title": "Big Ship", "text": "Pros Large organization with much to offer at every career level. Focused on innovative approaches to connect brands with audiences. Integrated approach to campaigns. Cons Heavily political atmosphere with many groups and sub-groups. Trajectory of growth has let to a regular stream of new faces that don't necessary get or buy into the history and mission of the agency. Advice to Management Stay independent! Having worked for agencies owned by large holding companies the flexibility of a independent agency at Edelman's scale is a fundamentally different experience in how the agency goes to business.", "rating": 5, "pros": "Large organization with much to offer at every career level. Focused on innovative approaches to connect brands with audiences. Integrated approach to campaigns.", "cons": "Heavily political atmosphere with many groups and sub-groups. Trajectory of growth has let to a regular stream of new faces that don't necessary get or buy into the history and mission of the agency.", "advice": "Stay independent! Having worked for agencies owned by large holding companies the flexibility of a independent agency at Edelman's scale is a fundamentally different experience in how the agency goes to business."}, {"title": "Excellent people, great clients", "text": "Pros The people in the group are really bright, hard-working, curious and great people to be around. Additionally, the same holds for Edelman colleagues. The clients are top notch and the projects are really interesting. Cons Most project timelines tend to be super aggressive and it puts a lot of burden on people to get most everything they work on done yesterday. Advice to Management Try and set up projects to have realistic timelines with realistic deliverables. Seems like most recent projects are set up where everything has to work perfectly to meet very aggressive timelines and things rarely work perfectly.", "rating": 5, "pros": "The people in the group are really bright, hard-working, curious and great people to be around. Additionally, the same holds for Edelman colleagues. The clients are top notch and the projects are really interesting.", "cons": "Most project timelines tend to be super aggressive and it puts a lot of burden on people to get most everything they work on done yesterday.", "advice": "Try and set up projects to have realistic timelines with realistic deliverables. Seems like most recent projects are set up where everything has to work perfectly to meet very aggressive timelines and things rarely work perfectly."}, {"title": "Great place to start your career if you have a good manager", "text": "Pros - Great exposure to a variety of high-profile brands - Top notch training and resources - Ample support for junior staff - Fair review processes - The best meritocracy i've seen in the industry - Great attitude about working from home Cons - Clients are demanding, and the better you do, the more likely they put you on a difficult one - Little opportunity for work/life balance Advice to Management Invest in your junior folks and don't make teams so top heavy", "rating": 5, "pros": "- Great exposure to a variety of high-profile brands", "cons": "- Clients are demanding, and the better you do, the more likely they put you on a difficult one", "advice": "Invest in your junior folks and don't make teams so top heavy"}, {"title": "Stay Away", "text": "Pros They have the best health benefits of any large company I'm aware of. Pretty amazing. There are some nice buildings and you can get a Mac if you prefer. So, they got that going for them as well. Cons It's a soul crushing slog to work here. There is zero work life balance. You are expected to work insane long hours since the account folks will sell without regard for the impact on the people who do the actual work. It also doesn't help that the sales folks often have no clue about how to even get the work done. Expect very long work days and putting in hours over weekends. Don't be surprised if you are asked to participate in meetings while on vacation. Oh, and the travel. They will put you on a plane at a moments notice and fly you anywhere. Hope you didn't have any plans this weekend! The company has questionable ethics when it comes to who they represent. They represented Penn during the whole Sandusky thing. They helped with some BS climate-denier website on behalf of an oil company. You have to be willing to work for pretty much anyone as I can't see them turning down any client, no matter how sleazy. As other people have noted, the place is very political, and we are not just talking normal office politics. Who you know really does matter to how far you can get here. Advice to Management Get a soul. Seriously. Treat people better and start turning down clients who are evil. Not everyone deserves a PR firm.", "rating": 1, "pros": "They have the best health benefits of any large company I'm aware of. Pretty amazing. There are some nice buildings and you can get a Mac if you prefer. So, they got that going for them as well.", "cons": "It's a soul crushing slog to work here.", "advice": "Get a soul. Seriously. Treat people better and start turning down clients who are evil. Not everyone deserves a PR firm."}, {"title": "Senior Account Supervisor", "text": "Pros Family Oriented Place to Work and Practice Leads Cons Common Review Process and Lack of Salary Negotiation Advice to Management Increase Bonouses to Non VP level", "rating": 5, "pros": "Family Oriented Place to Work and Practice Leads", "cons": "Common Review Process and Lack of Salary Negotiation", "advice": "Increase Bonouses to Non VP level"}, {"title": "Terrible place to work -- do not believe Glassdoor rating", "text": "Pros Great client roster. Edelman works with a number of really interesting companies (though the work itself is not always very interesting). Cons Overall, did not find most employees to be intelligent or capable of critical thinking. There are very few new ideas -- we used to joke internally that we would just change the cover of a proposal without bringing in new ideas or fresh thinking. By the time I left, I was shocked that the agency managed to hang onto clients at all, so my best guess is that the bar is just lower in PR & comms. The place also has serious culture and values issues. I think the only reason it does so well on Glassdoor is that the company has a \"Glassdoor strategy\" and actually sells this as a service to clients, too. Totally fake. Advice to Management Time for RE to move on.", "rating": 1, "pros": "Great client roster. Edelman works with a number of really interesting companies (though the work itself is not always very interesting).", "cons": "Overall, did not find most employees to be intelligent or capable of critical thinking. There are very few new ideas -- we used to joke internally that we would just change the cover of a proposal without bringing in new ideas or fresh thinking. By the time I left, I was shocked that the agency managed to hang onto clients at all, so my best guess is that the bar is just lower in PR & comms. The place also has serious culture and values issues. I think the only reason it does so well on Glassdoor is that the company has a \"Glassdoor strategy\" and actually sells this as a service to clients, too. Totally fake.", "advice": "Time for RE to move on."}, {"title": "The good and bad", "text": "Pros Good people work there, get the future of PR and where it's heading. Each office has it's own culture, very different. Cons Poor work, life balance. Could have better commuting benefits. Need better communication between upper management and staff. Overall culture needs to improve in certain offices. Advice to Management Listen more to your employees, don't just pretend to do so.", "rating": 3, "pros": "Good people work there, get the future of PR and where it's heading. Each office has it's own culture, very different.", "cons": "Poor work, life balance. Could have better commuting benefits. Need better communication between upper management and staff. Overall culture needs to improve in certain offices.", "advice": "Listen more to your employees, don't just pretend to do so."}, {"title": "Great Experience", "text": "Pros Perfect job for anyone looking to gain experience in the public relations field, especially fresh out of college. Learn how to combine your knowledge of writing and communications with effective use of data and market analytics to become a skilled employee. Work on high profile clients and really interesting projects. Cons Sometimes the work can be hard-driven, but this is also a positive in quickly developing your skills and experiences in the field. Advice to Management Only that sometimes work can be a bit hectic and busy and then quiet, so perhaps try to balance out scheduling of assignments so that the work is more constant as opposed to slow and then extremely busy. But of course, sometimes that is just the nature of the work. That said the majority of the time is \"good\" busy, and I much prefer being busy doing interesting and challenging work to having nothing to do. Overall I would give Edelman Berland a solid A.", "rating": 5, "pros": "Perfect job for anyone looking to gain experience in the public relations field, especially fresh out of college. Learn how to combine your knowledge of writing and communications with effective use of data and market analytics to become a skilled employee. Work on high profile clients and really interesting projects.", "cons": "Sometimes the work can be hard-driven, but this is also a positive in quickly developing your skills and experiences in the field.", "advice": "Only that sometimes work can be a bit hectic and busy and then quiet, so perhaps try to balance out scheduling of assignments so that the work is more constant as opposed to slow and then extremely busy. But of course, sometimes that is just the nature of the work. That said the majority of the time is \"good\" busy, and I much prefer being busy doing interesting and challenging work to having nothing to do. Overall I would give Edelman Berland a solid A."}, {"title": "Senior Analyst", "text": "Pros Good network within Exelman. Very good Fortune 500 clients and skotbifcexoosure given the fact that the senior leadership (CEO) doesn't really understand the fundamentals of research They are trying g to position themselves as a research company with little or no understanding of research. Cons The worst management n history. I mean the history of the world here. CEO is as dumb as a box of nails but the box of nails has a better \"sales IQ\". Advice to Management Quit. Please", "rating": 1, "pros": "Good network within Exelman. Very good Fortune 500 clients and skotbifcexoosure given the fact that the senior leadership (CEO) doesn't really understand the fundamentals of research They are trying g to position themselves as a research company with little or no understanding of research.", "cons": "The worst management n history. I mean the history of the world here. CEO is as dumb as a box of nails but the box of nails has a better \"sales IQ\".", "advice": "Quit. Please"}, {"title": "Great first job", "text": "Pros Strong network, a lot of learning opportunities Cons Low competitive salary rate overall", "rating": 5, "pros": "Strong network, a lot of learning opportunities", "cons": "Low competitive salary rate overall", "advice": null}, {"title": "Managing Director", "text": "Pros Great company culture, good work-life balance and ample opportunity to grow and develop relationships with global clients and colleagues. Highly recommend to seasoned professionals or millennials starting out. Cons US-centric focus makes it difficult for international operations to be prioritized in terms of resource allocation and local know how development. Asian and Latam regions surge and drop depending on HQ's perspective on US revenue opportunities. Advice to Management Diversify by gender and international backgrounds.", "rating": 5, "pros": "Great company culture, good work-life balance and ample opportunity to grow and develop relationships with global clients and colleagues. Highly recommend to seasoned professionals or millennials starting out.", "cons": "US-centric focus makes it difficult for international operations to be prioritized in terms of resource allocation and local know how development. Asian and Latam regions surge and drop depending on HQ's perspective on US revenue opportunities.", "advice": "Diversify by gender and international backgrounds."}, {"title": "Executive Vice President", "text": "Pros Fabulous international client base. Great advancement opportunities. Terrific working environment and excellent benefits. Strong internal education program. Flexibility to work globally. Cons Exceptionally long hours are pretty standard.", "rating": 5, "pros": "Fabulous international client base. Great advancement opportunities. Terrific working environment and excellent benefits. Strong internal education program. Flexibility to work globally.", "cons": "Exceptionally long hours are pretty standard.", "advice": null}, {"title": "Worst place I've ever worked.", "text": "Pros The pay, the name. That's it. Cons Terrible work/life balance, dishonest management and very sexist. Advice to Management Gives advice about authenticity to clients, but internal culture is very inauthentic and hypocritical.", "rating": 1, "pros": "The pay, the name. That's it.", "cons": "Terrible work/life balance, dishonest management and very sexist.", "advice": "Gives advice about authenticity to clients, but internal culture is very inauthentic and hypocritical."}, {"title": "Summer Intern", "text": "Pros Big name clients, professional development lunch & learns, and Edelman University. Cons Terrible elitest attitudes in senior staff, low managerial support, junior staff in competition with interns. Junior staff will throw you under the bus to save themselves. Tedious work. Advice to Management Practice an open door, transparent policy and recognize and acknowledge interns are looking for full time employment.", "rating": 3, "pros": "Big name clients, professional development lunch & learns, and Edelman University.", "cons": "Terrible elitest attitudes in senior staff, low managerial support, junior staff in competition with interns. Junior staff will throw you under the bus to save themselves. Tedious work.", "advice": "Practice an open door, transparent policy and recognize and acknowledge interns are looking for full time employment."}, {"title": "Smart Folks", "text": "Pros There is a great team in place and surrounded by smart, roll up your sleeves individuals. A very positive attitude. Cons Many great out of the box ideas are brought up but we were not able to execute on those. Limitations were set because of resources and also due to limited capacity of the engineers. Advice to Management Go with your gut and push the envelope. There is tremendous opportunity to grow the business and don't shut the door on something that could be difficult.", "rating": 3, "pros": "There is a great team in place and surrounded by smart, roll up your sleeves individuals. A very positive attitude.", "cons": "Many great out of the box ideas are brought up but we were not able to execute on those. Limitations were set because of resources and also due to limited capacity of the engineers.", "advice": "Go with your gut and push the envelope. There is tremendous opportunity to grow the business and don't shut the door on something that could be difficult."}, {"title": "Edelman, and yet it is not Edelman, and is sometimes confusing for that reason", "text": "Pros Top clients, some staffers are smart, opportunity to learn if you want it. Cons Work is somewhat disconnected from the main company and in the case of clients, from the client bottom line concerns. Advice to Management Reorganize and build a more cohesive structure. Communicate more with the rank and file.", "rating": 3, "pros": "Top clients, some staffers are smart, opportunity to learn if you want it.", "cons": "Work is somewhat disconnected from the main company and in the case of clients, from the client bottom line concerns.", "advice": "Reorganize and build a more cohesive structure. Communicate more with the rank and file."}, {"title": "Mixed bag...", "text": "Pros Big brands, name recognition, solid benefits. Generally speaking, you'll work with people who really know what they are doing. Cons When I left, I realized just how mediocre of a place Edelman is. Offices battle with each other over clients and revenue. The various office do little to no sharing of information, skills and resources because of this. Edelman is also a highly matrixed organization, with lots of vertical specialists, but these people infrequently are asked to step out of their comfort zones and try something new. As an organization, Edelman's primary focus is revenue and profit, not client and employee satisfaction or the work. Management frequently promises work to clients that cannot be delivered. Compensation is well below industry standards. Advice to Management Truly have one P&L and incentivize teams to find the best talent in the network for their clients not the closest talent in the office. Increase compensation. Senior management are operators, not visionaries. Edelman needs visionaries or it will fall behind places like Golin, FH or some of the ad shops creeping into the space. And Digital, while is may be making money for the firm, is a complete joke of a discipline at Edelman.", "rating": 3, "pros": "Big brands, name recognition, solid benefits. Generally speaking, you'll work with people who really know what they are doing.", "cons": "When I left, I realized just how mediocre of a place Edelman is. Offices battle with each other over clients and revenue. The various office do little to no sharing of information, skills and resources because of this. Edelman is also a highly matrixed organization, with lots of vertical specialists, but these people infrequently are asked to step out of their comfort zones and try something new. As an organization, Edelman's primary focus is revenue and profit, not client and employee satisfaction or the work. Management frequently promises work to clients that cannot be delivered. Compensation is well below industry standards.", "advice": "Truly have one P&L and incentivize teams to find the best talent in the network for their clients not the closest talent in the office. Increase compensation. Senior management are operators, not visionaries. Edelman needs visionaries or it will fall behind places like Golin, FH or some of the ad shops creeping into the space. And Digital, while is may be making money for the firm, is a complete joke of a discipline at Edelman."}, {"title": "Learned a lot, but had to sacrifice my personal life, well-being and emotional stability for the experience", "text": "Pros Gained double the experience in half the time (since I worked the hourly equivalent of two jobs!), had the opportunity to represent high-profile clients I wouldn't have gotten to represent elsewhere, was able to utilize the vast resources of a global company, and realized how strong and resilient I really am to be able to survive under immense pressure and stress. Oh, and free soda, coffee and frequently catered meals so that you rarely feel a need to leave the office or stop working -- even for a moment! Cons It took me awhile, but I finally figured out how to erase the fake, positive review that company HR had me put up during my tenure so that I could replace it with my actual experience. I had no doubt when I started that the environment would be fast-paced and competitive. I was prepared to work hard, and in fact did so well that my first two years that I was consistently praised, given spot bonuses and thought of as a rising star taking the place by storm. I landed new business, mentored peers and was put on the most aggressive, high-profile accounts. However there is \"an Edelman way\", and once you stray from that, even in thought, you're done. There is a systematic and calculated approach to getting you out -- to either make you feel so low and doubt yourself that you quit out of sheer frustration, or to endlessly criticize things that had never been a problem before so they can make the case for firing you. How does one stray from the Edelman way? Start working less than 75 hours a week. Express a conflict of interest with an account. Show interest in starting a family of your own. Talk to your manager about transferring to another office. Become disliked by one of the cliquish, soulless people who has worked there for many years and whose opinion holds way too much power. You can still be doing a great job, but do ANYTHING that illustrates you no longer conform 100% to the Edelman mold and you are toast. Group think is everything, and once you stray, you're the odd man out. I didn't anticipate the extent to which managers and senior staff will go to manipulate you, put you down and make you feel absolutely crazy. Girls crying in the bathroom or at their desks, people dismissed or quitting, suddenly gone with no explanation, the forced happy hours to mimic a positive work culture instead of actually creating one, threats, judgment and so much more. I lost sleep over this job. I could never work enough. I was told that I was on track to be promoted at any moment. But every time a review came around, there was always a reason why I wasn't ready. That's the part that makes you feel crazy -- the positive reinforcement to build you up and dangle the golden carrot of a raise and title change in front of you every month on end, only to be told at the pivotal moment that you did not measure up against some new criteria you never knew existed. The only way to succeed is to give everything to this job: your time, your talent, your creativity, your personal life, your family dinners, your plans to have children, your friendships, your health. Give it everything you've got and you'll still will have work to do. The people who succeed there are not people to admire; not people who make you say \"wow they've got it together. Look at how great they are. I want to be just like them!\" These are people who cut others down for their own personal gain, people who tell you you're doing a great job to your face, then go to your manager to complain about you, people who binge drink at every party and every weekend because they have no other coping skills, people who sit at their desks and literally eat their hair or bite their nails until they bleed because their anxiety is at that level, people who rarely eat a meal and survive on the receptionist's candy dish because God forbid they take a lunch. A successful Edelemployee is a sad, sad person. Not someone you want to be. In order to be successful at this place, you will eventually compromise all the qualities you value about yourself and become a person you don't even recognize. Just look at the people who have been there 8 years, 10 years or longer (if they exist) -- they are some of the meanest people you'll ever meet. Unless you're a client, and then they're so very, very nice. Advice to Management You won't listen, so why bother?", "rating": 3, "pros": "Gained double the experience in half the time (since I worked the hourly equivalent of two jobs!), had the opportunity to represent high-profile clients I wouldn't have gotten to represent elsewhere, was able to utilize the vast resources of a global company, and realized how strong and resilient I really am to be able to survive under immense pressure and stress. Oh, and free soda, coffee and frequently catered meals so that you rarely feel a need to leave the office or stop working -- even for a moment!", "cons": "It took me awhile, but I finally figured out how to erase the fake, positive review that company HR had me put up during my tenure so that I could replace it with my actual experience. I had no doubt when I started that the environment would be fast-paced and competitive. I was prepared to work hard, and in fact did so well that my first two years that I was consistently praised, given spot bonuses and thought of as a rising star taking the place by storm. I landed new business, mentored peers and was put on the most aggressive, high-profile accounts. However there is \"an Edelman way\", and once you stray from that, even in thought, you're done. There is a systematic and calculated approach to getting you out -- to either make you feel so low and doubt yourself that you quit out of sheer frustration, or to endlessly criticize things that had never been a problem before so they can make the case for firing you. How does one stray from the Edelman way? Start working less than 75 hours a week. Express a conflict of interest with an account. Show interest in starting a family of your own. Talk to your manager about transferring to another office. Become disliked by one of the cliquish, soulless people who has worked there for many years and whose opinion holds way too much power. You can still be doing a great job, but do ANYTHING that illustrates you no longer conform 100% to the Edelman mold and you are toast. Group think is everything, and once you stray, you're the odd man out. I didn't anticipate the extent to which managers and senior staff will go to manipulate you, put you down and make you feel absolutely crazy. Girls crying in the bathroom or at their desks, people dismissed or quitting, suddenly gone with no explanation, the forced happy hours to mimic a positive work culture instead of actually creating one, threats, judgment and so much more. I lost sleep over this job. I could never work enough. I was told that I was on track to be promoted at any moment. But every time a review came around, there was always a reason why I wasn't ready. That's the part that makes you feel crazy -- the positive reinforcement to build you up and dangle the golden carrot of a raise and title change in front of you every month on end, only to be told at the pivotal moment that you did not measure up against some new criteria you never knew existed. The only way to succeed is to give everything to this job: your time, your talent, your creativity, your personal life, your family dinners, your plans to have children, your friendships, your health. Give it everything you've got and you'll still will have work to do. The people who succeed there are not people to admire; not people who make you say \"wow they've got it together. Look at how great they are. I want to be just like them!\" These are people who cut others down for their own personal gain, people who tell you you're doing a great job to your face, then go to your manager to complain about you, people who binge drink at every party and every weekend because they have no other coping skills, people who sit at their desks and literally eat their hair or bite their nails until they bleed because their anxiety is at that level, people who rarely eat a meal and survive on the receptionist's candy dish because God forbid they take a lunch. A successful Edelemployee is a sad, sad person. Not someone you want to be. In order to be successful at this place, you will eventually compromise all the qualities you value about yourself and become a person you don't even recognize. Just look at the people who have been there 8 years, 10 years or longer (if they exist) -- they are some of the meanest people you'll ever meet. Unless you're a client, and then they're so very, very nice.", "advice": "You won't listen, so why bother?"}, {"title": "Bureaucracy Personified", "text": "Pros I worked in the digital group so this is true of my experience there, but I know the situation is much better in other groups, particularly C&PA, Consumer, Matter, Ruth, etc. - Easy work - Great people Cons - Mediocre pay - Easy work - Status quo = good enough - Incompetent leadership - Zero recognition for young talent (AS and below) - Sloooooowwwwwwwwww", "rating": 3, "pros": "I worked in the digital group so this is true of my experience there, but I know the situation is much better in other groups, particularly C&PA, Consumer, Matter, Ruth, etc.", "cons": "- Mediocre pay", "advice": null}, {"title": "Edelman", "text": "Pros Great culture and work life balance Cons Salaries are lower than industry standard", "rating": 5, "pros": "Great culture and work life balance", "cons": "Salaries are lower than industry standard", "advice": null}, {"title": "Executive Assistant", "text": "Pros Large international company Possible international work experience but not for all and esp. not for my position - although my direct superiors traveled often. Working with brilliant people. Cons Dealing with egos. No work life balance. Typical corporate job. Advice to Management Invest in your talent regardless of their position/title. If it is a small department, make it more personal so everyone can work together instead of push things to others. BE ACCESSIBLE.", "rating": 3, "pros": "Large international company", "cons": "Dealing with egos.", "advice": "Invest in your talent regardless of their position/title. If it is a small department, make it more personal so everyone can work together instead of push things to others. BE ACCESSIBLE."}, {"title": "Assistant Account Executive", "text": "Pros Professional Growth and opportunities, company culture, great clients, and professionally challenging Cons no cons, love working here", "rating": 5, "pros": "Professional Growth and opportunities, company culture, great clients, and professionally challenging", "cons": "no cons, love working here", "advice": null}, {"title": "Toxic culture", "text": "Pros EB's affiliation with Edelman, which is well-respected and has a great client roster. However, the culture within Edelman Berland is so toxic that it outweighs these benefits. If you're serious about a career in market research, working for EB would actually hurt your future career prospects. If you know you want to work in public relations, pursue work with Edelman directly. Cons This used to be a great company, but two CEO changes, first in 2011, then again in 2012, completely overhauled the company's philosophy, business model, operations, clientele, and culture. Change in inevitable with any leadership turnover, but nearly every change implemented in the last 3 years has been to the organization's detriment. Company leaders encourage pettiness, gossip, and passive-aggressive behaviors. The culture is absolutely toxic. Most of the talented employees were either pushed out, or treated so terribly they left on their own within 2 years. The CEO is not a leader, he's a dictator and a jerk. Advice to Management Shut it down and start over.", "rating": 1, "pros": "EB's affiliation with Edelman, which is well-respected and has a great client roster. However, the culture within Edelman Berland is so toxic that it outweighs these benefits. If you're serious about a career in market research, working for EB would actually hurt your future career prospects. If you know you want to work in public relations, pursue work with Edelman directly.", "cons": "This used to be a great company, but two CEO changes, first in 2011, then again in 2012, completely overhauled the company's philosophy, business model, operations, clientele, and culture. Change in inevitable with any leadership turnover, but nearly every change implemented in the last 3 years has been to the organization's detriment. Company leaders encourage pettiness, gossip, and passive-aggressive behaviors. The culture is absolutely toxic. Most of the talented employees were either pushed out, or treated so terribly they left on their own within 2 years. The CEO is not a leader, he's a dictator and a jerk.", "advice": "Shut it down and start over."}, {"title": "Edelman Berland Chicago Office", "text": "Pros Work on good clients Some Good coworkers but the it does not seem like they will stay long Some travel involved Lots of young professionals Opportunities to switch to other PR teams Cons Chicago office is out of sorts - poor management 22-year olds in the New York City Office were given too many responsibilities Lots of nepotism Disconnected from management Advice to Management Come up with a unified message and present that to research offices. Focus on growing and keeping talent so there will be less turnover.", "rating": 3, "pros": "Work on good clients", "cons": "Chicago office is out of sorts - poor management", "advice": "Come up with a unified message and present that to research offices. Focus on growing and keeping talent so there will be less turnover."}, {"title": "Relationship-based sweat shop with few good people", "text": "Pros Excellent company to have on your resume, and great exposure to a variety of industries and assignments. The company offers a fun culture, when you can take advantage of it and if it isn't looked down upon by management. You will meet some truly great people and many horrible people. The agency also offers some great training opportunities, if you can get away from work to actually attend. Having this name on your resume will carry you far in your career. Cons Edelman Chicago is truly a sweatshop where you kiss work-life balance away and have to navigate politics and favoritism on a daily basis with a smile on your face while constantly watching your back. It is truly a relationship-based company in the worst way possible. You have to make sure the “in-crowd” likes you and that you don’t ever disagree or upset them otherwise your life will be hell. Many of the in-crowd are the lifers and the “yes people” who fit the mold and have sold their life to Edelman. Performance reviews are a joke since both goals and reviews are so subjective. Each manager sets up their employee’s goals so there isn’t any consistency across teams, much less the agency. Your manager gets to decide whom to get feedback from for your evaluation and what feedback to actually include. It is important to note that many other agencies pay a lot more than Edelman. Turnover is ridiculous with handfuls of people leaving the agency each week. HR and senior leadership are fully aware of Edelman’s reputation in the industry as a sweatshop filled with politics but won’t do anything to change it. The agency is AMAZING at talking the talk but won’t actually walk the walk. They know they can continue to operate the revolving door of employees due to the Edelman name. My advice: Come to Edelman for the brand name on your resume, experience and network you will gain. Know you will be required to make Edelman your first and only priority and will have to smile each day as you work the favoritism/political game that will surely burn you out in addition to the many, many late nights and weekends. Most people don’t make it past two years. Advice to Management It is as simple as actually walking the walk, eliminating the favoritism culture, and truly treating your employees as people and not just replaceable robots.", "rating": 1, "pros": "Excellent company to have on your resume, and great exposure to a variety of industries and assignments. The company offers a fun culture, when you can take advantage of it and if it isn't looked down upon by management. You will meet some truly great people and many horrible people. The agency also offers some great training opportunities, if you can get away from work to actually attend. Having this name on your resume will carry you far in your career.", "cons": "Edelman Chicago is truly a sweatshop where you kiss work-life balance away and have to navigate politics and favoritism on a daily basis with a smile on your face while constantly watching your back. It is truly a relationship-based company in the worst way possible. You have to make sure the “in-crowd” likes you and that you don’t ever disagree or upset them otherwise your life will be hell. Many of the in-crowd are the lifers and the “yes people” who fit the mold and have sold their life to Edelman.", "advice": "It is as simple as actually walking the walk, eliminating the favoritism culture, and truly treating your employees as people and not just replaceable robots."}, {"title": "Not for a techie", "text": "Pros Large company with good benefits. Re-reimbursement is swift. Although not in my personal career the ability move around to any of it's many offices around the world; change roles is both possible and encourage. Cons While Edelman brand is large each office in many respects acts as it's own independent company. Synergy across offices is weak and not well managed. Being on the production side of Edelman leaves much to be desired. Lack of strategic planning and well thought-out deliverables can leave you somewhat apathetic towards the purpose of the work you've been tasked to do. Technical expertise seems undervalued.", "rating": 3, "pros": "Large company with good benefits. Re-reimbursement is swift. Although not in my personal career the ability move around to any of it's many offices around the world; change roles is both possible and encourage.", "cons": "While Edelman brand is large each office in many respects acts as it's own independent company. Synergy across offices is weak and not well managed. Being on the production side of Edelman leaves much to be desired. Lack of strategic planning and well thought-out deliverables can leave you somewhat apathetic towards the purpose of the work you've been tasked to do. Technical expertise seems undervalued.", "advice": null}, {"title": "Assistant Account Executive", "text": "Pros They have some great clients, and there are some good people there too - if you're lucky to get on a team with them. Edelman is comparable to other large agencies in the area. Cons Company politics run the agency. HR/senior leaders treat their employees as replaceable, and they're not afraid to admit it. In fact, the first thing my manager said to me was \"no one here cares about your career except yourself\" - if you want to make it here, you have to be cutthroat and willing to throw people under the bus, otherwise you will be the one thrown under the bus, and you won't grow. Edelman also thinks it's enough to pay you with \"you're working for the top agency, so we don't have to pay as much!\" There are PLENTY of better agencies in the area, Edelman! Advice to Management Leave. Many of you have been there too long anyway and don't understand what the world is like outside of Edelman.", "rating": 1, "pros": "They have some great clients, and there are some good people there too - if you're lucky to get on a team with them. Edelman is comparable to other large agencies in the area.", "cons": "Company politics run the agency. HR/senior leaders treat their employees as replaceable, and they're not afraid to admit it. In fact, the first thing my manager said to me was \"no one here cares about your career except yourself\" - if you want to make it here, you have to be cutthroat and willing to throw people under the bus, otherwise you will be the one thrown under the bus, and you won't grow. Edelman also thinks it's enough to pay you with \"you're working for the top agency, so we don't have to pay as much!\" There are PLENTY of better agencies in the area, Edelman!", "advice": "Leave. Many of you have been there too long anyway and don't understand what the world is like outside of Edelman."}, {"title": "Great clients, Bad morale", "text": "Pros The clients are a great asset and look good when selling yourself to other jobs. And since theirs are pretty big, it means bigger budgets, and often times more fun projects. Cons The company seems to succumb every last waking need of the client instead of the internal workforce. The contract & business is what keeps the work going not the teams or the morale. Advice to Management Put the integrity of the work before the contract/client. Just filling the need with no purpose of wholesome outlook kills the appeal.", "rating": 3, "pros": "The clients are a great asset and look good when selling yourself to other jobs. And since theirs are pretty big, it means bigger budgets, and often times more fun projects.", "cons": "The company seems to succumb every last waking need of the client instead of the internal workforce. The contract & business is what keeps the work going not the teams or the morale.", "advice": "Put the integrity of the work before the contract/client. Just filling the need with no purpose of wholesome outlook kills the appeal."}, {"title": "Great agency!", "text": "Pros Edelman is one of the few big agencies that truly cares about work/life balance and growing its people. The management is strong and creative, strategic thinking is rewarded. I have worked at other agencies big and small and Edelman has been the best at encouraging folks to carve out their own career path and then giving them the resources to accomplish it. Cons Any agency environment is going to have an intense work culture and at times Edelman is no different. Also, there can be a lot of politics internally - you'll often hear about how you have to \"sell in\" ideas internally before you can even bring them to clients. Advice to Management Don't let too many senior folks get in the way of good ideas.", "rating": 5, "pros": "Edelman is one of the few big agencies that truly cares about work/life balance and growing its people. The management is strong and creative, strategic thinking is rewarded. I have worked at other agencies big and small and Edelman has been the best at encouraging folks to carve out their own career path and then giving them the resources to accomplish it.", "cons": "Any agency environment is going to have an intense work culture and at times Edelman is no different. Also, there can be a lot of politics internally - you'll often hear about how you have to \"sell in\" ideas internally before you can even bring them to clients.", "advice": "Don't let too many senior folks get in the way of good ideas."}, {"title": "Great opportunities", "text": "Pros Best clients, big thinkers, global network, great colleagues, supportive environment. A great employer. Cons Especially at the lower levels team members are over loaded with work, with very high expectations and long hours. Some entrenched senior leaders are not as valuable as they think they are. Advice to Management Consistently evaluate senior leaders on more than just the revenue they bring in, but on a more well-rounded skill set inclusive of coaching, mentoring and relationship-building internally and externally. These are the things that make good revenue generators into great leaders.", "rating": 5, "pros": "Best clients, big thinkers, global network, great colleagues, supportive environment. A great employer.", "cons": "Especially at the lower levels team members are over loaded with work, with very high expectations and long hours. Some entrenched senior leaders are not as valuable as they think they are.", "advice": "Consistently evaluate senior leaders on more than just the revenue they bring in, but on a more well-rounded skill set inclusive of coaching, mentoring and relationship-building internally and externally. These are the things that make good revenue generators into great leaders."}, {"title": "Great Company", "text": "Pros Great place to work with smart thinking people Cons Sometimes change takes longer than desired. Advice to Management Continue to seek smart individuals and challenge employees", "rating": 5, "pros": "Great place to work with smart thinking people", "cons": "Sometimes change takes longer than desired.", "advice": "Continue to seek smart individuals and challenge employees"}, {"title": "The Best", "text": "Pros The biggest clients, the best resources. A team environment. Cons You have to really love PR or you will simply fail here. Everyone is a champion. Highly competitive work place.", "rating": 5, "pros": "The biggest clients, the best resources. A team environment.", "cons": "You have to really love PR or you will simply fail here. Everyone is a champion. Highly competitive work place.", "advice": null}, {"title": "Has potential, but is too toxic and disorganized to be a long-term career choice", "text": "Pros The connection to Edelman is likely the best thing this company has going for it. THere's no real need to sell their services outside of the agency and there's always work to be done. Through strategic agency partnerships, there will likely be more work than Berland can keep up with. For the most part, the junior staff (includes entry level through VP level) and middle management are fantastic and have the potential to be even greater with the right training and leadership. Cons Where do I even begin? This company is toxic, starting at the very top. The senior leadership team is highly intelligent and have promising vision, but no one is capable of executing that vision and they're extremely manipultive. They have no respect for one another and that trickles down through the ranks. Their behavior and the way people talk to one another within the company is ridiculous and NO ONE should ever have to deal with that. Agency mean girls = school yard bullies. Another huge problem is that they have no corporate structure - I mean they don't even have job descriptions. Without those, no one has a consistent idea of what they should be doing and what their manager expects of them, so it's a royal cluster of people trying but failing because they don't have the information or resources they need to succeed. The company keeps saying they're going to train the staff, but we've been waiting the better part of a year and have no idea when that training is going to come. The work/life balance is non-existent. Both Edelman and Edelman Berland operate in a very knee-jerk, reactionary manner, meaning there's a crisis happening every day (maybe every hour) and people are swirling around and around without being productive. Also, it's an intensely meeting-oriented culture, meaning that the real work doesn't really start until 5pm because you've spent all day in meetings. It's high stress, long hours all the time, and PTO is difficult to actually take - meaning instant-burnout. Advice to Management This is actually advice for Edelman management. Clean house at Berland, starting at the very top. Turn this company into an Edelman cost center and hire some actual researchers to run the place. Maybe, just maybe, that will make it work.", "rating": 1, "pros": "The connection to Edelman is likely the best thing this company has going for it. THere's no real need to sell their services outside of the agency and there's always work to be done. Through strategic agency partnerships, there will likely be more work than Berland can keep up with.", "cons": "Where do I even begin?", "advice": "This is actually advice for Edelman management. Clean house at Berland, starting at the very top. Turn this company into an Edelman cost center and hire some actual researchers to run the place. Maybe, just maybe, that will make it work."}, {"title": "Technical Project Manager", "text": "Pros People and the overall culture is great! Cons Work-life balance can be tough given the team you're on.", "rating": 5, "pros": "People and the overall culture is great!", "cons": "Work-life balance can be tough given the team you're on.", "advice": null}, {"title": "Pretending, not doing", "text": "Pros Competitive pay and holidays (not that you get to enjoy them) Cons At it's core, Edelman is a company about servicing their client's wants, not needs. Because those in most high-ranking positions derive from accounts roles - elsewhere or or internally - this position makes sense, and it certainly contributes to the company's high scores in client satisfaction and growth. But this is also why the agency will never rise above the precept that it is nothing more than a PR Firm, which in fact it is. They made the AdAge A-List in 2011 (which isn't the best barometer anyway) but I wouldn't expect to see them there again any time soon. Advice to Management For all the talk, recognize that if you expect your employees to be good at all things, they will never become exceptional at one thing.", "rating": 1, "pros": "Competitive pay and holidays (not that you get to enjoy them)", "cons": "At it's core, Edelman is a company about servicing their client's wants, not needs. Because those in most high-ranking positions derive from accounts roles - elsewhere or or internally - this position makes sense, and it certainly contributes to the company's high scores in client satisfaction and growth. But this is also why the agency will never rise above the precept that it is nothing more than a PR Firm, which in fact it is. They made the AdAge A-List in 2011 (which isn't the best barometer anyway) but I wouldn't expect to see them there again any time soon.", "advice": "For all the talk, recognize that if you expect your employees to be good at all things, they will never become exceptional at one thing."}, {"title": "Jr. Analyst", "text": "Pros great people, great office view Cons junior staff don't get recognized for their work and compensation is low Advice to Management recognize work of junior staff", "rating": 3, "pros": "great people, great office view", "cons": "junior staff don't get recognized for their work and compensation is low", "advice": "recognize work of junior staff"}]