[{"title": "SEPHORA good or bad", "text": "Pros Treat u like family Cons Always expect more from you and hardly accept your days off that you ask For in advance Advice to Management If you have given the option of a day off then follow it too", "rating": 5, "pros": "Treat u like family", "cons": "Always expect more from you and hardly accept your days off that you ask", "advice": "If you have given the option of a day off then follow it too"}, {"title": "Great Place to work", "text": "Pros Large salaries and collaborative; Teamwork setting Cons None that I can think of right now Advice to Management Keep doing it", "rating": 5, "pros": "Large salaries and collaborative; Teamwork setting", "cons": "None that I can think of right now", "advice": "Keep doing it"}, {"title": "Customer Service", "text": "Pros Very respectful staff and owner towards me personally. Cons Pay wasn't much but it was for a job passing out surveys on the Light rail. Cold time of year to do the work. Advice to Management Strategize the expectations to make employee doing the work accountable.", "rating": 5, "pros": "Very respectful staff and owner towards me personally.", "cons": "Pay wasn't much but it was for a job passing out surveys on the Light rail. Cold time of year to do the work.", "advice": "Strategize the expectations to make employee doing the work accountable."}, {"title": "nothing special", "text": "Pros good cash commission and friendly people Cons no real scope for promotion", "rating": 3, "pros": "good cash commission and friendly people", "cons": "no real scope for promotion", "advice": null}, {"title": "Bad company", "text": "Pros The only pro I can is it is a good opertunity if it was run by some one else Cons What a bad company u have to pay for your hotels when then send u away they say no seniority and your self employed but yet you can get sacked and your takes money out of your pay Advice to Management Get better fast or u will lose everything", "rating": 1, "pros": "The only pro I can is it is a good opertunity if it was run by some one else", "cons": "What a bad company u have to pay for your hotels when then send u away they say no seniority and your self employed but yet you can get sacked and your takes money out of your pay", "advice": "Get better fast or u will lose everything"}, {"title": "Sales Engineer", "text": "Pros Team spirit. The honesty and integrity of the employees and owners Cons There is a lot to be done. Advice to Management Hire", "rating": 5, "pros": "Team spirit.", "cons": "There is a lot to be done.", "advice": "Hire"}, {"title": "Customer Advisor, EE", "text": "Pros The money paid was reasonable, however not enough to compensate for the amount of work. Management was poor, expected to do a lot of extra unpaid work. Cons Too much expectation. Company culture is very confusing. Not a good brand. Deal with a lot of issues that could be easily avoided if company learns to do things properly. Advice to Management I would not advise taking up a management position, especially if it involves working in store.", "rating": 1, "pros": "The money paid was reasonable, however not enough to compensate for the amount of work. Management was poor, expected to do a lot of extra unpaid work.", "cons": "Too much expectation. Company culture is very confusing. Not a good brand. Deal with a lot of issues that could be easily avoided if company learns to do things properly.", "advice": "I would not advise taking up a management position, especially if it involves working in store."}, {"title": "Used to a lovely job", "text": "Pros Nice colleagues at sales level Cons management make mistakes sales targets are increasing monthly customers are leaving rather than joining Expected to sell a contract & home broadband plus insurance to EVERY SINGLE customer underhand tactics misselling Advice to Management Open your eyes to the state of the company. Most people come in to complain and therefore do not want to buy anything.", "rating": 3, "pros": "Nice colleagues at sales level", "cons": "management make mistakes", "advice": "Open your eyes to the state of the company. Most people come in to complain and therefore do not want to buy anything."}, {"title": "Pretty good company to work for", "text": "Pros I am only 18 and compared to other people may age working in super markets this job is 100x better. Clear and easy paths of ladder progression, great support systems, loads of positive energy and active team work, great management and strong , structural leadership within the company all the way up the board. Cons Targets can be pressuring in smaller store and support isn't always super understanding or progressive. Sometimes feels like your are battling with people in the company who are higher up to make them understand what it is like on the ground floor. For example are prices in store aren't very competitive and can be frustrating to try and vent that. Advice to Management Strong store management generally along with regional support systems. Although HR, etc feel disconnected at times.", "rating": 5, "pros": "I am only 18 and compared to other people may age working in super markets this job is 100x better. Clear and easy paths of ladder progression, great support systems, loads of positive energy and active team work, great management and strong , structural leadership within the company all the way up the board.", "cons": "Targets can be pressuring in smaller store and support isn't always super understanding or progressive. Sometimes feels like your are battling with people in the company who are higher up to make them understand what it is like on the ground floor. For example are prices in store aren't very competitive and can be frustrating to try and vent that.", "advice": "Strong store management generally along with regional support systems. Although HR, etc feel disconnected at times."}, {"title": "EE", "text": "Pros A great company with great people, nice culture. Cons It is getting more and more part of the BT empire and starting to lose some of the identity that makes it such a fun and unique place to work Advice to Management n/a", "rating": 5, "pros": "A great company with great people, nice culture.", "cons": "It is getting more and more part of the BT empire and starting to lose some of the identity that makes it such a fun and unique place to work", "advice": "n/a"}, {"title": "Great place to work", "text": "Pros The people who work here are mostly brilliant and make your work life easy. Cons The politics between higher management for power and entitlement of the call centre is exhausting.", "rating": 5, "pros": "The people who work here are mostly brilliant and make your work life easy.", "cons": "The politics between higher management for power and entitlement of the call centre is exhausting.", "advice": null}, {"title": "Good things come to those who wait and have an enormous amount of luck", "text": "Pros Fantastic salary, everyone is of a similar personality or drive so it's a great environment, the company seems to treat its employees well with quite a few perks too. Cons No real negatives to report!", "rating": 5, "pros": "Fantastic salary, everyone is of a similar personality or drive so it's a great environment, the company seems to treat its employees well with quite a few perks too.", "cons": "No real negatives to report!", "advice": null}, {"title": "A mixed bag", "text": "Pros Cheap broadband, interesting work to a certain extent, colleagues are very good. Cons The merger with t-mobile and then the takeover by BT has left a sour taste to say the least. It's obvious we have become part of a huge company and are now less at the forefront, less involved in the truly interesting work, as BT seek to put their guys in the key roles. I was heavily involved in 4g, whereas the first I heard about a successful 5g POC was in the press. Very poor indeed. Advice to Management Try looking after your minions, if you dare. Stop making excuses and represent the views of your direct reports.", "rating": 3, "pros": "Cheap broadband, interesting work to a certain extent, colleagues are very good.", "cons": "The merger with t-mobile and then the takeover by BT has left a sour taste to say the least. It's obvious we have become part of a huge company and are now less at the forefront, less involved in the truly interesting work, as BT seek to put their guys in the key roles. I was heavily involved in 4g, whereas the first I heard about a successful 5g POC was in the press. Very poor indeed.", "advice": "Try looking after your minions, if you dare. Stop making excuses and represent the views of your direct reports."}, {"title": "EE Employment", "text": "Pros Good career support and overall a good company to work for with an equally good culture. Cons Salary is ok. Could be more on the competitive side. Advice to Management Keep up the good work", "rating": 5, "pros": "Good career support and overall a good company to work for with an equally good culture.", "cons": "Salary is ok. Could be more on the competitive side.", "advice": "Keep up the good work"}, {"title": "Not bad employer at all", "text": "Pros Good management Good earning potential Excellent culture at work Cons Upper management not great at communicating Advice to Management Be more transparent at the upper levels with regards to your plans for the company, rather than baiting and switching on bonus schemes etc", "rating": 5, "pros": "Good management", "cons": "Upper management not great at communicating", "advice": "Be more transparent at the upper levels with regards to your plans for the company, rather than baiting and switching on bonus schemes etc"}, {"title": "Customer Advisor", "text": "Pros Pay. Good team. Met some awesome customers. Overtime always available. Cons Untrained staff. Untrained managers. Booked you in on days you said you can not work. Forced to make sales. Advice to Management Train better and stop being so bipolar.", "rating": 5, "pros": "Pay. Good team. Met some awesome customers. Overtime always available.", "cons": "Untrained staff. Untrained managers. Booked you in on days you said you can not work. Forced to make sales.", "advice": "Train better and stop being so bipolar."}, {"title": "If you have genuine compassion, morals or humanity this is not the company for you", "text": "Pros Reasonable basic salaries for managers Good employee and F&F discounts Some good people in the business The best mobile network, from a customer perspective - I wouldn’t use another Yearly awards and events for teams Good selection of products Good partnership with major manufacturers like Apple Competitively priced HBB packages and good customer service support with this Cons *Exceptionally cliquey at regional level *Favouritism *Treated differently and mocked for being weak if you’re not aggressive - Managers proudly sharing stories of making people cry *Culture of sexism, racism and discrimination noted at store level when I joined, this appeared to be the norm. *Jobs for the Lads - women treated differently and decisions made dependant on who’s friends with the right people *Store Managers and assistant managers contracts state that they are not entitled to overtime or even time in Lieu for any extra hours worked which happens often and is expected *Completely unrealistic targets and commission structure created to reward just a few *All training is around managing performance, not developing people and encouraging them *Hide behind the EE Way which doesn’t play any part in the real service techniques used at store level *Takes an old fashioned aggressive sales approach driven by regional and some store management. Customer service is secondary *Uses archaic management style of pointing the finger and making heads role when things go wrong. When sales are bad, managers manage someone out to save themselves. If like me you refused to take this approach and scapegoat others the pressure on you was unbearable *Encouraged by those in regional leadership roles to fill in needs sheet solutions on a need to know basis - really it felt like Mis-selling to me but they’re clever enough to fill in enough detail to get away with this *It’s all about making money for BT *Appalling attitude and treatment of those with Mental Health issues. Was told by a member of HR during a management training that we should not pay someone who goes off sick while being investigated, even if this investigation is about their performance being affected by their mental health and the investigation itself is causing more stress. This was in a training session with 22 plus people present and when I challenged by saying that’s punishing someone before they’ve even been invited to a disciplinary hearing, the HR representative told me coldly ‘We don’t need to pay anyone for sick if we don’t want to, it’s a benefit we don’t have to’ I could go on and on and share more about my personal experience and the things I witnessed but I’ll leave it at this - overall I can’t express enough how shocked I was by my experience in EE. It felt like working back in the 80’s or 90’s. A truly horrible experience which impacted my health hugely. Despite having no job to go to the sense of relief I had when I gave my notice was like no other and unsurprisingly I wasn’t the only manager in the region that day......In fact it was quickly followed by the notice of senior management too which speaks volumes. Advice to Management Review HR policies Big change needed in team attitudes and focus on customer service Move away from aggressive sales approach and targets - it leads to lying and Mis-selling due to the pressure you put people under Review your regional leadership and store leadership teams thoroughly, I think you’d be shocked to know what really goes on", "rating": 1, "pros": "Reasonable basic salaries for managers", "cons": "*Exceptionally cliquey at regional level", "advice": "Review HR policies"}, {"title": "An HONEST in-depth review!", "text": "Pros The people! Staff are brilliant and tend to enjoy the work environment MOST of the time. Recent pay rise FINALLY means you're getting paid what you would to stack shelves at Tesco. Incentives & prizes are very very good I've won Phones, Smart Home Speaker, £400 of Amazon Vouchers and £200 of Argos. Company phone plan is Amazing 75% staff discount on a handset meant I could get 100gb of data on an iPhone X with an annual upgrade and a series 3 Apple Watch for under £40pm! Progression & development is a Pro & Con (you'll see why..) The above is a pro however your progression is very much down to you and you have to push for it! It's also very VERY BIAS. Company car hire for business trips. Roadshows always good fun. 5 friends & family discounts of 30% off monthly every year! Cons Targets HIGHLY unrealistic (unless you work in one of VERY few high performaning stores then you're likely never going to hit Gold or Platinum banding on commission. (Silver & Bronze hardly worth it unless you're a store manager and even then pathetic!) They also recently changed the commission structure making it harder for you to achieve and even worse that you have to rely on everyone elses performances if the store doesn't hit you're not getting paid! They will string you along with promises of development and progression to retain their best staff despite RARELY being able to fulfill the empty promises. Theres an awful amount of pressure surrounding daily performance if you haven't hit a specific target by 5pm they throw you into a \"focus\" group lol more like pressure group! They don't appreciate over time or extra hours. I worked at 5 stores in just under 3 years all are the same. All high pressure, all ungrateful. Can be very cliquey They take an awful long time to get expenses. Refuse holiday if it's not ideal. Do not care about Christmas the decor is down on Christmas eve and you're back in selling tablets on boxing day because that's more important than spending time with your family at christmas Pos changes!!! OMG every week like the pos team at head office have nothing better to do. Literally.. Company only cares about new connections even more than profit loool. Advice to Management The old commission structure is much fairer but you won't take any notice of that.. So STOP focusing ONLY on acquisition all your care about is New and Broadband yet we are targeted on 4 metrics!! Stop all the uneccasary pos changes. Free up managers time rather than having them fill out ridiculous amounts of administration taking them away from the shop floor and then pressuring them for performance at end of the day.", "rating": 3, "pros": "The people! Staff are brilliant and tend to enjoy the work environment MOST of the time.", "cons": "Targets HIGHLY unrealistic (unless you work in one of VERY few high performaning stores then you're likely never going to hit Gold or Platinum banding on commission. (Silver & Bronze hardly worth it unless you're a store manager and even then pathetic!)", "advice": "The old commission structure is much fairer but you won't take any notice of that.. So STOP focusing ONLY on acquisition all your care about is New and Broadband yet we are targeted on 4 metrics!!"}, {"title": "Great Job Benefits and Perks, challenging target system for sales", "text": "Pros -Great Commission scheme at the time (although it has since been changed so that you must hit 90% across 4 KPIs to see a single penny of your month's commission) - Amazing network discounts, iPhone tariffs included Cons The change in commission structure which made it near impossible to secure a months commission. Advice to Management Listen to retail advisors' feedback", "rating": 5, "pros": "-Great Commission scheme at the time (although it has since been changed so that you must hit 90% across 4 KPIs to see a single penny of your month's commission)", "cons": "The change in commission structure which made it near impossible to secure a months commission.", "advice": "Listen to retail advisors' feedback"}, {"title": "Good experience", "text": "Pros Nice colleagues and working environment. Good level of empowerment. Successful strategy to date. Strong assets. Good company focus on frontline. Cons Decision making process and accountabilities could sometimes be clearer. Risk of gradual increase of bureaucracy with BT takeover. Ability to promote talents to senior positions could be better. Head office staff can sometimes feel a bit neglected/undervalued. Advice to Management It's all about re-inventing EE's success & spirit in the BT environment.", "rating": 5, "pros": "Nice colleagues and working environment. Good level of empowerment. Successful strategy to date. Strong assets. Good company focus on frontline.", "cons": "Decision making process and accountabilities could sometimes be clearer. Risk of gradual increase of bureaucracy with BT takeover. Ability to promote talents to senior positions could be better. Head office staff can sometimes feel a bit neglected/undervalued.", "advice": "It's all about re-inventing EE's success & spirit in the BT environment."}, {"title": "senior sales", "text": "Pros fast paced work met some great people Cons unrealistic targets manager cared more about his targets than anything else work life balance is poor spent too much time after work hours in the store overworked and underpaid didn't get promoted because they couldn't afford to lose someone on the sales side Advice to Management dont treat your best staff poorly and they wont have a reason to leave...", "rating": 3, "pros": "fast paced work", "cons": "unrealistic targets", "advice": "dont treat your best staff poorly and they wont have a reason to leave..."}, {"title": "Too many chiefs", "text": "Pros Good team, colleagues. Fast paced environment Cons Too many initiatives by the company that just got lost along the way, very flavour of the month.", "rating": 5, "pros": "Good team, colleagues. Fast paced environment", "cons": "Too many initiatives by the company that just got lost along the way, very flavour of the month.", "advice": null}, {"title": "3rd in The Sunday Times’ Top 30 Best Big Companies to Work For list.", "text": "Pros 75% discount on your personal EE mobile phone package 30% Friends and Family discount Discounted broadband and EE TV packages. Flexible benefits you can choose from too – from childcare vouchers for working parents, to travel insurance Cons None that I have experienced Advice to Management Great culture, great people", "rating": 5, "pros": "75% discount on your personal EE mobile phone package", "cons": "None that I have experienced", "advice": "Great culture, great people"}, {"title": "network engineer", "text": "Pros Good working environment with friendly people Cons Progression in a technical position in terms of Salary is restricted Advice to Management If you want to keep good technical people, you need to reward them accordingly", "rating": 5, "pros": "Good working environment with friendly people", "cons": "Progression in a technical position in terms of Salary is restricted", "advice": "If you want to keep good technical people, you need to reward them accordingly"}, {"title": "Sales Advisor", "text": "Pros Great incentives, atmosphere and company ethics Cons Could do with providing more career progressions plans for people that do not aspire to manage a retail store i.e. head office roles", "rating": 5, "pros": "Great incentives, atmosphere and company ethics", "cons": "Could do with providing more career progressions plans for people that do not aspire to manage a retail store i.e. head office roles", "advice": null}, {"title": "Toxic Culture Masked as A Genuine Retail Business", "text": "Pros 75% staff discount on a contract. 30% friends and family discount codes up to 5 per year. Rental car if you need to go to training or meetings saves the hammer on your own car. Cons If it wasn't for the reality that EE can cause you serious psychological trauma you would stand back and laugh at the weary, hopeless, dated management culture which exists particularly in the North East. Regional managers are given a rather pumped up view of themselves by the business but then have little to back it up other than so called motivation pulled from the internet as and when required. Be prepared to leave your moral compass at the door despite the facade that they are a reputable BT owned business, questionable selling is positively encouraged and transparency to the customer is ignored. Managers and staff are caught between two extremes, achieve the numbers and run the risk of the customer complaining which leads to serious consequences. Or, sell correctly to customer's needs and under perform which leads to serious consequences. They claim they have customer experience at the heart of what they do but basically want you to hard sell older customers who have been coming into top up their phones for years into taking out a sim only contract. You will be measured on the number of top ups done versus the payg to contract conversions. Simple answer: turn away the top ups. A very successful store in the NE is known for telling customers that they no longer sell top ups but only sell \"monthly direct debit credit for the customer's convenience\". Throw in the ridiculous focus on adding additional sales by selling poor quality tablets and then add the biggest driver of new connections in EE the mifi attachment. Customer walks in to upgrade paying say £40 a month for a 5gb data contract on a phone. Data usage is about 3.5 Gb. Staff are urged to tell the customer they are going through more on their bill but then upgraded on their phone contract to a 300mb or 500mb data allowance but then sold a mifi unit as an additional line with 4gb of data for around £10 per month. So for Region 3's convenience you now have to walk around with a yellow box in your pocket with 6 hours battery life rather than have the correct data usage on your phone. Network isn't what it's made out to be with 4g bandwidth quite obviously restricted and you customers frequently finding themselves shunted onto old 2g if making a call leading to call drop. Offers are poor value, EE rely on the under educated customer who think getting 250mb of data on a sim only for £10.99 is a good deal. Regional commercial managers who are given the job of driving numbers have nothing in the way of coaching or people skills. They are only able to tell you if you have had a bad day when you know it, oh and then tell you to do better, which you also know. Staff have direct access the Regional Commercial Manager so it creates a culture where the store managers are short circuited. Successful customer advisors are treated way better than managers in struggling stores by the senior management. This completely undermines store manager integrity. Avoid for your sanity. Advice to Management Look closely at who you are employing as Regionals, focus on a collaborative leadership culture rather than current bullying culture. Get rid of RCM role and get Regional Mangers to pull their weight. Get your parents or grandparents to go into their local store and ask for a top up voucher, get feedback on their treatment and then have a long hard think.", "rating": 1, "pros": "75% staff discount on a contract. 30% friends and family discount codes up to 5 per year. Rental car if you need to go to training or meetings saves the hammer on your own car.", "cons": "If it wasn't for the reality that EE can cause you serious psychological trauma you would stand back and laugh at the weary, hopeless, dated management culture which exists particularly in the North East.", "advice": "Look closely at who you are employing as Regionals, focus on a collaborative leadership culture rather than current bullying culture. Get rid of RCM role and get Regional Mangers to pull their weight. Get your parents or grandparents to go into their local store and ask for a top up voucher, get feedback on their treatment and then have a long hard think."}, {"title": "Sales Advisor", "text": "Pros great benefits! good working environment Cons very sales orientated and pushy to achieve sales. Advice to Management provide more incentives!", "rating": 5, "pros": "great benefits!", "cons": "very sales orientated and pushy to achieve sales.", "advice": "provide more incentives!"}, {"title": "good", "text": "Pros Good bonus structure and annual salary Cons if your good in sales it is unlikely you will progress", "rating": 5, "pros": "Good bonus structure and annual salary", "cons": "if your good in sales it is unlikely you will progress", "advice": null}, {"title": "Team Performance is key", "text": "Pros COMMISSION IS VERY GOOD IF YOU AND THE STORE PERFORM WELL Cons If you store doesn't do well and you do theres a chance you wont receive any commission for that month at all", "rating": 3, "pros": "COMMISSION IS VERY GOOD IF YOU AND THE STORE PERFORM WELL", "cons": "If you store doesn't do well and you do theres a chance you wont receive any commission for that month at all", "advice": null}, {"title": "Not the best", "text": "Pros The great people in your team, the discounts straight away. Cons Some of the worst managers ever! Don't bother complaining about them as they are untouchable regardless what they do. Everyone has slept with everyone in that place including people in high up positions. Too much pressure to try and sell people additional items even if they are just phoning up for a bill query. Pressure to finish the previous callers notes before the next call comes in and Being told off if you stay in after call work too long. Being swore at and threatened by customers and they won't let you even hang up on them so you have to pretty much take the abuse and be ready for the next call. So many people are signed off for stress. Advice to Management Take a look who you have as managers some were great and some just liked the title, it certainly is if your face fits attitude. Too much pressure for targets that is what mostly causes staff to take months of sick.", "rating": 1, "pros": "The great people in your team, the discounts straight away.", "cons": "Some of the worst managers ever! Don't bother complaining about them as they are untouchable regardless what they do. Everyone has slept with everyone in that place including people in high up positions. Too much pressure to try and sell people additional items even if they are just phoning up for a bill query. Pressure to finish the previous callers notes before the next call comes in and Being told off if you stay in after call work too long. Being swore at and threatened by customers and they won't let you even hang up on them so you have to pretty much take the abuse and be ready for the next call. So many people are signed off for stress.", "advice": "Take a look who you have as managers some were great and some just liked the title, it certainly is if your face fits attitude. Too much pressure for targets that is what mostly causes staff to take months of sick."}, {"title": "Good", "text": "Pros Best company i have ever seen. Cons No cons found yet at all.", "rating": 5, "pros": "Best company i have ever seen.", "cons": "No cons found yet at all.", "advice": null}, {"title": "sales advisor", "text": "Pros Fun and relaxed environment. Commission is good if everybody in the same store overachieves. Cons Difficult to progress and get some very rude and aggressive customers so you need to be a calm character.", "rating": 3, "pros": "Fun and relaxed environment. Commission is good if everybody in the same store overachieves.", "cons": "Difficult to progress and get some very rude and aggressive customers so you need to be a calm character.", "advice": null}, {"title": "Contact centre", "text": "Pros Great place to work Cons BT takeover means change to come Advice to Management Remember staff through integration to BT . bt bought ee for culture and worked hard to be top 3 Sunday times. Don’t let that be forgotten", "rating": 5, "pros": "Great place to work", "cons": "BT takeover means change to come", "advice": "Remember staff through integration to BT . bt bought ee for culture and worked hard to be top 3 Sunday times. Don’t let that be forgotten"}, {"title": "Vile", "text": "Pros Great location. Staff can be friendly. Cons Managers encourage bad practice and have little knowledge of employment law. Lack of clear strategy from Management teams. Poor infrastructure and support for development and design teams. Unusual pay deductions and leave policies. Advice to Management Managers should attend acas workshops and adhere to best practice.", "rating": 1, "pros": "Great location.", "cons": "Managers encourage bad practice and have little knowledge of employment law.", "advice": "Managers should attend acas workshops and adhere to best practice."}, {"title": "senior sales", "text": "Pros greta benefits, meet clients of all sort Cons Can be stressful in terms of targers", "rating": 3, "pros": "greta benefits, meet clients of all sort", "cons": "Can be stressful in terms of targers", "advice": null}, {"title": "Loved it most of the time", "text": "Pros The money was good if you hit your accelerators and your targets. Excellent for looking after you including paid trips to road shows etc. Obviously staff discount was pretty cool. Cons Targets were unreasonable at times and very short staffed. Systems were absolutely shambolic. If you introduce a new system test it first...... Advice to Management Spread the targets more fairly. A store running on two staff most of the week can't hit the same targets as a store running on 6/7 a shift.", "rating": 5, "pros": "The money was good if you hit your accelerators and your targets. Excellent for looking after you including paid trips to road shows etc. Obviously staff discount was pretty cool.", "cons": "Targets were unreasonable at times and very short staffed. Systems were absolutely shambolic. If you introduce a new system test it first......", "advice": "Spread the targets more fairly. A store running on two staff most of the week can't hit the same targets as a store running on 6/7 a shift."}, {"title": "Great place to work", "text": "Pros Very clear career path regardless of there you want to go. Endless opportunities Cons Most of the biggest salary opportunities are based in London. Advice to Management Keep people motivated, see the bigger picture. There is no end goal, only to keep being the best", "rating": 5, "pros": "Very clear career path regardless of there you want to go. Endless opportunities", "cons": "Most of the biggest salary opportunities are based in London.", "advice": "Keep people motivated, see the bigger picture. There is no end goal, only to keep being the best"}, {"title": "Large organisation and safe bet", "text": "Pros An exciting sector with plenty of technological development and change. Being a large organisation, you have time to find your strengths and seek opportunities that best fit you as a person and that contributes to your career aspirations. Good at celebrating success. Cons Large organisation that can sometimes move frightfully slow. Poor at learning from failure Advice to Management Better empowerment and inclusivity that values every employee across the workforce that helps them to be their best and helps people recognise the best in themselves. Maximise peoples exposure to progression.", "rating": 3, "pros": "An exciting sector with plenty of technological development and change.", "cons": "Large organisation that can sometimes move frightfully slow.", "advice": "Better empowerment and inclusivity that values every employee across the workforce that helps them to be their best and helps people recognise the best in themselves. Maximise peoples exposure to progression."}, {"title": "Great place to work", "text": "Pros Benefits, staff, in the top 10 companies to work for. Cons Salaries, recruitment process, systems Advice to Management A fairer recruitment process needs to be adopted as long serving, knowledgable, loyal staff are often lost due to opportunities being handed on a plate to the wrong people.", "rating": 5, "pros": "Benefits, staff, in the top 10 companies to work for.", "cons": "Salaries, recruitment process, systems", "advice": "A fairer recruitment process needs to be adopted as long serving, knowledgable, loyal staff are often lost due to opportunities being handed on a plate to the wrong people."}, {"title": "Soul Suckers", "text": "Pros Good line rental discounts, sick pay, maternity package. Cons Enough is never Enough! Ludicrous amounts of money spent on store refits (often a bit of a bodge job) not enough money invested in systems and hardware the staff need to do jobs quickly and efficiently. Too much red tape causing frustration and hindrance. Unable to price match at retail level, meaning countless sales lost to competitors and our own direct sales teams! Forced to be part of group messaging apps, meaning when you leave work..work follows you home! Stressed out managers ..i have witnessed people broken by the constant \"drilling down\" from upper management..who have no idea of the daily issues we have to deal with on the shop floor. Footfall counters, that unless you are under 3 foot tall..or duck under..each time the store is entered. will count as a customer..which is then counted as a buyer..to which we have to sell to, or it's a negative conversion. So if a workman or member of the public goes in and out several times..that pushes our targets to convert to a sale up. It's a very unfair system. Uniform is scruffy. And far too many people employed as management who quite frankly have atrocious personalities, personal hygiene and are all about divide and conquer and bullying! Advice to Management Spend more money on systems and hardware staff need to do the job efficiently and less on your company knees up events and constant shop record. Stop employing people as managers who have zero people skills and are bullies.", "rating": 3, "pros": "Good line rental discounts, sick pay, maternity package.", "cons": "Enough is never Enough! Ludicrous amounts of money spent on store refits (often a bit of a bodge job) not enough money invested in systems and hardware the staff need to do jobs quickly and efficiently. Too much red tape causing frustration and hindrance. Unable to price match at retail level, meaning countless sales lost to competitors and our own direct sales teams! Forced to be part of group messaging apps, meaning when you leave work..work follows you home! Stressed out managers ..i have witnessed people broken by the constant \"drilling down\" from upper management..who have no idea of the daily issues we have to deal with on the shop floor. Footfall counters, that unless you are under 3 foot tall..or duck under..each time the store is entered. will count as a customer..which is then counted as a buyer..to which we have to sell to, or it's a negative conversion. So if a workman or member of the public goes in and out several times..that pushes our targets to convert to a sale up. It's a very unfair system. Uniform is scruffy. And far too many people employed as management who quite frankly have atrocious personalities, personal hygiene and are all about divide and conquer and bullying!", "advice": "Spend more money on systems and hardware staff need to do the job efficiently and less on your company knees up events and constant shop record. Stop employing people as managers who have zero people skills and are bullies."}, {"title": "Good £££ for retail, awful job security(LONDON)", "text": "Pros 75% person line rental discount which drops to 30% for life one left. Good salary + Commission for retail Can be a fun environment. Cons Target driven, can be out of the company in a month once put on a performance plan. (Usually put on if the manger dislikes you, however sometimes it’s due to constant poor performance which is understandable). New starters never get trained properly which is sad to see. I have worked in many branches across the UK all I can say is every branch I worked with in London, ruined my whole outlook on EE as an employee. This review is specifically about stores in London. Absolute rubbish work life balance. Frowned upon when you don’t accept overtime and in turn holidays never get accepted. Although commission is good it’s decreased severely over the years and it’s harder to get. However work hard play hard. Stressful place to work in during 1. Black Friday 2.New phone launches 3. Christmas. Advice to Management Competition between stores in the same region let alone different regions is too much! Stop! Don’t talk to your employees unprofessionally or hide behind policies that you’ve made up on the spot. I once loved the company but the harsh reality is the company & the store managers treat you like the bottom of the barrel. WE ARE THE FIRST POINT OF CONTACT FOR YOUR CUSTOMERS!!! And one very last important point, do not apply the pressures that you’re getting from your managers to us ‘unprofessionally’.", "rating": 3, "pros": "75% person line rental discount which drops to 30% for life one left.", "cons": "Target driven, can be out of the company in a month once put on a performance plan. (Usually put on if the manger dislikes you, however sometimes it’s due to constant poor performance which is understandable).", "advice": "Competition between stores in the same region let alone different regions is too much! Stop! Don’t talk to your employees unprofessionally or hide behind policies that you’ve made up on the spot. I once loved the company but the harsh reality is the company & the store managers treat you like the bottom of the barrel. WE ARE THE FIRST POINT OF CONTACT FOR YOUR CUSTOMERS!!! And one very last important point, do not apply the pressures that you’re getting from your managers to us ‘unprofessionally’."}, {"title": "Customer Service Rep", "text": "Pros The people you work with most of the time are great that was the only thing I enjoyed about the place Cons Too focused on KPI and customer service if you do all you can to resolve the call and you get a poor score from a customer you are then having to listen to a manager that has no idea how to do the job tell you how to do the job. Where you get a customer that wants to speak to a manager they keep refusing the call had several where I have done all I can go to a manager and I'm bouncing between the angry customer and a manager that does not wanna take that call. The customer service systems are antiquated and not fit for the job. The work life balance is a joke they have you working all hours possible you can't have a life outside the call centre. Lack of info shared between the call centre and the stores neither has I idea what the other does. Advice to Management No point they don't care all they want is the money nothing more it's your the customer we don't care same as it is with the employees we are treated as drones", "rating": 1, "pros": "The people you work with most of the time are great that was the only thing I enjoyed about the place", "cons": "Too focused on KPI and customer service if you do all you can to resolve the call and you get a poor score from a customer you are then having to listen to a manager that has no idea how to do the job tell you how to do the job.", "advice": "No point they don't care all they want is the money nothing more it's your the customer we don't care same as it is with the employees we are treated as drones"}, {"title": "Business customer service advisor", "text": "Pros Good basic pay. Good bonus opportunity. Friendly staff. Opportunities for progression Cons Stressful target driven environment. Be the best competitive nature Advice to Management Listen and engage with staff on front line issues. Hard targets are not always the answer to performance management", "rating": 3, "pros": "Good basic pay. Good bonus opportunity. Friendly staff. Opportunities for progression", "cons": "Stressful target driven environment. Be the best competitive nature", "advice": "Listen and engage with staff on front line issues. Hard targets are not always the answer to performance management"}, {"title": "EE call centre", "text": "Pros Hours and contracts are great. the people you work with and the high level management are fab. benefits such as 75% off phone plans and 30% off for friends and family. dental and health cover included. overall a it doesn't really feel like an ordinary call centre. Good basic salary. Cons multiple systems being used at the same time meaning it isn't easy to navigate and find out information for customers. Adding in more system processes but the targets on after call work (WRAP) remains the same. unachievable targets meaning commission has went from an average of £500 a month to £100 a month. Advice to Management You want to be best for customer service but pressure staff into selling additional products. you ask a lot of your sales and retentions teams but not one manager could follow the \"ee way\" call flow and use the systems correctly at the same time.follow in apples footsteps make advisors sell only if it suits the customer.", "rating": 3, "pros": "Hours and contracts are great. the people you work with and the high level management are fab. benefits such as 75% off phone plans and 30% off for friends and family. dental and health cover included. overall a it doesn't really feel like an ordinary call centre. Good basic salary.", "cons": "multiple systems being used at the same time meaning it isn't easy to navigate and find out information for customers. Adding in more system processes but the targets on after call work (WRAP) remains the same. unachievable targets meaning commission has went from an average of £500 a month to £100 a month.", "advice": "You want to be best for customer service but pressure staff into selling additional products. you ask a lot of your sales and retentions teams but not one manager could follow the \"ee way\" call flow and use the systems correctly at the same time.follow in apples footsteps make advisors sell only if it suits the customer."}, {"title": "Great company", "text": "Pros Genuinely love their staff. Cons Working weekends to accommodate customers. More common these days.", "rating": 5, "pros": "Genuinely love their staff.", "cons": "Working weekends to accommodate customers. More common these days.", "advice": null}, {"title": "Good money, great training", "text": "Pros Training provided regularly Very good commission - I was on a 12 hour p/week contract, this one specific month i did a little bit of overtime but took home £450 in commission on top of my basic Working in a phone shop is exactly like the programme Phone Shop, a great laugh. Cons none that i can think of. Advice to Management Keep it up. My manager at Exeter was very supportive. Keep it up Rich.", "rating": 5, "pros": "Training provided regularly", "cons": "none that i can think of.", "advice": "Keep it up. My manager at Exeter was very supportive. Keep it up Rich."}, {"title": "great company", "text": "Pros lots of support and help, training is good Cons some processes are long especially with the slow it systems Advice to Management improve IT systems", "rating": 5, "pros": "lots of support and help, training is good", "cons": "some processes are long especially with the slow it systems", "advice": "improve IT systems"}, {"title": "Customer Service Representative", "text": "Pros Decent wage and benefits 75% discount on personal phone Cons 12 hour shifts on the phones poor work life balance Advice to Management Targets hard", "rating": 3, "pros": "Decent wage and benefits 75% discount on personal phone", "cons": "12 hour shifts on the phones poor work life balance", "advice": "Targets hard"}, {"title": "Contact Centre boring and repetitive", "text": "Pros Good people, fun on breaks, training is good. Cons Timed and tracked.to the second. Very target driven Advice to Management Chill on the targets", "rating": 1, "pros": "Good people, fun on breaks, training is good.", "cons": "Timed and tracked.to the second. Very target driven", "advice": "Chill on the targets"}, {"title": "sales assistant", "text": "Pros good people to work with Cons too many targets and unrealistic at times", "rating": 3, "pros": "good people to work with", "cons": "too many targets and unrealistic at times", "advice": null}, {"title": "good pay but lots of pressure", "text": "Pros good pay relax when quiet good discount Cons selling goods when people don't need it", "rating": 5, "pros": "good pay", "cons": "selling goods when people don't need it", "advice": null}, {"title": "Call centre", "text": "Pros Not a single one to be frank Cons Terrible work culture. Lying to customer highly encouraged and I wasn't even on sales team Advice to Management Respect your employees", "rating": 1, "pros": "Not a single one to be frank", "cons": "Terrible work culture. Lying to customer highly encouraged and I wasn't even on sales team", "advice": "Respect your employees"}, {"title": "EE pretty good overall but some room for improvement", "text": "Pros Nice canteen in Paddington office Good London location Young and enthusiastic staff Interesting projects Cons No social activities Not much training Not enough responsibility/budget even at more senior grades Advice to Management Think about giving exposure to VP level to your staff - also consider the importance of social activities outside of work", "rating": 5, "pros": "Nice canteen in Paddington office", "cons": "No social activities", "advice": "Think about giving exposure to VP level to your staff - also consider the importance of social activities outside of work"}, {"title": "It is an ok part time job", "text": "Pros You interact with a wide variety of people on a daily basis Targets and bonus incentives Friends and Family discount Cons Lack of communication between sales advisers on shop floor and customer services over the phone Be prepared to encounter the occasional disgruntled customer", "rating": 5, "pros": "You interact with a wide variety of people on a daily basis", "cons": "Lack of communication between sales advisers on shop floor and customer services over the phone", "advice": null}, {"title": "Manager", "text": "Pros Good salary for big stores. Staff are good. Good discounts although you should really have a free phone. Good tech to work with Cons Regional managers don't have a clue. Systems are dodgy. Targets are very stupid. No one at higher level really cares about the staff or customers Advice to Management Actually realise what it's like with the targets given!", "rating": 3, "pros": "Good salary for big stores. Staff are good. Good discounts although you should really have a free phone. Good tech to work with", "cons": "Regional managers don't have a clue. Systems are dodgy. Targets are very stupid. No one at higher level really cares about the staff or customers", "advice": "Actually realise what it's like with the targets given!"}, {"title": "VILE", "text": "Pros Flexibility on time and work schedules Cons Lack of authenticity from management and team leaders. Bad business practices. Advice to Management Employ managers with relevant experience and sound knowledge of best practice and governance.", "rating": 1, "pros": "Flexibility on time and work schedules", "cons": "Lack of authenticity from management and team leaders.", "advice": "Employ managers with relevant experience and sound knowledge of best practice and governance."}, {"title": "Great!", "text": "Pros 75% discount is great especially the personal one Cons There isnt ANY for this great company Advice to Management None", "rating": 5, "pros": "75% discount is great especially the personal one", "cons": "There isnt ANY for this great company", "advice": "None"}, {"title": "Customer Sales", "text": "Pros Reasonable wage and ambitious targets which worked personally well for me. Also quite strong communication with staff and levels of management. Strong brand. Cons Some initial training was worked around retail and poorly delegated.", "rating": 5, "pros": "Reasonable wage and ambitious targets which worked personally well for me. Also quite strong communication with staff and levels of management. Strong brand.", "cons": "Some initial training was worked around retail and poorly delegated.", "advice": null}, {"title": "Terrible company to work for", "text": "Pros Discounts for staff on phone contracts Cons Unprofessional from start to finish Advice to Management The most unprofessional company I've ever worked for. Managers holding meetings in the middle of the call centre, listening to calls on speaker for anyone walking past to hear is not the way you should be monitoring your employees training needs.", "rating": 1, "pros": "Discounts for staff on phone contracts", "cons": "Unprofessional from start to finish", "advice": "The most unprofessional company I've ever worked for. Managers holding meetings in the middle of the call centre, listening to calls on speaker for anyone walking past to hear is not the way you should be monitoring your employees training needs."}, {"title": "Marketing Apprentice", "text": "Pros Good company benefits. Mobile Phone Discount is excellent. communicating with other departments was also very smooth and quick. Cons Diversity Issues I think aren't up to the current standard that businesses are at. I think young members of staff are not treated in the same way as others.", "rating": 1, "pros": "Good company benefits. Mobile Phone Discount is excellent.", "cons": "Diversity Issues I think aren't up to the current standard that businesses are at. I think young members of staff are not treated in the same way as others.", "advice": null}, {"title": "Chaotic organisation, some nice folks", "text": "Pros Good core product (network coverage), some nice people who care about the company and others, staff discounts, office location, canteen food Cons Complete chaos, organisation lacks vision and purpose, unclear job roles, poor management and leadership, very short term focus, no strategy and coordination between teams. Might is right approach. Advice to Management Sort yourselves out!", "rating": 3, "pros": "Good core product (network coverage), some nice people who care about the company and others, staff discounts, office location, canteen food", "cons": "Complete chaos, organisation lacks vision and purpose, unclear job roles, poor management and leadership, very short term focus, no strategy and coordination between teams. Might is right approach.", "advice": "Sort yourselves out!"}, {"title": "Customer Advisor (Temp)", "text": "Pros All my colleagues were lovely, really welcoming and always helpful towards me and the customers. Meeting lots of different customers all the time. Learnt a lot about phones, and other bits of tech that I never knew about. Cons The store didn't have enough staff, so as a temp on an 8 hour contract I was sometimes doing hours of 20+ a week. This wasn't ideal as I was a uni student at the time and this actually led to my grades falling before I left the post. As a temp I wasn't offered any initial training, I had to learn on the shop floor. Also due to me being a temp I didn't get the benefits that normal employees would i.e. holiday, discounts and bonuses. I did get commission though, but I was never told how this was worked out. Advice to Management More staff for small stores and more training even if it is for a temp position.", "rating": 3, "pros": "All my colleagues were lovely, really welcoming and always helpful towards me and the customers.", "cons": "The store didn't have enough staff, so as a temp on an 8 hour contract I was sometimes doing hours of 20+ a week. This wasn't ideal as I was a uni student at the time and this actually led to my grades falling before I left the post.", "advice": "More staff for small stores and more training even if it is for a temp position."}, {"title": "Great company to work for if you make the most of what is available to you!", "text": "Pros Pay is great. Growth and development support is great as well as encouraged. Fast pace and love working for the UKs leading network Cons There's a lot of system and process to remember, pressure can be on at times it's whether you enjoy that.", "rating": 5, "pros": "Pay is great. Growth and development support is great as well as encouraged. Fast pace and love working for the UKs leading network", "cons": "There's a lot of system and process to remember, pressure can be on at times it's whether you enjoy that.", "advice": null}, {"title": "EE", "text": "Pros Large company, numerous benefits and one of The Times Best places to work 2017. Cons None that comes to mind", "rating": 5, "pros": "Large company, numerous benefits and one of The Times Best places to work 2017.", "cons": "None that comes to mind", "advice": null}, {"title": "Sales adviser", "text": "Pros Staff, phone at 75% off Cons Not great working hours, poor pay, power tripping managers, ridiculous targets. Advice to Management Not everything is in black and white! You can't justify what staff make in value to the company with minute bonus dealing with customers that aren't the nicest screaming etc. Totally mind numbing experience. With obnoxious patronising sales men as managers selling is not ethical but despite 0% complaints. Just don't work there !!!", "rating": 1, "pros": "Staff, phone at 75% off", "cons": "Not great working hours, poor pay, power tripping managers, ridiculous targets.", "advice": "Not everything is in black and white! You can't justify what staff make in value to the company with minute bonus dealing with customers that aren't the nicest screaming etc. Totally mind numbing experience. With obnoxious patronising sales men as managers selling is not ethical but despite 0% complaints."}, {"title": "Customer Advisor - Sales Driven", "text": "Pros - Staff and people you work with - OTE Money is good - Progression within company - Can be rewarding Cons - Un-experienced or just arrogant managers - Too sales driven, Targets only go up - Not enough customer focus (although they'd think otherwise) - Only some of higher management have to time of day for you - Feel forced to sell unethically - (Not by store employees) Advice to Management Focus on making ALL your employees happy within reason, review and help senior managers. They get a little lost within there title. Have fair targets and focus more on customer.", "rating": 3, "pros": "- Staff and people you work with", "cons": "- Un-experienced or just arrogant managers", "advice": "Focus on making ALL your employees happy within reason, review and help senior managers. They get a little lost within there title. Have fair targets and focus more on customer."}, {"title": "good and bad", "text": "Pros good sick pay and genuinely worked with good people Cons the commission structure changed and everything went to rubbish after that Advice to Management give more opportunities to your staff", "rating": 3, "pros": "good sick pay and genuinely worked with good people", "cons": "the commission structure changed and everything went to rubbish after that", "advice": "give more opportunities to your staff"}, {"title": "EE company to work for", "text": "Pros young, fast paced and greta location with BT Centre in London Cons Not great at career progression, communication and not that friendly Advice to Management treat people as you would wish to be treated", "rating": 3, "pros": "young, fast paced and greta location with BT Centre in London", "cons": "Not great at career progression, communication and not that friendly", "advice": "treat people as you would wish to be treated"}, {"title": "Absolute Shambles.", "text": "Pros Loved the customer facing environment, felt the management was supportive and tried everything to help develop me as they possible could!! Cons The Franchisee would black mail staff, hang development over you and then take it away if you had a \"wobbly\" month. Was pushed out the door and not given much of a choice about it. I worked in both retail and franchise and i feel that franchisees think they can do what they like when they like and EE really needs to look at who is trading under their name as the brand is being ruined.", "rating": 3, "pros": "Loved the customer facing environment, felt the management was supportive and tried everything to help develop me as they possible could!!", "cons": "The Franchisee would black mail staff, hang development over you and then take it away if you had a \"wobbly\" month. Was pushed out the door and not given much of a choice about it. I worked in both retail and franchise and i feel that franchisees think they can do what they like when they like and EE really needs to look at who is trading under their name as the brand is being ruined.", "advice": null}, {"title": "Was great for first few months, management changed, commission changed", "text": "Pros Company Benefits i.e up to 10% off apple products, gym discount, car discount Short hours 9-5:30 Sundays off Cons Management can be lazy Seniors aren't properly trained Commission scheme has made it impossible to earn commission Targets are massive (even being in a small store) Customers can be very aggressive and angry at the company", "rating": 3, "pros": "Company Benefits i.e up to 10% off apple products, gym discount, car discount", "cons": "Management can be lazy", "advice": null}, {"title": "The good days are behind", "text": "Pros Part of the BT group means greater exposure to other areas. Good team culture. Canteen and coffee shop is good. Fast moving compared to other main telcos. Cons Paddington was good, New office at BT Centre is extremely ugly and creates barriers to collaborative working. Too many middle managers that add little or no value, who instead spend time playing internal politics. Advice to Management Don't just talk about customer centricity actually get behind it.", "rating": 3, "pros": "Part of the BT group means greater exposure to other areas. Good team culture.", "cons": "Paddington was good, New office at BT Centre is extremely ugly and creates barriers to collaborative working.", "advice": "Don't just talk about customer centricity actually get behind it."}, {"title": "Customer Advisor", "text": "Pros Friendly staff, Helpful Manager and challenging targets designed to make you work harder Cons Its quite a distance to travel Advice to Management N/A", "rating": 5, "pros": "Friendly staff, Helpful Manager and challenging targets designed to make you work harder", "cons": "Its quite a distance to travel", "advice": "N/A"}, {"title": "Brilliant Career Progression", "text": "Pros So i started in may 2015 after being out of work for 4 months. I took a position as a 24 hour sales advisor. 2 years later i've gone from part time, to full time, to senior advisor, to assistant branch manager. Company is great. I have met with Lee, the head of stores. I had my opinions and ideas heard And acted upon Cons Commission (although better than competitors) has decreased year on year. Advice to Management Keep people with experience that still have the passion. Get rid of the dead wood who \"remember the good old days\" they call them selves realists but actually, they just fantasise about times gone by. To many hood people are getting overloojed because of legacy team members", "rating": 5, "pros": "So i started in may 2015 after being out of work for 4 months. I took a position as a 24 hour sales advisor. 2 years later i've gone from part time, to full time, to senior advisor, to assistant branch manager. Company is great. I have met with Lee, the head of stores. I had my opinions and ideas heard And acted upon", "cons": "Commission (although better than competitors) has decreased year on year.", "advice": "Keep people with experience that still have the passion. Get rid of the dead wood who \"remember the good old days\" they call them selves realists but actually, they just fantasise about times gone by. To many hood people are getting overloojed because of legacy team members"}, {"title": "DONT WORK AT EE", "text": "Pros The people you end up on a team with are generally nice. Cons Suppose to be customer focus its a load of rubbish its all about selling like trying to sell broadband to 70 yr old, discussing in my mind. Also if you sell to many sim cards you get wrong it has to be phones. They also tell you u can make a good bonus however when u have made it they cut it in half without even telling you. Not supportive in any way. Wouldnt recommend this company to my worst enemy they are crap. Doesnt matter if a customer sends an email to your manager thanking you for good customer service managers not bothered. Advice to Management Give praise were its due and focus on your customers more. Never going to happen.", "rating": 1, "pros": "The people you end up on a team with are generally nice.", "cons": "Suppose to be customer focus its a load of rubbish its all about selling like trying to sell broadband to 70 yr old, discussing in my mind. Also if you sell to many sim cards you get wrong it has to be phones. They also tell you u can make a good bonus however when u have made it they cut it in half without even telling you. Not supportive in any way. Wouldnt recommend this company to my worst enemy they are crap. Doesnt matter if a customer sends an email to your manager thanking you for good customer service managers not bothered.", "advice": "Give praise were its due and focus on your customers more. Never going to happen."}, {"title": "Dont Care", "text": "Pros Some colleages are brilliant and supportive Cons Management dont follow the recognised disciplinary procedures. they bully staff even when staff are working flat out. They discipline staff based on survey EE as a company NOT the employee and we are told to \"educate\" the public which is very condescending. Advice to Management Stop the bullying and start encouraging.", "rating": 1, "pros": "Some colleages are brilliant and supportive", "cons": "Management dont follow the recognised disciplinary procedures. they bully staff even when staff are working flat out. They discipline staff based on survey EE as a company NOT the employee and we are told to \"educate\" the public which is very condescending.", "advice": "Stop the bullying and start encouraging."}, {"title": "Good Pay some okay Managers stupid Processes", "text": "Pros Excellent bonus scheme Pay and rewarded with pay rises for hitting targets each year progression available if willing to work full time. Loads of training which only happened since BT took over. Cons It's who you know not what you know at EE. If you work part time expect to move teams often and know you won't progress. If you want time off the phones have rubbish stats and be a brown nose. Normal people who just want to work get ignored even if their stats are amazing and the customers love them. Advice to Management Stop this thing where favourites get all the opportunities . There is having fun and then working in a creche! Management need to engage with their teams not mess about on their own special little bay with little interaction with hard working front line agents.", "rating": 3, "pros": "Excellent bonus scheme Pay and rewarded with pay rises for hitting targets each year progression available if willing to work full time. Loads of training which only happened since BT took over.", "cons": "It's who you know not what you know at EE. If you work part time expect to move teams often and know you won't progress. If you want time off the phones have rubbish stats and be a brown nose. Normal people who just want to work get ignored even if their stats are amazing and the customers love them.", "advice": "Stop this thing where favourites get all the opportunities . There is having fun and then working in a creche! Management need to engage with their teams not mess about on their own special little bay with little interaction with hard working front line agents."}, {"title": "Great school leaver role.", "text": "Pros Wage wage wage wage wage Cons Bullying harrasment high target nasty Advice to Management Improve your seniors managers, look out for staff mkre", "rating": 1, "pros": "Wage wage wage wage wage", "cons": "Bullying harrasment high target nasty", "advice": "Improve your seniors managers, look out for staff mkre"}, {"title": "EE", "text": "Pros Great team, well structured work flow Cons All good, no issues or concerns", "rating": 5, "pros": "Great team, well structured work flow", "cons": "All good, no issues or concerns", "advice": null}, {"title": "Fantastic Company to Work for!", "text": "Pros Great benefits, lots of opportunity, rewards staff for hard work Cons no cons really, at times it can be challenging but in a positive way", "rating": 5, "pros": "Great benefits, lots of opportunity, rewards staff for hard work", "cons": "no cons really, at times it can be challenging but in a positive way", "advice": null}, {"title": "Disappointing treatment by management", "text": "Pros The culture was pretty good, lots of socialising and interactivity. Cons Senior management were not focused on individual employee experiences, with what verged on discriminatory practice at times.", "rating": 3, "pros": "The culture was pretty good, lots of socialising and interactivity.", "cons": "Senior management were not focused on individual employee experiences, with what verged on discriminatory practice at times.", "advice": null}, {"title": "Corrupt need to sleep around to get anywhere managers don't train or support to busy trying to impress their manager", "text": "Pros Clean offices and some people are genuine Cons No support, don't ask fir help as you won't get any and need to sleep with at least one manager to get anywhere Advice to Management Reward people on skill not on who they know and who they sleep with and senior management need to open their eyes to what really goes on as totally corrupt", "rating": 1, "pros": "Clean offices and some people are genuine", "cons": "No support, don't ask fir help as you won't get any and need to sleep with at least one manager to get anywhere", "advice": "Reward people on skill not on who they know and who they sleep with and senior management need to open their eyes to what really goes on as totally corrupt"}, {"title": "Nice working environment", "text": "Pros Nice working environment and good bonus Cons Now part of the BT group which means the company is going through a lot of changes.", "rating": 5, "pros": "Nice working environment and good bonus", "cons": "Now part of the BT group which means the company is going through a lot of changes.", "advice": null}, {"title": "Great company to work for", "text": "Pros Working on cutting edge technologies, great people Cons You will be busy all the time, which is also a good thing depending on how you see it", "rating": 5, "pros": "Working on cutting edge technologies, great people", "cons": "You will be busy all the time, which is also a good thing depending on how you see it", "advice": null}, {"title": "Sales Assistant", "text": "Pros Nice wage, good commission Cons Not many things wrong", "rating": 3, "pros": "Nice wage, good commission", "cons": "Not many things wrong", "advice": null}, {"title": "Full or promise, fail to deliver", "text": "Pros Discounted mobile and broadband deal Cons Promise development and fail to deliver, face fits sort of attitude to recruitment and progression. Advice to Management Retire", "rating": 3, "pros": "Discounted mobile and broadband deal", "cons": "Promise development and fail to deliver, face fits sort of attitude to recruitment and progression.", "advice": "Retire"}, {"title": "Best company I've worked for", "text": "Pros Pay Services Discounts There is a lot definitely a good company trying to fill up 20 words which is more r Cons Sudden structure changes makes me hate the company sometimes but at the same time the pay has steadily been decreasing over the years", "rating": 5, "pros": "Pay", "cons": "Sudden structure changes makes me hate the company sometimes but at the same time the pay has steadily been decreasing over the years", "advice": null}, {"title": "Can get repetitive", "text": "Pros Good friendly environment to work at with some nice customers plus the job is not hard so once you get to know the systems it's the same everyday after that. Cons Targets can be high to achieve sometimes but depends on which store you work at. And you have to remember a lot of the things. Advice to Management Stop changing", "rating": 5, "pros": "Good friendly environment to work at with some nice customers plus the job is not hard so once you get to know the systems it's the same everyday after that.", "cons": "Targets can be high to achieve sometimes but depends on which store you work at. And you have to remember a lot of the things.", "advice": "Stop changing"}, {"title": "Overall good experience if you are passionate about sales and like to communicate with people.", "text": "Pros Good pay, great working with the teams and fulfilling if you are a people person and like to start and maintain conversations. The more sales you achieve you get monthly bonuses based on commission from hitting targets. Cons The job can be tiresome especially as customers like to come in waves; this means that there can be periods (especially on weekdays) when no one comes in and you must remain on the shop floor and you need to try your best to have an inviting demeanour about you. Not everyone who comes in is buying something and most people (when trying to push a sale) will end up only wanting to find out prices for monthly tariffs for devices and thats mostly it. As mentions in the 'Pros' section, you have monthly targets and your targets will be based on the hours you do and which days you work during the week (weekend shifts would inherently have higher targets due to higher footfall, and managers want to push more sales). You also need to be aware that although you're attempting to make as many sales as possible some colleagues will 'snipe' customers in order to steal sales and make more money. The company does aim to promote a more 'team' based sales collective. But individual sales targets seem to be counterintuitive in this regard. Advice to Management Be more aware of the personality traits of the applicants rather than just looking to the achievements and qualifications of their CVs. They need to be able to fit in with the team. Having toxic coworkers dramatically dissipates the effectiveness of a team.", "rating": 3, "pros": "Good pay, great working with the teams and fulfilling if you are a people person and like to start and maintain conversations. The more sales you achieve you get monthly bonuses based on commission from hitting targets.", "cons": "The job can be tiresome especially as customers like to come in waves; this means that there can be periods (especially on weekdays) when no one comes in and you must remain on the shop floor and you need to try your best to have an inviting demeanour about you.", "advice": "Be more aware of the personality traits of the applicants rather than just looking to the achievements and qualifications of their CVs. They need to be able to fit in with the team. Having toxic coworkers dramatically dissipates the effectiveness of a team."}, {"title": "Forward thinking, progressive and playful company to work for.", "text": "Pros Great training. Really fruitful and flexible staff benefits, ranging from dental cover, private health care, buy holidays, life assurance etc! Reasonable work life balance. Good clear progression paths, with opportunities to change direction into other areas of the business, through personal development. On site concierge. Great bonus scheme with the opportunity to increase it substantially via high performance. Really clear working policies that's are easily accessible and also support from HR. Shifts are good and any changes are always provided with 30 days notice. BT share plans now accessible to EE staff. Cons It seems that now BT have acquired EE the sparkle that the company has is slowly fading, making the culture internally very dated and corporate. The business should continue to evolve with its precious morals and values, after all isn't that what BT wanted EE for ? Some managers lack the personal element when dealing with team members, it's all about the business impacts and not enough about the individuals impact. (Not all managers) there is a lot of inconsistency in the way that different areas of the business deal with ER situations, very perceptive and sometimes those who are 'liked' receive more favourable treatment. Some of the offices are VERY dated, chairs, desks and facilities (air con, toilets etc) are really in need of some TLC and modernisation. Advice to Management Although cost centre management is an important aspect for senior staff, there also needs to be consideration of what impact cost savings have on execution. It goes without saying 'you get what you pay for' More consistency with recruitment, ER and performance across the directorates.", "rating": 5, "pros": "Great training. Really fruitful and flexible staff benefits, ranging from dental cover, private health care, buy holidays, life assurance etc! Reasonable work life balance. Good clear progression paths, with opportunities to change direction into other areas of the business, through personal development. On site concierge. Great bonus scheme with the opportunity to increase it substantially via high performance. Really clear working policies that's are easily accessible and also support from HR. Shifts are good and any changes are always provided with 30 days notice. BT share plans now accessible to EE staff.", "cons": "It seems that now BT have acquired EE the sparkle that the company has is slowly fading, making the culture internally very dated and corporate. The business should continue to evolve with its precious morals and values, after all isn't that what BT wanted EE for ? Some managers lack the personal element when dealing with team members, it's all about the business impacts and not enough about the individuals impact. (Not all managers) there is a lot of inconsistency in the way that different areas of the business deal with ER situations, very perceptive and sometimes those who are 'liked' receive more favourable treatment. Some of the offices are VERY dated, chairs, desks and facilities (air con, toilets etc) are really in need of some TLC and modernisation.", "advice": "Although cost centre management is an important aspect for senior staff, there also needs to be consideration of what impact cost savings have on execution. It goes without saying 'you get what you pay for'"}, {"title": "tech", "text": "Pros great benefits, great training. great environment to work in. lots of opportunities Cons sickness policy when you have an condition should be different to those who just fancy a sick day", "rating": 5, "pros": "great benefits, great training. great environment to work in. lots of opportunities", "cons": "sickness policy when you have an condition should be different to those who just fancy a sick day", "advice": null}, {"title": "Culture", "text": "Pros Innovative, fast paced and competitive. Always forward looking Cons Starting to lose some of its identity following BT takeover", "rating": 3, "pros": "Innovative, fast paced and competitive. Always forward looking", "cons": "Starting to lose some of its identity following BT takeover", "advice": null}, {"title": "Intern", "text": "Pros Great place to work, engaging and proactive work place. Cons nothing i can think of Advice to Management keep up the great work", "rating": 5, "pros": "Great place to work, engaging and proactive work place.", "cons": "nothing i can think of", "advice": "keep up the great work"}, {"title": "Good company to work for however a lot o pressure", "text": "Pros Commission is good Flexibility Diverse Not to demanding fun Cons Pressure to hit targets Managers preassure Staying past your finishing time Advice to Management Need to create a relationship with employees instead of constantly putting pressure and intimidating employees with a job loss if targets are not consistently met.", "rating": 3, "pros": "Commission is good", "cons": "Pressure to hit targets", "advice": "Need to create a relationship with employees instead of constantly putting pressure and intimidating employees with a job loss if targets are not consistently met."}, {"title": "Good", "text": "Pros If you a determined, there is a lot of money to be made Cons No commison on the days you take off, meaning youre more likely to do overtime Advice to Management none", "rating": 5, "pros": "If you a determined, there is a lot of money to be made", "cons": "No commison on the days you take off, meaning youre more likely to do overtime", "advice": "none"}, {"title": "Has it's ups and downs", "text": "Pros Fully welcomed by the team upon starting. At times could be an extremely enjoyable job, never short of perks for working there! Cons Often found working overtime without notice, as well as none of my working requirements being honoured as stated in the interview. Would strongly advise against working whilst being a student as was not allowed to work my shifts around my lectures. Training overly long, not very relevant to what the job is actually like, so don't be put off by the month of training. Advice to Management Overall very good! Just don't think you should employ someone knowing their availability, if you're not to at least attempt to accommodate.", "rating": 3, "pros": "Fully welcomed by the team upon starting. At times could be an extremely enjoyable job, never short of perks for working there!", "cons": "Often found working overtime without notice, as well as none of my working requirements being honoured as stated in the interview. Would strongly advise against working whilst being a student as was not allowed to work my shifts around my lectures. Training overly long, not very relevant to what the job is actually like, so don't be put off by the month of training.", "advice": "Overall very good! Just don't think you should employ someone knowing their availability, if you're not to at least attempt to accommodate."}, {"title": "Slowly getting more 'commercial'", "text": "Pros Great personal benefits on phones and tablets Great training Good incentives Cons Since starting the company they have pushed targets to a place where they are generally unachievable as a store. Personal targets are harder to achieve if you have time off like holiday, makes you feel penalised for wanting a day off The company used to care more about its employees, now it seems to be motivated by BT's ethos, not the one I agreed with when I started Advice to Management The company needs to actually listen to their staff. Remove the commission scheme and just pay employees more. If you work in a large store then awesome, you'll most likely hit target. If you're in a small store every month is a struggle and I don't feel it's worth it.", "rating": 3, "pros": "Great personal benefits on phones and tablets", "cons": "Since starting the company they have pushed targets to a place where they are generally unachievable as a store.", "advice": "The company needs to actually listen to their staff. Remove the commission scheme and just pay employees more. If you work in a large store then awesome, you'll most likely hit target. If you're in a small store every month is a struggle and I don't feel it's worth it."}, {"title": "Pressured enviroment", "text": "Pros Relatively casual and relaxed atmosphere unless the manager is pushing heavily for targets Cons Seems like a large amount of top down pressure through the company to achieve targets, sometimes at any means necessary depending on your store managers Advice to Management Don't be so pushy with the staff. Not every customer will buy everything", "rating": 5, "pros": "Relatively casual and relaxed atmosphere unless the manager is pushing heavily for targets", "cons": "Seems like a large amount of top down pressure through the company to achieve targets, sometimes at any means necessary depending on your store managers", "advice": "Don't be so pushy with the staff. Not every customer will buy everything"}, {"title": "Interesting times", "text": "Pros Management is open to suggestions & feedback. I found the teams I work with to be very supportive. Culture from the top down, anyone can contribute a great idea. Cons There started to be a lot of off shore development which impacted team dynamics. There was quite a lot of orgs in the time I was there under T-mobile, Orange & EE Advice to Management Keep spending on people and best equipment/technology solutions and it will keep us competitive.", "rating": 3, "pros": "Management is open to suggestions & feedback. I found the teams I work with to be very supportive. Culture from the top down, anyone can contribute a great idea.", "cons": "There started to be a lot of off shore development which impacted team dynamics. There was quite a lot of orgs in the time I was there under T-mobile, Orange & EE", "advice": "Keep spending on people and best equipment/technology solutions and it will keep us competitive."}, {"title": "Taking EE beyond 4G", "text": "Pros Talented work colleagues, energy and focus in delivery, strong Brand and PR, good technology assets (spectrum, mobile network, several really flexible systems for quickly creating new products) Cons Delivering too much change too quickly ; senior management/PMO not sharing planned changes early enough with all groups that needed to understand and implement them meaning that execution was sometimes poor (and hence customer complaints high); not enough priority given to customer loyalty. Advice to Management Beware too close an association with 4G in customers' minds - the next gen mobile technology isn't far away. However don't get too hung up on always being first to launch next technology, especially if it is at the expense of launching a full experience (device/network/products/support) that works brilliantly in all channels the customer uses. And get rid of the sneaky costs - customers really despise those (a loyalty killer). Finally - be genuinely different ... mobile operators are still seen by the general public as bland, bureaucratic and not much to chose between them.", "rating": 5, "pros": "Talented work colleagues, energy and focus in delivery, strong Brand and PR, good technology assets (spectrum, mobile network, several really flexible systems for quickly creating new products)", "cons": "Delivering too much change too quickly ; senior management/PMO not sharing planned changes early enough with all groups that needed to understand and implement them meaning that execution was sometimes poor (and hence customer complaints high); not enough priority given to customer loyalty.", "advice": "Beware too close an association with 4G in customers' minds - the next gen mobile technology isn't far away. However don't get too hung up on always being first to launch next technology, especially if it is at the expense of launching a full experience (device/network/products/support) that works brilliantly in all channels the customer uses. And get rid of the sneaky costs - customers really despise those (a loyalty killer). Finally - be genuinely different ... mobile operators are still seen by the general public as bland, bureaucratic and not much to chose between them."}, {"title": "Customer Service Representative", "text": "Pros 75% off a new monthly phone contract plus 30% off for 5 friends per year. Plenty of opportunity to develop within the contact centre but better suited to full time workers. Great part time flexibility for students, mothers and people who work more than one job. Cons Being the UK's largest network means you're always busy with no time to rest and as is the nature of customer service, a large portion of the people you speak to aren't happy and have no respect for you. Development is only to immediate roles and long term development is few and far between. Particularly harsh on sick days too.", "rating": 5, "pros": "75% off a new monthly phone contract plus 30% off for 5 friends per year.", "cons": "Being the UK's largest network means you're always busy with no time to rest and as is the nature of customer service, a large portion of the people you speak to aren't happy and have no respect for you.", "advice": null}, {"title": "Great organisation to work for if it retain its identity in the BT group", "text": "Pros - fantastic and energetic people - can do attitude - fast paced Cons - BT is para shooting their people to management roles - Managers that are suitable for public service jobs are managing one of the most dynamic companies in the UK. Advice to Management Good luck! Manay talented people are leaving as they see whats on horizon coming from BT. Lets see for how long EE stay top companies to work for with BT management", "rating": 5, "pros": "- fantastic and energetic people", "cons": "- BT is para shooting their people to management roles", "advice": "Good luck! Manay talented people are leaving as they see whats on horizon coming from BT. Lets see for how long EE stay top companies to work for with BT management"}, {"title": "Retail Sales Advisor", "text": "Pros - Generous commision scheme - Ability to earn allot of money through sales - Good work/ life balance Cons - Management are very pressuring on staff to hit targets - Allot of complaints from customers through mis selling", "rating": 3, "pros": "- Generous commision scheme", "cons": "- Management are very pressuring on staff to hit targets", "advice": null}, {"title": "Overall a good place to work", "text": "Pros Good Basic and bonus for high street retail. Cons Can be high pressure at times", "rating": 5, "pros": "Good Basic and bonus for high street retail.", "cons": "Can be high pressure at times", "advice": null}, {"title": "Change of office for the worse", "text": "Pros It was fun to be a part of a big, fast moving company at a pivotal time in their timeline - I started just after the BT merger was approved. Being a part of a big company vision, and being able to see that grow and move forward every day was enthralling. The employee phone discount is pretty good too! Main points:  - Excellent employee benefits  - Relaxed environment  - Wealth of support from HR Cons The initial working environment was great, difficult to fault. However, shortly after I started in their London HQ, everyone was moved into the BT building after the merger. There was not enough room for everyone in the office so teams had to work from home 2 days a week on a rotational basis. The entire team was almost never in the office at the same time! The office was not in keeping with the company theme as it had been previously, so it immediately became a depressing place to work. From the get go, EE continuously seemed to be pitching their company culture as laid back - injecting some startup culture into a corporate environment. I can't fault them for trying, but it didn't really follow through. The company was rife with bureaucracy and I was frequently witness to office spats, and often cc'd into passive aggressive emails. Advice to Management If you are planning to move hundreds of employees into an office - make sure there is room first. Or at least manage expectations/keep people informed of how their working environment is about to change.", "rating": 3, "pros": "It was fun to be a part of a big, fast moving company at a pivotal time in their timeline - I started just after the BT merger was approved. Being a part of a big company vision, and being able to see that grow and move forward every day was enthralling. The employee phone discount is pretty good too!", "cons": "The initial working environment was great, difficult to fault. However, shortly after I started in their London HQ, everyone was moved into the BT building after the merger. There was not enough room for everyone in the office so teams had to work from home 2 days a week on a rotational basis. The entire team was almost never in the office at the same time! The office was not in keeping with the company theme as it had been previously, so it immediately became a depressing place to work.", "advice": "If you are planning to move hundreds of employees into an office - make sure there is room first. Or at least manage expectations/keep people informed of how their working environment is about to change."}, {"title": "OKish", "text": "Pros discounts on products good environment to interact with other employees, most of the managers are nice. paid holidays - means you dont have to worry about losing that extra money. flexible hours Cons no overtime and unbeatable targets. managers expect employees to meet targets that are highly impossible the pay is not that great to be honest, especially for the amount of work that you have to do. Advice to Management be understanding of ones financial needs and home needs when calling in sick. set targets that people an easily meet that way the store will make more money.", "rating": 5, "pros": "discounts on products", "cons": "no overtime and unbeatable targets. managers expect employees to meet targets that are highly impossible", "advice": "be understanding of ones financial needs and home needs when calling in sick."}, {"title": "Changes", "text": "Pros Good friendly teams Good staff bonuses Paid holiday Reasonable Commission Nice managers who care about staff Good support network for employees Cons Too many changes since being bought by BT. I've worked for the company for 2 years. Our commission structure has changed twice both apparently as it will get us paid more but instead I've seen my paycheck decrease by 40% Unrealistic store targets Constant increases in additional staff roles required by us Constant changes to our targets Advice to Management Slow down with the changes. Set realistic targets for stores.", "rating": 3, "pros": "Good friendly teams", "cons": "Too many changes since being bought by BT. I've worked for the company for 2 years. Our commission structure has changed twice both apparently as it will get us paid more but instead I've seen my paycheck decrease by 40%", "advice": "Slow down with the changes. Set realistic targets for stores."}, {"title": "innovative", "text": "Pros Innovative, great product development, open to new ideas Cons Little chance of development and moving upwards.", "rating": 5, "pros": "Innovative, great product development, open to new ideas", "cons": "Little chance of development and moving upwards.", "advice": null}, {"title": "Didn't fit in with the people I worked with", "text": "Pros Decent benefits scheme. Get to choose benefits which suited you. Flexible hours. 75% personal phone contract discount. Business phone if wanted instead. I would like to state my \"cons\" are based on LIFE Mobile only, and every time I dealt with EE HR, Payroll, etc, they were fantastic. I would probably work for EE again. Cons I worked for LIFE Mobile, Under EE contract. I was basically set up to leave because I didn't fit in with the people who worked there. They had all been together for years as Phones 4 U (EE bought this part of the business when it dissolved and left 20 people running it and couldn't care less about it). I found the people I worked with pretentious and felt that they were above me. I don't agree with how I was let go, I feel I was set up because the operations team wanted one of their mates from P4U in my job. A bunch of vile people, who decided that their personal friendships were better off than me feeding my family. My biggest regret was leaving quietly, and not putting in complaints. I felt like I was bullied in this job and singled out because I was different. The outsourced call centre staff were poisoned against me by two other colleagues who tried their best to make me not feel like a team and found it very difficult to work with them. I did receive some out of order email from staff there. I would also like to add that my manager ignored requests for a reference, which affected my next job. This is something they like to do and find funny. A girl left a few months before me and they were laughing about how they weren't going to write her a reference. Advice to Management Maybe mix up the staff, then maybe this issue wouldn't happen. Phones 4 U died for a reason.", "rating": 3, "pros": "Decent benefits scheme. Get to choose benefits which suited you. Flexible hours. 75% personal phone contract discount. Business phone if wanted instead.", "cons": "I worked for LIFE Mobile, Under EE contract. I was basically set up to leave because I didn't fit in with the people who worked there. They had all been together for years as Phones 4 U (EE bought this part of the business when it dissolved and left 20 people running it and couldn't care less about it). I found the people I worked with pretentious and felt that they were above me. I don't agree with how I was let go, I feel I was set up because the operations team wanted one of their mates from P4U in my job. A bunch of vile people, who decided that their personal friendships were better off than me feeding my family. My biggest regret was leaving quietly, and not putting in complaints. I felt like I was bullied in this job and singled out because I was different. The outsourced call centre staff were poisoned against me by two other colleagues who tried their best to make me not feel like a team and found it very difficult to work with them. I did receive some out of order email from staff there.", "advice": "Maybe mix up the staff, then maybe this issue wouldn't happen. Phones 4 U died for a reason."}, {"title": "Sales Advisor EE", "text": "Pros Great commissions and if you like making small talk with people great opportunity to sit down discuss with clients Cons Lack of development and very tunnel vision career", "rating": 5, "pros": "Great commissions and if you like making small talk with people great opportunity to sit down discuss with clients", "cons": "Lack of development and very tunnel vision career", "advice": null}, {"title": "Losing it's quirky, youthful feel", "text": "Pros Good benefits Flexible working hours Great location (central London) Nice people Cons Large with so many stakeholders (can feel very bureaucratic) Hard to get things moving or to know who to speak to Increasingly losing it's core identity after being swallowed by the BT machine (perks not as good and company cuts left right and centre)", "rating": 3, "pros": "Good benefits", "cons": "Large with so many stakeholders (can feel very bureaucratic)", "advice": null}, {"title": "Assistant manager", "text": "Pros Good bonus when performing. Great network. Cons They often move the goal posts post month end. Poor man management skills.", "rating": 3, "pros": "Good bonus when performing. Great network.", "cons": "They often move the goal posts post month end. Poor man management skills.", "advice": null}, {"title": "Great", "text": "Pros Lovely store, great team of people. Good training given. Good communication from head office and senior managers alike. Easy sales targets to achieve and decent bonus every quarter. Cons Houra of work but thats standard in retail. Nothing else Advice to Management More chances to move up into store management, because of lack of this is the reason i left.", "rating": 5, "pros": "Lovely store, great team of people. Good training given. Good communication from head office and senior managers alike. Easy sales targets to achieve and decent bonus every quarter.", "cons": "Houra of work but thats standard in retail. Nothing else", "advice": "More chances to move up into store management, because of lack of this is the reason i left."}, {"title": "Orange was better", "text": "Pros People who worked for the company Cons Company went downhill after the merger with T mobile Advice to Management get in with the right people and get promoted via friendships rather than competency", "rating": 3, "pros": "People who worked for the company", "cons": "Company went downhill after the merger with T mobile", "advice": "get in with the right people and get promoted via friendships rather than competency"}, {"title": "Great Company but.....", "text": "Pros Good benefits, Good work life balance, Great Offices at the newly refurbished Darlington site, good management for the most part. Cons Not great progression for people wanting to, Salary quite stagnant, not always listened to when providing feedback. Advice to Management More engagement from senior to mid level management would be great. Otherwise its a great place to work", "rating": 5, "pros": "Good benefits, Good work life balance, Great Offices at the newly refurbished Darlington site, good management for the most part.", "cons": "Not great progression for people wanting to, Salary quite stagnant, not always listened to when providing feedback.", "advice": "More engagement from senior to mid level management would be great. Otherwise its a great place to work"}, {"title": "Retail", "text": "Pros Great training, Money can be good in the right store. Cons commission is low for individual bonus unless rest of the team perform well, most money earned is from store 'value' bonus. individual KPI bonus is poor. Kiss goodbye to your weekends and bank holidays.", "rating": 3, "pros": "Great training, Money can be good in the right store.", "cons": "commission is low for individual bonus unless rest of the team perform well, most money earned is from store 'value' bonus. individual KPI bonus is poor.", "advice": null}, {"title": "Decent employers", "text": "Pros decent benefits, and treated well. Cons sometimes can be a bit disorganised", "rating": 5, "pros": "decent benefits, and treated well.", "cons": "sometimes can be a bit disorganised", "advice": null}, {"title": "good", "text": "Pros good place to work would reccomend Cons alot of customers sometimes , so long", "rating": 5, "pros": "good place to work would reccomend", "cons": "alot of customers sometimes , so long", "advice": null}, {"title": "Decent part-time job but can be tense and stressful", "text": "Pros Friends and family Discounts, nice pay if targets are over achieved, friendly environment, access to latest devices. Communicate with nice people and customers. Cons High targets sometimes, treatment of advisors during contract hours and outside by managers. Loss of moral values, hours outside work can still be work without your overtime consent. Competitive members can create politics and may try take sales off you", "rating": 3, "pros": "Friends and family Discounts, nice pay if targets are over achieved, friendly environment, access to latest devices. Communicate with nice people and customers.", "cons": "High targets sometimes, treatment of advisors during contract hours and outside by managers. Loss of moral values, hours outside work can still be work without your overtime consent. Competitive members can create politics and may try take sales off you", "advice": null}, {"title": "Poor Management, Good Commission", "text": "Pros good commission, good hourly wage  incentives are ok Cons -lots of pressure -systems that do not work -poor management", "rating": 3, "pros": "good commission, good hourly wage", "cons": "-lots of pressure", "advice": null}, {"title": "Not Great", "text": "Pros Nice people around, can be fair but strict. Reasonable pay with decent enough benefits. Cons Depends on the type of person you are, but you require to be able to deal with stress with little support if issues or irate customers arise. 'Gift of the gab' required! Very clicky.", "rating": 3, "pros": "Nice people around, can be fair but strict. Reasonable pay with decent enough benefits.", "cons": "Depends on the type of person you are, but you require to be able to deal with stress with little support if issues or irate customers arise. 'Gift of the gab' required!", "advice": null}, {"title": "super", "text": "Pros great and cool orgnanisation not a problem Cons none I have never been so distressed Advice to Management none", "rating": 5, "pros": "great and cool orgnanisation not a problem", "cons": "none I have never been so distressed", "advice": "none"}, {"title": "assistant manager", "text": "Pros great commission with good structure Cons long hours that effects work life balance Advice to Management make targets fair", "rating": 3, "pros": "great commission with good structure", "cons": "long hours that effects work life balance", "advice": "make targets fair"}, {"title": "Absolutely shocking", "text": "Pros The money for hours worked Cons They don't believe you are ill, the managers make mistakes and the punish you, statory sick pay is set at £89.45 a week and that's working 3,4,5,6,7 days a week it makes no difference but I bet if you checked your payslips you would find this Glorious company has a ripped you off even tho you work for them, when problems arise the company claims to care but I assure you this is not the case, I think if the workers of ee really understood the law then this company would be in a real bad way just like it's mother company bt with ofcom lately. Let's hope this new investigation into ee by ofcom hits them with the fine they deserve. Advice to Management Listen to the situation of your staff and understand things aren't always the same, stop bullying the staff of this company with its faceless HR and lies about a happy workforce. I notice you was in the paper lately for hiring 60 people but did you inform the press of the many staff that have recently been let go by the same office that claimed it made jobs. All lies and it's time to stop", "rating": 1, "pros": "The money for hours worked", "cons": "They don't believe you are ill, the managers make mistakes and the punish you, statory sick pay is set at £89.45 a week and that's working 3,4,5,6,7 days a week it makes no difference but I bet if you checked your payslips you would find this Glorious company has a ripped you off even tho you work for them, when problems arise the company claims to care but I assure you this is not the case, I think if the workers of ee really understood the law then this company would be in a real bad way just like it's mother company bt with ofcom lately. Let's hope this new investigation into ee by ofcom hits them with the fine they deserve.", "advice": "Listen to the situation of your staff and understand things aren't always the same, stop bullying the staff of this company with its faceless HR and lies about a happy workforce."}, {"title": "Account Director EE Wholesale", "text": "Pros Great team spirit and pay package Cons 6 rolling month redundancies Advice to Management Invest in your people more and try and retain the heavy hitters", "rating": 5, "pros": "Great team spirit and pay package", "cons": "6 rolling month redundancies", "advice": "Invest in your people more and try and retain the heavy hitters"}, {"title": "Stressful", "text": "Pros Variety Possible bonus Daily feedback Company perks Customer service Cons Bonus scheme near impossible to hit Mixed messages from management Stressful Work life balance Holidays are near impossible to book Advice to Management Rethink how you treat staff and understand some things are too difficult to achieve.", "rating": 3, "pros": "Variety", "cons": "Bonus scheme near impossible to hit", "advice": "Rethink how you treat staff and understand some things are too difficult to achieve."}, {"title": "Senior Customer Adviser", "text": "Pros Great people, team members and staff Cons pressure from managers on hitting KPI", "rating": 3, "pros": "Great people, team members and staff", "cons": "pressure from managers on hitting KPI", "advice": null}, {"title": "Not a fan", "text": "Pros Dress code is relaxed, people are nice, some discounts Cons Hard targets to hit and knowledge management system is not great. Advice to Management Not sure if the targets have changed but not great", "rating": 3, "pros": "Dress code is relaxed, people are nice, some discounts", "cons": "Hard targets to hit and knowledge management system is not great.", "advice": "Not sure if the targets have changed but not great"}, {"title": "Great company (Pre BT acquisition)", "text": "Pros Great people, fabulous spirit - trusted people to do their jobs and let them get on with it! Cons Can't comment post BT takeover Advice to Management Hope they have kept the entrepreneurial spirit", "rating": 5, "pros": "Great people, fabulous spirit - trusted people to do their jobs and let them get on with it!", "cons": "Can't comment post BT takeover", "advice": "Hope they have kept the entrepreneurial spirit"}, {"title": "Head Office Marketing", "text": "Pros Laid back environment Good work life balance Ability to move roles internally easily. Cons Pay is mediocre Meeting heavy culture Too many people doing similar roles A lot of below average senior management Too many levels of management Poor data and systems Advice to Management Streamline the workforce Invest in systems less meetings", "rating": 3, "pros": "Laid back environment", "cons": "Pay is mediocre", "advice": "Streamline the workforce"}, {"title": "its only a job", "text": "Pros great benefits package and great discounts on personal devices excellent people to work with free parking and free tea, coffee and water ed or the Cons lots of pressure which is felt at every level from agent up over. every level has targets to meet to much focus on individuals rather then what the whole team/area achieve - horrible performance management policy which neither helps the person being managed o the manager having to implement - lots of inconsistency Advice to Management bring in a central department to deal with performance management and sickness - this would mean consistency and also managers and staff to work together and build better relationships", "rating": 3, "pros": "great benefits package and great discounts on personal devices excellent people to work with free parking and free tea, coffee and water ed or the", "cons": "lots of pressure which is felt at every level from agent up over. every level has targets to meet to much focus on individuals rather then what the whole team/area achieve - horrible performance management policy which neither helps the person being managed o the manager having to implement - lots of inconsistency", "advice": "bring in a central department to deal with performance management and sickness - this would mean consistency and also managers and staff to work together and build better relationships"}, {"title": "Good place to work", "text": "Pros Good salary and benefits and opportunity to progress within the company. Also, it was interesting to be working on a range of different issues. Cons The long shifts with late finishes made travelling to and from work a challenge, especially if it was necessary to stay late due to over-running phone calls or similar.", "rating": 3, "pros": "Good salary and benefits and opportunity to progress within the company. Also, it was interesting to be working on a range of different issues.", "cons": "The long shifts with late finishes made travelling to and from work a challenge, especially if it was necessary to stay late due to over-running phone calls or similar.", "advice": null}, {"title": "sales assistant", "text": "Pros good benefits, fun environment, Cons many hoops and loops to actually reach your targets but good pay out once hit", "rating": 5, "pros": "good benefits, fun environment,", "cons": "many hoops and loops to actually reach your targets but good pay out once hit", "advice": null}, {"title": "Hardcore selling, not for everyone", "text": "Pros Great bonuses and benefits, some good characters Cons Its not about the people, its about the numbers. Spent too much time sorting out issues caused by customer services. Advice to Management Yes there needs to be targets but create the culture of achieving these the right way. Too many of the Regional Managers give the corporate lines but then want you to \"do whatever it takes\" to get the job done.", "rating": 3, "pros": "Great bonuses and benefits, some good characters", "cons": "Its not about the people, its about the numbers. Spent too much time sorting out issues caused by customer services.", "advice": "Yes there needs to be targets but create the culture of achieving these the right way. Too many of the Regional Managers give the corporate lines but then want you to \"do whatever it takes\" to get the job done."}, {"title": "Loved it", "text": "Pros Loved the store and the people I worked with. Everyone was super friendly and the staff discount was amazing. Cons The management of the store wasn't great and kept on changing regularly, making it impossible for them to stamp their mark. Advice to Management Make sure you stick around to make your mark rather than changing every couple of months and people still stuck in their ways.", "rating": 5, "pros": "Loved the store and the people I worked with. Everyone was super friendly and the staff discount was amazing.", "cons": "The management of the store wasn't great and kept on changing regularly, making it impossible for them to stamp their mark.", "advice": "Make sure you stick around to make your mark rather than changing every couple of months and people still stuck in their ways."}, {"title": "Overall good but pushy to hit targets", "text": "Pros Company benefits: Free 4G contracts plus 10 40% off for friends and family. I believe this has changed to 30% Cons Pushy to hit monthly targets, especially with Home broadband. Lot's of missing just to hit targets especially informing the customer that they can cancel within 14 days that way customer gets a discount on handset on new/upg connection. Advice to Management Be flexible and realistic with targets", "rating": 5, "pros": "Company benefits: Free 4G contracts plus 10 40% off for friends and family. I believe this has changed to 30%", "cons": "Pushy to hit monthly targets, especially with Home broadband. Lot's of missing just to hit targets especially informing the customer that they can cancel within 14 days that way customer gets a discount on handset on new/upg connection.", "advice": "Be flexible and realistic with targets"}, {"title": "Project Manager", "text": "Pros great opportunities for development, great recognition packages. advanced from a retail sales advisor through to branch manager and on to Project Implementation for EE's Property department. Cons more forward planning required for training and and identification of what training would be useful to compliment each role.", "rating": 5, "pros": "great opportunities for development, great recognition packages. advanced from a retail sales advisor through to branch manager and on to Project Implementation for EE's Property department.", "cons": "more forward planning required for training and and identification of what training would be useful to compliment each role.", "advice": null}, {"title": "It all depends on the management you're under.", "text": "Pros Most people on the same level as you are very friendly and very sociable and will help you with anything you need. If you push yourself the commission is very rewarding. Depending on where you are working the hours aren't too bad. There are a lot of benefits that the company offer. Cons Depending on what manager you are working under your work life can be a breeze or it can be a living hell. Everyone above you thinks they are better than you, the company gives higher management a strong case of 'massive head syndrome' More of a life lesson: don't ever do anyone a favour because you won't get anything back. If you miss even slightly on your targets you'll be seriously knocked in confidence as everyone will put you down. Advice to Management Treat your customer advisors with more respect. Just because they aren't hitting targets every day it doesn't mean they aren't doing their jobs properly.", "rating": 3, "pros": "Most people on the same level as you are very friendly and very sociable and will help you with anything you need.", "cons": "Depending on what manager you are working under your work life can be a breeze or it can be a living hell.", "advice": "Treat your customer advisors with more respect. Just because they aren't hitting targets every day it doesn't mean they aren't doing their jobs properly."}, {"title": "Sales adviser", "text": "Pros Perminant contract freindly environment approachable Cons Steessfull targets, shifts are not home & work realistic, flexi really difficult and lengthy more business orientated not personal Advice to Management Less pressure for targets & to make them more achievable, less time sitting in one possition without when shifts are 10 & 12hrs long not good on body or eyes", "rating": 3, "pros": "Perminant contract freindly environment approachable", "cons": "Steessfull targets, shifts are not home & work realistic, flexi really difficult and lengthy more business orientated not personal", "advice": "Less pressure for targets & to make them more achievable, less time sitting in one possition without when shifts are 10 & 12hrs long not good on body or eyes"}, {"title": "Ee", "text": "Pros Good rewards, great wage, great employees Cons Long hours, strict targets to hit", "rating": 5, "pros": "Good rewards, great wage, great employees", "cons": "Long hours, strict targets to hit", "advice": null}, {"title": "Custome Advisor", "text": "Pros Decent discount on personal device plan, the people you work with. Cons Unrealistic sales targets, low number of staff at all branches. Unrealistic time scale to set up and complete a sale. Advice to Management Work with your team members to achieve results , don't just dictate telling them they're rubbish for not hitting target", "rating": 1, "pros": "Decent discount on personal device plan, the people you work with.", "cons": "Unrealistic sales targets, low number of staff at all branches. Unrealistic time scale to set up and complete a sale.", "advice": "Work with your team members to achieve results , don't just dictate telling them they're rubbish for not hitting target"}, {"title": "Sales consultant", "text": "Pros Good company to work for with great benefits while working for them great opportunity to make money Cons Have to be think skinned as you are dealing with the public can become stressful at times as it is a very fast paced environment Advice to Management Managers can sometimes put a lot of pressure on staff to hit target as it is a very target driven business sometimes need to be a bit patient", "rating": 5, "pros": "Good company to work for with great benefits while working for them great opportunity to make money", "cons": "Have to be think skinned as you are dealing with the public can become stressful at times as it is a very fast paced environment", "advice": "Managers can sometimes put a lot of pressure on staff to hit target as it is a very target driven business sometimes need to be a bit patient"}, {"title": "Good company", "text": "Pros Fun place to , with nice people Cons Can be difficult at times Advice to Management Give constant feedback", "rating": 5, "pros": "Fun place to , with nice people", "cons": "Can be difficult at times", "advice": "Give constant feedback"}, {"title": "wasteful", "text": "Pros barely any apart from discounted phone/tablet plans Cons care about staff more and do not keep changing commission schemes to help yourselves", "rating": 3, "pros": "barely any apart from discounted phone/tablet plans", "cons": "care about staff more and do not keep changing commission schemes to help yourselves", "advice": null}, {"title": "Director of WiFi", "text": "Pros big company, very profitable, could do lots of things outside of basic Mobile tariffs, e.g. WiFi, IOT, use Mobile Data for analytics and engagement. Cons Not much interest in things outside Mobile, they start initiatives, e.g. WiFi / Weave, but drop them as soon as things get tough, wasting time, talent and money Advice to Management Stick to the knitting, i.e. Mobile tariffs or invest in new initiatives properly, with a long term view, this wasn't possible under DT / FT control, maybe under BT", "rating": 3, "pros": "big company, very profitable, could do lots of things outside of basic Mobile tariffs, e.g. WiFi, IOT, use Mobile Data for analytics and engagement.", "cons": "Not much interest in things outside Mobile, they start initiatives, e.g. WiFi / Weave, but drop them as soon as things get tough, wasting time, talent and money", "advice": "Stick to the knitting, i.e. Mobile tariffs or invest in new initiatives properly, with a long term view, this wasn't possible under DT / FT control, maybe under BT"}, {"title": "Backwards management", "text": "Pros Hardly any really, nope, none Cons Backstabbing and unprofessional, it's like brig back at school, managers are the worst of the bunch. High pressure unethical selling. Poor customer service. No tewm work between multi channels, CS hate store staff and vice versa. EE constantly playing catch up with the completion, almost expensive on he high street and customer know it, will happily go elsewhere (CPW) for the same deal, just cheaper but still on EE. EE don't care, they still get the connection through CPW, cheaper for them than paying in store staff. High turnover of staff, nobody really seems to care. Advice to Management Just start again, back to basics, listen to the staff on the front line! Sort out the awful systems, there's no excuse, if all the other networks can have single application programmes for the whole sales journey, then surely EE can, as opposed to using 6 different programmes dating back to the early 2000's", "rating": 3, "pros": "Hardly any really, nope, none", "cons": "Backstabbing and unprofessional, it's like brig back at school, managers are the worst of the bunch. High pressure unethical selling. Poor customer service. No tewm work between multi channels, CS hate store staff and vice versa. EE constantly playing catch up with the completion, almost expensive on he high street and customer know it, will happily go elsewhere (CPW) for the same deal, just cheaper but still on EE. EE don't care, they still get the connection through CPW, cheaper for them than paying in store staff. High turnover of staff, nobody really seems to care.", "advice": "Just start again, back to basics, listen to the staff on the front line! Sort out the awful systems, there's no excuse, if all the other networks can have single application programmes for the whole sales journey, then surely EE can, as opposed to using 6 different programmes dating back to the early 2000's"}, {"title": "Lyons lead by donkeys !", "text": "Pros The staff who did the actual work were generally excellent and got things done especially in the call centres. When targets were hit the pay was half decent. Cons The management were of an easily lead sheepish nature that would not disagree with their almost holy as they regarded her , leader, even though she and the area business managers were only there as they couldn't sell themselves so they became managers. Selling mobile phones was treated like a religion, \"scientology\" comes to mind, if you weren't jumping up and down on a sofa you were regarded as negative and needed to be taught a lesson and put on a disciplinary. Due to the scientology like atmosphere it was a very strange and unusual atmosphere to work in. Even though the targets were rediculously high and sometimes even achieved no support or praise was ever given. The managers seemed to think they owned the company when like the actual workers who generate the money they were simply employees. Public humiliation was a tactic often used by the head of sales which often backfired on her when high achievers simply left the business - totally counterproductive and made her look rediculous. Often noticed managers trying to emotionally blackmail the staff ie . your costing me lost commission , taking up space , so please leave so I don't have to do the HR paperwork because your lazy. Even though you have some great players if they aren't performing its probably due to the management . Advice to Management In Sales management most of the mid level managers have no guts and just repeat what those above them say as they realise they can't do any better in life and have already reached their level ! Get an education, admit it most of you are ex photocopier , double glazing , used car type salesmen that can't do any better !! Stop with the trying to con good honest British businesses through your many tricks and scams Managers were often in the pub on Fridays when people were working, they never even hid this when talking to staff . What message does this send ? you don't care ?", "rating": 3, "pros": "The staff who did the actual work were generally excellent and got things done especially in the call centres.", "cons": "The management were of an easily lead sheepish nature that would not disagree with their almost holy as they regarded her , leader, even though she and the area business managers were only there as they couldn't sell themselves so they became managers.", "advice": "In Sales management most of the mid level managers have no guts and just repeat what those above them say as they realise they can't do any better in life and have already reached their level !"}, {"title": "Retail Business Consultant", "text": "Pros The largest telecoms company as it is part of BT Group, one of the best services and network in the UK great and easy product to sell. Cons Still my current employer but policies at work are constantly changing, a lot of confusion due to the BT takeover.", "rating": 3, "pros": "The largest telecoms company as it is part of BT Group, one of the best services and network in the UK great and easy product to sell.", "cons": "Still my current employer but policies at work are constantly changing, a lot of confusion due to the BT takeover.", "advice": null}, {"title": "Excellent", "text": "Pros Great team, great environment, excellent management Cons None to say so far", "rating": 5, "pros": "Great team, great environment, excellent management", "cons": "None to say so far", "advice": null}, {"title": "EE", "text": "Pros Great atmosphere, colleagues and benfits Cons really love every minute of it", "rating": 5, "pros": "Great atmosphere, colleagues and benfits", "cons": "really love every minute of it", "advice": null}, {"title": "EE great to work for but not BT", "text": "Pros EE felt like a young company Cons BT pushed processes and method on EE", "rating": 5, "pros": "EE felt like a young company", "cons": "BT pushed processes and method on EE", "advice": null}, {"title": "My Strange Experience as a Customer Advisor", "text": "Pros The only good benefit is the 75% off a contract. However if you leave the company you lose the discount so i just decided to stay with giffgaff. #ilovegiffgaff Cons Everyone that works for EE lives and breathes the company. I think it's all too much. Firstly I had to do loads of online questions etc to get accepted. I then go to an interview and am faced with over 7 regional managers. After being successful I was then sent to a different city for a week to 'train'. I met some nice people but listening to someone talk at you for a week isn't going to really stay in your head! It felt pointless and my group nor I felt we were ready! Then after this tedious experience you train in a buddy store- three more weeks of being talked at by someone who is pretty much in love with EE. I liked the company before people starting to be so over the top. I am a student, so thought it would be a great side job as I heard about commission etc. Anyway, I finally started in my actual store after all of that- I was confused at why there was so much effort for a 7.47 an hour job. I th n started in store and it was fine. But there's a weird vibe in store for some reason, a lot of egotistical but in a chirpy way work for this company. Don't bother applying if you have a creative mind and don't want to work for 'the man'. I quit 2 weeks after starting in store because my boss suddenly gave me massive targets and I felt so unready. I am also not the type of person to rip off people-- something you NEED to be able to do. A lot of people love working for EE, but I unfortunately was not one. Advice to Management The company is too robotic.", "rating": 3, "pros": "The only good benefit is the 75% off a contract. However if you leave the company you lose the discount so i just decided to stay with giffgaff. #ilovegiffgaff", "cons": "Everyone that works for EE lives and breathes the company. I think it's all too much. Firstly I had to do loads of online questions etc to get accepted. I then go to an interview and am faced with over 7 regional managers. After being successful I was then sent to a different city for a week to 'train'. I met some nice people but listening to someone talk at you for a week isn't going to really stay in your head! It felt pointless and my group nor I felt we were ready! Then after this tedious experience you train in a buddy store- three more weeks of being talked at by someone who is pretty much in love with EE. I liked the company before people starting to be so over the top. I am a student, so thought it would be a great side job as I heard about commission etc. Anyway, I finally started in my actual store after all of that- I was confused at why there was so much effort for a 7.47 an hour job. I th n started in store and it was fine. But there's a weird vibe in store for some reason, a lot of egotistical but in a chirpy way work for this company. Don't bother applying if you have a creative mind and don't want to work for 'the man'. I quit 2 weeks after starting in store because my boss suddenly gave me massive targets and I felt so unready. I am also not the type of person to rip off people-- something you NEED to be able to do. A lot of people love working for EE, but I unfortunately was not one.", "advice": "The company is too robotic."}, {"title": "Great friendly company but does depend on store morale", "text": "Pros Enjoyed the longest stint I had working with the company, and as long as you are with other friendly, like-minded people who wish to do well, it will be loads of fun. Sometimes stressful, but it is a sales job. Your efforts will see you rewarded with commission/bonus/happy managers Cons Sometimes stressful and slow when the store isn't busy. Some stores can be less enjoyable than others Advice to Management Change the targeting system - actually look at current store performance instead of basing targets on 3-4 years prior.", "rating": 5, "pros": "Enjoyed the longest stint I had working with the company, and as long as you are with other friendly, like-minded people who wish to do well, it will be loads of fun. Sometimes stressful, but it is a sales job. Your efforts will see you rewarded with commission/bonus/happy managers", "cons": "Sometimes stressful and slow when the store isn't busy. Some stores can be less enjoyable than others", "advice": "Change the targeting system - actually look at current store performance instead of basing targets on 3-4 years prior."}, {"title": "Sales advisor", "text": "Pros Staff helpful, very good opportunity to make money, I doubled my pay most months with commission! Cons Can be stressful if a busy store Advice to Management Don't promise incentives without delivering", "rating": 5, "pros": "Staff helpful, very good opportunity to make money, I doubled my pay most months with commission!", "cons": "Can be stressful if a busy store", "advice": "Don't promise incentives without delivering"}, {"title": "A view from Marketing.", "text": "Pros Smart people. Clear strategy. Regular achievements and bonus. Market leader and reasonable work life balance. Staff treated pretty well overall. Increased focus on the customer of late. Cons Becoming more political post BT takeover. Lacking the previous agility. Tricky to manage career development beyond Head of level. Many systems and processes are surprisingly out dated.", "rating": 5, "pros": "Smart people. Clear strategy. Regular achievements and bonus. Market leader and reasonable work life balance. Staff treated pretty well overall. Increased focus on the customer of late.", "cons": "Becoming more political post BT takeover. Lacking the previous agility. Tricky to manage career development beyond Head of level. Many systems and processes are surprisingly out dated.", "advice": null}, {"title": "Good company", "text": "Pros The company is great to work for, friendly and helpful people and good opportunities. Cons Environment can be stressful at times.", "rating": 5, "pros": "The company is great to work for, friendly and helpful people and good opportunities.", "cons": "Environment can be stressful at times.", "advice": null}, {"title": "Great company to work for", "text": "Pros Great benefits and great people to work with. Very innovative company to work for and they are always looking ahead into the future Cons Like with any company with such a volume of employees there is always a few bad apples, however the support available is exceptional to tackle any issues. Advice to Management More recognition would be good and sometimes hard work above and beyond your outlined role goes missed. Career opportunities are getting better but progression within your career can become very stagnant", "rating": 5, "pros": "Great benefits and great people to work with. Very innovative company to work for and they are always looking ahead into the future", "cons": "Like with any company with such a volume of employees there is always a few bad apples, however the support available is exceptional to tackle any issues.", "advice": "More recognition would be good and sometimes hard work above and beyond your outlined role goes missed. Career opportunities are getting better but progression within your career can become very stagnant"}, {"title": "I should have left sooner then I did", "text": "Pros Salary was good. I liked some of the people I worked with. Working in Retail Support. Friends and family discount. Perks. Cons Long shifts and not enough breaks. It was not what you know, its who you know to get up the ladder or to be promoted to team leader. Opportunities to do offline work wasn't delegated equally. Too much favouritism. NBA was a pain. Using Albert was a pain. Transferring to other depts was very difficult, no one will take the call and will fob you off or hang up on you. Advice to Management Follow through with plans. Keep on track with staff performances, I know I went long periods without any reviews or one to ones and I was there 6 years. NBA is not always the answer to customers problems. Stop making it a big deal, customers just want there issues resolved.", "rating": 3, "pros": "Salary was good.", "cons": "Long shifts and not enough breaks.", "advice": "Follow through with plans."}, {"title": "Working for the Egnaro EE Franchise", "text": "Pros Good comission structure, Fair basic as well. By far the most money a bottom of the pile employee will make on the high street. It is not unusual to to recieve monthly commision that is 50% or higher on top of your basic wage if the store and yourself are doing well. Store managers are hands on and everyone wants eachother to make money as managers are given bonus on store performance and dont make commisson on sales themselves so will try to make sure sales are pushed onto advisors and that no sinlge advisor is stealing customers of others. Cons Work life balance isnt great. Rarely can get Saturdays or Sundays off. Break is only half an hour and you have to be instore at 9am but leave at 6pm. Targets are often un reasonable but don't let them put you off or stress you out as they are just an aim not a precaution unless your miles off them. Store managers and advisors will get the blame for lack of new business regardless of the fact 80% of the people who approach the store are timewasters. Advice to Management Be more realistic with targets and look into different aspects when setting them. My store is near a mental health center and therefore we have a lot of unwell people entering the store and being added to the footfall counter but are not capable of buying anything.", "rating": 5, "pros": "Good comission structure, Fair basic as well. By far the most money a bottom of the pile employee will make on the high street. It is not unusual to to recieve monthly commision that is 50% or higher on top of your basic wage if the store and yourself are doing well. Store managers are hands on and everyone wants eachother to make money as managers are given bonus on store performance and dont make commisson on sales themselves so will try to make sure sales are pushed onto advisors and that no sinlge advisor is stealing customers of others.", "cons": "Work life balance isnt great. Rarely can get Saturdays or Sundays off. Break is only half an hour and you have to be instore at 9am but leave at 6pm. Targets are often un reasonable but don't let them put you off or stress you out as they are just an aim not a precaution unless your miles off them. Store managers and advisors will get the blame for lack of new business regardless of the fact 80% of the people who approach the store are timewasters.", "advice": "Be more realistic with targets and look into different aspects when setting them. My store is near a mental health center and therefore we have a lot of unwell people entering the store and being added to the footfall counter but are not capable of buying anything."}, {"title": "EE Customer Services", "text": "Pros Good Pay Adequate Breaks Opportunities for progression within the right teams Cons Management only look after management", "rating": 5, "pros": "Good Pay", "cons": "Management only look after management", "advice": null}, {"title": "Very Challenging environment", "text": "Pros Good Basic pay. They do pay much more than other mobile phone retailers. Cons Targets stretched, poor commission, and a lot of miss selling.", "rating": 1, "pros": "Good Basic pay. They do pay much more than other mobile phone retailers.", "cons": "Targets stretched, poor commission, and a lot of miss selling.", "advice": null}, {"title": "ee good to work for", "text": "Pros Good atmosphere decent slary with a not too bad bonus scheme Cons Difficult to understand ever changing policies Advice to Management Not a lot to say really. Always seem helpful however can sometimes offer conflicting advice on issues", "rating": 5, "pros": "Good atmosphere decent slary with a not too bad bonus scheme", "cons": "Difficult to understand ever changing policies", "advice": "Not a lot to say really. Always seem helpful however can sometimes offer conflicting advice on issues"}, {"title": "Great if you work in a performing store", "text": "Pros 75% off personal phone contract. Great team to work with Cons Too much pressure. Targets based on profit made on a store level Commission has been cut for the majority of sales people yet company profits in retail has soared in the last few years meaning only the top 5% of sales people actually benefit. If you dont earn your bonus yet make 40k profit you are basically on minimum wage.", "rating": 3, "pros": "75% off personal phone contract.", "cons": "Too much pressure.", "advice": null}, {"title": "Exporting jobs", "text": "Pros Very good collaborative company. Most people were focused on the best interests of the company and worked in a positive fashion getting excellent results. Cons After the BT acquisition the bean counters have taken over. So, jobs are actively being off-shored which is bound to back fire both for the national economy and efficiency, but the short term savings will look good! I watched people being flown in from overseas, to be trained to replace me while I worked my notice. Advice to Management Exporting Project Manager roles does not make sense on any level, culturally or geographically. If you want a job doing correctly, then give the job to the correct person.", "rating": 1, "pros": "Very good collaborative company. Most people were focused on the best interests of the company and worked in a positive fashion getting excellent results.", "cons": "After the BT acquisition the bean counters have taken over. So, jobs are actively being off-shored which is bound to back fire both for the national economy and efficiency, but the short term savings will look good! I watched people being flown in from overseas, to be trained to replace me while I worked my notice.", "advice": "Exporting Project Manager roles does not make sense on any level, culturally or geographically. If you want a job doing correctly, then give the job to the correct person."}, {"title": "Software Engineer", "text": "Pros Bonus, Business Phone, Many Benefits, Progression. Cons There are none that I can immediately think of.", "rating": 5, "pros": "Bonus, Business Phone, Many Benefits, Progression.", "cons": "There are none that I can immediately think of.", "advice": null}, {"title": "Retail Advisor EE", "text": "Pros Good staff line discount Ability to make a lot more money than your standard pay rate Cons New commision scheme makes it a lot harder to earn money Management too focused on sales targets over customer service Advisors sometimes doing much more than they are paid for, in regards to senior and management team Advice to Management Focus more on customer service in store, stop pushing for unethical sales", "rating": 3, "pros": "Good staff line discount", "cons": "New commision scheme makes it a lot harder to earn money", "advice": "Focus more on customer service in store, stop pushing for unethical sales"}, {"title": "Nice place to work. But a bit confused on strategy after BT acquisition", "text": "Pros Nice environment. Intelligent staff, cooperative workmates. The office at Paddington is also light filled and pleasant, and well located. I single also day that contractors they hire are top notch Cons BT acquisition means lots of coming redundancies and strategy forward seems muddled. BT is changing the value and innovation of EE I felt. Insufficient resources sometimes especially in terms of meeting rooms.", "rating": 5, "pros": "Nice environment. Intelligent staff, cooperative workmates. The office at Paddington is also light filled and pleasant, and well located. I single also day that contractors they hire are top notch", "cons": "BT acquisition means lots of coming redundancies and strategy forward seems muddled. BT is changing the value and innovation of EE I felt. Insufficient resources sometimes especially in terms of meeting rooms.", "advice": null}, {"title": "OK for some, spoilt by some bad staff", "text": "Pros Fair recruitment process that focuses on ability rather then background. Great benefits and wages are above average for the industry Cons Some of the support staff (mostly ones who have been there some time) are appalling in their handling of customers. Truly shocking attitude to customers who have genuine issues with their billing etc. Advice to Management Management are already focusing on improving customer service, long way to go.", "rating": 3, "pros": "Fair recruitment process that focuses on ability rather then background. Great benefits and wages are above average for the industry", "cons": "Some of the support staff (mostly ones who have been there some time) are appalling in their handling of customers. Truly shocking attitude to customers who have genuine issues with their billing etc.", "advice": "Management are already focusing on improving customer service, long way to go."}, {"title": "A new company", "text": "Pros Great focus on team spirit in certain areas of the business Despite its size the company had a great culture Due to mergers and new branding there was never a dull moment A chance to push and learn in new areas Great friendly people (mostly) Cons Sometimes lacked the speed at decision making leaving work frustrating Constant restructures and redundancies Advice to Management Keep the EE culture and freedom going and focus more on the customer rather than internal budget saving", "rating": 3, "pros": "Great focus on team spirit in certain areas of the business", "cons": "Sometimes lacked the speed at decision making leaving work frustrating", "advice": "Keep the EE culture and freedom going and focus more on the customer rather than internal budget saving"}, {"title": "Great place to work", "text": "Pros Progressive and vibrant organisation growing in reputation and success at the hands of the CEO Olaf Swantee. Felt really part of an organisation to be proud of. Cons Shifted a lot of jobs to Bristol (old Orange office) so Hatfield lost its buzz and feeling of importance.", "rating": 5, "pros": "Progressive and vibrant organisation growing in reputation and success at the hands of the CEO Olaf Swantee. Felt really part of an organisation to be proud of.", "cons": "Shifted a lot of jobs to Bristol (old Orange office) so Hatfield lost its buzz and feeling of importance.", "advice": null}, {"title": "Overall good place to work", "text": "Pros Team all really friendly and motivating, made loads of good friends. Everyday is different and exciting, you'll never get bored. Target driven which makes a competitive but fun environment at work. Pay is really really good + un capped commission! Cons NPS (customer service scores ) If you get a few bad scores (8 or 7) you loose 20% or even 50% of your commission so just make sure every customer you tell them about the text they will receive where they have to score you out of ten! At times managers can put a lot of pressure on you to sell bundles and add ons where sometimes customers just want to come in and upgrade there phone, not leave with a new ipad and broadband! Advice to Management Keep motivating the team, make work and the selling side of things seem fun and competitive. Don't push your employees too hard to sell, make them WANT to go out there and sell.", "rating": 5, "pros": "Team all really friendly and motivating, made loads of good friends.", "cons": "NPS (customer service scores ) If you get a few bad scores (8 or 7) you loose 20% or even 50% of your commission so just make sure every customer you tell them about the text they will receive where they have to score you out of ten!", "advice": "Keep motivating the team, make work and the selling side of things seem fun and competitive. Don't push your employees too hard to sell, make them WANT to go out there and sell."}, {"title": "Decent, but at a cost", "text": "Pros Amazing pay (If you're in a big store and hit numbers, you could be earning 2 grand plus a month, which is ridiculous) Great team atmosphere Personal line @ 75% off is an absolute winner and 5 friends and family discounts Cons Targets are too demanding and don't change if you're understaffed. If you just put through an upgrade you're 'not a good seller' - bearing in mind EE's prices are higher anyway, try giving someone a tablet and silly wifi camera on top of an already inflated price Forced to rampantly mis-sell, which drains yourself of a good conscience, but you have to otherwise.... (Moving on to next point) Managers know how to make you leave, or you get three months. Regional manager is a typical sales manager with a 'don't matter this is sales pull a sale out of your backside or get out of my face' attitude. The 'Loyal Customer' conversation with customers. phone shop guys know. No form of retentions in-store Advice to Management Develop a better methodology about KPIS and selling - not about getting as many itty bitty new connections to make your store look slightly better than the next. Regional Group is all about pointless sexual organ measuring and its embarrassing.", "rating": 3, "pros": "Amazing pay (If you're in a big store and hit numbers, you could be earning 2 grand plus a month, which is ridiculous)", "cons": "Targets are too demanding and don't change if you're understaffed.", "advice": "Develop a better methodology about KPIS and selling - not about getting as many itty bitty new connections to make your store look slightly better than the next. Regional Group is all about pointless sexual organ measuring and its embarrassing."}, {"title": "Assistant Manager", "text": "Pros Great pay scheme with plenty of opportunity to progress internally. Cons Weekend working isn't for everyone, but is to be expected within a retail company.", "rating": 5, "pros": "Great pay scheme with plenty of opportunity to progress internally.", "cons": "Weekend working isn't for everyone, but is to be expected within a retail company.", "advice": null}, {"title": "Chrome PSG", "text": "Pros Best company I've worked for for a number of reasons. The company, although spread over 8 franchise stores feels like a big squad. You are pushed to succeed from the moment you start, opportunity to progress is like no other, and the incentives regularly on offer are second to none. Overall a great company ran at the back by a top group of people and lead on the floor by hungry driven sales professionals. Cons not a con but more advice, you need to have 100% drive and motivation to want to succeed every day in this job. It's a lot of fun but internal motivation and grit will hold you in good stead Advice to Management My only advice to management would be that sometimes for valid reasons we employ quantity over quality, I'd make the interview/training slightly more rigourous", "rating": 5, "pros": "Best company I've worked for for a number of reasons. The company, although spread over 8 franchise stores feels like a big squad. You are pushed to succeed from the moment you start, opportunity to progress is like no other, and the incentives regularly on offer are second to none. Overall a great company ran at the back by a top group of people and lead on the floor by hungry driven sales professionals.", "cons": "not a con but more advice, you need to have 100% drive and motivation to want to succeed every day in this job. It's a lot of fun but internal motivation and grit will hold you in good stead", "advice": "My only advice to management would be that sometimes for valid reasons we employ quantity over quality, I'd make the interview/training slightly more rigourous"}, {"title": "EE - Chrome PSG franchise - AVOID", "text": "Pros Not many really. They say commission is good but all you see is people getting sacked for no reason which isn't secure Cons The owners throw their money in your face, and do everything possible to claw back commission to boost their bank balances even more. They don't stick to their word and I regret joining Advice to Management Think of your staff not your own pockets", "rating": 1, "pros": "Not many really. They say commission is good but all you see is people getting sacked for no reason which isn't secure", "cons": "The owners throw their money in your face, and do everything possible to claw back commission to boost their bank balances even more. They don't stick to their word and I regret joining", "advice": "Think of your staff not your own pockets"}, {"title": "Chrome PSG Franchise Group", "text": "Pros Very enjoyable workplace and colleagues with great unexpected perks! Internal promotions are always look at over external enabling a solid career path. Higher basic than most high street stores great commission structure Cons It can be long hours of the day depending on commute and you will most likely be working weekends. Some like it and some don't so may not be a con really. Advice to Management I think better communication between stores and the office would be a benefit. Other than that the company has been making great improvements recently.", "rating": 5, "pros": "Very enjoyable workplace and colleagues with great unexpected perks!", "cons": "It can be long hours of the day depending on commute and you will most likely be working weekends. Some like it and some don't so may not be a con really.", "advice": "I think better communication between stores and the office would be a benefit. Other than that the company has been making great improvements recently."}, {"title": "Chrome", "text": "Pros Great place to work, Great support from management and fantastic opportunities to progress. Cons No cons that I have come across as of yet. Advice to Management None", "rating": 5, "pros": "Great place to work, Great support from management and fantastic opportunities to progress.", "cons": "No cons that I have come across as of yet.", "advice": "None"}, {"title": "Great Company", "text": "Pros Great, detailed & well paid training. 25 days holiday pro-rata & increases as you stay with the company longer. Amazing benefits such as life assurance, discounts on gym memberships, the ability to buy & sell holiday. Great staff discount (70% off a personal handset, 30% off for five friends or family per year). Tonnes of opportunities to earn a lot of commission. Company wide competitions for holidays and accessories such as selling the most of an item in your region. Relaxed training evenings such as pizza evenings to learn a new system. You can easily progress within the company if you work hard e.g. getting one week's, all expenses paid, work experience in your dream job if you meet your targets for 3 months. Cons Your commission can be cut if your store underperforms even if you meet or beat your own personal targets. You are targeted on every aspect of your job. Advice to Management Do not be too harsh on NPS results as many customers believe giving an 8 to be a high score, rather than passive.", "rating": 5, "pros": "Great, detailed & well paid training.", "cons": "Your commission can be cut if your store underperforms even if you meet or beat your own personal targets.", "advice": "Do not be too harsh on NPS results as many customers believe giving an 8 to be a high score, rather than passive."}, {"title": "It's a joke", "text": "Pros Really good pay Can earn lots in commission Cons - no room for local progression unless you're happy to relocate your whole life to a completely different area - yes commission is good but only if you're willing to bust a gut to get it. Pay is only good if you've hated worked gruelling hard for the money - no confidence in employees - no work life balance, working every weekend is expected of you and made to feel incredibly guilty if you ask for a weekend off or to book holiday - very sarcastic company - only micromanage your days not the bigger picture, you could be having an excellent month and hit your targets but if you have one bad day you have to have a conference call with regional manager which will pick apart any confidence you previously had in your position - you are for expected to work at least a year in the company if you decide to leave befoRe you are hounded with letters, emails and calls. - if you leave your pay will be completely messed up, I have ended up missing direct debits and been charged by the bank because the company is so slow at getting you paid on time for your last pay. - not being paid the overtime I have worked - selling feels very corrupt, you don't feel like you're selling what the customer has Come in for, your selling we many things we you can fob them off within a set price. Advice to Management Have more confidence in your staff and look at the bigger picture instead of micro managing your staff day by day. It is deflating when you are doing well and hitting you targets yet one bad day and the company will put a lot of weight on your shoulders over one day yet forget to praise the 29 amazing days you've had.", "rating": 3, "pros": "Really good pay", "cons": "- no room for local progression unless you're happy to relocate your whole life to a completely different area", "advice": "Have more confidence in your staff and look at the bigger picture instead of micro managing your staff day by day. It is deflating when you are doing well and hitting you targets yet one bad day and the company will put a lot of weight on your shoulders over one day yet forget to praise the 29 amazing days you've had."}, {"title": "Their just to rip customers off.", "text": "Pros 75% off phone Dirt Cheap Broadband Can make big money Cons Pressure, Coached to missell, have to rip customers off to make your money. Advice to Management Don't treat your staff so poorly.", "rating": 1, "pros": "75% off phone", "cons": "Pressure, Coached to missell, have to rip customers off to make your money.", "advice": "Don't treat your staff so poorly."}, {"title": "EE", "text": "Pros salaries and flexibility and good company benefits Cons distance from home and increases was rather small", "rating": 5, "pros": "salaries and flexibility and good company benefits", "cons": "distance from home and increases was rather small", "advice": null}, {"title": "Mel", "text": "Pros It's the best by far Cons It's amazing by far it is Advice to Management You rock", "rating": 3, "pros": "It's the best by far", "cons": "It's amazing by far it is", "advice": "You rock"}, {"title": "Some benefits but awful people.", "text": "Pros Surprisingly good starting wage A lot of benefits technically available If you get a good manager then the experience can almost be bearable. Cons Horrendously out of date systems and problematic implementation of new \"updated\" systems that often just create more problems. Your experience will depend on your manager, who has a better than average chance of being lazy, unhelpful or incompetent at their jobs. Your co-workers, particularly those in retail or a sales capacity will also create problems as there is no communication or care for other parts of the business due to... A heavily target based system of management, around 12 in all. Staff are encouraged to ignore rules and other guidelines to achieve. In customer service however you are also expected to persuade around 6% of your calls to speak to sales regarding other products. This in turn creates a poor experience for sales as there is a pressure to address the targets and so often customers will be lied to in order to get them through Call centres are woefully understaffed, with call queues rarely falling below 50 before 8:30pm. More often around 200. Bonus etc. Is very hard to hit and advancement is also very difficult if your manager, ops manager etc. Don't like you. Executive management will not listen to a suggestion that you and all of your colleagues have for literally 16 years in some cases. Your responsibilities will change and be increased far beyond your original job description. Your pay will not change to reflect this. Advice to Management Listen to your staff more, hire more people instead of demanding the impossible from those you have and decide if you want to focus on speed, customer service or sales.", "rating": 3, "pros": "Surprisingly good starting wage", "cons": "Horrendously out of date systems and problematic implementation of new \"updated\" systems that often just create more problems.", "advice": "Listen to your staff more, hire more people instead of demanding the impossible from those you have and decide if you want to focus on speed, customer service or sales."}, {"title": "Tough on targets", "text": "Pros Great facilities in the call centre. Good mobile discount for staff and friends & family. Good canteen. Good perks. Car park Cons The targets are getting harder & harder. They keep moving the goal post !! Not able to get to know anyone as so busy no time to chat. Really strict on minutes & seconds !! Don't like you taking a toilet break. You are monitored for everything. Don't think I can take it much longer . Customer service needs to come before call stats! It is so much pressure . Advice to Management Give staff a break!! The targets are too hard. A normal human being needs a toilet break after a couple of hours in work! But often doesn't get to go as doesn't have a break that soon and would get penalised if they went !", "rating": 3, "pros": "Great facilities in the call centre. Good mobile discount for staff and friends & family. Good canteen. Good perks. Car park", "cons": "The targets are getting harder & harder. They keep moving the goal post !! Not able to get to know anyone as so busy no time to chat. Really strict on minutes & seconds !! Don't like you taking a toilet break. You are monitored for everything. Don't think I can take it much longer . Customer service needs to come before call stats! It is so much pressure .", "advice": "Give staff a break!! The targets are too hard. A normal human being needs a toilet break after a couple of hours in work! But often doesn't get to go as doesn't have a break that soon and would get penalised if they went !"}, {"title": "No where else is like this place. It made me ill with worry.", "text": "Pros Good discount on phone package and some nice staff who will help you to settle in and learn the ropes. Was told at interview I would make a good amount of commison on top of my basic each month Cons This place has the worst systems every and the amount of sales I lost as the systems were not working . Brown nose managers who were pretty hopeless at there jobs but looked out for each other so a culture of them and us. Never having rota on time some days called same day to come in on days off. Threaten with being got rid of for one months bad performance. Totally disorganised and dare to complain then you are out the door. Regional managers who don't care about staff only sales targets. and lots of back stabbing between managers and staff. Being asked to do overtime but then having to chase to get paid as managers never submit it on time. In general the worst place I have ever worked and such a high turn over of staff. Advice to Management Listen to the sales advisors on the shop floor. To many mangers threaten staff with being getting rid of instead of helping as so much to lean in such a short period of time. To many deals changing week in week and hard for part e staff to keep,up,with deals if you have a manager that is not switched on and helps you.", "rating": 1, "pros": "Good discount on phone package and some nice staff who will help you to settle in and learn the ropes. Was told at interview I would make a good amount of commison on top of my basic each month", "cons": "This place has the worst systems every and the amount of sales I lost as the systems were not working . Brown nose managers who were pretty hopeless at there jobs but looked out for each other so a culture of them and us. Never having rota on time some days called same day to come in on days off. Threaten with being got rid of for one months bad performance. Totally disorganised and dare to complain then you are out the door. Regional managers who don't care about staff only sales targets. and lots of back stabbing between managers and staff. Being asked to do overtime but then having to chase to get paid as managers never submit it on time. In general the worst place I have ever worked and such a high turn over of staff.", "advice": "Listen to the sales advisors on the shop floor. To many mangers threaten staff with being getting rid of instead of helping as so much to lean in such a short period of time. To many deals changing week in week and hard for part e staff to keep,up,with deals if you have a manager that is not switched on and helps you."}, {"title": "Retentions adviser", "text": "Pros Everyone is really friendly, and it feels like one big family. The salary is fantastic, the company benefits are amazing, free concierge, and bonuses are uncapped. You get out of the job what you put in, potential to progress too Cons Interview was hard but fun Advice to Management Don't change", "rating": 5, "pros": "Everyone is really friendly, and it feels like one big family. The salary is fantastic, the company benefits are amazing, free concierge, and bonuses are uncapped. You get out of the job what you put in, potential to progress too", "cons": "Interview was hard but fun", "advice": "Don't change"}, {"title": "working for ee has its merits.. and drawbcks too.", "text": "Pros rewarding when selling no day is the same great employee / friends and family discounts Cons minimal progression commission structure changes at a moments notice", "rating": 5, "pros": "rewarding when selling", "cons": "minimal progression", "advice": null}, {"title": "Really enjoyed my time here", "text": "Pros I worked in one of the support functions. Sometimes the hours were long and the work was demanding. Every manager I had was excellent - that made all the difference. The company was well led and they looked after people in small ways like free coffee, occasional gifts on your desk, even a funfair in the car park one week. Great market to work in. Cons Shift work for customer facing agents is tough. Restructures were frequent. It seemed like there was always at least one department facing redundancies. Advice to Management Seek flexible shift options for on phone staff.", "rating": 5, "pros": "I worked in one of the support functions. Sometimes the hours were long and the work was demanding. Every manager I had was excellent - that made all the difference. The company was well led and they looked after people in small ways like free coffee, occasional gifts on your desk, even a funfair in the car park one week.", "cons": "Shift work for customer facing agents is tough. Restructures were frequent. It seemed like there was always at least one department facing redundancies.", "advice": "Seek flexible shift options for on phone staff."}, {"title": "Good place to work", "text": "Pros I worked with T-Mobile before it became EE. The transition was managed well and overall it was a good place to work. Cons Undue pressure from regional sales managers when newly appointed - high turnover meant management was inconsistent. Also store sales targets were raised too high after the store did well one month. Meant consistently exceeding targets was impossible and that had a serious effect on store morale. Advice to Management Focus on consistency of sales and not month on month success", "rating": 5, "pros": "I worked with T-Mobile before it became EE. The transition was managed well and overall it was a good place to work.", "cons": "Undue pressure from regional sales managers when newly appointed - high turnover meant management was inconsistent. Also store sales targets were raised too high after the store did well one month. Meant consistently exceeding targets was impossible and that had a serious effect on store morale.", "advice": "Focus on consistency of sales and not month on month success"}, {"title": "Never again!", "text": "Pros Staff were generally nice and friendly. It was a joy to meet so many people and customers were generally understanding and nice. Cons Unrealistic targets to hit. Shifts would be the same for months on end, requested made for shifts to be changed would be ignored. Shift rotas were not given to us until Sunday night at the earliest. The stores use of the Band app meant managers would berate you and contact you at inappropriate times. Holiday requests were almost always ignored. Overtime was not paid for months on end. Career advancement was never discussed. Staff were encouraged to sell things in a \"dodgy\" manner. Advice to Management Bad managers created a toxic environment, listen to your staff when they are telling you where problems are occurring. Take staff members to one side if they are having problems and not call them out in front of all the other staff.", "rating": 3, "pros": "Staff were generally nice and friendly.", "cons": "Unrealistic targets to hit.", "advice": "Bad managers created a toxic environment, listen to your staff when they are telling you where problems are occurring."}, {"title": "great company to work in.", "text": "Pros great salary, bonuses , great benefits, relaxed job, flexible hours Cons sometimes not great management hitting target can be hard. Advice to Management .", "rating": 3, "pros": "great salary,", "cons": "sometimes not great management", "advice": "."}, {"title": "Good", "text": "Pros good people fast paced place to work Cons Pay is much better for part timers because of tax i made", "rating": 5, "pros": "good people fast paced place to work", "cons": "Pay is much better for part timers because of tax i made", "advice": null}, {"title": "Lots of fun ! Great team !", "text": "Pros Great team Fun environment Great social side Good bonus scheme Good hourly rate Is a great environment to work in if you enjoy a busy environment Cons Targets need to be met When targets are not met pressure can arise however you can always ask team members or managers for help Advice to Management Great interview , very friendly manager on clumber street", "rating": 5, "pros": "Great team", "cons": "Targets need to be met", "advice": "Great interview , very friendly manager on clumber street"}, {"title": "love it", "text": "Pros fun commission structure was awesome Cons none loved working at ee Advice to Management none at all ee was goid", "rating": 5, "pros": "fun commission structure was awesome", "cons": "none loved working at ee", "advice": "none at all ee was goid"}, {"title": "Awful", "text": "Pros If you enjoy sales and hitting targets your enjoy this Cons Half an hour lunch in an 10 hour shift ridiculous, constantly standing up! Poor management, no structure Advice to Management There needs to be structure and information widely given to team also they is a huge lack of support", "rating": 1, "pros": "If you enjoy sales and hitting targets your enjoy this", "cons": "Half an hour lunch in an 10 hour shift ridiculous, constantly standing up! Poor management, no structure", "advice": "There needs to be structure and information widely given to team also they is a huge lack of support"}, {"title": "Good experience", "text": "Pros Exciting vibe, lots of young and energetic people, nice London office, growing company Cons Resource stretched in certain areas", "rating": 5, "pros": "Exciting vibe, lots of young and energetic people, nice London office, growing company", "cons": "Resource stretched in certain areas", "advice": null}, {"title": "Ee", "text": "Pros You can earn commission month to month Cons There are some odd shift patterns Advice to Management Be nice to staff", "rating": 3, "pros": "You can earn commission month to month", "cons": "There are some odd shift patterns", "advice": "Be nice to staff"}, {"title": "It's okay", "text": "Pros Free hot chocolate and coffee, meet new people. Was fun for a while. Cons Unrealistic targets and too much pressure to hit the targets Advice to Management Should state in apprentice contract that if you haven't passed probation you will leave the day you hand your 1 week notice in.", "rating": 3, "pros": "Free hot chocolate and coffee, meet new people. Was fun for a while.", "cons": "Unrealistic targets and too much pressure to hit the targets", "advice": "Should state in apprentice contract that if you haven't passed probation you will leave the day you hand your 1 week notice in."}, {"title": "Customer advicer", "text": "Pros Good pay for the job role and commision is added on top as well Good discounts for tablets phones and home boradband Cons Commision relies on the whole team not just yourself. Somtime the flexibility in work isnt great Advice to Management Offer better pay to staff in order to get the best people apart from that its all good", "rating": 5, "pros": "Good pay for the job role and commision is added on top as well", "cons": "Commision relies on the whole team not just yourself. Somtime the flexibility in work isnt great", "advice": "Offer better pay to staff in order to get the best people apart from that its all good"}, {"title": "Head of", "text": "Pros Good culture, looked after people Cons Poor work life balance in some senior roles", "rating": 5, "pros": "Good culture, looked after people", "cons": "Poor work life balance in some senior roles", "advice": null}, {"title": "Worse of my life", "text": "Pros Salary was above average and office location was center of london in Paddington Office was clean and enforced to be quiet. Cons Teams are too fragmented Too many people Too many off shore teams Too little work A corporate work environment no personality allowed Advice to Management Change", "rating": 1, "pros": "Salary was above average and office location was center of london in Paddington", "cons": "Teams are too fragmented", "advice": "Change"}, {"title": "Overall Review", "text": "Pros Pay Package Bonuses Staff Rewards Staff Plans Management Company Organisation Company Structure Reward Scheme Colleagues Cons Carphone Warehouse and Mobiles Direct Advice to Management Keep it up .", "rating": 5, "pros": "Pay Package", "cons": "Carphone Warehouse and Mobiles Direct", "advice": "Keep it up ."}, {"title": "Not Bad", "text": "Pros Decent Place to work Good Ethos Half decent incentives Cons Bad People management, Highly Office Political - Favouritism based on friendship not performance or attitude. Advice to Management Learn how to develop within, learn how to keep staff loyal", "rating": 3, "pros": "Decent Place to work", "cons": "Bad People management,", "advice": "Learn how to develop within, learn how to keep staff loyal"}, {"title": "Fast paced, high pressure", "text": "Pros Good comission structure Great employee benefits Roadshows Good basic Great bonus Pushes you to grow Will make or break you Enjoyable most of the time Cons Bad training (just put on the podium and left to conceirge for 3 weeks) No training in running the store High pressure Unforgiving senior management Only consider if you like swimming with sharks Manager even contacts you when you're in hospital demanding a reason for the stores performance Advice to Management Accept there will be quiet days, if conversion rates are still high pressure should be reduced", "rating": 3, "pros": "Good comission structure", "cons": "Bad training (just put on the podium and left to conceirge for 3 weeks)", "advice": "Accept there will be quiet days, if conversion rates are still high pressure should be reduced"}, {"title": "Head of", "text": "Pros Leading the market in mobile digital Cons Very frenetic environment to work in", "rating": 5, "pros": "Leading the market in mobile digital", "cons": "Very frenetic environment to work in", "advice": null}, {"title": "Great Network, shambolic systems", "text": "Pros Good Network story with capacity in depth and breadth of 4G. BT link up should be a good fit once embedded. Cons Disparate systems & lack of inter-team working. Internal battles & gaps affect customers and employees. Decent network assumed to be the be all & end all Advice to Management Team spirit is not universal, customers and employees suffer. Poor internal processes. Need cohesive systems & processes to support a better customer experience to go with a good network.", "rating": 3, "pros": "Good Network story with capacity in depth and breadth of 4G. BT link up should be a good fit once embedded.", "cons": "Disparate systems & lack of inter-team working. Internal battles & gaps affect customers and employees. Decent network assumed to be the be all & end all", "advice": "Team spirit is not universal, customers and employees suffer. Poor internal processes. Need cohesive systems & processes to support a better customer experience to go with a good network."}, {"title": "Changing benefits..", "text": "Pros Good pay Incentives for new product launches Fun team environment Motivational days out Cons Lack of training Changed commission structure during employment - now can only receive Lack of structured support Advice to Management Ensure training happens in the first month for new employees Provide regular feedback Offer a mentor-type structure for new starters", "rating": 3, "pros": "Good pay", "cons": "Lack of training", "advice": "Ensure training happens in the first month for new employees"}, {"title": "Customer Care", "text": "Pros very good training and sales not commision based so get to really focus on customer care. Cons long shifts, incentives and rewards attached to unpopular products", "rating": 5, "pros": "very good training and sales not commision based so get to really focus on customer care.", "cons": "long shifts, incentives and rewards attached to unpopular products", "advice": null}, {"title": "ee", "text": "Pros i would say ee had good pay, you get commission, there is good team spirit, etc etc etc as such Cons there is too much pressure to reach unrealistic targets and they arent fairly distributed", "rating": 5, "pros": "i would say ee had good pay, you get commission, there is good team spirit, etc etc etc as such", "cons": "there is too much pressure to reach unrealistic targets and they arent fairly distributed", "advice": null}, {"title": "Pros and Cons", "text": "Pros Great culture, lots of awesome people and good atmosphere. Exciting projects to work on and excellent opportunity for exposure. Cons Quite regular redundancies which dragged down moral. Opportunities to progress quite limited.", "rating": 3, "pros": "Great culture, lots of awesome people and good atmosphere. Exciting projects to work on and excellent opportunity for exposure.", "cons": "Quite regular redundancies which dragged down moral. Opportunities to progress quite limited.", "advice": null}, {"title": "could have been better", "text": "Pros Excellent team at store level Good discount on handsets and plans Opportunities to transfer to other stores and work your way up Cons Achieving commission became reliant on positive customer feedback, a rare thing in the mobile phone industry! Price plan increases with flakey justifications that are overpriced in the market and do not deliver value for money Consistently let down by repeated software and programme failures on the busiest days Advice to Management For goodness sake fix and improve the existing systems, it will drive productivity and increase sales and service.", "rating": 3, "pros": "Excellent team at store level", "cons": "Achieving commission became reliant on positive customer feedback, a rare thing in the mobile phone industry!", "advice": "For goodness sake fix and improve the existing systems, it will drive productivity and increase sales and service."}, {"title": "Really nice and friendly people", "text": "Pros If you need help theres always someone there to help u everyones really cool Cons Can be repeyitive somtimes but hey thats wotk life fot yad all noe gimne my free potbucks", "rating": 5, "pros": "If you need help theres always someone there to help u everyones really cool", "cons": "Can be repeyitive somtimes but hey thats wotk life fot yad all noe gimne my free potbucks", "advice": null}, {"title": "Marketing", "text": "Pros great benfits good place to sart your career Cons very political.huige job losses over the years- always on the verge of redundancy", "rating": 3, "pros": "great benfits good place to sart your career", "cons": "very political.huige job losses over the years- always on the verge of redundancy", "advice": null}, {"title": "Fun for a while but then became stagnent", "text": "Pros There are some good benefits, such as phone discount, bonuses, a good pension scheme. The best thing about working there are the people, there are lots of engaging and nice people within the organisation. Cons Not all of the people are that great, and unfortunately some of those that aren't we in key positions. Risk adverse with business strategy, and slow to react to market change and conditions, the appeal of the brand and the enjoyment of working their slowly dissipated for me once I realised that the business was not going to change. Advice to Management With a substantial amount of the UK market share in mobile communications, provide additional services that consumers want, at a price that is justifiable, and not sub par products that have a limited future but are deemed profitable...live camera streaming or a monthly contract for a do GPS anyone?", "rating": 3, "pros": "There are some good benefits, such as phone discount, bonuses, a good pension scheme. The best thing about working there are the people, there are lots of engaging and nice people within the organisation.", "cons": "Not all of the people are that great, and unfortunately some of those that aren't we in key positions. Risk adverse with business strategy, and slow to react to market change and conditions, the appeal of the brand and the enjoyment of working their slowly dissipated for me once I realised that the business was not going to change.", "advice": "With a substantial amount of the UK market share in mobile communications, provide additional services that consumers want, at a price that is justifiable, and not sub par products that have a limited future but are deemed profitable...live camera streaming or a monthly contract for a do GPS anyone?"}, {"title": "customer services advisor", "text": "Pros good commision on sales forwarded on, free tea and coffee, subsidised coffee bar Cons unrealistic targets, some managers very aggressive, systems would go down often Advice to Management fix Albert and other systems before berating the staff on not meeting targets", "rating": 3, "pros": "good commision on sales forwarded on, free tea and coffee, subsidised coffee bar", "cons": "unrealistic targets, some managers very aggressive, systems would go down often", "advice": "fix Albert and other systems before berating the staff on not meeting targets"}, {"title": "Good benefits", "text": "Pros Great benefits - good discount on phone great commission good manager currently look after their staff and love to work with phones Cons Some of the managers didnt know what they were doing but mostly positive although there is an obvious pressure to make targets", "rating": 5, "pros": "Great benefits - good discount on phone great commission good manager currently look after their staff and love to work with phones", "cons": "Some of the managers didnt know what they were doing but mostly positive although there is an obvious pressure to make targets", "advice": null}, {"title": "Great Company to work for", "text": "Pros I work in one of the head offices. Great for learning new skills and wanting to progress. Company is prepared to send you on courses that will help you with your role and there are many online courses on their training site that can help too. Great benefits, down to earth atmosphere, not your typical corporate environment...we all have a good relationship. Management are not your usual feared people :) you hear about in many companies. They are easy to talk to and are down to earth. Loads of events take place and always celebrating great achievements. you are also recognised for you hard work through management or recommendations of others, their is an internal site for others to recognise you and management heavily encourage you to use it. I joined in 2008 and since then I have been in 3 different roles/teams. Great for career progression here. Cons Bonus structure could be better Advice to Management Keep up the great work. Having down to earth management makes a big difference.", "rating": 5, "pros": "I work in one of the head offices. Great for learning new skills and wanting to progress. Company is prepared to send you on courses that will help you with your role and there are many online courses on their training site that can help too. Great benefits, down to earth atmosphere, not your typical corporate environment...we all have a good relationship. Management are not your usual feared people :) you hear about in many companies. They are easy to talk to and are down to earth. Loads of events take place and always celebrating great achievements. you are also recognised for you hard work through management or recommendations of others, their is an internal site for others to recognise you and management heavily encourage you to use it. I joined in 2008 and since then I have been in 3 different roles/teams. Great for career progression here.", "cons": "Bonus structure could be better", "advice": "Keep up the great work. Having down to earth management makes a big difference."}, {"title": "best place I ever worked", "text": "Pros feel valued great people money is great good benefits Cons not much to complain about, it is a big corporation so you can get lost in in the sea a bit Advice to Management not really", "rating": 5, "pros": "feel valued", "cons": "not much to complain about, it is a big corporation so you can get lost in in the sea a bit", "advice": "not really"}, {"title": "Typical call centre, stressful customer service made bearable by a good team", "text": "Pros Huge discounts off a phone contract, generous amount of holidays, other benefits you can opt into such as health care etc. I also had a great team around me - if you don't, it could be the job from hell. Cons It's a call centre! Rude customers, along with ridiculous targets set by higher management. Some days can really get you down. Advice to Management Treat your staff as human beings, don't set unreasonable targets and create an atmosphere where people feel disregarded and over-worked.", "rating": 3, "pros": "Huge discounts off a phone contract, generous amount of holidays, other benefits you can opt into such as health care etc. I also had a great team around me - if you don't, it could be the job from hell.", "cons": "It's a call centre! Rude customers, along with ridiculous targets set by higher management. Some days can really get you down.", "advice": "Treat your staff as human beings, don't set unreasonable targets and create an atmosphere where people feel disregarded and over-worked."}, {"title": "bad experiences more than good", "text": "Pros friends you make, rapport with some customers, bonus', pays great, holidays, chance of sabbatical leave after 3 years. Cons bad customers make your life hell, managers were unstructured, managers looked down on you, you HAVE to get 3 'transfers' a day (but somehow its your fault they didn't convert). If you are trained YOU have to convert that sale (but you were targeted on call handling time- so impossible task) too much pressure on advisers. you have to be a customer service adviser, technical adviser, a sales rep and a collections agent... for less pay than all those departments! Dont believe you if you are sick. Terrible with mental health - no sympathy and no work around. Had 2 mental breakdowns here and they were in the last few months of working there - used sick days and got threatened with a leave statement when i arrived back. So left on own accord. Advice to Management most are brown nosers and most had never worked in customer services or technical so had no idea about processes or where to find info.", "rating": 1, "pros": "friends you make, rapport with some customers, bonus', pays great, holidays, chance of sabbatical leave after 3 years.", "cons": "bad customers make your life hell, managers were unstructured, managers looked down on you, you HAVE to get 3 'transfers' a day (but somehow its your fault they didn't convert). If you are trained YOU have to convert that sale (but you were targeted on call handling time- so impossible task) too much pressure on advisers. you have to be a customer service adviser, technical adviser, a sales rep and a collections agent... for less pay than all those departments! Dont believe you if you are sick. Terrible with mental health - no sympathy and no work around. Had 2 mental breakdowns here and they were in the last few months of working there - used sick days and got threatened with a leave statement when i arrived back. So left on own accord.", "advice": "most are brown nosers and most had never worked in customer services or technical so had no idea about processes or where to find info."}, {"title": "Not about service, about targets", "text": "Pros Friends and family discount is good, I don't have any more positives to say about this company. Cons Targets are very unrealistic, so many different KPIs to hit, there's a list of about 10-12 you're targeted on. Very easy to get put on a \"performance plan\" and very hard to get off it. Company literally only care about new customers, upgrades and after care are secondary. Commission scheme is very complicated. Other companies I have worked for in the telecommunications sector have much better schemes. Advice to Management Look at the targets and make them realistic and reflect what a store can actually hit. Don't have such a quick reaction to putting people on performance plans ie as soon as they do not hit the 4 major KPIs. Simplify the commission structure.", "rating": 1, "pros": "Friends and family discount is good, I don't have any more positives to say about this company.", "cons": "Targets are very unrealistic, so many different KPIs to hit, there's a list of about 10-12 you're targeted on. Very easy to get put on a \"performance plan\" and very hard to get off it.", "advice": "Look at the targets and make them realistic and reflect what a store can actually hit."}, {"title": "Do it", "text": "Pros Great place to start a career, need experience of 1 year at least to start there, training is great too Cons Moaning customers hard targets rubbish food long hours little flexibility Advice to Management Egg your staff on more with smaller incentives", "rating": 5, "pros": "Great place to start a career, need experience of 1 year at least to start there, training is great too", "cons": "Moaning customers hard targets rubbish food long hours little flexibility", "advice": "Egg your staff on more with smaller incentives"}, {"title": "Pretty bad job to be honest.", "text": "Pros None. The money is okay. But not worth it for all the agro. The amount we are expected to do is a joke! Cons Things we are tracked on :- New vs target Up vs target Payg vs target Hbb vs target Insurance % Accessory % Business vs target Sharer vs target Value £ Total conversion Paym conversion Average MRC Pre to post mix Sales NPS % Service NPS % Repair NPS % Mystery shop % Excalibr useage % Tablet till useage % Forces churn % Stockloss % To name just a few!! If you miss 1 KPI you get threatened with performance plans!! It's awful!! Advice to Management Make the job more simple!!", "rating": 3, "pros": "None. The money is okay. But not worth it for all the agro. The amount we are expected to do is a joke!", "cons": "Things we are tracked on :-", "advice": "Make the job more simple!!"}, {"title": "Pretty average place", "text": "Pros can meet decent people and many opportunities to make extra money Cons management tend too choose people similar to their culture or personal friends to work in store. employees aren't recognised and commission scheme continuously goes down", "rating": 3, "pros": "can meet decent people and many opportunities to make extra money", "cons": "management tend too choose people similar to their culture or personal friends to work in store. employees aren't recognised and commission scheme continuously goes down", "advice": null}, {"title": "Worst customer experience in my life", "text": "Pros The network isn't that bad. It's just the rotten organizational structure that's awful. Employees tell customers that they will get back to them but are in fact not allowed to keep helping the customers in need. There are multiple problems with the invoicing system. Over billing make customers call customer service. Instead of being able to solve the problem directly or getting support from back office employees are encouraged not to follow up and fix problems long term. Cons There is a culture of not being able to solve issues for customers. Employees are instead encouraged to follow protocol. Faulty systems and procedures keep creating problems instead of being solved. Advice to Management You need to build trust between the hierarchical levels of the company. You should empower staff so that they can lead improvement initiatives instead of being silenced.", "rating": 1, "pros": "The network isn't that bad. It's just the rotten organizational structure that's awful. Employees tell customers that they will get back to them but are in fact not allowed to keep helping the customers in need.", "cons": "There is a culture of not being able to solve issues for customers. Employees are instead encouraged to follow protocol.", "advice": "You need to build trust between the hierarchical levels of the company. You should empower staff so that they can lead improvement initiatives instead of being silenced."}, {"title": "Senior Customer marketing manager", "text": "Pros Great benefits, Friendly people, Good management team Cons No downsides working at EE, Travel can be tiring, Nothing else", "rating": 5, "pros": "Great benefits, Friendly people, Good management team", "cons": "No downsides working at EE, Travel can be tiring, Nothing else", "advice": null}, {"title": "Don't waste you life with these guys", "text": "Pros discount on mobile devices....thats about it! Cons progression is rare, worst regional management ever!, commission system constantly changing, and worst mobile phone deals on the high street Advice to Management Stop ripping people off!", "rating": 1, "pros": "discount on mobile devices....thats about it!", "cons": "progression is rare, worst regional management ever!, commission system constantly changing, and worst mobile phone deals on the high street", "advice": "Stop ripping people off!"}, {"title": "Training", "text": "Pros Pension, Investment, Discounted packages, In-store bonus scheme Cons none at present other than the training being so long - 5days", "rating": 5, "pros": "Pension, Investment, Discounted packages, In-store bonus scheme", "cons": "none at present other than the training being so long - 5days", "advice": null}, {"title": "Great Company putting the Customer 1st", "text": "Pros Career progress and flexibility Cons No that I can put to words Advice to Management Keep driving forward", "rating": 5, "pros": "Career progress and flexibility", "cons": "No that I can put to words", "advice": "Keep driving forward"}, {"title": "Good place to work", "text": "Pros Great people to work with and a customer focused business. Cons Some areas of the business have let targets get out of control. Advice to Management You're headed in the right direction.", "rating": 5, "pros": "Great people to work with and a customer focused business.", "cons": "Some areas of the business have let targets get out of control.", "advice": "You're headed in the right direction."}, {"title": "Customer assistant", "text": "Pros The staff are really friendly as well as the manager. The pay is the best part of the job. Cons Some of the customer can be annoying but it's your part of the job to deal with it. Advice to Management Keep up the good job.", "rating": 5, "pros": "The staff are really friendly as well as the manager. The pay is the best part of the job.", "cons": "Some of the customer can be annoying but it's your part of the job to deal with it.", "advice": "Keep up the good job."}, {"title": "review", "text": "Pros Good place to work for as long as you hit your target, descent money for hitting your basic commision Cons A lot of miss selling to customers and no support when issue arise, can't get paid propperly Advice to Management Pay your staff on time and don't keep hem beyond your time because you can't do your job", "rating": 3, "pros": "Good place to work for as long as you hit your target, descent money for hitting your basic commision", "cons": "A lot of miss selling to customers and no support when issue arise, can't get paid propperly", "advice": "Pay your staff on time and don't keep hem beyond your time because you can't do your job"}, {"title": "Fading prospects", "text": "Pros Decent benefits Good staff discounts Some good people in the company Stability Cons Poor career progression Too many targets Poor mid level management Complicated commission structure", "rating": 3, "pros": "Decent benefits", "cons": "Poor career progression", "advice": null}, {"title": "Excellent Company to Work for", "text": "Pros Focused on the customer Great work / life balance Benefits and culture are great Promote training Cons An extremely lean company meaning pressure is added", "rating": 1, "pros": "Focused on the customer", "cons": "An extremely lean company meaning pressure is added", "advice": null}, {"title": "What a joke", "text": "Pros Good bonus not much else Cons No training, other call centres especially Indian based ones full of ignorant colleagues who hang up on you in the middle of conversations and management who aren't fit enough to lace your boots let alone run departments running the place into the ground Advice to Management Don't talk down to people, show respect, LISTEN to your staff, when they say the training isn't good enough DO SOMETHING ABOUT IT! Instead of burying your heads in the sand", "rating": 1, "pros": "Good bonus not much else", "cons": "No training, other call centres especially Indian based ones full of ignorant colleagues who hang up on you in the middle of conversations and management who aren't fit enough to lace your boots let alone run departments running the place into the ground", "advice": "Don't talk down to people, show respect, LISTEN to your staff, when they say the training isn't good enough DO SOMETHING ABOUT IT! Instead of burying your heads in the sand"}, {"title": "Rubbish Manager Complain to HR and nothing happens", "text": "Pros Really excited to started working at EE eight months ago Cons Rubbish unprofessional manager who had no care for the staff only himself Advice to Management Listen to us people serving the customers day in day out. Also listen to us staff when we complain about management as we do it for a reason. My manager would come in an hour late, go home early and have up to 10 cigarette breaks a day and we had to put up with it. 2 more weeks left and I'm off elsewhere so treat your staff with some respect please. I got treated better at McDonald's", "rating": 1, "pros": "Really excited to started working at EE eight months ago", "cons": "Rubbish unprofessional manager who had no care for the staff only himself", "advice": "Listen to us people serving the customers day in day out. Also listen to us staff when we complain about management as we do it for a reason. My manager would come in an hour late, go home early and have up to 10 cigarette breaks a day and we had to put up with it. 2 more weeks left and I'm off elsewhere so treat your staff with some respect please. I got treated better at McDonald's"}, {"title": "Great Student Job !", "text": "Pros -Super Flexible -Ideal for students -Good Commission Cons - As theres always new technology, you've got to keep up with the online training which is mandatory. (Like 1/2 new topics every month)", "rating": 5, "pros": "-Super Flexible", "cons": "- As theres always new technology, you've got to keep up with the online training which is mandatory. (Like 1/2 new topics every month)", "advice": null}, {"title": "Good company, flexibility and pay", "text": "Pros Great company to work for with really good benefit packages. Commission structure is good although seems to be getting lower. Great to be able to help so many people. good maternity pay good holiday Cons Pay should increase if commission goes down. can be long hours and irregular shifts. Advice to Management keep looking after the employees, and as above, if commission goes down, salary should increase.", "rating": 5, "pros": "Great company to work for with really good benefit packages. Commission structure is good although seems to be getting lower. Great to be able to help so many people.", "cons": "Pay should increase if commission goes down.", "advice": "keep looking after the employees, and as above, if commission goes down, salary should increase."}, {"title": "Hideous", "text": "Pros none by time I left. Cons Unrealistic targets Bullying management Lying to customers to achieve targets", "rating": 1, "pros": "none by time I left.", "cons": "Unrealistic targets", "advice": null}, {"title": "Customer Service Advisor", "text": "Pros Very good hourly wage, great commission scheme, and training helps loads. Very easy job once you get the hang of it. Cons work timetable changed every week, could have some bad shifts, like from 11-9, and some weeks you could work weekends which was a downside", "rating": 5, "pros": "Very good hourly wage, great commission scheme, and training helps loads. Very easy job once you get the hang of it.", "cons": "work timetable changed every week, could have some bad shifts, like from 11-9, and some weeks you could work weekends which was a downside", "advice": null}, {"title": "Sales Employment", "text": "Pros Great products. Great salary package Cons Corporately - dysfunctional departments. Sales and Customer Services prevented from using initiative and discretion. Account Managers not allowed to manage Advice to Management Senior Management - listen, encourage feedback, and provide a dynamic, fluid, business platform", "rating": 3, "pros": "Great products. Great salary package", "cons": "Corporately - dysfunctional departments. Sales and Customer Services prevented from using initiative and discretion. Account Managers not allowed to manage", "advice": "Senior Management - listen, encourage feedback, and provide a dynamic, fluid, business platform"}, {"title": "Frustrating", "text": "Pros Good benefits including money off mobile and home broadband for yourself, family and friends. Work with some fantastic people bonus good IF you hit targets Cons Unreasonable targets making it harder to make bonus, you can't self manage for this as you have to be in top 100 to get top bonus but you don't know who or what the target acually is... you work in teams of around 12 agents per team and each team has a manager in 8 yr I've had 8 managers and only 1 that I can say was fair, a lot of things like sickness is paid at manager descretion plenty of opertunity to progress if your face fits. Nothing in place for abusive customers still expected to be nice to them when they are calling you every name under the sun often find people in the toilets crying, forced to sell on technical and billing queues and having jobs threatened on daily basis,agents who have been with the company 10+ yrs are being released performance related and a lot of young people being brought in who by the way don't stick with the job for more that two mins Advice to Management Far to many team managers who like to bang their chests to show you who is boss.If you look after the little people the customers will be looked after in return STOP changing stats and goals people are confused on a daily basis as to what it is you want us to achieve.. STOP threatening jobs on a daily basis if stats are not met and make sure all team manager are trained to standard and treat all staff the same which will hopefully resolve bullying tactics and good agents leaving because of managers", "rating": 1, "pros": "Good benefits including money off mobile and home broadband for yourself, family and friends. Work with some fantastic people bonus good IF you hit targets", "cons": "Unreasonable targets making it harder to make bonus, you can't self manage for this as you have to be in top 100 to get top bonus but you don't know who or what the target acually is... you work in teams of around 12 agents per team and each team has a manager in 8 yr I've had 8 managers and only 1 that I can say was fair, a lot of things like sickness is paid at manager descretion plenty of opertunity to progress if your face fits. Nothing in place for abusive customers still expected to be nice to them when they are calling you every name under the sun often find people in the toilets crying, forced to sell on technical and billing queues and having jobs threatened on daily basis,agents who have been with the company 10+ yrs are being released performance related and a lot of young people being brought in who by the way don't stick with the job for more that two mins", "advice": "Far to many team managers who like to bang their chests to show you who is boss.If you look after the little people the customers will be looked after in return STOP changing stats and goals people are confused on a daily basis as to what it is you want us to achieve.. STOP threatening jobs on a daily basis if stats are not met and make sure all team manager are trained to standard and treat all staff the same which will hopefully resolve bullying tactics and good agents leaving because of managers"}, {"title": "Sales advisor Retail", "text": "Pros You can learn a lot about sales. Everything depend from manager and his assistant. Cons Commison is comming down from year to year.", "rating": 5, "pros": "You can learn a lot about sales. Everything depend from manager and his assistant.", "cons": "Commison is comming down from year to year.", "advice": null}, {"title": "New Technology", "text": "Pros being involved in new technology launches Cons There is uncertainty over the future Advice to Management The culture could be improved", "rating": 5, "pros": "being involved in new technology launches", "cons": "There is uncertainty over the future", "advice": "The culture could be improved"}, {"title": "Store manager", "text": "Pros Fantastic bonus when hit Good team atmosphere Cons High pressured Office politics can be distracting Advice to Management Deliver what is said. We get told that a product or scheme is launching and it never does.", "rating": 3, "pros": "Fantastic bonus when hit", "cons": "High pressured", "advice": "Deliver what is said. We get told that a product or scheme is launching and it never does."}, {"title": "Used to be good", "text": "Pros Can make decent money if you hit comission. Basic isn't something i'd want to live off Cons Regional level management and above are very out of touch with stores. Focus shifted almost daily to the extent that you will be reprimanded for doing what you were asked to do the week before. Advice to Management Don't try make all advisors into robots. not everone will use the same techniques in sales and it doesnt make sense to try and force them when they are hitting kpi with their own style", "rating": 1, "pros": "Can make decent money if you hit comission. Basic isn't something i'd want to live off", "cons": "Regional level management and above are very out of touch with stores. Focus shifted almost daily to the extent that you will be reprimanded for doing what you were asked to do the week before.", "advice": "Don't try make all advisors into robots. not everone will use the same techniques in sales and it doesnt make sense to try and force them when they are hitting kpi with their own style"}, {"title": "OK to work for", "text": "Pros Hours are flexible Staff are nice Cons Terrible micro management Targets are unrealistic for the area Advice to Management Treat staff like people not slaves", "rating": 3, "pros": "Hours are flexible", "cons": "Terrible micro management", "advice": "Treat staff like people not slaves"}, {"title": "BAD Management", "text": "Pros Get paid on time and get your annual leave. Cons Management dont know what they are doing and making bad decisions", "rating": 3, "pros": "Get paid on time and get your annual leave.", "cons": "Management dont know what they are doing and making bad decisions", "advice": null}, {"title": "Dynamic environment, lot to learn quickly", "text": "Pros Get to meet a lot of people-sometimes Celebs Good personal discount Decent pay and good family scheme too Good support from management Cons When I started I was told EE is like another degree. It almost is. You're required to have an understanding of all price plans,deals, promos,systems and hit target. Can be pressurising at times. Systems aren't always reliable making the job harder", "rating": 5, "pros": "Get to meet a lot of people-sometimes Celebs", "cons": "When I started I was told EE is like another degree. It almost is. You're required to have an understanding of all price plans,deals, promos,systems and hit target.", "advice": null}, {"title": "Good Company", "text": "Pros Good drive to lead the market Cons stressful environment at times due to ever changing market Advice to Management all good", "rating": 5, "pros": "Good drive to lead the market", "cons": "stressful environment at times due to ever changing market", "advice": "all good"}, {"title": "Great company, great management", "text": "Pros Great management and leadership Good benefits Flexible working Ongoing communication of how the business is performing and company plans Motivated teams Cons There's some politics... but not to the degree of other companies I've worked for in the past Advice to Management Make sure you keep being open and honest with your employees.", "rating": 5, "pros": "Great management and leadership", "cons": "There's some politics... but not to the degree of other companies I've worked for in the past", "advice": "Make sure you keep being open and honest with your employees."}, {"title": "Keeps me sharp, but difficult targets", "text": "Pros The employee discounts can be good but do not rival those given to other network employees. Brand ethos is good since you are not taught to be pushy. Cons Systems are complex and outdated. Targets ruin ethos since you cannot earn extra without hitting targets. Overpriced contracts are often undercut by third party sellers. Advice to Management New systems completely. Do not keep delaying store refits. Better employee benefits. Less pushing to hit targets.", "rating": 3, "pros": "The employee discounts can be good but do not rival those given to other network employees. Brand ethos is good since you are not taught to be pushy.", "cons": "Systems are complex and outdated. Targets ruin ethos since you cannot earn extra without hitting targets. Overpriced contracts are often undercut by third party sellers.", "advice": "New systems completely. Do not keep delaying store refits. Better employee benefits. Less pushing to hit targets."}, {"title": "Very process-oriented and slow", "text": "Pros Great colleagues, ownership of product or project, very driven directors, good cooperation between sales and marketing, innovation-driven culture Cons Bad IT, bad cooperation among areas, weak management focused on selling the company, very short-term orientation, slow implementation of idea and good people leaving Advice to Management Establish a fun and driven culture. Keep EE separate after the integration with BT. Start valuing people.", "rating": 3, "pros": "Great colleagues, ownership of product or project, very driven directors, good cooperation between sales and marketing, innovation-driven culture", "cons": "Bad IT, bad cooperation among areas, weak management focused on selling the company, very short-term orientation, slow implementation of idea and good people leaving", "advice": "Establish a fun and driven culture. Keep EE separate after the integration with BT. Start valuing people."}, {"title": "don't do it", "text": "Pros good bonus and free stuff choclates alcohol free parking Cons high targets that always change very little support from management, more of a who you know not what you know mentality very noisy bells and whisltes when making a salemaking it very hard to hear customers, no support for mental health issues. Advice to Management stop trying to outdo one and other and support your team,", "rating": 1, "pros": "good bonus and free stuff choclates alcohol free parking", "cons": "high targets that always change very little support from management, more of a who you know not what you know mentality very noisy bells and whisltes when making a salemaking it very hard to hear customers, no support for mental health issues.", "advice": "stop trying to outdo one and other and support your team,"}, {"title": "Good Employer in the South West", "text": "Pros Money, experience, good people, friendly and rewarding. Cons Working at EE can be difficult with all the 3rd party suppliers and the process that they and you have to follow to get a project delivered, its like pushing water up hill Advice to Management Promote people in your team rather than letting them fill dead man shoes", "rating": 5, "pros": "Money, experience, good people, friendly and rewarding.", "cons": "Working at EE can be difficult with all the 3rd party suppliers and the process that they and you have to follow to get a project delivered, its like pushing water up hill", "advice": "Promote people in your team rather than letting them fill dead man shoes"}, {"title": "NO RESPECT FOR CUSTOMERS OR EMPLOYEES!", "text": "Pros Pay for speaking all day 75% discount (although other companies who are apparently 'worse off' in this competitive market are getting free phones and contracts) Friends for life Due to shifts lots of days off Cons Forced to 12 hour shifts but days off good. No communication between departments. Off shore call centres make on shore advisors job a misery. Management! Had 3 managers in 3 years. First was fantastic, 2nd was motherly but not a good manager as had no idea with any processes. 3rd I had for a month ad had to leave immediately. Processes were never followed correctly - including sickness. Always had a note and a valid report of where I had been but was put through 3 disciplinary hearings and moved to stage 2. I did not appeal any of the decisions as a manager on a separate team had told me I'd never win so 'not to waste my time'. Was advised by a doctor not to MOVE let drive and walk around this was ignored by my manager and told if I go to stage 3 I will be fired immediately.. so I came in and they had made me go on the phones the next day (although I had been signed off for 3 weeks) This was not the correct process (remembering I had a lot of experience here) but it was my decision to leave without a fight than to be fired wrongly and appeal. Targets are unrealistic. Yes people hit them. But you'll never hear someone say 'i did great this month'. It's always 'well that was lucky..' as it's based on NPS it's totally out of your hands. I've had customers where we've had a great but told me If I send 'one of those texts' they'll give me zero for inconvenience!! Any excuse not to pay you bonus (despite results). Wants to be number 1 for service.. Will not happen as all company want to do it focus on money and not customers satisfaction. BIG CON. 'as a loyal customer you could get this this and this..' '...but it's the same deal anyone else would get...' Could get stuck on a call for 59 mins after your shift would end but you won't be paid a single penny for that but if you are late (using the new system) by 30 seconds you now owe the company 1 minute?????! Advice to Management Training was given for relevant new data but not everyone is as fast to grasp new data as others. Maybe get customers to press '1' if they would like a text sent based on the service given by the last advisor spoken to (suggestion was liked but never had feedback)", "rating": 1, "pros": "Pay for speaking all day", "cons": "Forced to 12 hour shifts but days off good.", "advice": "Training was given for relevant new data but not everyone is as fast to grasp new data as others."}, {"title": "Company appears not to care", "text": "Pros - Good phone discount  - Friend and Family discounts for phone and home broadband  - Health Care  - Pension  - Optional extras such as retail vouchers, charity payroll donations etc. Cons - We don't get proper training for the job, and our requests for training get ignored. But we still get targetted and reprimanded when we don't achieve the targets.  - The workload has tripled in terms of knowledge over the last few years, but the pay has never increased.  - The Execs don't give a damn. I've worked in the Exec Office for over 5 years now, dealing with the complaints which are addressed to the Execs. We are told to give the impression that we know the Execs personally and the Execs know what we are doing, but the Execs have never bothered to visit us, speak to us, or pay any attention to us. They don't have a clue who we are, and only visit other call centres as a token gesture for photo opportunities when a new service/product/department is launched.  - Most of the company tech systems are faulty. It is rare to have a day when none of the systems break.  - EE is the most complained about company. I am not surprised. Employees are constantly asking for support, training, improved policies and processes, but our requests fall on deaf ears. Nothing changes and EE gets more complaints from customers, and the call centre staff get the blame. Not fair. Stress leave is very high in many departments. Advice to Management - Provide proper training so agents can do their jobs (your agents are committed to doing the job properly, but they can't just magically learn everything themselves).  - Ensure pay is fair for the workloads  - Consult with agents before changing workloads  - Ensure systems work properly before launching them  - Open up more channels for internal company feedback to drive improvement.", "rating": 1, "pros": "- Good phone discount", "cons": "- We don't get proper training for the job, and our requests for training get ignored. But we still get targetted and reprimanded when we don't achieve the targets.", "advice": "- Provide proper training so agents can do their jobs (your agents are committed to doing the job properly, but they can't just magically learn everything themselves)."}, {"title": "Caring company", "text": "Pros Loved working at EE as a sales advisor in store. Worked with a fabulous team and the sales benefits were brilliant. If you sell well you get paid very well. Cons Selling under pressure is difficult when you are not used to it. Not all about caring for the customer but who can sell the most, lots of emphasis on upselling Advice to Management The customer satisfaction scores are difficult as we are penalised if they didn't get good mobile service, not if we didn't get give great service in store", "rating": 5, "pros": "Loved working at EE as a sales advisor in store. Worked with a fabulous team and the sales benefits were brilliant. If you sell well you get paid very well.", "cons": "Selling under pressure is difficult when you are not used to it. Not all about caring for the customer but who can sell the most, lots of emphasis on upselling", "advice": "The customer satisfaction scores are difficult as we are penalised if they didn't get good mobile service, not if we didn't get give great service in store"}, {"title": "Used car salesman without the perks", "text": "Pros - 75% discount on personal contract - Suits a certain kind of personality - Some money to be made if you don't care about any of the cons Cons - Rampant fraud and mis-selling. Managers threaten your job if you refuse. - Unrealistic targets, especially on NPS, where you are expected to get over 85% 9s and 10s out of 10. If you don't hit a target you lose 100% of your commission. - Expected to stay in late for no extra pay, sometimes as long as an hour and a half. This often brings your basic pay below minimum wage. - Hidden microphones all over the store including staff room. Management use this to threaten you. - No training on phones and minimal training on systems. Training is basically them bigging up their commission scheme then giving a really rose-tinted view of sales that you quickly unlearn. Advice to Management Management know exactly what they're doing. They've found a way to battery farm humans and are laughing all the way to the bank.", "rating": 1, "pros": "- 75% discount on personal contract", "cons": "- Rampant fraud and mis-selling. Managers threaten your job if you refuse.", "advice": "Management know exactly what they're doing. They've found a way to battery farm humans and are laughing all the way to the bank."}, {"title": "Finance Claims Analyst", "text": "Pros Great work ethics Brilliant company to work for Great hours Was sad to leave Cons As a contractor you are not allowed to apply for any direct EE jobs, you must wait for them to go out to the public, I found this quite frustrating when a) you already work for them, b) have access to be able to work (laptops & logins etc.), and c) received great feedback from all three managers, but unable to apply for the internal jobs ;0(", "rating": 5, "pros": "Great work ethics", "cons": "As a contractor you are not allowed to apply for any direct EE jobs, you must wait for them to go out to the public, I found this quite frustrating when a) you already work for them, b) have access to be able to work (laptops & logins etc.), and c) received great feedback from all three managers, but unable to apply for the internal jobs ;0(", "advice": null}, {"title": "Review", "text": "Pros Varied roles, fast paced, new technology, lots of project based work with virtual teams. Cons bureaucracy can be difficult at times, as is the case with many large companies.", "rating": 5, "pros": "Varied roles, fast paced, new technology, lots of project based work with virtual teams.", "cons": "bureaucracy can be difficult at times, as is the case with many large companies.", "advice": null}, {"title": "EE", "text": "Pros Good colleagues and okay salary Cons Value schemes benefiting only certain types of stores in certain areas. Focus going away from commission and less commitment to advisors now than ever before. Advice to Management Take more notice of employees as they are the people on the ground and their opinions make a massive difference in shaping the business.", "rating": 5, "pros": "Good colleagues and okay salary", "cons": "Value schemes benefiting only certain types of stores in certain areas. Focus going away from commission and less commitment to advisors now than ever before.", "advice": "Take more notice of employees as they are the people on the ground and their opinions make a massive difference in shaping the business."}, {"title": "excellentt", "text": "Pros Great working environment, free parking, excellent people, excellent facilities. The culture was fantastic and no politics to deal with.fantastic experience all round. Cons None to report really. The company was great to work for. I decided to enjoy work and I did so. The people were great. Advice to Management Something worked very well,capture it and keep doing it. Realy enjoyable place to work. Thank you for the opportunity.", "rating": 5, "pros": "Great working environment, free parking, excellent people, excellent facilities. The culture was fantastic and no politics to deal with.fantastic experience all round.", "cons": "None to report really. The company was great to work for. I decided to enjoy work and I did so. The people were great.", "advice": "Something worked very well,capture it and keep doing it. Realy enjoyable place to work. Thank you for the opportunity."}, {"title": "EE B2B", "text": "Pros Following merger of Orange and T-Mobile, biggest network in UK, ability to offer great proposition to customers, so grew market share - exciting times. And also less involvement from previous owners of Orange, France Telecom! Cons Culture changed even more away from Orange, becoming big enterprise like many others in ICT. Advice to Management Olaf was a great appointment - amazing ability to drive a coherent strategy and understand the detail both technical and sales and marketing, following mediocre senior management for a number of years - so keep up the pace of improvements.", "rating": 5, "pros": "Following merger of Orange and T-Mobile, biggest network in UK, ability to offer great proposition to customers, so grew market share - exciting times. And also less involvement from previous owners of Orange, France Telecom!", "cons": "Culture changed even more away from Orange, becoming big enterprise like many others in ICT.", "advice": "Olaf was a great appointment - amazing ability to drive a coherent strategy and understand the detail both technical and sales and marketing, following mediocre senior management for a number of years - so keep up the pace of improvements."}, {"title": "Would no longer touch them with a long barge pole", "text": "Pros Private Healthcare, cheap broadband. Colleagues are good. Christmas dinner if working Christmas day. Cons EE make themselves out to be this huge employee caring company who do everything for your welfare, but in reality ( for whatever reason, possibly internal politics ) they fail and leave staff worried for their jobs. Even if you have worked there for a lot of years, like I had ( since it was Orange ), your job is not safe if they want to get rid of you. If you have a lot of sickness, or struggle with targets, or the systems they use these days ( which are not as good as they make them out to be ) they will find a way to push you out of the door. If you are protected a bit by disability legislations for your sickness, they will trawl your work looking for other reasons to make your life hell and put you through disciplinary after disciplinary until they can get shot of you. This is what happened to me. The only reason I stopped taking them to a tribunal was I did not want it over lapping with my new job. In a way I regret that decision, but thats the choice I made. Even before the last situation where I felt I was left with no option but to resign ( due to a witch hunt by my manager ), Other managers had had power trips and threatened myself and other members of staff with the sack if they did not hit targets. We were advised that we would be performance managed out of the doors ( theirs words, not mine ). Also, at one time ( when it was Orange ), we used to get loads of benefits such as free mobile phone plans etc. These days we gets a percentage off, which in a lot of cases is worse than normal customers get. We have to buy our phones etc if you want a decent phone. We don't get freebies like outside customers get. The healthcare is the only thing I would say is any good. Its helped me out loads. Advice to Management Despite thinking you have great training packages in place, you have not and staff need to be given individual training. Not everyone can pick up stuff as fast some others. Some take more time. Its no good saying ' so and so manages ok, so why don't you' Everyone has different learning curves. Have more understanding to you staffs needs and requirements.", "rating": 3, "pros": "Private Healthcare, cheap broadband. Colleagues are good. Christmas dinner if working Christmas day.", "cons": "EE make themselves out to be this huge employee caring company who do everything for your welfare, but in reality ( for whatever reason, possibly internal politics ) they fail and leave staff worried for their jobs. Even if you have worked there for a lot of years, like I had ( since it was Orange ), your job is not safe if they want to get rid of you. If you have a lot of sickness, or struggle with targets, or the systems they use these days ( which are not as good as they make them out to be ) they will find a way to push you out of the door. If you are protected a bit by disability legislations for your sickness, they will trawl your work looking for other reasons to make your life hell and put you through disciplinary after disciplinary until they can get shot of you. This is what happened to me. The only reason I stopped taking them to a tribunal was I did not want it over lapping with my new job. In a way I regret that decision, but thats the choice I made.", "advice": "Despite thinking you have great training packages in place, you have not and staff need to be given individual training. Not everyone can pick up stuff as fast some others. Some take more time. Its no good saying ' so and so manages ok, so why don't you' Everyone has different learning curves. Have more understanding to you staffs needs and requirements."}, {"title": "the best network", "text": "Pros great advantages! love the EE way and the customer interest levels Cons none as far as i can see", "rating": 5, "pros": "great advantages! love the EE way and the customer interest levels", "cons": "none as far as i can see", "advice": null}, {"title": "Customer Service Adviser :", "text": "Pros Nice friendly people but expect to see staff regularly crying. Good health / benefit packages 75% off one phone line and 30% for family and friends. Nice food in canteen Nice modern environment but expect to desk hop. Regularly give out freebies Cons Misleading job title. Advertised as dealing with customers bills and upgrades when really it is a technical support line solving technical issues and selling. Misleading hours: Job advertised as 3 X 12 hour shifts per week. It's only after training they tell you that's a possibly after 6 months probation of doing 5x8 hour shifts at unsocial times. Misleading job spec : they expect you to sell sell sell and demand you present or sell to most customers. Very unrealistic if a customer is ringing to complain. Inadequate training: two weeks training in a class room based environment where you work it out for yourself. Then you are loose on the phones Unrealistic demands : they expect you on site to log in between 15-30 minutes early and you don't leave until you finish your last call which could run over by 30 minutes. They expect all this for free. But if you are 1 minute late back from lunch / break you have to work it back ! Advice to Management You want to be first for service but you have no intention of understanding a customers journey. You don't put the customer first or handle complains effectively or honour your management call backs. Complaints not logged is common practice. Embarrassingly Shocking attitude to customers. Team leaders need to be trained as professional effective first line managers. The practice of team leaders screaming/ shouting sales or disciplining staff when advisers are on a call is downright unprofessional and mortifying for agents and customers.", "rating": 1, "pros": "Nice friendly people but expect to see staff regularly crying.", "cons": "Misleading job title. Advertised as dealing with customers bills and upgrades when really it is a technical support line solving technical issues and selling.", "advice": "You want to be first for service but you have no intention of understanding a customers journey. You don't put the customer first or handle complains effectively or honour your management call backs. Complaints not logged is common practice. Embarrassingly Shocking attitude to customers."}, {"title": "It's a nice company", "text": "Pros You can work 1 day a week from home if your manager is ok with it. Overall people are nice. Good renumeration package. Cons There is very little training available, no real career path. Often promotions are based on who you know, who you go to play tennis together etc - not on the merits. Advice to Management Promote people based on what results their deliver, what skills and experience they have. Pay more attention to career progression and relevant training.", "rating": 3, "pros": "You can work 1 day a week from home if your manager is ok with it.", "cons": "There is very little training available, no real career path. Often promotions are based on who you know, who you go to play tennis together etc - not on the merits.", "advice": "Promote people based on what results their deliver, what skills and experience they have."}, {"title": "Working at EE", "text": "Pros Excellent Opportunity to learn. Great work force to learn from. Lots of perks such as private health care and cheap coffee. Cons Not too many cons however location is quite a bit outside of Bristol and you are not able to accumulate to hours to work 9 day fortnights or 4 day weeks. Advice to Management If you want to be considered a great employer--and you certainly should--providing your employees with higher pay, better benefits, extensive training, and greater opportunities are definite factors.", "rating": 5, "pros": "Excellent Opportunity to learn.", "cons": "Not too many cons however location is quite a bit outside of Bristol and you are not able to accumulate to hours to work 9 day fortnights or 4 day weeks.", "advice": "If you want to be considered a great employer--and you certainly should--providing your employees with higher pay, better benefits, extensive training, and greater opportunities are definite factors."}, {"title": "worth a try - company growing all the time", "text": "Pros great product, if you can sell, then you can earn a lot Cons if you cant sell, it will be a short career", "rating": 3, "pros": "great product, if you can sell, then you can earn a lot", "cons": "if you cant sell, it will be a short career", "advice": null}, {"title": "Store Manager", "text": "Pros My team in the store was brilliant, customers added variety to the role. Good 2 way communication up to Director level (not something you would normally experience in a company of this size. Cons Poor middle management, area manager clueless as had come out of industry and the lack of support provided was unbelievable considering the relatively small size of region. Had previously been a successful Store Manager with Phones4u for 4 years and enjoyed every second. I would not recommend that anyone consider working for EE based on my experiences there. Advice to Management There needs to be a cluster store manager role to enable managers of flagship stores the ability to sink there teeth into multi site management giving EE a talent pool to select from internally when area manager positions arise. Hiring from Boots is not the only solution to recruitment! I can only comment on my region, but my area managers ability was laughable, contributed to considerable attrition across the region and poor inconsistent results across his stores. I would not recommend that anyone consider working for EE based on my experiences there.", "rating": 1, "pros": "My team in the store was brilliant, customers added variety to the role. Good 2 way communication up to Director level (not something you would normally experience in a company of this size.", "cons": "Poor middle management, area manager clueless as had come out of industry and the lack of support provided was unbelievable considering the relatively small size of region. Had previously been a successful Store Manager with Phones4u for 4 years and enjoyed every second. I would not recommend that anyone consider working for EE based on my experiences there.", "advice": "There needs to be a cluster store manager role to enable managers of flagship stores the ability to sink there teeth into multi site management giving EE a talent pool to select from internally when area manager positions arise. Hiring from Boots is not the only solution to recruitment!"}, {"title": "Great company to work for", "text": "Pros Excellent culture. Part of a winning team Cons People think you are Orange! Advice to Management none", "rating": 5, "pros": "Excellent culture. Part of a winning team", "cons": "People think you are Orange!", "advice": "none"}, {"title": "Senior sales", "text": "Pros Staff discount, pension, healthcare i have worked here for 7 years and seen alot of change some things for the better Cons I would not recommend ee as a place to work for anyone wages are poor for the stress and targets involved and the comission structure is poor as this has reduced by at least 50% in tht last 12 months. Cut backs always affect the staff at the bottom of the ladder with an increase in kpis from 5 main kpis to about 12-13 miss 2 off these and you will be managed out regardless of time with the company. Advice to Management Look after the guys who make all the sales not keep cutting comission just to make proffit as you openly tell staff your are aiming for a billion £ proffit if you look after the staff sales will increase. Threats to staff for their jobs is not a way to run a company as i have hd this constantly for 7 years and is more de motivating than motivational.", "rating": 1, "pros": "Staff discount, pension, healthcare i have worked here for 7 years and seen alot of change some things for the better", "cons": "I would not recommend ee as a place to work for anyone wages are poor for the stress and targets involved and the comission structure is poor as this has reduced by at least 50% in tht last 12 months. Cut backs always affect the staff at the bottom of the ladder with an increase in kpis from 5 main kpis to about 12-13 miss 2 off these and you will be managed out regardless of time with the company.", "advice": "Look after the guys who make all the sales not keep cutting comission just to make proffit as you openly tell staff your are aiming for a billion £ proffit if you look after the staff sales will increase. Threats to staff for their jobs is not a way to run a company as i have hd this constantly for 7 years and is more de motivating than motivational."}, {"title": "A good company to work for", "text": "Pros - 30% discount off up to 5 mobile phones a year for friends and family - discounts on home broadband - can get commission if you reach targets - get regular training online to help with knowledge - 25 days holiday -graduate schemes Cons - targets are often too ambitious and are calculated based on number of people who come into the store. - discounts on mobile phones for friends and family used to be higher", "rating": 5, "pros": "- 30% discount off up to 5 mobile phones a year for friends and family", "cons": "- targets are often too ambitious and are calculated based on number of people who come into the store.", "advice": null}, {"title": "Fun but beauratic company", "text": "Pros Fair benefits, fun culture & handle the latest mobile phone & tablet technology. Cons Limiting commission structure and illogical KPI targets. Advice to Management Allow staff more freedom to implements ideas and encourage progression.", "rating": 3, "pros": "Fair benefits, fun culture & handle the latest mobile phone & tablet technology.", "cons": "Limiting commission structure and illogical KPI targets.", "advice": "Allow staff more freedom to implements ideas and encourage progression."}, {"title": "Manager", "text": "Pros Excellent Pay! Excellent Bonus Structure Cons Many Targets and hard work to hit all every month", "rating": 5, "pros": "Excellent Pay! Excellent Bonus Structure", "cons": "Many Targets and hard work to hit all every month", "advice": null}, {"title": "Good, challenging role", "text": "Pros Fast moving environment, good teams & freedom to put your own stamp on role. Cons No chance for promotion/progression within role. Seemingly impossible to achieve a GGS13 role even when operating at this level from GGS12. Advice to Management Promote consistent high/over achievers within existing roles.", "rating": 5, "pros": "Fast moving environment, good teams & freedom to put your own stamp on role.", "cons": "No chance for promotion/progression within role. Seemingly impossible to achieve a GGS13 role even when operating at this level from GGS12.", "advice": "Promote consistent high/over achievers within existing roles."}, {"title": "Good prospects but unfortunately a company which doesn't treat it's employees well who like to think for themselves", "text": "Pros Good benefits and large company with good opportunity to progress of you kids the right area Cons Unreal expectations on sales targets and no respect for someone who thinks and doesn't just kiss backside Advice to Management Sack yourselves", "rating": 1, "pros": "Good benefits and large company with good opportunity to progress of you kids the right area", "cons": "Unreal expectations on sales targets and no respect for someone who thinks and doesn't just kiss backside", "advice": "Sack yourselves"}, {"title": "Good", "text": "Pros Great discounts on mobile phone packages Cons Progression Is hindered when yu", "rating": 5, "pros": "Great discounts on mobile phone packages", "cons": "Progression Is hindered when yu", "advice": null}, {"title": "Enjoying my new job", "text": "Pros Good experience throughout the interview process as well as in the job. Great opportunity to learn and develop, good exposure and visibility, lovely team. Cons No cons so far. Too early to tell. Advice to Management I'm tooo early in the role to give an advice to management.", "rating": 5, "pros": "Good experience throughout the interview process as well as in the job. Great opportunity to learn and develop, good exposure and visibility, lovely team.", "cons": "No cons so far. Too early to tell.", "advice": "I'm tooo early in the role to give an advice to management."}, {"title": "I've just shat my pants.", "text": "Pros There are none. It is literally more fun to log your own boxers than work here. Cons Customers, hours, pay, job satisfaction, benefits Advice to Management Shoot yourselves.", "rating": 1, "pros": "There are none. It is literally more fun to log your own boxers than work here.", "cons": "Customers, hours, pay, job satisfaction, benefits", "advice": "Shoot yourselves."}]