[{"title": "Great company, highly-skilled team and nice atmosphere", "text": "Pros Working at Medidate was very pleasant. People trust you from the beginning and they let you be creative and work on projects that could help the company. Being autonomous in my work was a big plus for me, but I also had the chance to work with highly-skilled people that had my back and would give me feedback constantly to improve myself. Cons Sometimes I felt like team-building (especially cross-team) was not enough Advice to Management Continue like this, focus on people diversity and training them to stay and become highly-skilled.", "rating": 5, "pros": "Working at Medidate was very pleasant. People trust you from the beginning and they let you be creative and work on projects that could help the company. Being autonomous in my work was a big plus for me, but I also had the chance to work with highly-skilled people that had my back and would give me feedback constantly to improve myself.", "cons": "Sometimes I felt like team-building (especially cross-team) was not enough", "advice": "Continue like this, focus on people diversity and training them to stay and become highly-skilled."}, {"title": "Spannendes Unternehmen", "text": "Pros - viele Freiheiten und genügend Raum um seine Ideen einzubringen - tolles Team, freundlicher Umgang - offene Feedbackkultur - kurze Entscheidungswege - coole Teamevents Cons Leider hat das Büro keine Klimaanlage und auf Mülltrennung wird auch noch nicht geachtet.", "rating": 5, "pros": "- viele Freiheiten und genügend Raum um seine Ideen einzubringen", "cons": "Leider hat das Büro keine Klimaanlage und auf Mülltrennung wird auch noch nicht geachtet.", "advice": null}, {"title": "Großartiges Unternehmen mit tollen Leuten!", "text": "Pros Bei MediDate habe ich super nette Kollegen, die mich sofort herzlich aufgenommen haben. Das Unternehmen bietet die typische lockere Start-Up-Atmosphäre aber ist dabei trotzdem sehr innovativ und vorantreibend. Die Thematik von Schönheitsoperationen ist wahnsinnig spannend. Vor allem in Deutschland wird das ja eher als Tabu-Thema betrachtet, doch hinter den Kulissen merkt man erst, was für ein wachsender Markt sich hier versteckt!!! Für mich zählt aber auch sehr die Lage - Mitten in Berlin am Rosa-Luxemburg-Platz ;) Cons Für mich kein Kontra: sehr dynamisch, immer viel los, typisch Start-Up... Wer keine Lust auf Herausforderung hat und kein Teamplayer ist, ist eher falsch am Platz!", "rating": 5, "pros": "Bei MediDate habe ich super nette Kollegen, die mich sofort herzlich aufgenommen haben. Das Unternehmen bietet die typische lockere Start-Up-Atmosphäre aber ist dabei trotzdem sehr innovativ und vorantreibend. Die Thematik von Schönheitsoperationen ist wahnsinnig spannend. Vor allem in Deutschland wird das ja eher als Tabu-Thema betrachtet, doch hinter den Kulissen merkt man erst, was für ein wachsender Markt sich hier versteckt!!! Für mich zählt aber auch sehr die Lage - Mitten in Berlin am Rosa-Luxemburg-Platz ;)", "cons": "Für mich kein Kontra: sehr dynamisch, immer viel los, typisch Start-Up... Wer keine Lust auf Herausforderung hat und kein Teamplayer ist, ist eher falsch am Platz!", "advice": null}]