[{"title": "EmblemHealth", "text": "Pros Despite the tough times, there are still a lot of motivated and skilled workers here at Emblem. I have the fortune to be in an amazing team, my manager and director are really knowledgeable and hardworking. They inspire me at work, provide timely feedback, and support me to take on new challenges. I enjoy working here, a few more pros to highlight: competitive paid, friendly co-workers, on-site GYM, beautiful location, relax dress code, and excellent retirement contribution program. Cons The IT department is out sourced, it can take a really long time to get access or request service to fix problem. When some positions are terminated, their key knowledge are often gone too. Employee's Health insurance is a bit on the expensive side. Advice to Management There are a lot of great employee at Emblem, but we can use more. First bring finance into shape, so we can maintain work force and grow our business. Be the leader to use more advanced data driven approach to make better company decisions.", "rating": 5, "pros": "Despite the tough times, there are still a lot of motivated and skilled workers here at Emblem. I have the fortune to be in an amazing team, my manager and director are really knowledgeable and hardworking. They inspire me at work, provide timely feedback, and support me to take on new challenges. I enjoy working here, a few more pros to highlight: competitive paid, friendly co-workers, on-site GYM, beautiful location, relax dress code, and excellent retirement contribution program.", "cons": "The IT department is out sourced, it can take a really long time to get access or request service to fix problem. When some positions are terminated, their key knowledge are often gone too. Employee's Health insurance is a bit on the expensive side.", "advice": "There are a lot of great employee at Emblem, but we can use more. First bring finance into shape, so we can maintain work force and grow our business. Be the leader to use more advanced data driven approach to make better company decisions."}, {"title": "Be careful.", "text": "Pros Was a great company to work for prior to 2013. Financial stability was good, members and providers were very happy. Bonus, Benefit Package and PTO time were incentives to remain. Management treated Union employees fair. Cons After 2013, employees feared the new decision makers, the unknown financial instability and where it came from. Trust in leadership diminished. The fear of the unknown caused employee performance to drop. Advice to Management Improve leadership and people development. Gain trust again.", "rating": 3, "pros": "Was a great company to work for prior to 2013. Financial stability was good, members and providers were very happy. Bonus, Benefit Package and PTO time were incentives to remain. Management treated Union employees fair.", "cons": "After 2013, employees feared the new decision makers, the unknown financial instability and where it came from. Trust in leadership diminished. The fear of the unknown caused employee performance to drop.", "advice": "Improve leadership and people development. Gain trust again."}, {"title": "ACTUARIAL ANALYST", "text": "Pros has good work life balance Cons doesn't have a great culture", "rating": 3, "pros": "has good work life balance", "cons": "doesn't have a great culture", "advice": null}, {"title": "Company review", "text": "Pros work/life balance, commute to work Cons corporate culture, very little opportunity to move up, benefits/ low pay Advice to Management incentive for employees", "rating": 3, "pros": "work/life balance, commute to work", "cons": "corporate culture, very little opportunity to move up, benefits/ low pay", "advice": "incentive for employees"}, {"title": "Working there was a terrific experience, very nice company to work for", "text": "Pros Being around managers who help you every step of the way, they make sure you’re comfortable so you do your job Cons The advancement is very competitive, it’s easy to want to go places in this company so therefore it’s challenging because every one wants to advance Advice to Management Keep doing what you’re doing to help employees appreciate their jobs", "rating": 5, "pros": "Being around managers who help you every step of the way, they make sure you’re comfortable so you do your job", "cons": "The advancement is very competitive, it’s easy to want to go places in this company so therefore it’s challenging because every one wants to advance", "advice": "Keep doing what you’re doing to help employees appreciate their jobs"}, {"title": "Getting better - a good time to learn and help shape the company", "text": "Pros - Pays well - In transition, innovation and new exciting ideas happening - Room for growth and learning opportunities if you look for it - Flexibility with schedule, working remote and PTO - Good networks for support Cons - The corporate culture is a bit stuffy and dated. - Dated software, communication systems, dated design. - Lack of job security - Legacy employees or middle management that hold back new strategies. - Could better utilize in-house creative - Projects can move slowly Advice to Management Change the culture in the office, needs a modern and creative feeling. Increase transparency both laterally and top-down - no one can do their best work if they dont know what is going on. Update our software, use digital data to drive choices. Increase/leverage community partnerships - the company feels very insular and as a result come off as cold to the customer.", "rating": 5, "pros": "- Pays well", "cons": "- The corporate culture is a bit stuffy and dated.", "advice": "Change the culture in the office, needs a modern and creative feeling."}, {"title": "Case manager", "text": "Pros Great coworkers that step up to assist each other with work related issues and provide cohesiveness to get the job done Cons The work load too high and priorities changing too frequently to actually see things to fruition ... chaotic and unorganized Advice to Management New managers need to trust your experienced workers", "rating": 3, "pros": "Great coworkers that step up to assist each other with work related issues and provide cohesiveness to get the job done", "cons": "The work load too high and priorities changing too frequently to actually see things to fruition ... chaotic and unorganized", "advice": "New managers need to trust your experienced workers"}, {"title": "It Used to Be Great", "text": "Pros Generous benefits, including a lot of PTO. Cons No loyalty to long-term, hard-working employees. Upper management shows favoritism to their friends, regardless of whether or not they are competent employees. Advice to Management Listen to and reward the people that are in the trenches, doing all the work.", "rating": 3, "pros": "Generous benefits, including a lot of PTO.", "cons": "No loyalty to long-term, hard-working employees. Upper management shows favoritism to their friends, regardless of whether or not they are competent employees.", "advice": "Listen to and reward the people that are in the trenches, doing all the work."}, {"title": "Unresponsive Retirement Office", "text": "Pros Operates in an important industry - healthcare! Cons Extremely difficult to obtain a response from \"Retirement Office\" responsible for managing the pension plan. Advice to Management Be responsive to your (ex)employees request for information on employees' accumulated pension benefits. The person manning the Retirement e-mailbox does not reply to emails.", "rating": 1, "pros": "Operates in an important industry - healthcare!", "cons": "Extremely difficult to obtain a response from \"Retirement Office\" responsible for managing the pension plan.", "advice": "Be responsive to your (ex)employees request for information on employees' accumulated pension benefits. The person manning the Retirement e-mailbox does not reply to emails."}, {"title": "Manager", "text": "Pros Wonderful Employees - the people at EmblemHealth are some of the most dedicated, smart and hardworking people that I have ever had the honor to work with and learn from. My team works together to solve issues and goes out of their way to support each other day in and day out. Cons Navigating through an ever changing environment requires detailed and frequent communication to allow the staff to be on the same \"page\" as leadership. Advice to Management Continue the good decision making and driving for improving results at an accelerated pace. Keep in mind that as these changes and continual developments move forward for our growth, to take the time to explain the why’s and how’s to the employees to allow for proper understanding and perhaps allow for their voices to be heard for additional opportunities for improvement.", "rating": 3, "pros": "Wonderful Employees - the people at EmblemHealth are some of the most dedicated, smart and hardworking people that I have ever had the honor to work with and learn from. My team works together to solve issues and goes out of their way to support each other day in and day out.", "cons": "Navigating through an ever changing environment requires detailed and frequent communication to allow the staff to be on the same \"page\" as leadership.", "advice": "Continue the good decision making and driving for improving results at an accelerated pace. Keep in mind that as these changes and continual developments move forward for our growth, to take the time to explain the why’s and how’s to the employees to allow for proper understanding and perhaps allow for their voices to be heard for additional opportunities for improvement."}, {"title": "Customer Service and Claims Processing", "text": "Pros The daily commute is easy and they allow you to work at home. Cons There is no job security. Too many positions are being outsourced Advice to Management Do not outsource jobs.", "rating": 3, "pros": "The daily commute is easy and they allow you to work at home.", "cons": "There is no job security. Too many positions are being outsourced", "advice": "Do not outsource jobs."}, {"title": "We're Going Places", "text": "Pros Employees who care about each other and their customers. Cons The company's not developing good leaders. Advice to Management Focus on leadership development and employee engagement. So us how much you care.", "rating": 3, "pros": "Employees who care about each other and their customers.", "cons": "The company's not developing good leaders.", "advice": "Focus on leadership development and employee engagement. So us how much you care."}, {"title": "patient Advocte", "text": "Pros Encouraging manager. Flexibility in schedule Cons No room for advancement and growth", "rating": 3, "pros": "Encouraging manager. Flexibility in schedule", "cons": "No room for advancement and growth", "advice": null}, {"title": "Core values and integrity don’t matter, money does...", "text": "Pros Good amount of PTO benefits Cons Management practices are abysmal. HR is of no help at all. Advice to Management Look at company mission statement and the core values and then look at what you have been doing...what shame this company is falling apart...", "rating": 1, "pros": "Good amount of PTO benefits", "cons": "Management practices are abysmal. HR is of no help at all.", "advice": "Look at company mission statement and the core values and then look at what you have been doing...what shame this company is falling apart..."}, {"title": "n/a", "text": "Pros The company has multiple shifts Cons The company should provide more training Advice to Management The company should hire staff with basic managerial skills", "rating": 3, "pros": "The company has multiple shifts", "cons": "The company should provide more training", "advice": "The company should hire staff with basic managerial skills"}, {"title": "Team lead", "text": "Pros Feedback was important to company. Cons New York based company for better oppertunity", "rating": 3, "pros": "Feedback was important to company.", "cons": "New York based company for better oppertunity", "advice": null}, {"title": "Poor decisions Making", "text": "Pros Decent salary structure, good benefits, more than usual holidays, great PTO benefits Cons Bad communication, horrible decision making. Advice to Management Someone needs to get a grip on the organization as t is clearly on a nose dive. Poor decisions being made and the quality if service its a complete disaster.", "rating": 3, "pros": "Decent salary structure, good benefits, more than usual holidays, great PTO benefits", "cons": "Bad communication, horrible decision making.", "advice": "Someone needs to get a grip on the organization as t is clearly on a nose dive. Poor decisions being made and the quality if service its a complete disaster."}, {"title": "Claims Specialist", "text": "Pros Great location, working hours , benefits, environement and many employees had longevity with this employer Cons Not a good tuition reimbursement program and company got sold and most employees were terminated. Advice to Management Improving system and employee workflows for better productivity to allow the company to be more profitable and maintain the ability to keep more employees", "rating": 5, "pros": "Great location, working hours , benefits, environement and many employees had longevity with this employer", "cons": "Not a good tuition reimbursement program and company got sold and most employees were terminated.", "advice": "Improving system and employee workflows for better productivity to allow the company to be more profitable and maintain the ability to keep more employees"}, {"title": "Senior Medical Adjuster", "text": "Pros Learn a lot about medical claim Great Instructors Cons Salary has dropped down alot", "rating": 3, "pros": "Learn a lot about medical claim Great Instructors", "cons": "Salary has dropped down alot", "advice": null}, {"title": "Bitter Sweet", "text": "Pros Great Health Insurance, Paid Holidays, Cons Under paid, horrible employees, little to no room for advancement, family members working under family members Advice to Management Appreciate your staff, pay people according to industry standards.", "rating": 3, "pros": "Great Health Insurance, Paid Holidays,", "cons": "Under paid, horrible employees, little to no room for advancement, family members working under family members", "advice": "Appreciate your staff, pay people according to industry standards."}, {"title": "Working at Emblem", "text": "Pros Good work environment Nice People to work Cons I do not have any", "rating": 5, "pros": "Good work environment", "cons": "I do not have any", "advice": null}, {"title": "Relaxed yet very professional work environment.", "text": "Pros Great paid time off (23 days on first year + 10+ holidays). 401K gets matched up to 6%. Telecommuting is an option a few times a week. Relaxed dress code. On-premises gym costs only $10 a month! Co-workers and immediate management are approachable and have an open door policy. Cons The commute. Even though lower manhattan is reachable by most subway lines, unless you live around there or downtown Brooklyn, you have at least a 40 minute commute. That said, the area has certainly been through a bohemian renaissance post 9/11, and features some great eats, a mighty fine cup of coffee, museums, bars, farmers markets, plenty of public spaces and waterfront lunch-time walks. Health insurance is on the pricy end. There are a lot of people working there for 30, 20, 10 years and it's a bit challenging to get fresh ideas through. Advice to Management Get with the times. Value innovation and forward thinking ideas by setting trends, not following them. Yes, that means taking risks.", "rating": 5, "pros": "Great paid time off (23 days on first year + 10+ holidays). 401K gets matched up to 6%. Telecommuting is an option a few times a week. Relaxed dress code. On-premises gym costs only $10 a month! Co-workers and immediate management are approachable and have an open door policy.", "cons": "The commute. Even though lower manhattan is reachable by most subway lines, unless you live around there or downtown Brooklyn, you have at least a 40 minute commute. That said, the area has certainly been through a bohemian renaissance post 9/11, and features some great eats, a mighty fine cup of coffee, museums, bars, farmers markets, plenty of public spaces and waterfront lunch-time walks.", "advice": "Get with the times. Value innovation and forward thinking ideas by setting trends, not following them. Yes, that means taking risks."}, {"title": "Financial Analyst", "text": "Pros The salary was competitive with top corporations. The benefit and annual compensations were good as well. Technology in certain areas were a little outdated. Opportunity to change position was good. Cons The company has joined ranks of outsourcing work to India and large layoffs. No area of the company is safe from this outsourcing. The pension plan has been frozen or basically discontinued Advice to Management Retain some of the knowledge from the people that you are laying off. Majority of the skilled employees are leaving the company due to uncertainty of their future.", "rating": 3, "pros": "The salary was competitive with top corporations. The benefit and annual compensations were good as well. Technology in certain areas were a little outdated. Opportunity to change position was good.", "cons": "The company has joined ranks of outsourcing work to India and large layoffs. No area of the company is safe from this outsourcing. The pension plan has been frozen or basically discontinued", "advice": "Retain some of the knowledge from the people that you are laying off. Majority of the skilled employees are leaving the company due to uncertainty of their future."}, {"title": "QA Specialist", "text": "Pros Telecommuting option and decent benefits (Health Insurance/401K/Pension Plan). Cons New management, new structure. Faithful employees were laid off due to mismanagement of funds. Even the benefits were decreased year after year. The company waited until the last minute to inform staff of lay off during a town hall meeting. They said they were closing and nothing much was said thereafter. Very disappointing.", "rating": 3, "pros": "Telecommuting option and decent benefits (Health Insurance/401K/Pension Plan).", "cons": "New management, new structure. Faithful employees were laid off due to mismanagement of funds. Even the benefits were decreased year after year. The company waited until the last minute to inform staff of lay off during a town hall meeting. They said they were closing and nothing much was said thereafter. Very disappointing.", "advice": null}, {"title": "Unknown", "text": "Pros No micromanagement. Decent pay. Cons Nasty co workers No support Lay offs/firings Advice to Management Stand up for your staff.", "rating": 3, "pros": "No micromanagement. Decent pay.", "cons": "Nasty co workers", "advice": "Stand up for your staff."}, {"title": "Beware of fake reviews...the company is being dragged under by the chiefs", "text": "Pros ...pretty soon most people will be \"working\" from home one way or another. Cons Health insurance at a health insurance company is worse than being under the ACA aka Obamacare. Management is pilfering the last gold on the sinking ship but expects you to do more so they can give themselves bonuses...dont worry you too can get a bonus(1k) if your managers put in the paperwork and upper management approvea. Word of advice...unless you are being hired for director and above (*probably AVP and above*) dont waste your time...even HealthFirst is better now. Advice to Management Stop the act! Sell the company to Cognizant and Im sure both DeBlasio and Cuomo will have no objections.", "rating": 1, "pros": "...pretty soon most people will be \"working\" from home one way or another.", "cons": "Health insurance at a health insurance company is worse than being under the ACA aka Obamacare.", "advice": "Stop the act! Sell the company to Cognizant and Im sure both DeBlasio and Cuomo will have no objections."}, {"title": "Senior Customer Service Rep", "text": "Pros Union with good pay, and benefits Cons Management not flexible with time off Advice to Management Keep in mind that life events occur", "rating": 3, "pros": "Union with good pay, and benefits", "cons": "Management not flexible with time off", "advice": "Keep in mind that life events occur"}, {"title": "Sr Desktop Support Analyst", "text": "Pros My peers were a great bunch of people to work with. Our building had a small gym with handball courts and a sauna and steam room in both ladies' and men's locker rooms. The commute was very decent since the site was located on Long Island. Benefits were great in the beginning. Cons As a former employee of Vytra, I experienced the downfall of the company after merging with HIP. Once Vytra was merely just a label of a policy the company offered, HIP merged with GHI. The marriage of the two companies resulted in the birth of EmblemHealth. Communication between management and staff was nil to none, resulting in a poor moral amongst the workforce.", "rating": 3, "pros": "My peers were a great bunch of people to work with. Our building had a small gym with handball courts and a sauna and steam room in both ladies' and men's locker rooms. The commute was very decent since the site was located on Long Island.", "cons": "As a former employee of Vytra, I experienced the downfall of the company after merging with HIP. Once Vytra was merely just a label of a policy the company offered, HIP merged with GHI. The marriage of the two companies resulted in the birth of EmblemHealth.", "advice": null}, {"title": "Grievance and Appeals Specialist", "text": "Pros I will always be grateful for the wealth of knowledge and skills I gained during my 12 years employed with the company. Cons Things have changed drastically over the past couple of years for the company. Things have taken a turn for the worst and it is really heartbreaking. A lot of dedicated , hardworking people have lost their jobs due to layoffs and jobs were outsourced to India. Advice to Management Stay strong", "rating": 1, "pros": "I will always be grateful for the wealth of knowledge and skills I gained during my 12 years employed with the company.", "cons": "Things have changed drastically over the past couple of years for the company. Things have taken a turn for the worst and it is really heartbreaking. A lot of dedicated , hardworking people have lost their jobs due to layoffs and jobs were outsourced to India.", "advice": "Stay strong"}, {"title": "EDI Specialist", "text": "Pros IBM Main Frame legacy system Cons Migrating system to Server system", "rating": 3, "pros": "IBM Main Frame legacy system", "cons": "Migrating system to Server system", "advice": null}, {"title": "Manager", "text": "Pros Good people to work with, flexibility with working from home and hours Cons so much re-organization and re-structuring and as a result no opportunity for establishing a career path. Senior Management is not honest about how poor the company is doing financially which is insulting given the amount of layoffs that are occurring Advice to Management more effort to retain top talent", "rating": 1, "pros": "Good people to work with, flexibility with working from home and hours", "cons": "so much re-organization and re-structuring and as a result no opportunity for establishing a career path. Senior Management is not honest about how poor the company is doing financially which is insulting given the amount of layoffs that are occurring", "advice": "more effort to retain top talent"}, {"title": "Company changing for the better; a lot of opportunity", "text": "Pros As a company doing business for a long time in a traditional industry, it's established, has credibility in the market, good benefits and community ties. A lot of people make careers here. It's also a humble company, compared to places like Aetna & United, which translates to a less cut-throat, dog-eat-dog culture -- generally, people get along well. Because health care is undergoing so much change, there's a lot of opportunity at the company for creativity and professional advancement. Cons Because people come and stay, some get complacent or are stubbornly committed to old norms, which can be frustrating to deal with for those who embrace our changing environment. Also, historically, building and maintaining a strong culture has not been a priority (former CEO was a ghost), so it was up to individual departments and leaders to engage their teams. Some did it better than others. Things are shifting in the right direction now with greater focus on company-wide culture and employee engagement, but there's further to go. Advice to Management Make time for the less quantifiable aspects of your job. Focus on inspiring and engaging employees for even better results. Also, continue to raise the bar on employee performance. We're in a rapidly changing industry and need to maintain a strong talent pool, which will continue to require tough decisions about staff.", "rating": 5, "pros": "As a company doing business for a long time in a traditional industry, it's established, has credibility in the market, good benefits and community ties. A lot of people make careers here. It's also a humble company, compared to places like Aetna & United, which translates to a less cut-throat, dog-eat-dog culture -- generally, people get along well. Because health care is undergoing so much change, there's a lot of opportunity at the company for creativity and professional advancement.", "cons": "Because people come and stay, some get complacent or are stubbornly committed to old norms, which can be frustrating to deal with for those who embrace our changing environment. Also, historically, building and maintaining a strong culture has not been a priority (former CEO was a ghost), so it was up to individual departments and leaders to engage their teams. Some did it better than others. Things are shifting in the right direction now with greater focus on company-wide culture and employee engagement, but there's further to go.", "advice": "Make time for the less quantifiable aspects of your job. Focus on inspiring and engaging employees for even better results. Also, continue to raise the bar on employee performance. We're in a rapidly changing industry and need to maintain a strong talent pool, which will continue to require tough decisions about staff."}, {"title": "Case manager/utilization review", "text": "Pros In the beginning, it was wonderful. Manageable case load, good team moral, supervisor with deep knowledge base and a ton of experience. They also acknowledged that we had lives outside of work. Cons The merging of HIP with GHI was the beginning of the end. Case loads continually increasing, monthly audits that were impossible to pass which were then used to explain reason for not receiving a bonus, sudden job title changes without warning or feedback from employees, and inability to retain seasoned, experienced staff because if the aforementioned. Advice to Management That's not allowed... email your recommendations to your supervisor and she will neither acknowledge receipt of same nor pass it along if she even bothers to read it.", "rating": 1, "pros": "In the beginning, it was wonderful. Manageable case load, good team moral, supervisor with deep knowledge base and a ton of experience. They also acknowledged that we had lives outside of work.", "cons": "The merging of HIP with GHI was the beginning of the end. Case loads continually increasing, monthly audits that were impossible to pass which were then used to explain reason for not receiving a bonus, sudden job title changes without warning or feedback from employees, and inability to retain seasoned, experienced staff because if the aforementioned.", "advice": "That's not allowed... email your recommendations to your supervisor and she will neither acknowledge receipt of same nor pass it along if she even bothers to read it."}, {"title": "QA Analyst", "text": "Pros Great place to work overall with good benefits Cons Not stable. Company had a massive layoff over the past 12 months. It's becoming more of an off shore company. Advice to Management With this new CEO and the decision that she is making don't waste your time company is going to get worst before it rise need a new CEO that cares about the members' health instant of money.", "rating": 3, "pros": "Great place to work overall with good benefits", "cons": "Not stable. Company had a massive layoff over the past 12 months. It's becoming more of an off shore company.", "advice": "With this new CEO and the decision that she is making don't waste your time company is going to get worst before it rise need a new CEO that cares about the members' health instant of money."}, {"title": "Changing Times", "text": "Pros EmblemHealth Corporate has a great facility downtown with a gym and healthcare benefits. Relaxed not stressful experience with hours good for people who have kids and/or want a real work life balance. Cons Management increased workers hours to an 8 hour day without lunch and no additional compensation. Management changed the vacation policy for seniored employees without compensation. Financial difficulties are causing questionable treatment for employee benefits and healhcare benefits streamlined. Advice to Management Look at your employees and benefits package. More communication from top down.", "rating": 3, "pros": "EmblemHealth Corporate has a great facility downtown with a gym and healthcare benefits. Relaxed not stressful experience with hours good for people who have kids and/or want a real work life balance.", "cons": "Management increased workers hours to an 8 hour day without lunch and no additional compensation. Management changed the vacation policy for seniored employees without compensation. Financial difficulties are causing questionable treatment for employee benefits and healhcare benefits streamlined.", "advice": "Look at your employees and benefits package. More communication from top down."}, {"title": "Registered Nurse", "text": "Pros Sense of camaraderie between coworkers Cons Menial tasks, not easy to move up in the company", "rating": 3, "pros": "Sense of camaraderie between coworkers", "cons": "Menial tasks, not easy to move up in the company", "advice": null}, {"title": "Learning experience", "text": "Pros I worked at EmblemHealth for 20 years. I learned quite a lot during my tenure there. There was always something new, and just when you got the hang of it, something else was given for you to learn. I had no problem with that. I took every bit of that experience and left with a very health looking resume. Cons Lack of communication between management and employees. When things changed, my dept was always the last to hear of it. Advice to Management Be more accessible to your employees. You all need each other to get the job done", "rating": 5, "pros": "I worked at EmblemHealth for 20 years. I learned quite a lot during my tenure there. There was always something new, and just when you got the hang of it, something else was given for you to learn. I had no problem with that. I took every bit of that experience and left with a very health looking resume.", "cons": "Lack of communication between management and employees. When things changed, my dept was always the last to hear of it.", "advice": "Be more accessible to your employees. You all need each other to get the job done"}, {"title": "Director", "text": "Pros New Leadership Driven to be best in class Desire to innovate Cons Systems from HIP and GHI don't meld Marketing challenges and limited Sales and marketing presence in the communities Advice to Management Keep implementing strategies to make the company relevant to today's and tomorrow's consumer.", "rating": 3, "pros": "New Leadership", "cons": "Systems from HIP and GHI don't meld", "advice": "Keep implementing strategies to make the company relevant to today's and tomorrow's consumer."}, {"title": "Neutral Outlook", "text": "Pros The company provides learning and development training. Cons Need to expand on departmental communications Advice to Management Some management was friendly.", "rating": 3, "pros": "The company provides learning and development training.", "cons": "Need to expand on departmental communications", "advice": "Some management was friendly."}, {"title": "Manager", "text": "Pros The coworkers are wonderful people Cons Laid off huge amounts of employees to save money. People with 10+ years experience were placed on a list by someone who hardly worked with them. This company has changed for the worse. Advice to Management None", "rating": 1, "pros": "The coworkers are wonderful people", "cons": "Laid off huge amounts of employees to save money. People with 10+ years experience were placed on a list by someone who hardly worked with them. This company has changed for the worse.", "advice": "None"}, {"title": "Just okay", "text": "Pros Laid back environment with great coworkers. Company gym on premises. Dress down every day. Most departments work from home 2 days a week. Cons Not stable. Company had a massive layoff over the past 12 months. It's becoming more of an off shore company. Advice to Management Create stability", "rating": 3, "pros": "Laid back environment with great coworkers. Company gym on premises. Dress down every day. Most departments work from home 2 days a week.", "cons": "Not stable. Company had a massive layoff over the past 12 months. It's becoming more of an off shore company.", "advice": "Create stability"}, {"title": "Lie - cheat - steal - the new EH motto", "text": "Pros Free water, free elevator rides (both up & down), and free pain. Cons Each new day brings fresh new pain. The lie - Cognizant will hire/rebadge EH employee for two years with a bonus after completing each year. The cheat - Cognizant sends out layoff notices to a number of rebadged employees with termination dates just short of the 1st year anniversary. The steal - not paying the bonus . Advice to Management Stop. Just stop.", "rating": 1, "pros": "Free water, free elevator rides (both up & down), and free pain.", "cons": "Each new day brings fresh new pain. The lie - Cognizant will hire/rebadge EH employee for two years with a bonus after completing each year. The cheat - Cognizant sends out layoff notices to a number of rebadged employees with termination dates just short of the 1st year anniversary. The steal - not paying the bonus .", "advice": "Stop. Just stop."}, {"title": "EmblemHealth", "text": "Pros there are no pros at all Cons I would give zero stars if possible. The company was hit very hard by Hurricane Sandy and nearly lost their data centers due to no management or mis-management by IT leadership. As a result, they had to slash costs wherever they could. They froze salaries, cut or stopped bonues - for the very people in IT that worked themselves into the ground to keep the company in business and recover. Two years later they outsourced IT to Cognizant. They lied, they cheated, they stole and in the end while they still exist as a company many hard working IT people lost their jobs. Advice to Management You should take the walk of shame that Cersei Lannister did in Game of Thrones.", "rating": 1, "pros": "there are no pros at all", "cons": "I would give zero stars if possible. The company was hit very hard by Hurricane Sandy and nearly lost their data centers due to no management or mis-management by IT leadership. As a result, they had to slash costs wherever they could. They froze salaries, cut or stopped bonues - for the very people in IT that worked themselves into the ground to keep the company in business and recover. Two years later they outsourced IT to Cognizant. They lied, they cheated, they stole and in the end while they still exist as a company many hard working IT people lost their jobs.", "advice": "You should take the walk of shame that Cersei Lannister did in Game of Thrones."}, {"title": "ASO billing.", "text": "Pros Growth opportunity within company, friendly environment, great benefits for union employees. Cons Out sourcing all operations job. Changed working hours and cut holidays. Advice to Management Conserve more experienced employees", "rating": 3, "pros": "Growth opportunity within company, friendly environment, great benefits for union employees.", "cons": "Out sourcing all operations job. Changed working hours and cut holidays.", "advice": "Conserve more experienced employees"}, {"title": "Was a Great Company before new CEO", "text": "Pros Emblem Health is a great company to work for that offer good benefits, great pay and excellent work hours and days off. Cons New CEO decided to outsource a lot of Department and relocate center. Advice to Management With this new CEO and the decision that she is making don't waste your time company is going to get worst before it rise need a new CEO that cares about the members' health instant of money.", "rating": 5, "pros": "Emblem Health is a great company to work for that offer good benefits, great pay and excellent work hours and days off.", "cons": "New CEO decided to outsource a lot of Department and relocate center.", "advice": "With this new CEO and the decision that she is making don't waste your time company is going to get worst before it rise need a new CEO that cares about the members' health instant of money."}, {"title": "Sales Representative", "text": "Pros Excellent health insurance coverage. Room for career advancement & professional training. Cons Stressful environment with low moral at times. But overal all, it was a great place to work prior to company transitional changes. Advice to Management Upper management should consider including sales team for input and advice when deciding to change or delete consumer benefits.", "rating": 3, "pros": "Excellent health insurance coverage. Room for career advancement & professional training.", "cons": "Stressful environment with low moral at times. But overal all, it was a great place to work prior to company transitional changes.", "advice": "Upper management should consider including sales team for input and advice when deciding to change or delete consumer benefits."}, {"title": "Senior Director", "text": "Pros Some experienced staff with historical knowledge Cons Incoming leadership bring in consultants and management that are inexpreinced Advice to Management Recognize the in-house talent.", "rating": 3, "pros": "Some experienced staff with historical knowledge", "cons": "Incoming leadership bring in consultants and management that are inexpreinced", "advice": "Recognize the in-house talent."}, {"title": "Job Security", "text": "Pros EmblemHealth was initially a great company to be employed. The benefits package, salary and opportunities were excellent. Cons There is no longer job security. Many of the functions of the company are being outsourced to other countries. Advice to Management The customers do not like speaking with the new offshore staff.", "rating": 3, "pros": "EmblemHealth was initially a great company to be employed. The benefits package, salary and opportunities were excellent.", "cons": "There is no longer job security. Many of the functions of the company are being outsourced to other countries.", "advice": "The customers do not like speaking with the new offshore staff."}, {"title": "Run, don't walk away from any Emblem job posting!", "text": "Pros To much to say about this innovative company full of new ideas! Multiple learning opportunities! As their massive layoffs have led to the trickle down effects of voluntarily resignations due to excessive workloads you get to learn everyone else's job in addition to your own, making you feel like a true team player helping the company save Money paying your salary only, while you do the work of five others, cutting costs by five salaries! Company sponsored tourism; opportunities to travel to other countries like India to train your replacement, a great, cost-effective way to learn about other cultures! Company sponsored leisure time, plenty of time to scroll job ads due to multiple system issues preventing work being done while you have 45 minute hold times with the newly outsourced IT department that knows nothing but how to put in a ticket since they don't know our systems. Innovative ideas by upper management hired within six months such as eliminate all positions, make people reapply and IF after 20 years of working with Emblem they are a potential candidate, interview and rehire but require travel into NYC, which is a great perk for the disabled employees who work at home and have such heavy workloads they can't take time off for surgery, they have no time for physical therapy, this opportunity for excessive commuting provides the physical challenges of PT without the ridiculously high co-pay! Weight loss! Get that bikini body with minimal effort since your workload does not allow time for eating, who needs P90x when you can just get a job at Emblem??? Time management skills, Emblem cares about its employees so much that it added on an extra hour of work time daily to help get ahead of your case load! Higher level of esteem and feeling of self worth doing volunteer work because that extra hour in addition to hours worked on days off, are all considered volunteer work! Why take the time to volunteer to help a charity when you can help this corporation instead? Tax savings, by eliminating well earned bonuses and raises it's less taxes you need to deal with when it's time to file. Cons This company is beyond the point of bleeding it's employees dry. There is no blood left, it's better to compare it to a law and order episode that is exhuming a body after 20 years hoping on a strand of DNA. Shame on this company for what they have done to so many talented, valuable, loyal employees. Advice to Management Stop raising the cost of health insurance. I'd hate to have to see you all have to pay a fortune in medical when Karma comes back to bite you.", "rating": 1, "pros": "To much to say about this innovative company full of new ideas! Multiple learning opportunities! As their massive layoffs have led to the trickle down effects of voluntarily resignations due to excessive workloads you get to learn everyone else's job in addition to your own, making you feel like a true team player helping the company save Money paying your salary only, while you do the work of five others, cutting costs by five salaries! Company sponsored tourism; opportunities to travel to other countries like India to train your replacement, a great, cost-effective way to learn about other cultures! Company sponsored leisure time, plenty of time to scroll job ads due to multiple system issues preventing work being done while you have 45 minute hold times with the newly outsourced IT department that knows nothing but how to put in a ticket since they don't know our systems. Innovative ideas by upper management hired within six months such as eliminate all positions, make people reapply and IF after 20 years of working with Emblem they are a potential candidate, interview and rehire but require travel into NYC, which is a great perk for the disabled employees who work at home and have such heavy workloads they can't take time off for surgery, they have no time for physical therapy, this opportunity for excessive commuting provides the physical challenges of PT without the ridiculously high co-pay! Weight loss! Get that bikini body with minimal effort since your workload does not allow time for eating, who needs P90x when you can just get a job at Emblem??? Time management skills, Emblem cares about its employees so much that it added on an extra hour of work time daily to help get ahead of your case load! Higher level of esteem and feeling of self worth doing volunteer work because that extra hour in addition to hours worked on days off, are all considered volunteer work! Why take the time to volunteer to help a charity when you can help this corporation instead? Tax savings, by eliminating well earned bonuses and raises it's less taxes you need to deal with when it's time to file.", "cons": "This company is beyond the point of bleeding it's employees dry. There is no blood left, it's better to compare it to a law and order episode that is exhuming a body after 20 years hoping on a strand of DNA. Shame on this company for what they have done to so many talented, valuable, loyal employees.", "advice": "Stop raising the cost of health insurance. I'd hate to have to see you all have to pay a fortune in medical when Karma comes back to bite you."}, {"title": "Senior Analyst", "text": "Pros Free coffee, max 28 PTOs Cons Recently Max 33 PTOs cut to 28days", "rating": 3, "pros": "Free coffee, max 28 PTOs", "cons": "Recently Max 33 PTOs cut to 28days", "advice": null}, {"title": "It's a job", "text": "Pros Great place to work overall with good benefits Cons Staff morale is pretty low. Advice to Management More opportunities for advancement.", "rating": 5, "pros": "Great place to work overall with good benefits", "cons": "Staff morale is pretty low.", "advice": "More opportunities for advancement."}, {"title": "Program Manager", "text": "Pros Great leadership and team. Company cared about employees and motivated them to give 150%. Cons Change in leadership made for a hostile environment. Financial problems brought layoffs", "rating": 3, "pros": "Great leadership and team. Company cared about employees and motivated them to give 150%.", "cons": "Change in leadership made for a hostile environment. Financial problems brought layoffs", "advice": null}, {"title": "Business Analyst", "text": "Pros You any have the opportunity to solve problems. Cons The Information System and Operation functions are provided by an outsourcing company. Advice to Management Let another Not-For-Profit health care company take over EmblemHealth", "rating": 3, "pros": "You any have the opportunity to solve problems.", "cons": "The Information System and Operation functions are provided by an outsourcing company.", "advice": "Let another Not-For-Profit health care company take over EmblemHealth"}, {"title": "Manager", "text": "Pros Work Hours are good and flexible Cons Uncertainty on future prospects with company Advice to Management Trust between various between management", "rating": 3, "pros": "Work Hours are good and flexible", "cons": "Uncertainty on future prospects with company", "advice": "Trust between various between management"}, {"title": "Intern", "text": "Pros Enjoyable work experience and atmosphere Cons Internship could have provided more opportunities", "rating": 5, "pros": "Enjoyable work experience and atmosphere", "cons": "Internship could have provided more opportunities", "advice": null}, {"title": "Revolving door", "text": "Pros Can't think of any at the moment. Cons Company has been mismanaged for a long time. A lot of shuffling going on in senior management level lately. Advice to Management If you want to clean house, you still have more work to do. Company will not transform if you have managers resisting to change. Knowledge base is gone and those still employed have no clue what their job functions are. They were always dependent on others to do their work.", "rating": 1, "pros": "Can't think of any at the moment.", "cons": "Company has been mismanaged for a long time. A lot of shuffling going on in senior management level lately.", "advice": "If you want to clean house, you still have more work to do. Company will not transform if you have managers resisting to change. Knowledge base is gone and those still employed have no clue what their job functions are. They were always dependent on others to do their work."}, {"title": "EH", "text": "Pros It was a great place to work for over 20 years! Cons Recently Emblem has been laying off a lot of employees due to outsourcing to India. Advice to Management I understand that decisions were made for financial reasons but there should have been a way to keep more jobs in America.", "rating": 3, "pros": "It was a great place to work for over 20 years!", "cons": "Recently Emblem has been laying off a lot of employees due to outsourcing to India.", "advice": "I understand that decisions were made for financial reasons but there should have been a way to keep more jobs in America."}, {"title": "Customer Service Advocate II", "text": "Pros Awesome people and great benefits Cons The are nothing at all.", "rating": 5, "pros": "Awesome people and great benefits", "cons": "The are nothing at all.", "advice": null}, {"title": "Company is currently restructuring!", "text": "Pros Work with people in NY office Cons Company Outsourcing jobs out of America!", "rating": 3, "pros": "Work with people in NY office", "cons": "Company Outsourcing jobs out of America!", "advice": null}, {"title": "Case Management", "text": "Pros Work from home. Used to be a great place to work. I'm unable to list an additional pros as they're are none. Cons Too many to list Departments are being outsourced to another company overseas. Company does not practice their own mission statement, this is a serious red flag Management lacks the skills needed to complete a job thoroughly. Duplicating work and wasting time. Management is dishonest and uncaring. Members receive sub par services and treatment as the employees have no idea what they are doing. The company has gone downhill since the new CEO was hired. Advice to Management Outsourcing areas overseas inadvertently led to our members not receiving the best care possible. They are the core of our company and deserve better. Shameful and embarrassing to say the least. Bad practice has its consequences.", "rating": 1, "pros": "Work from home. Used to be a great place to work. I'm unable to list an additional pros as they're are none.", "cons": "Too many to list", "advice": "Outsourcing areas overseas inadvertently led to our members not receiving the best care possible. They are the core of our company and deserve better. Shameful and embarrassing to say the least. Bad practice has its consequences."}, {"title": "Manager", "text": "Pros - Good pay and benefits - Smart, ambitious people - Concerted efforts by upper management to be transparent and loop in staff Cons - Lack of overarching strategy - Widespread confusion over roles and project ownership - Disproportionate distribution of work Advice to Management Clarify roles and ownership and be tougher on staff who don't pull their weight.", "rating": 3, "pros": "- Good pay and benefits", "cons": "- Lack of overarching strategy", "advice": "Clarify roles and ownership and be tougher on staff who don't pull their weight."}, {"title": "Customer service representative", "text": "Pros Benefits and salary were excellent. Cons mainframe computers were outdated.", "rating": 3, "pros": "Benefits and salary were excellent.", "cons": "mainframe computers were outdated.", "advice": null}, {"title": "Senior Staff Accountant", "text": "Pros Had great opportunities to move up within the company. Cons Massive layoffs with jobs outsourced to India. No loyalty to loyal workers. Advice to Management Be loyal to hard working employees.", "rating": 5, "pros": "Had great opportunities to move up within the company.", "cons": "Massive layoffs with jobs outsourced to India. No loyalty to loyal workers.", "advice": "Be loyal to hard working employees."}, {"title": "Leave work at work", "text": "Pros Benefits and pay were awesome Cons feels like management doesn't care", "rating": 3, "pros": "Benefits and pay were awesome", "cons": "feels like management doesn't care", "advice": null}, {"title": "Customer service specialist III", "text": "Pros Loved people I worked with. It was union based. A lot of holidays in the year off. Most of my Supervisors were like family to me. Cons Not getting rewarded like we should've for all the hard work we do daily.", "rating": 1, "pros": "Loved people I worked with. It was union based. A lot of holidays in the year off. Most of my Supervisors were like family to me.", "cons": "Not getting rewarded like we should've for all the hard work we do daily.", "advice": null}, {"title": "Outsourcing is Troubling", "text": "Pros One must pay into benefits, but they cover nearly everything: medical, vision, dental. Hours are good. Guaranteed raise each year with union pledge. Cons Union jobs are being outsourced and non-union management jobs are being expunged. There is no sense of confidence in their positions. Advice to Management Emblem will probably lose all of their City of New York contracts once they realize 75% of all jobs have been outsourced.", "rating": 5, "pros": "One must pay into benefits, but they cover nearly everything: medical, vision, dental. Hours are good. Guaranteed raise each year with union pledge.", "cons": "Union jobs are being outsourced and non-union management jobs are being expunged. There is no sense of confidence in their positions.", "advice": "Emblem will probably lose all of their City of New York contracts once they realize 75% of all jobs have been outsourced."}, {"title": "Hospital Supervisor", "text": "Pros Manager was supportive, innovative, and always boosting morale. Cons Lay offs, outsourced billing dept to India.", "rating": 3, "pros": "Manager was supportive, innovative, and always boosting morale.", "cons": "Lay offs, outsourced billing dept to India.", "advice": null}, {"title": "Good Company", "text": "Pros Good Benefits, Great Salary, Good Hours Cons Limited room for advancement in some Depts Advice to Management Promote more advancement within company", "rating": 5, "pros": "Good Benefits, Great Salary, Good Hours", "cons": "Limited room for advancement in some Depts", "advice": "Promote more advancement within company"}, {"title": "Current employee soon to be unemployed due to layoffs", "text": "Pros Medical benefits, vacation, wonderful co workers at Emblem Health Cons Communication do not have anymore cons for Emblem Health", "rating": 5, "pros": "Medical benefits, vacation, wonderful co workers at Emblem Health", "cons": "Communication do not have anymore cons for Emblem Health", "advice": null}, {"title": "good learning experience, has kinks to straighten out", "text": "Pros great pay and benefits, great employees, a great learning experience Cons needs better management and employee training Advice to Management 1. Day to day duties and expectations should be clearly detailed from the beginning- the job description as initially discussed was abstract at best and was never consistent from person to person, leaving a lot of ambiguity and guess work for employees. In all fairness, the patient advocate program was newly rolled out and therefore many of the specifics could not have been appreciated until further examination after the program was executed. 2. Employers were dishonest about the position merely being a pilot position during hiring and even after orientation. The respectable thing to do would have been to state this straight out. 3. Due to the fact that most new hires had little to no healthcare experience, there really should have been a supervisor present on a day to day basis for the first month to help acclimate new hires to facilities and to demonstrate which duties to focus on and how to best go about doing so. 4. Adequate tools were not given to allow employees to fulfill their daily duties without any major inconveniences- for example, the position required checking wait times for patients but employees were not given reliable internet connectivity to access EPIC. Another duty was to market patient portal- but we were never given any tutorials or access on how to navigate the patient portal we were trying to advertise. Also were not given a person in the dept for the patient portal to notify of glitches, misinformation posted, general help, etc. etc. 4. Also wish there was better administration in the medical facility its self, as there was a perpetual struggle to get any guidance or support in advocate goals or objectives. Not to mention there were enormous problems with employee morale, union culture, staff communication and organization but this applies to AdvantageCare Physicians and not as much EmblemHealth.", "rating": 3, "pros": "great pay and benefits, great employees, a great learning experience", "cons": "needs better management and employee training", "advice": "1. Day to day duties and expectations should be clearly detailed from the beginning- the job description as initially discussed was abstract at best and was never consistent from person to person, leaving a lot of ambiguity and guess work for employees. In all fairness, the patient advocate program was newly rolled out and therefore many of the specifics could not have been appreciated until further examination after the program was executed."}, {"title": "Case Specialist", "text": "Pros Great people to work with , benefits, environment, Cons Layoffs, management needs more training .", "rating": 3, "pros": "Great people to work with , benefits, environment,", "cons": "Layoffs, management needs more training .", "advice": null}, {"title": "Senior medical clerk", "text": "Pros It has good people, team players, company over all was a good place to work. Cons It was alot of layoffs Advice to Management Management was great", "rating": 5, "pros": "It has good people, team players, company over all was a good place to work.", "cons": "It was alot of layoffs", "advice": "Management was great"}, {"title": "Sales", "text": "Pros The jobs was easy, great co -worker, easy/great location, some decent benefits, and good hours. I don't have any other good things I can think of but I have to write a minimum of 20 words. Cons The poorest communication I have ever seen. No transparency. Poor Product management. Poor Member/Customer Service. Poor internal delegation. Poor Morale. Company does not care about their employees. They once did care about employees. Time Clock Shaving-adjusting employee hours to avoid overtime. Company is dismantling departments, sacrificing quality, and trying to explain/justify Upper level management's loss of over 1 Billion dollars from the past 3 years. Outsourcing to 3rd world countries. Taking jobs away from Americans. Advice to Management Take responsibility for your actions. Transparency and Communications. Keep Jobs here in the US not Manila.", "rating": 1, "pros": "The jobs was easy, great co -worker, easy/great location, some decent benefits, and good hours. I don't have any other good things I can think of but I have to write a minimum of 20 words.", "cons": "The poorest communication I have ever seen. No transparency. Poor Product management. Poor Member/Customer Service. Poor internal delegation. Poor Morale. Company does not care about their employees. They once did care about employees. Time Clock Shaving-adjusting employee hours to avoid overtime. Company is dismantling departments, sacrificing quality, and trying to explain/justify Upper level management's loss of over 1 Billion dollars from the past 3 years. Outsourcing to 3rd world countries. Taking jobs away from Americans.", "advice": "Take responsibility for your actions. Transparency and Communications. Keep Jobs here in the US not Manila."}, {"title": "emblem loves the community", "text": "Pros the job pays very well Cons you might have to work in bad weather", "rating": 5, "pros": "the job pays very well", "cons": "you might have to work in bad weather", "advice": null}, {"title": "Disgusting LAYOFFS related to the Cognizant outsourcing", "text": "Pros Nice location, venue and fitness center for employees is only few positive things about it. That's all, nothing else. Cons New CEO Karen Ignani is awful mercantile inhumane creature that only cares about herself and has absolutely no sympathy to poor people who she's laying off. Horrible thing is that honest hardworking EXTREMELY skilled individuals being laid off and families are suffering from lots of consequences this lay off creates. Advice to Management STOP SENDING JOBS OFFSHORE and laying off qualified with 20+years of experience professionals because it only leads to company collapse. And the reasons why is because new staff that is being trained is foreign individuals, in India in particular have no solid experience compare to laid off people. Finally on a minimum scale they are not even aware of how Healthcare, insurance, medical billing and laws work here in US. There's no way to have people that trained for 3 - 6 weeks will be able to perform on same level as 20+ years experience person.", "rating": 1, "pros": "Nice location, venue and fitness center for employees is only few positive things about it. That's all, nothing else.", "cons": "New CEO Karen Ignani is awful mercantile inhumane creature that only cares about herself and has absolutely no sympathy to poor people who she's laying off. Horrible thing is that honest hardworking EXTREMELY skilled individuals being laid off and families are suffering from lots of consequences this lay off creates.", "advice": "STOP SENDING JOBS OFFSHORE and laying off qualified with 20+years of experience professionals because it only leads to company collapse. And the reasons why is because new staff that is being trained is foreign individuals, in India in particular have no solid experience compare to laid off people. Finally on a minimum scale they are not even aware of how Healthcare, insurance, medical billing and laws work here in US. There's no way to have people that trained for 3 - 6 weeks will be able to perform on same level as 20+ years experience person."}, {"title": "Benefits & Recovery Specialist", "text": "Pros Medical Coverage is excellent, salary is great. Union position Cons Management employees can be a bit overbearing. Advice to Management none", "rating": 5, "pros": "Medical Coverage is excellent, salary is great. Union position", "cons": "Management employees can be a bit overbearing.", "advice": "none"}, {"title": "Asset management analyst", "text": "Pros Co workers are good to work with. Cons Don't know if you are coming or going due to outsourcing Advice to Management Keep work in the USA not overseas", "rating": 3, "pros": "Co workers are good to work with.", "cons": "Don't know if you are coming or going due to outsourcing", "advice": "Keep work in the USA not overseas"}, {"title": "Used to be a great place to work.", "text": "Pros Good benefits, flexibility to telecommute Cons Company has gone down hill in recent years, many lay offs, non supportive management", "rating": 3, "pros": "Good benefits, flexibility to telecommute", "cons": "Company has gone down hill in recent years, many lay offs, non supportive management", "advice": null}, {"title": "DMR", "text": "Pros PTO, PTO, pension no longer available Cons high deductible plan, HSA paid quarterly only Advice to Management learn from grassroots", "rating": 5, "pros": "PTO, PTO, pension no longer available", "cons": "high deductible plan, HSA paid quarterly only", "advice": "learn from grassroots"}, {"title": "Senior Financial Analyst", "text": "Pros Worked with great people in the orginazation Cons I don have any downside about EH", "rating": 3, "pros": "Worked with great people in the orginazation", "cons": "I don have any downside about EH", "advice": null}, {"title": "Flexibility but low pay", "text": "Pros Flexibility with working remotely, good work/life balance Cons Very low pay, disorganized, poor benefits", "rating": 3, "pros": "Flexibility with working remotely, good work/life balance", "cons": "Very low pay, disorganized, poor benefits", "advice": null}, {"title": "Decent, but management needs to improve", "text": "Pros PTO is plenty, but sick time comes from there too Cons Workload is unbalanced Organizational changes/system changes are made without much thought of consequences", "rating": 3, "pros": "PTO is plenty, but sick time comes from there too", "cons": "Workload is unbalanced", "advice": null}, {"title": "EMPLOYEE", "text": "Pros WAS A NICE PLACE TO WORK AT. Cons It Sucks to work there now Advice to Management GFY", "rating": 3, "pros": "WAS A NICE PLACE TO WORK AT.", "cons": "It Sucks to work there now", "advice": "GFY"}, {"title": "Disappointing Career Experience", "text": "Pros Great, decent colleagues. Work can be fulfilling and interesting. Great location, along the river. Excellent, very inexpensive gym. Cons Place has been in upheaval for more than two years. Constant layoffs, no job security. More and more positions are being outsourced. Management is not true to its word, notably when telling employees, \"The layoffs are over.\" Advice to Management We want to support management, but it's difficult when this is not appreciated or reciprocated.", "rating": 3, "pros": "Great, decent colleagues. Work can be fulfilling and interesting. Great location, along the river. Excellent, very inexpensive gym.", "cons": "Place has been in upheaval for more than two years. Constant layoffs, no job security. More and more positions are being outsourced. Management is not true to its word, notably when telling employees, \"The layoffs are over.\"", "advice": "We want to support management, but it's difficult when this is not appreciated or reciprocated."}, {"title": "enrollment & Billing Rep", "text": "Pros Pleasant work environment and co-workers Cons Too many managers & supervisors", "rating": 5, "pros": "Pleasant work environment and co-workers", "cons": "Too many managers & supervisors", "advice": null}, {"title": "Application Development Manager", "text": "Pros I worked with a lot of great people, both in IT and on the business side. These were professional, dedicated team players who practiced cooperation and collaboration. Option to telecommute as well as good benefits and a convenient commute were also a plus. Cons IT has been outsourced. It is not yet clear how successful this effort will be.", "rating": 3, "pros": "I worked with a lot of great people, both in IT and on the business side. These were professional, dedicated team players who practiced cooperation and collaboration. Option to telecommute as well as good benefits and a convenient commute were also a plus.", "cons": "IT has been outsourced. It is not yet clear how successful this effort will be.", "advice": null}, {"title": "Being investigated by dept of labor", "text": "Pros They are being investigated by the US Dept of Labor. Trade Act. Outsourcing to India. Heard about this directly out of the mouth of the department of labor at manadatory unemployment appointment. This will give the thousands of laid off employees hope for their future. If Emblem is found guilty it will mean extended unemployment benefits in NYS and free training/education for American workers! Cons Senior management is still there draining all the money for their own salaries ACP is also losing tons of money each month. Advice to Management Leave. You have destroyed thousands of lives. You are greedy and have no business being in the healthcare business. How much $ have you saved? ACP is not going to save the company.", "rating": 1, "pros": "They are being investigated by the US Dept of Labor. Trade Act. Outsourcing to India. Heard about this directly out of the mouth of the department of labor at manadatory unemployment appointment. This will give the thousands of laid off employees hope for their future. If Emblem is found guilty it will mean extended unemployment benefits in NYS and free training/education for American workers!", "cons": "Senior management is still there draining all the money for their own salaries", "advice": "Leave. You have destroyed thousands of lives. You are greedy and have no business being in the healthcare business. How much $ have you saved? ACP is not going to save the company."}, {"title": "Unsure", "text": "Pros Good Benefits, good locations, good gym in main building, Cons Outsourced union jobs to other countries, no employee loyalty", "rating": 3, "pros": "Good Benefits, good locations, good gym in main building,", "cons": "Outsourced union jobs to other countries, no employee loyalty", "advice": null}, {"title": "Working through kinks", "text": "Pros Opportunity, innovation, and great work experience. Cons Transition and poor vision communication from senior leadership. Advice to Management Open lines of communication and talk more to employees about business.", "rating": 5, "pros": "Opportunity, innovation, and great work experience.", "cons": "Transition and poor vision communication from senior leadership.", "advice": "Open lines of communication and talk more to employees about business."}, {"title": "proceed with caution", "text": "Pros difficult to say as the company is undergoing a major shift in focus and organization Cons company is undergoing a major shift in focus and organization", "rating": 3, "pros": "difficult to say as the company is undergoing a major shift in focus and organization", "cons": "company is undergoing a major shift in focus and organization", "advice": null}, {"title": "Senior Business Analyst", "text": "Pros Low cost gym on site with very good facilities. Cons Bonuses are sporadic. Pension is low Health benefits are good, but cost more each year", "rating": 3, "pros": "Low cost gym on site with very good facilities.", "cons": "Bonuses are sporadic.", "advice": null}, {"title": "Trying hard", "text": "Pros Good benefits and decent employee learning programs. New CEO is excellent and may be able to drive change. Cons Company is run by the City of New York Account. This one Account dictates all EmblemHealth decisions. Hard to get stuff down unless you work on the city account Advice to Management Be more creative and listen to your employees. A very old school company that has to grow its business past the city of New York", "rating": 3, "pros": "Good benefits and decent employee learning programs. New CEO is excellent and may be able to drive change.", "cons": "Company is run by the City of New York Account. This one Account dictates all EmblemHealth decisions. Hard to get stuff down unless you work on the city account", "advice": "Be more creative and listen to your employees. A very old school company that has to grow its business past the city of New York"}, {"title": "Overall perspective", "text": "Pros Company has strong work culture Cons Company restructuring, so lots of changes going on. Technology is dated Advice to Management More employee recognition. Bonus every year to reflect the hard work employees are contributing to the company.", "rating": 3, "pros": "Company has strong work culture", "cons": "Company restructuring, so lots of changes going on. Technology is dated", "advice": "More employee recognition. Bonus every year to reflect the hard work employees are contributing to the company."}, {"title": "Director", "text": "Pros Decent Benefit package and compensation. Ok to work here as a last resort until finding a better opportunity. Cons Company is run by a Washington DC lobbyist who has the Company running out of India after massive outsourcing. Horrid balance sheet the company consistently losing 100+M a year. Credit rating is consistently dropping and can't be trusted. Top heavy senior management 'click' stuffing their pockets at expense of employees they consistently lay off. Advice to Management Look in mirror", "rating": 1, "pros": "Decent Benefit package and compensation. Ok to work here as a last resort until finding a better opportunity.", "cons": "Company is run by a Washington DC lobbyist who has the Company running out of India after massive outsourcing. Horrid balance sheet the company consistently losing 100+M a year. Credit rating is consistently dropping and can't be trusted. Top heavy senior management 'click' stuffing their pockets at expense of employees they consistently lay off.", "advice": "Look in mirror"}, {"title": "This company needs help", "text": "Pros Good Salary, wonderful, wonderful co-workers, Cons This is now a very sad company. SO many layoffs, poor morale. When i started a few years ago, it was wonderful. I felt like it could put down roots, then it all changed. I feel sad that this company went down the drain and hope it can rise up like a phoenix from the ashes. Advice to Management Where to even start. You laid off some of the very best employees--many of whom went to competitors. Get off the 13th floor and get to know the remaining employees--many of whom are worried about their jobs.", "rating": 1, "pros": "Good Salary, wonderful, wonderful co-workers,", "cons": "This is now a very sad company. SO many layoffs, poor morale. When i started a few years ago, it was wonderful. I felt like it could put down roots, then it all changed. I feel sad that this company went down the drain and hope it can rise up like a phoenix from the ashes.", "advice": "Where to even start. You laid off some of the very best employees--many of whom went to competitors. Get off the 13th floor and get to know the remaining employees--many of whom are worried about their jobs."}, {"title": "Finance", "text": "Pros The employees in midtown are some of the friendliest. Cons Commuting all the way to Water Street is awful for employees living in NJ.", "rating": 1, "pros": "The employees in midtown are some of the friendliest.", "cons": "Commuting all the way to Water Street is awful for employees living in NJ.", "advice": null}, {"title": "Used to be decent, went totally downhill in last few years", "text": "Pros Location, decent office building with cafeteria and gym. Decent salaries. Allows telecommuting (depending on department) and has decent training options. Cons Total bureaucracy, low morale, laid off hundreds of people so they could outsource operations to an India based company. They took away bonuses the last two years. No company party, very few fun appreciation events. This company was decent years ago, now it is a dark and depressing shithole. Advice to Management Need to appreciate employees more, people lost their livelihoods so this company could save a buck giving American jobs to a foreign company. Shame on you.", "rating": 1, "pros": "Location, decent office building with cafeteria and gym. Decent salaries. Allows telecommuting (depending on department) and has decent training options.", "cons": "Total bureaucracy, low morale, laid off hundreds of people so they could outsource operations to an India based company. They took away bonuses the last two years. No company party, very few fun appreciation events. This company was decent years ago, now it is a dark and depressing shithole.", "advice": "Need to appreciate employees more, people lost their livelihoods so this company could save a buck giving American jobs to a foreign company. Shame on you."}, {"title": "Customer svc", "text": "Pros Excellent training for position. Weekly pay Health insurance benefits are excellent Cons Company restructuring,since ghi and hip merged to become Emblem theyve had no real direction. New ceo seems to be setting company up to be taken over by one of the major insurers. Massive layoffs are occurring across the board. EVERYONE is on eggshells. Advice to Management Verbalize to the employees what the true plan is. Is it to become for profit? Is it being set up for a large scale takeover,or is the plan to truly become Kaiser Permanente East?", "rating": 3, "pros": "Excellent training for position.", "cons": "Company restructuring,since ghi and hip merged to become Emblem theyve had no real direction.", "advice": "Verbalize to the employees what the true plan is. Is it to become for profit? Is it being set up for a large scale takeover,or is the plan to truly become Kaiser Permanente East?"}, {"title": "Supervisor, Provider Contract Configuration - QA", "text": "Pros Good pay for new employees Cons Restructuring or reorganization at EmblemHealth simply means outsourcing jobs to India. Employee contribution to Healthcare has also gone up. Advice to Management The ratio of officers to employees is too high with very little or no communication", "rating": 3, "pros": "Good pay for new employees", "cons": "Restructuring or reorganization at EmblemHealth simply means outsourcing jobs to India. Employee contribution to Healthcare has also gone up.", "advice": "The ratio of officers to employees is too high with very little or no communication"}, {"title": "IT Director", "text": "Pros Flexibility of schedule, most people you work with, hard working staff, vacation time. Cons Executive Leadership and Strategy are poor, Leaders don't appear to be on same page or same strategy at any given point of time. Advice to Management Communicate and put feasible plans on the table to be acted upon. Meet with teams on the ground, information communicated to Sr. Management not incentivised to be accurate, culture too scared of making mistakes so no real progress is made.", "rating": 3, "pros": "Flexibility of schedule, most people you work with, hard working staff, vacation time.", "cons": "Executive Leadership and Strategy are poor, Leaders don't appear to be on same page or same strategy at any given point of time.", "advice": "Communicate and put feasible plans on the table to be acted upon. Meet with teams on the ground, information communicated to Sr. Management not incentivised to be accurate, culture too scared of making mistakes so no real progress is made."}, {"title": "Customer Service", "text": "Pros Great Benifits, good salary, many days off! Cons No support from management and other departs to make the company work smooth, instead they choose to outsource everything and now nothing is getting done and we keep falling further and further behind with no resolution in sight. Advice to Management Work with your employee and quite bringing in upper management that had no insurance experience, promote from within!", "rating": 3, "pros": "Great Benifits, good salary, many days off!", "cons": "No support from management and other departs to make the company work smooth, instead they choose to outsource everything and now nothing is getting done and we keep falling further and further behind with no resolution in sight.", "advice": "Work with your employee and quite bringing in upper management that had no insurance experience, promote from within!"}, {"title": "If it smells bad it is.....", "text": "Pros Some good people, at least the ones not stabbing you in the back or throwing you under the bus. Cons This place is the worst i've seen in 20 years. All the good VP's , Directors, etc. (the ones who knew what was going on) are gone and were pushed out by new management who are poorly versed in Health Care and have no clue. This company i a sinking ship grab your life preserves and get out while you can, I'm out in next month thank god the nightmare is almost over. Advice to Management Sell or merge with another payer who knows whats going on, our Service continues to tank, management has one foot nailed to the floor and the other on a banana peel.", "rating": 1, "pros": "Some good people, at least the ones not stabbing you in the back or throwing you under the bus.", "cons": "This place is the worst i've seen in 20 years. All the good VP's , Directors, etc. (the ones who knew what was going on) are gone and were pushed out by new management who are poorly versed in Health Care and have no clue. This company i a sinking ship grab your life preserves and get out while you can, I'm out in next month thank god the nightmare is almost over.", "advice": "Sell or merge with another payer who knows whats going on, our Service continues to tank, management has one foot nailed to the floor and the other on a banana peel."}, {"title": "An absolute disgrace", "text": "Pros Location to subway and shopping area. Free coffee but remember to BYOC as budget cuts have affected everything. Printers are still working is definitely a plus until that gets outsourced too. Cons Selling off departments was the beginning of the end. Complete and total separation among departments. The people that knew the system are gone. All promises made to former employees have no been seen through. Getting worst by the minute....Save yourself. Advice to Management The best type of advertising is word of mouth from employees or better yet former employees. Hope it was worth it.", "rating": 1, "pros": "Location to subway and shopping area. Free coffee but remember to BYOC as budget cuts have affected everything. Printers are still working is definitely a plus until that gets outsourced too.", "cons": "Selling off departments was the beginning of the end. Complete and total separation among departments. The people that knew the system are gone. All promises made to former employees have no been seen through. Getting worst by the minute....Save yourself.", "advice": "The best type of advertising is word of mouth from employees or better yet former employees. Hope it was worth it."}, {"title": "Director", "text": "Pros Great benefits and work environment Cons Going through a massive restructuring so no job security. Advice to Management Management could benefit from leadership coaching. Very weak leaders.", "rating": 3, "pros": "Great benefits and work environment", "cons": "Going through a massive restructuring so no job security.", "advice": "Management could benefit from leadership coaching. Very weak leaders."}, {"title": "Supervisor First shift Operations", "text": "Pros You are treated very well by the union Local 153 and the people are great. Cons Communication seems to breakdown between Management and Employees. Advice to Management Better communication between Employees and Management.", "rating": 3, "pros": "You are treated very well by the union Local 153 and the people are great.", "cons": "Communication seems to breakdown between Management and Employees.", "advice": "Better communication between Employees and Management."}, {"title": "Senior Systems Analyst", "text": "Pros Good employer, good (PTO) paid time off for employees. Benefits are good as well. Environment is very professionally. Cons not much that I can mention. Advice to Management not much to say.", "rating": 5, "pros": "Good employer, good (PTO) paid time off for employees. Benefits are good as well. Environment is very professionally.", "cons": "not much that I can mention.", "advice": "not much to say."}, {"title": "It Helps if You're Liked By the Right People", "text": "Pros The salaries were very good and the benefits were excellent. That includes health and life insurance, PTO, pension, employee discounts, etc. Cons Hard work often goes unrewarded. Too many people don't really do anything there but they've either been there forever or are personal friends with the right people and are kept on board even when other, better employees are laid off. If you don't kiss the right people's behinds, no matter how good you are, you can and will get thrown under the bus. Advice to Management Listen to the people in the trenches. They know what works and what needs to be fixed.", "rating": 5, "pros": "The salaries were very good and the benefits were excellent. That includes health and life insurance, PTO, pension, employee discounts, etc.", "cons": "Hard work often goes unrewarded. Too many people don't really do anything there but they've either been there forever or are personal friends with the right people and are kept on board even when other, better employees are laid off. If you don't kiss the right people's behinds, no matter how good you are, you can and will get thrown under the bus.", "advice": "Listen to the people in the trenches. They know what works and what needs to be fixed."}, {"title": "OK place if you need a job", "text": "Pros Decent compensation package offered including vacation. Cons Not a lot of team work or comraderie Advice to Management Get everyone rowing in the same directions", "rating": 3, "pros": "Decent compensation package offered including vacation.", "cons": "Not a lot of team work or comraderie", "advice": "Get everyone rowing in the same directions"}, {"title": "Systems Analyst", "text": "Pros Good environment, nice people:working bees and low management level, optional telecommuting, good paid time off, sometimes there are bonuses. Cons Weak accountability of upper management for their decision making. high health insurance premiums for the management staff Advice to Management Reward hard work.", "rating": 3, "pros": "Good environment, nice people:working bees and low management level, optional telecommuting, good paid time off, sometimes there are bonuses.", "cons": "Weak accountability of upper management for their decision making. high health insurance premiums for the management staff", "advice": "Reward hard work."}, {"title": "RUN AWAY. RUN AWAY FAST", "text": "Pros GREAT people who work here. My last manager, I would follow across burning coals for, as well as the staff. On-Site Gym. Close to all kinds of public transportation. Cons I wouldnt even know where to start. Transparency here is scarce. We were shown a presentation in January about how much was going to be invested in upgrading everything here, just to have the whole department outsourced a few months later. A few months prior to that, 500 people were let go without warning, in the middle of the day during lunch. There are SO many titles here, it'll make your head spin. Supervisor, Manager, Senior Manager, Director, Senior Director, Managing Director....and none of these people respond to anyone who isnt in their department, or doesnt have a title themselves. There's no reason to have a \"Manager\" of 3 people. They increased the health premiums..for their own insurance...for their own employees. That's unheard of for employees of a healthplan to pay MORE than some of the people they provide services for. Silo'd EVERYTHING. There's no collaboration between departments and departments that SHOULD be under the same management, arent. Level 1-3 IT Support all have different Directors? Ridiculous. They DO NOT promote from within, which is NUTS. They dont pay well compared to the market either. Advice to Management Open your eyes and realize you're losing talent. Outsourcing health data and PHI to a company in India isnt in line with the founding principles of your healthplan. It's amazing that customer service for a NYC product is in FLORIDA.", "rating": 1, "pros": "GREAT people who work here. My last manager, I would follow across burning coals for, as well as the staff. On-Site Gym. Close to all kinds of public transportation.", "cons": "I wouldnt even know where to start.", "advice": "Open your eyes and realize you're losing talent. Outsourcing health data and PHI to a company in India isnt in line with the founding principles of your healthplan. It's amazing that customer service for a NYC product is in FLORIDA."}, {"title": "Director", "text": "Pros Great working space and great staff to work with. There are many talented people here. I enjoyed my time at this company. Cons There were some terrible leaders who made bad decisions and did not reward hard work. They rewarded based on how well they liked you. Advice to Management Senior Leadership should do more to access the corporate culture. There were many difficult people and leadership knew who they were and did not address it.", "rating": 3, "pros": "Great working space and great staff to work with. There are many talented people here. I enjoyed my time at this company.", "cons": "There were some terrible leaders who made bad decisions and did not reward hard work. They rewarded based on how well they liked you.", "advice": "Senior Leadership should do more to access the corporate culture. There were many difficult people and leadership knew who they were and did not address it."}, {"title": "Outsourced", "text": "Pros Used to be a nice place to work Cons Almost all IT outsourced to India", "rating": 1, "pros": "Used to be a nice place to work", "cons": "Almost all IT outsourced to India", "advice": null}, {"title": "n.a.", "text": "Pros great company in NYC for all Cons not flexible in NYC for all Advice to Management n.a", "rating": 5, "pros": "great company in NYC for all", "cons": "not flexible in NYC for all", "advice": "n.a"}, {"title": "I like working at EH, they have great working environment, too bad the company is shrinking.", "text": "Pros -Great working environment -I lucked out and found fabulous mentors -23 vacation days from the start -On the job training -Outside training classes were reimbursed -$10 per month gym Cons -Many colleagues either lost jobs or were outsourced to work for Cognizant -The company size is shrinking -Department where i work is being outsourced -Expensive health insurance -The pension plan was terminated", "rating": 5, "pros": "-Great working environment", "cons": "-Many colleagues either lost jobs or were outsourced to work for Cognizant", "advice": null}, {"title": "Unprofessional", "text": "Pros Benefits/PTO. Holidays off Cons Horrible place to work. The only reason they got one star was because of the PTO. Unprofessional management who are all friends so you don't know who to trust with issues. Complaints about upper management get swept under the rug. A lot of lazy workers who get away with doing nothing while people who actually work gets picked on by management. I'm a patient advocate for emblem and the supervisor continues to threaten my job. Advice to Management Stop with the power trip and treat employees like human beings. It's a health care company for goodness sake!!!", "rating": 1, "pros": "Benefits/PTO. Holidays off", "cons": "Horrible place to work. The only reason they got one star was because of the PTO. Unprofessional management who are all friends so you don't know who to trust with issues. Complaints about upper management get swept under the rug. A lot of lazy workers who get away with doing nothing while people who actually work gets picked on by management. I'm a patient advocate for emblem and the supervisor continues to threaten my job.", "advice": "Stop with the power trip and treat employees like human beings. It's a health care company for goodness sake!!!"}, {"title": "Senior Director", "text": "Pros None As of 2015 I have heard the CEO has cleaned up legacy management The father son combination is no more. Cons Govt like, conflict with HIP and GHI.", "rating": 1, "pros": "None", "cons": "Govt like, conflict with HIP and GHI.", "advice": null}, {"title": "The company is going several changes and they're downsizing", "text": "Pros Good salary, Monday through Friday work schedule, several leader led training and online training course available, sometimes there are bonuses. Cons Company is changing and going through downsizing, high health insurance premiums for the management staff, performance reviews are done on a curve. Advice to Management negotiate a good salary upfront", "rating": 3, "pros": "Good salary, Monday through Friday work schedule, several leader led training and online training course available, sometimes there are bonuses.", "cons": "Company is changing and going through downsizing, high health insurance premiums for the management staff, performance reviews are done on a curve.", "advice": "negotiate a good salary upfront"}, {"title": "Data Analyst/Project lead", "text": "Pros Extremely IT savey, the ability to take free on line courses in any and all existing software.The ability to grow within & outside departments Cons The company merged 3 times and the final merger resulted in the company of laying off half of the company Advice to Management Continue to educate and encourage your staff. Be fare", "rating": 5, "pros": "Extremely IT savey, the ability to take free on line courses in any and all existing software.The ability to grow within & outside departments", "cons": "The company merged 3 times and the final merger resulted in the company of laying off half of the company", "advice": "Continue to educate and encourage your staff. Be fare"}, {"title": "Management", "text": "Pros Great company to work for. Cons I have no cons, I loved my job.", "rating": 5, "pros": "Great company to work for.", "cons": "I have no cons, I loved my job.", "advice": null}, {"title": "DO NOT WASTE TIME AND APPLY", "text": "Pros It used to be a nice company to work for. There are no pros. Emblemhealth is being sold like a slave on the auction block. Cons COGNIZANT is making good employees train employees in India. Members need to know their information is going overseas. Many employees already had scammers with Indian accents calling with money scams. They have our names and social security numbers. No longer an AMERICAN company but INDIAN. Advice to Management YOU SOLD YOUR SOULS TO COGNIZANT-SHAME, SHAME, SHAME. AMERICAN JOBS, AMERICAN'S PRIVATE INFORMATION, YOU SOLD AMERICA TO INDIA.", "rating": 1, "pros": "It used to be a nice company to work for. There are no pros. Emblemhealth is being sold like a slave on the auction block.", "cons": "COGNIZANT is making good employees train employees in India. Members need to know their information is going overseas. Many employees already had scammers with Indian accents calling with money scams. They have our names and social security numbers. No longer an AMERICAN company but INDIAN.", "advice": "YOU SOLD YOUR SOULS TO COGNIZANT-SHAME, SHAME, SHAME. AMERICAN JOBS, AMERICAN'S PRIVATE INFORMATION, YOU SOLD AMERICA TO INDIA."}, {"title": "What use to be a good company....", "text": "Pros I worked for them for six years. The pay was good with great benefits. I enjoyed working with my supervisor and team. Cons Under the new CEO Karen Ignani the company started to outsource a lot of positions causing hundreds of employees without a job.", "rating": 3, "pros": "I worked for them for six years. The pay was good with great benefits. I enjoyed working with my supervisor and team.", "cons": "Under the new CEO Karen Ignani the company started to outsource a lot of positions causing hundreds of employees without a job.", "advice": null}, {"title": "bilingual costumer service representative", "text": "Pros no longer a good place to work, the company downsized and lay off many employees. Cons Company is going thru cuts in personnel", "rating": 3, "pros": "no longer a good place to work, the company downsized and lay off many employees.", "cons": "Company is going thru cuts in personnel", "advice": null}, {"title": "Manager", "text": "Pros Good Health benefits and 401k. Cons The company has lost their vision and has outsourced many services. Advice to Management Stop looking at the pennies. Look at the talent you have in house and utilize them effectively so We can help you achieve your goals", "rating": 3, "pros": "Good Health benefits and 401k.", "cons": "The company has lost their vision and has outsourced many services.", "advice": "Stop looking at the pennies. Look at the talent you have in house and utilize them effectively so We can help you achieve your goals"}, {"title": "Okay", "text": "Pros CEO is rather transparent. Great benefits package. Some positions are union based. In which they offered 90 notice for being laid off along with a nice severance package. I have a great supervisor. Some telecommute positions. Emblem used to have better values but after outsourcing so many jobs I cant agree with them. Cons A LOT OF lay offs this past year. They will be out sourcing a lot of jobs. A company once priding itself on being NY based is no longer going to be primarily based. Advice to Management Don't outsource. Stick to our main value of being NY based company.", "rating": 3, "pros": "CEO is rather transparent. Great benefits package. Some positions are union based. In which they offered 90 notice for being laid off along with a nice severance package. I have a great supervisor. Some telecommute positions. Emblem used to have better values but after outsourcing so many jobs I cant agree with them.", "cons": "A LOT OF lay offs this past year. They will be out sourcing a lot of jobs. A company once priding itself on being NY based is no longer going to be primarily based.", "advice": "Don't outsource. Stick to our main value of being NY based company."}, {"title": "IT Department", "text": "Pros People you work with are very dedicated and believe strongly in what they do. Cons Company does not value their people and practices widespread ageism, sexism and ethnic discrimination. In an effort to downsize the IT folks have been let go and replaced with offshore personnel. Advice to Management Value your people", "rating": 1, "pros": "People you work with are very dedicated and believe strongly in what they do.", "cons": "Company does not value their people and practices widespread ageism, sexism and ethnic discrimination. In an effort to downsize the IT folks have been let go and replaced with offshore personnel.", "advice": "Value your people"}, {"title": "Claims", "text": "Pros Employees, benefits , like pto time 401k 4 days work week, no copay Cons Management sucks, union there isnt any union left. The CEO taking jobs away to people who need it. Advice to Management Company has to much layoffs", "rating": 3, "pros": "Employees, benefits , like pto time 401k 4 days work week, no copay", "cons": "Management sucks, union there isnt any union left. The CEO taking jobs away to people who need it.", "advice": "Company has to much layoffs"}, {"title": "Emblem Health", "text": "Pros Good Salary good benefits nice people to work with Cons changing management culture is slowly taking away the benefits of the job", "rating": 5, "pros": "Good Salary good benefits nice people to work with", "cons": "changing management culture is slowly taking away the benefits of the job", "advice": null}, {"title": "Tanking", "text": "Pros Work life balance, greet locations good 401k match. Cons Company is losing money. Jobs are being outsourced. Senior management continues to turn over. Advice to Management Work on communicating the mission. People don't believe this company has any hope of surviving.", "rating": 3, "pros": "Work life balance, greet locations good 401k match.", "cons": "Company is losing money. Jobs are being outsourced. Senior management continues to turn over.", "advice": "Work on communicating the mission. People don't believe this company has any hope of surviving."}, {"title": "The absolute worst . Miss managed and micro managed .", "text": "Pros Free Coffee , nice gym , used to be a good place to work , used to have decent benefits . Cons Micro managed, micro managed... did I say micro managed ?? Excessive work hours continually . I f you can't do your job in 40 hours then something is very wrong with your management . Ohh thats right they are living in fear of losing their excess high paying jobs. The people are burned out. Advice to Management Do the world a favor and resign. The old guard is a disgrace. Those with anything to offer have already left. Give the business to a successful company . Your insurance products stink .", "rating": 1, "pros": "Free Coffee , nice gym , used to be a good place to work , used to have decent benefits .", "cons": "Micro managed, micro managed... did I say micro managed ?? Excessive work hours continually . I f you can't do your job in 40 hours then something is very wrong with your management . Ohh thats right they are living in fear of losing their excess high paying jobs. The people are burned out.", "advice": "Do the world a favor and resign. The old guard is a disgrace. Those with anything to offer have already left. Give the business to a successful company . Your insurance products stink ."}, {"title": "Forget it!", "text": "Pros There are no Pros for this company. Cons IT was outsourced to Cognizant. Say goodbye to more American jobs! Even though Cognizant is incorporated in the US, all the work is going to India. Advice to Management Don't try to sell health insurance to Americans if you are sending their jobs and their PHI to India.", "rating": 1, "pros": "There are no Pros for this company.", "cons": "IT was outsourced to Cognizant. Say goodbye to more American jobs! Even though Cognizant is incorporated in the US, all the work is going to India.", "advice": "Don't try to sell health insurance to Americans if you are sending their jobs and their PHI to India."}, {"title": "medical asst", "text": "Pros One of best workers ever patients love my work ethic. Never was late never want to take days off. I love dealing with pulbic. Cons I feel management didnt appriate my skills and hard work that i was putting. I felt i need to grow 22 years that i put in with one company. Advice to Management Im a hard working. Not afraid of learning something new. I will be one of youre best workers.", "rating": 5, "pros": "One of best workers ever patients love my work ethic. Never was late never want to take days off. I love dealing with pulbic.", "cons": "I feel management didnt appriate my skills and hard work that i was putting. I felt i need to grow 22 years that i put in with one company.", "advice": "Im a hard working. Not afraid of learning something new. I will be one of youre best workers."}, {"title": "Project Manager", "text": "Pros The People I got to work with were great. Cons The Politics that go on behind the scenes. It gets in the way of improvements needed there. Advice to Management None.", "rating": 5, "pros": "The People I got to work with were great.", "cons": "The Politics that go on behind the scenes. It gets in the way of improvements needed there.", "advice": "None."}, {"title": "Company is no longer as good as it used to be", "text": "Pros There is nothing that is worth mentioning. Cons Poor communication from management; health insurance benefits is sub par considering that it is a health insurance provider, especially dental plan. When new CEO came on board in 2015, little by little benefits were taken away. Company has changed dramatically over the years.", "rating": 3, "pros": "There is nothing that is worth mentioning.", "cons": "Poor communication from management; health insurance benefits is sub par considering that it is a health insurance provider, especially dental plan. When new CEO came on board in 2015, little by little benefits were taken away. Company has changed dramatically over the years.", "advice": null}, {"title": "Contracting Specialist", "text": "Pros New CEO making changes is always great hopefully she provides a new face lift to our leadership. Cons No one communicates with one another, everyone is in there own bubble, the leadership speak down to employees lack of motivation and no training. Advice to Management No growth", "rating": 1, "pros": "New CEO making changes is always great hopefully she provides a new face lift to our leadership.", "cons": "No one communicates with one another, everyone is in there own bubble, the leadership speak down to employees lack of motivation and no training.", "advice": "No growth"}, {"title": "Emblem Phoenix", "text": "Pros Hardworking clinical staff who try to provide good care yet understaffed and over worked with little to no support . Cons This agency is ran by an executive director that joined the good ole boys with southern charm and packs of lies . He hires people without experience so he can pay minimally , therefore patient care suffers. The entire agency is merely marketer driven for numbers and dollars . The meat of a healthcare organization are clinicians , which are not respected by the E.D. . They are just the worker bees for bucks into his pocket . The place is drama ridden , which begins and ends by him . Lies, lies, and more lies fly from his mouth with more ease than a snack swallowing a mouse. Federal regulations are not adhered to on any level with complete lack of understanding or care for the programs offered . Advice to Management Take control of the agency by removing the self entitled poor little fake rich boy executive director whom gives all of Ensign a bad reputation .", "rating": 1, "pros": "Hardworking clinical staff who try to provide good care yet understaffed and over worked with little to no support .", "cons": "This agency is ran by an executive director that joined the good ole boys with southern charm and packs of lies . He hires people without experience so he can pay minimally , therefore patient care suffers. The entire agency is merely marketer driven for numbers and dollars . The meat of a healthcare organization are clinicians , which are not respected by the E.D. . They are just the worker bees for bucks into his pocket .", "advice": "Take control of the agency by removing the self entitled poor little fake rich boy executive director whom gives all of Ensign a bad reputation ."}, {"title": "Senior Product Specialist", "text": "Pros This company has the potential to be great if they believe in their staff Cons not enough faith in its employees", "rating": 3, "pros": "This company has the potential to be great if they believe in their staff", "cons": "not enough faith in its employees", "advice": null}, {"title": "Company went downhill", "text": "Pros Can't think of any. Used to be a great place to work. Cons Long term employees not appreciated by senior management. No loyalty to employees. Advice to Management Stop outsourcing the jobs", "rating": 3, "pros": "Can't think of any. Used to be a great place to work.", "cons": "Long term employees not appreciated by senior management. No loyalty to employees.", "advice": "Stop outsourcing the jobs"}, {"title": "Former Employee", "text": "Pros Good company to work for Cons Company should consider higher annual pay increases. Advice to Management None", "rating": 5, "pros": "Good company to work for", "cons": "Company should consider higher annual pay increases.", "advice": "None"}, {"title": "Emblem Health", "text": "Pros Great company, with good health benefits, retirement, 401K and more Cons The call center was non stop calls, not enough breaks. Not enough decision power, need to get supervisor permission for too many little things. Advice to Management If management needs to be so involved, then management should be more available, and understandable when called on for help.", "rating": 5, "pros": "Great company, with good health benefits, retirement, 401K and more", "cons": "The call center was non stop calls, not enough breaks. Not enough decision power, need to get supervisor permission for too many little things.", "advice": "If management needs to be so involved, then management should be more available, and understandable when called on for help."}, {"title": "Not what it once was", "text": "Pros Team was well rounded and helpful Cons IT division is now run by cognizant so it will be a huge culture shock to most native English speakers Advice to Management Listen to your subordinates", "rating": 3, "pros": "Team was well rounded and helpful", "cons": "IT division is now run by cognizant so it will be a huge culture shock to most native English speakers", "advice": "Listen to your subordinates"}, {"title": "Emblem", "text": "Pros Job security and good benefits Cons It's a good place to work. I don't have any cons", "rating": 5, "pros": "Job security and good benefits", "cons": "It's a good place to work. I don't have any cons", "advice": null}, {"title": "Out sourced", "text": "Pros The benefits are good and the overtime Cons They are out sourcing most of the departments Advice to Management Find a way to keep the jobs in the states", "rating": 1, "pros": "The benefits are good and the overtime", "cons": "They are out sourcing most of the departments", "advice": "Find a way to keep the jobs in the states"}, {"title": "Was great in the good old days", "text": "Pros Not very demanding, mostly 9-5 Cons Politics, favoritism, disorganization, layoffs, and layoffs Advice to Management Get a clue- who's making these decisions?", "rating": 3, "pros": "Not very demanding, mostly 9-5", "cons": "Politics, favoritism, disorganization, layoffs, and layoffs", "advice": "Get a clue- who's making these decisions?"}, {"title": "Emblem Health", "text": "Pros good support from team members Cons incompetent upper management, company has financial issues, constant lay offs. Advice to Management Quit", "rating": 3, "pros": "good support from team members", "cons": "incompetent upper management, company has financial issues, constant lay offs.", "advice": "Quit"}, {"title": "Customer Service", "text": "Pros Great company, believed in good benefits and balance life. For a company in Florida we had a union Cons Sometimes it is stressful, which job is not. When this company merge this was the death of this company. Advice to Management What is their to say, only the little people has suffered, when this company merged.", "rating": 5, "pros": "Great company, believed in good benefits and balance life. For a company in Florida we had a union", "cons": "Sometimes it is stressful, which job is not. When this company merge this was the death of this company.", "advice": "What is their to say, only the little people has suffered, when this company merged."}, {"title": "The company is going the down hill.", "text": "Pros If you was hired within the last 6 years you are safe from the all of the lay offs. The company has nice building Cons They laid off the employees with experience before they trained the new employees . Leaving the new employees clueless. Forced operations employees to work for an outsource company. Holding their severance package over their heads. Telling them they can not give them a package. While giving other departments within the company a package. Some of these people worked for the company for years and walked away with nothing. I give them 5 rotten apples. Advice to Management Never forget about the faithful employees , who could have left for higher pay. A strong company starts with a strong employees. Treat employees as people and not just a ID number.", "rating": 1, "pros": "If you was hired within the last 6 years you are safe from the all of the lay offs. The company has nice building", "cons": "They laid off the employees with experience before they trained the new employees . Leaving the new employees clueless. Forced operations employees to work for an outsource company. Holding their severance package over their heads. Telling them they can not give them a package. While giving other departments within the company a package. Some of these people worked for the company for years and walked away with nothing.", "advice": "Never forget about the faithful employees , who could have left for higher pay. A strong company starts with a strong employees. Treat employees as people and not just a ID number."}, {"title": "Business Analyst", "text": "Pros great benefits and work life balance. Ten paid holidays and 23 paid time off to start which increases with time. Cons The company has recently experienced massive layoffs and restructuring which has hurt moral a bit. Overall, the new president is making some good progress and continues to find ways to improve the bottom line. Advice to Management Keep up the good work and we can overcome this challenge. The new president had to make some tough decisions lately but i think she is doing the right thing.", "rating": 5, "pros": "great benefits and work life balance. Ten paid holidays and 23 paid time off to start which increases with time.", "cons": "The company has recently experienced massive layoffs and restructuring which has hurt moral a bit. Overall, the new president is making some good progress and continues to find ways to improve the bottom line.", "advice": "Keep up the good work and we can overcome this challenge. The new president had to make some tough decisions lately but i think she is doing the right thing."}, {"title": "Sr. Business Analyst", "text": "Pros Pretty good salary, great vacation time, good benefits and great co-workers. Cons There is poor leadership throughout multiple divisions of the organization. Certain departments directors picked favorites who they want in their department and released vital employees. Hiring manager only hired consultants which lead to department disruption as many of them left the company. No room for growth or promoting within. The company outsourced majority of IT and customer service to Cognizant and released hundreds of employees in order to save the company money.", "rating": 3, "pros": "Pretty good salary, great vacation time, good benefits and great co-workers.", "cons": "There is poor leadership throughout multiple divisions of the organization. Certain departments directors picked favorites who they want in their department and released vital employees. Hiring manager only hired consultants which lead to department disruption as many of them left the company. No room for growth or promoting within. The company outsourced majority of IT and customer service to Cognizant and released hundreds of employees in order to save the company money.", "advice": null}, {"title": "Customer Service Representative", "text": "Pros Great benefit package, pay was good, good schedule (8-4, mon-fri), co-workers were super friendly. Cons Not much opportunity for growth, very strict with time since it was a call center environment. Working in a call center is not easy so think twice about this one.", "rating": 3, "pros": "Great benefit package, pay was good, good schedule (8-4, mon-fri), co-workers were super friendly.", "cons": "Not much opportunity for growth, very strict with time since it was a call center environment.", "advice": null}, {"title": "customer service advocate 2", "text": "Pros very easy to move up in positions great pay awesome benefits love emblem the only thing if your young this is actually a great come up i was only 20 and made lots of $ enjoyed my managers co workers everyone was nice honestly i loved Joanne, Chris the Supervisor of Customer service was very kind and great Katrina the schedule specialist was very flexible. They give you pto time asap!!! training was about 3-4 months i had benefits a month later bout time i got on the floor my pro was AVAILABLE Cons however at this place everyone has been working 10+ years or more there a bit Salty", "rating": 5, "pros": "very easy to move up in positions great pay awesome benefits love emblem the only thing if your young this is actually a great come up i was only 20 and made lots of $ enjoyed my managers co workers everyone was nice honestly i loved Joanne, Chris the Supervisor of Customer service was very kind and great Katrina the schedule specialist was very flexible. They give you pto time asap!!! training was about 3-4 months i had benefits a month later bout time i got on the floor my pro was AVAILABLE", "cons": "however at this place everyone has been working 10+ years or more there a bit Salty", "advice": null}, {"title": "good company", "text": "Pros The management of the company is very interested in the professional progress of the employees. It is a nice place to work. Cons There have been a number of layooffs in the last few years. There have also been a number of position relocations in the last few years. Advice to Management It is important to consider all of the employee's commuting distances before making position relocations, in order to retain employees and support morale.", "rating": 5, "pros": "The management of the company is very interested in the professional progress of the employees. It is a nice place to work.", "cons": "There have been a number of layooffs in the last few years. There have also been a number of position relocations in the last few years.", "advice": "It is important to consider all of the employee's commuting distances before making position relocations, in order to retain employees and support morale."}, {"title": "Category Manager", "text": "Pros They offer a lot of Personal time off Cons they are losing a lot of money and making big cuts and prospects do not look good Advice to Management take your head out of your butt", "rating": 3, "pros": "They offer a lot of Personal time off", "cons": "they are losing a lot of money and making big cuts and prospects do not look good", "advice": "take your head out of your butt"}, {"title": "Use to be a great compamy", "text": "Pros Smart and Hardworking People. Cons New CEO making awful choices by rebadging employees to swindle them out of severance pay and laying off the rest. Senior management is top heavy and continues to hire and favor ivy league graduates that do not have the experience to do the job. The employees who are left doing the job of the people who were rebadged or let go are exhausted. Advice to Management Get your head out of the clouds and take a look around at what you are doing. Make positive changes and value your hard working employees who are severely overworked and must toil in a demoralizing environment.", "rating": 3, "pros": "Smart and Hardworking People.", "cons": "New CEO making awful choices by rebadging employees to swindle them out of severance pay and laying off the rest. Senior management is top heavy and continues to hire and favor ivy league graduates that do not have the experience to do the job. The employees who are left doing the job of the people who were rebadged or let go are exhausted.", "advice": "Get your head out of the clouds and take a look around at what you are doing. Make positive changes and value your hard working employees who are severely overworked and must toil in a demoralizing environment."}, {"title": "Analyst", "text": "Pros Great benefits and they offer the opportunity for sharpening or learning new skills. Cons Lack of communication from management. Change not welcome. Advice to Management Communication is imperative in having a strong team.", "rating": 3, "pros": "Great benefits and they offer the opportunity for sharpening or learning new skills.", "cons": "Lack of communication from management. Change not welcome.", "advice": "Communication is imperative in having a strong team."}, {"title": "Manager Performance Ops and Analytics", "text": "Pros Senior management has no idea of what it takes to complete projects on time or within budget. Senior Management speaks a good talk on team work but totally incapable of walking the walk. They create a hostile work environment where middle management is at war with one another. The company is also to quick to give its Union employees whatever they want at the expense of . middle management. The company as a whole treats middle management the very pekple they need to excute their plan like crap Cons Salary is good, benefits are good Advice to Management Listen to middle management they know more than you do at the functional level", "rating": 1, "pros": "Senior management has no idea of what it takes to complete projects on time or within budget. Senior Management speaks a good talk on team work but totally incapable of walking the walk. They create a hostile work environment where middle management is at war with one another. The company is also to quick to give its Union employees whatever they want at the expense of . middle management. The company as a whole treats middle management the very pekple they need to excute their plan like crap", "cons": "Salary is good, benefits are good", "advice": "Listen to middle management they know more than you do at the functional level"}, {"title": "Stayed too long", "text": "Pros Emblem Health has generous PTO. Decent Medical, Dental and Vision Benefits. Your are allowed to wear Jeans on Fridays. They have a four day work week. Job schedule is pretty flexible. Cons depending on your department, could be a hostile work environment, employees aren't motivated to to do their best. Horrible Management practices and plenty of favoritism. Not much room for growth. It's easy to get comfortable because of the Benefits Package. Stay 5 years or less if possible. There are much better opportunities out there. Advice to Management Management should work on being fair to all employees and not base their decisions on who they like or how they feel. Professionalism starts from the top. I haven't seen much of it.", "rating": 3, "pros": "Emblem Health has generous PTO. Decent Medical, Dental and Vision Benefits. Your are allowed to wear Jeans on Fridays. They have a four day work week. Job schedule is pretty flexible.", "cons": "depending on your department, could be a hostile work environment, employees aren't motivated to to do their best. Horrible Management practices and plenty of favoritism. Not much room for growth. It's easy to get comfortable because of the Benefits Package. Stay 5 years or less if possible. There are much better opportunities out there.", "advice": "Management should work on being fair to all employees and not base their decisions on who they like or how they feel. Professionalism starts from the top. I haven't seen much of it."}, {"title": "Great Experience", "text": "Pros Friendly environment, Challenging work, High learning curve Cons Office is quiet on Fridays", "rating": 5, "pros": "Friendly environment, Challenging work, High learning curve", "cons": "Office is quiet on Fridays", "advice": null}, {"title": "Poorly managed", "text": "Pros A lot of PTO, decent pay, on-site gym Cons Poorly managed, no room for advancement, health insurance is terrible (and we are a health insurance company) Advice to Management Company morale is pretty low, but instead of fixing the issue you are trying to patch it with band-aids. Please take off the blinders, see what the problems are and fix it.", "rating": 3, "pros": "A lot of PTO, decent pay, on-site gym", "cons": "Poorly managed, no room for advancement, health insurance is terrible (and we are a health insurance company)", "advice": "Company morale is pretty low, but instead of fixing the issue you are trying to patch it with band-aids. Please take off the blinders, see what the problems are and fix it."}, {"title": "Emblem Health", "text": "Pros 35 hr work week Good location Supports continuing education Cons Very poor. Communication Financial solvency is fragile", "rating": 3, "pros": "35 hr work week", "cons": "Very poor. Communication", "advice": null}, {"title": "Sign of the Times", "text": "Pros Pleasant and professional work environment. Cons The company has many financial restraints.", "rating": 3, "pros": "Pleasant and professional work environment.", "cons": "The company has many financial restraints.", "advice": null}]