[{"title": "Definitelly coming back after finishing school", "text": "Pros Great and supportive colleagues, fast growth that brings interesting clients and opportunities, changes happen fast Cons Can be an ambiguous environment that you have to get used to Advice to Management Some senior management should really think about how they communicate", "rating": 5, "pros": "Great and supportive colleagues, fast growth that brings interesting clients and opportunities, changes happen fast", "cons": "Can be an ambiguous environment that you have to get used to", "advice": "Some senior management should really think about how they communicate"}, {"title": "Frontend Developer", "text": "Pros - Great people - Newest technologies - Company culture and values - Freedom in execution - Great offices, equipment, chill zones - Free food, lunch, snacks - Support and mentorship Cons - Work overload - Sometimes clashing priorities", "rating": 5, "pros": "- Great people", "cons": "- Work overload", "advice": null}, {"title": "Great opportunities - fast development", "text": "Pros - Management reacts fast to changes in the business environment - Growth plan is communicated clearly and objectively - Entrepreneurial and meritocratic environment - Friendly yet professional Cons - Not fully global culture yet - Fast growth creates stretched situations Advice to Management Keep with clear long / mid term goals. Keep with communication and transparency with all employees despite growth.", "rating": 5, "pros": "- Management reacts fast to changes in the business environment", "cons": "- Not fully global culture yet", "advice": "Keep with clear long / mid term goals. Keep with communication and transparency with all employees despite growth."}, {"title": "Not a Workplace - a Community", "text": "Pros Friendly, sharp people; a product and vision to pride oneself with. Cons Workload and expectation of high performance. Advice to Management Although already very accessible, find more ways to connect with employees.", "rating": 5, "pros": "Friendly, sharp people; a product and vision to pride oneself with.", "cons": "Workload and expectation of high performance.", "advice": "Although already very accessible, find more ways to connect with employees."}, {"title": "Good company to work for.", "text": "Pros 1. Very pleasant colleagues to work with. I would recommend anyone to join the team. 2. Free food (fruits/lunch/sweets). 3. Choose your own equipment policy. 4. Offices in the city center. 5. Shares in company (after 6 mo.) 6. Chill-out zones (xbox, paystation, VR-glasses and more..) Cons Startup like environment may be quite bad for work-life balance, however no-one is pushing you yo stay late.. its just that if you enjoy work (which you will) you spent too much time in work.", "rating": 5, "pros": "1. Very pleasant colleagues to work with. I would recommend anyone to join the team.", "cons": "Startup like environment may be quite bad for work-life balance, however no-one is pushing you yo stay late.. its just that if you enjoy work (which you will) you spent too much time in work.", "advice": null}, {"title": "new rocket in the marketing sky", "text": "Pros 1. awesome product, clients super-happy 2. awesome team, experts with can-do attitude 3. friendly and welcoming atmosphere 4. clear vision, defined strategy and flexible tactics 5. feel of ownership and common goal thanks to intelligent SOP (6.) short iterations, could be moving too fast for some Cons should have joined earlier, when valuation was much lower :D Advice to Management keep on rockin'!", "rating": 5, "pros": "1. awesome product, clients super-happy", "cons": "should have joined earlier, when valuation was much lower :D", "advice": "keep on rockin'!"}, {"title": "Proud to be working here", "text": "Pros I really enjoy working with the people here, they are the top in their fields and I am always in awe from their achievements. This applies to all colleagues, not only management. Cons we are growing fast and sometimes lack office space", "rating": 5, "pros": "I really enjoy working with the people here, they are the top in their fields and I am always in awe from their achievements. This applies to all colleagues, not only management.", "cons": "we are growing fast and sometimes lack office space", "advice": null}, {"title": "Great product and company culture", "text": "Pros World class product, company values, continuous personal growth. Cons Consultants can't really work remote. Advice to Management Keep up the good work.", "rating": 5, "pros": "World class product, company values, continuous personal growth.", "cons": "Consultants can't really work remote.", "advice": "Keep up the good work."}, {"title": "Work at Exponea", "text": "Pros - beautiful work environment - tasty lunch - nice people - interesting technologies Cons Still not sure, whether it is a good thing with customer data collection.", "rating": 5, "pros": "- beautiful work environment", "cons": "Still not sure, whether it is a good thing with customer data collection.", "advice": null}, {"title": "great place to work", "text": "Pros Exponea developed just amazing marketing platform! Every demonstration I'm proud to represent Exponea because it makes WOW-effect. Also there is no bureaucracy and complex processes for any small thing you want to change or anything you need. All my ideas I can easily discuss with my manager and even top-managers. Collaboration, support, freedom and enterpreneurial environment - this is what I do like in Exponea. And I'm happy to find new friends from all around the globe: Columbia, Australia, UK, Germany, Czech and Slovakia (I am Russian). Cons so far there is no language localization for CIS region (but it's planned) Advice to Management to expand huge US market and also France&Italy", "rating": 5, "pros": "Exponea developed just amazing marketing platform! Every demonstration I'm proud to represent Exponea because it makes WOW-effect.", "cons": "so far there is no language localization for CIS region (but it's planned)", "advice": "to expand huge US market and also France&Italy"}, {"title": "Probably the Best Marketing Cloud", "text": "Pros They envisioned a future where companies truly understand their customers and engage them in a mutually beneficial way. Exponea is on the way of bringing this vision to life. Platform and brainpower helps e-Commerce businesses get maximum value from collecting, analysing, and acting upon customer interactions. Cons Exponea is not established on the US market. Advice to Management Focus on clarity, accuracy and thoroughness in communication. Be consistent.", "rating": 5, "pros": "They envisioned a future where companies truly understand their customers and engage them in a mutually beneficial way.", "cons": "Exponea is not established on the US market.", "advice": "Focus on clarity, accuracy and thoroughness in communication."}]