[{"title": "Good company builder", "text": "Pros Nice atmosphere to work in Nice new office Room to grow Cons My venture need to organise itself bit more Not sure who is making the decisions... Advice to Management Validates ideas better and stop rushing everything without proper process in place", "rating": 5, "pros": "Nice atmosphere to work in", "cons": "My venture need to organise itself bit more", "advice": "Validates ideas better and stop rushing everything without proper process in place"}, {"title": "Dynamic environment with a lot of potential", "text": "Pros - great people to work with, everyone is very engaged and committed to making the company and ventures a success - ideas on how to improve and work better are always welcome and you are given freedom to work on these - cool new offices, will look really great once the renovations are finished - the portfolio of companies with the ecosystem is very diverse, you get to see a lot of cool products launched and brought to life Cons - as it's still a relatively young company it can be a little unstructured at times - because of the above, progress opportunities are sometimes limited but I can see this changing in the next 18 months as the company continues to grow", "rating": 5, "pros": "- great people to work with, everyone is very engaged and committed to making the company and ventures a success", "cons": "- as it's still a relatively young company it can be a little unstructured at times", "advice": null}, {"title": "Fast-paced and friendly", "text": "Pros Things happen quickly, with change and innovation encouraged. Meritocratic - if the idea is good, it doesn't matter who came up with it, no egos involved in decision making. Friendly people - lunchtime networking is really ingrained in the culture. Cons Things move fast - sometimes hard to keep track of what's going on across all ventures, monthly all-hands helps with this.", "rating": 5, "pros": "Things happen quickly, with change and innovation encouraged.", "cons": "Things move fast - sometimes hard to keep track of what's going on across all ventures, monthly all-hands helps with this.", "advice": null}, {"title": "That depends on which Startup will you work at.", "text": "Pros - Good average of salary ( not the best but good ) - Free drinks - Free cereals - Good working devices ( Macbook or Good DELL devices ) - Good location Cons - After hired forget about to have contact with the recruiters. They say \" I'm looking forward to meet you in person\" but when you arrive here and cross with them, they will not even say hello. - Too many \"secret meetings\" - Depending on the team that you gonna work, you may get a very bad boss/team - You're expected to work after hours - The office is a mess given the \"startup feeling\" Advice to Management Try to make people happy and not to loose your employees.", "rating": 3, "pros": "- Good average of salary ( not the best but good )", "cons": "- After hired forget about to have contact with the recruiters. They say \" I'm looking forward to meet you in person\" but when you arrive here and cross with them, they will not even say hello.", "advice": "Try to make people happy and not to loose your employees."}, {"title": "Rising fintech star, yet still needs to deliver", "text": "Pros - International people from different fields - Smart minds with strong work ethic (probably due to past consulting and banking experiences) - Good sales people Cons - Highly political and hierarchical - Little focus on value creation but on valuations - Management appears not to be aligned Advice to Management Improve communication and concentrate on a few things properly instead of covering too many topics at once", "rating": 3, "pros": "- International people from different fields", "cons": "- Highly political and hierarchical", "advice": "Improve communication and concentrate on a few things properly instead of covering too many topics at once"}, {"title": "Dynamic professionality", "text": "Pros It's like a grown up startup - very professional and still dynamic and flexible. Very international teams, nice working atmosphere, I regularly receive valuable feedback from my supervisor, you receive regular updates from management on new things, company benefits (like Foodora dinner, fresh fruit, cooperation with sport clubs, discount on public transport...), different team and company events. Cons Company grows fast incl. the ventures, that there is not much space and it is a little crowded sometimes. But everyone tries to make the best out of it. Advice to Management Keep on listening to improve and stay transparent", "rating": 5, "pros": "It's like a grown up startup - very professional and still dynamic and flexible. Very international teams, nice working atmosphere, I regularly receive valuable feedback from my supervisor, you receive regular updates from management on new things, company benefits (like Foodora dinner, fresh fruit, cooperation with sport clubs, discount on public transport...), different team and company events.", "cons": "Company grows fast incl. the ventures, that there is not much space and it is a little crowded sometimes. But everyone tries to make the best out of it.", "advice": "Keep on listening to improve and stay transparent"}, {"title": "start-up atmosphere in a professional environment", "text": "Pros - young and dynamic teams - great culture - lots of team events - interesting and challenging responsibilities Cons - no 9 to 5 job Advice to Management - share your visions and ideas more, maybe employees have great ideas to add", "rating": 5, "pros": "- young and dynamic teams", "cons": "- no 9 to 5 job", "advice": "- share your visions and ideas more, maybe employees have great ideas to add"}, {"title": "Good on paper", "text": "Pros Central office Flexible work times (within reason) Cons Politics Politics More politics There are huge rifts within the centralised teams making it very difficult to get a good job done and support the ventures. Advice to Management Everyone is on the same team, flatten the team structures, make and manage smaller focuses teams.", "rating": 1, "pros": "Central office", "cons": "Politics", "advice": "Everyone is on the same team, flatten the team structures, make and manage smaller focuses teams."}, {"title": "Good place to work at - uninteresting job", "text": "Pros - great environment and working equipment - great place to network - free drinks, fruits, cereals - good pay (for a student job) Cons In the venture I was working for, the job had no intellectual value added.", "rating": 3, "pros": "- great environment and working equipment", "cons": "In the venture I was working for, the job had no intellectual value added.", "advice": null}, {"title": "Marketing", "text": "Pros - More professional than the former fox party character - Learn from finance consultants and entrepreneurs from diverse backgrounds. - Located central and nice part of Berlin near the popular Alexanderplatz. - If management likes you personally you get promoted quickly. - They hire very friendly people so the office cheerful. Cons - Titles are overused at Finleap along with all Hitfox companies. Do not count on a title to be a determining factor person is skilled enough for that role. -Females are not treated equally. There are favorites by the management team and those favorites are invited to all male team building trips. - If responsibilities become almost unachievable, management is finding reasons to legally terminate you. There is a previous history of employees and cofounders who left quietly and amicably. - Hitfox and Finleap are similar to Rocket. Unoriginal, quickly built and the management turnover is a glass door that spins round to push people in and out of the company quickly. - CEO who is founder of HitFox seems nice but never knows what his management team is doing. Often he is too busy jettsetting around the world or hosting his own private parties to pay attention if he hired good or poor leadership. - There are little growth opportunities at any of the companies if you do not fit into their preconditioned profile of what an entrepreneur should look like. Advice to Management Do not assume people who are hired in certain high titles should be immune to the same level of performance of employees who report to those people. Work goes unrecognized if you do not report to the CEO.", "rating": 1, "pros": "- More professional than the former fox party character", "cons": "- Titles are overused at Finleap along with all Hitfox companies. Do not count on a title to be a determining factor person is skilled enough for that role.", "advice": "Do not assume people who are hired in certain high titles should be immune to the same level of performance of employees who report to those people. Work goes unrecognized if you do not report to the CEO."}, {"title": "A place to grow", "text": "Pros FinLeap offers growth and learning opportunities, hard work but also plenty of fun and an interesting team to work with and learn from. Cons The rapid growth has created some tensions that need to be addressed at the moment, which is in progress. The culture needs to be defined again and again, as the 'old' HitFox values are not always applicable anymore. Advice to Management Communicate!", "rating": 5, "pros": "FinLeap offers growth and learning opportunities, hard work but also plenty of fun and an interesting team to work with and learn from.", "cons": "The rapid growth has created some tensions that need to be addressed at the moment, which is in progress. The culture needs to be defined again and again, as the 'old' HitFox values are not always applicable anymore.", "advice": "Communicate!"}, {"title": "happy here", "text": "Pros i started at finleap a few months ago and i knew what i had to expect - an ambitious and fast paced company which is about to grow...that was the reason why i decided to join.... where else do you get to work directly with a previous bank ceo and other industry experts from all over the world? ofcourse there are a lot of challenges but thats what attracted me most - i can be part of finding the solution for some of the challenges.... Cons as already mentioned the procedural challenges are there. Advice to Management more company parties.....", "rating": 5, "pros": "i started at finleap a few months ago and i knew what i had to expect - an ambitious and fast paced company which is about to grow...that was the reason why i decided to join.... where else do you get to work directly with a previous bank ceo and other industry experts from all over the world? ofcourse there are a lot of challenges but thats what attracted me most - i can be part of finding the solution for some of the challenges....", "cons": "as already mentioned the procedural challenges are there.", "advice": "more company parties....."}, {"title": "Business Development", "text": "Pros - Networking opportunities - Chance to learn from experienced Investment Bankers and Entrepreneurs - Free fruits, cereals and drinks Cons - Poor planning (several projects died before launching but after hiring - leaving a lot of new hires in limbo) - Poor communication (no farewell emails, no explanations why projects are shut down, management is never in the office) - Companies not working well / bad execution (Valendo, Billfront, Dataconomy, and Finreach are barely surviving) - Terrible work environment (half of 2015 hirings left the company, pessimism began to rein since some months ago) Advice to Management - Spend less in PR and focus more on Employees' satisfaction - Stop bluffing about being better than Rocket Internet, instead learn how to execute", "rating": 3, "pros": "- Networking opportunities", "cons": "- Poor planning (several projects died before launching but after hiring - leaving a lot of new hires in limbo)", "advice": "- Spend less in PR and focus more on Employees' satisfaction"}, {"title": "Amazing Journey...and is has just begun.", "text": "Pros - people first approach and great culture - tough hiring/selection process - interesting business models - smoothly executed ventures - learning curve - great founder teams! Cons - it gets crowded in the office due to growth - communication about overall strategy could be improved (more team meetings) Advice to Management You are doing a great job! Let us know more about the journey which is ahead of FinLeap.", "rating": 5, "pros": "- people first approach and great culture", "cons": "- it gets crowded in the office due to growth", "advice": "You are doing a great job!"}, {"title": "Dynamisch und Gut, volles Start-Up Programm", "text": "Pros Netzwerk, agil, upside potential, case by case, Kollegen Cons Struktur, Büro, IT, Kaffee und Location Advice to Management Mehr reale Incentives für Mitarbeiter", "rating": 5, "pros": "Netzwerk, agil, upside potential, case by case, Kollegen", "cons": "Struktur, Büro, IT, Kaffee und Location", "advice": "Mehr reale Incentives für Mitarbeiter"}, {"title": "Spannend und fordernd", "text": "Pros Dynamisch, kurze Entscheidungswege - insgesamt sehr interessantes Umfeld Cons Management in jüngster Zeit sehr Berater-gefärbt Advice to Management Mehr echte Gründer an Bord holen, kürzlich eingeführte strukturelle Ebenen überdenken", "rating": 5, "pros": "Dynamisch, kurze Entscheidungswege - insgesamt sehr interessantes Umfeld", "cons": "Management in jüngster Zeit sehr Berater-gefärbt", "advice": "Mehr echte Gründer an Bord holen, kürzlich eingeführte strukturelle Ebenen überdenken"}, {"title": "Great Team, great level of independence", "text": "Pros Working at FinLeap is always filled with lessons. I have never learned so much so quickly. Also, my superiors enabled me to work independently, which I really enjoyed. Cons Working at FinLeap is what you make of it. It is very important to have self-motivation, otherwise it might be difficult to learn somethign new every day. Advice to Management Continue to find the best finance talent out there and bring them togehter to do something special!", "rating": 5, "pros": "Working at FinLeap is always filled with lessons. I have never learned so much so quickly. Also, my superiors enabled me to work independently, which I really enjoyed.", "cons": "Working at FinLeap is what you make of it. It is very important to have self-motivation, otherwise it might be difficult to learn somethign new every day.", "advice": "Continue to find the best finance talent out there and bring them togehter to do something special!"}]