[{"title": "New First Data vs. Old First Data", "text": "Pros I’ve been at First Data since 2014 and read Glassdoor reviews from time to time. They go back as far as 2008 and reflect the company’s journey through a number of leadership changes since the 2007 leveraged buyout. The tumultuous period from 2007 to 2013, compounded by the global financial crisis, which particularly affected companies whose revenues are tied to consumer spending, stunted the company’s growth. That all began to change in 2013 with the arrival of Frank Bisignano as CEO and the steps he’s taken to transform the company, beginning with giving every employee stock in the company instead of a 401k match. Change isn’t always easy, but in First Data’s case, it was badly needed. Some colleagues who’d been here well before Frank arrived didn’t like that move because the stock, until our Initial Public Offering in 2015, was illiquid, like a startup equity you couldn’t sell. That’s all changed when FDC become a publicly traded equity again. We get annual equity grants that are equal to or better than a standard 401-k match, and the value of the stock has grown almost twice as much as the S&P year-to-date. This is a great deal for anyone who works here. And guess what? The deal is only going to get better because the payments industry is the place to be, and First Data is a strong bet on the future. If you look only at what the company has done this year, it’s making strong moves to develop the right technology, innovation and talent to expand its industry leadership. The Clover team in Silicon Valley has come out with the fifth model of the Clover family. The acquisition of Acculynk is strengthening the company in debit processing. And the acquisition of CardConnect opens up a whole new world in our relationship with Independent Sales Organizations (ISOs) and Independent Software Vendors (ISVs). The future is bright indeed. And if anyone still thinks this remains the “legacy First Data,” take a look at how welcoming the company is to veterans and military families or the LGBTQ community. Diversity – of age, gender, orientation, and background is at the heart of an overall cultural uplift I’ve seen over four years. The latest case-in-point? If you’re an auto racing fan like I am, take a look at Kyle Larson, the millennial rockstar of NASCAR. He’s proudly wearing the First Data name on his chest and putting it on his car, backed up by an extraordinary team and state-of-the-art technology, like the New First Data itself. Cons It takes a while for a company that's been around since 1971 to fully shed its old veneer, or its old attitudes. In my job I’ve been to a number of First Data offices, and some are more contemporary than others. I know efforts are underway to modernize them, and these efforts need to continue. For the younger people here, they’re adapting well to their surroundings. First Data may never be a place where the offices are lined with sofas and ping pong tables – though you never know what you might find in Silicon Valley – but the attitude and spirit, reflected in the energy that these software developers, engineers, project managers, and salespeople, are changing quickly. Over time, I’m sure, the furniture and fittings of the office will change, along with the attitudes and outlook. But the accelerated pace and tempo of the New First Data may not be for everyone, and if some are used to a more 9-to-5 job or “the way things used to be,” this may not be the place for them. Advice to Management If you spend a lot of time sifting through reviews about First Data, you’re bound to find some negative sentiments, particularly in the older reviews and among those who’ve left the company. Take that for what it’s worth. Keep your eyes on the prize. The best thing that management can do – both for its clients and its employees – is to continue to innovate, develop talent, grow the topline, and manage expenses. It’s all hard work to get right, but the payoff for everyone at the company is when clients have access to the breadth of our new solutions and the share price moves higher. Back in 2013, few would have believed that a company with an illiquid stock valued at around $11 a share would be publicly traded in the range of $18. That’s good, but no one should be satisfied. First Data has a lot of headroom to grow, and it’s better to focus on what’s needed to do that than reading old Glassdoor reviews from folks who aren’t bought in to the journey ahead.", "rating": 5, "pros": "I’ve been at First Data since 2014 and read Glassdoor reviews from time to time. They go back as far as 2008 and reflect the company’s journey through a number of leadership changes since the 2007 leveraged buyout.", "cons": "It takes a while for a company that's been around since 1971 to fully shed its old veneer, or its old attitudes. In my job I’ve been to a number of First Data offices, and some are more contemporary than others. I know efforts are underway to modernize them, and these efforts need to continue.", "advice": "If you spend a lot of time sifting through reviews about First Data, you’re bound to find some negative sentiments, particularly in the older reviews and among those who’ve left the company. Take that for what it’s worth."}, {"title": "Anonymous former employee", "text": "Pros The people at First Data are great! That's it, nothing else. Don't come to FD. Everyone is trying to get out. Cons Everything. Stay far away. They bring you here and then do everything to screw their employees. Cut all benefits, misrepresented stock opportunity to new hires - blatantly lied. No 401k match. No regard for employees - viewed as easily replaceable. Wouldn't know talent if it hit them in the face - and don't know how to develop and engage their talent. Lie to employees about everything and put a 'spin' on everything. No integrity, 0 ethics. The worst company I have ever worked for. Would never refer an enemy here. CEO is constantly devising new ways to take money from employees. What company pays more stock than cash to the majority of employees? First Data. CEO may have been good at Chase but why wasn't he next in line for CEO? He has no people skills and just doesn't give a hoot about employees. Too much more to list. Stay away. Advice to Management Your 'owner-associates' are not stupid - they see right through you. Do some research - if you want to increase the stock price, focus on your employees - there is a direct linkage there. Stop thinking you know everything and listen to the ideas of others. This isn't the 1980s... Your management skills need to progress and change with the times. FD is a good company, but you are bringing it down.", "rating": 5, "pros": "The people at First Data are great! That's it, nothing else. Don't come to FD. Everyone is trying to get out.", "cons": "Everything. Stay far away. They bring you here and then do everything to screw their employees. Cut all benefits, misrepresented stock opportunity to new hires - blatantly lied. No 401k match. No regard for employees - viewed as easily replaceable. Wouldn't know talent if it hit them in the face - and don't know how to develop and engage their talent. Lie to employees about everything and put a 'spin' on everything. No integrity, 0 ethics. The worst company I have ever worked for. Would never refer an enemy here. CEO is constantly devising new ways to take money from employees. What company pays more stock than cash to the majority of employees? First Data. CEO may have been good at Chase but why wasn't he next in line for CEO? He has no people skills and just doesn't give a hoot about employees. Too much more to list. Stay away.", "advice": "Your 'owner-associates' are not stupid - they see right through you. Do some research - if you want to increase the stock price, focus on your employees - there is a direct linkage there. Stop thinking you know everything and listen to the ideas of others. This isn't the 1980s... Your management skills need to progress and change with the times. FD is a good company, but you are bringing it down."}, {"title": "Good Company", "text": "Pros Pros Meaningful work Good work life balance Cons Cons Poor HR communication Very hierarchial", "rating": 5, "pros": "Pros", "cons": "Cons", "advice": null}, {"title": "Director of Client Relations", "text": "Pros CEO was upfront about current company situation Cons the large debt from the KKR buyout influenced many aspects of the job and made for a \"wait for the next shoe to fall\" mentality.", "rating": 3, "pros": "CEO was upfront about current company situation", "cons": "the large debt from the KKR buyout influenced many aspects of the job and made for a \"wait for the next shoe to fall\" mentality.", "advice": null}, {"title": "Great career opportunities for everyone", "text": "Pros competitive pay, career growth, amazing benefits Cons Cons depends on which department you are in", "rating": 5, "pros": "competitive pay, career growth, amazing benefits", "cons": "Cons depends on which department you are in", "advice": null}, {"title": "Operations Supervisor", "text": "Pros The people you work with and some of the other managers. Some days you really feel like you are making a difference. Cons Layoffs, metrics, not getting input from all vested parties before changing processes. Advice to Management Pay internal candidates on the same scale as external candidates. This drives away many great employees.", "rating": 3, "pros": "The people you work with and some of the other managers. Some days you really feel like you are making a difference.", "cons": "Layoffs, metrics, not getting input from all vested parties before changing processes.", "advice": "Pay internal candidates on the same scale as external candidates. This drives away many great employees."}, {"title": "Customer Service", "text": "Pros Good benefits, training, have floorwalkers that help when stuck on a call with hard to answer Cons Lot of cross training that can cause you to stumble because each alliance has different procedures, policies and regulations and your expected to know it all. along with that fast pace and can be overwhelming at times (to think or problem solve)", "rating": 5, "pros": "Good benefits, training, have floorwalkers that help when stuck on a call with hard to answer", "cons": "Lot of cross training that can cause you to stumble because each alliance has different procedures, policies and regulations and your expected to know it all. along with that fast pace and can be overwhelming at times (to think or problem solve)", "advice": null}, {"title": "Will probably get laid off.", "text": "Pros You receive a paycheck every two weeks. Cons No loyalty to employees what so ever. You're just a time clock punching robot. Lay offs and very questionable hiring practices in recent years. Advice to Management Check into the high turn over rates, in areas, that there wasn't before. Oh right, clearly, don't care. That's been made clearly obvious.", "rating": 3, "pros": "You receive a paycheck every two weeks.", "cons": "No loyalty to employees what so ever. You're just a time clock punching robot.", "advice": "Check into the high turn over rates, in areas, that there wasn't before. Oh right, clearly, don't care. That's been made clearly obvious."}, {"title": "Works for some but certainly not for most", "text": "Pros Competitive salary and bonus structure. Many friendly/ supportive co-workers and peers. Emerging market and business segment. Surrounded by a team with tremendous work ethic and commitment to succeed. Business goals are simple- to increase shareholder value! Market leader. Cons Benefits are average at best. Lack of employee- centric culture. Excessive focus on cost- savings and bottom line. Leaders communicate a desire to “transform” but continuously request “status quo”. Technology infrastructure is ancient. Incompetent leaders are shuffled and not managed out. Majority of current employees are looking for alternatives but scared to jump. Employee engagement is non-existent. Data analysis used to focus on what happened instead of what can/ should happen. Business goals are linear and create a checklist mentality. FD works for some but can alienate those who are driven by passion and purpose. Advice to Management Messages do not appropriately flow to front-line associates. There is tremendous fear around continued employment—> decide on company goals and create strategy to achieve them vs re-evaluating every quarter and exercising “events” to manage people out and save $. Encourage senior leaders to influence performance through recognition and celebrations. Promote/ hire innovative leaders and allow them to shift traditional thought. Question (most) standard process by asking why and gauging if desired results are being obtained. Realize it might time to shift from restructuring company to revolutionizing company.", "rating": 3, "pros": "Competitive salary and bonus structure. Many friendly/ supportive co-workers and peers. Emerging market and business segment. Surrounded by a team with tremendous work ethic and commitment to succeed. Business goals are simple- to increase shareholder value! Market leader.", "cons": "Benefits are average at best. Lack of employee- centric culture. Excessive focus on cost- savings and bottom line. Leaders communicate a desire to “transform” but continuously request “status quo”. Technology infrastructure is ancient. Incompetent leaders are shuffled and not managed out. Majority of current employees are looking for alternatives but scared to jump. Employee engagement is non-existent. Data analysis used to focus on what happened instead of what can/ should happen. Business goals are linear and create a checklist mentality. FD works for some but can alienate those who are driven by passion and purpose.", "advice": "Messages do not appropriately flow to front-line associates. There is tremendous fear around continued employment—> decide on company goals and create strategy to achieve them vs re-evaluating every quarter and exercising “events” to manage people out and save $. Encourage senior leaders to influence performance through recognition and celebrations. Promote/ hire innovative leaders and allow them to shift traditional thought. Question (most) standard process by asking why and gauging if desired results are being obtained. Realize it might time to shift from restructuring company to revolutionizing company."}, {"title": "Great company overall", "text": "Pros Flexible hours, paid holidays, overtime (when avail.) Cons Benefits,", "rating": 5, "pros": "Flexible hours, paid holidays, overtime (when avail.)", "cons": "Benefits,", "advice": null}, {"title": "Location Is Important -- If you're at the right site, it could be great.", "text": "Pros Growing company for the most part. Apparent room for advancement provided you are located at a major site. Good people working there. Ability to acquire stock in the company. Like any job so much of it's value will be in what you put into it. Cons First Data has acquired a number of other businesses in the past which is fine however once they are acquired, there is no effort to bring these lines of business into alignment with existing processes and procedures. As a result, there is no consistency or standardization across the lines of business. Departments become siloed with each line of business having it's own platform software and processes. Little attention paid to the voice of the employee --leadership has been repeatedly asked by owner/associates to provide surveys but have yet to do so. Advice to Management Please begin leadership surveys starting from the top (CEO) down. Your customers and clients experience with First Data will only be as good as your owner-associates make it --give them an opportunity to be heard and then follow through on any constructive criticism. Demonstrate that leadership accountability is not just to the shareholders and customers but also to the owner-associates. Seriously consider investing some money into standardizing your platforms and processes --it will require a significant effort up front but your business and your customers will benefit in the end.", "rating": 3, "pros": "Growing company for the most part. Apparent room for advancement provided you are located at a major site. Good people working there. Ability to acquire stock in the company. Like any job so much of it's value will be in what you put into it.", "cons": "First Data has acquired a number of other businesses in the past which is fine however once they are acquired, there is no effort to bring these lines of business into alignment with existing processes and procedures. As a result, there is no consistency or standardization across the lines of business. Departments become siloed with each line of business having it's own platform software and processes. Little attention paid to the voice of the employee --leadership has been repeatedly asked by owner/associates to provide surveys but have yet to do so.", "advice": "Please begin leadership surveys starting from the top (CEO) down. Your customers and clients experience with First Data will only be as good as your owner-associates make it --give them an opportunity to be heard and then follow through on any constructive criticism. Demonstrate that leadership accountability is not just to the shareholders and customers but also to the owner-associates. Seriously consider investing some money into standardizing your platforms and processes --it will require a significant effort up front but your business and your customers will benefit in the end."}, {"title": "Invest in Talent. Drain the swamp.", "text": "Pros Solid work experience, for what it's worth. Cons Toxic culture from the top-down. Unwilling to invest in talent. Bonus scheme is a joke. Exec compensation is out of control. SVPs are largely political appointments with no regard to merit. Talent pipeline is corrupted with dumb executive-referrals. VP turnover is anathema to progress. Finance department is a mess. Plummeting stock and JV channel. Feigning expansion through acquisition to hide declines in organic growth.", "rating": 3, "pros": "Solid work experience, for what it's worth.", "cons": "Toxic culture from the top-down. Unwilling to invest in talent. Bonus scheme is a joke. Exec compensation is out of control. SVPs are largely political appointments with no regard to merit. Talent pipeline is corrupted with dumb executive-referrals. VP turnover is anathema to progress. Finance department is a mess. Plummeting stock and JV channel. Feigning expansion through acquisition to hide declines in organic growth.", "advice": null}, {"title": "Technical Support", "text": "Pros Depending on supervisor, departments can be friendly and inviting. Cons The company as a whole has no clear direction which leads to constant changes/back-and-forths in procedure whether that be products sold, quality expectations, etc.. First Data cuts cost by hiring fewer new employees, opting to \"request\" current employees to temporarily cross-train and fill in for other departments. They will then require you to permanently take on these added responsibilities since \"you already know how to\" without giving pay raises for doing multiple jobs. Many employees in my department worked 3 or 4 other departments' products without additional compensation. The pay for my department was far from competitive. Many of the level 2's and team leads jumped ship as soon as they could since the pay increase from level 1 was near non-existent. First Data loses almost all of its talent, (in our department's case our senior/knowledgeable agents) in this way. Additionally there is very high turn-over, few/small raises, and little opportunity to grow within the company.", "rating": 3, "pros": "Depending on supervisor, departments can be friendly and inviting.", "cons": "The company as a whole has no clear direction which leads to constant changes/back-and-forths in procedure whether that be products sold, quality expectations, etc.. First Data cuts cost by hiring fewer new employees, opting to \"request\" current employees to temporarily cross-train and fill in for other departments. They will then require you to permanently take on these added responsibilities since \"you already know how to\" without giving pay raises for doing multiple jobs. Many employees in my department worked 3 or 4 other departments' products without additional compensation. The pay for my department was far from competitive. Many of the level 2's and team leads jumped ship as soon as they could since the pay increase from level 1 was near non-existent. First Data loses almost all of its talent, (in our department's case our senior/knowledgeable agents) in this way. Additionally there is very high turn-over, few/small raises, and little opportunity to grow within the company.", "advice": null}, {"title": "Production locations treated like stepchildren", "text": "Pros Strongly promote diversity and non discrimination for older workers and those with obvious weight and health issues. Cons Need to hire more supervisors Layoffs about every 6 months Employees held to minimal or no accountability when procedures aren't followed Extreme challenge to get supplies to do your job due to cost reductions but still expected to meet client goals Advice to Management Hire more supervisors and stop hiring so many six figure executives. Instead increase the low salaries paid to production workers. Salaries are so low a significant number of employees have to get a second job to provide for their families.", "rating": 3, "pros": "Strongly promote diversity and non discrimination for older workers and those with obvious weight and health issues.", "cons": "Need to hire more supervisors", "advice": "Hire more supervisors and stop hiring so many six figure executives. Instead increase the low salaries paid to production workers. Salaries are so low a significant number of employees have to get a second job to provide for their families."}, {"title": "Manager", "text": "Pros This is a company that has a huge piece of the pie in the payments industry. There is huge upside to potential of the employees who work at First Data. There are few, but great leaders who actually value their employees, and if you’re one of those employees, there is room for upward mobility and professional benefit. Cons There seems to be a “members only club” type culture. If you’re not in the club, don’t bother working towards being in it, they play favorites regardless your work ethic, value, and ideas. Underpaid per industry standards. You’re extremely expendable Advice to Management look at people as ... well people", "rating": 3, "pros": "This is a company that has a huge piece of the pie in the payments industry. There is huge upside to potential of the employees who work at First Data. There are few, but great leaders who actually value their employees, and if you’re one of those employees, there is room for upward mobility and professional benefit.", "cons": "There seems to be a “members only club” type culture. If you’re not in the club, don’t bother working towards being in it, they play favorites regardless your work ethic, value, and ideas. Underpaid per industry standards. You’re extremely expendable", "advice": "look at people as ... well people"}, {"title": "Manager", "text": "Pros Great people to work with. Growth and Development. Healthcare options on providers and levels of coverage. Cons So many layers of management. Changes in Management at the higher levels. You learn what current management expects and their management style and the it changes. Advice to Management Be open to learning new things and take on the opportunitys when your manager presents it to you. Be willing to be flexible with your schedule and willing to work more then 40 hours a week.", "rating": 5, "pros": "Great people to work with.", "cons": "So many layers of management.", "advice": "Be open to learning new things and take on the opportunitys when your manager presents it to you. Be willing to be flexible with your schedule and willing to work more then 40 hours a week."}, {"title": "Executive strategy does not translate into trenches", "text": "Pros Main benefit is a regular paycheck. Get a chance to learn some new technologies in the payment industry, but that is heavily group dependent. Some areas of the company are still running software done in 1989 - for real, no exaggeration. Cons Whatever forward looking strategy management is promoting, it is not translating well in the trenches. All we see is Accenture replacing American jobs and because majority of off-shore workers simply do not understand US business, it puts more pressure on us locally. Our group lost four people in the last 18 months plus group manager. Not one position has been allowed to be replaced. We report to the old managers manager, who has no technical background in what we do, and just advises us to work smarter, without actual insight on how to do so when you are five folks short. Advice to Management Someone has to bite the bullet and stop trying to recover all the KKR loses since 2007- it it's not going to happen. Try to get the company to the pre-buyout mentality and workforce level to maintain industry leadership.", "rating": 3, "pros": "Main benefit is a regular paycheck. Get a chance to learn some new technologies in the payment industry, but that is heavily group dependent. Some areas of the company are still running software done in 1989 - for real, no exaggeration.", "cons": "Whatever forward looking strategy management is promoting, it is not translating well in the trenches. All we see is Accenture replacing American jobs and because majority of off-shore workers simply do not understand US business, it puts more pressure on us locally. Our group lost four people in the last 18 months plus group manager. Not one position has been allowed to be replaced. We report to the old managers manager, who has no technical background in what we do, and just advises us to work smarter, without actual insight on how to do so when you are five folks short.", "advice": "Someone has to bite the bullet and stop trying to recover all the KKR loses since 2007- it it's not going to happen. Try to get the company to the pre-buyout mentality and workforce level to maintain industry leadership."}, {"title": "Desktop support", "text": "Pros Great pay , tuition reimbursement , alot of room to grow. Cons You have to create your own pay increase by leap frogging positions. Watch out for mass lay offs due to yearly budget cuts", "rating": 5, "pros": "Great pay , tuition reimbursement , alot of room to grow.", "cons": "You have to create your own pay increase by leap frogging positions. Watch out for mass lay offs due to yearly budget cuts", "advice": null}, {"title": "Business/Systems Consultant", "text": "Pros Provides opportunity to grow and establish a firm basis in all aspects of a job. Most managers accept and appreciate self-starters and allow for autonomy. Cons Not much that I would say that's a con as it relates to First data - I've always found the organization to be respectful and attentive to its employees.", "rating": 5, "pros": "Provides opportunity to grow and establish a firm basis in all aspects of a job. Most managers accept and appreciate self-starters and allow for autonomy.", "cons": "Not much that I would say that's a con as it relates to First data - I've always found the organization to be respectful and attentive to its employees.", "advice": null}, {"title": "layoffs", "text": "Pros at this point no pros Cons Lay off again to senior people so they dont have to pay out retirement funds and weed out higher paid employees", "rating": 3, "pros": "at this point no pros", "cons": "Lay off again to senior people so they dont have to pay out retirement funds and weed out higher paid employees", "advice": null}, {"title": "worked in Production", "text": "Pros Great benefits, A/C building, right off the frwy Cons Run don't walk,,,,, if cool with, or in circle. Left hand runs wild,,right hand is sleep. Advice to Management who would listen,", "rating": 3, "pros": "Great benefits, A/C building, right off the frwy", "cons": "Run don't walk,,,,, if cool with, or in circle. Left hand runs wild,,right hand is sleep.", "advice": "who would listen,"}, {"title": "Team Manager", "text": "Pros For the owner associated career growth is open Cons Limited career growth planning, promotions are based on favoritism, Just because you know a product well does not necessarily make you management material. Several team managers were promoted but did not meet the education requirements nor did they have any management experience. Advice to Management Its just isnt worth saying anything because it falls on deaf ears", "rating": 1, "pros": "For the owner associated career growth is open", "cons": "Limited career growth planning, promotions are based on favoritism, Just because you know a product well does not necessarily make you management material. Several team managers were promoted but did not meet the education requirements nor did they have any management experience.", "advice": "Its just isnt worth saying anything because it falls on deaf ears"}, {"title": "Product Management", "text": "Pros I don't have any pros for this company Cons Unfortunately, this company is saddled with debt and that creates a very negatively de-motivated workforce and culture Advice to Management Motivate your employees with something other than \"cut costs\" in every message from senior staff", "rating": 1, "pros": "I don't have any pros for this company", "cons": "Unfortunately, this company is saddled with debt and that creates a very negatively de-motivated workforce and culture", "advice": "Motivate your employees with something other than \"cut costs\" in every message from senior staff"}, {"title": "Company is too unstable - I should have read glassdoor before I took the job", "text": "Pros When they hired me in mid 2015 they offered a salary slightly higher than what I was making. Cons 18 months after they hired me I was fired in a downsizing. I was told I was too expensive and they regretted the original offer they made - it had nothing to do with my performance. Also my job was being moved to India! During my 18 months I reported to 2 different managers. The first one was laid off 3 weeks after I started and the 2nd one was his boss and spent almost no time with my team. Advice to Management You are Un-American! FD is sending good jobs outside the US. The constant hiring/firing/offshoring is crazy. How can you talk about sponsoring Nascar and the Mets and have such an unstable workplace? I think the CEO wants to have no people working there - or at least no American people.", "rating": 1, "pros": "When they hired me in mid 2015 they offered a salary slightly higher than what I was making.", "cons": "18 months after they hired me I was fired in a downsizing. I was told I was too expensive and they regretted the original offer they made - it had nothing to do with my performance. Also my job was being moved to India! During my 18 months I reported to 2 different managers. The first one was laid off 3 weeks after I started and the 2nd one was his boss and spent almost no time with my team.", "advice": "You are Un-American! FD is sending good jobs outside the US. The constant hiring/firing/offshoring is crazy. How can you talk about sponsoring Nascar and the Mets and have such an unstable workplace? I think the CEO wants to have no people working there - or at least no American people."}, {"title": "Good people to work with", "text": "Pros Enjoyed my time here meeting new people. Cons Add more training for new employees", "rating": 5, "pros": "Enjoyed my time here meeting new people.", "cons": "Add more training for new employees", "advice": null}, {"title": "QA Engeeneer", "text": "Pros laid back environment. helpful co workers. Cons no 401K, no raise, lay off frequently. Not a good place to work. No Job safety. Advice to Management stop Micro Management, listen to employee.", "rating": 3, "pros": "laid back environment. helpful co workers.", "cons": "no 401K, no raise, lay off frequently. Not a good place to work. No Job safety.", "advice": "stop Micro Management, listen to employee."}, {"title": "Worst place I've ever worked for", "text": "Pros Pay and overtime..Its a paycheck and will pay your bills. If you're lucky you'll sit next to a few people who are cool. Cons You couldnt pay me 100 dollars an hour to work here. This was the worst job I've ever worked for. I was promised there was room for advancement. In one year I was told every month that I was doing great and would have no problem getting into management. One year there and the only person promoted was someone from Sun Sentinel who barely met his 90 days. Management was a joke. They sit their at their desk and email you about every wrong thing our teams were doing. A normal day consists of going into work, getting cursed out by Bank of America merchants who are set up as merchants given false promises and lies. Bank of America is a scam from the start and agents get the worst of it. I feel so bad for anyone who is a merchant and has to work here. Most to almost all 5 star reviews on here are from people who work for First Data in management. Advice to Management I hope every merchant realizes that Sun Trust, Bank of America, Wells Fargo, Sams Club, are all part of this big scam. I hope that everyone who went and is going through what I did finds a better/real job :)", "rating": 1, "pros": "Pay and overtime..Its a paycheck and will pay your bills. If you're lucky you'll sit next to a few people who are cool.", "cons": "You couldnt pay me 100 dollars an hour to work here. This was the worst job I've ever worked for. I was promised there was room for advancement. In one year I was told every month that I was doing great and would have no problem getting into management. One year there and the only person promoted was someone from Sun Sentinel who barely met his 90 days. Management was a joke. They sit their at their desk and email you about every wrong thing our teams were doing. A normal day consists of going into work, getting cursed out by Bank of America merchants who are set up as merchants given false promises and lies. Bank of America is a scam from the start and agents get the worst of it. I feel so bad for anyone who is a merchant and has to work here. Most to almost all 5 star reviews on here are from people who work for First Data in management.", "advice": "I hope every merchant realizes that Sun Trust, Bank of America, Wells Fargo, Sams Club, are all part of this big scam. I hope that everyone who went and is going through what I did finds a better/real job :)"}, {"title": "Enterprise IT Architect", "text": "Pros Good pay and benefits. I've had excellent supervisors and senior managers/VP's. Cons Constant change in organizational structure. Slow processes. Red tape at every turn.", "rating": 3, "pros": "Good pay and benefits. I've had excellent supervisors and senior managers/VP's.", "cons": "Constant change in organizational structure. Slow processes. Red tape at every turn.", "advice": null}, {"title": "Business Consultant", "text": "Pros First Data has a great training program and provides tools and support for being good in sales. They have the leading technology that makes you very competitive in the industry. I definitely enjoyed working there and felt proud to work for the company. Cons My only downside was my territory. It was very rural so I faced many challenges and did not have as many opportunities as my other colleagues. Also, if you were not at 100% of sales, you could not post for another position.", "rating": 5, "pros": "First Data has a great training program and provides tools and support for being good in sales. They have the leading technology that makes you very competitive in the industry. I definitely enjoyed working there and felt proud to work for the company.", "cons": "My only downside was my territory. It was very rural so I faced many challenges and did not have as many opportunities as my other colleagues. Also, if you were not at 100% of sales, you could not post for another position.", "advice": null}, {"title": "bitter sweet", "text": "Pros always busy never felt like you had to watch the clock Cons relocation without consideration of its long standing workers", "rating": 5, "pros": "always busy never felt like you had to watch the clock", "cons": "relocation without consideration of its long standing workers", "advice": null}, {"title": "House Of Cards", "text": "Pros Stepping stone to gain work experience on your resume Cons Company has been transformed into unrecognizable e collection of disjointed ventures and departments with no common direction and very unqualified management. High stress, high turnover, low morale, inferior products, systems and support.This company keeps getting worse a d worse. Advice to Management CEO and 180 of his closest friends he hired need to go back into the banking business where they came from and relinquish control to industry experienced insiders who can attempt to undo the damage of the last 5 years of destruction.", "rating": 1, "pros": "Stepping stone to gain work experience on your resume", "cons": "Company has been transformed into unrecognizable e collection of disjointed ventures and departments with no common direction and very unqualified management. High stress, high turnover, low morale, inferior products, systems and support.This company keeps getting worse a d worse.", "advice": "CEO and 180 of his closest friends he hired need to go back into the banking business where they came from and relinquish control to industry experienced insiders who can attempt to undo the damage of the last 5 years of destruction."}, {"title": "Overall It's Not a Bad Place", "text": "Pros 12 weeks paid maternity leave 2 weeks paid paternity leave Not gender specific Paid vacation and holidays Ability to WFH if needed, although not encouraged Options for healthcare, 401k, tuition reimbursement and EAP program Perks at Work give discounts to a lot of companies and businesses like gyms and car companies Employee Resource Groups that try to provide inclusion, including a military group, black leadership council, women's leadership council, unity which supports LGBTQ community, YoPro which is the young professionals community, and so on I have worked with some really great people here Ok to listen to music while working Relaxed/flexible dress code I have held several different positions, many opportunities to move and grow a career Cons Only 2 personal days, used to have 8 401k is not matched CEO who is only focused on the bottom line High stress environment due to minimal people hired to do the work High chances of layoffs as FD is known for them Advice to Management Allow the hiring of more folks to take some of the pressure off, and I think more people would stay Don't shame people for taking time off Match 401k again", "rating": 5, "pros": "12 weeks paid maternity leave", "cons": "Only 2 personal days, used to have 8", "advice": "Allow the hiring of more folks to take some of the pressure off, and I think more people would stay"}, {"title": "Culture of autonomy with room to grow.", "text": "Pros I have been challenged for the past two years, in really good ways. The expectations are high but the autonomy and trust I am given to drive new initiatives and get the job done is unlike anywhere I have worked. At the end of the day I take a lot of pride in my work and my leadership lets me know I am valued. Cons The company is currently struggling to present and sell the Clover products. It’s a great product but the sales team is still struggling to get t across to the market.", "rating": 5, "pros": "I have been challenged for the past two years, in really good ways. The expectations are high but the autonomy and trust I am given to drive new initiatives and get the job done is unlike anywhere I have worked. At the end of the day I take a lot of pride in my work and my leadership lets me know I am valued.", "cons": "The company is currently struggling to present and sell the Clover products. It’s a great product but the sales team is still struggling to get t across to the market.", "advice": null}, {"title": "Team Lead", "text": "Pros The benefits are great, and I love the people Cons Nothing really bad to say", "rating": 3, "pros": "The benefits are great, and I love the people", "cons": "Nothing really bad to say", "advice": null}, {"title": "Intern - Hourly", "text": "Pros Good compensation and benefits available. Cons Poor work environment. Very individual focused.", "rating": 3, "pros": "Good compensation and benefits available.", "cons": "Poor work environment. Very individual focused.", "advice": null}, {"title": "A cesspool of flesh eating bacteria", "text": "Pros The financial services industry is a rewarding and challenging career! That would be the only pro to work at FD. Cons People are brought in, given titles and don’t have a clue about the business, from Frank on down. I had a ‘seasoned’ VP brought in to shake up product ask how interchange is earned. With all the cutbacks and layoffs....screwing people’s lives, Frank did find money for box seats at the ball park and sponsoring a race car; downsizing is surgically crafted to keep it out of the newspapers - clients aren’t supposed to know..who are you kidding? Trace the tail number on the corporate jet ....family /personal usage? Any innovation is acquired, little/no investments in core systems. Everything is spin, or better said, lipstick on a pig. The crown jewel Clover...an acquisition. Advice to Management You all are viewed as empty suits, a poster child example of how not to run a company. It’s comical to read those contrived reviews on this web page, more BS.", "rating": 1, "pros": "The financial services industry is a rewarding and challenging career! That would be the only pro to work at FD.", "cons": "People are brought in, given titles and don’t have a clue about the business, from Frank on down. I had a ‘seasoned’ VP brought in to shake up product ask how interchange is earned. With all the cutbacks and layoffs....screwing people’s lives, Frank did find money for box seats at the ball park and sponsoring a race car; downsizing is surgically crafted to keep it out of the newspapers - clients aren’t supposed to know..who are you kidding? Trace the tail number on the corporate jet ....family /personal usage? Any innovation is acquired, little/no investments in core systems. Everything is spin, or better said, lipstick on a pig. The crown jewel Clover...an acquisition.", "advice": "You all are viewed as empty suits, a poster child example of how not to run a company. It’s comical to read those contrived reviews on this web page, more BS."}, {"title": "going down in EMEA", "text": "Pros -interesting technologies -unusual tech environment -as lot of key people left there's a growth potential Cons -HQ lost interest on developing EMEA Advice to Management try to be less US central if you pretend to be a global firm", "rating": 5, "pros": "-interesting technologies", "cons": "-HQ lost interest on developing EMEA", "advice": "try to be less US central if you pretend to be a global firm"}, {"title": "Company not for a single shareholder or so called “OA” return, but for all of those so called “highly seasoned” MCs.", "text": "Pros You’ll experience all the routines of collapsed company; you can’t laugh at much of ado from them, though very comical, since you’ll get to know your dignity as a human being and your career as a professional employee collapsed as well! Cons Everything; low salary having made me get the second job for a living, dis-qualified seniors having made me realize how a company start to fall when they prevail, continued layoff at no discretion having distracted me and all the good colleagues! Advice to Management While bullish stock market these days are making a new record (highest ever) everyday, FD stock price keeps on going down! Ask why to your employees and layoff yourselves, then you’ll become far richer with doubled or tripled stock price!", "rating": 1, "pros": "You’ll experience all the routines of collapsed company; you can’t laugh at much of ado from them, though very comical, since you’ll get to know your dignity as a human being and your career as a professional employee collapsed as well!", "cons": "Everything; low salary having made me get the second job for a living, dis-qualified seniors having made me realize how a company start to fall when they prevail, continued layoff at no discretion having distracted me and all the good colleagues!", "advice": "While bullish stock market these days are making a new record (highest ever) everyday, FD stock price keeps on going down!"}, {"title": "Slap In the Face", "text": "Pros You will work with some of the nicest people. Don't get too close to them though, they will not be around for long. Cons I have been holding off on writing a negative review about this company for a long time, for many reasons. Yesterday, I saw something that finally pushed me over the edge. I refused to complain about the Melville, NY site being closed, and the way everyone was treated for two years, because I do understand that sometimes difficult business decisions need to be made. For those of you that do not live in the Long Island area, there is an arena called Veterans Memorial Coliseum. They used to be the home of the New York Islanders. I attended an event last night at this venue, and as I was walking down the halls with my family, noticed signage for \"First Data Suites\". I was furious. How dare this company, who cut the jobs of 900 or so loyal employees, just ten miles away, purchase a suite at a local arena? There is no longer a First Data presence on Long Island, only New York City and New Jersey. I kept calm and enjoyed the event I was at, but how heartless can you be? Spending money to sponsor a race car? The Met's Spring Training field in Florida? Yet every six months, people who actually believe in and care about the company the way I did (do) are let out the door. It's amazing to me how many relatives of the CEO and other Management Committee members managed to stay in jobs they are not qualified for. Don't even get me started on the Chief Control Officer, who came in and lied to the Credit departments faces for two years. Lie is a word not to be used lightly, but that's what it was. Two years of promises and not a clue. Folks, stop believing the positive reviews as it looks like First Data is finally paying off Glassdoor. This is how they solve issues. Instead of getting to the root cause, they throw money at it. Advice to Management If you truly want to win hearts and minds, take a look at the people who bought into your long term plans. Don't get rid of them when many associates did not and are still complaining.", "rating": 3, "pros": "You will work with some of the nicest people. Don't get too close to them though, they will not be around for long.", "cons": "I have been holding off on writing a negative review about this company for a long time, for many reasons. Yesterday, I saw something that finally pushed me over the edge. I refused to complain about the Melville, NY site being closed, and the way everyone was treated for two years, because I do understand that sometimes difficult business decisions need to be made. For those of you that do not live in the Long Island area, there is an arena called Veterans Memorial Coliseum. They used to be the home of the New York Islanders. I attended an event last night at this venue, and as I was walking down the halls with my family, noticed signage for \"First Data Suites\". I was furious. How dare this company, who cut the jobs of 900 or so loyal employees, just ten miles away, purchase a suite at a local arena? There is no longer a First Data presence on Long Island, only New York City and New Jersey. I kept calm and enjoyed the event I was at, but how heartless can you be? Spending money to sponsor a race car? The Met's Spring Training field in Florida? Yet every six months, people who actually believe in and care about the company the way I did (do) are let out the door. It's amazing to me how many relatives of the CEO and other Management Committee members managed to stay in jobs they are not qualified for. Don't even get me started on the Chief Control Officer, who came in and lied to the Credit departments faces for two years. Lie is a word not to be used lightly, but that's what it was. Two years of promises and not a clue.", "advice": "If you truly want to win hearts and minds, take a look at the people who bought into your long term plans. Don't get rid of them when many associates did not and are still complaining."}, {"title": "Technical Analysts", "text": "Pros There was a very broad array of products and personnel in so many areas of the company, room for growth and developmental potential in IT Cons The departments of the organization are so incredibly broad and the support in those are will only go so deep, then the support goes offshore. The company has had so many waves of layoffs and shutdown several departments, operations & support across the US. Advice to Management None", "rating": 3, "pros": "There was a very broad array of products and personnel in so many areas of the company, room for growth and developmental potential in IT", "cons": "The departments of the organization are so incredibly broad and the support in those are will only go so deep, then the support goes offshore. The company has had so many waves of layoffs and shutdown several departments, operations & support across the US.", "advice": "None"}, {"title": "Manager - Never get bored", "text": "Pros First Data is a typical large corporate company. There is always a new project to get involved with and you will never be bored. The team I sit with has a great culture and is very close. For me it is all about the people. It is good to see that the company it also making updates to the HQ to make it \"cooler,\" which is needed to recruit younger, top talent. Just wish it was more in the heart of the city. Cons On the flip side, the size of the company prevents quick turn-around and things are changing all the time, preventing consistency and efficiencies. Many benefits are also not up to par with other competitors. Advice to Management What we do is incredibly important to the global economy, and very cool. I wish the company would get a bit more cocky with its online presence with a more updated, youthful voice and get some personality, especially on social media.", "rating": 5, "pros": "First Data is a typical large corporate company. There is always a new project to get involved with and you will never be bored. The team I sit with has a great culture and is very close. For me it is all about the people. It is good to see that the company it also making updates to the HQ to make it \"cooler,\" which is needed to recruit younger, top talent. Just wish it was more in the heart of the city.", "cons": "On the flip side, the size of the company prevents quick turn-around and things are changing all the time, preventing consistency and efficiencies. Many benefits are also not up to par with other competitors.", "advice": "What we do is incredibly important to the global economy, and very cool. I wish the company would get a bit more cocky with its online presence with a more updated, youthful voice and get some personality, especially on social media."}, {"title": "Systems Administrator", "text": "Pros Lots of technology and tons of work to do Cons Management and location, of course management sucks every where, but crapy public transportation to the main building Advice to Management Open your minds", "rating": 5, "pros": "Lots of technology and tons of work to do", "cons": "Management and location, of course management sucks every where, but crapy public transportation to the main building", "advice": "Open your minds"}, {"title": "Change is good", "text": "Pros New focus on technology Cons Not seeing the growth that was expected", "rating": 3, "pros": "New focus on technology", "cons": "Not seeing the growth that was expected", "advice": null}, {"title": "Transformational Bust", "text": "Pros You get to live the rhetoric of “Transformation” Cons 5 years of “Transformation” with zero results, High stress, High Turnover, low pay, inferior leadership, systems and support. No vision, unqualified leadership in every aspect. Advice to Management No advice to management can save this sinking and irrelevant company", "rating": 1, "pros": "You get to live the rhetoric of “Transformation”", "cons": "5 years of “Transformation” with zero results, High stress, High Turnover, low pay, inferior leadership, systems and support. No vision, unqualified leadership in every aspect.", "advice": "No advice to management can save this sinking and irrelevant company"}, {"title": "A Liberal Snake Pit", "text": "Pros Don't waste your time at first data. They will force you to write positive reviews on Glassdoor to compensate for their terrible reputation. Cons If you love watching lots of people get unexpectedly fired right before the holidays then this is the right place for you! Advice to Management Doesn't matter, they are just out for themselves.", "rating": 1, "pros": "Don't waste your time at first data. They will force you to write positive reviews on Glassdoor to compensate for their terrible reputation.", "cons": "If you love watching lots of people get unexpectedly fired right before the holidays then this is the right place for you!", "advice": "Doesn't matter, they are just out for themselves."}, {"title": "An OK Company", "text": "Pros Co-workers are great. The company tries to promote from within. Cons The benefits leave a lot to be desired and the pay is below the national and local average. There is no work life balance. Advice to Management There has been lots of talk about reducing turnover since I started working here, but No one in management seems to be willing to admit that the lack of benefits and low pay is the cause of turnover. You can't expect to retain people when you don't pay them what they are worth.", "rating": 3, "pros": "Co-workers are great. The company tries to promote from within.", "cons": "The benefits leave a lot to be desired and the pay is below the national and local average. There is no work life balance.", "advice": "There has been lots of talk about reducing turnover since I started working here, but No one in management seems to be willing to admit that the lack of benefits and low pay is the cause of turnover. You can't expect to retain people when you don't pay them what they are worth."}, {"title": "Unbeatable lifestyle, great entry level compensation", "text": "Pros - Working with a brand name within the industry opens many doors - You decide how much money you want to make, once your commissions and residuals start rolling in you can have a bad month and still get paid well - Compensation and benefits are best in the industry - You can work with anyone you want and however you want, just get your job done Cons - The core product (payment processing) does not have a competitive advantage - Clover family of products are very limited on the type of merchant that can serve Advice to Management Think of a way to revolutionize the main service you're providing and everything else will fall into place. Understand that the last thing a merchant wants to do is to play with his clover after his 16 hour shift.", "rating": 5, "pros": "- Working with a brand name within the industry opens many doors", "cons": "- The core product (payment processing) does not have a competitive advantage", "advice": "Think of a way to revolutionize the main service you're providing and everything else will fall into place. Understand that the last thing a merchant wants to do is to play with his clover after his 16 hour shift."}, {"title": "Marketing", "text": "Pros Great place to work if you would like to change the world Cons Only for those who are interested in high tech transformations Advice to Management keep upgrading our working environment with collaborative, high tech installations. Varick St, KofP and other sites are great.", "rating": 5, "pros": "Great place to work if you would like to change the world", "cons": "Only for those who are interested in high tech transformations", "advice": "keep upgrading our working environment with collaborative, high tech installations. Varick St, KofP and other sites are great."}, {"title": "CEO doesn't know how to grow", "text": "Pros Great co-workers and innovative solutions Cons CEO did well restructuring debt but has no idea how to grow the business. His solution is to cut expenses and eliminate jobs. Layoffs every 6 months, regardless of how long you've been there. Most departments senior employee has been there less than 3 years. Lots of in-fighting with leadership. No 401k match Health insurance is pitiful. Avoid like the plague! Advice to Management Frank needs to go. He did his job with the debt. Not let a growth leader take over.", "rating": 1, "pros": "Great co-workers and innovative solutions", "cons": "CEO did well restructuring debt but has no idea how to grow the business. His solution is to cut expenses and eliminate jobs. Layoffs every 6 months, regardless of how long you've been there. Most departments senior employee has been there less than 3 years.", "advice": "Frank needs to go. He did his job with the debt. Not let a growth leader take over."}, {"title": "Horrible company, even worst CEO.", "text": "Pros Co-workers, truly miss them. Cons Where to begin. Benefits, Layoffs ALL the time, no room for growth, raises, and of course, CEO. Advice to Management Get rid of Frank.", "rating": 1, "pros": "Co-workers, truly miss them.", "cons": "Where to begin. Benefits, Layoffs ALL the time, no room for growth, raises, and of course, CEO.", "advice": "Get rid of Frank."}, {"title": "Ongoing positive transformation", "text": "Pros First Data enables global commerce offering a wide range of innovative and secure payment solutions. The company helps businesses of all sizes grow and keep pace with changes in the rapidly evolving payments industry. I enjoy First Data's truly global reach, scale and perspective. Cons This competitive sector requires adapting to a changing landscape, which might not appeal to someone looking for a less-challenging role.", "rating": 5, "pros": "First Data enables global commerce offering a wide range of innovative and secure payment solutions. The company helps businesses of all sizes grow and keep pace with changes in the rapidly evolving payments industry. I enjoy First Data's truly global reach, scale and perspective.", "cons": "This competitive sector requires adapting to a changing landscape, which might not appeal to someone looking for a less-challenging role.", "advice": null}, {"title": "Cool if you Dont care", "text": "Pros Great staff all very helpful Cons very disorganized and lacked direction of projects", "rating": 5, "pros": "Great staff all very helpful", "cons": "very disorganized and lacked direction of projects", "advice": null}, {"title": "Soul-less company", "text": "Pros I had a great supervisor for a few months, however he was laid off by First Data, Other than that, I really can't think of anything positive about my experience there. Cons I've worked for several large companies in my career and can say without a doubt that First Data has one of worst corporate cultures of any company that I've worked at or done consulting for. First Data lacks a soul, lacks a leader with heart and is not a fit if you're looking for a meaningful career. The CEO is looking for fame and fortune, and nothing else matters. As employees we were treated like rats in a running wheel. Terrible morale in the office, ongoing layoffs through the years and no recognition for great work.", "rating": 1, "pros": "I had a great supervisor for a few months, however he was laid off by First Data, Other than that, I really can't think of anything positive about my experience there.", "cons": "I've worked for several large companies in my career and can say without a doubt that First Data has one of worst corporate cultures of any company that I've worked at or done consulting for. First Data lacks a soul, lacks a leader with heart and is not a fit if you're looking for a meaningful career. The CEO is looking for fame and fortune, and nothing else matters. As employees we were treated like rats in a running wheel. Terrible morale in the office, ongoing layoffs through the years and no recognition for great work.", "advice": null}, {"title": "Business consultant", "text": "Pros If you can muddle your way through the mud and learn the business, First Data is a good place to learn patience due to the fact that the right hand doesn't know what the left hand is doing and no one seems to care. You can make a good living in this industry though it is not specific to First Data. Cons Incompetent management, an ever-changing Target on goals, our typical comp plans are not delivered until after we have been into the entire year for at least 5 months, leaving us no guidance to ward what goal we should be trying to hit. For example, total revenue versus recurring revenue is an ever-changing argument within this company. Management tries to get us to do things to increase one or the other without knowing where we really even need to land. Our customer support for merchants is atrocious, and unfortunately it leaves the business consultant on the front lines to take abuse from the merchants whenever customer service is incompetent. Most managers in the sales department are hired in without prior industry experience, and it's a real problem when the salesperson knows more than their manager. Advice to Management Pay for Quality employees and train them appropriately. The salespeople cannot do our jobs unless we have proper backup and support. Power enough support people that we don't spend our entire days on hold to try to get help for a merchant. Have you ever heard of the saying that you get what you paid for? I've been with the company for more than 3 years and have seen employees that I would not hire for McDonald's working as sales consultants for our company. Please stop changing the comp plan and let us take a minute to wrap our head around what you actually want us to do. Do this and you will have more employees Embrace changes within the company. Strive for better communication and interaction between your upper management and employees. Remember, your job is kind of like a marriage. Without communication it is bound to fail. Increase your communication and let the right hand know what the left hand is doing, and as a result you will retain more of your precious and valuable assets, your employees.", "rating": 3, "pros": "If you can muddle your way through the mud and learn the business, First Data is a good place to learn patience due to the fact that the right hand doesn't know what the left hand is doing and no one seems to care. You can make a good living in this industry though it is not specific to First Data.", "cons": "Incompetent management, an ever-changing Target on goals, our typical comp plans are not delivered until after we have been into the entire year for at least 5 months, leaving us no guidance to ward what goal we should be trying to hit. For example, total revenue versus recurring revenue is an ever-changing argument within this company. Management tries to get us to do things to increase one or the other without knowing where we really even need to land. Our customer support for merchants is atrocious, and unfortunately it leaves the business consultant on the front lines to take abuse from the merchants whenever customer service is incompetent. Most managers in the sales department are hired in without prior industry experience, and it's a real problem when the salesperson knows more than their manager.", "advice": "Pay for Quality employees and train them appropriately. The salespeople cannot do our jobs unless we have proper backup and support. Power enough support people that we don't spend our entire days on hold to try to get help for a merchant. Have you ever heard of the saying that you get what you paid for? I've been with the company for more than 3 years and have seen employees that I would not hire for McDonald's working as sales consultants for our company. Please stop changing the comp plan and let us take a minute to wrap our head around what you actually want us to do. Do this and you will have more employees Embrace changes within the company. Strive for better communication and interaction between your upper management and employees. Remember, your job is kind of like a marriage. Without communication it is bound to fail. Increase your communication and let the right hand know what the left hand is doing, and as a result you will retain more of your precious and valuable assets, your employees."}, {"title": "Owner Associate and Senior Leader at FD", "text": "Pros This is a fantastic time to be at First Data. We will all tell our kids and grandkids someday that we were a part of the greatest corporate turnaround in history. Along the way, you will work with the best and the brightest people you will ever meet - hard working super smart and willing to pitch in far beyond the norm. Cons Change of this magnitude is not for the faint of heart. You have to be willing to put the time and effort in to being a part of a turnaround story. That story is being written every day - which I find to be exhilarating. This is not a 9-5 environment nor should anyone expect it to be. I would not want that type of role, I like to be engaged fully. The rewards are here for those willing to commit. Advice to Management We have a highly engaged CEO and Management Committee at this company which is very rare and truly appealing. All MC members are out in the business, with their people, solving business issues. Between that engagement and stock ownership at all levels, you really do feel like you are in a place where people are invested in the outcome. That can be lost at a company of this size, but not here.", "rating": 5, "pros": "This is a fantastic time to be at First Data. We will all tell our kids and grandkids someday that we were a part of the greatest corporate turnaround in history. Along the way, you will work with the best and the brightest people you will ever meet - hard working super smart and willing to pitch in far beyond the norm.", "cons": "Change of this magnitude is not for the faint of heart. You have to be willing to put the time and effort in to being a part of a turnaround story. That story is being written every day - which I find to be exhilarating. This is not a 9-5 environment nor should anyone expect it to be. I would not want that type of role, I like to be engaged fully. The rewards are here for those willing to commit.", "advice": "We have a highly engaged CEO and Management Committee at this company which is very rare and truly appealing. All MC members are out in the business, with their people, solving business issues. Between that engagement and stock ownership at all levels, you really do feel like you are in a place where people are invested in the outcome. That can be lost at a company of this size, but not here."}, {"title": "I like it", "text": "Pros Work/Life balance is GREAT!!!! The benefits are okay. Cons None. I like it a lot.", "rating": 5, "pros": "Work/Life balance is GREAT!!!! The benefits are okay.", "cons": "None. I like it a lot.", "advice": null}, {"title": "Ever changing company", "text": "Pros Decent wages okay benefits and the ability to buy stock at reduced prices. Trying to become a community. Employee pricing on items. Cons More concerned about public image than their employee’s. IT department is slow takes 90 Days to get software that is needed. Would lay you off if it meant making more revenue, no commitment to experience. Advice to Management Listen to your employees and eliminate the gap between senior management and the employee base", "rating": 3, "pros": "Decent wages okay benefits and the ability to buy stock at reduced prices. Trying to become a community. Employee pricing on items.", "cons": "More concerned about public image than their employee’s.", "advice": "Listen to your employees and eliminate the gap between senior management and the employee base"}, {"title": "Business Intern", "text": "Pros Company culture was very positive especially since the new CEO was named. The company is heading in a much better direction than it was. Cons Locations of the call centers might not be in locations that are beneficial for job growth mainly Hagerstown location", "rating": 3, "pros": "Company culture was very positive especially since the new CEO was named.", "cons": "Locations of the call centers might not be in locations that are beneficial for job growth mainly Hagerstown location", "advice": null}, {"title": "Wells Fargo Merchant Services", "text": "Pros Good Pay scale,Team Spirit,allow room for growth. Cons Work till 9 PM;Quality control is non realistic. have to wait for one year in department before moving to another department. Management chooses when they want to enforce this rule.", "rating": 3, "pros": "Good Pay scale,Team Spirit,allow room for growth.", "cons": "Work till 9 PM;Quality control is non realistic. have to wait for one year in department before moving to another department. Management chooses when they want to enforce this rule.", "advice": null}, {"title": "Just a number", "text": "Pros First, there are some great people. Second, First Data has a lot of services, which require a lot of support. So, opportunity to learn a host of applications is there. Cons You really are just a number. It's corporate America! Advice to Management Learn some soft skills, learn how to develop your employees based on their strengths, if you can't recognize their personality types and where they excel you can't help them grow, personally or professionally.", "rating": 3, "pros": "First, there are some great people. Second, First Data has a lot of services, which require a lot of support. So, opportunity to learn a host of applications is there.", "cons": "You really are just a number. It's corporate America!", "advice": "Learn some soft skills, learn how to develop your employees based on their strengths, if you can't recognize their personality types and where they excel you can't help them grow, personally or professionally."}, {"title": "Clover technical specialist", "text": "Pros The compensation is good. May have the opportunity to take lead on different piliot programs Cons Not a very professional environment, very unstable company , with high turnover. Advice to Management Plan out business structure", "rating": 1, "pros": "The compensation is good. May have the opportunity to take lead on different piliot programs", "cons": "Not a very professional environment, very unstable company , with high turnover.", "advice": "Plan out business structure"}, {"title": "Technology", "text": "Pros Excellent management team; great employees with whom to work; highly competitive pay and benefits; superb and innovative industry Cons Pace of change is very fast and aggressive Advice to Management Continue to listen to the employees as they are a vast source of information and insight.", "rating": 5, "pros": "Excellent management team; great employees with whom to work; highly competitive pay and benefits; superb and innovative industry", "cons": "Pace of change is very fast and aggressive", "advice": "Continue to listen to the employees as they are a vast source of information and insight."}, {"title": "Working remote", "text": "Pros Great pay, good co workers Cons The turnaround for employees is significant , unable to work remote like most companies is a problem and it’s based on managers discretion! That for a lot of us is a big turnoff. Advice to Management Allow your employees to work remote, these are adults, maybe you won’t lose so many good people, because this problem with all this traffic is a big big issue.", "rating": 3, "pros": "Great pay, good co workers", "cons": "The turnaround for employees is significant , unable to work remote like most companies is a problem and it’s based on managers discretion! That for a lot of us is a big turnoff.", "advice": "Allow your employees to work remote, these are adults, maybe you won’t lose so many good people, because this problem with all this traffic is a big big issue."}, {"title": "Opportunity", "text": "Pros Strong female leadership Great growth opportunities if you work hard Ability to move from business unit to unit to learn more Great people! One of the most inclusive cultures I have ever experienced Cons Lack of a 401K though you do get stock", "rating": 5, "pros": "Strong female leadership", "cons": "Lack of a 401K though you do get stock", "advice": null}, {"title": "SVP", "text": "Pros First Data is neck-deep in what will be one of the greatest turn-around stories in American Business. With the KKR LBO at the apex of the market in...the split between FD and Chase (Paymentech).....and then a U.S. market that endured a complete housing market collapse. The Perfect Storm. All the trappings to throw in the towel abounded. And, most it could have been rationalized very, very easily. The revolving door on CEOs...until Frank B. He was the necessary force to create the change and belief in the greatness of First Data!! And now? Very much a technology company...driving innovation and flexibility! You will be part of history....the Harvard Business Review case is yet to be written! But it will Cons Working neck-deep in a turn-around entity is very hard work. Rewarding for sure....but you have to have serious intenstinal fortitude. Advice to Management Continue to lean in!~", "rating": 5, "pros": "First Data is neck-deep in what will be one of the greatest turn-around stories in American Business. With the KKR LBO at the apex of the market in...the split between FD and Chase (Paymentech).....and then a U.S. market that endured a complete housing market collapse. The Perfect Storm. All the trappings to throw in the towel abounded. And, most it could have been rationalized very, very easily. The revolving door on CEOs...until Frank B. He was the necessary force to create the change and belief in the greatness of First Data!! And now? Very much a technology company...driving innovation and flexibility! You will be part of history....the Harvard Business Review case is yet to be written! But it will", "cons": "Working neck-deep in a turn-around entity is very hard work. Rewarding for sure....but you have to have serious intenstinal fortitude.", "advice": "Continue to lean in!~"}, {"title": "DONT DO IT", "text": "Pros paid my bills over the years but that's about it. once they traded stock publicly this place went to hell. if you don't play exactly by their rules you are are never going to be worth anything to this place. even though they tell you think outside the box. HAHAHAHAHAHA whatever. Cons they are the kings at laying people off right before the holidays. so what's that tell you?? I rarely ever felt like a part of this place even though I was in demand to my customers. Advice to Management jump ship fast. this place is going to sink like the Titanic. all the labor they hire are dumb as rocks and then wonder why nothing gets done. stuff gets worse everyday and no one knows what's going on EVER except a slim few.", "rating": 1, "pros": "paid my bills over the years but that's about it.", "cons": "they are the kings at laying people off right before the holidays. so what's that tell you?? I rarely ever felt like a part of this place even though I was in demand to my customers.", "advice": "jump ship fast. this place is going to sink like the Titanic. all the labor they hire are dumb as rocks and then wonder why nothing gets done. stuff gets worse everyday and no one knows what's going on EVER except a slim few."}, {"title": "Great Enterprise Sales opportunities", "text": "Pros Results and client driven organization that is playing to win in the marketplace. Cons Need a passion to compete and win", "rating": 5, "pros": "Results and client driven organization that is playing to win in the marketplace.", "cons": "Need a passion to compete and win", "advice": null}, {"title": "First Data - a company in transition.", "text": "Pros Interesting challenges. Many opportunities to learn and grow. A global company and an industry leader, in the midst of a major transformation. Everything is in motion, and the right person can have significant impact on this transformation! Cons Parts of the company are very old school, command and control focused, slowing innovation. Many people have become too set in their ways and not open to new ideas: \"we do it this way, because this is the way we do it\" This is changing, SLOWLY. Workload is very high, and work/life balance suffers due to this. Advice to Management We have seen a large amount of needed turnover at the executive levels, but fostering a sustainable culture of innovation will require more new blood at the manager and individual contributor levels as well.", "rating": 3, "pros": "Interesting challenges.", "cons": "Parts of the company are very old school, command and control focused, slowing innovation.", "advice": "We have seen a large amount of needed turnover at the executive levels, but fostering a sustainable culture of innovation will require more new blood at the manager and individual contributor levels as well."}, {"title": "Manager", "text": "Pros There are none that I can think of except good job experience for future employment. Cons You will get job burnout. There is no balance between home and work life for management.", "rating": 3, "pros": "There are none that I can think of except good job experience for future employment.", "cons": "You will get job burnout. There is no balance between home and work life for management.", "advice": null}, {"title": "Genuine Concern", "text": "Pros Good benefits/pay. Everyone I worked with was very helpful and enjoyable. Cons Two weeks of training to brainwash you into having \"genuine concern\" for your clients. Yet you are not trained on pricing or how the service/equipment actually works. Meaning you cant provide customers that information. Its a load of garbage and both the company and its customers will suffer as a result... 14 new hires in my training class - 12 were no longer with First Data after one year. Advice to Management Train your sales people to understand the product and service so they can share this knowledge with customers - not a bunch of smoke and mirrors tactics to sell on \"value\".", "rating": 3, "pros": "Good benefits/pay. Everyone I worked with was very helpful and enjoyable.", "cons": "Two weeks of training to brainwash you into having \"genuine concern\" for your clients. Yet you are not trained on pricing or how the service/equipment actually works. Meaning you cant provide customers that information. Its a load of garbage and both the company and its customers will suffer as a result... 14 new hires in my training class - 12 were no longer with First Data after one year.", "advice": "Train your sales people to understand the product and service so they can share this knowledge with customers - not a bunch of smoke and mirrors tactics to sell on \"value\"."}, {"title": "Don't Recommend", "text": "Pros • Can't speak for others, but my position paid well. • Other than that, like in most corporations, you hope for the best when it comes to the people, specifically on your immediate team and your Supervisor. In my case, I had a fantastic Supervisor and great team. Cons • Employee growth and yearly raises are rare and minimal. • No 401k match and employee stocks are fairly useless since you have to be there at least three years and the stocks themselves are low and have been stagnant or declining. • Mediocre benefits for employees • Work/Life balance is questionable depending on your position • Little to no faith in upper management • High up leadership is really only concerned with stockholders and not truly focused on how they could effectively build the company correctly through intelligent means and incentivizing smart and loyal employees without having waves of layoffs in order to \"skinny the books\" temporarily and then try to hire them back or simply restructure new teams after they already had a good one in place. They're also basically a 'Good ole boys club' • Despite saying they are a tech company thats advanced and on the cutting edge, they are in reality behind the curve and basically look to their competitors like Square to get ideas on how to be relevant to no avail. • Clunky and seemingly unorganized • A lot of frantic 'check-the-box' and 'cover-yourself' mentality without thinking through the logic of the 'why, what, how, when' etc. • Due to the generally bad leadership throughout its lengthy history, there's been a steady decline in employee perks in order for the business to stay afloat and therefore there is low morale, zero culture, and their values are suspect when you don't see them reflected in actin within for the employees. • No official work from home options, which also reflects their lack of technological advancements and incentives for employees. Advice to Management • Need to drastically improve and articulate your messaging • Increase not only your employee support, but client customer service support • Start actually listening to your employees rather than the barking stockholders and your own personal life advancement • Treat your employees well and gain their respect in addition to having a smart and executable business plan and you'll have a good company.", "rating": 3, "pros": "• Can't speak for others, but my position paid well.", "cons": "• Employee growth and yearly raises are rare and minimal.", "advice": "• Need to drastically improve and articulate your messaging"}, {"title": "Unappreciated and underpaid", "text": "Pros The 401k was alright I guess Cons The management organization is difficult to understand. Zero tolerance policies meant that managers had no functional power anyway. Multi-year freeze on promotions and raises meant that the rate of pay I started at never changed, despite promises made at the time I signed on.", "rating": 3, "pros": "The 401k was alright I guess", "cons": "The management organization is difficult to understand. Zero tolerance policies meant that managers had no functional power anyway. Multi-year freeze on promotions and raises meant that the rate of pay I started at never changed, despite promises made at the time I signed on.", "advice": null}, {"title": "Contact Associate", "text": "Pros Environment, pay, cafeteria, friendly co-workers. Cons Healthcare, time off, strict on phone adherence, no room for advancement.", "rating": 5, "pros": "Environment, pay, cafeteria, friendly co-workers.", "cons": "Healthcare, time off, strict on phone adherence, no room for advancement.", "advice": null}, {"title": "Advice to young and mid-career professionals", "text": "Pros I struggle to come up with true pro's that come from association with FD. Lot's of fun coworkers - but there are nice people in a lot of places. Cons Look at the stock performance since going public. FD is not growing. Its competitors are growing. FD has no amazing new technology or service offering versus its peers and has already cut its operating cost to the bone – making it a hard place for employees to succeed. It needs to make very big investments as its infrastructure is old. Also Frank is a back office guy out of banking - he did what he knows - cut people etc. He's not the tech leader the payments industry needs. The future for FD is hard to predict. Here’s the impact on me (or you). I have been getting most of my annual bonus in stock that vests over three years (20%/40/40). When I quit (or they fire me) I lose that unvested stock. Even though the public price of the stock has been about the same for two years (ugh!) – it still represents about a year’s pay since so much of my annual bonus is in unvested stock. The company calls us “Owner Associates” but we really are “Handcuffed Associates” - especially as you get more senior in the organization. So be careful if you are looking for career growth – at FD I’m financially trapped in a company that makes it difficult if not impossible to succeed. Advice to Management Frank – maybe you can sell one or two of the company airplanes that you use exclusively and pass along the millions of annual savings to some of us Handcuffed Associates working hard and living check to check. BTW the CEO of GE got rid of company jet - try business class sometime and remember the lessons your Mom taught you - be frugal.", "rating": 1, "pros": "I struggle to come up with true pro's that come from association with FD. Lot's of fun coworkers - but there are nice people in a lot of places.", "cons": "Look at the stock performance since going public. FD is not growing. Its competitors are growing. FD has no amazing new technology or service offering versus its peers and has already cut its operating cost to the bone – making it a hard place for employees to succeed. It needs to make very big investments as its infrastructure is old. Also Frank is a back office guy out of banking - he did what he knows - cut people etc. He's not the tech leader the payments industry needs. The future for FD is hard to predict. Here’s the impact on me (or you). I have been getting most of my annual bonus in stock that vests over three years (20%/40/40). When I quit (or they fire me) I lose that unvested stock. Even though the public price of the stock has been about the same for two years (ugh!) – it still represents about a year’s pay since so much of my annual bonus is in unvested stock. The company calls us “Owner Associates” but we really are “Handcuffed Associates” - especially as you get more senior in the organization. So be careful if you are looking for career growth – at FD I’m financially trapped in a company that makes it difficult if not impossible to succeed.", "advice": "Frank – maybe you can sell one or two of the company airplanes that you use exclusively and pass along the millions of annual savings to some of us Handcuffed Associates working hard and living check to check. BTW the CEO of GE got rid of company jet - try business class sometime and remember the lessons your Mom taught you - be frugal."}, {"title": "Poised for the Future", "text": "Pros - Motivated-to-win senior leadership team - Large portfolio of solutions for clients - Large client base - Global reach - Everything we need to transform and dominant the industry Cons - Prior M&A hasn't been integrated so many \"spurs\" of technology and process that create friction to getting things done - Much of the \"legacy\" workforce is content and do not change and only think about the past, this really slows the pace down - Not enough empowerment of the leaders; more empowerment pushed down and then holding each individual accountable would be much better Advice to Management - Hold your leaders (EVP, SVP, VP, Directors, and Managers) individually accountable; if one/some aren't performing as expected do not make broad brushed decisions for all organizations across the company; narrow in on the ones causing issues or not advancing the firm, and remove them or at least do not pay their annual bonus. - We should compare (and then compete with) our comp & benefits to Fin Tech and other technology companies and not retail. Perhaps there is one portion of the employee population that retail is a more fair comparison to; but for the product & technology organizations is isn't equitable. - I would give much of the Senior Management 5-stars, however I rated 4-stars because of a few that drag the number down.", "rating": 5, "pros": "- Motivated-to-win senior leadership team", "cons": "- Prior M&A hasn't been integrated so many \"spurs\" of technology and process that create friction to getting things done", "advice": "- Hold your leaders (EVP, SVP, VP, Directors, and Managers) individually accountable; if one/some aren't performing as expected do not make broad brushed decisions for all organizations across the company; narrow in on the ones causing issues or not advancing the firm, and remove them or at least do not pay their annual bonus."}, {"title": "HR Director", "text": "Pros You will work hard, you will play hard, you will meet some great and caring people who not just care about business but how business is conducted with integrity and how valuable associates are to the organization. I’ve worked for Fortune 100-200 companies before and they all face daunting challenges to stay competitive and FD is no exception. You may not know through emoloyee contributions we have contributed several hundred thousand dollars from employees to our Associate Hardship Grant Fund to help emoloyees impacted by the recent hurricanes in North America. You may not know we had associates sit aside their personal lives and work on the ground in Houston and Florida sourcing basic needs up to buying food and generators to help our associates without hesitation. This is a caring company if you care about what you do. Cons It can be complicated to navigate but you MUST remain vigilant and not give up. Ask for what you want. I did and my three years have been very rewarding. Advice to Management Keep communications fluid top down and bottom up. Celebrate wins at all levels.", "rating": 5, "pros": "You will work hard, you will play hard, you will meet some great and caring people who not just care about business but how business is conducted with integrity and how valuable associates are to the organization. I’ve worked for Fortune 100-200 companies before and they all face daunting challenges to stay competitive and FD is no exception. You may not know through emoloyee contributions we have contributed several hundred thousand dollars from employees to our Associate Hardship Grant Fund to help emoloyees impacted by the recent hurricanes in North America. You may not know we had associates sit aside their personal lives and work on the ground in Houston and Florida sourcing basic needs up to buying food and generators to help our associates without hesitation. This is a caring company if you care about what you do.", "cons": "It can be complicated to navigate but you MUST remain vigilant and not give up. Ask for what you want. I did and my three years have been very rewarding.", "advice": "Keep communications fluid top down and bottom up. Celebrate wins at all levels."}, {"title": "First Data works hard to stay ahead of threats in security and cutting edge of payments industry.", "text": "Pros Strong core key resources and teams but lack strength across all employees. Challenging work environment working on large scale implications and for big name clients. Support military which is nice. Cons No cell phone unless VP or 24x7 support which is difficult when your job is not titled support full time but you support go lives for multiple projects. No 401k match which is hard to understand as stocks are nice but when don’t exercise for three plus years difficult to process. Long work days/weeks and little to no downtime for key employees. Advice to Management More transparency", "rating": 3, "pros": "Strong core key resources and teams but lack strength across all employees. Challenging work environment working on large scale implications and for big name clients. Support military which is nice.", "cons": "No cell phone unless VP or 24x7 support which is difficult when your job is not titled support full time but you support go lives for multiple projects. No 401k match which is hard to understand as stocks are nice but when don’t exercise for three plus years difficult to process. Long work days/weeks and little to no downtime for key employees.", "advice": "More transparency"}, {"title": "good place to end a career. not so great to grow one.", "text": "Pros decent enough place to work Cons definately not on the cutting-edge of technology. Advice to Management allow your IT staff to explore newer technology", "rating": 3, "pros": "decent enough place to work", "cons": "definately not on the cutting-edge of technology.", "advice": "allow your IT staff to explore newer technology"}, {"title": "long distance operator", "text": "Pros good overtime, allow for under time, good hours, good pay, rewarded for good attendance, good working, got to monthly circle of excellence, best employee of a month deal. excellent health insurance, spoke two languages, English and French, worked various jobs Cons had a few errors that I got to improve, different supervisor expectations, not much bad of it, except getting those small errors, including one of my working on calls from Haiti in France, which had me in error, once, and the supervisor monitoring the call was in a different state, as we had no French speaking operators in this location. The main con is we all got laid off in 2000. Advice to Management I am a quick learner and go beyond my expectations, once I get good training. I have also a certificate in Web design, if that furthers my qualifications.", "rating": 5, "pros": "good overtime, allow for under time, good hours, good pay, rewarded for good attendance, good working, got to monthly circle of excellence, best employee of a month deal. excellent health insurance, spoke two languages, English and French, worked various jobs", "cons": "had a few errors that I got to improve, different supervisor expectations, not much bad of it, except getting those small errors, including one of my working on calls from Haiti in France, which had me in error, once, and the supervisor monitoring the call was in a different state, as we had no French speaking operators in this location. The main con is we all got laid off in 2000.", "advice": "I am a quick learner and go beyond my expectations, once I get good training. I have also a certificate in Web design, if that furthers my qualifications."}, {"title": "An exciting time to be at First Data", "text": "Pros First Data is changing quickly and fast becoming a house hold name as a premier processor of financial transactions and technology leader. It is also leading the charge with exciting new ways that will positively effect how we live our daily lives. That's something to be very proud about and be a part of. The other pro is the level of support for employees from enhanced benefits to inclusion is incredible. Our slogan \"Everyone Works Here\" is not only true but far more supported than any other Fortune 500 company I have worked for. Lastly being part owner - or as we call it Owner Associate - gives you a feeling that that difference you make helps everyone directly in the firm. Best company I have ever worked for by far. Cons I have been with First Data for almost a year and it is a fast moving, fast paced company, personally I find that extremely exciting but if you were to look at working here that would have to be an expectation you are aware of up front. The standards are high, the goals are lofty and it takes a lot of hard work but in the end the gratification is well worth it - plus being an Owner Associate it's my company I am moving forward. And we are moving ahead quickly. Advice to Management You have made such progress in the past few years turning this company into a world leader. You've increased the value of our stock, grown the business and increased awareness of who we are. Because of this you have created so many new opportunities for us all - please don't stop!", "rating": 5, "pros": "First Data is changing quickly and fast becoming a house hold name as a premier processor of financial transactions and technology leader. It is also leading the charge with exciting new ways that will positively effect how we live our daily lives. That's something to be very proud about and be a part of. The other pro is the level of support for employees from enhanced benefits to inclusion is incredible. Our slogan \"Everyone Works Here\" is not only true but far more supported than any other Fortune 500 company I have worked for. Lastly being part owner - or as we call it Owner Associate - gives you a feeling that that difference you make helps everyone directly in the firm. Best company I have ever worked for by far.", "cons": "I have been with First Data for almost a year and it is a fast moving, fast paced company, personally I find that extremely exciting but if you were to look at working here that would have to be an expectation you are aware of up front. The standards are high, the goals are lofty and it takes a lot of hard work but in the end the gratification is well worth it - plus being an Owner Associate it's my company I am moving forward. And we are moving ahead quickly.", "advice": "You have made such progress in the past few years turning this company into a world leader. You've increased the value of our stock, grown the business and increased awareness of who we are. Because of this you have created so many new opportunities for us all - please don't stop!"}, {"title": "Transformation is hard work - but results are showing", "text": "Pros The combination of a tough and disciplined management team, combined with the deep payments industry knowledge of the legacy employees make First Data a great place to work, learn, and be at the forefront of the payments industry transformation. One thing that I've seen a significant improvement in in the last couple of years is the breaking down of silos and barriers, more cross-team collaboration, and more large-scale programs being run from the center, which has enhanced consistency and quality of execution. People at First Data, at all levels, care about what's right and what's right for the customer. Cons The management culture at First Data is pretty tough. We celebrate our successes, but there is a general sense that the company can't rest on its laurels, and that we all still have to work harder, smarter, more efficiently every day. It takes perspective to look back 6 months and realize what you and your team have achieved and savor those successes and management needs to encourage those look backs and acknowledge the progress on the journey. Advice to Management Continue to push hard on the transformation; focus on contextualizing the hard decisions we have to make to prosper as a company to OAs at the more junior levels.", "rating": 5, "pros": "The combination of a tough and disciplined management team, combined with the deep payments industry knowledge of the legacy employees make First Data a great place to work, learn, and be at the forefront of the payments industry transformation.", "cons": "The management culture at First Data is pretty tough. We celebrate our successes, but there is a general sense that the company can't rest on its laurels, and that we all still have to work harder, smarter, more efficiently every day. It takes perspective to look back 6 months and realize what you and your team have achieved and savor those successes and management needs to encourage those look backs and acknowledge the progress on the journey.", "advice": "Continue to push hard on the transformation; focus on contextualizing the hard decisions we have to make to prosper as a company to OAs at the more junior levels."}, {"title": "Great Place to work", "text": "Pros Great place to work competitive environment Cons benefits could be better for employees Advice to Management more communication", "rating": 5, "pros": "Great place to work competitive environment", "cons": "benefits could be better for employees", "advice": "more communication"}, {"title": "Random", "text": "Pros TBD later after careful thought Cons No work from home policy. Lack of employee bodies in departments. Keeps laying people off in departments, when the staff levels are already 3 to 10 people short, but excepting the same amount of work to be completed. Very unorganized, when it comes to enter department communications. Very unorganized, when it comes to effectiveness of accountability for money being wasted. Lacks effectiveness to keep knowledgable employees. Needs to understand where the world is today with technology, and where it is going. Does not grasp it is a technology company. The world has changed, and moving quickly. Advice to Management Trust lower managements decisions. A CEO is not a micro manager. He must trust the decisions of the people under him to do what is best. Make sure that management in their positions, understand their job area functionality within the company. Get a better grasp on how money is truly being wasted. Hire knowledgable people in their areas.", "rating": 3, "pros": "TBD later after careful thought", "cons": "No work from home policy.", "advice": "Trust lower managements decisions. A CEO is not a micro manager. He must trust the decisions of the people under him to do what is best."}, {"title": "First Data", "text": "Pros Exiting and growing industry - electronic payments. Plenty of smart people who want to do the right thing. Cons Shrinking workforce. Limited budget for new initiatives. Concentration on cost reduction rather than growth.", "rating": 3, "pros": "Exiting and growing industry - electronic payments. Plenty of smart people who want to do the right thing.", "cons": "Shrinking workforce. Limited budget for new initiatives. Concentration on cost reduction rather than growth.", "advice": null}, {"title": "Manager", "text": "Pros The people you work with Cons Management committee lack of concern for employees", "rating": 3, "pros": "The people you work with", "cons": "Management committee lack of concern for employees", "advice": null}, {"title": "Diversity of hire... First Data walking the walk", "text": "Pros As just one example of First Data's efforts to continue to build a diverse workforce, First Data was named #1 Employer for Veterans and Military Spouses by Military Times Magazine in 2017 Cons We continue to strive, like most companies focused on military affiliated hiring, to find the best route to help our recruiters and hiring managers to understand the value of the veteran. Our military and veterans affairs team travels to key First Data hiring locations to provide hiring manager training to present the importance of the military-affiliated candidate to First Data. The team shares with managers that the abilities forged, and experience gained while in the military or as a spouse of a service-member, exceeds the hiring manager's concern if or when a candidate lacks an exact job skill. Advice to Management We get better at this every day and are very fortunate to have a CEO, a management committee and nearly 25,000 owner associates ready and willing to do the right thing for our company and for those who served.", "rating": 5, "pros": "As just one example of First Data's efforts to continue to build a diverse workforce, First Data was named #1 Employer for Veterans and Military Spouses by Military Times Magazine in 2017", "cons": "We continue to strive, like most companies focused on military affiliated hiring, to find the best route to help our recruiters and hiring managers to understand the value of the veteran. Our military and veterans affairs team travels to key First Data hiring locations to provide hiring manager training to present the importance of the military-affiliated candidate to First Data. The team shares with managers that the abilities forged, and experience gained while in the military or as a spouse of a service-member, exceeds the hiring manager's concern if or when a candidate lacks an exact job skill.", "advice": "We get better at this every day and are very fortunate to have a CEO, a management committee and nearly 25,000 owner associates ready and willing to do the right thing for our company and for those who served."}, {"title": "First Data is on the move", "text": "Pros There is a culture of avoiding busy work or unnecessary processes and if you have an idea for improvement, you will likely be empowered to pursue it. Many smart people, and the overall culture is not as hierarchical and elitist relative to other financial companies (a bit like a tech company). Talent is rewarded. I greatly appreciate the diversity efforts -- from veterans to LGBT: diversity here really is diverse and it is deeply embedded in every aspect of the company. Cons Many areas were drastically cut back in the past, the company is reticent to add headcount, sometimes when it is needed, which ironically leads to inefficiency. Advice to Management I am new, but from what I can see the changes in the past couple of years are remarkable. There is tremendous energy in the air generated by recent successes. Ask me again in a year, but right now I am not going to second guess and just say more of the same. Just keep stoking the fire and enabling talented people to accomplish great things.", "rating": 5, "pros": "There is a culture of avoiding busy work or unnecessary processes and if you have an idea for improvement, you will likely be empowered to pursue it.", "cons": "Many areas were drastically cut back in the past, the company is reticent to add headcount, sometimes when it is needed, which ironically leads to inefficiency.", "advice": "I am new, but from what I can see the changes in the past couple of years are remarkable. There is tremendous energy in the air generated by recent successes. Ask me again in a year, but right now I am not going to second guess and just say more of the same. Just keep stoking the fire and enabling talented people to accomplish great things."}, {"title": "Company Review for First Data Corporation", "text": "Pros Industry leader with a strong client focus and considerable head room to grow in the markets served. Cons Not really a down side, but successful individuals will need to dedicate 50 plus hours a week in leadership positions to properly perform their duties. Advice to Management Continue to focus on revenue growth, improved customer experience and investments in the right technologies to enable our products.", "rating": 5, "pros": "Industry leader with a strong client focus and considerable head room to grow in the markets served.", "cons": "Not really a down side, but successful individuals will need to dedicate 50 plus hours a week in leadership positions to properly perform their duties.", "advice": "Continue to focus on revenue growth, improved customer experience and investments in the right technologies to enable our products."}, {"title": "Would not recommend", "text": "Pros Good pay Great benefits Very family friendly Cons Working in a specialized area after a year and a promotion, I was still treated like a child and even had chat with other coworker privileges taken away. Advice to Management Start trusting employees more.", "rating": 3, "pros": "Good pay", "cons": "Working in a specialized area after a year and a promotion, I was still treated like a child and even had chat with other coworker privileges taken away.", "advice": "Start trusting employees more."}, {"title": "Great first job", "text": "Pros The company is very structured and a lot of red tape so good place to work right out of college to gain knowledge in your career before moving on to something better. Cons First Data has a lot of debt due to a leveraged buyout years ago that hinders growth and capital investments. Insurance is okay and no matching 401k.", "rating": 3, "pros": "The company is very structured and a lot of red tape so good place to work right out of college to gain knowledge in your career before moving on to something better.", "cons": "First Data has a lot of debt due to a leveraged buyout years ago that hinders growth and capital investments. Insurance is okay and no matching 401k.", "advice": null}, {"title": "Moving in the right direction", "text": "Pros The company has a renewed focus to expand the business, innovate and invest in technology Cons No issues at this time Advice to Management Keep moving in the same direction", "rating": 5, "pros": "The company has a renewed focus to expand the business, innovate and invest in technology", "cons": "No issues at this time", "advice": "Keep moving in the same direction"}, {"title": "Senior Workforce Analyst", "text": "Pros Great work environment and Plenty of job growth. Goals are clearly outlined and achievable. Good benefits and competitive salaries. Cons No real con at this time. You must come in prepared to work. If you're not willing to work hard and aggressively Pursue achieving your goals management will realign accordingly.", "rating": 5, "pros": "Great work environment and Plenty of job growth. Goals are clearly outlined and achievable. Good benefits and competitive salaries.", "cons": "No real con at this time. You must come in prepared to work. If you're not willing to work hard and aggressively Pursue achieving your goals management will realign accordingly.", "advice": null}, {"title": "Good Opportunity with great people", "text": "Pros Great people, competitve salary and a good opportunity to be a part of a strong organization. Strong connection to community groups and commitment to social responsibility. Cons Corporations of this size can move slowly and carefully, which can be challenging.", "rating": 5, "pros": "Great people, competitve salary and a good opportunity to be a part of a strong organization. Strong connection to community groups and commitment to social responsibility.", "cons": "Corporations of this size can move slowly and carefully, which can be challenging.", "advice": null}, {"title": "Innovative, collaborative Company", "text": "Pros If you want to succeed at First Data, you have every opportunity to. Great company to begin your career or come in and grow. Exposure to senior management is high and if you are willing to work and have an idea, I have found that you will be supported all the way to senior leadership. Your career is what you make it at First Data, lots of opportunity. Cons It's a large company and isn't benign to the challenges that brings, although I would have to say that leadership is making changes all the time to pivot and correct any issues as they show through. The push of the One First Data shows the effort of trying to eliminate silos and give that we're all after the same goal, smaller company mentality.", "rating": 5, "pros": "If you want to succeed at First Data, you have every opportunity to. Great company to begin your career or come in and grow. Exposure to senior management is high and if you are willing to work and have an idea, I have found that you will be supported all the way to senior leadership. Your career is what you make it at First Data, lots of opportunity.", "cons": "It's a large company and isn't benign to the challenges that brings, although I would have to say that leadership is making changes all the time to pivot and correct any issues as they show through. The push of the One First Data shows the effort of trying to eliminate silos and give that we're all after the same goal, smaller company mentality.", "advice": null}, {"title": "First Data Review", "text": "Pros Leadership-consistent messaging People-Focus on diversity/talent Globality-Increased connectivity to footprint Clients-Strong client roster Cons MIS/information access and consistency Heavy internal process orientation-approval/legal Advice to Management Flatten organization Focus on execution and service excellence", "rating": 5, "pros": "Leadership-consistent messaging", "cons": "MIS/information access and consistency", "advice": "Flatten organization"}, {"title": "Not a bad place to work", "text": "Pros Interesting work environment from an opportunities perspective Cons Interesting work environment from a cultural perspective Advice to Management If people are the most important commodity, treat them as such.", "rating": 5, "pros": "Interesting work environment from an opportunities perspective", "cons": "Interesting work environment from a cultural perspective", "advice": "If people are the most important commodity, treat them as such."}, {"title": "Thought Leadership, Innovation, Learning, Collaboration", "text": "Pros First Data provides the opportunity to work with some of the best and brightest leaders in financial services and technology. You will work hard, and the rewards are plentiful. You will work in a fast-paced and dynamic environment, you will learn skills that you might not acquire elsewhere and you will have skin in the game as all of our employees are awarded equity in the company. You will also work in an environment that EMBRACES diversity - with some of the best benefits (gender neutral parental leave policy that offers 12 paid weeks for births, adoptions and foster care situations!!) and most progressive policies in the Fortune 250. It is not often that you can tell others that you've been a part of one of the greatest transformation stories in modern business - this is your opportunity!!!!! Cons It is a very big ship to turn and it's not going to transform overnight! Advice to Management Keep driving!!! We are making extraordinary progress!", "rating": 5, "pros": "First Data provides the opportunity to work with some of the best and brightest leaders in financial services and technology. You will work hard, and the rewards are plentiful. You will work in a fast-paced and dynamic environment, you will learn skills that you might not acquire elsewhere and you will have skin in the game as all of our employees are awarded equity in the company. You will also work in an environment that EMBRACES diversity - with some of the best benefits (gender neutral parental leave policy that offers 12 paid weeks for births, adoptions and foster care situations!!) and most progressive policies in the Fortune 250.", "cons": "It is a very big ship to turn and it's not going to transform overnight!", "advice": "Keep driving!!! We are making extraordinary progress!"}, {"title": "Engaged and moving.", "text": "Pros Fast paced growth means lots of change and in this case positive change. Engaged teams in open collaborative organizational structures provides support where needed and drives each individual to succeed. Opportunities to explore and grow are available to those willing to put in the effort to jump in and run. Cons Fast paced might not be a fit for some. Financial Technology Firms can be negatively effected by downturns in consumer spending. Advice to Management Keep the One First Data message cycling. Owner Associates title brings an empowerment to each employee to drive positive growth.", "rating": 5, "pros": "Fast paced growth means lots of change and in this case positive change. Engaged teams in open collaborative organizational structures provides support where needed and drives each individual to succeed. Opportunities to explore and grow are available to those willing to put in the effort to jump in and run.", "cons": "Fast paced might not be a fit for some. Financial Technology Firms can be negatively effected by downturns in consumer spending.", "advice": "Keep the One First Data message cycling. Owner Associates title brings an empowerment to each employee to drive positive growth."}, {"title": "Senior Tax Accountant", "text": "Pros Great work environment with a good group of knowledgeable people. Excellent quality of life Cons Below market wages, below market benefits. A portion of the bonus is paid out in stock that vests over a period of 3 years.", "rating": 3, "pros": "Great work environment with a good group of knowledgeable people. Excellent quality of life", "cons": "Below market wages, below market benefits. A portion of the bonus is paid out in stock that vests over a period of 3 years.", "advice": null}, {"title": "It’s a flexible company to work for; miscommunication happens everywhere right?", "text": "Pros Incentives. Paid time off. Accrued vacation. Resource groups. Schedule varieties. Internal recognition. Contests to keep morale flowing and employee discounts Cons Judgmental company. Promote those people who kiss up to management but their work doesn’t reflect they can handle the work load. Advice to Management Don’t allow preconceived notions limit your agents true ability!", "rating": 3, "pros": "Incentives. Paid time off. Accrued vacation. Resource groups. Schedule varieties. Internal recognition. Contests to keep morale flowing and employee discounts", "cons": "Judgmental company. Promote those people who kiss up to management but their work doesn’t reflect they can handle the work load.", "advice": "Don’t allow preconceived notions limit your agents true ability!"}, {"title": "Great Growth Prospects", "text": "Pros The firm is a trusted partner to financial institutions, businesses and governments, with global presence providing a broad set of solutions. Its financial condition is solid, allowing for continued investment to support growth in new markets and new capabilities for clients. Colleagues in the firm are deeply experienced in payment processing, and focus on winning as a team. Cons The focus on quarterly results can make it more difficult to plan long term. Advice to Management Continue to have a lot of direct client interaction in order to clarify development needs, continue to support team performance as a cultural value.", "rating": 5, "pros": "The firm is a trusted partner to financial institutions, businesses and governments, with global presence providing a broad set of solutions. Its financial condition is solid, allowing for continued investment to support growth in new markets and new capabilities for clients. Colleagues in the firm are deeply experienced in payment processing, and focus on winning as a team.", "cons": "The focus on quarterly results can make it more difficult to plan long term.", "advice": "Continue to have a lot of direct client interaction in order to clarify development needs, continue to support team performance as a cultural value."}, {"title": "Horrible experience", "text": "Pros nothing that I can think of Cons Everything please stay away from this company", "rating": 1, "pros": "nothing that I can think of", "cons": "Everything please stay away from this company", "advice": null}, {"title": "Worthwhile career starter in sales.", "text": "Pros Internal sales training, frequent sales incentives above the commission, and (some) lead generation. Cons The typical stuff - fight to get the sale, the fight to get paid correctly (and on time) for the sale. Advice to Management N/A", "rating": 3, "pros": "Internal sales training, frequent sales incentives above the commission, and (some) lead generation.", "cons": "The typical stuff - fight to get the sale, the fight to get paid correctly (and on time) for the sale.", "advice": "N/A"}, {"title": "Engineering manager", "text": "Pros New challenges daily with dealing with aging facilities Cons High attrition, lack of goods organizational structure Advice to Management Assign 1 person to be the data center manager and allow that Peron onsite to run the data center", "rating": 3, "pros": "New challenges daily with dealing with aging facilities", "cons": "High attrition, lack of goods organizational structure", "advice": "Assign 1 person to be the data center manager and allow that Peron onsite to run the data center"}, {"title": "production support", "text": "Pros there are a lot of good people dedicated to producing outstanding work within a frenetic environment. Cons bad work/life balance for most full time employees. pay is below industry standard. raises (if any) do not keep up with standard of living. excessive turnover. Advice to Management you cannot have a go forward strategy implemented by a rotating carousel of contractors and management. Too much knowledge and experience is being pushed out the door... to the benefit of your competitors -- like Square.", "rating": 3, "pros": "there are a lot of good people dedicated to producing outstanding work within a frenetic environment.", "cons": "bad work/life balance for most full time employees.", "advice": "you cannot have a go forward strategy implemented by a rotating carousel of contractors and management. Too much knowledge and experience is being pushed out the door... to the benefit of your competitors -- like Square."}, {"title": "Output Services", "text": "Pros You won't need a gym membership if you do anything warehouse related. Cons Corporate makes decisions based on stock prices and not the employees. Advice to Management Take care of your workhorses better.", "rating": 3, "pros": "You won't need a gym membership if you do anything warehouse related.", "cons": "Corporate makes decisions based on stock prices and not the employees.", "advice": "Take care of your workhorses better."}, {"title": "Find another employer", "text": "Pros Slightly higher than average pay Cons Health insurance sucks, 401 no match, Management lack of focus and communication, no back-fill for attrition, attrition greater than hiring pace. Advice to Management Manage your people better, worry less about the stock holders.", "rating": 3, "pros": "Slightly higher than average pay", "cons": "Health insurance sucks, 401 no match, Management lack of focus and communication, no back-fill for attrition, attrition greater than hiring pace.", "advice": "Manage your people better, worry less about the stock holders."}, {"title": "Buyer", "text": "Pros Some decent people who want to do the right thing. Unfortunately not enough to make a difference. Not many positive things to add. Cons Very poor use of oracle, manual MRP planning. Management is horrid run on a whim and a prayer. Need a team of leaders who listen. Advice to Management Get your act together on the distribution side of the house", "rating": 3, "pros": "Some decent people who want to do the right thing. Unfortunately not enough to make a difference. Not many positive things to add.", "cons": "Very poor use of oracle, manual MRP planning. Management is horrid run on a whim and a prayer. Need a team of leaders who listen.", "advice": "Get your act together on the distribution side of the house"}, {"title": "Inside Sales", "text": "Pros Competitive work environment at very sales and quota driven Cons Poor training not realistic sink or swim environment Advice to Management Learn to train individuals to win at doing their very best", "rating": 3, "pros": "Competitive work environment at very sales and quota driven", "cons": "Poor training not realistic sink or swim environment", "advice": "Learn to train individuals to win at doing their very best"}, {"title": "Dynamic, challenging and fun", "text": "Pros The FDC people, and recent rate of success and growth for FDC has been inspiring and I see a tremendous amount of future growth and innovation, similar to what we've seen the last 4+ years. Cons The financial services industry is extremely competitive and to be successful, and a leader in the industry, you have to be able to be very nimble, innovative, and have a can do attitude, and the fast pace and urgency to deliver for our customers can be challenging and stressful for those not fully committed.", "rating": 5, "pros": "The FDC people, and recent rate of success and growth for FDC has been inspiring and I see a tremendous amount of future growth and innovation, similar to what we've seen the last 4+ years.", "cons": "The financial services industry is extremely competitive and to be successful, and a leader in the industry, you have to be able to be very nimble, innovative, and have a can do attitude, and the fast pace and urgency to deliver for our customers can be challenging and stressful for those not fully committed.", "advice": null}, {"title": "Titles not raises", "text": "Pros Its a paycheck. And some of the people. Cons Huge employee atrittion with no backfilling. Having to work a year in new position with no raise or real training. Advice to Management Treat employees as if they are valued, as valued employees stay. Committed staff who are not doing the work of 2 can raise the stock price. Not less workers for more work less training less staff", "rating": 3, "pros": "Its a paycheck. And some of the people.", "cons": "Huge employee atrittion with no backfilling. Having to work a year in new position with no raise or real training.", "advice": "Treat employees as if they are valued, as valued employees stay. Committed staff who are not doing the work of 2 can raise the stock price. Not less workers for more work less training less staff"}, {"title": "IT", "text": "Pros Busy shop, credit card business is always busy Cons Dysfunctional, processes are more important than the processing. Low benefits. Untrustworthy upper management.", "rating": 3, "pros": "Busy shop, credit card business is always busy", "cons": "Dysfunctional, processes are more important than the processing. Low benefits. Untrustworthy upper management.", "advice": null}, {"title": "A different company to work for", "text": "Pros The people are amazing. This is what makes this a great place to work. Cons Lack of communication and ever-shifting priorities make it hard to complete anything. While changing directions can be expected, it is on a whole different level here.", "rating": 5, "pros": "The people are amazing. This is what makes this a great place to work.", "cons": "Lack of communication and ever-shifting priorities make it hard to complete anything. While changing directions can be expected, it is on a whole different level here.", "advice": null}, {"title": "customer service", "text": "Pros the have a lot of benefits and essentials. Cons management is very unprofessional and you have to stay on there good side.", "rating": 5, "pros": "the have a lot of benefits and essentials.", "cons": "management is very unprofessional and you have to stay on there good side.", "advice": null}, {"title": "They DO care about employees", "text": "Pros I have worked at First Data for almost 8 years. I have heard many complaints that it is just a large corporation that doesn't care about their employees. That myth was overwhelmingly proved false to me this week. While traveling on business, I had a minor car accident. I let my immediate director know, just so she would be informed. I soon heard from HR, our SVP, and even the CCO of the company to make sure I was ok and ask if I needed anything. It says a lot that even those at the top care about us \"little guys\". Cons Of course there are always cons to every job, but this review is about how much they care about employees.", "rating": 5, "pros": "I have worked at First Data for almost 8 years. I have heard many complaints that it is just a large corporation that doesn't care about their employees. That myth was overwhelmingly proved false to me this week. While traveling on business, I had a minor car accident. I let my immediate director know, just so she would be informed. I soon heard from HR, our SVP, and even the CCO of the company to make sure I was ok and ask if I needed anything. It says a lot that even those at the top care about us \"little guys\".", "cons": "Of course there are always cons to every job, but this review is about how much they care about employees.", "advice": null}, {"title": "Worst Company Ever", "text": "Pros A few good people in pockets around the company. Cons One of the most unethical, unrewarding, toxic environments I've ever worked in. The mass immigration of JPMC leadership made it worse. One of the worst, most insulting layoffs I've ever seen (I wasn't part of it). Rampant nepotism. In short, just stay away, unless you've got a friend in leadership who can line your pockets with tons of cash while laying off 40% of the workforce so you can IPO and make more cash. The benefits are dismal for anyone starting new (Only option is an HSA designed for high income folks to shelter cash). Advice to Management Just shutter the doors. Or maybe try not to be horrible people for a change.", "rating": 1, "pros": "A few good people in pockets around the company.", "cons": "One of the most unethical, unrewarding, toxic environments I've ever worked in. The mass immigration of JPMC leadership made it worse. One of the worst, most insulting layoffs I've ever seen (I wasn't part of it). Rampant nepotism.", "advice": "Just shutter the doors. Or maybe try not to be horrible people for a change."}, {"title": "first data review", "text": "Pros I enjoy working at first data Cons first data can be very unorganized as a company overall", "rating": 5, "pros": "I enjoy working at first data", "cons": "first data can be very unorganized as a company overall", "advice": null}, {"title": "Still a good place to work", "text": "Pros Great people, challenging and interesting work Cons Downsizing and layoffs, health insurance", "rating": 5, "pros": "Great people, challenging and interesting work", "cons": "Downsizing and layoffs, health insurance", "advice": null}, {"title": "First Data is a place we you can really make an impact through innovation", "text": "Pros Diversity and Inclusion are at the forefront of this company. We drive Innovation at all level that engage our employees and help our clients. YOu get to work with great people Cons I don't see any cons about working here. It's the opportunity of a lifetime to work with a fantastic CEO who is a proven leader and can bring forth innovation Advice to Management Keep transforming the company", "rating": 5, "pros": "Diversity and Inclusion are at the forefront of this company. We drive Innovation at all level that engage our employees and help our clients. YOu get to work with great people", "cons": "I don't see any cons about working here. It's the opportunity of a lifetime to work with a fantastic CEO who is a proven leader and can bring forth innovation", "advice": "Keep transforming the company"}, {"title": "Cog in the wheel", "text": "Pros Company appears to have stabilized a bit in recent months Cons Company has no soul or personality. Each day felt like a cog in a wheel- like a hamster running in circles. Corporate strategy and marketing were very weak. Advice to Management Benefits are very weak in comparison to competitors. Build a culture and a team that employees can be proud of.", "rating": 3, "pros": "Company appears to have stabilized a bit in recent months", "cons": "Company has no soul or personality. Each day felt like a cog in a wheel- like a hamster running in circles. Corporate strategy and marketing were very weak.", "advice": "Benefits are very weak in comparison to competitors. Build a culture and a team that employees can be proud of."}, {"title": "Meh", "text": "Pros My position was allowed flex time. Cons Made every one feel disposable. Advice to Management Take more interest in developing talent.", "rating": 3, "pros": "My position was allowed flex time.", "cons": "Made every one feel disposable.", "advice": "Take more interest in developing talent."}, {"title": "Great Place to work and build a career", "text": "Pros There are no limits as to how far you can go or grow at First Data. The only limits, are the ones you place on your self. Cons Learning the complexities and different types of payments can be challenging at the beginning.", "rating": 5, "pros": "There are no limits as to how far you can go or grow at First Data. The only limits, are the ones you place on your self.", "cons": "Learning the complexities and different types of payments can be challenging at the beginning.", "advice": null}, {"title": "IT Director", "text": "Pros Many locations to work from. Global company Cons Continual layoffs throughout my entire career.", "rating": 3, "pros": "Many locations to work from. Global company", "cons": "Continual layoffs throughout my entire career.", "advice": null}, {"title": "First Data Experience", "text": "Pros Steady Pay Check Consistent Pay Cons Low Pay (Compared to industry standards), Poor career advancement support, Poor training structure, poor work environment, no employee satisfaction survey or initiative Advice to Management Correct the following - Low Pay (Compared to industry standards), Poor career advancement support, Poor training structure, poor work environment, no employee satisfaction survey or initiative", "rating": 3, "pros": "Steady Pay Check Consistent Pay", "cons": "Low Pay (Compared to industry standards), Poor career advancement support, Poor training structure, poor work environment, no employee satisfaction survey or initiative", "advice": "Correct the following - Low Pay (Compared to industry standards), Poor career advancement support, Poor training structure, poor work environment, no employee satisfaction survey or initiative"}, {"title": "Company is Making Real Strides to Transform", "text": "Pros Payments industry is in transition and First Data is delivering innovative solutions to ensure it's long term success You will work with lots of very talented and committed people Cons Still need to shake off some of the legacy thinking that has held the company back in the past Advice to Management Technology and Architecture are key so continue to invest in these areas", "rating": 5, "pros": "Payments industry is in transition and First Data is delivering innovative solutions to ensure it's long term success", "cons": "Still need to shake off some of the legacy thinking that has held the company back in the past", "advice": "Technology and Architecture are key so continue to invest in these areas"}, {"title": "Work harder and expect to be paid nothing.", "text": "Pros Lot of experience in many areas inside and outside of the job scope Cons Extremely overworked, under appreciated and under paid. People get let go or quit and instead of replacing anyone, the work gets thrown at people in various areas with the expectation it gets done with the same efficiency. Normal work needs to be completed as well as if nothing changed. Promotions come with extreme expectations and no additional compensation. Compensation is reviewed yearly even if you're promoted mid year. I could go on... Advice to Management Pay employees market rates and hire sufficient staff. The current path is short term gain, long term failure.", "rating": 1, "pros": "Lot of experience in many areas inside and outside of the job scope", "cons": "Extremely overworked, under appreciated and under paid. People get let go or quit and instead of replacing anyone, the work gets thrown at people in various areas with the expectation it gets done with the same efficiency. Normal work needs to be completed as well as if nothing changed. Promotions come with extreme expectations and no additional compensation. Compensation is reviewed yearly even if you're promoted mid year. I could go on...", "advice": "Pay employees market rates and hire sufficient staff. The current path is short term gain, long term failure."}, {"title": "If you want a CEO that only cares about himself, this is the place for you.", "text": "Pros People in the office I was at were nice, caring people. Cons The CEO only cares about himself, his image, his ego, and making more money than anyone in the entire world is worth. In 2016 hourly employees, who are at the bottom of the payscale, were not given a cash bonus. Instead they were given points that could be used to buy gift cards and various merchandise - maybe worth $200. But Frank got tens of millions of dollars. If he was given less, which would still be more than enough to live comfortably, all the hourly people could be given raises and not have to worry about paying their bills or covering an emergency. Advice to Management Treat employees with the respect they deserve. People do not like being treated as if they don't matter. Where would the company be without all the little people doing the day to day work - nowhere.", "rating": 1, "pros": "People in the office I was at were nice, caring people.", "cons": "The CEO only cares about himself, his image, his ego, and making more money than anyone in the entire world is worth.", "advice": "Treat employees with the respect they deserve. People do not like being treated as if they don't matter. Where would the company be without all the little people doing the day to day work - nowhere."}, {"title": "Business consultant", "text": "Pros Great pay Good benefits Flexible schedule Cons No leadership Zero support Didn't see a manger for 9 months I have 4 different managers in my 1.5 years there Advice to Management There needs to be a much better support line for questions. Don't take 3 days to get back to my question that was time sensitive There is such a high turnover ratio with management", "rating": 1, "pros": "Great pay", "cons": "No leadership", "advice": "There needs to be a much better support line for questions."}, {"title": "Good company, getting better", "text": "Pros Great industry, improving business, aggressive management team focused on the right initiatives Cons It's hard to tell these days, but benefits are probably sub-par Advice to Management Stay aggressive; treat your loyal employees very well", "rating": 5, "pros": "Great industry, improving business, aggressive management team focused on the right initiatives", "cons": "It's hard to tell these days, but benefits are probably sub-par", "advice": "Stay aggressive; treat your loyal employees very well"}, {"title": "Miss the First Data prior culture", "text": "Pros Unmatched in product offerings and global reach Cons Executive management- boys club and like to manage by fear and intimidation - no regard for truly setting up owner associates to succeed Advice to Management Many suggestions but not wasting time to list as they simply aren’t interested unless you agree and play “yes man”", "rating": 1, "pros": "Unmatched in product offerings and global reach", "cons": "Executive management- boys club and like to manage by fear and intimidation - no regard for truly setting up owner associates to succeed", "advice": "Many suggestions but not wasting time to list as they simply aren’t interested unless you agree and play “yes man”"}, {"title": "Let's be real - Objective review from prior employee above the Director level", "text": "Pros People with knowledge of the business 'within the ranks', who care about what they do and the success of the business. Pay is above average at some levels, particularly in the VP and above roles. Hard to lose money in this business, as First Data is in the middle of a lot of commerce! A few very intelligent, but introverted EVPs -- the President is very intelligent, but they don't openly rally the employees themselves. Going back to an acquisition growth strategy has worked in the past, it's about time they've gone back to what works, even if it's not an innovative strategy. You will find many great people, who will become long time friends, and essentially family -- mostly in the Omaha, Hagerstown, Denver, Atlanta, and UK areas. Cons While pay is good to great in some roles, the benefits are below average. Bonuses shrink every year, as they'll generally fund <90% of the bonus pool, and that then becomes the new target for the following years -- slowly reducing overall variable compensation year over year for 85% of the employees. There are exceptions, as some top performers do get 100% or more of their bonus, but there's a limited quota of these ratings. An old school 'get rid of the bottom 10% each year' philosophy is in play. It's not manage up or manage out -- it's just manage out. The severance policy has also been severely cut over the years, but they still want you to leave on your own to avoid that expense. There are a lot of community programs that are in place, more for the optics (LGBT, Veterans, Millennials, etc), but anyone and everyone is just a warm body - no real desire or effort to keep employees who fit in these groups. If you are in one of these groups, expect to be exploited to the fullest capacity to the company's benefit, not yours. Had a LGBT friend who kept to himself but was essentially forced to be open in the company as gay, internally on the employee website. He has since left. No one would dare to go against Executive Management's will, for fear of their job. If you are a legacy First Data person, hired 3+ years ago, you are considered to be what the 'problem' with the company is. You are considered to be three levels below that of the intelligence that a NYC employee can bring. From what I observed, they may be somewhat intelligent in a narrow subject, but lack the broad experience and vision that many of the legacy leadership had. Unfortunately, they pushed out a lot of the top talent, specifically the 'get things done' talent at all levels that the clients adored compared to the competitors, and now the MO is to BS their way through why things aren't getting improved from the prior year. Lots of busy work, little in the way of true improvements from prior years. Slowly chugging away, but always getting further behind due to their 'budgets remain flat or cut' mantra. 'Leadership' is lacking, as its more just highly paid management rolling down duties of what 'leaders' should do. There is no desire by many of the executive management to be accountable or look inwardly. If some of them read the book \"Extreme Ownership\", they would disagree with the authors. If you are interested in a role there, and not in the Jersey City or NY office, ask when the last time the top executive leader paid a visit to that location. It will be similar for the SVP level as well. It is important to note that companies can pay for special access to Glassdoor, and influence what is being put here. First Data is one that pays for that access. You'll see spurts of great reviews, sometimes under their real titles, and sometimes not -- all to adjust the 'positivity' that this company truly lacks with this Executive Management group that ousted the last. Not all Executive leadership is bad, some have great hearts, some don't care. What is hilarious is when there was a large focus on what was being posted on Glass Door, as well as internal surveys, when folks criticized 'Senior Management', it was interpreted by the Executive leadership (SVPs and EVPs) as the VP level that was the problem, not them themselves. I assure you that it was not the VP or Director level that was being criticized. With this latest Executive Leadership team, it's been, or coming on, 3 years of limited growth. Many SVPs make more than the previous EVPs before their reign, but yet their programs are much smaller than what the previous regime had. They are finally going back to what First Data did for growth -- acquisitions. So much for being better than the previous regimes who relied on this same growth strategy. This is a great company, despite the tactics used to squeeze as much money out for the Executive Leadership as they can. It shouldn't be a surprise, as it happens at a lot of NYC based firms -- just disappointing a great midwest founded company with great midwest folks got sucked up and bled dry by the NY banking industry. It will be great again, when they realize the costs to have a Jersey City and NYC base of operations is cost prohibitive, and this regime moves on to the next company to get rich from. Advice to Management I personally know that advice to Management is disregarded, especially from what they would say is by a supposed disgruntled ex-employee. For the sake of all my friends and family still there, please 'demonstrate' that you actually care about them. At one time, the employee was seen as the #1 asset. Bring that back, and you'll see more commitment and productivity from the 'legacy' folks you quickly dismiss.", "rating": 3, "pros": "People with knowledge of the business 'within the ranks', who care about what they do and the success of the business. Pay is above average at some levels, particularly in the VP and above roles. Hard to lose money in this business, as First Data is in the middle of a lot of commerce! A few very intelligent, but introverted EVPs -- the President is very intelligent, but they don't openly rally the employees themselves. Going back to an acquisition growth strategy has worked in the past, it's about time they've gone back to what works, even if it's not an innovative strategy.", "cons": "While pay is good to great in some roles, the benefits are below average. Bonuses shrink every year, as they'll generally fund <90% of the bonus pool, and that then becomes the new target for the following years -- slowly reducing overall variable compensation year over year for 85% of the employees. There are exceptions, as some top performers do get 100% or more of their bonus, but there's a limited quota of these ratings. An old school 'get rid of the bottom 10% each year' philosophy is in play. It's not manage up or manage out -- it's just manage out. The severance policy has also been severely cut over the years, but they still want you to leave on your own to avoid that expense.", "advice": "I personally know that advice to Management is disregarded, especially from what they would say is by a supposed disgruntled ex-employee. For the sake of all my friends and family still there, please 'demonstrate' that you actually care about them. At one time, the employee was seen as the #1 asset. Bring that back, and you'll see more commitment and productivity from the 'legacy' folks you quickly dismiss."}, {"title": "Former employee", "text": "Pros Very challenging environment. Loyal and talented people to work with. Cons Executive landscape has changed the past several years and the current administration no longer values talent, loyalty and longevity as an asset. All 401k retirement matching was taken away a few years ago.", "rating": 3, "pros": "Very challenging environment. Loyal and talented people to work with.", "cons": "Executive landscape has changed the past several years and the current administration no longer values talent, loyalty and longevity as an asset. All 401k retirement matching was taken away a few years ago.", "advice": null}, {"title": "Do Not Plan a Career", "text": "Pros Benefits, decent pay, within living distance. Cons Lack of Training, outsourcing of jobs, stressful. Advice to Management Please create a training curriculum for what you want your employees to know, and assign designated trainers to teach what needs to be learned.", "rating": 3, "pros": "Benefits, decent pay, within living distance.", "cons": "Lack of Training, outsourcing of jobs, stressful.", "advice": "Please create a training curriculum for what you want your employees to know, and assign designated trainers to teach what needs to be learned."}, {"title": "High Turnover, Broken Company Culture", "text": "Pros Salary in my role was competitive. Cons Before you accept a role, ask about the turnover in the group. Some roles have EXTREMELY high turnover directly related to company culture. No flexibility. Unfriendly - boss/higher ups walk by without a smile or friendly greeting. Very rigid, micro managing, unproductive environment. Unhappy employees in every group I interact with. For the most part, we have to bring our own supplies. If you get promoted, you have to wait until year end to get a raise (not retroactive). Advice to Management Your reputation in the employment market place in trash. When I accepted my job, several people issued words of caution. I should have listened. I knew on Day 1 that I had made a HUGE mistake.", "rating": 1, "pros": "Salary in my role was competitive.", "cons": "Before you accept a role, ask about the turnover in the group. Some roles have EXTREMELY high turnover directly related to company culture. No flexibility. Unfriendly - boss/higher ups walk by without a smile or friendly greeting. Very rigid, micro managing, unproductive environment. Unhappy employees in every group I interact with. For the most part, we have to bring our own supplies. If you get promoted, you have to wait until year end to get a raise (not retroactive).", "advice": "Your reputation in the employment market place in trash. When I accepted my job, several people issued words of caution. I should have listened. I knew on Day 1 that I had made a HUGE mistake."}, {"title": "Not worth the headache or stress", "text": "Pros Good co-workers. Good benefits Good training on product Cons Favouritism. No challenges No room for growth base on actual talent", "rating": 3, "pros": "Good co-workers.", "cons": "Favouritism.", "advice": null}, {"title": "HQ", "text": "Pros I worked with a good team Cons A lot of disarray when the company went public.", "rating": 5, "pros": "I worked with a good team", "cons": "A lot of disarray when the company went public.", "advice": null}, {"title": "Stay Away Unless You are Desperate", "text": "Pros There is noting positive to say about this company. Worked in their Dispute Operations department. Had plenty of management but there was no leadership. Director was promoted to position not based on ability. No communication unless you were friends with upper management. Management was very disrespectful to their employees. Positions were eliminated with very little notice to their employees. The department was numbers driven and not quality driven. Continued to bring on clients but couldn’t service the existing ones. The training department was a joke. Not sure if the whole company is ran like this department. As far was the company, they have taken away every possible benefit they once offered. No 401k. Holidays taken away. Increased insurance premiums. Seems as if the CEO is attempting to run the place into the ground. Cons I dont know where to start. Advice to Management Appreciate your employees who are the ones making your overly ridiculous salaries. Also, most employees don't appreciate the notifications about what company you have purchased or merged with when you are paying them what you are. You need to invest some of that money back into the company for employee retention and better equipment.", "rating": 1, "pros": "There is noting positive to say about this company. Worked in their Dispute Operations department. Had plenty of management but there was no leadership. Director was promoted to position not based on ability. No communication unless you were friends with upper management. Management was very disrespectful to their employees. Positions were eliminated with very little notice to their employees. The department was numbers driven and not quality driven. Continued to bring on clients but couldn’t service the existing ones. The training department was a joke. Not sure if the whole company is ran like this department. As far was the company, they have taken away every possible benefit they once offered. No 401k. Holidays taken away. Increased insurance premiums. Seems as if the CEO is attempting to run the place into the ground.", "cons": "I dont know where to start.", "advice": "Appreciate your employees who are the ones making your overly ridiculous salaries. Also, most employees don't appreciate the notifications about what company you have purchased or merged with when you are paying them what you are. You need to invest some of that money back into the company for employee retention and better equipment."}, {"title": "Merchant Services", "text": "Pros Flexible Schedule Great Management Team Reimbursement for expenses Continuous Training Lots of Online Resources Cons None at this time Advice to Management Help reduce wait time for Tech Support", "rating": 5, "pros": "Flexible Schedule", "cons": "None at this time", "advice": "Help reduce wait time for Tech Support"}, {"title": "Senior Application Developer", "text": "Pros They are willing to take a risk on new employees. They also give stock in the company as incentive. Cons They tend to overwork their employees. Most of the people in my department worked a minimum 55 hours a week. My title was not attributed properly. I was a designer not a developer. I was hired into a new position and they used an existing title with the same job responsibilities. Also as a designer, you are not allowed to use your work there for your portfolio, as it is all proprietary. Advice to Management Allow your designers to use their work for their portfolio. Hire more people and train them to lighten the workload. Train the people in the office to understand the workflow of a creative.", "rating": 3, "pros": "They are willing to take a risk on new employees. They also give stock in the company as incentive.", "cons": "They tend to overwork their employees. Most of the people in my department worked a minimum 55 hours a week. My title was not attributed properly. I was a designer not a developer. I was hired into a new position and they used an existing title with the same job responsibilities. Also as a designer, you are not allowed to use your work there for your portfolio, as it is all proprietary.", "advice": "Allow your designers to use their work for their portfolio."}, {"title": "Site Closure", "text": "Pros The staff I worked with Cons None at this time site closure", "rating": 3, "pros": "The staff I worked with", "cons": "None at this time site closure", "advice": null}]