[{"title": "Not somewhere I would recommend", "text": "Pros There is a post office half a mile away. Cons Management have little care for needs of anyone. They are completely stuck in their ways and unwilling to provide any sort of support. They force you to take their own direction for the business but have no data to support their business direction. They are literally moving blindly at an incredibly slow pace. There are two large competitors who are moving into this industry very soon with lots of money so I anticipate they will go bust within 6 months. Advice to Management Use data. Data is your friend. When you make decisions blindly, it is very difficult for your employees to follow them. Also, speak to your employees, rather than hiding in a corner and never speaking to anyone (as the founder did almost every day). He never joined in on Friday drinks, never really bothered about anyone in the team. Management seems to enjoy swapping roles often and will decide to start doing another teams job for them for a couple of weeks and then will job-hop on a regular basis. Since management has no idea of the sales process and no experience in sales at all, he has achieved next to nothing over the past 6 months since the company started. Yet expects that a new hire is to bring in new business instantly. He completely neglects the fact that he doesnt know his target market yet and as a result any salesperson is forced to work on leads that are not relevant at all. The first 2.5 months, I have never felt more wasted as an employee. Then finally during the last half month, I was given control over the bigger clients and it went amazingly well and meetings started coming out of everywhere. New clients were on the books and many more were coming on due to this change in focus. However, the founder doesn't even look at my calendar which is full of meetings and doesn't even look at the opportunities and nearly closed deals, and just lets me go.", "rating": 1, "pros": "There is a post office half a mile away.", "cons": "Management have little care for needs of anyone. They are completely stuck in their ways and unwilling to provide any sort of support. They force you to take their own direction for the business but have no data to support their business direction. They are literally moving blindly at an incredibly slow pace. There are two large competitors who are moving into this industry very soon with lots of money so I anticipate they will go bust within 6 months.", "advice": "Use data. Data is your friend. When you make decisions blindly, it is very difficult for your employees to follow them. Also, speak to your employees, rather than hiding in a corner and never speaking to anyone (as the founder did almost every day). He never joined in on Friday drinks, never really bothered about anyone in the team. Management seems to enjoy swapping roles often and will decide to start doing another teams job for them for a couple of weeks and then will job-hop on a regular basis. Since management has no idea of the sales process and no experience in sales at all, he has achieved next to nothing over the past 6 months since the company started. Yet expects that a new hire is to bring in new business instantly. He completely neglects the fact that he doesnt know his target market yet and as a result any salesperson is forced to work on leads that are not relevant at all. The first 2.5 months, I have never felt more wasted as an employee. Then finally during the last half month, I was given control over the bigger clients and it went amazingly well and meetings started coming out of everywhere. New clients were on the books and many more were coming on due to this change in focus. However, the founder doesn't even look at my calendar which is full of meetings and doesn't even look at the opportunities and nearly closed deals, and just lets me go."}]