[{"title": "F+P New York Office Review", "text": "Pros At the time decent opportunity as a growing satellite office. Much more responsibility than colleagues in the main London office. Small office culture, big office clout. Cons NY management at the time was not great, but heard it has gotten better in recent years. The office is not completely independent. Still must answer to London. Long hours, but as expected in the industry.", "rating": 5, "pros": "At the time decent opportunity as a growing satellite office. Much more responsibility than colleagues in the main London office. Small office culture, big office clout.", "cons": "NY management at the time was not great, but heard it has gotten better in recent years. The office is not completely independent. Still must answer to London. Long hours, but as expected in the industry.", "advice": null}, {"title": "Great project with mediocre benefits and salary", "text": "Pros Exciting project! The best benefit of the company is 25 days paid vacation since it is a British firm. Surrounded by very talented colleagues. Cons Maybe because this is a site office, the office operates with lots of Hierarchies. Workload can sometimes be unbearing, meaning countless hours without getting paid.", "rating": 3, "pros": "Exciting project!", "cons": "Maybe because this is a site office, the office operates with lots of Hierarchies. Workload can sometimes be unbearing, meaning countless hours without getting paid.", "advice": null}, {"title": "Very tough place to work - sets you up well for next job though", "text": "Pros Great projects, great city to be exposed to. High profile clients, designers and consultants. Beautiful office space to work in. You can get any job after this, and can get into any grad school you want. Cons Extreme hours, horrible work environment, people tend to be mean spirited and beaten down due to workload and hours. Very little mobility within the office, very hierarchical, Norman Foster is god. Once you are in the door, very difficult to get pay raises, you have to threaten leaving. You can't choose projects you are working on, even if you have experience on said project. Partners tend to be very egotistical and will expect/make you work extremely late nights (1am-4am) and weekends. Worked there for a number of years, probably only had 10-15 weekends to myself", "rating": 3, "pros": "Great projects, great city to be exposed to. High profile clients, designers and consultants. Beautiful office space to work in. You can get any job after this, and can get into any grad school you want.", "cons": "Extreme hours, horrible work environment, people tend to be mean spirited and beaten down due to workload and hours. Very little mobility within the office, very hierarchical, Norman Foster is god. Once you are in the door, very difficult to get pay raises, you have to threaten leaving. You can't choose projects you are working on, even if you have experience on said project. Partners tend to be very egotistical and will expect/make you work extremely late nights (1am-4am) and weekends. Worked there for a number of years, probably only had 10-15 weekends to myself", "advice": null}, {"title": "_", "text": "Pros Working on big scale project with very compeitive people. Cons very long hours, no work life balance", "rating": 3, "pros": "Working on big scale project with very compeitive people.", "cons": "very long hours, no work life balance", "advice": null}, {"title": "foster and parttners work experience", "text": "Pros Very good to make high end architecture experience and grow as senior architect. High quality, highest standard of design Cons work life balance is quite low", "rating": 3, "pros": "Very good to make high end architecture experience and grow as senior architect. High quality, highest standard of design", "cons": "work life balance is quite low", "advice": null}, {"title": "Good Practice, Hard Working", "text": "Pros Best Architecture practice in London and probably in the world. Good benefits and ease for everything, they are flexible with your personal situation. Decent Salary Cons Quite a few nights overtime but I guess that is the price you pay for being a part of one of the best companies in the sector. Advice to Management With better project management we would have way less nights in office", "rating": 3, "pros": "Best Architecture practice in London and probably in the world.", "cons": "Quite a few nights overtime but I guess that is the price you pay for being a part of one of the best companies in the sector.", "advice": "With better project management we would have way less nights in office"}, {"title": "Architectural assistant Part II", "text": "Pros You get to work one of the most creative and brilliant minds in the industry. The design process followed in the office is awesome and they try to maintain a good design philosophy across all projects in the office. The breakout spaces and the main office are really awesome. The food in the canteen is good. The support facilities available at your disposable are state of the art and the office really tries to be at the forefront of pushing technology aswell. Cons Getting there can be a bit tricky as it is not well conencted. Advice to Management -", "rating": 5, "pros": "You get to work one of the most creative and brilliant minds in the industry.", "cons": "Getting there can be a bit tricky as it is not well conencted.", "advice": "-"}, {"title": "Great!", "text": "Pros Fantastic team and inspiring projects. Lots to get involved in and the learning support is amazing. Cons location - a bit of a walk from the overground station Advice to Management help people with the logistics", "rating": 5, "pros": "Fantastic team and inspiring projects. Lots to get involved in and the learning support is amazing.", "cons": "location - a bit of a walk from the overground station", "advice": "help people with the logistics"}, {"title": "Prestigious Company, great place to work and grow", "text": "Pros -Plenty of opportunities to grow and develop, -Prestigious Company to work for - Exciting Projects Cons Work Life/Balance could be improved", "rating": 5, "pros": "-Plenty of opportunities to grow and develop,", "cons": "Work Life/Balance could be improved", "advice": null}, {"title": "Great People and Great Opportunity", "text": "Pros Great application of everything i have learnt at university Great people, I enjoy the diversity at Fosters and Partners Cons It would be good to support people more with Technology Advice to Management Improve technology department at Foster and Partners", "rating": 5, "pros": "Great application of everything i have learnt at university", "cons": "It would be good to support people more with Technology", "advice": "Improve technology department at Foster and Partners"}, {"title": "Worst company I have ever worked", "text": "Pros Nothing really. The only point could be close to the park Cons Super bad organisation. Managers won't bother to waste your time to be there after 6:00. Long hours to do useless job. Senior management team is not diverted at all. They are treated junior people as shut, we are working as slaves. I know some people are redundant due to attendance, if you are not healthy enough to working there everyday and don't sick for any day of the year, then you will be redundant. Old fashion factory style Really looking forward to see this company disappearing in the architecture market. Advice to Management You'd better have management. Nothing comments now as you don't have any", "rating": 1, "pros": "Nothing really. The only point could be close to the park", "cons": "Super bad organisation. Managers won't bother to waste your time to be there after 6:00. Long hours to do useless job.", "advice": "You'd better have management. Nothing comments now as you don't have any"}, {"title": "Over rated", "text": "Pros Canteen and Battersea Park is adjacent Cons Pay was terrible and big variances below and above partner level. 100 staff made redundant May 2017 and given same day to pack up and leave which was brutal. Senior level all male with no diversity. Lowest staff pay and highest client fees in industry.", "rating": 1, "pros": "Canteen and Battersea Park is adjacent", "cons": "Pay was terrible and big variances below and above partner level. 100 staff made redundant May 2017 and given same day to pack up and leave which was brutal. Senior level all male with no diversity. Lowest staff pay and highest client fees in industry.", "advice": null}, {"title": "OK to start with, if not for long term", "text": "Pros Good company name to have on CV, big company with many new people to meet, multicultural office Cons Long hours, early morning and late night meetings are all in a day's work, inconvenient office location, there is no opportunities to progress for project managers with little to no room for advancement, all senior positions are predominantly held by men, the pay is too low. Advice to Management Salary increment is needed. Pay rate for a project manager is similar to secretarial salary.", "rating": 3, "pros": "Good company name to have on CV, big company with many new people to meet, multicultural office", "cons": "Long hours, early morning and late night meetings are all in a day's work, inconvenient office location, there is no opportunities to progress for project managers with little to no room for advancement, all senior positions are predominantly held by men, the pay is too low.", "advice": "Salary increment is needed. Pay rate for a project manager is similar to secretarial salary."}, {"title": "Could be good....", "text": "Pros Prestigious company in the architectural field, will open your eyes to some amazing work and designs. Looks good on your CV to other architectural/design companies. Opportunities to work on International Assignments if you are at a certain level in the business. Cons A lot of senior management are full of their own self importance. They can't be bothered or don't want to take interest in anyone below Associate Partner level. The only focus at this company seems to be money rather than employee satisfaction and engagement. When visiting the HR department with personal problem you cant help but feel as soon as you leave the office everyone is talking about you and your concerns. Advice to Management Take more interest /invest in your young staff members, if they don't leave soon they will be carrying the company into the future. Work on the company culture and employee engagement and I would imagine less money will have to spent on recruiting the high amount of leavers there seems to be every month if people would prefer to stay?", "rating": 3, "pros": "Prestigious company in the architectural field, will open your eyes to some amazing work and designs.", "cons": "A lot of senior management are full of their own self importance. They can't be bothered or don't want to take interest in anyone below Associate Partner level.", "advice": "Take more interest /invest in your young staff members, if they don't leave soon they will be carrying the company into the future. Work on the company culture and employee engagement and I would imagine less money will have to spent on recruiting the high amount of leavers there seems to be every month if people would prefer to stay?"}, {"title": "Fanastic Office, Terrible HR", "text": "Pros Brilliant Project Work Worldwide Opportunities Nice office Cons Pay is not great Hours are extremely long IT is atrocious and run by gorillas HR is effectively redundant if you have any problems Advice to Management Stop wasting money on IT which doesn't work Tell HR they should be backing staff, not just the board of directors.", "rating": 3, "pros": "Brilliant Project Work", "cons": "Pay is not great", "advice": "Stop wasting money on IT which doesn't work"}, {"title": "Concept design engineer", "text": "Pros Interesting and challenging projects all over the world working together with architects in the design since the early stages. Cons Engineering teams work only on a few projects among all the projects that the company does and mainly in the early stages of the project.", "rating": 3, "pros": "Interesting and challenging projects all over the world working together with architects in the design since the early stages.", "cons": "Engineering teams work only on a few projects among all the projects that the company does and mainly in the early stages of the project.", "advice": null}, {"title": "Intern", "text": "Pros Friendly work environment with colleagues Cons Work and Life balance, well, not much balance Advice to Management Make use of the human resource more efficient, keep work more systematic and tidy. Don't waste their time at work unnecessarily.", "rating": 3, "pros": "Friendly work environment with colleagues", "cons": "Work and Life balance, well, not much balance", "advice": "Make use of the human resource more efficient, keep work more systematic and tidy. Don't waste their time at work unnecessarily."}, {"title": "Its OK.", "text": "Pros Interesting International projects, proximity to park, green space Cons Hierarchy, Hours, Some senior staff think they are Gods.", "rating": 3, "pros": "Interesting International projects, proximity to park, green space", "cons": "Hierarchy, Hours, Some senior staff think they are Gods.", "advice": null}, {"title": "Culture of bullying", "text": "Pros The company is involved in high profile projects around the world Cons Key members of staff (Partners and Senior Partners) are allowed to bully staff without any repercussions. Due to the 'name' of the company, staff are exploited and expected to work much longer hours than they are contracted for, pay is also relatively low. Management lacks diversity and is predominantly white male. Many experienced female staff end up leaving the company due to lack of promotion and/or lack of support by the company regarding family/outside commitments. Advice to Management Bullying should be called out and addressed by HR. To move with the times, management culture should to be more inclusive.", "rating": 3, "pros": "The company is involved in high profile projects around the world", "cons": "Key members of staff (Partners and Senior Partners) are allowed to bully staff without any repercussions. Due to the 'name' of the company, staff are exploited and expected to work much longer hours than they are contracted for, pay is also relatively low. Management lacks diversity and is predominantly white male. Many experienced female staff end up leaving the company due to lack of promotion and/or lack of support by the company regarding family/outside commitments.", "advice": "Bullying should be called out and addressed by HR. To move with the times, management culture should to be more inclusive."}, {"title": "Excellent experience for a young architect", "text": "Pros Great people and a diverse team -- at the lower level positions anyway. Interesting range of projects. Cons Hugely bureaucratic and difficult to bring any kind of individual creativity to the 'group-think' lead design process. Advice to Management Younger generations of architects value their individual contributions and the management systems and hierarchies should reflect this.", "rating": 5, "pros": "Great people and a diverse team -- at the lower level positions anyway. Interesting range of projects.", "cons": "Hugely bureaucratic and difficult to bring any kind of individual creativity to the 'group-think' lead design process.", "advice": "Younger generations of architects value their individual contributions and the management systems and hierarchies should reflect this."}, {"title": "Review", "text": "Pros - Sociable company - lots of events - great teams Cons - hardly any benefits - Difficult to move around departments", "rating": 3, "pros": "- Sociable company - lots of events", "cons": "- hardly any benefits", "advice": null}, {"title": "Good company overall", "text": "Pros People are amazing, great opportunities to improve and to develop your skills. Cons Sometimes a bit hierarchical, need to find the way to make your ideas become real.", "rating": 5, "pros": "People are amazing, great opportunities to improve and to develop your skills.", "cons": "Sometimes a bit hierarchical, need to find the way to make your ideas become real.", "advice": null}, {"title": "Great place to learn", "text": "Pros Very interesting projects, it looks really good in the CV and it is a great opportunity for Junior architects to learn Cons Incredibly long hours, very difficult to influence any design if you are not a Senior. The environment is quite tense Advice to Management Life-work balance!", "rating": 3, "pros": "Very interesting projects, it looks really good in the CV and it is a great opportunity for Junior architects to learn", "cons": "Incredibly long hours, very difficult to influence any design if you are not a Senior. The environment is quite tense", "advice": "Life-work balance!"}, {"title": "Associate", "text": "Pros Diversity, Clients, Stability, Respect in the industry Cons Low payment Non performance based bonus system", "rating": 3, "pros": "Diversity, Clients, Stability, Respect in the industry", "cons": "Low payment", "advice": null}, {"title": "Excellent exposure to large projects, great team and diversity", "text": "Pros The people there are excellent, hard working interesting . Budget doesn't factor into design work too much. You are at the forefront of tech advances, Cons Extremely late nights/early mornings in the run up to a deadline, low pay, low bonus structure despite being on reputable projects Advice to Management Share the wealth!", "rating": 5, "pros": "The people there are excellent, hard working interesting . Budget doesn't factor into design work too much. You are at the forefront of tech advances,", "cons": "Extremely late nights/early mornings in the run up to a deadline, low pay, low bonus structure despite being on reputable projects", "advice": "Share the wealth!"}, {"title": "Architect", "text": "Pros Internationally renowned projects Very good company if you are planning to be there for a short period of time Salary is reasonable Cons Working hours is extremely long due bad management No work life balance and location of the office is quite isolated Staff focus on political games instead of architecture Advice to Management Please pay attention to the welfare of the employees", "rating": 3, "pros": "Internationally renowned projects", "cons": "Working hours is extremely long due bad management", "advice": "Please pay attention to the welfare of the employees"}, {"title": "Senior Interior Designer", "text": "Pros Great Company, great enviroment, great projects Cons No cons, grweat company again", "rating": 5, "pros": "Great Company, great enviroment, great projects", "cons": "No cons, grweat company again", "advice": null}, {"title": "Good first job opportunity", "text": "Pros Generous salary Subsidised canteen and cashless payment system sociable teams and frequent social events Cons Completely patriarchal company limited opportunity or scope for progression location on the river is scenic, but it is difficult to get to by tube", "rating": 3, "pros": "Generous salary", "cons": "Completely patriarchal company", "advice": null}, {"title": "Architect", "text": "Pros Be able to work on very big and cool projects all over the world Cons Super hierarchy structured, traditional class level based culture. Good for short period of time in terms of experiences.", "rating": 3, "pros": "Be able to work on very big and cool projects all over the world", "cons": "Super hierarchy structured, traditional class level based culture. Good for short period of time in terms of experiences.", "advice": null}, {"title": "Central Services", "text": "Pros A great working environment, in a very supportive team. My ambition has been appreciated and I have been encouraged by the learning and development opportunities in place Cons The location of Foster + Partners is the only downside", "rating": 5, "pros": "A great working environment, in a very supportive team. My ambition has been appreciated and I have been encouraged by the learning and development opportunities in place", "cons": "The location of Foster + Partners is the only downside", "advice": null}, {"title": "Experience after 1 year", "text": "Pros Fast-paced and interesting work environment with great opportunities for development. Cons Less social out of hours than some other workplaces in London, possibly due to location.", "rating": 5, "pros": "Fast-paced and interesting work environment with great opportunities for development.", "cons": "Less social out of hours than some other workplaces in London, possibly due to location.", "advice": null}, {"title": "Good place to be", "text": "Pros Good atmosphere, friendly colourful people, travel opportunities, not too much pressure if you are not an architect, good overtime rate, good location Cons This is a very good place for an architect who can develop very good skills and can have a good career path trough the company but if you work in the support services your progression is limited...", "rating": 5, "pros": "Good atmosphere, friendly colourful people, travel opportunities, not too much pressure if you are not an architect, good overtime rate, good location", "cons": "This is a very good place for an architect who can develop very good skills and can have a good career path trough the company but if you work in the support services your progression is limited...", "advice": null}, {"title": "Inspiring workplace", "text": "Pros Inspiring workplace and projects International opportunities Fun environment Cons Deadline driven environment can be challenging", "rating": 5, "pros": "Inspiring workplace and projects", "cons": "Deadline driven environment can be challenging", "advice": null}, {"title": "CAD technician", "text": "Pros Free training on specific programmes, relatively laid back atmosphere, annual bonuses and pay rises albeit amount fluxuating Cons Not paid for overtime, bad time management throughout the office, heirachy in place which has no place in this day Advice to Management Treat your staff like actual people who have lives outside of work, learn to be more efficient on a whole", "rating": 3, "pros": "Free training on specific programmes, relatively laid back atmosphere, annual bonuses and pay rises albeit amount fluxuating", "cons": "Not paid for overtime, bad time management throughout the office, heirachy in place which has no place in this day", "advice": "Treat your staff like actual people who have lives outside of work, learn to be more efficient on a whole"}, {"title": "architect position", "text": "Pros great collegues, interesting projects, good facilities Cons some team requires you to work day/night/weekend non-stop, resources are poorly managed, no chances you have a personal life. Advice to Management Employees are not just numbers, it would be better to take care of them rather than let them go.", "rating": 3, "pros": "great collegues, interesting projects, good facilities", "cons": "some team requires you to work day/night/weekend non-stop, resources are poorly managed, no chances you have a personal life.", "advice": "Employees are not just numbers, it would be better to take care of them rather than let them go."}, {"title": "Employee", "text": "Pros Diverse culture and inspirational environment Cons Bullying environment, no career progression and extremely clique", "rating": 3, "pros": "Diverse culture and inspirational environment", "cons": "Bullying environment, no career progression and extremely clique", "advice": null}, {"title": "Great Company", "text": "Pros Foster + Partners is great experience. Working along the best architectural specialists in England. Cons Hard work. More than 11 hours/a day 24/7", "rating": 5, "pros": "Foster + Partners is great experience. Working along the best architectural specialists in England.", "cons": "Hard work.", "advice": null}, {"title": "Structural Engineer", "text": "Pros Great projects to work on Very talented team of very bright people Amazing offices and resources Cons Structural team too small to take on big projects, left to do mostly concept stage design", "rating": 5, "pros": "Great projects to work on", "cons": "Structural team too small to take on big projects, left to do mostly concept stage design", "advice": null}, {"title": "Great Place to Work", "text": "Pros Small close knit team of people that are easy to get on with. Open to change. Swift decision making. Good Management Great Canteen Cons Not the best location to get to and be in Very demanding customer base Long basic hours Advice to Management Think about flexible working and working from home.", "rating": 5, "pros": "Small close knit team of people that are easy to get on with.", "cons": "Not the best location to get to and be in", "advice": "Think about flexible working and working from home."}, {"title": "Good place to start. Stay if you're great", "text": "Pros Great projects and some good innovations. Mix of cultures and a relatively ok work life balance. Cons Internal competition stifles creativity. There are too many politics to altogether avoid, and it always gets in way of the work. As an architect I wish my peers would have interests beyond the subject matter, it would make for a more diverse set of ideas, and values. Advice to Management There should be a requirement for Partners to undergo management courses. There are elements of Mastery and Autonomy rewarded to employees, but there is a general lack of Purpose", "rating": 3, "pros": "Great projects and some good innovations. Mix of cultures and a relatively ok work life balance.", "cons": "Internal competition stifles creativity. There are too many politics to altogether avoid, and it always gets in way of the work. As an architect I wish my peers would have interests beyond the subject matter, it would make for a more diverse set of ideas, and values.", "advice": "There should be a requirement for Partners to undergo management courses. There are elements of Mastery and Autonomy rewarded to employees, but there is a general lack of Purpose"}, {"title": "Amazing projects but stubborn management", "text": "Pros The projects we work on are some of the best out there. Fosters treats it's employees with a lot of benefits such as cheap food, a space to relax, and nice staff parties. Also the people on a whole are lovely and very passionate but... Cons ...a lot of the management have grown too comfortable in their roles therefore becoming stagnant in skills and make it harder for anyone to rise up through the ranks. Lack of knowledge leads to lack of respect and foster and partners can be so much more with a bit more respect. Advice to Management Keep your skills up to industry standard or move on and allow some more deserving people to take your place. Foster and Partners can be so much better than it currently is.", "rating": 3, "pros": "The projects we work on are some of the best out there. Fosters treats it's employees with a lot of benefits such as cheap food, a space to relax, and nice staff parties. Also the people on a whole are lovely and very passionate but...", "cons": "...a lot of the management have grown too comfortable in their roles therefore becoming stagnant in skills and make it harder for anyone to rise up through the ranks. Lack of knowledge leads to lack of respect and foster and partners can be so much more with a bit more respect.", "advice": "Keep your skills up to industry standard or move on and allow some more deserving people to take your place. Foster and Partners can be so much better than it currently is."}, {"title": "Excellent organisation", "text": "Pros Working for the most innovative architectural deisgn practice in the world Good opportunity for career progression Diverse / international workforce with global opportunities Great onsite facilities Cons Location - lovely spot by the river but can be tricky to get to", "rating": 5, "pros": "Working for the most innovative architectural deisgn practice in the world", "cons": "Location - lovely spot by the river but can be tricky to get to", "advice": null}, {"title": "Senior 3d Artist", "text": "Pros Good opportunity for career progression. Worked for some of the greatest projects available worldwide. Cons Salaries for the architectural visual artists are probably the lowest you can find in London. Work life balance is not where it needs to be, leaving the office almost every evening around 11-12pm and sometimes around 3-4am and be back in office at 9 I think it is quite insane and unhealthy.", "rating": 1, "pros": "Good opportunity for career progression.", "cons": "Salaries for the architectural visual artists are probably the lowest you can find in London.", "advice": null}, {"title": "Fantastic Office - Inspirational Workplace", "text": "Pros Team work and collaboration across the business. Brilliant projects and great opportunities. Cons Work life balance is not where it needs to be Advice to Management Consider how people work and balance out their professional and personal life", "rating": 5, "pros": "Team work and collaboration across the business. Brilliant projects and great opportunities.", "cons": "Work life balance is not where it needs to be", "advice": "Consider how people work and balance out their professional and personal life"}, {"title": "Interesting place but no innovation, no progression, rotating door employment policy", "text": "Pros Good to have on the CV Cons Pay well below industry standard No work life balance Company is happy to see people leave after a year rather than give them any reason to stay", "rating": 3, "pros": "Good to have on the CV", "cons": "Pay well below industry standard", "advice": null}, {"title": "Rewards loyalty", "text": "Pros - Great projects - Great visibility - Talented staff; in particular, listening to some of the partners and senior partners provides a wealth of inspiration and learning. - Subsidised food - Good facilities (nice office furniture, cool new cafeteria, and good quality staff showers) - Management tend to be quite flexible (e.g. taking half days to wait for delivery or go to doctor's with no questions asked). This does vary depending on your manager and is just fair given the long working hours. - Pretty good career opportunities in the engineering teams as they are still quite young. Cons - They won't necessarily get rid of the less talented staff. It is a huge machine so less efficient staff still end up producing something, which could have been done with fewer more productive people. - Some promotions seem to be given only based on loyalty (i.e. number of years spent, not achievements), or to keep people who threaten to leave. - Huge turnover around the 2 year mark - Generally life gets better the longer you stay at the company, as you get to know the politics better and befriend some of the catering staff. - Long hours are pretty standard. On the other hand, dedication is recognised if not rewarded with hard cash or benefits. Also better balance in the engineering team. - Absence of good project management in general - Minimal benefits Advice to Management Staff retention is terrible, and might be partially related with the illogical promotions policy. Focussing on efficiency, rather than production of 50 different options for the sake of giving work to the lower grade staff, might also give people a better sense of purpose. Improving project management would help too.", "rating": 5, "pros": "- Great projects", "cons": "- They won't necessarily get rid of the less talented staff. It is a huge machine so less efficient staff still end up producing something, which could have been done with fewer more productive people.", "advice": "Staff retention is terrible, and might be partially related with the illogical promotions policy."}, {"title": "Architect", "text": "Pros Name of the company - fantastic projects - great people Cons Long hours - hundreds of options - no clear guidance", "rating": 5, "pros": "Name of the company - fantastic projects - great people", "cons": "Long hours - hundreds of options - no clear guidance", "advice": null}, {"title": "Must experience for any architect.", "text": "Pros Great opportunities if you work hard and put in the hours. Projects around the world working with some of the best consultants and largest contractors. Focus on quality and timeless design. Cons Office in an area not very well connected to the rest of the city. If you don't like to push yourself it's not going to be for you.", "rating": 5, "pros": "Great opportunities if you work hard and put in the hours. Projects around the world working with some of the best consultants and largest contractors. Focus on quality and timeless design.", "cons": "Office in an area not very well connected to the rest of the city. If you don't like to push yourself it's not going to be for you.", "advice": null}, {"title": "workplace consultancy", "text": "Pros the people, many really bright and nice people and the possible opportunities you might have access to Cons It is still very man orientated, hierarchical, not very modernized in terms of new ways to think architecture", "rating": 3, "pros": "the people, many really bright and nice people and the possible opportunities you might have access to", "cons": "It is still very man orientated, hierarchical, not very modernized in terms of new ways to think architecture", "advice": null}, {"title": "Inspirational Place to work", "text": "Pros Great team with lots of fantastic projects all over the world. Amazing studios with some truly talented people. Fantastic on-site, highly subsidised canteen, lots of training as well as great massage and reflexology sessions! Cons Location of the office - no tube station nearby but the view of the Thames is amazing. Long working hours Advice to Management curb the working hours", "rating": 5, "pros": "Great team with lots of fantastic projects all over the world. Amazing studios with some truly talented people. Fantastic on-site, highly subsidised canteen, lots of training as well as great massage and reflexology sessions!", "cons": "Location of the office - no tube station nearby but the view of the Thames is amazing. Long working hours", "advice": "curb the working hours"}, {"title": "Worth the experience", "text": "Pros Working at this office offers a unique experience designing some of the biggest projects in the world. You get to meet all sort of people from various nationalities, backgrounds. Cons A very unbalanced work / life scenario with extended periods of pressure to perform and submit work which eventually is neglected. Feels like and is run like a university campus. Advice to Management Listen to your employees", "rating": 5, "pros": "Working at this office offers a unique experience designing some of the biggest projects in the world. You get to meet all sort of people from various nationalities, backgrounds.", "cons": "A very unbalanced work / life scenario with extended periods of pressure to perform and submit work which eventually is neglected.", "advice": "Listen to your employees"}, {"title": "Not worth the sacrifice", "text": "Pros Get to work in re known projects, looks good in your CV if searching for another offices and opportunities. If you are lucky enough you can find nice and organized teams which will allow you to have a better experience. Cons Very long hours policy and lack of consciousness how unhealthy this can be for the employees. In some teams if you leave on time you get less responsibility and get even ignored despite of doing a good job during working hours. This way of working which is generally the company ideology and policy can make develop in the employees mental health problems after few months. It is also very political and a clear pyramidal system. Very inefficient and shameless. Advice to Management Show a bit of respect for your employees and pay their extra hours if you are not efficient enough to give people tasks which can be finished during working hours. Having someone asking for work at 9am and start giving them work at 5pm is not efficient.", "rating": 1, "pros": "Get to work in re known projects, looks good in your CV if searching for another offices and opportunities.", "cons": "Very long hours policy and lack of consciousness how unhealthy this can be for the employees.", "advice": "Show a bit of respect for your employees and pay their extra hours if you are not efficient enough to give people tasks which can be finished during working hours."}, {"title": "An experience worth the sacrifice", "text": "Pros Best architecture practice of the world, you get to know super talented people and amazing projects worldwide. Definitely in very few offices you will get a similar experience. Cons Salary is lower than average and you have to be fully commited to your job to progress in the company. It´s a Game of Thrones kind of experience. Advice to Management Check if you have the right profile in their careers website, and if you think you can make it then go for it, it doesn´t matter if you are part I or student, you will have an amazing experience in the best practice of the world", "rating": 5, "pros": "Best architecture practice of the world, you get to know super talented people and amazing projects worldwide. Definitely in very few offices you will get a similar experience.", "cons": "Salary is lower than average and you have to be fully commited to your job to progress in the company. It´s a Game of Thrones kind of experience.", "advice": "Check if you have the right profile in their careers website, and if you think you can make it then go for it, it doesn´t matter if you are part I or student, you will have an amazing experience in the best practice of the world"}, {"title": "Good for beginners", "text": "Pros Great projects Interesting and passionate people Good facilities Cons Too much architectural work. Not enough structural design Advice to Management Focus more on self-development of employees and giving them more responsibilities", "rating": 5, "pros": "Great projects", "cons": "Too much architectural work. Not enough structural design", "advice": "Focus more on self-development of employees and giving them more responsibilities"}, {"title": "Great Potential ..... but ....", "text": "Pros World Class practice, interesting and varied client base, some very lovely talented staff. Nice name to have on your CV, although probably only if your field is architecture to be honest. Cons No real benefits other than salary. Office in dire need of refreshing, as a little tired. Nice location but not easy to get to. Very political, old fashioned approach to doing business. Quite chaotic and disorganised internally which results in high turnover of staff for a relatively small organisation. This is a shame, as with the right approach, it really could be a great place to work. Advice to Management Value your staff more. Respect that everyone has a part to play to make a business a success, not just the partners. Until you recognise these shortcomings, you will continue to lose good staff, which is a real shame.", "rating": 3, "pros": "World Class practice, interesting and varied client base, some very lovely talented staff. Nice name to have on your CV, although probably only if your field is architecture to be honest.", "cons": "No real benefits other than salary. Office in dire need of refreshing, as a little tired. Nice location but not easy to get to. Very political, old fashioned approach to doing business. Quite chaotic and disorganised internally which results in high turnover of staff for a relatively small organisation. This is a shame, as with the right approach, it really could be a great place to work.", "advice": "Value your staff more. Respect that everyone has a part to play to make a business a success, not just the partners. Until you recognise these shortcomings, you will continue to lose good staff, which is a real shame."}, {"title": "Brilliant Company", "text": "Pros Get to work with very talented individuals. Benefits have improved a lot over the last few years with a real investment in the people that work here. Food in the canteen is amazing and cheap. Support teams i.e. HR and IT are great and very supportive. There's a great training and development programme as well. Cons Be prepared to work hard be a contributor on projects! Very high expectations of people as you may imagine being one of the global leaders in architecture and design. Advice to Management Streamline some of the processes.", "rating": 5, "pros": "Get to work with very talented individuals. Benefits have improved a lot over the last few years with a real investment in the people that work here. Food in the canteen is amazing and cheap. Support teams i.e. HR and IT are great and very supportive. There's a great training and development programme as well.", "cons": "Be prepared to work hard be a contributor on projects! Very high expectations of people as you may imagine being one of the global leaders in architecture and design.", "advice": "Streamline some of the processes."}, {"title": "Commercial", "text": "Pros Leading global firm provides exposure to huge project Cons Riduculous hours and not very supportive Advice to Management Reward the hard working team", "rating": 3, "pros": "Leading global firm provides exposure to huge project", "cons": "Riduculous hours and not very supportive", "advice": "Reward the hard working team"}, {"title": "Foster", "text": "Pros Great people, best professionals, all the tools you can I agine. Cons Politics, working hours, work efficiency very low.", "rating": 5, "pros": "Great people, best professionals, all the tools you can I agine.", "cons": "Politics, working hours, work efficiency very low.", "advice": null}, {"title": "Brilliant place to work", "text": "Pros cutting edge stuff, brilliant management and brilliant location Cons work hours are tough but it is rewarding Advice to Management keep it up, management is efficient", "rating": 5, "pros": "cutting edge stuff, brilliant management and brilliant location", "cons": "work hours are tough but it is rewarding", "advice": "keep it up, management is efficient"}, {"title": "OK place to work", "text": "Pros If you want a popular 'brand' on your CV, go for it Cons Needs to be prepared to work hard", "rating": 3, "pros": "If you want a popular 'brand' on your CV, go for it", "cons": "Needs to be prepared to work hard", "advice": null}, {"title": "Not brilliant", "text": "Pros Projects are quite good, office looks fancy, and the food is quite cheap. Obviously good for the CV, worked here for about a year and couldn't bare any longer Cons Management are completely up themselves, you are literally just a number, they do not care for your well being, you never ever get a thank you or time back, don't bother wasting your time. Salaries really ain't much. Advice to Management Start looking after your staff, they are what pay your wages.", "rating": 1, "pros": "Projects are quite good, office looks fancy, and the food is quite cheap. Obviously good for the CV, worked here for about a year and couldn't bare any longer", "cons": "Management are completely up themselves, you are literally just a number, they do not care for your well being, you never ever get a thank you or time back, don't bother wasting your time. Salaries really ain't much.", "advice": "Start looking after your staff, they are what pay your wages."}, {"title": "Not that great", "text": "Pros Great resources, great people, great name to have in your CV. Cons Long hours, there is no respect for the people, you are only a number. Nobody says thanks to you, or take care of your mood. They do not how to motivate, and they don´t care, the people does not stay for a long time in the company for this reasons. Advice to Management Take care of the people, avoid long hours, better management.", "rating": 3, "pros": "Great resources, great people, great name to have in your CV.", "cons": "Long hours, there is no respect for the people, you are only a number. Nobody says thanks to you, or take care of your mood. They do not how to motivate, and they don´t care, the people does not stay for a long time in the company for this reasons.", "advice": "Take care of the people, avoid long hours, better management."}, {"title": "Architect", "text": "Pros Working with the most talented colleagues in their respective roles. Cons Would probably say location of the office. Due to lack of pub;lic transport options it can be quite difficult to get to work.", "rating": 5, "pros": "Working with the most talented colleagues in their respective roles.", "cons": "Would probably say location of the office. Due to lack of pub;lic transport options it can be quite difficult to get to work.", "advice": null}, {"title": "Best career move ever!", "text": "Pros Although it has been a steep but challenging learning curve, I would recommend working for Foster + Partners any time. I worked at Foster + Partners for 3 years with very skilled and experienced Partners from whom I have learned a lot. I was very lucky to work on very interesting and global projects from the beginning to the end stage. Very supportive team. Great canteen food and there is a stong emphasis on healthy living / working (massage sessions, stop smoking sessions etc.) Cons Required to stay late when meeting deadlines or coming into work on weekends but then there were days where I needed to leave earlier and that was fine too.", "rating": 5, "pros": "Although it has been a steep but challenging learning curve, I would recommend working for Foster + Partners any time. I worked at Foster + Partners for 3 years with very skilled and experienced Partners from whom I have learned a lot.", "cons": "Required to stay late when meeting deadlines or coming into work on weekends but then there were days where I needed to leave earlier and that was fine too.", "advice": null}, {"title": "Prestigious organisation to work for.", "text": "Pros I have been working in F+P for less than a year, and so far I have enjoyed working here very much. There are a lot of exciting projects taking place, not just in the studios but also in support functions, and you are given the opportunity to take on a project, come up with ideas and make it your own. Employees are all very enthusiastic about their work, there is an international environment, so you meet great and talented people from all around the world every day. There are social events and investment on employee well-being. Overall, glad to be part of this organisation. Cons The subsidied canteen is a great benefit, but food can be improved. There isn't any other places around to eat- so it can get repetitive sometimes. Advice to Management Investment on IT services/systems is essential to bring it to the level required for F+P", "rating": 5, "pros": "I have been working in F+P for less than a year, and so far I have enjoyed working here very much. There are a lot of exciting projects taking place, not just in the studios but also in support functions, and you are given the opportunity to take on a project, come up with ideas and make it your own.", "cons": "The subsidied canteen is a great benefit, but food can be improved. There isn't any other places around to eat- so it can get repetitive sometimes.", "advice": "Investment on IT services/systems is essential to bring it to the level required for F+P"}, {"title": "Great Company with Fantastic & Talented People", "text": "Pros I have worked at Foster + Partners for nearly 3 years and have had the opportunity to work alongside some truly amazing and talented people. The projects Foster + Partners works on are world class and it is great to be a part of such a dynamic and interesting Company. Cons Working hours can be long at times as Foster + Partners are growing and we are therefore taking on lots of exciting projects.", "rating": 5, "pros": "I have worked at Foster + Partners for nearly 3 years and have had the opportunity to work alongside some truly amazing and talented people. The projects Foster + Partners works on are world class and it is great to be a part of such a dynamic and interesting Company.", "cons": "Working hours can be long at times as Foster + Partners are growing and we are therefore taking on lots of exciting projects.", "advice": null}, {"title": "The only architectural and design practice to work", "text": "Pros Inspiring and forward thinking work environment. Exposure to the most prestigious projects in the world Working alongside the most talented architects and designers in the industry Growth and progression encouraged Great head office location with really good on site facilities Great benefits The best Christmas and summer staff parties Cons Sometimes the hours can be long but expected.", "rating": 5, "pros": "Inspiring and forward thinking work environment.", "cons": "Sometimes the hours can be long but expected.", "advice": null}, {"title": "Fantastic experience, great people", "text": "Pros I worked on some of the most exciting projects across the globe with some of the most talented personalities in Architecture. The technologies are cutting edge The working environment is world class Cons The hours can on occasion be challenging", "rating": 5, "pros": "I worked on some of the most exciting projects across the globe with some of the most talented personalities in Architecture.", "cons": "The hours can on occasion be challenging", "advice": null}, {"title": "Exciting and challenging environment. Great opportunites for development", "text": "Pros I have worked at Foster + Partners for around 3 years and in that time I have been involved in some truly exciting and interesting work, the pace is fast and the work dynamic. Great people with interesting skills and design capability that I have not experienced anywhere else. Good employee benefits and social aspect. Excellent subsidised canteen! Cons Hours can be long when project deadlines are close. Advice to Management Continue to motivate and inspire your teams.", "rating": 5, "pros": "I have worked at Foster + Partners for around 3 years and in that time I have been involved in some truly exciting and interesting work, the pace is fast and the work dynamic. Great people with interesting skills and design capability that I have not experienced anywhere else. Good employee benefits and social aspect. Excellent subsidised canteen!", "cons": "Hours can be long when project deadlines are close.", "advice": "Continue to motivate and inspire your teams."}, {"title": "Fun for interns", "text": "Pros Great at providing interns with experience in different areas of the firm, placing me with mid level architects and senior partners Cons seemed that mid level architects were treated as cogs in a machine, some had finished part 3 riba and appeared to be doing little more than acting as cad monkeys", "rating": 3, "pros": "Great at providing interns with experience in different areas of the firm, placing me with mid level architects and senior partners", "cons": "seemed that mid level architects were treated as cogs in a machine, some had finished part 3 riba and appeared to be doing little more than acting as cad monkeys", "advice": null}, {"title": "Internship placement", "text": "Pros Diverse & professional company, benefit of experiencing work and processes for large projects Cons As an intern not given much responsibility or teaching in respect to work.", "rating": 3, "pros": "Diverse & professional company, benefit of experiencing work and processes for large projects", "cons": "As an intern not given much responsibility or teaching in respect to work.", "advice": null}, {"title": "Nice name to have on CV but that's it", "text": "Pros Great views from office. Good project work. Cons Atrocious treatment of staff. Lack of real skill in admin groups, especially IT department. Some partners are horrible to work with. Advice to Management Make way for new blood. You've have an easy enough time now let someone else take charge.", "rating": 3, "pros": "Great views from office. Good project work.", "cons": "Atrocious treatment of staff. Lack of real skill in admin groups, especially IT department.", "advice": "Make way for new blood. You've have an easy enough time now let someone else take charge."}, {"title": "Visualiser", "text": "Pros Great studio, projects and opportunities. Long hours and rush times. Access to all latest technologies, software and hardware. Big workflows and pipeline. Very interesting to grow. Cons Long hours and rush times. Access to all latest technologies, software and hardware. Big workflows and pipeline. Very interesting to grow.", "rating": 5, "pros": "Great studio, projects and opportunities. Long hours and rush times. Access to all latest technologies, software and hardware. Big workflows and pipeline. Very interesting to grow.", "cons": "Long hours and rush times. Access to all latest technologies, software and hardware. Big workflows and pipeline. Very interesting to grow.", "advice": null}, {"title": "Great Experience, Long Hours", "text": "Pros As support staff work in the main studio, it's rather nice upstairs, well air conditioned. The bar is well catered; often cramped when it's busy, but its good service. Evening food is provided when you work late at 8-9pm. Taxis are provided anytime after 11pm. Good pension, currently on 2% employer contributions. Job stability is very stable. The company is doing very well at the moment, wins competitions (at the expense of making everyone work late because Fosters's reputation means they'll do it). Foster's employs a lot of university graduates, so it's great to get a step onto the ladder as it'll provide good career progression... as long as you can handle the stress and workload when crunchtime happens (frequently, varies from a couple times a month to a month straight). Free beer on Fridays after work during the summer months. Cons Very long hours, always unpaid overtime. Always expected to work late when necessary. As we work in the support teams we don't always know what or when we're going to work from the architects. Sometimes we can talk to the top but it is very hierarchical and we have to get information trickled down, which may then need repeating the next day as they make design decisions. Work can become stale after a while, with a lack of creative freedom. Thankfully I didn't work weekends, but I know a lot of the architects do unpaid. Advice to Management Allow creativity to flourish from the younger generations. They will respect you more for giving them that creative freedom and you'll get ideas you may not have expected. Invest more into the IT department to bring them up to speed.", "rating": 5, "pros": "As support staff work in the main studio, it's rather nice upstairs, well air conditioned. The bar is well catered; often cramped when it's busy, but its good service.", "cons": "Very long hours, always unpaid overtime. Always expected to work late when necessary.", "advice": "Allow creativity to flourish from the younger generations. They will respect you more for giving them that creative freedom and you'll get ideas you may not have expected."}, {"title": "Wow! Wow! Wow! So much talent, it's intoxicating.", "text": "Pros Great place to work. So many people and disciplines to learn from. Everyone I have come into contact with has been very professional and helpful. Cons The office location is a little bit out of the way however the views are awesome! Walking over the Albert Bridge on a nice day makes the day for me. It can be difficult to meet with people as a result of their busy schedules. Advice to Management Give the less exerienced people a chance to shine - you'll be suprised how good they are. They could be the future of the Practice if given the opportunity to shine,", "rating": 5, "pros": "Great place to work. So many people and disciplines to learn from. Everyone I have come into contact with has been very professional and helpful.", "cons": "The office location is a little bit out of the way however the views are awesome! Walking over the Albert Bridge on a nice day makes the day for me.", "advice": "Give the less exerienced people a chance to shine - you'll be suprised how good they are. They could be the future of the Practice if given the opportunity to shine,"}, {"title": "important firm, insane amount of hours", "text": "Pros it's an important firm and the projects are interesting. Cons insane amount of hours, from 9 am to 2-4 am....and still back in office at 9, high level of stress, low salary (the secretaries have a better salary than a senior visualiser just to give an idea). Advice to Management if 7-8 people left the Vis team the last year probably there will be a reason..change the manager?", "rating": 3, "pros": "it's an important firm and the projects are interesting.", "cons": "insane amount of hours, from 9 am to 2-4 am....and still back in office at 9, high level of stress, low salary (the secretaries have a better salary than a senior visualiser just to give an idea).", "advice": "if 7-8 people left the Vis team the last year probably there will be a reason..change the manager?"}, {"title": "Architect assistant", "text": "Pros Good people Wide range of portfolio Good resources Well Integration of related industry Cons Long hours Top heavy hierarchy Management lack of vision Lack of transparency Lack of fair and just reward mechanism Advice to Management Could be more just and fair in rewarding. More farsighted in vision, taking care of different parts of the company well.", "rating": 3, "pros": "Good people", "cons": "Long hours", "advice": "Could be more just and fair in rewarding. More farsighted in vision, taking care of different parts of the company well."}, {"title": "Decent opportunity to grow in a prestigious firm", "text": "Pros Workmates, most talented people from everywhere are working in this office, Cons Long hours and high level of stress. Live in a continuous deadline", "rating": 3, "pros": "Workmates, most talented people from everywhere are working in this office,", "cons": "Long hours and high level of stress. Live in a continuous deadline", "advice": null}, {"title": "Great place to work", "text": "Pros Exposure to technology and resources, good cheap catering, great office space, inspiring place Cons Some teams have a lot of pressure to deliver, which ultimately results in working long hours. Hard to climb up the career ladder", "rating": 5, "pros": "Exposure to technology and resources, good cheap catering, great office space, inspiring place", "cons": "Some teams have a lot of pressure to deliver, which ultimately results in working long hours. Hard to climb up the career ladder", "advice": null}, {"title": "Great Design exposure", "text": "Pros Learn innovative designs Great colleagues and team work Cons Bad Salary and benefits Longer working hours Too Hierarchical Advice to Management Retain Good staff", "rating": 3, "pros": "Learn innovative designs", "cons": "Bad Salary and benefits", "advice": "Retain Good staff"}, {"title": "Overall positive", "text": "Pros Multi-cultural environment, global scale projects, innovative construction technology, good working space, friendly people, job security, usually good design, office location by the river. Great office organization. Cons Too hierarchically structured. Food served at the canteen is like hospital food. Usually a lot of unpaid overtime, depending on the team you land in experience can be from great to very bad. Some directors make people stay late just for the shake of it. Lower than average salaries because they capitalize on their name. Apart from the main studio the other working buildings are mediocre at best. Not too much space to follow your personal Interests as management only cares to get the job done.", "rating": 3, "pros": "Multi-cultural environment, global scale projects, innovative construction technology, good working space, friendly people, job security, usually good design, office location by the river. Great office organization.", "cons": "Too hierarchically structured. Food served at the canteen is like hospital food. Usually a lot of unpaid overtime, depending on the team you land in experience can be from great to very bad. Some directors make people stay late just for the shake of it. Lower than average salaries because they capitalize on their name. Apart from the main studio the other working buildings are mediocre at best. Not too much space to follow your personal", "advice": null}, {"title": "Great place", "text": "Pros an experience working with great architects Cons a little bit intense, but worth it!", "rating": 5, "pros": "an experience working with great architects", "cons": "a little bit intense, but worth it!", "advice": null}, {"title": "Good - but not for the longterm", "text": "Pros Amazing projects with a tremendous range in scale. Definitely a good place for recent graduates to get some experience. Staying long-term seems questionable as most people burn out after 18 months Cons Factory-style environment in London, smaller branch offices in Madrid, HK and NY are much more personal.", "rating": 3, "pros": "Amazing projects with a tremendous range in scale. Definitely a good place for recent graduates to get some experience. Staying long-term seems questionable as most people burn out after 18 months", "cons": "Factory-style environment in London, smaller branch offices in Madrid, HK and NY are much more personal.", "advice": null}, {"title": "Great for a couple of years but nowhere to go after that", "text": "Pros Working with intelligent and creative people Well-known name for the CV High profile projects Cons Long hours with little gratitude and certainly no compensation Little training or encouragement No progression, especially for women Poor benefits Advice to Management You're a global consultancy now- start treating your staff properly. You don't deserve a pat on the back for providing a free evening meal for staff who have done at least 3 hours unpaid overtime- this is the very least an employer can do when people are giving up their evenings, weekends and even sometimes holiday.", "rating": 3, "pros": "Working with intelligent and creative people", "cons": "Long hours with little gratitude and certainly no compensation", "advice": "You're a global consultancy now- start treating your staff properly. You don't deserve a pat on the back for providing a free evening meal for staff who have done at least 3 hours unpaid overtime- this is the very least an employer can do when people are giving up their evenings, weekends and even sometimes holiday."}, {"title": "Long hours, great satisfaction, international opportunities but crap IT and benefits.", "text": "Pros High quality staff, great integrated working environment,talented architects, growing in house engineering expertise. Strong sense of ownership and desire to deliver amazing projects to high standards. Great staff canteen. Cons IT support is slow, do not really understand the needs or users. Lots of in house software but not even a search tool on the intranet. Long working hours. Hierarchy structure is so flat that there is not clear sense of progression. Employment benefits is less than basic. Pension is poor. Salary is lower than market rate. Turnover high. Advice to Management Stop procrastinating. Make the necessary changes to restructure, align job titles to industry, introduce clear job roles and career progression, to focus not just on recruitment, but more on retention. More transparency would be good.", "rating": 5, "pros": "High quality staff, great integrated working environment,talented architects, growing in house engineering expertise.", "cons": "IT support is slow, do not really understand the needs or users.", "advice": "Stop procrastinating. Make the necessary changes to restructure, align job titles to industry, introduce clear job roles and career progression, to focus not just on recruitment, but more on retention. More transparency would be good."}, {"title": "leave and stay is all about your own choice", "text": "Pros working with creative and fun people. big name access to project information, material center and library great social network connection Cons long hour working low pay no over time pay Advice to Management N/A", "rating": 5, "pros": "working with creative and fun people.", "cons": "long hour working", "advice": "N/A"}, {"title": "A step in the wrong direction", "text": "Pros The university feel to the campus, with lots of great people to bump into. Cutting-edge projects to have on your CV. The food provided is great too. You'll be staying late for dinner VERY often! The christmas parties are great. Cons Long hours, poor training (in terms of variety of work), many managers above you changing the design continually (meaning you have to repeat your work), many options having to be designed for, absolutely no site experience, no experience of taking any designs past stage D (both of which are a turn-off for potential employers, as I found), no overtime paid, too much emphasis placed on visuals to be a worthwhile use of a young engineer's time (i.e. time is spent on Photoshop etc. that should be time spent learning how to design buildings), poor remuneration due to the number of CVs coming in from all around the world, (i.e. you are easily replaceable) - one good quote from a senior partner concerns a girl there who asked to take a month off on unpaid leave to go back to her home country. He said \"You're currently walking along a bridge - if you want to jump then you're welcome to, there are ten people behind you waiting to take your place\"! Advice to Management I have no good advice! It's an employer's market.", "rating": 1, "pros": "The university feel to the campus, with lots of great people to bump into. Cutting-edge projects to have on your CV. The food provided is great too. You'll be staying late for dinner VERY often! The christmas parties are great.", "cons": "Long hours, poor training (in terms of variety of work), many managers above you changing the design continually (meaning you have to repeat your work), many options having to be designed for, absolutely no site experience, no experience of taking any designs past stage D (both of which are a turn-off for potential employers, as I found), no overtime paid, too much emphasis placed on visuals to be a worthwhile use of a young engineer's time (i.e. time is spent on Photoshop etc. that should be time spent learning how to design buildings), poor remuneration due to the number of CVs coming in from all around the world, (i.e. you are easily replaceable) - one good quote from a senior partner concerns a girl there who asked to take a month off on unpaid leave to go back to her home country. He said \"You're currently walking along a bridge - if you want to jump then you're welcome to, there are ten people behind you waiting to take your place\"!", "advice": "I have no good advice! It's an employer's market."}, {"title": "No balance work-life", "text": "Pros Working for iconic Architecture. Dealing with cutting edge technologies. Meet really skilful people Cons -Right place to learn the meaning of Workaholic -Extra hours not paid -No pension Scheme -No many benefits Advice to Management Optimise better resource and time. Do not consider 12 hours a day or week as standard working time or at least it should be paid hours.", "rating": 3, "pros": "Working for iconic Architecture.", "cons": "-Right place to learn the meaning of Workaholic", "advice": "Optimise better resource and time. Do not consider 12 hours a day or week as standard working time or at least it should be paid hours."}, {"title": "Simply Great", "text": "Pros Great place to work with the best minds and best projects Cons Sometimes can be intimidating to face the design board.... But it's fun. Advice to Management Reward the outstanding.", "rating": 5, "pros": "Great place to work with the best minds and best projects", "cons": "Sometimes can be intimidating to face the design board.... But it's fun.", "advice": "Reward the outstanding."}, {"title": "No balance work-life", "text": "Pros Big and expensive project to be involved. Cons No extra money for working abroad, no extra money for over hours, no contribution on pension scheme. Advice to Management Pay etxra hour massimize talent and people time.", "rating": 3, "pros": "Big and expensive project to be involved.", "cons": "No extra money for working abroad, no extra money for over hours, no contribution on pension scheme.", "advice": "Pay etxra hour massimize talent and people time."}, {"title": "Bad.", "text": "Pros Large international firm with big projects Cons Long hours, bad pay and poorly treated.", "rating": 1, "pros": "Large international firm with big projects", "cons": "Long hours, bad pay and poorly treated.", "advice": null}, {"title": "Great place", "text": "Pros Great inspiring atmosphere Chance to work on the best projects in the world Incredible support network of mentors Friendly and supportive environment Cons Long long long hours Hard to maintain work life balance Sometimes the work can be repetitive and monotonous Little transparency from management on decisions Advice to Management Offer more competitive salary compared with similar sized practices. Offer incentives for employees to stay with the company for longer periods of time", "rating": 5, "pros": "Great inspiring atmosphere", "cons": "Long long long hours", "advice": "Offer more competitive salary compared with similar sized practices."}, {"title": "Good - unsure about internal future prospects though", "text": "Pros Kudos Colleagues are inspiring and creative - you will become very close to them given the amount of time you spend in the office! Diversity and superiority of projects compared to other firms Cons Long hours and you can only get a taxi home on the company from 11pm onwards - a few of my colleagues have been mugged after leaving the office on foot after 10pm. Lack of recognition for good work Advice to Management If you are not prepared to financially reward people who make outstanding contributions, perhaps enforce a scheme whereby they are recognised in another way. Promotions are too few and far between.", "rating": 3, "pros": "Kudos", "cons": "Long hours and you can only get a taxi home on the company from 11pm onwards - a few of my colleagues have been mugged after leaving the office on foot after 10pm.", "advice": "If you are not prepared to financially reward people who make outstanding contributions, perhaps enforce a scheme whereby they are recognised in another way. Promotions are too few and far between."}, {"title": "Recommendable", "text": "Pros Good organization High quality of the people at both rofessional and personal level Working enviroment and facilities CApability of the company to be a leader in its sector reinventing itself constanly Cons Strong hierarchy structure can be sometimes a limitation for your growing expectations Salaries are relatively low compared to other architectural companies Advice to Management Generally speaking continue with the line of work established since the inception of the company The succesful regeneration of the senior management done during last years to be repeated when needed", "rating": 5, "pros": "Good organization", "cons": "Strong hierarchy structure can be sometimes a limitation for your growing expectations", "advice": "Generally speaking continue with the line of work established since the inception of the company"}, {"title": "Good Name to have on CV but never stay there for more than 2 years.", "text": "Pros World famous architectural firm with reputation to be at the forefront of building industry. The firm's portfolio span all kind of design projects in all sort of scales from product design to urban master planning. It is a great place to learn and experience how a large construction project is being developed. Interesting mix of international people. Cons Terrible salary and terrible benefit packages. An average working hours of 90 hours a week or more without any overtime pay. The extra hours are compulsory both at night and weekends. An average salary of Â£34K after working there more than 5 years, so your income is actually lower than people working in McDonald's if you average out your salary with the actual working hours. There are bonuses but they would be in a range of Â£1000 or less. Very low respect of employees' personal life. Factory working environment and extremely political place to work in. Advice to Management If you want to keep the best talents in the industry then pay us decent salary. There is no point asking why people are not happy working for you, and all wanting to leave after a year or so, if you only pay for 40 hours, and expect all of us to work 24/7 for practically nothing.", "rating": 1, "pros": "World famous architectural firm with reputation to be at the forefront of building industry. The firm's portfolio span all kind of design projects in all sort of scales from product design to urban master planning. It is a great place to learn and experience how a large construction project is being developed. Interesting mix of international people.", "cons": "Terrible salary and terrible benefit packages. An average working hours of 90 hours a week or more without any overtime pay. The extra hours are compulsory both at night and weekends. An average salary of Â£34K after working there more than 5 years, so your income is actually lower than people working in McDonald's if you average out your salary with the actual working hours. There are bonuses but they would be in a range of Â£1000 or less. Very low respect of employees' personal life. Factory working environment and extremely political place to work in.", "advice": "If you want to keep the best talents in the industry then pay us decent salary. There is no point asking why people are not happy working for you, and all wanting to leave after a year or so, if you only pay for 40 hours, and expect all of us to work 24/7 for practically nothing."}, {"title": "All the benefits of \"Corporate architecture\" without comprising design culture.", "text": "Pros High profile projects. Large firm (about 1000) with emphasis on small, rigorous design groups. Access to the most advanced fabrication, material and technological resources. Cons Long arduous hours nearing deadlines with no overtime. A few weeks reaching 80+ hours. Advice to Management Great management of talent, providing several options for employment and location of employment.", "rating": 5, "pros": "High profile projects. Large firm (about 1000) with emphasis on small, rigorous design groups. Access to the most advanced fabrication, material and technological resources.", "cons": "Long arduous hours nearing deadlines with no overtime. A few weeks reaching 80+ hours.", "advice": "Great management of talent, providing several options for employment and location of employment."}]