[{"title": "Best company to work for me", "text": "Pros I'll be straightforward too: Gimo is the best company to work, me as a PHP developer, i have worked in quite a few places and i find myself in a good place here. Great help from the team, good environment, good freebies, i hear some more coming in... so guys if you are are l00king for a good place to work at, try it here and you will see! Cons only down thing is: we start to be a bit overcrowded but should be sorted soon as HR let us know recently Advice to Management we hear very exciting things about office changes, let's make that happen for sure, looking forward to that", "rating": 5, "pros": "I'll be straightforward too: Gimo is the best company to work, me as a PHP developer, i have worked in quite a few places and i find myself in a good place here.", "cons": "only down thing is: we start to be a bit overcrowded but should be sorted soon as HR let us know recently", "advice": "we hear very exciting things about office changes, let's make that happen for sure, looking forward to that"}, {"title": "Worst company to work for", "text": "Pros None, just legal requirements Cons Everything about GIMO is a con. How people wake up and go there every single day is shocking to me. Staff are not treated fairly at all, there is way too much favouritism. 90% on the reviews on here are fake. I wouldn’t even recommend GIMO to my pet Cat Sally. It’s the WORST place I’ve ever worked in my entire life! Advice to Management Press the reset button and start again.", "rating": 1, "pros": "None, just legal requirements", "cons": "Everything about GIMO is a con. How people wake up and go there every single day is shocking to me. Staff are not treated fairly at all, there is way too much favouritism. 90% on the reviews on here are fake. I wouldn’t even recommend GIMO to my pet Cat Sally. It’s the WORST place I’ve ever worked in my entire life!", "advice": "Press the reset button and start again."}, {"title": "Good company, great teams and good atmosphere", "text": "Pros I am a frontend/HTML/CSS developer, I must say a bit junior but i was given the opportunity to learn more in a great team where i also touched backend development as this is what i want to do as well Cons it is a shame but i think i need to go back to some basics to learn even more and maybe one day have the chance to work again at gimo Advice to Management Thank you to the team for the patience and help, Management should reward you", "rating": 5, "pros": "I am a frontend/HTML/CSS developer, I must say a bit junior but i was given the opportunity to learn more in a great team where i also touched backend development as this is what i want to do as well", "cons": "it is a shame but i think i need to go back to some basics to learn even more and maybe one day have the chance to work again at gimo", "advice": "Thank you to the team for the patience and help, Management should reward you"}, {"title": "Worst company I have never worked for", "text": "Pros Most of the colleagues are nice people. That's all, nothing else is good. Cons Only the negative reviews are real, don't believe in those positive ones, they are all fake! To rate it 1 star is still too many, but there is no 0 star option. 1. No training, no document, you have to figure out/ get used to everything by yourself when you start to work there. Everything is a mess and no one really knows or can help you with your work. People work here without passion, they just make the system can work, so all the systems are messy, hard to maintain, and can be broken at anytime in future. 2. No flexible work hours, no work from home option. You need to work from 9am to 6pm, two 15 mins breaks at 11am and 4pm, lunch break at 1am, everyone should be the same, like prisoners. They even ask you to work, when you are sick and take a day off. 3. Low paid, minimum benefit. Only 20 annual holidays, and they used 3 days for Christmas, so you only have 17 days to use as you want actually. They pay you as less as possible. They paid me less for no reason after I said I want to quit. 4. Terrible management. When you have concern or question about your benefit and you ask HR, they don't reply you! You ask everyday, and they just ignore you or reply you useless response like 'I'm going to reply you later'. Managers sit in totally separated area and use a different door, like they are higher level of people and they can't be in the same place with us slaves. 5. I wished this company would improve from employees' feedback, but I found it's impossible in the end. The only thing this company does is taking as many advantages from employees as possible. I felt miserable, depressed, and hopeless everyday when I walked into the office. Don't go to this company even if you're desperate! Advice to Management Stop treating your employees as slaves", "rating": 1, "pros": "Most of the colleagues are nice people. That's all, nothing else is good.", "cons": "Only the negative reviews are real, don't believe in those positive ones, they are all fake! To rate it 1 star is still too many, but there is no 0 star option.", "advice": "Stop treating your employees as slaves"}, {"title": "Here I love GIMO. I think that this company works quite well.", "text": "Pros Good work ethics, good attitude, and nice toward employees. I see that some guy really got crazy and write all in CAPS. Don't even understand how GlassDoor can accept that.. Oh , But don't believe whatever he says. The best way is to come and judge by yourself. I guess he is someone that got fired (my guess) and must be somewhat upset at his own lack of skills, dedication and his review just show how bad of a work ethic he has. Cons running out of space, and we need more parties !! Advice to Management Bigger offices - we really are running out of space.", "rating": 5, "pros": "Good work ethics, good attitude, and nice toward employees. I see that some guy really got crazy and write all in CAPS. Don't even understand how GlassDoor can accept that.. Oh , But don't believe whatever he says. The best way is to come and judge by yourself. I guess he is someone that got fired (my guess) and must be somewhat upset at his own lack of skills, dedication and his review just show how bad of a work ethic he has.", "cons": "running out of space, and we need more parties !!", "advice": "Bigger offices - we really are running out of space."}, {"title": "Very happy as a project lead at Gimo", "text": "Pros If you are good you are happy, if you are not so good you still get support to build upon what you know so all in all a great place to be and to work at with awesome colleagues and managemet Cons not so much to say here Advice to Management keep hiring great people", "rating": 5, "pros": "If you are good you are happy, if you are not so good you still get support to build upon what you know so all in all a great place to be and to work at with awesome colleagues and managemet", "cons": "not so much to say here", "advice": "keep hiring great people"}, {"title": "GIMO is just shocking", "text": "Pros Nice colleagues and that's about it Cons GIMO is just shocking. I don't even know where to start here. Management sit completely separate from everyone, do not mix with people and do not have an open door policy, in fact, they hardly speak to the staff and think they are better than everyone else. There are absolutely no additional benefits to working here other than what is legally required: low pay, no decent pension, low amount of annual leave, no flexible working, no maternity leave options, no fruit or snacks and most importantly no personal development options. This is not how you should treat your workforce at all. People are generally nice and friendly but management treat them abhorrently. Advice to Management Why do you have no respect for your workforce?", "rating": 1, "pros": "Nice colleagues and that's about it", "cons": "GIMO is just shocking. I don't even know where to start here. Management sit completely separate from everyone, do not mix with people and do not have an open door policy, in fact, they hardly speak to the staff and think they are better than everyone else. There are absolutely no additional benefits to working here other than what is legally required: low pay, no decent pension, low amount of annual leave, no flexible working, no maternity leave options, no fruit or snacks and most importantly no personal development options. This is not how you should treat your workforce at all. People are generally nice and friendly but management treat them abhorrently.", "advice": "Why do you have no respect for your workforce?"}, {"title": "Tech responsibilities", "text": "Pros was after a job which let me finally have the responsibilities i wanted over the past few years. finally got them here at gimo where i can use all my skills at last: severs, security, encryption, management, Linux etc. Cons sometimes a bit junior skilled are hired which is not always the best Advice to Management great choice in trusting me with responsibilities", "rating": 5, "pros": "was after a job which let me finally have the responsibilities i wanted over the past few years. finally got them here at gimo where i can use all my skills at last: severs, security, encryption, management, Linux etc.", "cons": "sometimes a bit junior skilled are hired which is not always the best", "advice": "great choice in trusting me with responsibilities"}, {"title": "in the middle of international talent", "text": "Pros Very glad to work with international talented people, happy to have found my right place and looking forward to growing here even further Cons must find some so i can say something here Advice to Management nothing special to say here", "rating": 5, "pros": "Very glad to work with international talented people, happy to have found my right place and looking forward to growing here even further", "cons": "must find some so i can say something here", "advice": "nothing special to say here"}, {"title": "Terrible place to work, avoid even if you are desperate.", "text": "Pros There are no pros here. The whole work force is just people who were desperate for a job and had nowhere else to go. Then if they are there too long their skills are so poor they can't go anywhere else. Cons MOST OF THE POSITIVE REVIEWS ABOUT THIS COMPANY ARE FAKE! Strict timings like you are a school child, except for management and employees they deem worthy. All must be in at 9, 15-minute break at 11. lunch at 1. 15-minute break at 4. Home time at 6. Strict 40 hour week, sanctions if you do not meet this. No standards with work, attitude is 'just get it done and get it done now'. No benefits other than what is legally required. Rewarded with drinks once a month if you've followed all the rules. drinks start at 5:30 and you either drink or work because you are only allowed to leave the building at 6. Management has a closed door don't speak to me unless I speak to your mentality. Peasant quarters are downstairs management have their own space and nice big kitchen and meetings rooms facilities etc. Advice to Management No advice God only knows how you've managed to get away with all you have for over 10 years. I'll be amazed if you last 10 more.", "rating": 1, "pros": "There are no pros here. The whole work force is just people who were desperate for a job and had nowhere else to go. Then if they are there too long their skills are so poor they can't go anywhere else.", "cons": "MOST OF THE POSITIVE REVIEWS ABOUT THIS COMPANY ARE FAKE! Strict timings like you are a school child, except for management and employees they deem worthy. All must be in at 9, 15-minute break at 11. lunch at 1. 15-minute break at 4. Home time at 6. Strict 40 hour week, sanctions if you do not meet this. No standards with work, attitude is 'just get it done and get it done now'. No benefits other than what is legally required. Rewarded with drinks once a month if you've followed all the rules. drinks start at 5:30 and you either drink or work because you are only allowed to leave the building at 6. Management has a closed door don't speak to me unless I speak to your mentality. Peasant quarters are downstairs management have their own space and nice big kitchen and meetings rooms facilities etc.", "advice": "No advice God only knows how you've managed to get away with all you have for over 10 years. I'll be amazed if you last 10 more."}, {"title": "Super Experience", "text": "Pros Superb environment and people to learn more about the industry and get some good exprerience Cons It can get a bit busy from time to time but possibility of planning ... Advice to Management thank you everyone (management and staff memebers)", "rating": 5, "pros": "Superb environment and people to learn more about the industry and get some good exprerience", "cons": "It can get a bit busy from time to time but possibility of planning ...", "advice": "thank you everyone (management and staff memebers)"}, {"title": "Could not be happier", "text": "Pros i'm very happy for the efforts that gimo management have done for me so i could have the special working arrangement i needed. More so, that it has no effect on my nice salary and still have good perspectives for growth. Living in central london is not always easy, gimo helps me make it easier Cons i would not like to say anything here other than i really like it here.. Advice to Management Thanks to HR and Management for helping me here and happy that you could listen to me", "rating": 5, "pros": "i'm very happy for the efforts that gimo management have done for me so i could have the special working arrangement i needed.", "cons": "i would not like to say anything here other than i really like it here..", "advice": "Thanks to HR and Management for helping me here and happy that you could listen to me"}, {"title": "Much worse than worse", "text": "Pros My team members make work a little durable. But other than this the whole place is not good. Not good I tell you. Cons I do not even know where to begin. The management treat you like you are not human and not human being. They are very unreasonable in their demands They will fire people for no reason or because they want to save money They only like you a little bit if you are French Everyone is lying to everyone and most of us want to leave but the contract is so onerous You do not get an increase on your salary Everyday i go in i am miserable. I cannot wait to get out Advice to Management Raise salaries Provide maternity leave Value the employees", "rating": 1, "pros": "My team members make work a little durable. But other than this the whole place is not good. Not good I tell you.", "cons": "I do not even know where to begin.", "advice": "Raise salaries"}, {"title": "Happy to work here", "text": "Pros I working in a great team and often meet with big names of the industry like Google, Facebook Working at gimo helped me buy a nice house not far from London Great team members and good social events Cons should have joined earlier, would have bought my house earlier", "rating": 5, "pros": "I working in a great team and often meet with big names of the industry like Google, Facebook", "cons": "should have joined earlier, would have bought my house earlier", "advice": null}, {"title": "I was pleased with them", "text": "Pros Quite big company with great people and good team members I did not stay over a year for some reasons but was very pleased with them Cons maybe con or pros but there are many many (interesting) projects there, too many ? Advice to Management I really think all the teams and projects need front end specialists", "rating": 5, "pros": "Quite big company with great people and good team members", "cons": "maybe con or pros but there are many many (interesting) projects there, too many ?", "advice": "I really think all the teams and projects need front end specialists"}, {"title": "I am a true Web/Software Developer now", "text": "Pros Good learning environment with good Tech Lead. I came from another industry and learnt my way through with a good team I was not a php developer but i am now so that's a pro lol Pizza, drinks, people, Playstation ... Cons Can get a little busy time to time but usually very good for being taught within the team Advice to Management good on you for taking me from another industry which had nothing to do with php and believing in me", "rating": 5, "pros": "Good learning environment with good Tech Lead. I came from another industry and learnt my way through with a good team", "cons": "Can get a little busy time to time but usually very good for being taught within the team", "advice": "good on you for taking me from another industry which had nothing to do with php and believing in me"}, {"title": "Good experience and nice opportunity", "text": "Pros i worked full time at gimo for a short period and the experience was quite good I learned interesting things which are now very useful The job at gimo also helped me get closer to my family as i was abroad before ... Cons it was a bit far from my place and had to leave quite earlier so could socialize as much as i would have wanted outside work only on free pizza and free drink days... Advice to Management not sure what to say here carry on, i met some interesting people so thanks for that and wish it could have been longer", "rating": 5, "pros": "i worked full time at gimo for a short period and the experience was quite good", "cons": "it was a bit far from my place and had to leave quite earlier so could socialize as much as i would have wanted outside work only on free pizza and free drink days...", "advice": "not sure what to say here carry on, i met some interesting people so thanks for that and wish it could have been longer"}, {"title": "Great balance in personal and professional life", "text": "Pros GIMO has been great with me so far and gave me some time off regularly to care for my family. This is quite rare so i'd like to thank them Also work environment is quite relaxed and happy so i really feel good Other plus are regular small competitions to win prizes, football tickets, free pizza and free drinks Cons let's have the next Christmas party in summer lol i hate winter Advice to Management again thanks for understanding my situation and for your help", "rating": 5, "pros": "GIMO has been great with me so far and gave me some time off regularly to care for my family. This is quite rare so i'd like to thank them", "cons": "let's have the next Christmas party in summer lol", "advice": "again thanks for understanding my situation and for your help"}, {"title": "Great co-workers, disgraceful management", "text": "Pros Met some wonderful people who are now my friends The location is good The system can sometimes crash which means no work :) Cons Where do I begin? If you speak French, they will hire you so they can gossip with you. The work pattern is not good as sometimes they can expect you to work 7 days in row. Is this legal? You cannot take management seriously as people who previously worked as baristas are fast tracked to managers just because they speak French. You are constantly lied to and nothing ever gets resolved. There is no perks whatsoever. They have a pizza day but the pizzas are stale. Advice to Management Improve your communication skills as emailing your employees instead of speaking face to face when there is an issue does not help.", "rating": 1, "pros": "Met some wonderful people who are now my friends", "cons": "Where do I begin?", "advice": "Improve your communication skills as emailing your employees instead of speaking face to face when there is an issue does not help."}, {"title": "Special Thanks to GIMO", "text": "Pros I Would like to thank Gimo for letting me do my PHD at the same time as working with them. They have helped me all the way so i could achieve what i wanted, giving me the time when and how i needed it. I am now a Doctor and very grateful to them as it is also thanks to GIMO Cons Sadly could not carry on there but really had a good time with incredible people ! Advice to Management Keep helping", "rating": 5, "pros": "I Would like to thank Gimo for letting me do my PHD at the same time as working with them.", "cons": "Sadly could not carry on there but really had a good time with incredible people !", "advice": "Keep helping"}, {"title": "Not good for web developers", "text": "Pros Free pizza on last Friday of the month Good bunch of people, many at the first experience in the UK Cons Poor management Web developers treated not as good as people in other team Frequent overtime They check if you're 1 minute late to get in even if you worked overtime for free the previous day Salaries lower than market Advice to Management Don't be so time freak , create a more relaxed environment", "rating": 3, "pros": "Free pizza on last Friday of the month", "cons": "Poor management", "advice": "Don't be so time freak , create a more relaxed environment"}, {"title": "Nice on the short term", "text": "Pros Decent salary, you are on your own, you don't get controlled (this can be a pro or a con), multicultural environment, good colleagues, decent office. In some department you can have a nice bonus each month. Usually no overtime, in case that overtime is needed, it is paid. One Pizza day and one drink day monthly. Cons Some people in quite important roles are incompetent and their managers/supervisors doesn't say or do anything. Every time they do mistakes other people are put in bad/stressful positions and the company looks really unprofessional. people are put in bad/stressfull positions and the company looks really unprofessional. Advice to Management If your subordinates often do mistakes do something, or at least aknowledge it! It seems like you don't care if the site lose a lot of customers for this reasons! CSs direclty deals with your customers, so it's a good idea to ask their feedbacks and listen to their advice, sometimes.", "rating": 3, "pros": "Decent salary, you are on your own, you don't get controlled (this can be a pro or a con), multicultural environment, good colleagues, decent office. In some department you can have a nice bonus each month. Usually no overtime, in case that overtime is needed, it is paid. One Pizza day and one drink day monthly.", "cons": "Some people in quite important roles are incompetent and their managers/supervisors doesn't say or do anything. Every time they do mistakes other people are put in bad/stressful positions and the company looks really unprofessional. people are put in bad/stressfull positions and the company looks really unprofessional.", "advice": "If your subordinates often do mistakes do something, or at least aknowledge it! It seems like you don't care if the site lose a lot of customers for this reasons! CSs direclty deals with your customers, so it's a good idea to ask their feedbacks and listen to their advice, sometimes."}, {"title": "Horrible company to work for", "text": "Pros They work you to thew ground, once you enter the building you cease to be a human Cons Diverse international team, sadly bright individuals don't stay there for long Advice to Management Your staff are humans not work tools", "rating": 1, "pros": "They work you to thew ground, once you enter the building you cease to be a human", "cons": "Diverse international team, sadly bright individuals don't stay there for long", "advice": "Your staff are humans not work tools"}, {"title": "casual", "text": "Pros people are relaxed. pizza day and drink day once a month. Cons managers don't like communicate with you Advice to Management n/a", "rating": 3, "pros": "people are relaxed. pizza day and drink day once a month.", "cons": "managers don't like communicate with you", "advice": "n/a"}, {"title": "thank you for your understanding", "text": "Pros quite glad with GIMO as they let me work from during the strike days :( this week.. it would have been quite hard for me otherwise so thanks a bunch I am very happy with support i get from the management and for their understanding Cons i can say 5 times not for me lol Advice to Management keep focus on SEO like you do it is very important, thati s why are number 1 !!!", "rating": 5, "pros": "quite glad with GIMO as they let me work from during the strike days :( this week.. it would have been quite hard for me otherwise so thanks a bunch", "cons": "i can say 5 times not for me lol", "advice": "keep focus on SEO like you do it is very important, thati s why are number 1 !!!"}, {"title": "MMM thank full to GIMO", "text": "Pros So i had to leave GIMO due to some private circumstances but i remember a nice atmosphere upstairs quite relax and pro my manager was quite nice too and very helpful For sure will use what i learned at GIMO and grow in my life so big thanks smiley face Cons during my experience at GIMO i was not as ready i am NOW after having the GIMO experience. I wish i was at that time i promised myself to act upon it Advice to Management Dont forget me haha we never know M can be back hehe", "rating": 5, "pros": "So i had to leave GIMO due to some private circumstances but i remember a nice atmosphere upstairs quite relax and pro", "cons": "during my experience at GIMO i was not as ready i am NOW after having the GIMO experience. I wish i was at that time", "advice": "Dont forget me haha we never know M can be back hehe"}, {"title": "Gimo Helped me out big time", "text": "Pros When i joined gimo i had personal experience but not so much on the commercial front luckily gimo gave me the opportunity to be hired despite not much experinece they saw my potential i guess, thanks for that by the way... after that i went to get better and better with everyday ground training and i am now a proud skilled developer Cons get the lovely marketing to cooperate even more with developers lol Advice to Management Thanks for career help and take me back if i need to one day haha", "rating": 5, "pros": "When i joined gimo i had personal experience but not so much on the commercial front", "cons": "get the lovely marketing to cooperate even more with developers lol", "advice": "Thanks for career help and take me back if i need to one day haha"}, {"title": "Like it as it is", "text": "Pros I am part of a pretty nice time with a good vibe going on. Relaxed environment We work hard which is good and it s good to see nice achievement, i love constantly learning new skills which i can o here Again the best for me are my team mates especially around the Drink Friday evening Cons I heard that i might be moving, not really like the idea to be honest...pretty nice where i am so don't get me out of here lol Advice to Management Keep it as it is with the great current vibe", "rating": 5, "pros": "I am part of a pretty nice time with a good vibe going on. Relaxed environment", "cons": "I heard that i might be moving, not really like the idea to be honest...pretty nice where i am so don't get me out of here lol", "advice": "Keep it as it is with the great current vibe"}, {"title": "thanks really as i'd say", "text": "Pros I just wanted to say that gimo has been great for me as i could learn things you don't really learn in school or in books. I had to change my job for personal reasons but the marketing experience i got there helped me to make this much easier..so really appreciated! Cons Sadly i had to leave for personal reasons and move avay from there Advice to Management i hope other get the same opportunity to learn as i did", "rating": 5, "pros": "I just wanted to say that gimo has been great for me as i could learn things you don't really learn in school or in books. I had to change my job for personal reasons but the marketing experience i got there helped me to make this much easier..so really appreciated!", "cons": "Sadly i had to leave for personal reasons and move avay from there", "advice": "i hope other get the same opportunity to learn as i did"}, {"title": "Good place to work for", "text": "Pros - Joined as a junior QA and learnt a lot working with highly skilled developers - Very good work ambiance - Extremely helpful team members - good social events - had to leave for personal reasons but enjoyed working with the team and the direct manager Cons Breaks could have been more flexible (instead 2 mandatory 15 minute breaks at fixed times)", "rating": 5, "pros": "- Joined as a junior QA and learnt a lot working with highly skilled developers", "cons": "Breaks could have been more flexible (instead 2 mandatory 15 minute breaks at fixed times)", "advice": null}, {"title": "Very multicultural", "text": "Pros You will make friends from many different countries. Cons High turn over of people, therefore, training new starters are not easy.", "rating": 3, "pros": "You will make friends from many different countries.", "cons": "High turn over of people, therefore, training new starters are not easy.", "advice": null}, {"title": "Avoid", "text": "Pros They share a building with a TV production company, so you might run into the odd celebrity on the stairs Cons Do not match tasks to staff's skill set Overabundance of management levels No training opportunities Too much focus on marketing people, none on developers Obsession with clock watching (I was chastised for leaving 2 minutes before my official shift-end on a day where I had had literally no work to do all day) Advice to Management Don't employ people when you have no work to match their skills. It takes more than a free pizza to make an attractive place to work", "rating": 1, "pros": "They share a building with a TV production company, so you might run into the odd celebrity on the stairs", "cons": "Do not match tasks to staff's skill set", "advice": "Don't employ people when you have no work to match their skills. It takes more than a free pizza to make an attractive place to work"}, {"title": "It's cool", "text": "Pros Pizza Friday every last Friday of the month Drinks every fortnight Laid back atmosphere Cons Finishing shift at 4pm means trying to get home in crazy city rush hour! Advice to Management Maybe better holidays and pension scheme", "rating": 5, "pros": "Pizza Friday every last Friday of the month", "cons": "Finishing shift at 4pm means trying to get home in crazy city rush hour!", "advice": "Maybe better holidays and pension scheme"}, {"title": "Marketing Asistant", "text": "Pros Nice company to grow up with Good people Cons Salaries are so poor comparing with the work", "rating": 5, "pros": "Nice company to grow up with", "cons": "Salaries are so poor comparing with the work", "advice": null}, {"title": "Nice place to work", "text": "Pros Dynamic and interesting tasks. Friendly and responsible coworkers. Great project manager (at least my one) Cons In my point of view salary is a bit underrated related to current market in Landon", "rating": 5, "pros": "Dynamic and interesting tasks.", "cons": "In my point of view salary is a bit underrated related to current market in Landon", "advice": null}, {"title": "Excellent company to work for", "text": "Pros GIMO will be your favourite place to work in. They are a well established and global company that specialises in online marketing. Company has a nice office in southwark, good location, lots of places to eat, easy to get there by tube. Management is pretty good, espcially middle management - very friendly and down to earth people, they will always hear you out and give you a good advice if needed. HR is also doing a great job by organising social events, managing holiday requests, hiring new staff members etc. You will be rewarded with bonuses and salary raises if you do a good job. You'll get great opportunities to learn many new skills further your career with their in-house training. Pizza day every second friday and beer day every last friday. Co-workers are young, friendly and fun, most fridays they go out and socialise together. GIMO is definitely the place to be at. Cons Cant really think of any major cons. I guess for some people central london can be a bit expensive (if you eat at pubs everyday) Advice to Management Keep on doing a great job that you have been doing so far and everything will be just fine.", "rating": 5, "pros": "GIMO will be your favourite place to work in. They are a well established and global company that specialises in online marketing.", "cons": "Cant really think of any major cons. I guess for some people central london can be a bit expensive (if you eat at pubs everyday)", "advice": "Keep on doing a great job that you have been doing so far and everything will be just fine."}, {"title": "Fine for a first job in your career but no more.", "text": "Pros Nice colleagues but no one speak perfect English You get paid instead if you don't take your holidays Cons Gambling activities Low salary for the sector in UK High turner over of staff and managers Last minutes requests are frequent If you work in web dev team, you need to stay after 7pm almost everyday", "rating": 3, "pros": "Nice colleagues but no one speak perfect English", "cons": "Gambling activities", "advice": null}, {"title": "Great company to work for", "text": "Pros Top marketing manager I work for, very known brands, good salary and evolution. The company is big, around 100 people I would say. As for the evolution, I started as a simple content person, and now I am a marketing assistant.. I am aiming at becoming a product manager at some point.. all that in 2 years ! Cons none that i can think of Advice to Management continue what you are doing - its working.", "rating": 5, "pros": "Top marketing manager I work for, very known brands, good salary and evolution. The company is big, around 100 people I would say. As for the evolution, I started as a simple content person, and now I am a marketing assistant.. I am aiming at becoming a product manager at some point.. all that in 2 years !", "cons": "none that i can think of", "advice": "continue what you are doing - its working."}, {"title": "BOOMING COMPANY TO WORK FOR", "text": "Pros Gimo's potential is growing as the days go buy and recruitment is bringing new interesting people all the team! Great to cooperate with original talented people Frequent tickets provided to staff members to go watch football matches or other events! Cons There are social activities very 2 Fridays but would be awesome if even more! Pizza days should have a variety of choice lol as not everyone eats pizza :)", "rating": 5, "pros": "Gimo's potential is growing as the days go buy and recruitment is bringing new interesting people all the team!", "cons": "There are social activities very 2 Fridays but would be awesome if even more!", "advice": null}, {"title": "Releaved to be in the GIMO family!", "text": "Pros Had used Glassdoor to find about Gimo before accepting the position, i was a bit worried but i am happy to say that all is GOOD! It is a great place to work and with a lot of smart people The company organises a lot of social events to help employees know each other a bit better.... Cons Some cons you can read about Gimo are best verified yourself in person... For now i am getting to know Gimo for sure i will post if i find anything else.. The company is quite packed i mus say but i guess this is good right ? Advice to Management Keep me happy haha", "rating": 5, "pros": "Had used Glassdoor to find about Gimo before accepting the position, i was a bit worried but i am happy to say that all is GOOD!", "cons": "Some cons you can read about Gimo are best verified yourself in person...", "advice": "Keep me happy haha"}, {"title": "ACCOUT MANAGER", "text": "Pros Good company, opportunities of evolution Cons bad management, depends of the department I guess Advice to Management Very special way to manager people", "rating": 3, "pros": "Good company, opportunities of evolution", "cons": "bad management, depends of the department I guess", "advice": "Very special way to manager people"}, {"title": "Join us!", "text": "Pros I love working at Gimo, enjoying my holidays right now though haha, come join and see for yourself! There are great individuals and great working together. You can help us be even greater. Cons Getting bigger each day passes but is that a con :) ^^ ? Advice to Management IT is good to let teams be independent and the driving forsce!", "rating": 5, "pros": "I love working at Gimo, enjoying my holidays right now though haha, come join and see for yourself! There are great individuals and great working together. You can help us be even greater.", "cons": "Getting bigger each day passes but is that a con :) ^^ ?", "advice": "IT is good to let teams be independent and the driving forsce!"}, {"title": "Worst company I have worked for", "text": "Pros Not many to mention. You learn because no one teaches you anything. Cons Management is really awful. My manager was a truly awful spiteful little man that did not want to share any of his knowledge. He also had no people skills whatsoever. Salaries are below market average, no reviews or progression. They make so much money yet try and get away with paying people the least amount possible. There are a few more senior people with higher salaries but those are few and far in between. Everyone I worked with at the time would have been better off working at Tescos or claiming benefits. Unfortunately I had to endure GIMO a long time because I worked there during the recession and jobs were few and far in between. Now that I work for a proper company with benefits, I can see that I wasted too much precious time at Gimo. I earn decent money now in a managerial position and am so glad to have escaped that place. If you get offered a job there, do not take it unless you are desperate. I also find it laughable that the reply by Gimo to reviews on here always features the christmas parties and pizza friday. People would rather be paid more money than go to a party once a year. Advice to Management Treat people with respect.", "rating": 3, "pros": "Not many to mention. You learn because no one teaches you anything.", "cons": "Management is really awful. My manager was a truly awful spiteful little man that did not want to share any of his knowledge. He also had no people skills whatsoever. Salaries are below market average, no reviews or progression. They make so much money yet try and get away with paying people the least amount possible. There are a few more senior people with higher salaries but those are few and far in between. Everyone I worked with at the time would have been better off working at Tescos or claiming benefits. Unfortunately I had to endure GIMO a long time because I worked there during the recession and jobs were few and far in between. Now that I work for a proper company with benefits, I can see that I wasted too much precious time at Gimo. I earn decent money now in a managerial position and am so glad to have escaped that place. If you get offered a job there, do not take it unless you are desperate. I also find it laughable that the reply by Gimo to reviews on here always features the christmas parties and pizza friday. People would rather be paid more money than go to a party once a year.", "advice": "Treat people with respect."}, {"title": "By far the very worst place I've ever worked", "text": "Pros The day that you leave is the pro. Cons The management is truly woeful, treating the employees with total contempt. Best epitomised by the fact there is a 'nice' entrance for the bosses and a separate 'servants' entrance for the rest of the staff, where everyone's comings and goings are meticulously monitored. The management also have a personal chef to cook lunch for them, in actual kitchen facilities, on their 'nice' side of the office, while on the 'workers' side there's not even a proper kitchen. The managers aren't the sort of people to think that they could share the kitchen facilities with all staff. Meetings were truly awful, where they all just talk over each other and have separate conversations. Colleagues just 'disappear' without any mention as to why they've left. Oh, and they take photos of staff and pretend they are customers who had won, and rent models to appear at the christmas party so in the party photos the staff look attractive (!!) Advice to Management There is nothing that I could say to them that would make the slightest bit of difference or that they would even countenance listening to.", "rating": 1, "pros": "The day that you leave is the pro.", "cons": "The management is truly woeful, treating the employees with total contempt. Best epitomised by the fact there is a 'nice' entrance for the bosses and a separate 'servants' entrance for the rest of the staff, where everyone's comings and goings are meticulously monitored. The management also have a personal chef to cook lunch for them, in actual kitchen facilities, on their 'nice' side of the office, while on the 'workers' side there's not even a proper kitchen. The managers aren't the sort of people to think that they could share the kitchen facilities with all staff. Meetings were truly awful, where they all just talk over each other and have separate conversations. Colleagues just 'disappear' without any mention as to why they've left. Oh, and they take photos of staff and pretend they are customers who had won, and rent models to appear at the christmas party so in the party photos the staff look attractive (!!)", "advice": "There is nothing that I could say to them that would make the slightest bit of difference or that they would even countenance listening to."}, {"title": "good company", "text": "Pros good environment where work Cons not many benefits apart from pension", "rating": 3, "pros": "good environment where work", "cons": "not many benefits apart from pension", "advice": null}, {"title": "Junior Programmer", "text": "Pros A place where you can start your career. Cons Not a good environment to work. Too much gossip. Bonuses and reward and salary raise never come from the bosses. You must begging them, remembering that they have not increased the salary of at least three years. What I find humiliating.", "rating": 3, "pros": "A place where you can start your career.", "cons": "Not a good environment to work. Too much gossip. Bonuses and reward and salary raise never come from the bosses. You must begging them, remembering that they have not increased the salary of at least three years. What I find humiliating.", "advice": null}, {"title": "Worst company I've worked for", "text": "Pros You get to know some nice people that are not in charge. Cons You get fired in the first few days if you can't learn the whole application. I don't even know what's the purpose of the interview, you either know your stuff or you don't, why hire people and fire time 2 days after? I tell you why, they don't know what are they doing. Not keeping a promise and trying to manipulate you to work as much as possible is ordinary. Some of the upper management are not very smart so they don't know how to handle people. Expect to be threatened to give a bad review to the next company you're leaving to if you're not doing 200% in your notice period. Overall, this is the worst company I've worked for. If you're a developer I beg you to avoid this, there are plenty of developer jobs in the UK.", "rating": 1, "pros": "You get to know some nice people that are not in charge.", "cons": "You get fired in the first few days if you can't learn the whole application. I don't even know what's the purpose of the interview, you either know your stuff or you don't, why hire people and fire time 2 days after? I tell you why, they don't know what are they doing.", "advice": null}, {"title": "Nice company and nice people", "text": "Pros Nice people to work with and nice environment Cons More team building when i was there but i heard there are lunches and evening team events so i think is getting better Advice to Management They must be doing someething right as Gimo keep growing with happy people", "rating": 5, "pros": "Nice people to work with and nice environment", "cons": "More team building when i was there but i heard there are lunches and evening team events so i think is getting better", "advice": "They must be doing someething right as Gimo keep growing with happy people"}, {"title": "horrible place with fake images on this site", "text": "Pros none I can think of Cons low wages work long hours bad management no career opportunity Advice to Management go on management training", "rating": 1, "pros": "none I can think of", "cons": "low wages", "advice": "go on management training"}, {"title": "Marketing assistant", "text": "Pros Good company, responsible mature and understanding Occasionally up and downs as everywhere at the motivation of colleagues but in general, a exemplary dynamism among employees Perfect internal communication. A pleasant working rhythm . I feel myself well here. Cons Nothing to report, carry on Advice to Management more bonuses. Thank you all .", "rating": 5, "pros": "Good company, responsible mature and understanding", "cons": "Nothing to report, carry on", "advice": "more bonuses. Thank you all ."}, {"title": "Company review - Nice place to work near Waterloo and Southwark", "text": "Pros Small teams, nice people, possibility to learn, nice challenges. It is a dynamic and busy company with lots of projects. There is a nice atmosphere in the company in general. Great if you are interested in games or sports ! Cons There is still a lack of flexibility sometimes but hopefully they will continue to learn about it. Advice to Management 1 or 2 additional holidays would be a great idea !", "rating": 5, "pros": "Small teams, nice people, possibility to learn, nice challenges. It is a dynamic and busy company with lots of projects. There is a nice atmosphere in the company in general. Great if you are interested in games or sports !", "cons": "There is still a lack of flexibility sometimes but hopefully they will continue to learn about it.", "advice": "1 or 2 additional holidays would be a great idea !"}, {"title": "Project manager", "text": "Pros Easy integration Gimo lead by example in respect of staff No unnecessary pressure Positive recognition Rewards effort A true team work,when I wake I am motivated to go to Gimo, A lively atmosphere within the company Opportunites to progress within company Gimo is a good school for the ambitious Cons It should have as many girls as boys. Advice to Management In recruitment, management must continue to manage well in order to have the serious and motivated people for a good atmosphere within the teams .", "rating": 5, "pros": "Easy integration Gimo lead by example in respect of staff", "cons": "It should have as many girls as boys.", "advice": "In recruitment, management must continue to manage well in order to have the serious and motivated people for a good atmosphere within the teams ."}, {"title": "An example for other companies", "text": "Pros I worked for 2 years for this wonderful company as a Graphic Designer with a nice team  and a professional manager, exceptional people, respectful, good memories, I recommend to all. I am back to my home country now . Cons Do not change anything in design teams haha  Keep this good vibe Advice to Management I thank the management team who knew every time how to motivate and support throughout this period .", "rating": 5, "pros": "I worked for 2 years for this wonderful company as a Graphic Designer with a nice team", "cons": "Do not change anything in design teams haha  Keep this good vibe", "advice": "I thank the management team who knew every time how to motivate and support throughout this period ."}, {"title": "PHP Developer", "text": "Pros A pleasant experience continues in Gimo. A positive work environment that allowed me to increase my level of performance. Where I was able to also enrich my technical levels and increase my productivity. A living working group, with colleagues became good friends. Thank you to all. Cons there should be more Pizza parties hehe Advice to Management Thank you for supporting us to achieve the objectives.", "rating": 5, "pros": "A pleasant experience continues in Gimo.", "cons": "there should be more Pizza parties hehe", "advice": "Thank you for supporting us to achieve the objectives."}, {"title": "gambling company", "text": "Pros u can make career in gambling, good coders, beautiful and nice project managers,pizza day, training with tuts,product managers expert in the gambling industry Cons not enough girls in the technical department, marketing guys could explain better Advice to Management hire more ladies in the programming roles", "rating": 5, "pros": "u can make career in gambling, good coders, beautiful and nice project managers,pizza day, training with tuts,product managers expert in the gambling industry", "cons": "not enough girls in the technical department, marketing guys could explain better", "advice": "hire more ladies in the programming roles"}, {"title": "Good company", "text": "Pros central london, good projects, pension, bowling, christmas party. Project managers to help on deadlines, product managers that actually know their stuff, a fantastic team leader (terminal team) who is a genius. Cons many many people, too many to know all of them and tons of projects. Advice to Management nothing - they got it good.", "rating": 5, "pros": "central london, good projects, pension, bowling, christmas party. Project managers to help on deadlines, product managers that actually know their stuff, a fantastic team leader (terminal team) who is a genius.", "cons": "many many people, too many to know all of them and tons of projects.", "advice": "nothing - they got it good."}, {"title": "Working at GIMO", "text": "Pros Friendly colleagues, good working atmosphere, drinks evening and pizza day once a month. Good management. All in all a very interesting place to work at ! Cons The only slight negative I can list so far is that the company seems not very flexible in terms of working from at home. Advice to Management Be more flexible so Managers can work from at home occasionally !", "rating": 5, "pros": "Friendly colleagues, good working atmosphere, drinks evening and pizza day once a month.", "cons": "The only slight negative I can list so far is that the company seems not very flexible in terms of working from at home.", "advice": "Be more flexible so Managers can work from at home occasionally !"}, {"title": "Starts off well enough but goes downhill after that", "text": "Pros Some great people to work with. Free beer and free pizza once a month Cons Badly run from the top. Too many decisions happen on the fly with no real planning or thought put into it. The ideas are there but there is nobody to take charge and plan this properly. Poor working conditions. Not flexible. No consideration of their employees as they are treated like robots and not people. Once they feel they have got all they can from them they just discard/fire them. People are often fired without a solid reason which makes a lot of people feel pressured and on edge while at work. You get the feeling that some underhanded tactics take place and the company is happy to go with them without considering the consequences. However if you want to feel overworked and under appreciated then this is the right place to be. Advice to Management Get people in who can build a structure and a plan going forward.", "rating": 3, "pros": "Some great people to work with. Free beer and free pizza once a month", "cons": "Badly run from the top. Too many decisions happen on the fly with no real planning or thought put into it. The ideas are there but there is nobody to take charge and plan this properly. Poor working conditions. Not flexible. No consideration of their employees as they are treated like robots and not people. Once they feel they have got all they can from them they just discard/fire them. People are often fired without a solid reason which makes a lot of people feel pressured and on edge while at work. You get the feeling that some underhanded tactics take place and the company is happy to go with them without considering the consequences. However if you want to feel overworked and under appreciated then this is the right place to be.", "advice": "Get people in who can build a structure and a plan going forward."}, {"title": "No good point", "text": "Pros Unhealthy pizza and beer once a month Cons Horrible experience, I almost did a burnout there. I never met someone happy to work there, so I find the good comments very surprising, Advice to Management I think it's too late for them to be able to hear something constructive so no.", "rating": 1, "pros": "Unhealthy pizza and beer once a month", "cons": "Horrible experience, I almost did a burnout there. I never met someone happy to work there, so I find the good comments very surprising,", "advice": "I think it's too late for them to be able to hear something constructive so no."}, {"title": "PHP Programmer", "text": "Pros Good middle management, pizza, drinks and a few cool perks (trainings) + I work in the middle of London. Cons executive management is sometimes a bit absent, so that makes things hard. Advice to Management more middle managements", "rating": 5, "pros": "Good middle management, pizza, drinks and a few cool perks (trainings) + I work in the middle of London.", "cons": "executive management is sometimes a bit absent, so that makes things hard.", "advice": "more middle managements"}, {"title": "designer", "text": "Pros Nice people to work with Cons Underpaid, no appreciation for hard work, have to take holidays if you have doctor appointment, no pay for overtime,constant change of employees. Advice to Management Stop replacing people as sock, maybe you will have stable company, with good quality employees", "rating": 1, "pros": "Nice people to work with", "cons": "Underpaid, no appreciation for hard work, have to take holidays if you have doctor appointment, no pay for overtime,constant change of employees.", "advice": "Stop replacing people as sock, maybe you will have stable company, with good quality employees"}, {"title": "Start up", "text": "Pros evolution possible, good people, pizza day, multi language environment (French yes, as the other racist idiot that keeps bashing the company every once in a while said in another review) Cons they hire sometimes a bit without background check Advice to Management Its hard to hire, but try to have a better interview process.", "rating": 5, "pros": "evolution possible, good people, pizza day, multi language environment (French yes, as the other racist idiot that keeps bashing the company every once in a while said in another review)", "cons": "they hire sometimes a bit without background check", "advice": "Its hard to hire, but try to have a better interview process."}, {"title": "Best Company to Work", "text": "Pros There's lots of different people to meet here from all over the world. This is a good company to get industry experience. Friendly management, progression plan, goals and Incentive Cons Fixed office timing 9:00 to 6:00.", "rating": 5, "pros": "There's lots of different people to meet here from all over the world. This is a good company to get industry experience. Friendly management, progression plan, goals and Incentive", "cons": "Fixed office timing 9:00 to 6:00.", "advice": null}, {"title": "Web Developer for the last 3 years", "text": "Pros Small teams with good relationships, pretty decent drink day, decent pizza day, Christmas party. Your standard London tech web company. MVC PHP. RAISES at times. Cons No Laravel, mostly gambling industry. Advice to Management Make sure your good people are heard and everything will flow. Please see that we have more parties.", "rating": 5, "pros": "Small teams with good relationships, pretty decent drink day, decent pizza day, Christmas party. Your standard London tech web company. MVC PHP. RAISES at times.", "cons": "No Laravel, mostly gambling industry.", "advice": "Make sure your good people are heard and everything will flow. Please see that we have more parties."}, {"title": "Quirky entrepenurial spirit", "text": "Pros Medium sized business, but run like a smaller business. Not a lot of 'red tape'. Lots of responsibilities : if you show your skills and that you are eager to progress, responsibilities and recognition are easily given to employees. They will certainly work you, but you are rewarded... you just have to ask! Cons Extra holidays and benefits would be nice to help reward staff. Sometimes, too many \"Skype\" communications while people can just talk to each other. Advice to Management Hang on the good staff by offering more rewards. And keep hiring as you are currently doing because we now have better staff who are more experienced and confident in their skills.", "rating": 5, "pros": "Medium sized business, but run like a smaller business. Not a lot of 'red tape'.", "cons": "Extra holidays and benefits would be nice to help reward staff.", "advice": "Hang on the good staff by offering more rewards. And keep hiring as you are currently doing because we now have better staff who are more experienced and confident in their skills."}, {"title": "current job", "text": "Pros Nice company multicutural, I learned a lot at Gimo Cons No specials cons, maybe they should do more evaluation Advice to Management keep always cool", "rating": 5, "pros": "Nice company multicutural, I learned a lot at Gimo", "cons": "No specials cons, maybe they should do more evaluation", "advice": "keep always cool"}, {"title": "Good start for carrier with progression, annual salary reviews", "text": "Pros Friendly management, progression plan, goals and Incentive, happy Fridays, bowling competition, excellent Christmas party in best venues. Cons lack of efficiency in some department, Advice to Management Be more involved", "rating": 5, "pros": "Friendly management, progression plan, goals and Incentive, happy Fridays, bowling competition, excellent Christmas party in best venues.", "cons": "lack of efficiency in some department,", "advice": "Be more involved"}, {"title": "PPC Manager", "text": "Pros Friendly management, social events, goals and incentives Cons Lacking efficiency in some areas Advice to Management Get more involved", "rating": 5, "pros": "Friendly management, social events, goals and incentives", "cons": "Lacking efficiency in some areas", "advice": "Get more involved"}, {"title": "nice people even better Managers", "text": "Pros good place to start marketing experience very good benefits fair bonus scheme (if you are good you will succede here) no dress code Cons been here 5 years no cons so far Advice to Management The only thing missing here is some days working from home", "rating": 5, "pros": "good place to start marketing experience", "cons": "been here 5 years no cons so far", "advice": "The only thing missing here is some days working from home"}, {"title": "Best place to gain experience", "text": "Pros As the office is really quiet - you get to concentrate with work and implement your own ideas. Directors listens and let you do your own thing. Social activities such as Drinks Friday, Pizza Friday, Lunch dates, Pool nights, Raffle draws for football matches & etc. Cons Unable to work from home. There are things that can be improved however it always lacks resources. Really high staff turnover so you have to deal with different person most of the time. Advice to Management New starters should be introduced to everyone to feel welcomed in the company, offering better salary to employees to reduce turnovers. GIMO should have an organizational chart to know who deals with what project and system or pretty much how the company works.", "rating": 5, "pros": "As the office is really quiet - you get to concentrate with work and implement your own ideas. Directors listens and let you do your own thing.", "cons": "Unable to work from home. There are things that can be improved however it always lacks resources. Really high staff turnover so you have to deal with different person most of the time.", "advice": "New starters should be introduced to everyone to feel welcomed in the company, offering better salary to employees to reduce turnovers. GIMO should have an organizational chart to know who deals with what project and system or pretty much how the company works."}, {"title": "Good work environement", "text": "Pros The office they have is a bit crowded, but they have actually now as well as ground floor the 1st floor.. so we will move there soon. The management is correct and the pay pays for London suburban life. Cons They try to do reviews every 6 months, but sometimes these are a bit late. Advice to Management Try to do your reviews on time.", "rating": 5, "pros": "The office they have is a bit crowded, but they have actually now as well as ground floor the 1st floor.. so we will move there soon. The management is correct and the pay pays for London suburban life.", "cons": "They try to do reviews every 6 months, but sometimes these are a bit late.", "advice": "Try to do your reviews on time."}, {"title": "Small and flexible company - treat it like a start-up. Loads of opportunity if you can shine.", "text": "Pros Gimo is a international family company that has grown bigger organically thanks to the boom in online marketing and product in the past ten years. You won't find a rigid structure in place here - it's fluid and free with employees from all over the world working on diverse projects. The directors wear smart casual - no suits here. You find that scary? Better move on. Exciting? Read more... If you are a skilled, enthusiastic, self-starter with passion you can progress quickly. Prove your worth and the management will be quick to reward you with increased responsibilities. I personally found the company very accommodating when I needed their help - I had to tell them though rather than wait to be asked. You won't find your line manager micro-managing your time or looking over your shoulder. Gimo's vision seems to be a meritocracy where if you can express ideas persuasively you will find yourself moving ahead and being given the opportunity to prove yourself. Just keep your head down until you learn the ropes. Cons High staff turnover in the entry level positions is frustrating - but this is an agency model that is constantly adding juniors and finds it hard to hold onto experienced staff. If you crave a rigid corporate structure and want to keep your head down and be spoon fed mundane tasks in a cubicle you will be miserable at Gimo. The induction consists of \"here's your desk, here are your colleagues\" if you are lucky enough to get training remember, it's just the beginning. Be the one to reach out and introduce yourself to people - there are good people here but they aren't very outgoing. Advice to Management From a HR point of view a more proactive approach to review and consultation about progress and opinion would be appreciated. Consider devolving the social budget to team leaders so they can build and reward internal progress (pizza and beer on friday's is still nice though!) Individuals getting to know team colleagues better is a win win situation. Increasing flexibility when it comes to working hours would go a long way to improve morale. Providing some decent coffee making facilities would be nice too - it's 21st Century London. We need Espresso!", "rating": 3, "pros": "Gimo is a international family company that has grown bigger organically thanks to the boom in online marketing and product in the past ten years. You won't find a rigid structure in place here - it's fluid and free with employees from all over the world working on diverse projects. The directors wear smart casual - no suits here.", "cons": "High staff turnover in the entry level positions is frustrating - but this is an agency model that is constantly adding juniors and finds it hard to hold onto experienced staff. If you crave a rigid corporate structure and want to keep your head down and be spoon fed mundane tasks in a cubicle you will be miserable at Gimo.", "advice": "From a HR point of view a more proactive approach to review and consultation about progress and opinion would be appreciated. Consider devolving the social budget to team leaders so they can build and reward internal progress (pizza and beer on friday's is still nice though!) Individuals getting to know team colleagues better is a win win situation."}, {"title": "Only for desperate graduates", "text": "Pros Life at Gimo is made bearable by your co-workers. Most people at the Gimo are young, bright and easy going. Oh, and the annual Christmas parties are great fun (but that again is down to the people). Cons Enjoy your three salty slices of pizza and occasional team outing, because those are pretty much the only benefits that Gimo has to offer. Even free coffee/tea is too much to ask. Let alone something basic like a Pension Scheme. From management perspective there is zero interest in employee career development. No performance reviews, development plans or even regular catch ups with line manager. They just don't care, although they do have this odd obsession with time keeping. Don't get me started on the salaries - way below market rate. I was lucky that my work covered various products, so my job was never on the line, but they do like to hire people on a project basis while offering them the false security of a perm contract. When the project is finished, they just kick them out saying they did not perform well enough. It's a joke. Gimo are just too stingy to hire freelancers. Advice to Management Close your London office and move your entire business to Romania. Better for everyone.", "rating": 1, "pros": "Life at Gimo is made bearable by your co-workers. Most people at the Gimo are young, bright and easy going. Oh, and the annual Christmas parties are great fun (but that again is down to the people).", "cons": "Enjoy your three salty slices of pizza and occasional team outing, because those are pretty much the only benefits that Gimo has to offer. Even free coffee/tea is too much to ask. Let alone something basic like a Pension Scheme.", "advice": "Close your London office and move your entire business to Romania. Better for everyone."}, {"title": "GIMO Review", "text": "Pros Most of the employees are genuine and friendly people. As the workforce is so young, there is a vibrant feel and people are keen to socialize outside of work. Cons Very few staff benefits to incentivise moral. Little or no communication between management and other decision makers. Set times for lunches and break contribute to the feeling of being treated like a child. Dark and dingy office with most decisions reached over Skype rather than talking to colleagues face-to-face. Advice to Management Involve the whole team in decisions and create an environment where people are motivated to work hard and stay for longer.", "rating": 1, "pros": "Most of the employees are genuine and friendly people. As the workforce is so young, there is a vibrant feel and people are keen to socialize outside of work.", "cons": "Very few staff benefits to incentivise moral. Little or no communication between management and other decision makers. Set times for lunches and break contribute to the feeling of being treated like a child. Dark and dingy office with most decisions reached over Skype rather than talking to colleagues face-to-face.", "advice": "Involve the whole team in decisions and create an environment where people are motivated to work hard and stay for longer."}, {"title": "This is not a resting area.... worst company ever", "text": "Pros There are so many cons so it makes it difficult to enjoy the pros... The management is so proud of the Pizza Friday and the Drink Friday it makes it pathetic! Cons - Low salary, no flexibility, 20 holidays, overtime not paid - The managers are a joke, all the directors (a bunch of clowns all related in a way or another) can barely express themselves in English. This goes also to some employees who were hired even if they cannot communicate properly in English. - The company policy is to hire people with little experience or no experience at all to pay them the minimum which can lead to big failures with people having roles they shouldn't have and cannot handle. - Time keeping is important. The break times and lunch times are in your contract but if this applies to most employees some seem to be exempt. - The directors have no shame. Even if your workload is busy they don't hesitate to send you some personal tasks to do that are not related to the company or the industry... Everybody acts as if it were normal, so be ready to do some personal favours or work for their relatives whenever they need your skills and can save money.... HR is aware of this situation but seems powerless or doesn't want to act on it. - All the positive reviews were posted on the same day, how bizarre??? but when you actually realise that they were asked by HR and some of the directors and posted by themselves, you understand how it went from a few negative reviews to a dozen of really good ones.... - Overall this is the worst company I have ever worked for, everything is done to the minimum so it is still legal but don't expect anything else. I wouldn't recommend this company but obviously it is not easy to find a job, so if you have to work there be mentally prepared to work for a bunch of a idiots, deal with the most ridiculous requests and deadlines, just use them as they use you, take the experience and leave as soon as you can. Advice to Management Respect your employees, they are not slaves or personal assistants. Pizzas and drinks once a month won't make people stay, stop thinking that you're being extremely generous and kind by doing this.", "rating": 1, "pros": "There are so many cons so it makes it difficult to enjoy the pros...", "cons": "- Low salary, no flexibility, 20 holidays, overtime not paid", "advice": "Respect your employees, they are not slaves or personal assistants."}, {"title": "Wham bham thank you ma'am", "text": "Pros Pizza once a month and for those who drink 1 drink once a month.. Cons Firstly I'd like to say funny how all the good reviews were written on and around the 9th of July!!!! Saying that to talk about the company, They expect u to come in and know everything like you've been working there for a years.. No one wants to help u when they give you the impossible amount of tasks to do everyday.. If you don't speak French or kiss bum then you might as well leave not sign up for a job because you'd probably get fired within a year. Half the time they don't even pay you on time!!!! They don't even pay you for any overtime that you work.. They take ur annual lieu days off you for not working during the Christmas period when they are closed.. Advice to Management Go train on how to run a business...", "rating": 1, "pros": "Pizza once a month and for those who drink 1 drink once a month..", "cons": "Firstly I'd like to say funny how all the good reviews were written on and around the 9th of July!!!!", "advice": "Go train on how to run a business..."}, {"title": "OK if you don’t have any experience or are desperate, otherwise don’t bother.", "text": "Pros Bonuses and other advantages: free pizza once a month and ONE free drink per person twice a month, that’s impressive! More seriously, there is one bonus, only one, given for Christmas, with usually targets impossible to reach, it depends if they like you or not. You will learn a lot in this company because roles are not well defined so you can work on various tasks or products. You will have to learn mostly by yourself though, they don’t train anyone, even if they say so during your interview. Cons You will have to work hard and fast, very fast, usually for a lower than usual salary, so once again it’s only good as a starting job, no more. If they offer you a very good salary, it means they just want to “use” you for your knowledge, just for a couple months, usually 6 months to a year, before they fire you. It’s fine if your English is not good, most of the employees are foreigners, it’s how they get good people for cheaper. It seems that only good actors/mediocre workers get the best jobs there. I’ve always been amazed to see how hard people work when they are poorly treated and paid. I have to say, if there is something the management is good at, it’s manipulation. People get fired on a regular basis, I guess it’s to accentuate the “terror” atmosphere of the office. Their method is also particularly elegant: typically they would inform people they are fired on a Friday at 5:50pm and tell them not to come back on Monday, and they can’t even say goodbye. Work-wise the management don’t know what they are doing and are totally unorganised. They change their mind about everything every week and they like impossible deadlines, they might find it fun!? Every couple of weeks they’ll come up with a new “great idea” that is in reality pointless and everybody will have to work even harder to make these changes...before another stupid idea comes to their minds, they self-sabotage their company with this attitude. As you will see in other reviews they are very strict about time keeping, but not for everybody, it depends if they particularly like you or not. Oh and I have seen a couple of positive reviews about this company but don’t be fooled, they wrote them, it’s certain! It’s typically the management’s method...they are such a joke! Advice to Management Hire professionals to manage your company and stop making decisions/changes in place of your employees.", "rating": 1, "pros": "Bonuses and other advantages: free pizza once a month and ONE free drink per person twice a month, that’s impressive!", "cons": "You will have to work hard and fast, very fast, usually for a lower than usual salary, so once again it’s only good as a starting job, no more.", "advice": "Hire professionals to manage your company and stop making decisions/changes in place of your employees."}, {"title": "weird company", "text": "Pros - pizza day once a month - beer day once a month - well situed nearby the tube station - no dress code - dirty but funny sex stories within the company Cons - low salary - staff unfriendly - managers untrained - no communication managers-staff - ability to fire an entire department within 10minutes regardless of its contribution - unable to train new employees - unrealistic bonus scheme Advice to Management - respect your employees - listen to your employees - create opportunities - achieve a more equitable distribution of wealth", "rating": 1, "pros": "- pizza day once a month", "cons": "- low salary", "advice": "- respect your employees"}, {"title": "Dynamic young company", "text": "Pros Multicultural environment; management is willing to listen to you if you're able to convince them; colleagues are very nice; drink and Pizza Fridays (twice a month) plus social activities arranged by HR Cons All the communication goes on Skype, people could fix problems much faster if meeting in the flesh instead of wasting their time typing; salaries could be higher Advice to Management Raise salaries and introduce better and more clear incentives, you'll reduce employees turnover costs", "rating": 5, "pros": "Multicultural environment; management is willing to listen to you if you're able to convince them; colleagues are very nice; drink and Pizza Fridays (twice a month) plus social activities arranged by HR", "cons": "All the communication goes on Skype, people could fix problems much faster if meeting in the flesh instead of wasting their time typing; salaries could be higher", "advice": "Raise salaries and introduce better and more clear incentives, you'll reduce employees turnover costs"}, {"title": "For fresher its a good start", "text": "Pros you can learn things from Scratch and multi cultured environment Cons Poor management, Low salary and fixed office timing.", "rating": 3, "pros": "you can learn things from Scratch and multi cultured environment", "cons": "Poor management, Low salary and fixed office timing.", "advice": null}, {"title": "Good starting point but no progression, annual/monthly reviews or company benefits", "text": "Pros Central location, Pizza Fridays, Bowling (team building), Drinks Fridays. GIMO is a good place to start. You will have a lot of responsibilities (sometimes too much) and will be able to add a lot of skills to your CV. Multicultural work environment. Pay rise after one year, if you stay that long. Cons There is no training, you kind of have to learn as you go, sometimes at the expense of the company website/brand. Company doesn't seem to care about the quality of its websites/brands and would rather things be rushed and delivered at a low standard... Not much chance of a promotion. Advice to Management Be involved with your staff, carry out monthly reviews to see what the employees want/need to improve their working life/environment and this may see that your do not have such a high turn over of staff. Implement a training scheme for all newcomers.", "rating": 3, "pros": "Central location, Pizza Fridays, Bowling (team building), Drinks Fridays.", "cons": "There is no training, you kind of have to learn as you go, sometimes at the expense of the company website/brand. Company doesn't seem to care about the quality of its websites/brands and would rather things be rushed and delivered at a low standard...", "advice": "Be involved with your staff, carry out monthly reviews to see what the employees want/need to improve their working life/environment and this may see that your do not have such a high turn over of staff."}, {"title": "Dont expect any training, hit the ground running or they WILL sack you", "text": "Pros Pizza day, beer day is about all they offer. Cons No benefits other than pizza and beer. No training. Eveyone spends there working lives on Skype rather than speaking face to face. Poor salary. Zero investment in new technologys (i mean, these guys work in the stone age rather than spend a penny on improvement). Staff leaving, interviewing and arriving weekly sometimes even daily! This company must turn over more staff than McDonalds. Various other cons i cannot post, but lets just say this company is on the brink of disaster at all times. Do yourself a favour and stay away from this place, if you've been offered a job i would decline it and find somewhere better. Advice to Management Train your staff instead of sacking them.. Or at least vet them properly during interview stages instead of just hiring them then sacking them when you see there not suitable.. Were people with mortgages and bills, not \"try before you buy\" objects.", "rating": 1, "pros": "Pizza day, beer day is about all they offer.", "cons": "No benefits other than pizza and beer. No training. Eveyone spends there working lives on Skype rather than speaking face to face. Poor salary. Zero investment in new technologys (i mean, these guys work in the stone age rather than spend a penny on improvement). Staff leaving, interviewing and arriving weekly sometimes even daily! This company must turn over more staff than McDonalds. Various other cons i cannot post, but lets just say this company is on the brink of disaster at all times. Do yourself a favour and stay away from this place, if you've been offered a job i would decline it and find somewhere better.", "advice": "Train your staff instead of sacking them.. Or at least vet them properly during interview stages instead of just hiring them then sacking them when you see there not suitable.. Were people with mortgages and bills, not \"try before you buy\" objects."}, {"title": "nice people, poor management", "text": "Pros You can meet some great people at gimo Cons rarely paid on time, the company is very incestuous - family driven. Advice to Management treat your staff better", "rating": 3, "pros": "You can meet some great people at gimo", "cons": "rarely paid on time, the company is very incestuous - family driven.", "advice": "treat your staff better"}, {"title": "Interesting company, in many ways", "text": "Pros Gimo has a young workforce. Most people are very clever and have good ideas. Directors (higher management) are open to new initiatives if you know how to 'sell' your plan to them. This means that you can sort of create your own role and develop new skills. Cons Working at Gimo sometimes feels like working in Paris. It's impossible to get promoted if you don't speak French. Offices are cramped and if you're unlucky you won't see any daylight from your desk ( not a lot of windows). Salaries are quite low and there are practically no benefits and no performance reviews. End of year bonuses are based on time keeping and sickness leave. For all projects at Gimo it's always quantity over quality. Advice to Management Stop the short term politics and be careful who you hire for your middle management (product managers, team leaders). Try to get rid of your obsession with time keeping, we are living in the 21th century. Also, appreciate your workforce more by implementing benefits and performance reviews.", "rating": 3, "pros": "Gimo has a young workforce. Most people are very clever and have good ideas. Directors (higher management) are open to new initiatives if you know how to 'sell' your plan to them. This means that you can sort of create your own role and develop new skills.", "cons": "Working at Gimo sometimes feels like working in Paris. It's impossible to get promoted if you don't speak French. Offices are cramped and if you're unlucky you won't see any daylight from your desk ( not a lot of windows).", "advice": "Stop the short term politics and be careful who you hire for your middle management (product managers, team leaders). Try to get rid of your obsession with time keeping, we are living in the 21th century. Also, appreciate your workforce more by implementing benefits and performance reviews."}, {"title": "If you want to learn how to micromanage come to GIMO that's all you get in this company", "text": "Pros The pros in GIMO are very few unfortunately, great colleagues, central location, free pizza every last fri of the month but thats about it. Cons GIMO has a family business orientation, top management are really good in micromanaging also not understanding the basic of their main product which is gambling not marketing, language barrier is also a problem as few member of senior management do not speak english, there is no support whatsoever from the HR department in fact is quite the opposite, the HR management has the habit of invading private life in the form of checking your social networking activities and what you do outside working hours, in GIMO there is a complete lack of training, communication is broken due to non existent structure, positions get changed depending on the mood of the management not based on actual skills and/or knowledge, the company is still operating thanks to the fact that the nature of the business is self sufficient but as the decisions are very poor it is a place to avoid as it could collapse at any time. Advice to Management The advice I would give to top management is to vacate the offices and employ skilled top personnel to lead the company in a decent manner.", "rating": 1, "pros": "The pros in GIMO are very few unfortunately, great colleagues, central location, free pizza every last fri of the month but thats about it.", "cons": "GIMO has a family business orientation, top management are really good in micromanaging also not understanding the basic of their main product which is gambling not marketing, language barrier is also a problem as few member of senior management do not speak english, there is no support whatsoever from the HR department in fact is quite the opposite, the HR management has the habit of invading private life in the form of checking your social networking activities and what you do outside working hours, in GIMO there is a complete lack of training, communication is broken due to non existent structure, positions get changed depending on the mood of the management not based on actual skills and/or knowledge, the company is still operating thanks to the fact that the nature of the business is self sufficient but as the decisions are very poor it is a place to avoid as it could collapse at any time.", "advice": "The advice I would give to top management is to vacate the offices and employ skilled top personnel to lead the company in a decent manner."}, {"title": "Web developer briefly employed at comany that specialises in employing people briefly.", "text": "Pros Friendly and diverse workforce. Central location just off \"Silicon roundabout\". Easy to get in. Some staff have stayed for as much as a year. Cons This company runs a number of gambling websites. The pay is relatively low for the software industry, as are the technical standards (the test I took as apart of my interview was about the easiest I have ever done).. Many employees see this as a springboard to a career rather than a long term option. GIMO use an in-house code MVC framework, written by someone long since departed, which is very buggy and badly documented. There is no discernible version control, and most other SDLC practices are also absent. Senior technical staff are marked out by their ability to steer their way through the CMS's pitfalls and firefight effectively, rather than innovation or good practice.Spending a long time in a company like this could actually damage a developer's prospects due to lack of exposure to good practice. The corporate culture is a bit peculiar; they seem to know they are a bit crap, but don't want to admit it. The guy I was replacing, who was leaving after the usual 6 months , was forbidden to discuss his departure in any way. Working practices are rather old fashioned,with 9 o clock starts, no mobile phones during work hours, and no malarkey about table football or the like. That may or may not be a con according to taste. Advice to Management Aim for staff retention. Fix the CMS.", "rating": 3, "pros": "Friendly and diverse workforce. Central location just off \"Silicon roundabout\". Easy to get in. Some staff have stayed for as much as a year.", "cons": "This company runs a number of gambling websites.", "advice": "Aim for staff retention. Fix the CMS."}]