[{"title": "Very entrepreneurial, great global culture", "text": "Pros gispa has a highly diverse team and stellar, focused management. If you thrive in a high growth environment and a place that honors multiple nationalities, this is the place for you. Cons Global offices with HQ in Berlin, therefore fiscally conservative. Advice to Management \"Americanize\" benefits program.", "rating": 5, "pros": "gispa has a highly diverse team and stellar, focused management. If you thrive in a high growth environment and a place that honors multiple nationalities, this is the place for you.", "cons": "Global offices with HQ in Berlin, therefore fiscally conservative.", "advice": "\"Americanize\" benefits program."}, {"title": "Senior Director", "text": "Pros A great company with a clear strategy of how to continue developing within the AdTech industry and becoming a power-house and full-stack solution. Cons The company is extremely global with offices around the world, something that requires a lot of flexibility and adjustment to working with people from different cultures, backgrounds and time-zones. If this is something you don't \"attract\" to, Glispa might not be the right place for you.", "rating": 5, "pros": "A great company with a clear strategy of how to continue developing within the AdTech industry and becoming a power-house and full-stack solution.", "cons": "The company is extremely global with offices around the world, something that requires a lot of flexibility and adjustment to working with people from different cultures, backgrounds and time-zones. If this is something you don't \"attract\" to, Glispa might not be the right place for you.", "advice": null}, {"title": "Super serious company with great people and vision", "text": "Pros Good people A lot of professionals Vision to lead Cons I don't see any real cons", "rating": 5, "pros": "Good people", "cons": "I don't see any real cons", "advice": null}, {"title": "Best people I've ever worked with, fast paced , great culture", "text": "Pros Best people I've ever worked with, fast paced , great culture Cons Maybe too dynamic, many changes within short period. You should get used to it", "rating": 5, "pros": "Best people I've ever worked with, fast paced , great culture", "cons": "Maybe too dynamic, many changes within short period. You should get used to it", "advice": null}, {"title": "Great people", "text": "Pros Good working atmosphere and offices. Cons Overall lack of people management and direction.", "rating": 3, "pros": "Good working atmosphere and offices.", "cons": "Overall lack of people management and direction.", "advice": null}, {"title": "It was a mistake", "text": "Pros Very good HR support to get you started in Germany. Drinks on Friday and good company parties. German breakfast is provided on Monday mornings. Cons Processes in finance are a joke. If you ever worked with SAP don't come to this company. They have 4 or 5 systems that you work with. Everything is very manual literally moving invoices from one tray to another. Weird working hours - 9am to 6pm with an hour lunch. Quite often you are required to stay longer hours. Not the best atmosphere in the company. This company might only be good for the very start of your career.", "rating": 3, "pros": "Very good HR support to get you started in Germany.", "cons": "Processes in finance are a joke. If you ever worked with SAP don't come to this company. They have 4 or 5 systems that you work with. Everything is very manual literally moving invoices from one tray to another.", "advice": null}, {"title": "If you are young ...", "text": "Pros and you don't have high expectations in staying long it's a perfect start in the world of ad management in Berlin. Cons ... but if you want to do serious business don't expect too much support. Advice to Management Be honest to people, be fair and respect different views.", "rating": 3, "pros": "and you don't have high expectations in staying long it's a perfect start in the world of ad management in Berlin.", "cons": "... but if you want to do serious business don't expect too much support.", "advice": "Be honest to people, be fair and respect different views."}, {"title": "Insecure workplace", "text": "Pros Great infrastructure. Lovely support from HR and IT service team. Well-known in the industry. Solid international working environment. Number and sale-driven. Cons Insecure young senior and management team. Lots of hierarchy and office politics. Important decisions and changes are made without taking employees into consideration. Advice to Management Value the people. Let's aim to nurture growth rather than burning bridges - the industry is really small.", "rating": 3, "pros": "Great infrastructure. Lovely support from HR and IT service team. Well-known in the industry. Solid international working environment. Number and sale-driven.", "cons": "Insecure young senior and management team. Lots of hierarchy and office politics. Important decisions and changes are made without taking employees into consideration.", "advice": "Value the people. Let's aim to nurture growth rather than burning bridges - the industry is really small."}, {"title": "Wouldn't want to work there", "text": "Pros Somehow this organisation seems to attract really great people! Cons Everything is just chaos behind the scenes. Joining in an intro level you won't realise all issues at first, but you will feel tensions after just a few months. If you understand what management goes through you understand that there are no coherence, vision or strategy. Just look at how many C-Levels either got fired, left or picked up by others in the industry. Advice to Management Get expert help from outside, stop running your business like a kindergarten and appoint a board of directors to supervise and advice an externally appointed CEO.", "rating": 1, "pros": "Somehow this organisation seems to attract really great people!", "cons": "Everything is just chaos behind the scenes. Joining in an intro level you won't realise all issues at first, but you will feel tensions after just a few months. If you understand what management goes through you understand that there are no coherence, vision or strategy. Just look at how many C-Levels either got fired, left or picked up by others in the industry.", "advice": "Get expert help from outside, stop running your business like a kindergarten and appoint a board of directors to supervise and advice an externally appointed CEO."}, {"title": "Sr. Account manager", "text": "Pros Fair company, good salary, possibility to grow Cons New management team, products available", "rating": 5, "pros": "Fair company, good salary, possibility to grow", "cons": "New management team, products available", "advice": null}, {"title": "Looks great from outside but most employees are unhappy", "text": "Pros International environment, professionalism, nice parties and the people (most of them already left), really cool office and a good learning experience Cons Management continuously changing, really bad turnover rate, unequal opportunities some might enjoy a lot of travels whereas some don't get anything. It all depends on who your manager is or which dept you're working for. A lot of top down decisions are hurting the people and there is a lot of unease. Advice to Management Transparency. It's not only about recruiting but also ensuring employee happiness in the long run, talk to your people.", "rating": 3, "pros": "International environment, professionalism, nice parties and the people (most of them already left), really cool office and a good learning experience", "cons": "Management continuously changing, really bad turnover rate, unequal opportunities some might enjoy a lot of travels whereas some don't get anything. It all depends on who your manager is or which dept you're working for. A lot of top down decisions are hurting the people and there is a lot of unease.", "advice": "Transparency. It's not only about recruiting but also ensuring employee happiness in the long run, talk to your people."}, {"title": "Dead end for IT", "text": "Pros The HR department is really great There are wonderful people working and doing a great job The parties are nice The tech stack is modern and there is not much legacy software to deal with anymore Cons The company can be divided in two sides: business and tech. For the business department everything looks great. Not so much for the tech department The management always change their mind about everything. Months are spent developing features that are going to be eventually discarded. There is a very clear hierarchy, and your opinions only count if you have been in the company for a long time. Different than the business department, there is absolutely NO recognition for the tech department. That may be the reason why half of the tech department left in the past 5 months. The turnover rate is HUGE. Advice to Management Have an open communication with everyone, don't listen only to the \"leaders\". Acknowledge people that have been doing great work and they will feel more inclined to continue doing it. Ignore it and the good employees will continue to leave the company.", "rating": 3, "pros": "The HR department is really great", "cons": "The company can be divided in two sides: business and tech. For the business department everything looks great. Not so much for the tech department", "advice": "Have an open communication with everyone, don't listen only to the \"leaders\"."}, {"title": "Accountant", "text": "Pros good people, great environment, good working life balance, Cons managment , location, working hours, overtime", "rating": 3, "pros": "good people, great environment, good working life balance,", "cons": "managment , location, working hours, overtime", "advice": null}, {"title": "The good kind of crazy", "text": "Pros moving fast, best people I've ever worked with, no boundaries culture - anyone can make an impact as long as they come prepared to the table Cons Not the best place for people who think small Advice to Management Share even more with everyone", "rating": 5, "pros": "moving fast, best people I've ever worked with, no boundaries culture - anyone can make an impact as long as they come prepared to the table", "cons": "Not the best place for people who think small", "advice": "Share even more with everyone"}, {"title": "Ok", "text": "Pros Stability, safety, allowed to take initiatives Cons Focus too much on title and less on product Not clear strategy or ownership Non-transparent promotions", "rating": 3, "pros": "Stability, safety, allowed to take initiatives", "cons": "Focus too much on title and less on product", "advice": null}, {"title": "IT specialists keep away!", "text": "Pros Nice office, very professional and helpful HR Cons 1. IT department and Business department are not aligned with the same goals 2. There is no transparent training budget. You need to ask a favor from the company to go to the course or to the conference. 3. There is no definition of career/development path. 4. Most important!!! There is no recognition to the IT specialists for doing a highly professional job Advice to Management Take a personal responsibility for the technical projects faults and many good engineers drop out last time as a result of the lack of basic management skills.", "rating": 1, "pros": "Nice office, very professional and helpful HR", "cons": "1. IT department and Business department are not aligned with the same goals", "advice": "Take a personal responsibility for the technical projects faults and many good engineers drop out last time as a result of the lack of basic management skills."}, {"title": "Good place to work!", "text": "Pros Nice colleagues, interesting tasks, free fruits and drinks everyday, periodic team events/works/afterwork drinks, open space, easy to communicate Cons Sometimes the daily work can be a little bit annoying Advice to Management Very nice people, keen on listening to the staff", "rating": 5, "pros": "Nice colleagues, interesting tasks, free fruits and drinks everyday, periodic team events/works/afterwork drinks, open space, easy to communicate", "cons": "Sometimes the daily work can be a little bit annoying", "advice": "Very nice people, keen on listening to the staff"}, {"title": "VP Performance Marketing", "text": "Pros Great ambiance within international global active company. Super colleagues, great fun Cons too hot in summer due to lack of air conditionning Advice to Management move", "rating": 5, "pros": "Great ambiance within international global active company. Super colleagues, great fun", "cons": "too hot in summer due to lack of air conditionning", "advice": "move"}, {"title": "Experience depends on what team you join", "text": "Pros - Great company culture: team building activities, free yoga/fitness classes, fruits and Friday after work drinks; - Beautiful dog friendly office; - Some great people; - For IT teams: you are a well respected, but some teams had to shift focus from actual developer job to fixing bugs and errors. Cons Overall: - High turnover rate; - Lack of transparency. Concerns some teams only: - Poor senior management; - Stressful atmosphere: pressure from senior management and competition among and within teams; - High turnover creates lack of knowledgeable staff, hence there is a lot of work of figuring everything on your own; - Low salaries; - A lot of manual \"dummy\" work; - Culture of ignoring achievements of great employees (unless they are in a sales team) and promoting minions. Advice to Management - Appreciate great employees and it will be paid back; - Be more collaborative and open to discussion and feedback.", "rating": 3, "pros": "- Great company culture: team building activities, free yoga/fitness classes, fruits and Friday after work drinks;", "cons": "Overall:", "advice": "- Appreciate great employees and it will be paid back;"}, {"title": "Growing company", "text": "Pros Growing and young company, cool working environment Cons High employee turnover rate", "rating": 5, "pros": "Growing and young company, cool working environment", "cons": "High employee turnover rate", "advice": null}, {"title": "worse experience of my life", "text": "Pros international environment, pretty fair compensation Cons no leadership no communication the most basic tools to perform the work which leads to a waste of time Advice to Management to really evaluate some leading positions", "rating": 1, "pros": "international environment, pretty fair compensation", "cons": "no leadership", "advice": "to really evaluate some leading positions"}, {"title": "Just Awesome", "text": "Pros Glispa is an awesome company, great people everywhere including HR. A company that lives up to agile workflows, There is SCRUM (and not jus ta bit, but REAL SCRUM) and Kanban everywhere, even in the operations team. The IT Department is doing an perfect job, i never worked in a company before were IT was working so flawless, from equipment to network to helpdesk inquiries, everything simply works, also free choice of Windows, Mac or Linux and Equipment. Free Beer every Friday, alot of Gadgets (Screens and Playstations everywhere!), Pingpong area, free drinks and snacks, free breakfeast every monday and you can stop by at your supervisors ANY time, no closed doors. Cons Bad parking situation and it is quite crowded, seems to have too many employes but not enough space available. Some rapid changes coming every few months, rapid growth brings problems, too many products not well enough connected. Hard process for getting into the company, they rip you apart on skill tests, especially in IT. Advice to Management Communicate more to lower management and normal employes, be more visible", "rating": 5, "pros": "Glispa is an awesome company, great people everywhere including HR. A company that lives up to agile workflows, There is SCRUM (and not jus ta bit, but REAL SCRUM) and Kanban everywhere, even in the operations team. The IT Department is doing an perfect job, i never worked in a company before were IT was working so flawless, from equipment to network to helpdesk inquiries, everything simply works, also free choice of Windows, Mac or Linux and Equipment.", "cons": "Bad parking situation and it is quite crowded, seems to have too many employes but not enough space available. Some rapid changes coming every few months, rapid growth brings problems, too many products not well enough connected. Hard process for getting into the company, they rip you apart on skill tests, especially in IT.", "advice": "Communicate more to lower management and normal employes, be more visible"}, {"title": "Great company culture", "text": "Pros My brief stay with Glispa showed me how scaling tech departments can be done right, particularly in terms of company and team culture. The atmosphere is very pleasant and supportive. Everyone is committed to knowledge sharing but also knows how to kick back and enjoy. Employees can also rely on ample support from HR and admin. Cons Due to the speedy growth of the tech department, there remains few growing pains and perhaps more emphasis on awareness of other teams' products and priorities might help bridge some gaps among the teams.", "rating": 5, "pros": "My brief stay with Glispa showed me how scaling tech departments can be done right, particularly in terms of company and team culture. The atmosphere is very pleasant and supportive. Everyone is committed to knowledge sharing but also knows how to kick back and enjoy. Employees can also rely on ample support from HR and admin.", "cons": "Due to the speedy growth of the tech department, there remains few growing pains and perhaps more emphasis on awareness of other teams' products and priorities might help bridge some gaps among the teams.", "advice": null}, {"title": "Four stars industry-wise, three stars otherwise", "text": "Pros Motivated colleagues, a truly international atmosphere, strong IT team (great equipment, software works), and a helpful and professional HR team. Smooth relocation process for those arriving from abroad or other parts of Germany. A great office space. Cons Limited communication, a fuzzy company vision, a lack of trust and unity, a combative management team. Most teams are their own islands. Get ready to get grilled during the application process, but end up working at way below your ability and potential.", "rating": 3, "pros": "Motivated colleagues, a truly international atmosphere, strong IT team (great equipment, software works), and a helpful and professional HR team. Smooth relocation process for those arriving from abroad or other parts of Germany. A great office space.", "cons": "Limited communication, a fuzzy company vision, a lack of trust and unity, a combative management team. Most teams are their own islands.", "advice": null}, {"title": "Better than any business school to learn and progress", "text": "Pros Great workplace for diversity. You can build your own impact, and to bring the best of yourself, to grow within and with the company. Personal and team success are highly valued. Cons It might take some time to get the reward of your effort in terms of salary impact. Advice to Management Keep it up! And build an amazing success story", "rating": 5, "pros": "Great workplace for diversity. You can build your own impact, and to bring the best of yourself, to grow within and with the company. Personal and team success are highly valued.", "cons": "It might take some time to get the reward of your effort in terms of salary impact.", "advice": "Keep it up! And build an amazing success story"}, {"title": "Controller", "text": "Pros Great company culture and environment. Strives for excellence in everything they do. Cons No counter comments to make at this point", "rating": 5, "pros": "Great company culture and environment. Strives for excellence in everything they do.", "cons": "No counter comments to make at this point", "advice": null}, {"title": "SEA manager", "text": "Pros Really good team atmosphere, young environment, many benefits to the employees. Cons As affiliate/agency company the rhythm is quite stressful and probably there are many people who are not willing to endure it. Advice to Management Keep motivating and show new career perspectives to your employees to make their job more engaging.", "rating": 5, "pros": "Really good team atmosphere, young environment, many benefits to the employees.", "cons": "As affiliate/agency company the rhythm is quite stressful and probably there are many people who are not willing to endure it.", "advice": "Keep motivating and show new career perspectives to your employees to make their job more engaging."}, {"title": "The amount of people leaving the company is shocking", "text": "Pros One of the the bigger advertising company in Berlin. The ad sales team has a great top leader. CTO is also a smart and capable person. Young employees. Cons Business makes money so it will stay alive. But it is hitting a wall to be competitive in the advertising industry. New products are being released but they are a copy of what competitors do. Company talks about going IPO but there is no stock option so employee can't benefit.", "rating": 3, "pros": "One of the the bigger advertising company in Berlin. The ad sales team has a great top leader. CTO is also a smart and capable person. Young employees.", "cons": "Business makes money so it will stay alive. But it is hitting a wall to be competitive in the advertising industry. New products are being released but they are a copy of what competitors do. Company talks about going IPO but there is no stock option so employee can't benefit.", "advice": null}, {"title": "Great company environment and career opportunities!", "text": "Pros - Multicultural team across 6 offices worldwide; - Financially stable and fast growing; - Gives you authority in project management; - Fast on decision making; - Good Work/Life balance; - Big room to grow paths in your career. Cons - Internal communication and knowledge share to improve; - Employees to get better involved in regards to company´s overall strategy and decisions. Advice to Management Mostly under development: - Have a clear career&development plan to all employees; - improve communication internally and across international offices", "rating": 5, "pros": "- Multicultural team across 6 offices worldwide;", "cons": "- Internal communication and knowledge share to improve;", "advice": "Mostly under development:"}, {"title": "The glispa team is world class", "text": "Pros The glispa team is world class. Working side by side my colleagues has not only be an absolute pleasure, but has also presented an immense opportunity to learn from so many capable individuals. The culture of the company is ambitious. Those who welcome challenges and embrace team work and doing high quality work excel in the company. I have personally benefited with my manager proactively presenting me with promotions and salary increases in recognition of my contribution. Cons Things can move quickly. Internal communication can struggle to move at the same pace. I know that this is a constant topic that management recognizes and attempts to improve. I have seen multiple communication improvement initiatives attempted which does signify that the staff are listened to.", "rating": 5, "pros": "The glispa team is world class. Working side by side my colleagues has not only be an absolute pleasure, but has also presented an immense opportunity to learn from so many capable individuals. The culture of the company is ambitious. Those who welcome challenges and embrace team work and doing high quality work excel in the company. I have personally benefited with my manager proactively presenting me with promotions and salary increases in recognition of my contribution.", "cons": "Things can move quickly. Internal communication can struggle to move at the same pace. I know that this is a constant topic that management recognizes and attempts to improve. I have seen multiple communication improvement initiatives attempted which does signify that the staff are listened to.", "advice": null}, {"title": "Great company to work for", "text": "Pros Glispa values transparency very highly, meaning that we all know what's going on at all times. Since the company had been self-financing since the beginning, it is on a stable growth path while still offering a lot of perks and benefits. You get a large range of different responsibilities and are involved from the beginning in small teams which can make decisions very quickly. The atmosphere is great, very international and everyone is very friendly! Really happy so far! Cons Salaries are not quite as high as some other startups in Berlin and we just have the standard number of days off. Advice to Management I have no direct advice at this point, except to say keep up the focus transparency and maybe consider investing more in employee development in terms of seminars etc.", "rating": 5, "pros": "Glispa values transparency very highly, meaning that we all know what's going on at all times. Since the company had been self-financing since the beginning, it is on a stable growth path while still offering a lot of perks and benefits. You get a large range of different responsibilities and are involved from the beginning in small teams which can make decisions very quickly. The atmosphere is great, very international and everyone is very friendly! Really happy so far!", "cons": "Salaries are not quite as high as some other startups in Berlin and we just have the standard number of days off.", "advice": "I have no direct advice at this point, except to say keep up the focus transparency and maybe consider investing more in employee development in terms of seminars etc."}, {"title": "Very exciting ride in fast growing, yet sustainable company!", "text": "Pros Company is providing a lot of room to grow and market has many interesting opportunities. Very international people and office locations. Strong brand clients. Advanced software, big and very agile tech team. Great culture and leadership, little to no politics. Very open/transparent! Cons Due to fast changing environment, people need to be flexible regarding their work focus. Priorities will change much quicker than in corporate environments. Advice to Management More communication of priority changes to all employees.", "rating": 5, "pros": "Company is providing a lot of room to grow and market has many interesting opportunities. Very international people and office locations. Strong brand clients. Advanced software, big and very agile tech team. Great culture and leadership, little to no politics. Very open/transparent!", "cons": "Due to fast changing environment, people need to be flexible regarding their work focus. Priorities will change much quicker than in corporate environments.", "advice": "More communication of priority changes to all employees."}, {"title": "Organized, amazing onboarding, truly agile", "text": "Pros - agile development method coupled with scrum performance / task management - open lines of communication, no 'closed door' policy - realistic work expectations but still very challenging - German lessons, table tennis, costume / dress up parties, free beers/wine every Friday - cereal, fruits, juices, club mate all free all the time Cons - free beers every Friday means I'm not getting rid of my beer belly any time soon Advice to Management Keep those retrospectives alive! They are an excellent part of team and expectations management and foster a caring, professional, and friendly work culture.", "rating": 5, "pros": "- agile development method coupled with scrum performance / task management", "cons": "- free beers every Friday means I'm not getting rid of my beer belly any time soon", "advice": "Keep those retrospectives alive! They are an excellent part of team and expectations management and foster a caring, professional, and friendly work culture."}, {"title": "Great place to work", "text": "Pros I work longer than 1 year at glispa and I am very happy to work at glispa. People are friendly, the company is very flexible, and the working atmosphere is good. Company is growing fast and so are the people. Cons People who are against changes will not like to work at glispa. Advice to Management Very competent management and excellent mentorship", "rating": 5, "pros": "I work longer than 1 year at glispa and I am very happy to work at glispa. People are friendly, the company is very flexible, and the working atmosphere is good. Company is growing fast and so are the people.", "cons": "People who are against changes will not like to work at glispa.", "advice": "Very competent management and excellent mentorship"}, {"title": "Great place to work", "text": "Pros Office, co-workers, perks, company events - glispa has an amazing work atmosphere. Cons Not much to complain about. Advice to Management Focus on how you are going to maintain the existing culture as you grow.", "rating": 5, "pros": "Office, co-workers, perks, company events - glispa has an amazing work atmosphere.", "cons": "Not much to complain about.", "advice": "Focus on how you are going to maintain the existing culture as you grow."}, {"title": "Fantastic company", "text": "Pros It is great to be involved in such a great organization with fantastic team cohesiveness. Passion for your job starts from the top and is evident across the company. While personal goals are set, reaching your goals is a team effort. Your colleagues are some of the brightest you will meet in this industry. The company celebrates its people, diversity (40 nationalities represented in glispa, and successes. Gary's vision is felt across the organization and has the entire company's buy-in to help realize it. Cons it's a high performance company. Keep up.", "rating": 5, "pros": "It is great to be involved in such a great organization with fantastic team cohesiveness. Passion for your job starts from the top and is evident across the company. While personal goals are set, reaching your goals is a team effort. Your colleagues are some of the brightest you will meet in this industry.", "cons": "it's a high performance company. Keep up.", "advice": null}, {"title": "Great Company", "text": "Pros -Engaged leadership team that provides high degree of transparency -Amazing HR team. Smooth recruiting process from start to finish -Lots of opportunities to show your skills -Great culture and office environment! Cons Everything's been great so far!", "rating": 5, "pros": "-Engaged leadership team that provides high degree of transparency", "cons": "Everything's been great so far!", "advice": null}, {"title": "Great culture!", "text": "Pros Great place to work, learn and add value to Great people from all over the world Cons Sometimes changes happen to fast Need more lounge areas Advice to Management Keep investing in young talent", "rating": 5, "pros": "Great place to work, learn and add value to", "cons": "Sometimes changes happen to fast", "advice": "Keep investing in young talent"}, {"title": "Amazing team but often inflexible guidelines", "text": "Pros +Solid business model and revenue streams +Fair salary for living in Berlin +Incredibly internationally diverse team (~120 people from 35+ nations) +Legendary company-wide events and quarterly team events Cons +Very little flexibility in regards to working hours (leaving before 18:30 is discouraged) +No flexibility in regards to working location (remote work only possible when sick) +New office near Gesundbrunnen isn't close to the Berlin action +Windows only, no Macs +Titles only loosely connected to actual function (z.B. \"Senior Global Director of...\", \"Head of...\", \"Senior this\", \"Associate Director of that\") +Very cutthroat culture for trainees/interns with LOTS of turnover outside of the highest levels of management", "rating": 5, "pros": "+Solid business model and revenue streams", "cons": "+Very little flexibility in regards to working hours (leaving before 18:30 is discouraged)", "advice": null}, {"title": "account manager", "text": "Pros well organized company, established, has a good name in the industry Cons no career plan, can be very cheap with compensation, bringing managers from outside the organization all the time", "rating": 3, "pros": "well organized company, established, has a good name in the industry", "cons": "no career plan, can be very cheap with compensation, bringing managers from outside the organization all the time", "advice": null}, {"title": "Great place to develop and strive for excellence", "text": "Pros Opportunity to develop personally and enhance knowledge in business, a large number of motivated and qualified colleagues, work in international environment, nice open office, great benefits like coffee, breakfast, quartely team events, Friday gsocial with drinks and music Cons Company wide objectives could be announced more open, not enough meeting rooms (but office move is coming, so this should improve significant)", "rating": 5, "pros": "Opportunity to develop personally and enhance knowledge in business, a large number of motivated and qualified colleagues, work in international environment, nice open office, great benefits like coffee, breakfast, quartely team events, Friday gsocial with drinks and music", "cons": "Company wide objectives could be announced more open, not enough meeting rooms (but office move is coming, so this should improve significant)", "advice": null}, {"title": "keep it up!", "text": "Pros Very dynamic & international environment Great people good benefits Cons no parking spots no kitchen or propper lunch area, buying lunch is very expensive in Mitte Advice to Management Keep developing the internal talents", "rating": 5, "pros": "Very dynamic & international environment", "cons": "no parking spots", "advice": "Keep developing the internal talents"}, {"title": "makes you want to be your best", "text": "Pros very intelligent and engaged workforce, colleagues very helpful, excellence makes you want to do your best, really open approachable management, excellent communication activities of senior management, very sociable culture, high degree of internationalism Cons environment is very fast paced, not for everyone - excellence is the norm and the expectation, do not expect a well done just for doing a \"good\" job. Advice to Management keep it up!", "rating": 5, "pros": "very intelligent and engaged workforce, colleagues very helpful, excellence makes you want to do your best, really open approachable management, excellent communication activities of senior management, very sociable culture, high degree of internationalism", "cons": "environment is very fast paced, not for everyone - excellence is the norm and the expectation, do not expect a well done just for doing a \"good\" job.", "advice": "keep it up!"}, {"title": "Dynamic, flexible, and open workplace", "text": "Pros -Nice people hanging up together after work -fast moving, and open to react on your ideas -opportunities for young ambitious people -understanding and easy going management team -international team, and you just be curious -company sharing the personality of Berlin city Cons More fruits and more changes on breakfast. More workshops to encourage ideas sharing and mindset communication.", "rating": 5, "pros": "-Nice people hanging up together after work", "cons": "More fruits and more changes on breakfast.", "advice": null}, {"title": "Wait.. What are we doing now?", "text": "Pros Salary was fair Some amazing colleagues good location for Berlin the HR staff during my time was wonderful. Cons Revolving Door of employees Serious identity crisis as a brand. Upper Management in constant chaos Serious lack of knowledge at Managerial level. Mislead during in the interview about what the company actually does, and is capable of doing Direct Boss was completely wrong to put in his position. No expertise or Ability or the ability to understand the market Terrible hours of operation did I mention employee turnover... Also maybe the first words to describe some of your VP`s should not be and I quote CRAZY. Advice to Management I have none, it will not matter either way.", "rating": 3, "pros": "Salary was fair", "cons": "Revolving Door of employees", "advice": "I have none, it will not matter either way."}, {"title": "Vorbildliches Unternehmen", "text": "Pros Die Glispa GmbH ist wirklich ein vorbildliches Unternehmen. Sie wissen genau, dass ihre Mitarbeiter die wichtigste Resource des Unternehmens ist und so wird man auch behandelt. Angefangen vom Frühstück welches angeboten wird, über diverse Events, Vergünstigungen und einem Arbeitsplatz der sich sehen lassen kann. Cons Das Wachstum der letzten Jahre durch Akquisitionen und organischen Mitarbeiterzuwachs hat einige wenige Spuren hinterlassen (Prozesse müssen noch skalierbarer werden, mehr Automatisierung etc.) Alles auf der To-Do Liste, von daher: Weiter so!", "rating": 5, "pros": "Die Glispa GmbH ist wirklich ein vorbildliches Unternehmen. Sie wissen genau, dass ihre Mitarbeiter die wichtigste Resource des Unternehmens ist und so wird man auch behandelt. Angefangen vom Frühstück welches angeboten wird, über diverse Events, Vergünstigungen und einem Arbeitsplatz der sich sehen lassen kann.", "cons": "Das Wachstum der letzten Jahre durch Akquisitionen und organischen Mitarbeiterzuwachs hat einige wenige Spuren hinterlassen (Prozesse müssen noch skalierbarer werden, mehr Automatisierung etc.) Alles auf der To-Do Liste, von daher: Weiter so!", "advice": null}, {"title": "Macht Spaß und ist international aufgestellt", "text": "Pros Sehr angenehmes Arbeitsklima in einem multi nationalen Umfeld. Es gibt viele Perks für Mitarbeiter, welche einem den Arbeitsalltag angenehmer gestallten. Cons Es gibt keine direkten negativen Punkte. Etwas flexible Arbeitsmöglichkeiten und -zeiten wären schön, dass man zB öfter im Homeoffice arbeiten kann.", "rating": 5, "pros": "Sehr angenehmes Arbeitsklima in einem multi nationalen Umfeld. Es gibt viele Perks für Mitarbeiter, welche einem den Arbeitsalltag angenehmer gestallten.", "cons": "Es gibt keine direkten negativen Punkte. Etwas flexible Arbeitsmöglichkeiten und -zeiten wären schön, dass man zB öfter im Homeoffice arbeiten kann.", "advice": null}, {"title": "international, vibrant, great place to work", "text": "Pros - great team spirit - good bonuses - good salary - all in a great city Cons - no parking - no shelter for bikes Advice to Management Keep up the good work", "rating": 5, "pros": "- great team spirit", "cons": "- no parking", "advice": "Keep up the good work"}, {"title": "Nicht das, was ich erwartet habe", "text": "Pros Recht anständige Bezahlung Schöne Lage, angenehmes Betriebsklima Freundliche Leute Fairly good pay nice office location and atmosphere Nice people Cons Keine echte Konzentration auf das, was getan werden musste. Log darüber, worum es bei der Stelle in erster Linie ging. In ungeahntem Ausmaß bis in die kleinste Kleinigkeit gegängelt No real focus on what needed to be done. Lied about what the position initially was Micro managed at an unprecedented level Advice to Management Das obere Management ist großartig, aber im Bereich Teamleiter braucht es Verbesserungen. Das, was sie dem oberen Management und den Vorsitzenden über ihre Tätigkeit erzählen, entspricht nicht dem, was sie tatsächlich tun. Upper management is great but the team leads are the ones who need improvement. What they say they are doing to upper management and VP's is not what they are actually doing.", "rating": 3, "pros": "Recht anständige Bezahlung", "cons": "Keine echte Konzentration auf das, was getan werden musste.", "advice": "Das obere Management ist großartig, aber im Bereich Teamleiter braucht es Verbesserungen. Das, was sie dem oberen Management und den Vorsitzenden über ihre Tätigkeit erzählen, entspricht nicht dem, was sie tatsächlich tun."}, {"title": "Traurig zu sehen, welchen Weg das Unternehmen genommen hat", "text": "Pros Das Unternehmen hat interessante Menschen aus verschiedenen Kulturen eingestellt. Großartiger Bürostandort. The company hired interesting people from various cultures. Great office location. Cons Mehr als 30 Personen haben das Unternehmen seit Anfang des Jahres aus einem bestimmten Grund verlassen. Leider gibt es keine klare Strategie für die Zukunft. Rigide Arbeitszeiten. Alles verschlechtert sich und Kunden können das sehen. Kein Teamgeist und sehr wenig Motivation aus der Verwaltung. Mitarbeiter sind auf der Suche nach einem Ausweg. More than 30 people left the company since the beginning of the year for a reason. Unfortunately, there is no clear strategy for the future. Stiff working hours. Everything is deteriorating and clients can see that. No team spirit and very little motivation coming from the management. Employees are looking for a way out.", "rating": 3, "pros": "Das Unternehmen hat interessante Menschen aus verschiedenen Kulturen eingestellt. Großartiger Bürostandort.", "cons": "Mehr als 30 Personen haben das Unternehmen seit Anfang des Jahres aus einem bestimmten Grund verlassen. Leider gibt es keine klare Strategie für die Zukunft. Rigide Arbeitszeiten. Alles verschlechtert sich und Kunden können das sehen. Kein Teamgeist und sehr wenig Motivation aus der Verwaltung. Mitarbeiter sind auf der Suche nach einem Ausweg.", "advice": null}, {"title": "Hmm", "text": "Pros dynamisches Umfeld, mehrere nette Leute dynamic environment, several nice people Cons Die oberste Führungsebene ändert ständig die Richtung und die Entscheidungen sind oft sehr widersprüchlich, Gehalt ist nicht gut, keine guten Möglichkeiten zur Karriereentwicklung etc. top management changes orientation constantly and the decisions are mostly very contradictory, salary isn't good, not good opportunities for career development etc. Advice to Management etwas mehr an die Angestellten denken think of employees a bit more", "rating": 3, "pros": "dynamisches Umfeld, mehrere nette Leute", "cons": "Die oberste Führungsebene ändert ständig die Richtung und die Entscheidungen sind oft sehr widersprüchlich, Gehalt ist nicht gut, keine guten Möglichkeiten zur Karriereentwicklung etc.", "advice": "etwas mehr an die Angestellten denken"}, {"title": "Großartiges Unternehmen mit internationaler Ausrichtung!", "text": "Pros Internationale Umgebung an einem tollen Standort Exzellentes Team, in dem man sich gegenseitig ermutigt und Erfolg belohnt wird Atmosphäre von Vertrauen und Transparenz Karrierefortschrittsplan Gute Zulagen! International environment in a great location Excellent team that encourage each other and reward success Atmosphere of trust and transparency Career progression plan Good perks! Cons Fühlt sich manchmal zu \"familiär\" an Sometimes too much of a \"family feel\"", "rating": 5, "pros": "Internationale Umgebung an einem tollen Standort", "cons": "Fühlt sich manchmal zu \"familiär\" an", "advice": null}]