[{"title": "Great first job out of school", "text": "Pros -Growing company based in London expanding its presence throughout the US. -Rapidly growing team, startup environment -Casual, laid back office -Great work/life balance Cons -No process put in place for the Business Development Coordinator role", "rating": 5, "pros": "-Growing company based in London expanding its presence throughout the US.", "cons": "-No process put in place for the Business Development Coordinator role", "advice": null}, {"title": "good", "text": "Pros good company to work for Cons not paid enough for the time spent", "rating": 3, "pros": "good company to work for", "cons": "not paid enough for the time spent", "advice": null}, {"title": "Great Company", "text": "Pros Lovely people, great working environment Cons There are few cons I have about the poeple I work with. Advice to Management Listening", "rating": 5, "pros": "Lovely people, great working environment", "cons": "There are few cons I have about the poeple I work with.", "advice": "Listening"}, {"title": "Media Executive", "text": "Pros Young work environment, fairly laid back. Not stressful Cons Extremely monotonous, repetitive work. Need to find other ways to help the employees grow.", "rating": 3, "pros": "Young work environment, fairly laid back. Not stressful", "cons": "Extremely monotonous, repetitive work. Need to find other ways to help the employees grow.", "advice": null}, {"title": "A much needed rebuttal....", "text": "Pros I've never been one to hold water with the reviews on Glassdoor, as I had always been under the impression that many of the negative comments were from disgruntled former employees who failed to make a level of impact (be it through lack of interest or not being able to understand why one didn't find success and therefore blaming others). As a current Gorkana employee, it's pretty apparent that the past few negative reviews were conspired through a handful of former employees - who, at least from my view, didn't show much interest in the job or had trouble understanding why they didn't move up the ladder. Three years ago the culture and atmosphere of Gorkana was great, but the company lacked direction and had trouble growing in the US. The \"much maligned\" Managing Director (at least on this site) had a very big hand with getting Gorkana US on a successful track. As with every manager/boss, if you learn how to work for them, you will find success. Over the past two years we've seen the number of clients grow, including the Enterprise business, which has brought on some high-end, blue chip brands as clients (after years of not bringing on any client of global stature). She may be tough to work for, forget a name here and there, or come off as a bit strong willed at times, but the MD absolutely got the job done in getting the Gorkana US office running right. Personally, while I have butted heads with her, I've learned a lot as well and like the track my career is on with Gorkana. With the merger of Cision finally coming to fruition, there is a lot of opportunity for those that remained with Gorkana during that odd period of transition. Yes, it;s difficult to go from that start-up, atmosphere - but in the end those that stuck it out and/or showed a willingness to commit, will find good opportunities for success. Cons The culture has taken a bit of a hit, due to recently being acquired by Cision and in turn a lot of the team has left and were not replaced. A lot of talent and personality was lost, but not much could be done about it - as there were no guarantees that could be made regarding roles during the transition. That being said, management did encourage employees to look for roles and to take advantage of the opportunities that came to them and did not try to stand in the way. Backfilling those roles didn't happen because they couldn't hire somebody to a FT position without being able to guarantee a role more than a few months. The office is tight and cramped, which can make it difficult if you're on a call or just want to put your head down and get some work done. Despite attempts to cancel out the noise, it can be hard to concentrate with all the noise Advice to Management Keep it up. The attempts to regain the sense of culture that was lost with the recent departures is noticed. I'm sure over time it'll return.", "rating": 5, "pros": "I've never been one to hold water with the reviews on Glassdoor, as I had always been under the impression that many of the negative comments were from disgruntled former employees who failed to make a level of impact (be it through lack of interest or not being able to understand why one didn't find success and therefore blaming others).", "cons": "The culture has taken a bit of a hit, due to recently being acquired by Cision and in turn a lot of the team has left and were not replaced. A lot of talent and personality was lost, but not much could be done about it - as there were no guarantees that could be made regarding roles during the transition. That being said, management did encourage employees to look for roles and to take advantage of the opportunities that came to them and did not try to stand in the way.", "advice": "Keep it up. The attempts to regain the sense of culture that was lost with the recent departures is noticed. I'm sure over time it'll return."}, {"title": "Going South", "text": "Pros For a long time it was all about the great people. Easy to get up from your desk to ask co-workers questions, and get valuable opinions. Great benefits. (Was originally a British company) Cons It's now been bought by it's largest competitor in the US, Cision. Many people who helped build the business to be great have left. It's going south quicker than anticipated. Too many unknowns and the new parent company is not handling things smoothly...yet... Advice to Management Don't just say you're listening to your workers...Do it. Implementation of things that were needed took too long. Issues can't be brushed under a rug. Don't give all your attention to one department, because the others will suffer. Then they will complain. At times upper management would seem oblivious to on going issues because they aren't connected enough to the overall business, just what they seem to think counts. Be more genuine. People can smell that something stinks.", "rating": 3, "pros": "For a long time it was all about the great people. Easy to get up from your desk to ask co-workers questions, and get valuable opinions.", "cons": "It's now been bought by it's largest competitor in the US, Cision. Many people who helped build the business to be great have left. It's going south quicker than anticipated. Too many unknowns and the new parent company is not handling things smoothly...yet...", "advice": "Don't just say you're listening to your workers...Do it. Implementation of things that were needed took too long. Issues can't be brushed under a rug."}, {"title": "Media Executive Review -- great experience", "text": "Pros I worked on the Gorkana US team as a Media Executive for about 1 year and it was an all-around positive experience. Worked with an enthusiastic group of people who care about your career goals and are committed to making Gorkana a great experience. Management looks out for career paths of staff. Employees have a chance for their ideas to be heard and hard work is noticed, appreciated and rewarded. Cons Small team and environment, which can be good or bad, depending on your personal", "rating": 5, "pros": "I worked on the Gorkana US team as a Media Executive for about 1 year and it was an all-around positive experience. Worked with an enthusiastic group of people who care about your career goals and are committed to making Gorkana a great experience. Management looks out for career paths of staff. Employees have a chance for their ideas to be heard and hard work is noticed, appreciated and rewarded.", "cons": "Small team and environment, which can be good or bad, depending on your personal", "advice": null}, {"title": "Lots of upside/opportunity", "text": "Pros Lots of opportunities. The US office has been growing its business quickly, with a number of marquee client wins over the past six months. This means the chance to work with some of the best corporate communications teams and agencies in the business. This also means the chance for advancement. Management prefers to promote internally whenever possible, and I have seen many entry level media executives given opportunities in sales, client management, analysis and insights, customer service, HR, marketing, PR, and events. The work in the analysis team in particular is challenging and interesting. The office culture is relaxed, fun-loving and supportive, while being results oriented. Management will challenge you to do your best work, leading to professional growth, and certainly has the best interest of the office in mind. Speaking for the analysis team in particular, I am proud to work with people who are smart, proactive, creative and passionate about providing value and insight to our clients. In fact, last week we received 12 awards at the AMEC International Summit on Measurement, including 2 awards for the US office's global work with UNICEF. Cons The location of the office is great and is open-plan, which is fun and collaborative, however the number of conference rooms can be challenging at times. Advice to Management Continue to be transparent regarding company strategy and direction as Gorkana continues to grow.", "rating": 5, "pros": "Lots of opportunities. The US office has been growing its business quickly, with a number of marquee client wins over the past six months. This means the chance to work with some of the best corporate communications teams and agencies in the business. This also means the chance for advancement. Management prefers to promote internally whenever possible, and I have seen many entry level media executives given opportunities in sales, client management, analysis and insights, customer service, HR, marketing, PR, and events. The work in the analysis team in particular is challenging and interesting. The office culture is relaxed, fun-loving and supportive, while being results oriented. Management will challenge you to do your best work, leading to professional growth, and certainly has the best interest of the office in mind. Speaking for the analysis team in particular, I am proud to work with people who are smart, proactive, creative and passionate about providing value and insight to our clients. In fact, last week we received 12 awards at the AMEC International Summit on Measurement, including 2 awards for the US office's global work with UNICEF.", "cons": "The location of the office is great and is open-plan, which is fun and collaborative, however the number of conference rooms can be challenging at times.", "advice": "Continue to be transparent regarding company strategy and direction as Gorkana continues to grow."}, {"title": "Negative Experience", "text": "Pros It is important to note while reading these reviews whether they are UK or US based. Positive reviews for the UK are not at all reflective of the US and they are two very different offices/cultures/etc. There are no real pros I can think of besides that while I was working there, I was not unemployed. Cons Management (specifically the Managing Director of the US office), low pay, major favoritism, lack of opportunities, extremely high turnover, bad IT. Advice to Management There is not much to say now that Gorkana has been bought by Cision and it is too late to make any real changes. Feedback from employees should have been listened to early on.", "rating": 1, "pros": "It is important to note while reading these reviews whether they are UK or US based. Positive reviews for the UK are not at all reflective of the US and they are two very different offices/cultures/etc.", "cons": "Management (specifically the Managing Director of the US office), low pay, major favoritism, lack of opportunities, extremely high turnover, bad IT.", "advice": "There is not much to say now that Gorkana has been bought by Cision and it is too late to make any real changes. Feedback from employees should have been listened to early on."}, {"title": "Media Executive", "text": "Pros the office is young and friendly free coffee & occasional office parties you don't take your work home with you unless you're in client services Cons Management is irresponsible in many ways. The Managing Director of the US office is a bully who can't hear anything she doesn't want to hear and has an almost pathological need to see a graph with an upward trend. Because she is unreasonable, people often lie to her, sugarcoating results to protect themselves. Pay is also very low in entry-level positions, but you'll have a slightly easier time climbing the ladder if you happen to be born with a y chromosome. Raises and promotions are rewarded with little regard for merit or work ethic. Think you're getting overtime for those swanky events you're attending? Think again. It's a policy to only award two hours of overtime for employees who attend the events, even if you're expected to be there for three hours or more. Or, alternatively, they might just come by your desk the day before an event you've committed yourself to working to tell you that you won't, in fact, be receiving any overtime at all! Surprise! What a joy it is to work for management that flagrantly flouts labor laws with the hope that their entry-level employees are too naive to know it's wrong. Traveling for work?! Yeah, you probably won't get overtime for that either. Will the Managing Director remember your name and your role at the company? Nahhhhh. But she will be upset if you try to remind her. Quiz: When someone quits will they a) hire a replacement or b) make someone do both jobs? Ding, ding! B is correct. Love your coworkers? Don't get attached. They might be gone within the next few weeks. Wondering how to get in touch with HR to address any of these problems? Forget about it! Would they do anything even if you did? Who knows!? What else can I say? Just please think twice before accepting a position here. Advice to Management The turnover rate in the US office should be a clue that something is really, really wrong here. Maybe if people were paid more they'd tolerate the job better.", "rating": 3, "pros": "the office is young and friendly", "cons": "Management is irresponsible in many ways. The Managing Director of the US office is a bully who can't hear anything she doesn't want to hear and has an almost pathological need to see a graph with an upward trend. Because she is unreasonable, people often lie to her, sugarcoating results to protect themselves.", "advice": "The turnover rate in the US office should be a clue that something is really, really wrong here. Maybe if people were paid more they'd tolerate the job better."}, {"title": "Media Executive", "text": "Pros The job is so mind-numbingly easy and boring that it leaves you with lots of free time to do other things while at work. Cons Overall company culture, lack of hr, job, the frequent favoring and promotion of favorites, and the heavy drinking culture.", "rating": 1, "pros": "The job is so mind-numbingly easy and boring that it leaves you with lots of free time to do other things while at work.", "cons": "Overall company culture, lack of hr, job, the frequent favoring and promotion of favorites, and the heavy drinking culture.", "advice": null}, {"title": "Media Executive", "text": "Pros Low-stress. You won't have to take work home. Cons -Management doesn't do a good job of investing in employees, so there's a huge turnover in staff. -Office culture seems more like high school. -The basis for promotions = how well you get along with your managers, not based on experience or professionalism. -The job title also doesn't make sense. It's more of a database entry role so when you look for other jobs, companies question the title based on the responsibilities. Advice to Management Promote better people.", "rating": 1, "pros": "Low-stress. You won't have to take work home.", "cons": "-Management doesn't do a good job of investing in employees, so there's a huge turnover in staff.", "advice": "Promote better people."}, {"title": "Media Executive", "text": "Pros Great first job to have coming out of college Cons Head manager is a malicious boss who does not listen to reason. She belittles employees deciding that ignoring them is the best bet as opposed to speaking with them directly. Advice to Management Gorkana could be successful, without current Manager. She needs to be fired and a new regional manager should be brought in", "rating": 1, "pros": "Great first job to have coming out of college", "cons": "Head manager is a malicious boss who does not listen to reason. She belittles employees deciding that ignoring them is the best bet as opposed to speaking with them directly.", "advice": "Gorkana could be successful, without current Manager. She needs to be fired and a new regional manager should be brought in"}, {"title": "Good Entry Level Job out of College", "text": "Pros Open work environment, fun co-workers, low stress day-to-day responsibilities, great hours Cons Tedious, Monotonous work, no room for growth, low-salary Advice to Management Diversify the work when possible", "rating": 3, "pros": "Open work environment, fun co-workers, low stress day-to-day responsibilities, great hours", "cons": "Tedious, Monotonous work, no room for growth, low-salary", "advice": "Diversify the work when possible"}, {"title": "Great First Job for Anyone Interested in PR/Media", "text": "Pros The work environment of the Gorkana U.S. office is a great setting to work in, especially for professionals seeking a highly innovative, fast-growing company with a start-up feel. The open layout allows for a collaborative environment that connects all teams including research, marketing/events and sales teams in a large open space. This is especially helpful for a growing media/technology company to work together on different initiatives. Also, media executives who are starting out in the research role will be exposed to different fields of work. There is a friendly rapport between all staff at both the U.S. and U.K office which makes it easy to create dialogue and brainstorm ideas. People are also very welcoming, which makes it easy for new staff to get well acclimated to the job. Gorkana also provides ample vacation time, with no inquiries on how you’re spending your day off. It is a definite plus for anyone in the U.S. to be allotted the same amount of holidays as the U.K. office. Compared to other technology companies, especially in New York City, there are opportunities for a good work life balance. Cons The lack of variety in the media executive role, where team members primarily do research based projects, can become monotonous at times. This may discourage many team members who are new to the media/technology industry to stay motivated at work. Because Gorkana prides itself on the quality of its product offerings, it is necessary to incorporate a change in attitude to show the importance of the work each and every media executive does on a day to day basis. Create a rotational program that allows team members to rotate between roles/projects to ensure that each member has the ability to gain exposure to other projects and make the most of their time at Gorkana, however long that may be. Advice to Management Invest in all employees, and trust them! Build moral within colleagues to uncover the value of working at a company that not only has a great work culture, but one that is also interested in employees' personal development. I've come across many great team members both in the U.S. and U.K. teams who are passionate about the work they are doing. Be sure to engage them and increase esprit de corps within the smaller teams.", "rating": 5, "pros": "The work environment of the Gorkana U.S. office is a great setting to work in, especially for professionals seeking a highly innovative, fast-growing company with a start-up feel. The open layout allows for a collaborative environment that connects all teams including research, marketing/events and sales teams in a large open space. This is especially helpful for a growing media/technology company to work together on different initiatives. Also, media executives who are starting out in the research role will be exposed to different fields of work. There is a friendly rapport between all staff at both the U.S. and U.K office which makes it easy to create dialogue and brainstorm ideas. People are also very welcoming, which makes it easy for new staff to get well acclimated to the job. Gorkana also provides ample vacation time, with no inquiries on how you’re spending your day off. It is a definite plus for anyone in the U.S. to be allotted the same amount of holidays as the U.K. office. Compared to other technology companies, especially in New York City, there are opportunities for a good work life balance.", "cons": "The lack of variety in the media executive role, where team members primarily do research based projects, can become monotonous at times. This may discourage many team members who are new to the media/technology industry to stay motivated at work. Because Gorkana prides itself on the quality of its product offerings, it is necessary to incorporate a change in attitude to show the importance of the work each and every media executive does on a day to day basis. Create a rotational program that allows team members to rotate between roles/projects to ensure that each member has the ability to gain exposure to other projects and make the most of their time at Gorkana, however long that may be.", "advice": "Invest in all employees, and trust them! Build moral within colleagues to uncover the value of working at a company that not only has a great work culture, but one that is also interested in employees' personal development. I've come across many great team members both in the U.S. and U.K. teams who are passionate about the work they are doing. Be sure to engage them and increase esprit de corps within the smaller teams."}, {"title": "Speaking for the NYC office: Great work environment, reasonable pay, excellent management.", "text": "Pros The New York office of Gorkana has a great \"startup\" work environment. A young group of employees keeps the office jovial and relatively close knit. Excellent time off and great benefits. Great opportunity to grow your networking skills, expose yourself to the PR or Journalism industries, and plenty of opportunity to try a variety of roles within the same company. Fairly small company so there is plenty of interaction with management and they genuinely care about your personal and career goals. Cons While benefits more than make up for this, the salary was mediocre (but sufficient) for NYC. Being a small company, the time may come when leaving is the best way to gain that next set of skills. This happened to me, I was open with management about it, and they were gracious and helpful in my transition. Advice to Management While I suspect that this has happened since I left the company, I would suggest developing additional roles and ways for employees to stay with Gorkana longer than the typical 1-3 years. As a young company in the US, I understand that there are limited roles but the ability to envision yourself at the same company 10 years from now plays a big role in how long you remain with a company.", "rating": 5, "pros": "The New York office of Gorkana has a great \"startup\" work environment. A young group of employees keeps the office jovial and relatively close knit. Excellent time off and great benefits. Great opportunity to grow your networking skills, expose yourself to the PR or Journalism industries, and plenty of opportunity to try a variety of roles within the same company. Fairly small company so there is plenty of interaction with management and they genuinely care about your personal and career goals.", "cons": "While benefits more than make up for this, the salary was mediocre (but sufficient) for NYC. Being a small company, the time may come when leaving is the best way to gain that next set of skills. This happened to me, I was open with management about it, and they were gracious and helpful in my transition.", "advice": "While I suspect that this has happened since I left the company, I would suggest developing additional roles and ways for employees to stay with Gorkana longer than the typical 1-3 years. As a young company in the US, I understand that there are limited roles but the ability to envision yourself at the same company 10 years from now plays a big role in how long you remain with a company."}, {"title": "Gorkana US - A genuine review", "text": "Pros Company: True team collaboration and commitment to the company’s success - no matter what role or seniority level – and unmatched reputation in the competitive landscape. Un-paralleled client service, data quality and business integrity. Culture: The most fun-loving and hardworking team I’ve ever had the honor and pleasure of working with. The epitome of “Work hard, play hard.” You will have access to some of the most influential media in the world. Bloomberg – check. NYT – check. WSJ – check. Rueters – check. Management: If you have a high-achievement drive, and want to contribute, you'll do well here. If you have an aversion to pressure or if you're looking for an easy job, this isn't the place for you. Open door policy with line managers and MD. Employees are always heard and encouraged to give honest feedback. Network: Gorkana’s proven credibility with both clients and well respected media outlets allowed me to build out my professional network like never before. I can now call editors and journalists from some of the world’s largest media giants professional connections. Cons IT Issues: Remote server in UK meant significant down time which was incredibly frustrating but never impacted Gorkana’s clients. I believe Gorkana now has its own server in the U.S. Long hours may not work for some: I wouldn’t necessarily say it was a con, but this is no 9 – 5 gig. Networking is encouraged which makes for some long days but it’s always a good time and fantastic for business relationships and professional networking. Advice to Management Career development: There were programs conducted in the UK but were not made available to the US team. As many of the team are new graduates from some of the best universities in NY & surrounding area, I feel this would illustrate an investment in their careers at Gorkana. Revenue Targets: I felt revenue targets were more aspirational than aggressive which I feel was due to the Exec team assuming US and UK markets are more alike than they actually are.", "rating": 5, "pros": "Company: True team collaboration and commitment to the company’s success - no matter what role or seniority level – and unmatched reputation in the competitive landscape. Un-paralleled client service, data quality and business integrity.", "cons": "IT Issues: Remote server in UK meant significant down time which was incredibly frustrating but never impacted Gorkana’s clients. I believe Gorkana now has its own server in the U.S.", "advice": "Career development: There were programs conducted in the UK but were not made available to the US team. As many of the team are new graduates from some of the best universities in NY & surrounding area, I feel this would illustrate an investment in their careers at Gorkana."}, {"title": "Amazing first job out of school at Gorkana", "text": "Pros My first job after graduating from university was an internship that became a full time Account Executive role at Gorkana. There could not have been a better opportunity for me to learn the ropes of corporate culture, PR, and B2B media. I was supported and encouraged as a young professional by the incredibly engaging and friendly work environment. I was challenged by the tasks I was assigned, and appreciated and acknowledged for my hard work. Even now, I still remain close friends with my former coworkers, many of whom are still at Gorkana, as the company really fosters a community within itself. While I ended up shifting my career from PR to digital media sales, many of the skills I learned at Gorkana are still instrumental to my success today. Cons I have no cons to list from my experience at Gorkana - everything I learned in my experience there I still carry with me in my current career.", "rating": 5, "pros": "My first job after graduating from university was an internship that became a full time Account Executive role at Gorkana. There could not have been a better opportunity for me to learn the ropes of corporate culture, PR, and B2B media. I was supported and encouraged as a young professional by the incredibly engaging and friendly work environment. I was challenged by the tasks I was assigned, and appreciated and acknowledged for my hard work. Even now, I still remain close friends with my former coworkers, many of whom are still at Gorkana, as the company really fosters a community within itself. While I ended up shifting my career from PR to digital media sales, many of the skills I learned at Gorkana are still instrumental to my success today.", "cons": "I have no cons to list from my experience at Gorkana - everything I learned in my experience there I still carry with me in my current career.", "advice": null}, {"title": "Great starting point for a career in PR", "text": "Pros This was my first job after college and I was with the company for just shy of a year. I had interned in fashion PR prior to my employment here. Fashion PR had been a poor fit for my personalty - but I wanted to stay in a PR/Communications role. Gorkana gave me the exposure to realize that financial PR was what I wanted to do. The managers are always very supportive of the career development of employees and when a financial services client was looking to fill a junior position they personally recommended me for the role. I know that their recommendation carried a lot of weight when I interviewed for the position and helped me get the job. I am currently still with that financial firm as part of their in-house PR team. This is a great young company and I would have stayed if they had a position that was in line with where I wanted my career to go. I have never come across a PR person who has had something negative to say about Gorkana. Cons the Media Executive position is that the work is pretty dry - not gonna sugar coat this one...it is. But before I was allowed to accept the job the managers made sure that I completely understood what the job was. The culture makes up for it though. Advice to Management More internal opportunities for current employees", "rating": 5, "pros": "This was my first job after college and I was with the company for just shy of a year. I had interned in fashion PR prior to my employment here. Fashion PR had been a poor fit for my personalty - but I wanted to stay in a PR/Communications role. Gorkana gave me the exposure to realize that financial PR was what I wanted to do. The managers are always very supportive of the career development of employees and when a financial services client was looking to fill a junior position they personally recommended me for the role. I know that their recommendation carried a lot of weight when I interviewed for the position and helped me get the job. I am currently still with that financial firm as part of their in-house PR team.", "cons": "the Media Executive position is that the work is pretty dry - not gonna sugar coat this one...it is. But before I was allowed to accept the job the managers made sure that I completely understood what the job was. The culture makes up for it though.", "advice": "More internal opportunities for current employees"}, {"title": "Research team employer review", "text": "Pros Good work environment, friendly and understanding management and peers, good balance of work and life Cons Job is extremely tedious, not too much room for career development in the company Advice to Management Try to diversify the tasks for the research team and provide more responsibilities for the Media Executives", "rating": 3, "pros": "Good work environment, friendly and understanding management and peers, good balance of work and life", "cons": "Job is extremely tedious, not too much room for career development in the company", "advice": "Try to diversify the tasks for the research team and provide more responsibilities for the Media Executives"}, {"title": "Great work environment but extremely repetitive work", "text": "Pros great work environment and great people to work with. Cons The work is very repetitive and not exciting.", "rating": 5, "pros": "great work environment and great people to work with.", "cons": "The work is very repetitive and not exciting.", "advice": null}, {"title": "A standard corporate job", "text": "Pros Pretty good pay, nice offices, low pressure. Cons Lack of creativity and challenges. Advice to Management Communicate the direction of the company more clearly to all staff.", "rating": 3, "pros": "Pretty good pay, nice offices, low pressure.", "cons": "Lack of creativity and challenges.", "advice": "Communicate the direction of the company more clearly to all staff."}, {"title": "Gorkana Analysis Team", "text": "Pros Great diversity of people and good location Cons High turnover of staff, over-worked employees", "rating": 3, "pros": "Great diversity of people and good location", "cons": "High turnover of staff, over-worked employees", "advice": null}, {"title": "Excellent Starter Job", "text": "Pros - People are amazing - Working culture is great (no micro management) - Solid experience out of university - Table tennis and weekly football - Above average benefits Cons - No progression in department for my role - Some people are severely overworked without OT pay - Pay is only adequate for new graduates - No work from home option when I left Advice to Management Need more communication with sales department, as they have the authority to undersell products and the load gets dumped on analysis.", "rating": 5, "pros": "- People are amazing", "cons": "- No progression in department for my role", "advice": "Need more communication with sales department, as they have the authority to undersell products and the load gets dumped on analysis."}, {"title": "Awerall OK but unpredictable US management, blurred future", "text": "Pros * Global IPO company, possibility to join global team, multicultural environment * Interesting products & idea that brings real value to the UK, EU, US * Honest employer, HR is not bad * With this idea company (In terms of global Cision) will stay for years (if management manage not to mess it) Cons * If you outside US, you are doomed. Top management is in the US. They see UK office as sales only (Which is good if you are in sales). * No career opportunities * US management focuses non existing issues, being blind to top priority ones * Employee are disposable resources. Knowledge, seniority or loyalty to company values is non relevant as soon as there is cheaper resource. Advice to Management * Praise people who bring real value, not loyal slaves. * Praise people who are conscious and can think critically. Critics is not always bad. * Invest in people. They are not just disposable resources. Give them chance to evolve. * Invest in technology. You can't built house on a sand. * Alignment suffers. Sales, tech, hr, management are separate units. * Don't disrupt processes with \"hard fist\" decisions.", "rating": 5, "pros": "* Global IPO company, possibility to join global team, multicultural environment", "cons": "* If you outside US, you are doomed. Top management is in the US. They see UK office as sales only (Which is good if you are in sales).", "advice": "* Praise people who bring real value, not loyal slaves."}, {"title": "Prompt Interview, Friendly Bunch and a great place to work", "text": "Pros Friendly and sociable team Organised Based in a lovely part of London Cons Busy commute to and from work Not much integration between other departments Mediocre system integration Advice to Management Management are working towards integration of all teams and departments although I can see improvements but is something to work towards.", "rating": 5, "pros": "Friendly and sociable team", "cons": "Busy commute to and from work", "advice": "Management are working towards integration of all teams and departments although I can see improvements but is something to work towards."}, {"title": "All change", "text": "Pros Fabulous brand that doesn't live up to its name Cons Look after your staff and they will look after your clients, Gorkana no neither well", "rating": 3, "pros": "Fabulous brand that doesn't live up to its name", "cons": "Look after your staff and they will look after your clients, Gorkana no neither well", "advice": null}, {"title": "Fantastically Awful Workplace", "text": "Pros Used to be located in a cool area, then it moved, so struggling really... Cons Gorkana feels and sounds like an old ship, trying to modernise itself in a choppy sea of new companies and free services. All it manages is to do, is slow down its inevitable sinking through patching up the holes haphazardly. Advice to Management Find what it is you really want to do with your life, as it doesn't really get more desperate that working in management at Gorkana.", "rating": 1, "pros": "Used to be located in a cool area, then it moved, so struggling really...", "cons": "Gorkana feels and sounds like an old ship, trying to modernise itself in a choppy sea of new companies and free services. All it manages is to do, is slow down its inevitable sinking through patching up the holes haphazardly.", "advice": "Find what it is you really want to do with your life, as it doesn't really get more desperate that working in management at Gorkana."}, {"title": "Race of popularity, avoid it", "text": "Pros Amazing working space in Canary Wharf. Spacious, bright, shower with towel provided, locker. Good training on various platforms both for mainstream and digital media coverage. Casual outfit. Cons This review is only related to Analysis Department. Popularity is crucial if you'd like to be acknowledged or promoted. Some seniors don't do their duty in account leading, but can get away with it as they are \"close friends\" of the head of department. My line manager never give feed back as he's too busy, never praise work either. Too busy to manage people as work load is very high due to high turn over within the department. Over 30% turnover. Advice to Management Head of analysis dept need to be replaced as he set up this \"popularity\" culture.", "rating": 1, "pros": "Amazing working space in Canary Wharf. Spacious, bright, shower with towel provided, locker. Good training on various platforms both for mainstream and digital media coverage. Casual outfit.", "cons": "This review is only related to Analysis Department. Popularity is crucial if you'd like to be acknowledged or promoted. Some seniors don't do their duty in account leading, but can get away with it as they are \"close friends\" of the head of department. My line manager never give feed back as he's too busy, never praise work either. Too busy to manage people as work load is very high due to high turn over within the department. Over 30% turnover.", "advice": "Head of analysis dept need to be replaced as he set up this \"popularity\" culture."}, {"title": "Good place but changing due to integration", "text": "Pros - good colleagues. A lot of good people work here, just not all in management - Old Street was a great setting - some departments move quickly and get noticed Cons - some areas were very management heavy - and the management was very micro-level - not generous with salary - certain teams worked far too long hours with no overtime Advice to Management Take the company forward, but don't loose the quality", "rating": 3, "pros": "- good colleagues. A lot of good people work here, just not all in management", "cons": "- some areas were very management heavy - and the management was very micro-level", "advice": "Take the company forward, but don't loose the quality"}, {"title": "A company in a state of flux", "text": "Pros Some really nice people work here and the new offices in Canary Wharf are very swish. My job was a pretty autonomous role, where you could come in and get on with it, with the minimum of hassle. Cons My job was poorly paid but the bonus could make up for it - however due to the way work was distributed (internal politics played a large part in this) it would be difficult for me to hit these targets. The computer systems are ancient and failing - they also slowed down production, again hindering my ability to hit targets and receive my bonus. Within my department, there was no room for promotion. A lot of manager-level staff have been in their positions for a long time and there seems to be no appetite for these people to take their knowledge and move around the business. This means that any staff who wish to progress have to leave the department. The contract I was on demanded a three month notice period if I wanted to leave - which for an entry level role I consider to be excessive. This put me off applying for other roles in the company. Advice to Management There is definitely a strange atmosphere in this office, a feeling of instability and constant flux. Staff regularly discuss future restructures, redundancies and how they mean nothing within the bigger picture. Management need to decide on a plan for the London office, engage with staff, and be open and honest about their future plans for the business.", "rating": 1, "pros": "Some really nice people work here and the new offices in Canary Wharf are very swish. My job was a pretty autonomous role, where you could come in and get on with it, with the minimum of hassle.", "cons": "My job was poorly paid but the bonus could make up for it - however due to the way work was distributed (internal politics played a large part in this) it would be difficult for me to hit these targets.", "advice": "There is definitely a strange atmosphere in this office, a feeling of instability and constant flux. Staff regularly discuss future restructures, redundancies and how they mean nothing within the bigger picture. Management need to decide on a plan for the London office, engage with staff, and be open and honest about their future plans for the business."}, {"title": "Good graduade position", "text": "Pros A very well organized company that leads you through the first weeks. Very good as a start post-graduate position. Great office Cons The work gets repetitive quite fast, so you must challenge yourself to not get bored and find ways to make the job more fun for yourself", "rating": 5, "pros": "A very well organized company that leads you through the first weeks. Very good as a start post-graduate position. Great office", "cons": "The work gets repetitive quite fast, so you must challenge yourself to not get bored and find ways to make the job more fun for yourself", "advice": null}, {"title": "Good work atmosphere", "text": "Pros Friendly work atmosphere and decent benefits package Cons Some departments were given less attention than others", "rating": 5, "pros": "Friendly work atmosphere and decent benefits package", "cons": "Some departments were given less attention than others", "advice": null}, {"title": "Analyst developer", "text": "Pros Friendly team of developers and a good opportunity to learn how a small in house software development company works. Cons Lack of focus on what to do from management. Too many projects in the pipeline getting shelved. Too much of a start up culture although the company is over 100 years old Advice to Management Stick to your core business or find a suitable partner or a buyer.", "rating": 1, "pros": "Friendly team of developers and a good opportunity to learn how a small in house software development company works.", "cons": "Lack of focus on what to do from management. Too many projects in the pipeline getting shelved. Too much of a start up culture although the company is over 100 years old", "advice": "Stick to your core business or find a suitable partner or a buyer."}, {"title": "A waste of talents", "text": "Pros Most co-workers are good, and talented people. Cons The staff are talented, helpful, decent, hard working people whos contributions are routinely ignored by higher management. Workforce kept constantly in the dark about the companys true plans (whatever information is given out is frequently minumal or misleading). Production staff are massively underpaid and under rewarded for the efforts and contributions that they make. I've personaly contributed many good new ideas, and given massive efforts to help the company. But left feeling ill treated, run down, traumatised, and frankly abused. Advice to Management Listen to your staff. Don't sweep problems under the carpet as a matter of routine. Pay your staff in proportion to the conributions they make, also for the stresses and strains they suffer. Most firms compensate people for a stressful job. Gorkana does no such thing. You have great and talented people who work there. Reward and utilise those people.", "rating": 1, "pros": "Most co-workers are good, and talented people.", "cons": "The staff are talented, helpful, decent, hard working people whos contributions are routinely ignored by higher management. Workforce kept constantly in the dark about the companys true plans (whatever information is given out is frequently minumal or misleading). Production staff are massively underpaid and under rewarded for the efforts and contributions that they make.", "advice": "Listen to your staff. Don't sweep problems under the carpet as a matter of routine. Pay your staff in proportion to the conributions they make, also for the stresses and strains they suffer. Most firms compensate people for a stressful job. Gorkana does no such thing. You have great and talented people who work there. Reward and utilise those people."}, {"title": "Awful place, no interest in their employees", "text": "Pros Most of the people, ie non management, are generally decent and work hard Cons Management continually turning a blind eye to the work-shy, the incompetent and the dead wood propping up the office and allowing good workers to leave, allowing inequities in distribution and allocation of work to fester, ignoring confronting those who do as little as possible, take elongated lunch breaks and avoid helping out colleagues with their clients. Advice to Management You won't listen so no point", "rating": 1, "pros": "Most of the people, ie non management, are generally decent and work hard", "cons": "Management continually turning a blind eye to the work-shy, the incompetent and the dead wood propping up the office and allowing good workers to leave, allowing inequities in distribution and allocation of work to fester, ignoring confronting those who do as little as possible, take elongated lunch breaks and avoid helping out colleagues with their clients.", "advice": "You won't listen so no point"}, {"title": "Pointless middle management", "text": "Pros - Great people - Good location - Christmas party - Always leave on time Cons - Wrong people rewarded - Bullying team leaders - Repetitive work - Stagnant environment - Frustration across the board Advice to Management Stop rewarding the team leaders/middle management. They are needlessly in the way and create an unnecessarily bad atmosphere.", "rating": 3, "pros": "- Great people", "cons": "- Wrong people rewarded", "advice": "Stop rewarding the team leaders/middle management. They are needlessly in the way and create an unnecessarily bad atmosphere."}, {"title": "Boring, terrible management,", "text": "Pros The people (and that does NOT include Team Leaders) Good social events e.g. Christmas parties and summer parties Get to leave dead on half 5 (why someone would stay after that time is beyond me). Some good benefits e.g. gym Get to meet journalists, build contacts (althought you only do this about 3/4 times a month). Cons Where do I start? Management - idiotic, patronising, constantly micro managing, act as though they are above you, set their own rules (e.g. if you're late all hell breaks loose but if they are late they don't batter an eyelid), take for granted how hard you work. Work - boring, repetitive, needs no skill, you have to record everything including calls (stay away if you don't like targets) Rewards - very little (unless you class a round of applause a reward?) Advice to Management Leave", "rating": 1, "pros": "The people (and that does NOT include Team Leaders)", "cons": "Where do I start?", "advice": "Leave"}, {"title": "Avoid them like the plague", "text": "Pros Its a job...but so is flipping burgers Cons A classic case of do as I say, not as I do. The only people that rise within this entity are those who treat people poorly, I can confirm the bullying attitude is encouraged and treating others like garbage is the way to succeed here. Sadly hard work, talent, ability, and drive are looked upon as irrelevancies. Higher level management has no clue and is simply pushing through what it considers as being the next cash cow strategy. I look forward to customers leaving as the staff that have ability look to move and are replaced by fresh graduates from low quality higher education institutions. The amount of semi-literate and pointless emails I started getting in the wake of yet another talent exodus finally pushed me to leave. Middle management/team leaders, as a general rule of thumb are encouraged to cut corners, directly and indirectly, and treat people poorly. Higher up decisions have introduced economies of scale (that is to say cutting pays), and cheating on IT, which since the takeover by Cision has become notorious for \"stuttering\" with customers also starting to notice On top of which you are over-worked and poorly compensated. Advice to Management Retire, once you obviously milk this year's juicy merger", "rating": 1, "pros": "Its a job...but so is flipping burgers", "cons": "A classic case of do as I say, not as I do. The only people that rise within this entity are those who treat people poorly, I can confirm the bullying attitude is encouraged and treating others like garbage is the way to succeed here.", "advice": "Retire, once you obviously milk this year's juicy merger"}, {"title": "Bad Management", "text": "Pros Nice people to work with Cons Bad management of people, no development chances within the team Advice to Management trust your people", "rating": 3, "pros": "Nice people to work with", "cons": "Bad management of people, no development chances within the team", "advice": "trust your people"}, {"title": "Paid pennies for a boring job", "text": "Pros Big company Decent benefits (Gym, pension etc) Relatively short working hours Can't think of anything else really Cons Very boring and repetitive job (I was in the international production team, i.e. writing summaries for clients from foreign newspaper articles that needed to be translated first). Extremely low pay. It's ridiculous that a skilled job where you are required to know at least 2 other languages is paid THAT low. The job could have been bearable had it been paid market rate. No chance of a career progression in my department Advice to Management During my time there I took two company questionnaires, where one question concerned how much pride we would feel from working for Gorkana. The response was ridiculously low. Do something about it. Raise your translators' salaries. You have people who are skilled, who are fluent in at least 2 languages and you treat them like call centre operators (with all due respect to these). Value your employees and you will see people raising their opinion about you.", "rating": 3, "pros": "Big company", "cons": "Very boring and repetitive job (I was in the international production team, i.e. writing summaries for clients from foreign newspaper articles that needed to be translated first).", "advice": "During my time there I took two company questionnaires, where one question concerned how much pride we would feel from working for Gorkana. The response was ridiculously low."}, {"title": "Mundane, underpaid, and unprofessional a true farce of a company", "text": "Pros As everyone always says, the people. Literally the people are the only good thing about this dismal company. I had the pleasure of meeting some fantastic hard working, talented people who frankly are completely wasted in Gorkana. Easy hours I suppose you don't work overtime Cons I honestly don't even know where to start there are literally so many. I worked as a media executive in the research department and it was the most farcical job ever. As someone mentioned in a previous review, gorkana is basically a glorified call centre. Your job will involve calling up busy journalists and newsrooms and bothering them to check irrelevant information like whether an address or email is still correct. If you're content with mundanity, feeling demotivated and getting paid absolutely peanuts, then this job is for you. Management are the biggest shower of time wasters. Meetings for the sake of it and pointless \"huddles\". Many of these \"team leaders\" have perfected the art of looking busy. The do the bare minimum and reap all the rewards. It's infuriating that many genuinely hardworking and talented people are overlooked for the sake of these minions who know how to suck up to the right people. Don't even get me started on the passive aggressive emails from aforementioned minions. I don't even think my line manager even understood the job. They have the most ridiculous policy regarding absences. Basically you're not allowed be sick at Gorkana. They have arduous punitive measures in place in order to deter \"duvet days\". Many employees drag themselves in when they're genuinely ill because it's not worth the fall out. Meanwhile managers seem to take numerous unsolicited days off without having to answer to anyone. Also the idea that some people in positions of management can work from home and others can't is absolutely ridiculous and unfair. Considering the database cannot even be accessed from home, it begs the question how much work are these people really doing? Bottom line do not work here. Even if you're desperate, I would take a part time job in a bar or cafe before Gorkana. You're worth far more than the shoddy treatment you'll receive at this farce of a company. Advice to Management Value your people, pay more and get rid of many of these lazy time wasting buffoons who find themselves in a position of power.", "rating": 1, "pros": "As everyone always says, the people. Literally the people are the only good thing about this dismal company. I had the pleasure of meeting some fantastic hard working, talented people who frankly are completely wasted in Gorkana.", "cons": "I honestly don't even know where to start there are literally so many. I worked as a media executive in the research department and it was the most farcical job ever. As someone mentioned in a previous review, gorkana is basically a glorified call centre. Your job will involve calling up busy journalists and newsrooms and bothering them to check irrelevant information like whether an address or email is still correct. If you're content with mundanity, feeling demotivated and getting paid absolutely peanuts, then this job is for you.", "advice": "Value your people, pay more and get rid of many of these lazy time wasting buffoons who find themselves in a position of power."}, {"title": "Awful company", "text": "Pros The people you work with. That's it. Cons there was a lengthy interview process, three in fact for a very simple job. The personnel who are in managerial positions have no idea how to lead a team and either made up things as they went along or are persistently absent. The work is mundane and repetitive, with boring, long meetings about nothing. This particular department is incompetent from the senior manager, right through to lower level managers; only a few showed they knew what they were doing.Canned emails to journalists (spam) for profiles that have been created without them even realising, an antiquated database with a plethora of information for no reason at all. I can understand why journalists got annoyed at the constant phone calls and emails, gorkana is essentially a glorified call centre; with hitting targets the main insentive. There's a serious disconnect with the CEO and the rest of the business, with a lot of emails tailored towards sales and marketing; every other department is neglected. Advice to Management Listen to the people who work for you, don't disappear for weeks on end and don't sit there listening to music when you are meant to be working. if there's a problem, don't be a backbiter but talk to people and resolve the issues. Ultimately you'll be jobsworths working that same old, mudane, dead in the ground role for the foreseeable future.", "rating": 1, "pros": "The people you work with. That's it.", "cons": "there was a lengthy interview process, three in fact for a very simple job. The personnel who are in managerial positions have no idea how to lead a team and either made up things as they went along or are persistently absent. The work is mundane and repetitive, with boring, long meetings about nothing. This particular department is incompetent from the senior manager, right through to lower level managers; only a few showed they knew what they were doing.Canned emails to journalists (spam) for profiles that have been created without them even realising, an antiquated database with a plethora of information for no reason at all. I can understand why journalists got annoyed at the constant phone calls and emails, gorkana is essentially a glorified call centre; with hitting targets the main insentive. There's a serious disconnect with the CEO and the rest of the business, with a lot of emails tailored towards sales and marketing; every other department is neglected.", "advice": "Listen to the people who work for you, don't disappear for weeks on end and don't sit there listening to music when you are meant to be working. if there's a problem, don't be a backbiter but talk to people and resolve the issues. Ultimately you'll be jobsworths working that same old, mudane, dead in the ground role for the foreseeable future."}, {"title": "Awful Company", "text": "Pros - there are literally none, don't let them waste your time. - they make it all look good by posting fake reviews. Cons - IT is a shambles. SaaS solutions run amock. - some departments still run purely on excel spreadsheets. real stone age stuff. - not data driven at all for a company that should be. - no career development or support. - the worst management team i have ever encountered. - lack of support & development (training videos are from the 1970's). Advice to Management Give up.", "rating": 1, "pros": "- there are literally none, don't let them waste your time.", "cons": "- IT is a shambles. SaaS solutions run amock.", "advice": "Give up."}, {"title": "Gorkana IT is on a life support", "text": "Pros If you're desperate, need quick cash then Gorkana IT is for you. But be warned, you will leave with no skills. Some good programmers in here but are being let down by Infrastructure. Cons Gorkana IT (UK) is on a life support . This must be the the worst IT department in the UK. Yes management can take some of the blame as they've allowed this mess to build up over the years but I also wonder where they find these IT guys from (they're not even IT). Some of these guys have been here for over 12 years but are technically useless if not obsolete. They complain about lack of training. In a day when Cloud computing is free or you can buy powerful computer and build anything on it you're still complaining about lack of training . Come on, you've been here for over 10 years. What do you have to show ? Oh yes, there's the non English speaking mafia who will switch into their native language all day . This place just sucks. HR - There's not a lot you can do. I know because I work with these guys, they've been here for more than 10 years - you think you can change them ? They lack modern IT skills, they're desperate, they know they will never find work outside Gorkana and will do anything to protect themselves. As one reader said, check them out on Linkedin. These are the guys dragging the IT department down. They're not here to improve the situation. It's about job protection . IT at Gorkana is beyond redemption. Advice to Management Let the guys in the US take over the IT department in the UK. They know what they're doing .", "rating": 1, "pros": "If you're desperate, need quick cash then Gorkana IT is for you. But be warned, you will leave with no skills.", "cons": "Gorkana IT (UK) is on a life support . This must be the the worst IT department in the UK. Yes management can take some of the blame as they've allowed this mess to build up over the years but I also wonder where they find these IT guys from (they're not even IT). Some of these guys have been here for over 12 years but are technically useless if not obsolete.", "advice": "Let the guys in the US take over the IT department in the UK. They know what they're doing ."}, {"title": "Review", "text": "Pros Good opportunity for progression to manager level Cons Not enough recognition for overtime", "rating": 3, "pros": "Good opportunity for progression to manager level", "cons": "Not enough recognition for overtime", "advice": null}, {"title": "Account Executive", "text": "Pros People at non management level are a true glue that holds this company together. They are the ones that will teach you and help you when you are stuck. Cons Too many to name. Incompetent management. Any account manager becomes people manager automatically. This means that a lot of people managers are awkward, rude, sexist, incompetent and afraid of managing their employees. Also the main management group in the Analysis department is managed like an old boys club. Everyone is ultra competitive and threaten by any feedback or initiative. Hard work is not appreciated. Promotions are given to people liked by the boys from the boys club. Never have I worked in such a shambles environment. Forget life work balance or progression. Seat and work hard, all through evening and often on weekends. Advice to Management Train your managers. If you have huge turnover, and you do, look at the route cause issues behind it!", "rating": 1, "pros": "People at non management level are a true glue that holds this company together. They are the ones that will teach you and help you when you are stuck.", "cons": "Too many to name. Incompetent management. Any account manager becomes people manager automatically. This means that a lot of people managers are awkward, rude, sexist, incompetent and afraid of managing their employees. Also the main management group in the Analysis department is managed like an old boys club. Everyone is ultra competitive and threaten by any feedback or initiative. Hard work is not appreciated. Promotions are given to people liked by the boys from the boys club. Never have I worked in such a shambles environment. Forget life work balance or progression. Seat and work hard, all through evening and often on weekends.", "advice": "Train your managers. If you have huge turnover, and you do, look at the route cause issues behind it!"}, {"title": "Fast learning within a high-growth company", "text": "Pros - Able to work with some of the friendliest people in the industry - Constant new opportunities due to the growth and expansion of the business - Focus on internal development Cons - The fast-growth can make some uncomfortable, but would suit someone who is more accepting of change Advice to Management Keep the communication around change as open and clear as possible", "rating": 5, "pros": "- Able to work with some of the friendliest people in the industry", "cons": "- The fast-growth can make some uncomfortable, but would suit someone who is more accepting of change", "advice": "Keep the communication around change as open and clear as possible"}, {"title": "Springboard company only", "text": "Pros I worked in the Analysis department so most of my review refers to that department only. The sole pro is that if you work hard you can get promoted relatively quickly. Though that promotional ladder can be completed in three years and quickly leaves you in a dead end. The people in general are friendly and easy to work with. Cons The attitude of the Operations team is very short-sighted. They work on the basis that the majority of people will only work there a short time, which leads them to care very little about morale, career development, or overall employee satisfaction. The net result is a department with very high staff turnover, which places a very high burden of responsibility of the longer term employees and means that the quality of work the company is able to produce fluctuates very wildly. The salaries offered are comparatively low, which means during the current competitive economic environment only inexperienced and sub-par candidates are hired in new roles. In addition to analysis, this is also an issue in IT support, product development, HR, and customer support. Overall this means that the general direction and growth of the company is severely hampered by inexperience and incompetence at all levels. The senior managers are also very chummy with each other, which further creates problems whereby even people that have been proved to be incompetent get shuffled to another department. Company systems and products are roughly all 10 years old, which makes the day to day job difficult and also means the company consistently loses business to more modern competitors. The HR team oversee a sickness policy that potentially that means you are ineligible for inflation or performance linked pay rises if you are ill more than three times in six months. More than seven absences in 18 months can result in dismissal. Needless to say this policy is neither effective at combating spurious absences or addressing the persistent morale and staff turnover problems. Advice to Management A very serious audit needs to be undertaken into the suitability of the various Operations teams and department heads. They have consistently led the company on a downward path over the past three years and are increasing the type of attitudes and policies that have created the initial problems. Management needs to also be much more transparent. Serious announcements on the direction of the company are routinely leaked. Management then denies the speculation, only to announce that it is true several months later. That these types of leaks happen almost every six months makes you seriously question the ability and credibility of the managing director and CEO. Take urgent action to combat staff retention. A department that was once a world leader is rapidly losing ground to competitors because they Operations team have no desire to retain experienced staff.", "rating": 1, "pros": "I worked in the Analysis department so most of my review refers to that department only. The sole pro is that if you work hard you can get promoted relatively quickly. Though that promotional ladder can be completed in three years and quickly leaves you in a dead end. The people in general are friendly and easy to work with.", "cons": "The attitude of the Operations team is very short-sighted. They work on the basis that the majority of people will only work there a short time, which leads them to care very little about morale, career development, or overall employee satisfaction. The net result is a department with very high staff turnover, which places a very high burden of responsibility of the longer term employees and means that the quality of work the company is able to produce fluctuates very wildly.", "advice": "A very serious audit needs to be undertaken into the suitability of the various Operations teams and department heads. They have consistently led the company on a downward path over the past three years and are increasing the type of attitudes and policies that have created the initial problems."}, {"title": "Good job for graduates", "text": "Pros Young office, friendly co-workers, and some line managers are extremely supportive and motivating Cons The job can quickly become repetitive, and deadlines often fall around the same time leading to pockets of having too much or too little work during the month", "rating": 3, "pros": "Young office, friendly co-workers, and some line managers are extremely supportive and motivating", "cons": "The job can quickly become repetitive, and deadlines often fall around the same time leading to pockets of having too much or too little work during the month", "advice": null}, {"title": "Account Executive - Analysis", "text": "Pros People in the Analysis team are pretty young, most of them being young graduates, which makes is easy to make good friends and keep the atmosphere relaxed. The training programme is comprehensive and helpful for new starters. Loads of opportunities for progression as the turn-over rate is quite high. There is also a lot of room for personal initiatives and projects as management is receptive to changes and are looking to improve the way the Department works. Cons The work is repetitive and not intellectually stimulating. Very few recognition. Expect to work more than your usual 9-5:30 on quarterly months. Salary not competitive. Advice to Management Better salaries, keep the team members motivated and interested.", "rating": 3, "pros": "People in the Analysis team are pretty young, most of them being young graduates, which makes is easy to make good friends and keep the atmosphere relaxed.", "cons": "The work is repetitive and not intellectually stimulating.", "advice": "Better salaries, keep the team members motivated and interested."}, {"title": "Gorkana", "text": "Pros Good culture for learning and knowledge sharing, opportunities to progress Cons There is a chaotic pressured environment, staff are generally over worked Advice to Management Provide better support to your workers", "rating": 3, "pros": "Good culture for learning and knowledge sharing, opportunities to progress", "cons": "There is a chaotic pressured environment, staff are generally over worked", "advice": "Provide better support to your workers"}, {"title": "no possibility of evolving", "text": "Pros some of the nicest people I have ever worked with Cons Once you have learned how to do your job, there is no possibility of learning new things, unless you want to go into sales. Senior management does not help you if you have a problematic colleague but if someone complains about you , they will assume it is authomatically your fault.", "rating": 3, "pros": "some of the nicest people I have ever worked with", "cons": "Once you have learned how to do your job, there is no possibility of learning new things, unless you want to go into sales. Senior management does not help you if you have a problematic colleague but if someone complains about you , they will assume it is authomatically your fault.", "advice": null}, {"title": "Do not join IT at Gorkana. Unless you want no training, no career plan,hopeless management and total CHAOS.", "text": "Pros NONE. This place is very demoralising. Cons Really really bad management. I mean terrible. I do not think they will ever get this bit right. The heads of IT....not sure where they get them. They're a joke sadly. This place does not make you want to give your best. You get absolutely no thanks for any hard work you put in. It only seems to go to certain people. Again....bad management. Cant stress enough how demotivating they are. Advice to Management Leave. Let someone come in who KNOWS what they are doing.", "rating": 1, "pros": "NONE. This place is very demoralising.", "cons": "Really really bad management. I mean terrible. I do not think they will ever get this bit right. The heads of IT....not sure where they get them. They're a joke sadly.", "advice": "Leave. Let someone come in who KNOWS what they are doing."}, {"title": "Social Media Account Executive", "text": "Pros Great work culture, supportive leadership Cons salary is low as per market standards", "rating": 5, "pros": "Great work culture, supportive leadership", "cons": "salary is low as per market standards", "advice": null}, {"title": "Nice collective", "text": "Pros Great people to work with, good training provided Cons Salary on the low side, no overtime paid, can be repetitive work", "rating": 3, "pros": "Great people to work with, good training provided", "cons": "Salary on the low side, no overtime paid, can be repetitive work", "advice": null}, {"title": "Perfect Work Place", "text": "Pros Welcoming people, good benefits and career growth options. Gorkana is a great place to start a career. Working at this company is fun and teaches an individual team work. Throughout the day you work with great people and great projects. The greatest part is, they are owned by the big names. I love to work here Cons None really, may be it is too early to comment on COns", "rating": 5, "pros": "Welcoming people, good benefits and career growth options. Gorkana is a great place to start a career. Working at this company is fun and teaches an individual team work. Throughout the day you work with great people and great projects. The greatest part is, they are owned by the big names. I love to work here", "cons": "None really, may be it is too early to comment on COns", "advice": null}, {"title": "Make sure you read all the reviews on Glassdoor.", "text": "Pros Indeed. Only if you're desperate and I wish I'd read these reviews before I joined Gorkana. Cons IT Infrastructure is really poor and they're not doing anything about it. Either management don't care or something is seriously wrong. Look at Linkedin (1) to see the type of people working in IT (2) Check their skillsets. It's outdated (3) How many IT managers they've had in the last few years. Advice to Management Fix the problems in IT.", "rating": 1, "pros": "Indeed. Only if you're desperate and I wish I'd read these reviews before I joined Gorkana.", "cons": "IT Infrastructure is really poor and they're not doing anything about it. Either management don't care or something is seriously wrong. Look at Linkedin (1) to see the type of people working in IT (2) Check their skillsets. It's outdated (3) How many IT managers they've had in the last few years.", "advice": "Fix the problems in IT."}, {"title": "Working for Gorkana", "text": "Pros Excellent, effective and friendly team; clearly defined roles; good range of benefits; supportive management. Cons Occasional 'sameiness' of tasks. Advice to Management Carry on!", "rating": 5, "pros": "Excellent, effective and friendly team; clearly defined roles; good range of benefits; supportive management.", "cons": "Occasional 'sameiness' of tasks.", "advice": "Carry on!"}, {"title": "Data Executive", "text": "Pros Friendly and welcoming culture in the company, very good work-life-balance, fair salary, nice colleagues Cons So far, the job has not been very challenging, but I am confident that this will change soon.", "rating": 5, "pros": "Friendly and welcoming culture in the company, very good work-life-balance, fair salary, nice colleagues", "cons": "So far, the job has not been very challenging, but I am confident that this will change soon.", "advice": null}, {"title": "Sales", "text": "Pros Market Leading Company so everyone knows you when cold calling and there are many inbound queries. Cons Lack of leadership, direction, opportunities to grow your career. Nice people work here, but almost everyone feels stifled in their job prospects in the company and salaries. Commission structure changes to actually prevent people from earning money. I would not recommend working here if you are a senior sales person or looking for management opportunities.", "rating": 3, "pros": "Market Leading Company so everyone knows you when cold calling and there are many inbound queries.", "cons": "Lack of leadership, direction, opportunities to grow your career. Nice people work here, but almost everyone feels stifled in their job prospects in the company and salaries. Commission structure changes to actually prevent people from earning money. I would not recommend working here if you are a senior sales person or looking for management opportunities.", "advice": null}, {"title": "Only if you're desperate", "text": "Pros None whatsoever. Low pay, bad management, they don't care about retaining talented employees. Cons Very frustrating working environment, hire and fire culture, incompetent management, you are being micromanaged at every point, outdated IT systems which cause a lot of frustration, horrible HR department (which posts fake reviews on glassdoor...). Pay is really low as well, no opportunities to shape your role/to really advance in the company. Advice to Management Try do do more to retain talented employees.", "rating": 1, "pros": "None whatsoever. Low pay, bad management, they don't care about retaining talented employees.", "cons": "Very frustrating working environment, hire and fire culture, incompetent management, you are being micromanaged at every point, outdated IT systems which cause a lot of frustration, horrible HR department (which posts fake reviews on glassdoor...). Pay is really low as well, no opportunities to shape your role/to really advance in the company.", "advice": "Try do do more to retain talented employees."}, {"title": "Not the greatest to work for!", "text": "Pros Good people below management and benefits Cons Pay is very low, ready to be treated as a 'material', not as human being. They don't trust their employees either. Advice to Management Look after your employees and have an eye on mid-management", "rating": 3, "pros": "Good people below management and benefits", "cons": "Pay is very low, ready to be treated as a 'material', not as human being. They don't trust their employees either.", "advice": "Look after your employees and have an eye on mid-management"}, {"title": "No room for growth", "text": "Pros Some nice people working there - Michael and Alex were really encouraging leaders Chance to meet and interact with journalists Gives an understanding into PR Cons No room for growth within the company. Very limited training and planning for progression within the company Advice to Management Appreciate your workers a little more and take the time to ensure they're getting the most out of the role otherwise it will be the battery farm that it was when I was there", "rating": 3, "pros": "Some nice people working there - Michael and Alex were really encouraging leaders", "cons": "No room for growth within the company. Very limited training and planning for progression within the company", "advice": "Appreciate your workers a little more and take the time to ensure they're getting the most out of the role otherwise it will be the battery farm that it was when I was there"}, {"title": "Stay the course, change can be tough", "text": "Pros A great business with a fantastic client list, a strong track record of growth and some wonderful people who genuinely want to make a difference and get on. Cons This is a business which is going through a lot of change through acquisition and integration; that can be hard to manage, and very distracting, but will be worth it in the long run. Advice to Management Pull together, lead from the front and focus on the positive. This is a business to be proud of but you will have some tough decisions to make and not be able to please everybody all of the time. Focus on those who genuinely want to be part of the team and help make a difference.", "rating": 5, "pros": "A great business with a fantastic client list, a strong track record of growth and some wonderful people who genuinely want to make a difference and get on.", "cons": "This is a business which is going through a lot of change through acquisition and integration; that can be hard to manage, and very distracting, but will be worth it in the long run.", "advice": "Pull together, lead from the front and focus on the positive. This is a business to be proud of but you will have some tough decisions to make and not be able to please everybody all of the time. Focus on those who genuinely want to be part of the team and help make a difference."}, {"title": "Java Developer", "text": "Pros Good tech stack, good environment and skills sharing. Many projects and many new technology involved. Excellent work time 7.5 hours. Old street is awesome for lunch and beers after work. Cons Dev department closed down. Sometimes too much bureaucracy even for simple tasks. DBA approval needed for any simple SQL modification, but responsibility belongs to devs... devops and devs work in different building and sometimes it can be a problem Advice to Management you shouldn't let people leave too easily, knowledge is gold. I need to type 20 words minimum, if you are manager you should know how to run a company, I'm just a developer.", "rating": 5, "pros": "Good tech stack, good environment and skills sharing. Many projects and many new technology involved. Excellent work time 7.5 hours. Old street is awesome for lunch and beers after work.", "cons": "Dev department closed down. Sometimes too much bureaucracy even for simple tasks. DBA approval needed for any simple SQL modification, but responsibility belongs to devs... devops and devs work in different building and sometimes it can be a problem", "advice": "you shouldn't let people leave too easily, knowledge is gold. I need to type 20 words minimum, if you are manager you should know how to run a company, I'm just a developer."}, {"title": "Appalling and stressful", "text": "Pros Looks solid on your CV Cons Everything. This place is full of power trip obsessed backstabbers and so called 'senior managers' who lack basic social skills and wouldn't stand a chance outside of Old Street.", "rating": 1, "pros": "Looks solid on your CV", "cons": "Everything. This place is full of power trip obsessed backstabbers and so called 'senior managers' who lack basic social skills and wouldn't stand a chance outside of Old Street.", "advice": null}, {"title": "Good place to work", "text": "Pros Good atmosphere, young friendly teams and constantly growing. Lots of opportunity to learn and pioneer new industry metrics. Cons No particular negatives that you wouldn't find in any place of work. Potential bottlenecks in opportunity above AM level, but that is being addressed and I'm sure new opportunities will arise in the coming months", "rating": 5, "pros": "Good atmosphere, young friendly teams and constantly growing. Lots of opportunity to learn and pioneer new industry metrics.", "cons": "No particular negatives that you wouldn't find in any place of work. Potential bottlenecks in opportunity above AM level, but that is being addressed and I'm sure new opportunities will arise in the coming months", "advice": null}, {"title": "Terrible management", "text": "Pros Some good people work there Cons Terrible management, detached from what's actually happening and a CEO who spends more time planning his wedding than running the company. Total mess up with company buy-out - poorly handled and communicated. Advice to Management Don't believe your own hype.", "rating": 1, "pros": "Some good people work there", "cons": "Terrible management, detached from what's actually happening and a CEO who spends more time planning his wedding than running the company. Total mess up with company buy-out - poorly handled and communicated.", "advice": "Don't believe your own hype."}, {"title": "probation", "text": "Pros i have really enjoyed working at Gorkana. I feel valued and treated well. the team is really welcoming and easy to work with Cons the only downside is that they are not used to having an employee operate an Apple Mac so they are still working on giving me access to their network but its still early days. Advice to Management N/A", "rating": 5, "pros": "i have really enjoyed working at Gorkana. I feel valued and treated well. the team is really welcoming and easy to work with", "cons": "the only downside is that they are not used to having an employee operate an Apple Mac so they are still working on giving me access to their network but its still early days.", "advice": "N/A"}, {"title": "Below Average", "text": "Pros Good group of people - this is the only thing that actually kept it bearable. What is it they say about terrible experiences bringing people together?? Fairly good location in London. Cons Many.... A HR department that is unable to do even the most basic of tasks: After getting a new job within the company I attempted to negotiate the salary they offered (which was £10,000 less then they advertised per year). The HR team got someone else in the company to tell me it wasn't possible in passing conversation in the hallway! I don't think you can get any more unprofessional than that, it's shocking. Too many meetings for the sake of it. We used to have meetings about setting up meetings, no lie. Disjointed teams: a result of the previous mergers. Very much still an us and them mentality within the company as a whole. Advice to Management With a 20 word limit to this question you will be lucky to get an answer...", "rating": 3, "pros": "Good group of people - this is the only thing that actually kept it bearable. What is it they say about terrible experiences bringing people together??", "cons": "Many....", "advice": "With a 20 word limit to this question you will be lucky to get an answer..."}, {"title": "Awful place filled with bullies, liars and hypocrites", "text": "Pros Its pretty easy to get away with doing nothing here - most of the managers have made looking busy whilst really just killing time an art form Cons Everything the other reviewers have said here is true Advice to Management Its quite clear that the vast majority of positive reviews on here are plants by the HR department, these people are some of the worst offenders. When is senior management going to wake up and realize that these so called advocates of the employee experience are the ones that created most of the issues being faced? Not only do they treat people without any respect or compassion but they have allowed bullies and under-performers to remain with the business without reprimand, and even stood by as they have progressed and been rewarded in some cases. We can all list cases where it has been one rule for one and something different for a favourite, or where promises have been made and broken, communication broken down and messages not delivered, under-performers given chance after chance because they are well liked, and innovators punished and ostracised for daring to take risks and challenge the status quo. You have had and lost some really great staff in the past few years, through the HR teams failure to act, prevent and manage - people that wanted to make this place better and were villanised for their efforts. No wonder all the good ones threw in the towel and got out. I won't mention any names but not so long ago there was a girl who hated her manager so much that she walked away from a loyalty bonus, with only 1 month left on her contract. She said she just couldn't bear having to fake a smile and no amount of money could compensate for the pure misery of having to spend 30 more days in the presence of someone she disliked and disrespected so intenslely. That's how people feel about working here - it's been going on for so long that most of you don't even see it anymore. Wake up before all the good ones wise up and jump ship.", "rating": 1, "pros": "Its pretty easy to get away with doing nothing here - most of the managers have made looking busy whilst really just killing time an art form", "cons": "Everything the other reviewers have said here is true", "advice": "Its quite clear that the vast majority of positive reviews on here are plants by the HR department, these people are some of the worst offenders. When is senior management going to wake up and realize that these so called advocates of the employee experience are the ones that created most of the issues being faced? Not only do they treat people without any respect or compassion but they have allowed bullies and under-performers to remain with the business without reprimand, and even stood by as they have progressed and been rewarded in some cases. We can all list cases where it has been one rule for one and something different for a favourite, or where promises have been made and broken, communication broken down and messages not delivered, under-performers given chance after chance because they are well liked, and innovators punished and ostracised for daring to take risks and challenge the status quo. You have had and lost some really great staff in the past few years, through the HR teams failure to act, prevent and manage - people that wanted to make this place better and were villanised for their efforts. No wonder all the good ones threw in the towel and got out. I won't mention any names but not so long ago there was a girl who hated her manager so much that she walked away from a loyalty bonus, with only 1 month left on her contract. She said she just couldn't bear having to fake a smile and no amount of money could compensate for the pure misery of having to spend 30 more days in the presence of someone she disliked and disrespected so intenslely. That's how people feel about working here - it's been going on for so long that most of you don't even see it anymore. Wake up before all the good ones wise up and jump ship."}, {"title": "AVOID! unless you desperately need the basic money.", "text": "Pros Good location. If you really need the basic money go for it. Cons The work is menial, they get their money from media reports for clients that truly have no value, surely in no time clients will wise up and stop paying them for this 'analysis'. I won't go into detail how pathetic their 'analysis' is, just STEER WELL CLEAR. Get a job where you will at least be fairly intellectually challenged, where the majority of employees work hard due to having actual decent work not 'analysis', play hard, have ability, and good hygiene. I came from a respectable academic background but even barely able students or workers would find this job a breeze. Advice to Management i'm aware you are con people", "rating": 1, "pros": "Good location. If you really need the basic money go for it.", "cons": "The work is menial, they get their money from media reports for clients that truly have no value, surely in no time clients will wise up and stop paying them for this 'analysis'. I won't go into detail how pathetic their 'analysis' is, just STEER WELL CLEAR. Get a job where you will at least be fairly intellectually challenged, where the majority of employees work hard due to having actual decent work not 'analysis', play hard, have ability, and good hygiene. I came from a respectable academic background but even barely able students or workers would find this job a breeze.", "advice": "i'm aware you are con people"}, {"title": "A good place to work", "text": "Pros The atmosphere on my floor is relaxed and friendly and almost all of the colleagues I have dealt with have been very welcoming and friendly too. There are a lot of people around who are extremely capable and good at their jobs which is a great motivator to improve and provides a benchmark for the level you should be aiming at. I was actually in two minds about whether to post here but, after reading through quite a few negative comments, I felt that I needed to put a few things right. So, with that said... There are next to no problems with the hardware apart from a couple of issues with my PC freezing up which was resolved without any further problems. The PCs themselves are good machines(they were replaced recently and now all run on Windows 7) and everyone has dual screens and a spacious working area and comfortable chair. There are probably a few too many systems to work with than there need to be but this is to be expected after merging companies and does not present a major hindrance to carrying out day to day work. Another thing that I felt I needed to comment on was the negative views toward management. I have no idea of any of the gossip that someone alluded to but, in my experience, the management I have dealt with have been really great to work with. I am trusted to do my work, helped when I ask for it, encouraged to experiment with optimisation and improvements, kept updated of changes, or sometimes even possible changes, and treated with respect. They also seem like pretty nice people who I could definitely have a pint with. I'm not claiming to know every manager in the building but I can definitely say that my experience of the management team here has been nothing but positive. Similarly, I have only good things to say about my hiring process and HR in general. My hiring process was seamless and I was kept updated of the progress all along the way. My interviews were moved to one day, with my approval asked for beforehand, which meant I had one trip less and I found out on the day of interview its outcome. HR here respond to emails promptly which I have never experienced before in any job, and you do not feel treated like a \"human resource\" at all. The three people I have met there were friendly and helpful and have continued to be so. The Wifi code is not given to employees as it is for clients only but your internet access is not restricted in any other than the usual ways, gambling etc. I can't really speak to the previous comments on self-development and promotion as I am not here long enough to see much promotion but I can say that the opportunity to develop yourself is definitely there. There are plenty of online courses on the intranet and I have been encouraged to study and learn. One that I took was probably a little inflexible in the exactness of the correct answers but the facility and intent is there. I have also done a lot of learning for a project that I have taken on and, provided your BAU work continues to meet the agreed standard, you won't, in my experience, be impeded in improving or learning this way. There is also a really great resource available which provides redacted or summarised books on the intranet or to a mobile device. These allow you to get the gist of a book on something interested in but don't have time to read the entire book and is a great resource. Development opportunity is there if you want it. The perks are pretty good too once you come out of your probation with a 50% per month gym discount, cycle to work scheme, season pass loan and others. The offices are nice and bright with lots of space although you do need to go to a different building to visit some departments. The canteen does really good food too with an onsite chef and team at very reasonable prices. Finally, it's in a great location and you're close to a number of gyms, banks, supermarkets, a post office and bars and restaurants which mean you can get a lot done on your lunch break and, most importantly, there is no pressure to stay late and leaving on time is not looked down on. Great place to work with nice and friendly people around you. Cons The salary is lower than I would hope for and, based on my own research, significantly lower than the industry average for my role. Although the company is trying to encourage a greater team spirit(there is a cabinet of employees who run some cool competitions and fun events) they could put a bit more money into it. Having said that, pizza was bought for our floor a few weeks ago but some more company subsidised events would be nice. I've spent about 5 minutes trying to think of another, and can't, so I'll leave it there! In short, with a more generous salary I would have given a 5/5 rating. Advice to Management Keep the lines of communication open and keep employees up to date and in the loop with upcoming changes. Keep acting transparently. Review salaries with regard to National and London averages. There are people with a very, very niche skill set(I'm thinknig of the Production floor in particular) which would, I imagine, be difficult to replace. I am not sure of their salary but, if it is what I see listed on Glassdoor, then it would seem that a salary review is something that management could look into.", "rating": 5, "pros": "The atmosphere on my floor is relaxed and friendly and almost all of the colleagues I have dealt with have been very welcoming and friendly too. There are a lot of people around who are extremely capable and good at their jobs which is a great motivator to improve and provides a benchmark for the level you should be aiming at.", "cons": "The salary is lower than I would hope for and, based on my own research, significantly lower than the industry average for my role.", "advice": "Keep the lines of communication open and keep employees up to date and in the loop with upcoming changes."}, {"title": "Great opportunity to start a career", "text": "Pros The recruitment process was surprisingly very enjoyable. I was thoroughly supported and was kept up-to-date throughout the entire process. I was not ‘forgotten’ or ‘ignored’ by the HR but treated as an individual rather than another interviewee. I was not pressured to give my decision immediately and began working at Gorkana at a date mutually convenient for me and the company. The HR adviser was very friendly, helpful and answered all of my many emails and made me feel comfortable throughout the interview stage. Joining the company was not stressful or confusing, everything was explained to me in detail and all of the necessary information was sent out to me prior to my Induction Day. There was plenty of contact from the company up to and on the day of the induction, so I knew exactly where to go and what to do. Gorkana offers plenty of introduction and training, you are not “thrown in at the deep end” and expected to know everything by the end of the first week. You are supported throughout your integration into the company and gradually introduced to your role. There are lots of great people working at the company and everyone is always ready to help you or explain anything you are not sure about. I was stricken by the number of internal promotions taking place within my team alone. So my general understanding is if you are hard working you can have a great potential for promotion and growth within the company. Your hard work is definitely recognised within the team and there is no excuse of not getting to know your colleagues because there are plenty of social outings on offer. Cons The Induction Day could be shorter as there was a lot of waiting around for the next speaker, but you did have a chance to meet your fellow recruits. We had plenty of training but it would be better if you are introduced to your clients and responsibilities sooner so you can begin implementing your new knowledge in practice. Advice to Management To continue rewarding and recognising the hard work of your employees.", "rating": 5, "pros": "The recruitment process was surprisingly very enjoyable. I was thoroughly supported and was kept up-to-date throughout the entire process. I was not ‘forgotten’ or ‘ignored’ by the HR but treated as an individual rather than another interviewee. I was not pressured to give my decision immediately and began working at Gorkana at a date mutually convenient for me and the company. The HR adviser was very friendly, helpful and answered all of my many emails and made me feel comfortable throughout the interview stage.", "cons": "The Induction Day could be shorter as there was a lot of waiting around for the next speaker, but you did have a chance to meet your fellow recruits. We had plenty of training but it would be better if you are introduced to your clients and responsibilities sooner so you can begin implementing your new knowledge in practice.", "advice": "To continue rewarding and recognising the hard work of your employees."}, {"title": "Poor treatment of production staff", "text": "Pros Working as a reader fairly easy job, set hours, overtime was available most weekends, ok bonus structure Keeps you up to date with current affairs Cons Not much room for progression, very strict management who had favorites, very strict on time management, some groups very clichy and not friendly to new starters Advice to Management Talk to staff and not at them. Touch base more with production staff", "rating": 1, "pros": "Working as a reader fairly easy job, set hours, overtime was available most weekends, ok bonus structure", "cons": "Not much room for progression, very strict management who had favorites, very strict on time management, some groups very clichy and not friendly to new starters", "advice": "Talk to staff and not at them. Touch base more with production staff"}, {"title": "Media Executive", "text": "Pros There is no pros for this position. Obviously many other reviews have been written by HR and don't reflect what's really happening in this company. You will be doing the most stupid job someone can do in his life so if you don't want to use your brain it's perfect. Don't spend more than 1 month in this company. You will love this job if you have a background from MacDonald, you will think it's a slight improvement. You will hate it if you have any dignity and have done any serious job before. Cons Gorkana is terrible the management is extremely bad, there is no training, other employees are very bad (how shocking to see 22 years old young graduate not able to use Excel or Powerpoint at all, what did you learn?). Basically you will find many inefficient people showing off all the day and you will not even know why. There is a strong drink culture with people happy to get drunk for no reason and a high-school atmosphere. The work by itself is wretched, a part of the team does not work at all and play around all the day faking reporting and showing off during weekly meetings. This is totally understandable when you know the average salary, the tasks and how the management treat you. Just try to be late 2 minutes and you will get a warning from the management trying to belittle you even though most of people don't work all the day. There is no room for improvement, no training option, low benefits, no added value on a CV. I staid more than a year and saw many people leaving for another job in marketing, journalism, communications (for those who were able to find another job). Regarding ethic this job is terrible, you will stalk people on the phone all the day, trying to get information from journalists doing their job and flirting with the non-respect of privacy. Advice to Management Change the management, you are too bad. Train people and teach them how to work properly. Lean how to automate very simple process (don't you know how to code and create software?) in order to gain time. Increase salary and change the recruitment policy. Stop recruiting useless people on no-basis, hire true professional with relevant degrees and experience.", "rating": 1, "pros": "There is no pros for this position. Obviously many other reviews have been written by HR and don't reflect what's really happening in this company. You will be doing the most stupid job someone can do in his life so if you don't want to use your brain it's perfect. Don't spend more than 1 month in this company. You will love this job if you have a background from MacDonald, you will think it's a slight improvement. You will hate it if you have any dignity and have done any serious job before.", "cons": "Gorkana is terrible the management is extremely bad, there is no training, other employees are very bad (how shocking to see 22 years old young graduate not able to use Excel or Powerpoint at all, what did you learn?). Basically you will find many inefficient people showing off all the day and you will not even know why. There is a strong drink culture with people happy to get drunk for no reason and a high-school atmosphere. The work by itself is wretched, a part of the team does not work at all and play around all the day faking reporting and showing off during weekly meetings. This is totally understandable when you know the average salary, the tasks and how the management treat you. Just try to be late 2 minutes and you will get a warning from the management trying to belittle you even though most of people don't work all the day.", "advice": "Change the management, you are too bad. Train people and teach them how to work properly. Lean how to automate very simple process (don't you know how to code and create software?) in order to gain time. Increase salary and change the recruitment policy. Stop recruiting useless people on no-basis, hire true professional with relevant degrees and experience."}, {"title": "Account Executive", "text": "Pros Extremely helpful and friendly team, strong team spirit, team events (team nights out, sports events...) Career development opportunities Entry level position Interesting insight into client's PR campaigns Extensive training Onsite canteen Cons Length of training - a bit too long before we actually get started", "rating": 5, "pros": "Extremely helpful and friendly team, strong team spirit, team events (team nights out, sports events...)", "cons": "Length of training - a bit too long before we actually get started", "advice": null}, {"title": "Intentionally amending Glassdoor reviews", "text": "Pros I am glad to see that people are actually speaking out on this obviously amended reviews left by the HR department. I hope others who used to work here speak up to let everyone know the kind of place and working culture this place has. Cons There is no proper structure in the tasks given. Preferential treatment is so common that alot of people spend more time trying to look good in front of management than actually do any work. To make matters worse, this gets rewarded. Working late hours without any Overtime pay is very common and expected. Most of the people working there do not last even for a year and start looking for jobs the moment they join the company. Advice to Management Improve the way things are being done rather than trying to sell yourself as a very good company. It is better for everyone involved and people might actually want to join if there is some shred of honesty left.", "rating": 1, "pros": "I am glad to see that people are actually speaking out on this obviously amended reviews left by the HR department. I hope others who used to work here speak up to let everyone know the kind of place and working culture this place has.", "cons": "There is no proper structure in the tasks given. Preferential treatment is so common that alot of people spend more time trying to look good in front of management than actually do any work. To make matters worse, this gets rewarded. Working late hours without any Overtime pay is very common and expected. Most of the people working there do not last even for a year and start looking for jobs the moment they join the company.", "advice": "Improve the way things are being done rather than trying to sell yourself as a very good company. It is better for everyone involved and people might actually want to join if there is some shred of honesty left."}, {"title": "Great development opportunities; inconsistent management", "text": "Pros There is ample opportunity to learn and develop. Junior employees will learn a great deal about software and in-house technologies, and will also develop skills in client/stakeholder relations. More senior employees will receive plenty of opportunities to develop their people management skills. Gorkana Group deals with a huge variety of clients and third-party service providers around the world, so employees are able to build their own networks of skilled and experienced people. Hard-working employees will be trusted to implement and run their own projects. More often than not, their direct managers will give them freedom and leeway to make their own mistakes, which allows them to learn and improve along the way. Not many organisations will allow this flexibility. As a result of this employees have the ability to vary their tasks and responsibilities, meaning the day-to-day job is less likely to become tedious. For the most part, rewards, recognition and career progression are based on meritocracy. Cons Gorkana Group essentially consists of three companies, which were amalgamated into one group on the back of merger & acquisition activity. Approximately five years later, there are still significant issues around proper integration. This is obviously a major challenge for any business, but there are some aspects which could/should have been handled better. From my personal experience, the main issue lies with the inconsistency between the company's main departments in numerous key areas: investment in systems and technology; consistency in transparency and communication; resource and workload management; salary and bonus structures. This manifests itself in different ways. It can be something as simple as a particular message being filtered down to one department, but not another. Or in more extreme examples, one department having a disproportionately imbalanced workload compared to others, yet not having in place an appropriate mechanism for recognising and rewarding employees. Advice to Management Continue flexible approach to career development. It is definitely succeeding in the areas in which it is being applied. Acknowledge and rectify major inconsistencies across departments. Or, at the very least, issue strong justification on why these inconsistencies need to be in place. Do away with favouritism and introduce accountability across the board, not just in convenient areas.", "rating": 3, "pros": "There is ample opportunity to learn and develop. Junior employees will learn a great deal about software and in-house technologies, and will also develop skills in client/stakeholder relations. More senior employees will receive plenty of opportunities to develop their people management skills.", "cons": "Gorkana Group essentially consists of three companies, which were amalgamated into one group on the back of merger & acquisition activity. Approximately five years later, there are still significant issues around proper integration. This is obviously a major challenge for any business, but there are some aspects which could/should have been handled better.", "advice": "Continue flexible approach to career development. It is definitely succeeding in the areas in which it is being applied."}, {"title": "IT manager", "text": "Pros there are no reasons to work Cons there are no cons to work Advice to Management change", "rating": 3, "pros": "there are no reasons to work", "cons": "there are no cons to work", "advice": "change"}, {"title": "Friendly and fun place to work", "text": "Pros Fantastic team, great opportunities for growth, real sense of community. Cons Offices could be better - 3 separate offices and a nightmare to book meeting rooms.", "rating": 5, "pros": "Fantastic team, great opportunities for growth, real sense of community.", "cons": "Offices could be better - 3 separate offices and a nightmare to book meeting rooms.", "advice": null}, {"title": "Working with Gorkana is an Experience, Management Sucks!", "text": "Pros Kind of relaxed atmosphere. Can be very pleasent when everything is running smoothly unitll somebody decides to play teacher in the playground. Cons Have been with the comapny for some time now and seen it all, from favourtism to making up rules as managers/supervisors go along. They dont know how to manage people and only pisss them off wich then results in negativity and loss in production. Managers/Supervisors taking days off and not booking them off and getting away with it, whilst reguler staff have to follow booking time off protocols. Also taking untold amout of breaks which 1 could say amount to half a day at work of work. Advice to Management Look into this. Dont know if this will make a difference.", "rating": 3, "pros": "Kind of relaxed atmosphere. Can be very pleasent when everything is running smoothly unitll somebody decides to play teacher in the playground.", "cons": "Have been with the comapny for some time now and seen it all, from favourtism to making up rules as managers/supervisors go along.", "advice": "Look into this. Dont know if this will make a difference."}, {"title": "Great, ambitious company with huge opportunity to grow in an exciting industry.", "text": "Pros Comprehensive training and support Good opportunities Superb client base making every client meeting interesting Opportunity to travel Undisputed market leader in UK and strong growth in Europe and USA Cons Less internal meetings required leaving more time for the exciting client work Need to continue investing in tomorrows technology and solutions to retain market leading position Advice to Management Remove some of the internal meetings Continue to identify the team members who make a difference and reward and promote them In the face of the new enlarged company ensure communication channels remain open and all employees understand and can contribute to the plan.", "rating": 5, "pros": "Comprehensive training and support", "cons": "Less internal meetings required leaving more time for the exciting client work", "advice": "Remove some of the internal meetings"}, {"title": "Average company with a diverse workforce, little room for career development though.", "text": "Pros Pleasant enough work environment. Ambitious management team. Working in media can be interesting at times. Flexible working hours a positive. Central London location. Cons Very average salary. Little potential for career development. Reluctant to utilise knowledge and experience of longer serving staff members. Lack of respect between departments. Work can become repetitive. Equipment and IT systems outdated. Advice to Management Create more opportunities for career development. You should encourage recruiting internally. There are staff with years of experience and company knowledge that are simply overlooked and ignored. The production department gets neglected, even though the entire company is reliant on their performance.", "rating": 3, "pros": "Pleasant enough work environment. Ambitious management team. Working in media can be interesting at times. Flexible working hours a positive. Central London location.", "cons": "Very average salary. Little potential for career development. Reluctant to utilise knowledge and experience of longer serving staff members. Lack of respect between departments. Work can become repetitive. Equipment and IT systems outdated.", "advice": "Create more opportunities for career development. You should encourage recruiting internally. There are staff with years of experience and company knowledge that are simply overlooked and ignored. The production department gets neglected, even though the entire company is reliant on their performance."}, {"title": "An unhappy place to work", "text": "Pros Great client base and some fantastic, extremely hardworking staff. Cons The fundamental problem is the management which is largely incompetent and dependent on inane and outdated management theories that lay a heavy and unnecessary bureaucratic burden on staff. Morale is abysmally low as a result. Some managers are simply psychologically unsuited to being in positions of power and routinely ignore or play petty mind games with staff, rampantly discriminating against those not in favor. As a consequence there is a complete lack of trust or respect between staff and management. Interdepartmental battles are rife, which can obstruct the simplest task and delay progress. There is a worrying lack of appreciation for employees who are subject to an abundance of petty rules, financial penalties and unnecessary bureaucracy. Wages are low and turnover is high. The management appears to be blatantly uninterested in retaining staff and is frequently antagonistic towards long-serving employees. The job is routinely talked down, from executive level downwards, which makes for a frustrating experience. Hard work is not appreciated here, and indeed is actively discouraged if it challenges the statistical average that the management appears obsessed with. The obviously planted reviews on this site by HR/management illustrate how uninterested the company is in addressing some of the problems that are hindering its development. Advice to Management Nothing will change while you have long-serving managers who dislike staff - replace them. Value the employees who actually do the work, treat them decently and pay them properly.", "rating": 1, "pros": "Great client base and some fantastic, extremely hardworking staff.", "cons": "The fundamental problem is the management which is largely incompetent and dependent on inane and outdated management theories that lay a heavy and unnecessary bureaucratic burden on staff. Morale is abysmally low as a result.", "advice": "Nothing will change while you have long-serving managers who dislike staff - replace them. Value the employees who actually do the work, treat them decently and pay them properly."}, {"title": "Don't work here if you are ambitious", "text": "Pros 1) Friendly colleagues, people will help whenever they can Cons 1) Poor salaries 2) Limited career progression 3) Uncooperative HR 4) Unequal distribution of work Advice to Management You will lose your best talent because you treat almost everyone as if they are dispensable.", "rating": 3, "pros": "1) Friendly colleagues, people will help whenever they can", "cons": "1) Poor salaries", "advice": "You will lose your best talent because you treat almost everyone as if they are dispensable."}, {"title": "Terrible Managers they're only good at favouritism.", "text": "Pros Good place to learn for new starters who don't have enough experience Cons low salary no room for career improvements whatsoever. Favouritism you do all the work and the next guy gets all the praises for it.. its so glaring its one rule for A and another rule for B Advice to Management employ people those who know their stuffs and pay them good money so you don't keep loosing talents. in the past 3 months loads of people have left and they're still leaving the company cant seem to hold on to ones who are good at what they do.", "rating": 1, "pros": "Good place to learn for new starters who don't have enough experience", "cons": "low salary no room for career improvements whatsoever.", "advice": "employ people those who know their stuffs and pay them good money so you don't keep loosing talents. in the past 3 months loads of people have left and they're still leaving the company cant seem to hold on to ones who are good at what they do."}, {"title": "very bad untrained managers, demotivating and they really couldn't care less about you", "text": "Pros lovely working colleagues and pretty nice office Cons horrible management - they do not listen to you and only think of themselves. completely untrained and unskilled people are put straight into management positions. you will get ahead if you \"get in with the right people/management\" no training given and career progression is only for those who become the apple of a managers eye somehow poor salaries Advice to Management LISTEN to your staff if you want ot get the best out of them. Or you will just get an average effort. If you do not give a toss about them - they will not give a toss about you - or Gorkana - and you will be used, just like you use people.", "rating": 1, "pros": "lovely working colleagues and pretty nice office", "cons": "horrible management - they do not listen to you and only think of themselves. completely untrained and unskilled people are put straight into management positions. you will get ahead if you \"get in with the right people/management\"", "advice": "LISTEN to your staff if you want ot get the best out of them. Or you will just get an average effort."}, {"title": "Amazing opportunities and great culture", "text": "Pros - Great people to learn from and laugh with - Lot's of internal promotions so if you work hard you can do well - Work with outstanding clients (Samsung, Apple, Visa, Ikea, Activision, Danone, Unilever, Barclay's, Vodafone etc.) - Good work/life balance - Decent work kit - everyone gets two screens which makes work easier Cons - Although we had some training more would have been nice - We could celebrate our successes more, as we're definitely doing well given the financial climate. Advice to Management Gorkana has some great clients, partners and staff so they should continue to utilise that available knowledge to generate whitepapers/blogs/events which will keep positioning Gorkana as a thought leader.", "rating": 5, "pros": "- Great people to learn from and laugh with", "cons": "- Although we had some training more would have been nice", "advice": "Gorkana has some great clients, partners and staff so they should continue to utilise that available knowledge to generate whitepapers/blogs/events which will keep positioning Gorkana as a thought leader."}, {"title": "In a solid position to grow and dominate, but needs to bring staff on the journey.", "text": "Pros Clients value the brand highly but there is room to improve in various areas. There is generally a professional culture and a can-do approach to solving problems. Good to work among lots of bright and hard-working people. Cons The company has made some painful changes in the past, some of which have been good but some haven't and the business has lost quite a few good people whilst some who should really have moved on are still there. There's a lot of talk about the importance of people but not enough practice of it. Advice to Management Focus on developing and retaining talented staff. Seize the opportunity to make bold new changes for the better and don't just focus on margins.", "rating": 5, "pros": "Clients value the brand highly but there is room to improve in various areas. There is generally a professional culture and a can-do approach to solving problems. Good to work among lots of bright and hard-working people.", "cons": "The company has made some painful changes in the past, some of which have been good but some haven't and the business has lost quite a few good people whilst some who should really have moved on are still there. There's a lot of talk about the importance of people but not enough practice of it.", "advice": "Focus on developing and retaining talented staff. Seize the opportunity to make bold new changes for the better and don't just focus on margins."}, {"title": "Poor pay, long hours, lack of support", "text": "Pros There is a small proportion of employees who are very good at what they do and who can help you learn a lot in a very small space of time. Cons Do not become good at your job here. There is a direct correlation between how good you are here and the increasing number of hours you will work. This is particularly true of the analysis team, where it seems to be standard to have a good portion of their employees working 50+ hours each week on average. There is a lot of talk about working on one's personal/professional development but that is often preached by managers and operational heads who are untrained. Assume this to mean development for the department regardless of whether it is of interest to you. Advice to Management When churn is so high, you really need to address the problem at the core. Stop just restocking with newer employees and make sure you're able to retain the current workforce.", "rating": 3, "pros": "There is a small proportion of employees who are very good at what they do and who can help you learn a lot in a very small space of time.", "cons": "Do not become good at your job here. There is a direct correlation between how good you are here and the increasing number of hours you will work. This is particularly true of the analysis team, where it seems to be standard to have a good portion of their employees working 50+ hours each week on average.", "advice": "When churn is so high, you really need to address the problem at the core. Stop just restocking with newer employees and make sure you're able to retain the current workforce."}, {"title": "DO NOT JOIN THIS COMPANY.", "text": "Pros Nice people, quite a cheap staff canteen. I am really reaching for these. Cons Dreadful management who lack wit, creativity or even a basic understanding of the industry that they operate in. Systems are old and creaking. Advice to Management I honestly do not know where to start", "rating": 1, "pros": "Nice people, quite a cheap staff canteen. I am really reaching for these.", "cons": "Dreadful management who lack wit, creativity or even a basic understanding of the industry that they operate in. Systems are old and creaking.", "advice": "I honestly do not know where to start"}, {"title": "Enjoyable", "text": "Pros There is a pretty good culture within Gorkana of making sure all employees feel at home and they have the opportunity to bond as a team. It's important to get out and meet journalists and they helped with that Cons Not great opportunities for progression within the company from the level I started at. It did feel a little siloed at times Advice to Management Be more open and transparent with staff - training of staff could be improved", "rating": 5, "pros": "There is a pretty good culture within Gorkana of making sure all employees feel at home and they have the opportunity to bond as a team. It's important to get out and meet journalists and they helped with that", "cons": "Not great opportunities for progression within the company from the level I started at. It did feel a little siloed at times", "advice": "Be more open and transparent with staff - training of staff could be improved"}, {"title": "Mixed feelings", "text": "Pros Gorkana has one of the greatest and varied client bases in the world, and you will gain experience dealing with customers in all sectors from retail and public sector through to FTSE 500. Cons Management is a shambles. A lot of micro managing and middle management who seem to have no idea what they are doing, yet are paid a substantial amount of money for essentially doing nothing. There is a lot of favouritism, meaning that if you are not liked or happen to not be a well known face your career is effectively stunted until you move elsewhere, regardless of how good you are at the job. HR policies are a joke and many people feel frustrated with the lack of support provided. Unfortunately the only thing that kept my job enjoyable was my interaction with clients who fully appreciated the lengths you would go to, to ensure they were happy. The down side is that this was wildly unnoticed and under appreciated by Gorkana management. No matter how hard you try or how good you are at your job if you are not on their list of favourites you will get no where. It was 3 years if banging my head against a wall. Advice to Management Pull your head out of your ar*es and look at the staff you have. So many people are under valued and over worked.", "rating": 3, "pros": "Gorkana has one of the greatest and varied client bases in the world, and you will gain experience dealing with customers in all sectors from retail and public sector through to FTSE 500.", "cons": "Management is a shambles. A lot of micro managing and middle management who seem to have no idea what they are doing, yet are paid a substantial amount of money for essentially doing nothing.", "advice": "Pull your head out of your ar*es and look at the staff you have. So many people are under valued and over worked."}, {"title": "Talented people in a business that is starting to grow together", "text": "Pros - High levels of talent and ability in specialist roles - Three businesses recently merging, makes this feel like a new venture; uncertain but exciting - Easy to approach and work with others across the business - Everyone wants to do their job well, good work ethics Cons - IT systems are very very outdated - Managers need to be more effective and have more resources available to develop people - Need more opportunity and proper support to progress internally and be successful Advice to Management The managers need to be developed more to manage, communicate with, and develop their people. The people need to be inspired with genuine recognition. The business needs a transparent goal and vision that everyone know where they contribute.", "rating": 5, "pros": "- High levels of talent and ability in specialist roles", "cons": "- IT systems are very very outdated", "advice": "The managers need to be developed more to manage, communicate with, and develop their people."}, {"title": "I great place to start your career and get shown the ropes", "text": "Pros On the whole people are very down to earth whether it be the top brass or the production teams. A great location with Shoreditch only a short walk away and the company is actively trying to improve it's culture although it has some work still to do. The company has had steady year on year growth all through the recession and with it's great reputation in it's sector that will only get better as the UK economy gets going. With the company growing opportunities will present themselves to those who work hard and deserve it. With the dust settling after two mergers, between Durrants and Metrica,and then Durrants and Gorkana, there are still some transitions being made in the running of the organisation so things here are only going to get better. Cons A few areas of the company such as analysis and the news teams offer little opportunity for career progression other than into sales jobs, which might not be for everyone if you hope to progress internally. That said, working in these teams will set you up very well to move out into the wider PR and Media Analysis industries. Advice to Management Value the input of your newer staff as some feel they are often ignored. In my time at the company I've seen a steady increase in the calibre of newer recruits so it would be a shame to waste these talents. Don't over work your analysts. No people in the company work hours as long as they do; their work is more demanding than the other 'production' areas of the business; and no where in the organisation is competition to stand out more fierce. Staff in these teams should get more recognition for their hard work, and should be rewarded more appropriately.", "rating": 5, "pros": "On the whole people are very down to earth whether it be the top brass or the production teams.", "cons": "A few areas of the company such as analysis and the news teams offer little opportunity for career progression other than into sales jobs, which might not be for everyone if you hope to progress internally. That said, working in these teams will set you up very well to move out into the wider PR and Media Analysis industries.", "advice": "Value the input of your newer staff as some feel they are often ignored. In my time at the company I've seen a steady increase in the calibre of newer recruits so it would be a shame to waste these talents."}, {"title": "Do not join this business", "text": "Pros If you are thinking of setting up you own business in the PR industry, Gorkana will show you exactly how not to do it. Cons I honestly don't know where to start. The main problem comes from the top as the majority of the management team don't want to be there. They are only interested in selling the business and making a quick buck. Sales and account management teams are under enormous pressure to bring on and manage new business with unachievable targets. Customers are left with a poor service and broken promises - eventually they terminate the contract. Gorkana employees miss targets and leave... the cycle goes on. There is a lack of passion, drive, innovation and development. Advice to Management - Set an example - Stop blaming junior members of staff for your poor decisions - Listen to your client's needs and stop giving them what you think they need", "rating": 1, "pros": "If you are thinking of setting up you own business in the PR industry, Gorkana will show you exactly how not to do it.", "cons": "I honestly don't know where to start.", "advice": "- Set an example"}, {"title": "Lots of work, little recognition", "text": "Pros Good benefit package. Group of hard working colleagues who make the day bearable. Cons Long list of cons: If you arrive at 9:04, you get a disciplinary hearing. If you miss work because you were ill, you get asked by HR (a department with more than a dozen employees!) how you plan to prevent getting ill again. The sales department routinely oversells and no one in analysis stands up and says some requests can't be done. Working twelve hours a day is a regular feature, but then someone else gets promoted because the operations department likes them better, regardless of actual performance. The analysis department has been reconfigured some five times in two years, but that still hasn't prevented and average of two employees per month leaving. Advice to Management Reduce bureaucracy and micro-management and focus on making life easier. Really try to care about the staff and not just pretend with constant streams of emails and meetings that just sap working time.", "rating": 1, "pros": "Good benefit package. Group of hard working colleagues who make the day bearable.", "cons": "Long list of cons: If you arrive at 9:04, you get a disciplinary hearing. If you miss work because you were ill, you get asked by HR (a department with more than a dozen employees!) how you plan to prevent getting ill again. The sales department routinely oversells and no one in analysis stands up and says some requests can't be done. Working twelve hours a day is a regular feature, but then someone else gets promoted because the operations department likes them better, regardless of actual performance. The analysis department has been reconfigured some five times in two years, but that still hasn't prevented and average of two employees per month leaving.", "advice": "Reduce bureaucracy and micro-management and focus on making life easier. Really try to care about the staff and not just pretend with constant streams of emails and meetings that just sap working time."}, {"title": "Horrible", "text": "Pros No Pros I wont find any pros. Cons Very lengthy interview process interviewer doesn't know what exactly he/she is looking for. No career opportunity. Advice to Management Don't select people on religion basis. Please select candidate on knowledge basis. Needs to replace manager staff.", "rating": 1, "pros": "No Pros", "cons": "Very lengthy interview process interviewer doesn't know what exactly he/she is looking for.", "advice": "Don't select people on religion basis. Please select candidate on knowledge basis."}, {"title": "Terrible", "text": "Pros None. There is no pro of working here other than to get experience to move onto a better role elsewhere Cons Literally everything. Management is a total shambles and hires purely from favoritism. In turn this leads to more managers than working staff with none of them holding any experience. There is so much wrong with how this business is run it would take me a lifetime to list it all. Advice to Management Listen to your staff, grow your staff and get rid of the corporate facade. You are a media company, act like one!", "rating": 1, "pros": "None. There is no pro of working here other than to get experience to move onto a better role elsewhere", "cons": "Literally everything. Management is a total shambles and hires purely from favoritism. In turn this leads to more managers than working staff with none of them holding any experience.", "advice": "Listen to your staff, grow your staff and get rid of the corporate facade. You are a media company, act like one!"}, {"title": "great learning experience, open culture combined with hard work", "text": "Pros Positive open culture good learning environment for graduates Cons Not the best pay around if you're in data management Advice to Management Reward key skills in employees that really add value", "rating": 5, "pros": "Positive open culture", "cons": "Not the best pay around if you're in data management", "advice": "Reward key skills in employees that really add value"}, {"title": "Badly run and devoid of innovation and logic. Truly shambolic", "text": "Pros It used to have some good people working there. But most have now left. I shouldn't imagine there are any positives now. Unless you like coming to work, pretending to work and getting paid for it (including randomly generated bonuses). Cons Where to start. At the top? The management. They are never there... and have little or no experience of the sector. There is a resistance to change and accept new ideas and so the brightest of people that want to improve the offering will inevitably become frustrated. It is clear no one wants to be there and most are hanging around for the company to sell so they can collect their pay cheques. They are not interested in the long term future of the company or the employees. And on the subject of bright people - they are not rewarded with promotion. Some people brought in huge amounts of money and never saw any progression, but those that were seen to be malleable and \"yes men/women\" get promoted into management positions. These people usually lack the relevant managerial experience, are well paid and there are too many of them, so they bicker constantly and get nothing done. There is no respect between management and those producing revenue and a huge cultural difference between the three merged companies. Bonuses in media monitoring are paid according to how many pieces of coverage a client has generated in the press. This is rather rudimentary to say the least - how can you be paid a bonus on something completely out of your control? In addition, often there will be an internal change in ownership, meaning Gorkana doesn't lose the revenue, but the salesperson is penalised nonetheless. Targets are set by an random estimation of how much coverage will be generated over 12 months. If a client is working on a short project it doesn't count, despite Gorkana making money. Basically, they whole thing is extremely confusing and there is no audit trail so you can never find out what has happened and prove or disprove your bonus payments. In Analysis, pricing is so rigid that you cannot compete with the other providers in the sector. Prices are too high for monitoring and evaluation because everything is manual and so operational costs must be astronomical. Having 3 or 4 people check if something is relevant to a client (and for them to still get it wrong) is just crazy given the capability of modern technology. The tech won't be upgraded as the printers are stuck on Windows 2000, and so are the operating systems, and the internal software. So it is bordering on 14 years out of date. And I think that really says it all. Advice to Management Make a choice - either run it into the ground and go bust (seems to be the plan). Or have a rethink and start investing in modern technology and innovative ideas to challenge and provoke the industry, not lag behind it. And don't think you won't suffer when good people leave. Very rarely are they replaced and this has meant a very steady decline.", "rating": 1, "pros": "It used to have some good people working there. But most have now left. I shouldn't imagine there are any positives now. Unless you like coming to work, pretending to work and getting paid for it (including randomly generated bonuses).", "cons": "Where to start. At the top? The management. They are never there... and have little or no experience of the sector. There is a resistance to change and accept new ideas and so the brightest of people that want to improve the offering will inevitably become frustrated. It is clear no one wants to be there and most are hanging around for the company to sell so they can collect their pay cheques. They are not interested in the long term future of the company or the employees.", "advice": "Make a choice - either run it into the ground and go bust (seems to be the plan). Or have a rethink and start investing in modern technology and innovative ideas to challenge and provoke the industry, not lag behind it. And don't think you won't suffer when good people leave. Very rarely are they replaced and this has meant a very steady decline."}, {"title": "Brilliant company", "text": "Pros It's a really great business - the work is interesting, there is a brilliant team of people working across varied accounts and it is an excellent place to learn about the PR industry. Cons The MD just left which is a massive shame and it remains to be seen if the culture the company thrived with remains without him leading the business. Advice to Management Don't go changing too much!", "rating": 5, "pros": "It's a really great business - the work is interesting, there is a brilliant team of people working across varied accounts and it is an excellent place to learn about the PR industry.", "cons": "The MD just left which is a massive shame and it remains to be seen if the culture the company thrived with remains without him leading the business.", "advice": "Don't go changing too much!"}, {"title": "A sinking ship where skills and commitment frequently go unrewarded; operationally a complete shambles", "text": "Pros You get exposure to the media, PR & comms industry. The skills you develop are increasingly valuable and transferable (e.g. social media analysis, analytics, client insight, project management). You will get to work on accounts for well-known, interesting companies (across potentially various sectors). You are encouraged to get involved in helping the marketing team with blog posts and attendance at networking events. The location (Old Street) is ace, the subsidised canteen is decent and you can look forward to working with an overall nice bunch of people aged 23-35 from a wide range of backgrounds. Also: pension plan with 5% salary match and subsidised gym membership. Cons Oh boy, where to start? When I joined, the media analysis department was in the process of heavy expansion and restructuring (a merger had just taken place between three companies: Gorkana, Metrica and Durrants). Sadly, no thought went into how to do this smoothly or successfully. Anything resembling a training structure went out the window; ditto mentoring and development. Essentially you join, loads of work gets thrown at you and you just learn through trial and error. If you're lucky you get to work under encouraging, knowledgeable and experienced managers on at least a few accounts. But you're also guaranteed to work under multiple managers who are incompetent or uninterested. If despite initial disappointments and frustrations you keep giving it 100%, become a reliable worker, uphold quality and generally keep your clients and teammates happy, upper management will rarely show gratitude; you'll most likely be rewarded with a heavier workload. And don't expect this to coincide with a pay rise or promotion. These seem to be handed out in ways that are often arbitrary, illogical and lacking in transparency. Positive appraisals, client feedback or peer reviews do not appear to be worth anything. Of course, not all promotions are undeserved, but at anywhere from a third to half tend to be premature or unjustified. Similarly, many external hires, especially at middle-management or director level, have been ill-thought-out: people have been hired who have little interest or knowledge of the industry, poor people skills and no analytical capacity. If so much is wrong, you may ask, isn't upper management aware and trying to find remedies? Well, even though there is meant to be continuous dialogue between upper management and middle management and those below, and even though the operational, account and sales teams are meant to communicate and align themselves, it just doesn't seem to happen. Attempts to improve processes have consistently failed and employee input is not taken seriously-- which is really a shame, because it is a company in an interesting industry with some good tools in place, access to rich data and an impressive roster of clients. Advice to Management Listen to your employees, admit to and rectify mistakes, and properly nurture potential", "rating": 1, "pros": "You get exposure to the media, PR & comms industry. The skills you develop are increasingly valuable and transferable (e.g. social media analysis, analytics, client insight, project management). You will get to work on accounts for well-known, interesting companies (across potentially various sectors). You are encouraged to get involved in helping the marketing team with blog posts and attendance at networking events. The location (Old Street) is ace, the subsidised canteen is decent and you can look forward to working with an overall nice bunch of people aged 23-35 from a wide range of backgrounds. Also: pension plan with 5% salary match and subsidised gym membership.", "cons": "Oh boy, where to start? When I joined, the media analysis department was in the process of heavy expansion and restructuring (a merger had just taken place between three companies: Gorkana, Metrica and Durrants). Sadly, no thought went into how to do this smoothly or successfully. Anything resembling a training structure went out the window; ditto mentoring and development.", "advice": "Listen to your employees, admit to and rectify mistakes, and properly nurture potential"}, {"title": "Good benefits, but horrible management", "text": "Pros generous benefits package (health/dental insurance, discounted gym membership, loyalty awards etc), good office location near Shoreditch: if your work day gets you down, at least there's 10 great bars nearby Cons dull work, top heavy management, difficult to progress, long hours for salary level, constant draconian rules implemented by middle managers", "rating": 3, "pros": "generous benefits package (health/dental insurance, discounted gym membership, loyalty awards etc), good office location near Shoreditch: if your work day gets you down, at least there's 10 great bars nearby", "cons": "dull work, top heavy management, difficult to progress, long hours for salary level, constant draconian rules implemented by middle managers", "advice": null}, {"title": "Senior Account Executive", "text": "Pros Good to build relationships with PRs Cons Very unprofessional work environment and bad management Advice to Management Look up the definition of meritocracy", "rating": 3, "pros": "Good to build relationships with PRs", "cons": "Very unprofessional work environment and bad management", "advice": "Look up the definition of meritocracy"}, {"title": "Freelance Media Analyst", "text": "Pros - Good place to go to if you're studying and speak several languages. - You decide how much you work and they respect that. - Very friendly and helpful superiors. - Should you want, it makes applying for a permanent more senior position easier. Cons - Pay could be better, but then it is part-time freelance job. - No benefits. - The work can get repetitive. Advice to Management The pay that freelancers receive is too uniform. Analysis if different client can vary greatly in terms of time and effort needed, this is not reflected in the pay you receive.", "rating": 5, "pros": "- Good place to go to if you're studying and speak several languages.", "cons": "- Pay could be better, but then it is part-time freelance job.", "advice": "The pay that freelancers receive is too uniform. Analysis if different client can vary greatly in terms of time and effort needed, this is not reflected in the pay you receive."}]