[{"title": "Hasn't lost its entrepreneurial edge", "text": "Pros Empowered to make decisions and drive action across the organization. Company focus on personal development and growth. Management and peers open to new ideas. Fast-paced, ever-changing, company has tons of growth potential Cons Very direct communication style. Can get talked over easily. Organization can feel siloed depending on the group. Everyone stretched thin Advice to Management Find times to give positive feedback to the company outside of all hands", "rating": 5, "pros": "Empowered to make decisions and drive action across the organization. Company focus on personal development and growth. Management and peers open to new ideas. Fast-paced, ever-changing, company has tons of growth potential", "cons": "Very direct communication style. Can get talked over easily. Organization can feel siloed depending on the group. Everyone stretched thin", "advice": "Find times to give positive feedback to the company outside of all hands"}, {"title": "Not the worst boss I've had, but close.", "text": "Pros Free lunch, but as economics class taught us, there's no such thing as a free lunch. Some of the engineers are great people, and at least one of the managers is honest, has a measure of humility, and is not a chode, but just the one that I'm aware of. Unfortunately, they weren't actually my manager. Cons The uppers very obviously pay to have positive reviews added on both the app store and the google play store. They also very obviously have had some of those managers (who are actively engaged in looking as good as possible to the CEO) add glowing reviews on here as well. No one below manager level would give a 5 star review. Handy has been bleeding talent as people find more interesting and positive work where the stock options are more likely to matter. The hours are just about always long/late, and if you actually take a normal 10 minute break, you're seen as uncommitted, addressed by your manager, and it's a black mark. It doesn't matter how much you've actually contributed, just how good you looked doing 'something' and how much credit you've taken. No matter how many times people bring up the fact that both providers and customers are getting screwed and are unhappy and we ought to think about how we could better serve them, the only conversation the uppers have is how to better control them, pay the providers less money, collect more fees, and squeeze more out of customers.", "rating": 3, "pros": "Free lunch, but as economics class taught us, there's no such thing as a free lunch.", "cons": "The uppers very obviously pay to have positive reviews added on both the app store and the google play store. They also very obviously have had some of those managers (who are actively engaged in looking as good as possible to the CEO) add glowing reviews on here as well. No one below manager level would give a 5 star review.", "advice": null}, {"title": "A Fun Challenge", "text": "Pros Challenging work in a fun environment. Plenty of autonomy and freedom to work in the manner you want, provided you get your work done and focus on targets. It's a goal driven company with little to no bureaucracy. The liberal vacation policy and free lunch/dinners don't hurt either. Cons Less formal structures for onboarding, so a lot of initiative and persistence is required to get comfortable. Typical hours start a little later than 9 & end after 6, so early risers/finishers might have a hard transition. Advice to Management An assigned mentor for new hires might be helpful - someone who the new hire could reach out to at any point to ask questions, or steer the new hire to the best resource.", "rating": 5, "pros": "Challenging work in a fun environment. Plenty of autonomy and freedom to work in the manner you want, provided you get your work done and focus on targets. It's a goal driven company with little to no bureaucracy. The liberal vacation policy and free lunch/dinners don't hurt either.", "cons": "Less formal structures for onboarding, so a lot of initiative and persistence is required to get comfortable. Typical hours start a little later than 9 & end after 6, so early risers/finishers might have a hard transition.", "advice": "An assigned mentor for new hires might be helpful - someone who the new hire could reach out to at any point to ask questions, or steer the new hire to the best resource."}, {"title": "Incredible learning experience", "text": "Pros Lots of responsibility Exposure to senior leadership Amazing growth curve - learned how to solve problems, pull and analyze data, manage people Cons Startups require commitment and hours - it's not a 9-5 so if you're not ready to dedicate yourself, it's not going to be for you Advice to Management Keep hiring the best talent there is", "rating": 5, "pros": "Lots of responsibility", "cons": "Startups require commitment and hours - it's not a 9-5 so if you're not ready to dedicate yourself, it's not going to be for you", "advice": "Keep hiring the best talent there is"}, {"title": "On it's way", "text": "Pros Handy, like any startup, has definitely had its fair share of growing pains over the past few years. Like any company thats building a brand new market, sometimes things wont always be perfect in the first shot, but the people here always looking to make things better and learn from their mistakes. Of all the startups I've worked for, I've never met a more intelligent, dedicated and passionate group of individuals as the leadership team here at Handy. It is a very data driven environment and they are constantly looking to improve on every metric, big and small. Keep up the positive momentum! Cons It can be frustrating when you try out things and fail and have to go back to the drawing board. But having a team of supportive coworkers definitely helps. Advice to Management Continue to invest in hiring the best and brightest and living up to the company goals will follow.", "rating": 5, "pros": "Handy, like any startup, has definitely had its fair share of growing pains over the past few years. Like any company thats building a brand new market, sometimes things wont always be perfect in the first shot, but the people here always looking to make things better and learn from their mistakes.", "cons": "It can be frustrating when you try out things and fail and have to go back to the drawing board. But having a team of supportive coworkers definitely helps.", "advice": "Continue to invest in hiring the best and brightest and living up to the company goals will follow."}, {"title": "Exciting and veteran startup poised for big things", "text": "Pros - talented and smart management team that is constantly assessing the business and keeping us moving towards the right goals - well-documented training and onboarding for new recruits - open and transparent environment for decision-making - big, metric-moving projects waiting to be tackled - supportive and nurturing culture; everyone is down to teach + chat with you - fun company outings, hackathons, and celebrations - typical startup food perks (breakfast, lunch, dinner, insane snack pantry + water/soda options) - competitive salary for NYC - excellent location (can't beat the Madison Square Park area - close to all the train lines) - as a leading marketplace startup in its category, Handy faces a huge range of unique and tough problems. The learning never stops. Cons Handy runs very fast-paced and is constantly sourcing feedback from our customers, service professionals, advisors, and internal data to keep the company and product pointed in the right direction. That means shifting initiatives a few times a year to make sure we're always working on the right problems. The rapid change can be unsettling but perfect for someone who loves facing new challenges. This startup breathes the hustling vibe of true New Yorkers. Advice to Management Keep making culture a priority!", "rating": 5, "pros": "- talented and smart management team that is constantly assessing the business and keeping us moving towards the right goals", "cons": "Handy runs very fast-paced and is constantly sourcing feedback from our customers, service professionals, advisors, and internal data to keep the company and product pointed in the right direction. That means shifting initiatives a few times a year to make sure we're always working on the right problems. The rapid change can be unsettling but perfect for someone who loves facing new challenges. This startup breathes the hustling vibe of true New Yorkers.", "advice": "Keep making culture a priority!"}, {"title": "A bad place to work", "text": "Pros Free lunch. This has a five word minimum so I'm writing this extra sentence. Cons Handy is the worst place I've worked for and I once worked at a shady gift basket company where I was bitten by a brown recluse that resulted in me going to the emergency room. The pay starts low for Customer Experience and stops there. It seems that Dylan (whom I have nothing but good things to say about, he's great!) would genuinely like for his team to be properly compensated, but the founders aren't interested in prospering growth and creating long term careers for their employees. Recognizing this, many of the people who have been with the company for years have left. There are a lot of questionable things behind the scenes, namely asking employees to write glowing app store/Google reviews and finding new and inventive ways to create penalties for customers. Advice to Management Pay the CX team a fair wage", "rating": 1, "pros": "Free lunch. This has a five word minimum so I'm writing this extra sentence.", "cons": "Handy is the worst place I've worked for and I once worked at a shady gift basket company where I was bitten by a brown recluse that resulted in me going to the emergency room.", "advice": "Pay the CX team a fair wage"}, {"title": "Fun Startup to Work", "text": "Pros Great opportunity to learn a lot. Work environment. Many colleagues became friends. Very driven company to work with. Cons Very high pressure once in a while as company aims for very high goals.", "rating": 5, "pros": "Great opportunity to learn a lot. Work environment. Many colleagues became friends. Very driven company to work with.", "cons": "Very high pressure once in a while as company aims for very high goals.", "advice": null}, {"title": "Product Design", "text": "Pros Everyone is incredibly smart and friendly. Lots of opportunity for creativity. Whole company works relatively quickly and efficiently. Free catered lunch and dinner. Cons Deadlines can be tight, sometimes you will need to stay later in order to finish work", "rating": 5, "pros": "Everyone is incredibly smart and friendly. Lots of opportunity for creativity. Whole company works relatively quickly and efficiently. Free catered lunch and dinner.", "cons": "Deadlines can be tight, sometimes you will need to stay later in order to finish work", "advice": null}, {"title": "Operations Associate", "text": "Pros There were free lunches every day, and I did make some genuine friendships working in the office. Cons There is very little communication, and employees are not respected. I was told to my face I was going to be reassigned off of the project I was working on less than a week before I was let go. There is very little in terms of employee support and growth. My team was often the scapegoats for a lot of internal operational issues with the company, and was even once directly blamed for stalling the company's growth. The culture of the company is a fairly typical fraternal start-up culture, and although there was a substantial improvement from the infamous Gawker article about Handy's culture, there still was a misguided attempt to have a frat-house environment in the center of the office with kegs, a very disruptive foosball table, and music. Also, my pay was incorrect for almost a whole year because my manager did not care enough to ensure I was getting paid for the correct number of hours.", "rating": 3, "pros": "There were free lunches every day, and I did make some genuine friendships working in the office.", "cons": "There is very little communication, and employees are not respected. I was told to my face I was going to be reassigned off of the project I was working on less than a week before I was let go. There is very little in terms of employee support and growth.", "advice": null}, {"title": "Laid Off", "text": "Pros The pros were basically due to being a remote worker. I enjoyed meeting new people and giving presentations. I liked the people I worked with. Cons Unorganized and inexperienced staff in positions of high responsibility. Faulty business model caused a lot of issues that were hard to resolve. I don't think the company was created with the intention of lasting very long.", "rating": 1, "pros": "The pros were basically due to being a remote worker. I enjoyed meeting new people and giving presentations. I liked the people I worked with.", "cons": "Unorganized and inexperienced staff in positions of high responsibility. Faulty business model caused a lot of issues that were hard to resolve. I don't think the company was created with the intention of lasting very long.", "advice": null}, {"title": "It's okay", "text": "Pros Time consuming work. Free food. Cons Too time consuming. Food is not that good. Advice to Management Good luck!", "rating": 3, "pros": "Time consuming work. Free food.", "cons": "Too time consuming. Food is not that good.", "advice": "Good luck!"}, {"title": "Good temporary job", "text": "Pros Fast-paced. You get right to work. Cons Instability, I was never sure if my position would be eliminated or not...eventually it was. Advice to Management Keep laying the foundation for a good work culture.", "rating": 3, "pros": "Fast-paced. You get right to work.", "cons": "Instability, I was never sure if my position would be eliminated or not...eventually it was.", "advice": "Keep laying the foundation for a good work culture."}, {"title": "Best Team I Could Ask For", "text": "Pros What isn't great about these guys. Free lunch and snacks. Incredibly smart and resourceful people to work with. Best encounter of teamwork I've ever experienced. I grew to love my coworkers. Cons None at all. Managment does a great job emphasizing goals without putting their staff down. Advice to Management Let's start out the season with a brainstorm of ideas of how the street team could hit higher sales. Focus heavily on residential areas. Have an overload of promo materials ready to give out. Everybody loves free stuff. Overall, ask the native New Yorker's how handy could get people's attention. :D", "rating": 5, "pros": "What isn't great about these guys. Free lunch and snacks. Incredibly smart and resourceful people to work with. Best encounter of teamwork I've ever experienced. I grew to love my coworkers.", "cons": "None at all. Managment does a great job emphasizing goals without putting their staff down.", "advice": "Let's start out the season with a brainstorm of ideas of how the street team could hit higher sales. Focus heavily on residential areas. Have an overload of promo materials ready to give out. Everybody loves free stuff."}, {"title": "So so", "text": "Pros Benefits. Food. Friendly staff. Set working schedule. Cons No support. Favoritism. Low pay Advice to Management Invest in real career path advice for your staff.", "rating": 1, "pros": "Benefits. Food. Friendly staff. Set working schedule.", "cons": "No support. Favoritism. Low pay", "advice": "Invest in real career path advice for your staff."}, {"title": "It has been fun.", "text": "Pros Being that technogy startups are trending, there can be a lot to learn from. The benefits seem appealing and the food is catered. Cons The commute may be tough for some, as it is for some employees in the greater New York City area. Advice to Management Stay positive.", "rating": 5, "pros": "Being that technogy startups are trending, there can be a lot to learn from. The benefits seem appealing and the food is catered.", "cons": "The commute may be tough for some, as it is for some employees in the greater New York City area.", "advice": "Stay positive."}, {"title": "Would not reccommend.", "text": "Pros Great people and team spirit. Cons Disorganized company, no clear vision. Advice to Management Listen to your coworkers and work together.", "rating": 1, "pros": "Great people and team spirit.", "cons": "Disorganized company, no clear vision.", "advice": "Listen to your coworkers and work together."}, {"title": "Terrible company - believe what you've heard, and worse", "text": "Pros There are some fantastic people who work there - though chances are, they're the ones being worked to death, receiving zero credit for their work, and/or are about to be laid off. It was also a very fun place to work for some brief period of time. Cons Wildly incompetent management, total lack of respect for good people, huge amounts of bias and unfairness at all levels, questionable business ethics, poor/nonexistent engineering values, few good or senior engineers, mountains of tech debt that make coding miserable, no protection between engineers and business pressures, no value for culture or employee happiness, depressing work environment, below average compensation/benefits/perks... TLDR; Run. Advice to Management Replace yourselves if you want any chance at saving the company.", "rating": 1, "pros": "There are some fantastic people who work there - though chances are, they're the ones being worked to death, receiving zero credit for their work, and/or are about to be laid off. It was also a very fun place to work for some brief period of time.", "cons": "Wildly incompetent management, total lack of respect for good people, huge amounts of bias and unfairness at all levels, questionable business ethics, poor/nonexistent engineering values, few good or senior engineers, mountains of tech debt that make coding miserable, no protection between engineers and business pressures, no value for culture or employee happiness, depressing work environment, below average compensation/benefits/perks... TLDR; Run.", "advice": "Replace yourselves if you want any chance at saving the company."}, {"title": "Great people", "text": "Pros Handy is one of the rare \"real startup\" gem in NYC. High tech vibe, intensity, sharp people who want to commit their sweat to a higher purpose. Smartest, most dedicated people I have been working with so far. Cons No place to hide. I don't know one person who is just \"cruising\" on their job. Great opportunities for development across functions. Advice to Management Continue hiring amazing people and maintain a positive culture.", "rating": 5, "pros": "Handy is one of the rare \"real startup\" gem in NYC. High tech vibe, intensity, sharp people who want to commit their sweat to a higher purpose. Smartest, most dedicated people I have been working with so far.", "cons": "No place to hide. I don't know one person who is just \"cruising\" on their job. Great opportunities for development across functions.", "advice": "Continue hiring amazing people and maintain a positive culture."}, {"title": "Anonymous Employee", "text": "Pros Strong company culture with a vision to become a household name drives the pace & has resulted in phenomenal growth. Tremendous career opportunity for anyone who wants to roll up their sleeves & contribute. Cons Like any start-up, it isn't perfect and is still a work in progress. But Handy has a real shot at breaking out in an even bigger way & that is the appeal. Advice to Management Don't lose sight of the importance of ensuring that each and every employee fundamentally understands the opportunity here & how rare it truly is.", "rating": 5, "pros": "Strong company culture with a vision to become a household name drives the pace & has resulted in phenomenal growth. Tremendous career opportunity for anyone who wants to roll up their sleeves & contribute.", "cons": "Like any start-up, it isn't perfect and is still a work in progress. But Handy has a real shot at breaking out in an even bigger way & that is the appeal.", "advice": "Don't lose sight of the importance of ensuring that each and every employee fundamentally understands the opportunity here & how rare it truly is."}, {"title": "Operations Associate", "text": "Pros Small company and growing rapidly. Great opportunity to start with a smaller/newer company to learn the in/outs of building a business from the ground up. Cons Not a lot of communication with upper management. Slight lack of direction, often left to make decisions on your own. As a remote employee away fro HQ office, there was often a lack of direction and communication with managers, directors, CEOS.", "rating": 3, "pros": "Small company and growing rapidly. Great opportunity to start with a smaller/newer company to learn the in/outs of building a business from the ground up.", "cons": "Not a lot of communication with upper management. Slight lack of direction, often left to make decisions on your own. As a remote employee away fro HQ office, there was often a lack of direction and communication with managers, directors, CEOS.", "advice": null}, {"title": "Worse company ever", "text": "Pros This company has Absolutely no pros Cons No end to end customer relationship. Negative reviews across the globe. they dont do background checks on employee, which means anyone can become an electrician with Handy Advice to Management Change Management, improve customer services, improve recruitment process", "rating": 1, "pros": "This company has Absolutely no pros", "cons": "No end to end customer relationship.", "advice": "Change Management, improve customer services, improve recruitment process"}, {"title": "Customer Service", "text": "Pros free lunch and pay was ok Cons very cold and no compassion.", "rating": 3, "pros": "free lunch and pay was ok", "cons": "very cold and no compassion.", "advice": null}, {"title": "Handy is great to work for", "text": "Pros I really - really like working for Handy! This expert cleaning organization gives the capacity to make an exceptionally adaptable and helpful work routine. Consistently working for Handy is a smooth, compensating and gainful experience. The Management team has been good to work with as well, which is important. It is likewise extraordinary to realize that my co-workers are quality employees, who are all around prepared, learned, connected with, and devoted to the organization's qualities. Just overall a great organization to work with. Cons Truthfully i have none. Just a great place to work for ... hands down...I wish I found them a long time ago. Advice to Management keep up the good work. Finally having a management team that I can trust is the best", "rating": 5, "pros": "I really - really like working for Handy!", "cons": "Truthfully i have none. Just a great place to work for ... hands down...I wish I found them a long time ago.", "advice": "keep up the good work. Finally having a management team that I can trust is the best"}, {"title": "The best", "text": "Pros At Handy, there is an unparalleled growth opportunities through the philosophy of one big family which I’m a beneficiary of this. We the workers at handy are empowered each or as a team member to live differently and enjoy ourselves and a good facilities being put in place to encourage members that needs more professional training and a feedback-based career development infrastructure supporting them throughout all stages of their career. One of the thing I appreciated most in Handy, is the ability to make my own schedule, this gives me the opportunity to play with my friend and watch my favourite TV show and sports. Their salary is top notch with good management. I’m proud to be an employer of Handy. Cons Like I have always tell my friends, that Handy is the best place to work, a place where we take and watch each other backs. Just like the bible, “ seeth a man diligent in his work…..” when you are diligent in your work at Handy, you’ll enjoy a first class treatment. Advice to Management I have worked with several organization and companies but Handy stands out the best. They are always there for me and other workers. The management are full of fun, family atmosphere, flexible scheduling and caring relationships built with their coworkers and customers. You are the best!!!", "rating": 5, "pros": "At Handy, there is an unparalleled growth opportunities through the philosophy of one big family which I’m a beneficiary of this. We the workers at handy are empowered each or as a team member to live differently and enjoy ourselves and a good facilities being put in place to encourage members that needs more professional training and a feedback-based career development infrastructure supporting them throughout all stages of their career.", "cons": "Like I have always tell my friends, that Handy is the best place to work, a place where we take and watch each other backs. Just like the bible, “ seeth a man diligent in his work…..” when you are diligent in your work at Handy, you’ll enjoy a first class treatment.", "advice": "I have worked with several organization and companies but Handy stands out the best. They are always there for me and other workers. The management are full of fun, family atmosphere, flexible scheduling and caring relationships built with their coworkers and customers. You are the best!!!"}, {"title": "Outstanding Experience From Handy Company", "text": "Pros The people are almost universally smart, talented, and fun lots of things to learn too. Cons Sometimes strategy feels like it values short-term gains over long-term value. Advice to Management Be more open with employees, share strategy, and have more informal forums for idea development.", "rating": 5, "pros": "The people are almost universally smart, talented, and fun lots of things to learn too.", "cons": "Sometimes strategy feels like it values short-term gains over long-term value.", "advice": "Be more open with employees, share strategy, and have more informal forums for idea development."}, {"title": "Amazing friendships", "text": "Pros Amazing friendships made from toughing it out at a place where you're always afraid you'll lose your job. Free alcohol is given to replace compensation. Cons If you're not in engineering, you will be asked how you do your job and then it will be automated and you will get laid off. Advice to Management Stop writing fake reviews", "rating": 1, "pros": "Amazing friendships made from toughing it out at a place where you're always afraid you'll lose your job. Free alcohol is given to replace compensation.", "cons": "If you're not in engineering, you will be asked how you do your job and then it will be automated and you will get laid off.", "advice": "Stop writing fake reviews"}, {"title": "Ambitious, Growing Company", "text": "Pros The people are almost universally smart, talented, and fun. The product has a ton of room for growth. The leadership has a lucid and ambitious vision for the future. Cons There are cultural growing pains, but those are disappearing by the day. Sometimes strategy feels like it values short-term gains over long-term value. The management could improve transparency. Advice to Management Be more open with employees, share strategy, and have more informal forums for idea development.", "rating": 5, "pros": "The people are almost universally smart, talented, and fun. The product has a ton of room for growth. The leadership has a lucid and ambitious vision for the future.", "cons": "There are cultural growing pains, but those are disappearing by the day. Sometimes strategy feels like it values short-term gains over long-term value. The management could improve transparency.", "advice": "Be more open with employees, share strategy, and have more informal forums for idea development."}, {"title": "Great Place to Work!!", "text": "Pros I enjoy the flexible schedule and fun work environment. The staff members are professional and easy to work with. The customers are awesome too. It's a great place to be!! Cons I don't have any cons to write about at this time. Advice to Management Keep up the good work and thanks for all your encouragement.", "rating": 5, "pros": "I enjoy the flexible schedule and fun work environment. The staff members are professional and easy to work with. The customers are awesome too. It's a great place to be!!", "cons": "I don't have any cons to write about at this time.", "advice": "Keep up the good work and thanks for all your encouragement."}, {"title": "The company has great future potential!", "text": "Pros It's very flexible and the pay is great. I would definitely recommend if you want to work part time for a decent salary. Cons After some years, I hope I won't have cons for Handy. Advice to Management Listen to employees and customers.", "rating": 5, "pros": "It's very flexible and the pay is great. I would definitely recommend if you want to work part time for a decent salary.", "cons": "After some years, I hope I won't have cons for Handy.", "advice": "Listen to employees and customers."}, {"title": "Great company to work for, but, definitely has growing pains`", "text": "Pros Fun environment, staff is involved with nearly every aspect of the company. Cons A little disorganized at times, but that's the case with almost every young start up that's growing at the rate that they are. Advice to Management Fill employees in with what's going on more with the company. Oftentimes employees felt lost and not really sure where upper management was trying to take the company.", "rating": 5, "pros": "Fun environment, staff is involved with nearly every aspect of the company.", "cons": "A little disorganized at times, but that's the case with almost every young start up that's growing at the rate that they are.", "advice": "Fill employees in with what's going on more with the company. Oftentimes employees felt lost and not really sure where upper management was trying to take the company."}, {"title": "Great company", "text": "Pros Great team, and exciting opportunities! Cons I can't think of any negatives. Advice to Management Keep up the great work!", "rating": 5, "pros": "Great team, and exciting opportunities!", "cons": "I can't think of any negatives.", "advice": "Keep up the great work!"}, {"title": "Great Experience!", "text": "Pros I've been working for this compny for more than two years now; it's been a wonderfull experience working as a part-time with them. The amazing thing is how I created my work schedule that allowed me to stay focus on my job as well as enhancing my productivity. The management crews are amazing set of people that perfectly understand how to render an amazing results oriented administrative support that will definitely makes you oustanding. It's a sure company for recommendation any day! Cons The couple of years I've spent with them have been great. For cons, there's none! Only haters can say that. Advice to Management Please just keep on supporting all your workers as the espire to breakthrough!", "rating": 5, "pros": "I've been working for this compny for more than two years now; it's been a wonderfull experience working as a part-time with them. The amazing thing is how I created my work schedule that allowed me to stay focus on my job as well as enhancing my productivity. The management crews are amazing set of people that perfectly understand how to render an amazing results oriented administrative support that will definitely makes you oustanding. It's a sure company for recommendation any day!", "cons": "The couple of years I've spent with them have been great. For cons, there's none! Only haters can say that.", "advice": "Please just keep on supporting all your workers as the espire to breakthrough!"}, {"title": "Fun, Seriously Fun", "text": "Pros Well, I met some of my favorite people during my tenure at Handy. Those people are what kept me there for as long as I stayed. I can also say that everyone I worked with was very smart, talented, and inspiring. My job was not at all stressful. I never took work home with me. I did not work long hours. Catered lunches. Cons Where to begin! I think the main takeaway is that this company is painfully cheap. They don't give raises or promotions as often as one might expect, and when they do, the increase is so pitiful it has no impact on net pay. I personally know an employee who has been with the company for 1.6 years without a single pay increase. The company also presents itself as a marketplace, with equal attention and respect given to its contractors and customers, however that is entirely untrue. Customers come first, and every contractor on the platform can feel it. They put together an achingly out-out-touch and awkward culture deck, \"modeled after Netflix\" but if you pull up each deck side-by-side, you'll see that they are lost. Every executive at this company is a rich kid who doesn't understand and will never seek to understand the needs of the less privileged. They've outsourced most of their Customer Experience down south, and it's clear they won't do anything to foster or develop any of the remaining employees in New York-they are forcing them to quit. Advice to Management Treat people better. Stop loudly playing foosball all day. Pay people a reasonable, living wage. Don't proudly tout yourself as a \"frugal company.\" It is not a good look. Don't pretend to be connected with your employees. You aren't, and it's embarrassing for you.", "rating": 3, "pros": "Well, I met some of my favorite people during my tenure at Handy. Those people are what kept me there for as long as I stayed. I can also say that everyone I worked with was very smart, talented, and inspiring.", "cons": "Where to begin! I think the main takeaway is that this company is painfully cheap. They don't give raises or promotions as often as one might expect, and when they do, the increase is so pitiful it has no impact on net pay. I personally know an employee who has been with the company for 1.6 years without a single pay increase. The company also presents itself as a marketplace, with equal attention and respect given to its contractors and customers, however that is entirely untrue. Customers come first, and every contractor on the platform can feel it.", "advice": "Treat people better. Stop loudly playing foosball all day. Pay people a reasonable, living wage. Don't proudly tout yourself as a \"frugal company.\" It is not a good look. Don't pretend to be connected with your employees. You aren't, and it's embarrassing for you."}, {"title": "great team to work with", "text": "Pros I create my work schedule and it allows me focus on the job and achieve positive results every time. management fully understands how to run the business and the team I work with is exceptional Cons no cons. there is none Advice to Management keep the good work going", "rating": 5, "pros": "I create my work schedule and it allows me focus on the job and achieve positive results every time. management fully understands how to run the business and the team I work with is exceptional", "cons": "no cons. there is none", "advice": "keep the good work going"}, {"title": "Like Family", "text": "Pros I am currently working here. I really enjoyed . Just like my family. I get some good friends and some great experience. I had some financial problem last year. But now everything is fine. That only due to my job. Thanks Cons Only enemies can tell cons about handy. I am working here. After some years, I hope I will havent cons for Handy. Advice to Management Really great to working with you. Good advisable team", "rating": 5, "pros": "I am currently working here. I really enjoyed . Just like my family. I get some good friends and some great experience. I had some financial problem last year. But now everything is fine. That only due to my job. Thanks", "cons": "Only enemies can tell cons about handy. I am working here. After some years, I hope I will havent cons for Handy.", "advice": "Really great to working with you. Good advisable team"}, {"title": "Couldn't imagine a worst first job.", "text": "Pros The people I met here were awesome and are still my friends to this day. They provide free food which saves you more money than you'd think. Cons The management is awful. The platform for how they treat their cleaning professionals is literally immoral. This company screwed all of it's employees out of paid time, medical expenses, lied about actual end dates. They will do anything slimy they can for an extra buck. Mass public firings were common. This job was a nightmare. I learned more about binge drinking and who was sleeping with who then I ever did about what made this company successful. People actually would get wasted and have sex in the office. It's like working in Animal House. Advice to Management Stop while you're ahead.", "rating": 1, "pros": "The people I met here were awesome and are still my friends to this day. They provide free food which saves you more money than you'd think.", "cons": "The management is awful. The platform for how they treat their cleaning professionals is literally immoral. This company screwed all of it's employees out of paid time, medical expenses, lied about actual end dates. They will do anything slimy they can for an extra buck. Mass public firings were common. This job was a nightmare. I learned more about binge drinking and who was sleeping with who then I ever did about what made this company successful. People actually would get wasted and have sex in the office. It's like working in Animal House.", "advice": "Stop while you're ahead."}, {"title": "We're all sitting ducks", "text": "Pros We get to listen to the CEO talk about how the company is doing such great things for the world every day while he simultaneously plans the next mass firing of employees. Cons This place is dark. They can't hold on to a single manager or VP for more than a year. They all leave, and not for a better offer necessarily, but to work anywhere else but Handy. It's clear that no one can work with the CEO and he could care less about the people that made this company what it is. (Unless you went to HBS..they can do no wrong) So many new senior managers come in with a high spirit, \"I'm-going-to-turn-this-place-around\" attitude and then slowly but surely find out that there's nothing they can do because the CEO refuses to give up control. Compensation is so bad. Bonuses are given to a select few. It's someone's full time job right now to automate their own responsibilities so that they can get laid off. They're called Operations Associates. There is zero room for growth. None. Advice to Management You've already been given advice. And then those people left because you couldn't deliver.", "rating": 1, "pros": "We get to listen to the CEO talk about how the company is doing such great things for the world every day while he simultaneously plans the next mass firing of employees.", "cons": "This place is dark. They can't hold on to a single manager or VP for more than a year. They all leave, and not for a better offer necessarily, but to work anywhere else but Handy. It's clear that no one can work with the CEO and he could care less about the people that made this company what it is. (Unless you went to HBS..they can do no wrong)", "advice": "You've already been given advice. And then those people left because you couldn't deliver."}, {"title": "Best. Job Ever", "text": "Pros Decent pay and benefits, co-workers are amazing, great culture and great set of values, all of which is reflected in their workings with clients throughout the operations process. Cons The last couple years the company has changed. Anyone here longer than a couple years has seen it. Our leadership team does an incredible job of navigating through change. I personally love new challenges. It pushes me to be my best and always improving. Advice to Management Happy employees equal happy customers. Remember who got you to this point in the company's success. If you leave them behind, you will melt into just another solar company fading into the background of this saturated market.", "rating": 5, "pros": "Decent pay and benefits, co-workers are amazing, great culture and great set of values, all of which is reflected in their workings with clients throughout the operations process.", "cons": "The last couple years the company has changed. Anyone here longer than a couple years has seen it. Our leadership team does an incredible job of navigating through change. I personally love new challenges. It pushes me to be my best and always improving.", "advice": "Happy employees equal happy customers. Remember who got you to this point in the company's success. If you leave them behind, you will melt into just another solar company fading into the background of this saturated market."}, {"title": "Great Experience", "text": "Pros Great people are hired in the company. Everyone likes a challenge and is willing to work really hard. The company has great future potential. Cons Restricted upward mobility. Compensation is not great. Advice to Management More compensation, more structure", "rating": 5, "pros": "Great people are hired in the company. Everyone likes a challenge and is willing to work really hard. The company has great future potential.", "cons": "Restricted upward mobility. Compensation is not great.", "advice": "More compensation, more structure"}, {"title": "Leave while you still can", "text": "Pros Fun coworkers, good office location, occasional happy hours. Lots of great coffee places in the area. It's a great way to catch up with coworkers and talk about which jobs you're applying for externally. Cons It's not good, my friends. People are leaving left and right, senior management included. And they all skipped on their way out the elevator (Right next to the senior management table where they watch as you leave before them every evening). People don't get paid enough. It's so beyond the point of insulting that employees have given up on the fight and instead apply for other jobs. Advice to Management Give the company to someone that knows how to treat people. Seriously. No one will blame you.", "rating": 1, "pros": "Fun coworkers, good office location, occasional happy hours. Lots of great coffee places in the area. It's a great way to catch up with coworkers and talk about which jobs you're applying for externally.", "cons": "It's not good, my friends. People are leaving left and right, senior management included. And they all skipped on their way out the elevator (Right next to the senior management table where they watch as you leave before them every evening).", "advice": "Give the company to someone that knows how to treat people. Seriously. No one will blame you."}, {"title": "Great Place to Work!", "text": "Pros I worked for this company for about two years before I had to quit due to health issues. I truly enjoyed working for them and feel like I was very valued as an employee. I recommend this company to any job seeker with the skills and the drive to do well! Cons I cannot think of any cons related to this company. As I previously stated I felt very comfortable working there.", "rating": 5, "pros": "I worked for this company for about two years before I had to quit due to health issues. I truly enjoyed working for them and feel like I was very valued as an employee. I recommend this company to any job seeker with the skills and the drive to do well!", "cons": "I cannot think of any cons related to this company. As I previously stated I felt very comfortable working there.", "advice": null}, {"title": "Dishonest", "text": "Pros There is food and free beer. Cons There are a lot of fake positive reviews here that pretend to be from CX at HQ. Not one person in cx is happy there. Not one. They talk a lot about values and supporting their employees but if you're not an engineer or one of the frat boy managers then you are not who they are talking about supporting. They will lie about your potential to put more work on your plate but you will not be compensated for it. They are very stingy with raises and bonuses. You can't pay your rent with free beer. It's clear they don't value CX or respect the people who do that work. Advice to Management Grow up. Stop spending so much on alcohol and parties and pay your CX department appropriately. No one prefers free booze to a living wage. And stop writing fake reviews.", "rating": 1, "pros": "There is food and free beer.", "cons": "There are a lot of fake positive reviews here that pretend to be from CX at HQ. Not one person in cx is happy there. Not one. They talk a lot about values and supporting their employees but if you're not an engineer or one of the frat boy managers then you are not who they are talking about supporting. They will lie about your potential to put more work on your plate but you will not be compensated for it. They are very stingy with raises and bonuses. You can't pay your rent with free beer. It's clear they don't value CX or respect the people who do that work.", "advice": "Grow up. Stop spending so much on alcohol and parties and pay your CX department appropriately. No one prefers free booze to a living wage. And stop writing fake reviews."}, {"title": "Hard work, great opportunity", "text": "Pros It's a young startup so there's always exciting work to do if you're motivated. Great place to pick up skills fast Cons The office can feel overcrowded sometimes, you could say they stay in the same place too long (because they grow pretty fast). Advice to Management Keep the young startup vibe around as long as possible. Move to a bigger office space soon but keep the open no-walls environment.", "rating": 5, "pros": "It's a young startup so there's always exciting work to do if you're motivated. Great place to pick up skills fast", "cons": "The office can feel overcrowded sometimes, you could say they stay in the same place too long (because they grow pretty fast).", "advice": "Keep the young startup vibe around as long as possible. Move to a bigger office space soon but keep the open no-walls environment."}, {"title": "Excellent company!", "text": "Pros I worked full time for this company as a customer service associate in New York. The work environment was great, mostly due to the great colleagues with who I worked. The senior staff was also a huge help to me when I first started working there. Sadly, I had to leave the company when I moved to a different state, but I've recommended this company to friends as good work experience in this field. Now, I thought I could do the same through Glassdoor. The company does a great job in providing its customers with a \"satisfaction guaranteed\" feeling. Cons Drank more coffee than I used to when I worked part-time? Haha. Seriously though, I don't have anything negative to say about my experience working for Handy. Advice to Management Keep up the good work. I haven't worked for any company before where we had people in management that gave their all.", "rating": 5, "pros": "I worked full time for this company as a customer service associate in New York. The work environment was great, mostly due to the great colleagues with who I worked. The senior staff was also a huge help to me when I first started working there. Sadly, I had to leave the company when I moved to a different state, but I've recommended this company to friends as good work experience in this field. Now, I thought I could do the same through Glassdoor. The company does a great job in providing its customers with a \"satisfaction guaranteed\" feeling.", "cons": "Drank more coffee than I used to when I worked part-time? Haha. Seriously though, I don't have anything negative to say about my experience working for Handy.", "advice": "Keep up the good work. I haven't worked for any company before where we had people in management that gave their all."}, {"title": "Great Company", "text": "Pros Really easy app to use. Management is very friendly and I've never had any problems. I would recommend this business to all. Cons None so far! Great experience at this company.", "rating": 5, "pros": "Really easy app to use. Management is very friendly and I've never had any problems. I would recommend this business to all.", "cons": "None so far! Great experience at this company.", "advice": null}, {"title": "Really good place to work for Engineers", "text": "Pros All staff and team members are very supportive in your initial days. Cons Still I can see process and product development is not that clear as it should be. Advice to Management Keep it up", "rating": 5, "pros": "All staff and team members are very supportive in your initial days.", "cons": "Still I can see process and product development is not that clear as it should be.", "advice": "Keep it up"}, {"title": "Great Work Environment", "text": "Pros Really flexible working hours, the upper managers are very nice and are willing to compromise Very good pay, would definitely recommend if you want to work part time for a decent salary Very well knit atmosphere, everyone is super nice and friendly, feels like family Good management Pay checks are always on time, and sometimes get extra depending on performance Very positive and overall a nice working atmosphere Cons Can't really think of anything bad really Advice to Management Great working environment! Keep up the good work!", "rating": 5, "pros": "Really flexible working hours, the upper managers are very nice and are willing to compromise", "cons": "Can't really think of anything bad really", "advice": "Great working environment! Keep up the good work!"}, {"title": "Great All Around Company", "text": "Pros Handy is a great all around company to work for. It's a positive environment because the employees and customers are treated well. The entire corporate vision is that happy, satisfied customers return. By employing positive, hard-working people, they've created a positive work environment for the employees as well. If you are willing to work, you will make money and you will get ahead. Cons I cannot think of a single negative thing. These are really caring people. Advice to Management Keep doing what you are doing. You've made my life so much better.", "rating": 5, "pros": "Handy is a great all around company to work for. It's a positive environment because the employees and customers are treated well. The entire corporate vision is that happy, satisfied customers return. By employing positive, hard-working people, they've created a positive work environment for the employees as well. If you are willing to work, you will make money and you will get ahead.", "cons": "I cannot think of a single negative thing. These are really caring people.", "advice": "Keep doing what you are doing. You've made my life so much better."}, {"title": "DO NOT WORK HERE, ITS A SINKING SHIP", "text": "Pros A few smart people from Harvard, hard charging and motivated employees, problem is the business model and product isn't very good Cons Its a failed business model. Clients are cancelling subcriptions left and right and all that product team can do is come up with more clever hooks to make it difficult for people to cancel subscriptions? Sad place that is going down hill, do not leave a good job with the hope that this is the \"Uber for the Home\" with big potential because that is a pipe dream. This company will fail just like Homejoy failed and are struggling to hire anyone at this point because people can smell failure is imminent. Advice to Management Return money to shareholders", "rating": 1, "pros": "A few smart people from Harvard, hard charging and motivated employees, problem is the business model and product isn't very good", "cons": "Its a failed business model. Clients are cancelling subcriptions left and right and all that product team can do is come up with more clever hooks to make it difficult for people to cancel subscriptions? Sad place that is going down hill, do not leave a good job with the hope that this is the \"Uber for the Home\" with big potential because that is a pipe dream. This company will fail just like Homejoy failed and are struggling to hire anyone at this point because people can smell failure is imminent.", "advice": "Return money to shareholders"}, {"title": "THIS COMPANY IS THE WORST", "text": "Pros nothing. a terrible company that will undoubtedly fail. Cons all around poorly run and terrible at offering the services on a fundamental level. and furthermore, customer service is a new level of horrid. for a startup that needs to gain and retain new customers, handy excels at doing neither and will ultimately fail. Advice to Management do your job. be good at it. that's it.", "rating": 1, "pros": "nothing. a terrible company that will undoubtedly fail.", "cons": "all around poorly run and terrible at offering the services on a fundamental level. and furthermore, customer service is a new level of horrid. for a startup that needs to gain and retain new customers, handy excels at doing neither and will ultimately fail.", "advice": "do your job. be good at it. that's it."}, {"title": "Overall pleased", "text": "Pros Easy, fast, flexible! I'm pretty happy and would recommend to friends Cons I haven't experienced anything negative", "rating": 5, "pros": "Easy, fast, flexible! I'm pretty happy and would recommend to friends", "cons": "I haven't experienced anything negative", "advice": null}, {"title": "Exciting, Fun & Challenging", "text": "Pros Working at handy has been a great experience. The team I was part of is very talented, I learned a lot of stuff from them. The company environment is super fun and with a lot of great perks. Cons The only con I can think about is that Handy's growth makes the office space a bit crowded. There are not enough conference rooms for people who want to have a quiet call. When I was leaving they mentioned that they were thinking about adding small phone booths for that purpose, I think it's a great idea. Advice to Management Try to keep up with the series of lunches with the employees. I worked for 7 months and never got the opportunity.", "rating": 5, "pros": "Working at handy has been a great experience. The team I was part of is very talented, I learned a lot of stuff from them. The company environment is super fun and with a lot of great perks.", "cons": "The only con I can think about is that Handy's growth makes the office space a bit crowded. There are not enough conference rooms for people who want to have a quiet call. When I was leaving they mentioned that they were thinking about adding small phone booths for that purpose, I think it's a great idea.", "advice": "Try to keep up with the series of lunches with the employees. I worked for 7 months and never got the opportunity."}, {"title": "Look elsewhere", "text": "Pros Free meals. Looks good on a resume when you escape. Cons Not a moral compass in sight. Should someone accidentally display one, they would be let go. Advice to Management Treat the human beings that power your brand with the level of decency you would want for your family.", "rating": 1, "pros": "Free meals. Looks good on a resume when you escape.", "cons": "Not a moral compass in sight. Should someone accidentally display one, they would be let go.", "advice": "Treat the human beings that power your brand with the level of decency you would want for your family."}, {"title": "Customer Experience", "text": "Pros You will gain a lot of experience in a very short time. Your coworkers will be solid, and you will need them because management is a unique mix of arrogance and incompetence, from the founders down to the supervisors. Cons First off, don't trust a single glowing review of Handy posted here - they are transparent attempt by management to cover the very high turnover rate of both employees and cleaning contractors. You will see the earliest reviews here from cleaners had a direct response from the CEO that their opinions were null because they were not considered full-time employees, but now they are flooding this board and driving the score up. So which is it? If you work here, you are not working for a tech startup - you are working for a cleaning/janitorial company. Most jobs are in operations and support since Handy is a service business, which means you will spend hours each day emphasizing to poor English as a second language speakers that they need to clean underneath shampoo bottles, or getting yelled at by a customer because their shampoo bottles were not cleaned. Your salary will never increase. They hire mostly new college grads that are easily replaceable or outsourced. Allow me to repeat: this is not a place with opportunities to grow, this is a place to spend a year building experience and then getting out before you just can't take the entitled customers or cleaners who just don't care. Lastly, you will find out through your own experience that Handy offers a mediocre product at best. The contractor-without-a-supervisor model does not work for cleaning the same way it works for Uber, and the endless stream of unhappy customers and unfairly rated cleaners proves this. Advice to Management You put mindless growth before mindful culture and you have failed because of this. Have fun with your model before it gets outpaced by competitors that know how to treat their customers and employees.", "rating": 1, "pros": "You will gain a lot of experience in a very short time. Your coworkers will be solid, and you will need them because management is a unique mix of arrogance and incompetence, from the founders down to the supervisors.", "cons": "First off, don't trust a single glowing review of Handy posted here - they are transparent attempt by management to cover the very high turnover rate of both employees and cleaning contractors. You will see the earliest reviews here from cleaners had a direct response from the CEO that their opinions were null because they were not considered full-time employees, but now they are flooding this board and driving the score up. So which is it?", "advice": "You put mindless growth before mindful culture and you have failed because of this. Have fun with your model before it gets outpaced by competitors that know how to treat their customers and employees."}, {"title": "COO/CEO and VPs ask people to write fake reviews! Use caution.", "text": "Pros - Free meals - Free snacks - 80% medical/dental/vision care paid for Cons - You will be treated like garbage at Handy - There is no clearly defined raises and promotion path -- you must have an degree from a top tier school if you want to toll with the big boys - Lots of drug and alcohol use - Many people have sex with each other (there was even an incident where an employee had sex at a company party inside of a glass conference room) - Low salaries - Illegal 1099 practices (fines, etc)", "rating": 1, "pros": "- Free meals", "cons": "- You will be treated like garbage at Handy", "advice": null}, {"title": "CX associate", "text": "Pros the people are awesome, the snacks, catered lunch every now and then. nothing much except the people make this place great. Cons management, disorganization, lack of experience from certain management individuals, lack of interdepartmental communication, use of threats about job security Advice to Management talk to the dpts and get things organizes", "rating": 1, "pros": "the people are awesome, the snacks, catered lunch every now and then. nothing much except the people make this place great.", "cons": "management, disorganization, lack of experience from certain management individuals, lack of interdepartmental communication, use of threats about job security", "advice": "talk to the dpts and get things organizes"}, {"title": "Amazing Leadership", "text": "Pros Customer service can be a drag. There can be a lot of frustration when things don't go exactly as someone hopes they would. Having to mitigate peoples' displeasure can be a frustrating task. Thankfully, even when things get bad with customers, the management is always there to help the customer, and you. They take the flak off of you, and always offer constructive suggestions for how to handle sticky situations. Cons If you can't deal with people's frustration then this isn't the job for you. Advice to Management Keep up the great work. The culture here is the envy of all businesses.", "rating": 5, "pros": "Customer service can be a drag. There can be a lot of frustration when things don't go exactly as someone hopes they would. Having to mitigate peoples' displeasure can be a frustrating task. Thankfully, even when things get bad with customers, the management is always there to help the customer, and you. They take the flak off of you, and always offer constructive suggestions for how to handle sticky situations.", "cons": "If you can't deal with people's frustration then this isn't the job for you.", "advice": "Keep up the great work. The culture here is the envy of all businesses."}, {"title": "Nice fake reviews, social media team! Here", "text": "Pros It pays the bills. There's medical and dental. There's a free meal every shift, and snacks and soda. Although the soda is rationed because the staff was 'drinking too many.' You get a free Handy cleaning each month. And that's about it. Cons Seriously, where to begin. Handy Customer Experience team members are managed by sheer intimidation. The company provides free meals because there isn't time to go get food and come back and eat - and if you're a minute late, you'll be written up. Late to work? So are the managers, constantly. However, you do it and it's a write up. Which also usually comes with a healthy dose of being belittled by the management team, and goes as far as literally being screamed at in front of your teammates. They even log the time you spend going to the bathroom or getting a drink of water. Take too many? Drink less water and you won't have to get up as much... And if you don't? Layoffs. At least in the NYC HQ. Several rounds of public layoffs have occurred - and by public, I mean all the conference rooms are glass, so you literally get to watch the manager lay off your friends before your very eyes, then be escorted to the elevator. Because now that they figured out it costs half the price, all the jobs are being outsourced to call centers in Tampa and Arkansas. The workers there receive virtually no training, and constantly screw up customer accounts. But that bottom line, am I right? But then they go too far too fast -- fired too many people at once -- the hold times are often up to an hour on the phone, and 2-3 days via email. So then they beg you to stay for overtime, which is supposedly optional, but you are scolded if you wont stay extra time. There's also little to no coaching or scripts on how to handle situations -- the one manager who was attempting to build the training program left the second he got another job. (And good for him.) Everything is ruled by metrics - setting an unreasonable goal of interactions per hour which affect the level of customer service you can provide. Your goal is to get the person off the phone ASAP, with or without a resolution. Give the customer as little as you can get away with. Give the professionals as little as you can - purposely underpaying them in some circumstances for things to see if they notice. Handy is on no one's side but their own. When they switched the CX team from salary to hourly, they literally withheld half of every person's paycheck without any notice. Once it had already been done, an unapologetic email was sent by the lead manager, explaining why we weren't receiving our money. Many people struggled to afford their rents that month, as it was done on the Thanksgiving holiday weekend. Meanwhile, the managers are sleeping with employees, drugs are rampant at company parties/keggers, which are often held in-office while the CX staff tried to work. One time, the two of those elements combined very publicly, if you know what I mean! That manager had to resign. And I had to repeatedly Lysol the couch. Great for the programmers and management to get their thrills, awful for the customers who literally are hearing a rave going on in the background of their phone calls. Because if the party happens during your shift? The work doesn't stop just because there's a DJ and multiple bartenders in the room! If you don't assimilate and party hard, you become a quick target, no matter your metrics. Bro culture at its epitome. The NYC CX crew is small at this point. Dozens were fired in the layoffs, but many more have quit and run, often without another job to go to, or by accepting a job with less pay. Because the thought of returning to that sinking hellhole and being yelled at by miserable customers, yelled at by professionals who you know fully well we're screwing over, and being yelled at by the managers who should be supporting you... just becomes unbearable. So take the previous reviews with a grain of salt about the sunshine and unicorns... like most of the reviews on the apps, they are either current management, social media team, or friends of employees they gave free cleanings to in exchange for a review. (I coordinated a few of these myself.) Stay far away from Handy CX if you value your personal integrity. Advice to Management A team works harder when they believe in the product, the company, and the managers above them. Motivation is key. Currently, you have none of these going for you. You lie to your employees without blinking.", "rating": 1, "pros": "It pays the bills. There's medical and dental. There's a free meal every shift, and snacks and soda. Although the soda is rationed because the staff was 'drinking too many.' You get a free Handy cleaning each month. And that's about it.", "cons": "Seriously, where to begin. Handy Customer Experience team members are managed by sheer intimidation. The company provides free meals because there isn't time to go get food and come back and eat - and if you're a minute late, you'll be written up. Late to work? So are the managers, constantly. However, you do it and it's a write up. Which also usually comes with a healthy dose of being belittled by the management team, and goes as far as literally being screamed at in front of your teammates. They even log the time you spend going to the bathroom or getting a drink of water. Take too many? Drink less water and you won't have to get up as much...", "advice": "A team works harder when they believe in the product, the company, and the managers above them. Motivation is key. Currently, you have none of these going for you. You lie to your employees without blinking."}, {"title": "Terribly Mismanaged Company with a Middle School Mentality", "text": "Pros Free lunch and dinner, and many of your coworkers will be amazing people... just don't expect them to stick around when they're being overworked and exploited by upper management. Cons Upper management plays favorites, will not pay you for breaks (even though it's legally required), will not provide adequate training on new systems and then will punish you for not maintaining your metrics. Does not have an HR department and it SHOWS. Rampant sexism and racism from upper management. Advice to Management For gods sake, stop listening to Carrie, take a look at your overworked and under appreciated customer service people and start making real changes, not trying to distract everyone from the issues by buying them kegs once in a while. Conduct exit interviews and stop outsourcing!", "rating": 1, "pros": "Free lunch and dinner, and many of your coworkers will be amazing people... just don't expect them to stick around when they're being overworked and exploited by upper management.", "cons": "Upper management plays favorites, will not pay you for breaks (even though it's legally required), will not provide adequate training on new systems and then will punish you for not maintaining your metrics. Does not have an HR department and it SHOWS. Rampant sexism and racism from upper management.", "advice": "For gods sake, stop listening to Carrie, take a look at your overworked and under appreciated customer service people and start making real changes, not trying to distract everyone from the issues by buying them kegs once in a while. Conduct exit interviews and stop outsourcing!"}, {"title": "great company", "text": "Pros You get to choose your own schedule Cons I have no complaints Advice to Management keep up the great work", "rating": 5, "pros": "You get to choose your own schedule", "cons": "I have no complaints", "advice": "keep up the great work"}, {"title": "Deception at every turn.", "text": "Pros Some really great co-workers. Free meals, snacks and drinks. Comprehensive health benefits package. Cons Terrible division between CX and everyone else that naturally stems resentment. Constantly shrinking paychecks with no explanation whatsoever. No real advancement opportunities. Advice to Management Aim for a better office culture. The office is teeming with gossip and petty jealousies that permeate from the top-down. Also be much more transparent and accountable for company-wide decisions. These effect people's lives.", "rating": 3, "pros": "Some really great co-workers.", "cons": "Terrible division between CX and everyone else that naturally stems resentment.", "advice": "Aim for a better office culture. The office is teeming with gossip and petty jealousies that permeate from the top-down. Also be much more transparent and accountable for company-wide decisions. These effect people's lives."}, {"title": "STAY FAR AWAY FROM THIS FRATERNITY!", "text": "Pros free mediocre food and horrible coffee Cons - low salary - outsourcing - micromanaging - low morale - negative atmosphere Overall, not how they sell themselves at ALL. All employees started at 35k/year then were dropped down to hourly wages. Soon after they began letting people go under mysterious circumstances and opened up cs centers in Tampa and Arkansas where they pay them much less. Recently, money is mysteriously missing from direct deposits. Management doesn't help anyone in general so there's just finger-pointing and shrugging with you bring this or any other issue to their attention. It's a catastrophe, really. They should be embarrassed. Advice to Management Care a little. Stop micromanaging. Get organized. Try compensating your overworked and micromanaged employees properly instead of blowing money on kegs and cheap liquor constantly.", "rating": 1, "pros": "free mediocre food and horrible coffee", "cons": "- low salary", "advice": "Care a little."}, {"title": "Great product and platform, but lots of room for improvement when it comes to growth and opportunity.", "text": "Pros Great startup atmosphere, lots of fun. The people are great and know how to have a good time. Great chance to get experience in the new on-demand market space. Cons Very early stage startup with lots of issues, and it shows both on the inside the company and publicly. A frustrating \"design by committee\" atmosphere with little quality control. Still in the process of trying to figure out their core business model.", "rating": 3, "pros": "Great startup atmosphere, lots of fun. The people are great and know how to have a good time. Great chance to get experience in the new on-demand market space.", "cons": "Very early stage startup with lots of issues, and it shows both on the inside the company and publicly. A frustrating \"design by committee\" atmosphere with little quality control. Still in the process of trying to figure out their core business model.", "advice": null}, {"title": "Worst job experience", "text": "Pros Free lunch and dinner, snacks Cons Terrible hours, awful management, grossly underpay their employees, promotions are based off who you know/are friends with not on performance or merit. Cult-like mentality, every 3 months shifts are rotated based off metrics, yet they encourage you to focus on quality not quality -- double edged sword. CX is treated terribly by the rest of the company. Advice to Management try to build employee morale, rather than treat them like machines.", "rating": 1, "pros": "Free lunch and dinner, snacks", "cons": "Terrible hours, awful management, grossly underpay their employees, promotions are based off who you know/are friends with not on performance or merit. Cult-like mentality, every 3 months shifts are rotated based off metrics, yet they encourage you to focus on quality not quality -- double edged sword. CX is treated terribly by the rest of the company.", "advice": "try to build employee morale, rather than treat them like machines."}, {"title": "Worst startup out there..", "text": "Pros none.. terrible company. Management is the worst. 2 non technical founders running a tech startup is laughable. Cons everything is terrible here. the staff are all pretty much 3rd rate choices, no offense. if you aren't from harvard business school you will never get taken seriously anywhere in this company. there are a couple clicks that can get away with pretty much anything, and I mean anything. the office smells constantly and is over crowded. their pro's and handy pro's aren't good at all, maybe 2% actually are professionals, the rest are just, people posing as cleaners and pro's until they get removed from the system. to give you an idea of the type of culture they have built, last christmas party two of their cx agents thought it was ok to hook up in the office during the party in front of other co workers. Another cx employee puked all over the couch in one of the conference rooms, and someone else shattered a glass door. Now that's what I call a company Rager! there is no employee handbook per say for something that was called handbook, and it IS a running joke to everyone but the CEO that handy is a sexual term to most people. so the limitless amount of jokes that go on all the time is pretty funny. the company truly lives up to the new name, jerking around their employees and professionals. Advice to Management Get replacements for yourselves, the company might have a chance. worst leadership I've seen, bunch of people who never worked in a real office prior. the people who you don't care about your staff, are people, they have things going on at home, bills to pay. You care about none of that. No one in nyc can live off most the salaries you give, so literally most of your work force live in poverty, all of management lives pretty well. Go back to school and retake harvard's ethics class over and over until it sinks in..", "rating": 1, "pros": "none.. terrible company. Management is the worst. 2 non technical founders running a tech startup is laughable.", "cons": "everything is terrible here. the staff are all pretty much 3rd rate choices, no offense. if you aren't from harvard business school you will never get taken seriously anywhere in this company. there are a couple clicks that can get away with pretty much anything, and I mean anything. the office smells constantly and is over crowded. their pro's and handy pro's aren't good at all, maybe 2% actually are professionals, the rest are just, people posing as cleaners and pro's until they get removed from the system. to give you an idea of the type of culture they have built, last christmas party two of their cx agents thought it was ok to hook up in the office during the party in front of other co workers. Another cx employee puked all over the couch in one of the conference rooms, and someone else shattered a glass door. Now that's what I call a company Rager! there is no employee handbook per say for something that was called handbook, and it IS a running joke to everyone but the CEO that handy is a sexual term to most people. so the limitless amount of jokes that go on all the time is pretty funny. the company truly lives up to the new name, jerking around their employees and professionals.", "advice": "Get replacements for yourselves, the company might have a chance. worst leadership I've seen, bunch of people who never worked in a real office prior. the people who you don't care about your staff, are people, they have things going on at home, bills to pay. You care about none of that. No one in nyc can live off most the salaries you give, so literally most of your work force live in poverty, all of management lives pretty well. Go back to school and retake harvard's ethics class over and over until it sinks in.."}, {"title": "I met a lot of great people at this company, unfortunately many of them left.", "text": "Pros Handy is superb at recruiting interesting and intelligent people to work for them. Events we're fun, when we had them. Employee benefits are definitely great, like catered lunches and snacks. Cons Management was very deceptive in terms of moving up within the company, only lateral movement and seldom any raises with such movement. Policy changes were commonplace, but would always take effect before the information was disseminated to staff. In terms of business ethics, I found that certain decisions were questionable. I felt uneasy most of my time at Handy. Advice to Management Re-evaluate your core values. At my time at Handy, I found that none of the core values were ever openly expressed and definitely not practiced.", "rating": 1, "pros": "Handy is superb at recruiting interesting and intelligent people to work for them. Events we're fun, when we had them. Employee benefits are definitely great, like catered lunches and snacks.", "cons": "Management was very deceptive in terms of moving up within the company, only lateral movement and seldom any raises with such movement. Policy changes were commonplace, but would always take effect before the information was disseminated to staff. In terms of business ethics, I found that certain decisions were questionable. I felt uneasy most of my time at Handy.", "advice": "Re-evaluate your core values. At my time at Handy, I found that none of the core values were ever openly expressed and definitely not practiced."}, {"title": "One of the worst jobs I have ever had", "text": "Pros I took the job because I was desperate to get out of the restaurant industry, so it did help with that. Cons Horrible management, hours, treatment, food, co-workers, training. Advice to Management Give your customer service folks breaks :)", "rating": 1, "pros": "I took the job because I was desperate to get out of the restaurant industry, so it did help with that.", "cons": "Horrible management, hours, treatment, food, co-workers, training.", "advice": "Give your customer service folks breaks :)"}, {"title": "You'll give way more than you get", "text": "Pros Weekends free, health insurance and life insurance, free cleanings every month, they fly you to NYC to train for a week once you've been hired, company retreats. You're also helping some people get jobs and get their lives together, so that can be really nice for them. Cons I think HQ in NYC has no clue what working at Handy is like outside New York. They're very East Coast in that they don't understand or want to understand the challenges their satellite cities (i.e., Seattle, Austin, San Jose, D.C., Denver, Boston, Phoenix, Philly, LA, Baltimore) have, especially with regards to transportation and parking. Handy in NYC hosts orientations for new professionals right by a subway station, so no one working at Handy has to drive anywhere. Because I was a city manager in a satellite city, I had to drive all over to host orientations, paying for the gas myself and not getting reimbursed for a month. People in SF have to drive to Sacramento and San Jose to hold orientations. I am sorry, NYC, but those cities aren't close to each other. This guzzles a lot of gas and takes lots of travel time, time we could be using to do phone screens and be productive. Be better to the environment and your employees by hiring people for each city. We were forced to launch a neighboring city that was hundreds of miles roundtrip, and that's nothing compared to the folks managing cities in completely different states. Launching multiple cities was not at all what we signed up for. I was once told it was a \"luxury\" that I had one co-worker in my satellite city since so many people in satellite cities work alone with zero support. No, it is not a LUXURY to have a single co-worker. That is a basic part of working somewhere and it's really unfortunate that they expected me to feel privileged to have one person supporting me. Meanwhile at Handy HQ in NYC, everyone gets free lunches and dinners daily. I know it's because CX is there 24/7, but still, try to share with the rest of us for a change rather than simply yell at us when we don't make our numbers. NYC makes us do so many unnecessary calls every week: one on Monday, a pointless All Hands call on Tuesday morning, and a cluster call. Just seems like a big waste of everyone's time. I'm not even going to begin to talk about how hard it must be for the actual cleaners. That's another post entirely and you can read all about it in multiple Glassdoor reviews. These folks have it the worst. The platform is confusing and they get the wrong idea that they're employees. Believe it or not, I do like cofounder Umang. He has always been kind and it's clear he cares about the company and its people. I just wish he, Oisin, and some of the other higher ups in NYC would at least try to recognize how hard it is to work at Handy outside of their Manhattan bubbles and provide us the full support we need. Actually visit those of us in satellite cities to understand why we have the challenges we do. Advice to Management Hire people to manage ONE city. Yeah it will be more expensive for you but you won't LITERALLY drive people to resign that way. Show some more respect to people below you, such as the cleaners themselves and your employees. Actually make an effort to understand the experiences of the people below you so you won't be so quick to berate them for not living up to your unreasonable demands.", "rating": 3, "pros": "Weekends free, health insurance and life insurance, free cleanings every month, they fly you to NYC to train for a week once you've been hired, company retreats. You're also helping some people get jobs and get their lives together, so that can be really nice for them.", "cons": "I think HQ in NYC has no clue what working at Handy is like outside New York. They're very East Coast in that they don't understand or want to understand the challenges their satellite cities (i.e., Seattle, Austin, San Jose, D.C., Denver, Boston, Phoenix, Philly, LA, Baltimore) have, especially with regards to transportation and parking. Handy in NYC hosts orientations for new professionals right by a subway station, so no one working at Handy has to drive anywhere. Because I was a city manager in a satellite city, I had to drive all over to host orientations, paying for the gas myself and not getting reimbursed for a month. People in SF have to drive to Sacramento and San Jose to hold orientations. I am sorry, NYC, but those cities aren't close to each other. This guzzles a lot of gas and takes lots of travel time, time we could be using to do phone screens and be productive. Be better to the environment and your employees by hiring people for each city. We were forced to launch a neighboring city that was hundreds of miles roundtrip, and that's nothing compared to the folks managing cities in completely different states. Launching multiple cities was not at all what we signed up for.", "advice": "Hire people to manage ONE city. Yeah it will be more expensive for you but you won't LITERALLY drive people to resign that way. Show some more respect to people below you, such as the cleaners themselves and your employees. Actually make an effort to understand the experiences of the people below you so you won't be so quick to berate them for not living up to your unreasonable demands."}, {"title": "Choose another start up", "text": "Pros The work isn't hard and is rewarding in some aspects Cons Management is pretty terrible, there is no room for upwards mobility, terrible company culture, under compensated, they take advantage of you, basically. Advice to Management Stop being so cheap. I understand you have a company to run but you re absurdly cheap to the point where it is offensive to your employees who are putting in extra hours every night. You won't even give people their own beds in a hotel room.", "rating": 3, "pros": "The work isn't hard and is rewarding in some aspects", "cons": "Management is pretty terrible, there is no room for upwards mobility, terrible company culture, under compensated, they take advantage of you, basically.", "advice": "Stop being so cheap. I understand you have a company to run but you re absurdly cheap to the point where it is offensive to your employees who are putting in extra hours every night. You won't even give people their own beds in a hotel room."}, {"title": "Great people, but management is a total mess.", "text": "Pros Tons of great, smart people. Cons Management is a complete mess. A vast majority of the CX team hates working there. The negative office culture is very pervasive and while some of the management care and would like to see a change, those with the power to do anything about don't care or are totally ignorant to the issue. There seems to be little to no accountability for the disappointing common sexual harassment and payroll issues. CX team is essentially used to manage blowback from questionable decisions made by the growth team and the engineers. Finally, despite claiming opportunities for upward growth within the company, the best anyone within the CX team is offered is a horizontal position change, usually resulting in more responsibility, longer hours and no pay increase. Advice to Management Address the significant rift between CX and the rest of the company. Work to reassure your employees that someone actually cares, which should start by addressing the most basic issues at times other than when it means bad press.", "rating": 3, "pros": "Tons of great, smart people.", "cons": "Management is a complete mess. A vast majority of the CX team hates working there. The negative office culture is very pervasive and while some of the management care and would like to see a change, those with the power to do anything about don't care or are totally ignorant to the issue. There seems to be little to no accountability for the disappointing common sexual harassment and payroll issues. CX team is essentially used to manage blowback from questionable decisions made by the growth team and the engineers. Finally, despite claiming opportunities for upward growth within the company, the best anyone within the CX team is offered is a horizontal position change, usually resulting in more responsibility, longer hours and no pay increase.", "advice": "Address the significant rift between CX and the rest of the company. Work to reassure your employees that someone actually cares, which should start by addressing the most basic issues at times other than when it means bad press."}, {"title": "Everyone Jumping Ship", "text": "Pros *the company is profitable ? Cons *management babysits us *we are never closed for 1 holiday. We had a x-mas party and they made us work through it. * 3 of our 5 managers have quit or found new jobs in the past 60 days. The rest of them are fairly open about their disdain or want for another job. *everyone in this company wants another job Advice to Management This company's culture is determined by the men and women who lead it. It's clear all that they care about it the end game when they sell it and get rich.", "rating": 1, "pros": "*the company is profitable ?", "cons": "*management babysits us", "advice": "This company's culture is determined by the men and women who lead it. It's clear all that they care about it the end game when they sell it and get rich."}, {"title": "Awesome Company to work!", "text": "Pros Great people are hired in the company. Everyone likes a challenge and is willing to work really hard. The company has great future potential. Cons Restricted upward mobility. Compensation is not great. Advice to Management More compensation, more structure", "rating": 5, "pros": "Great people are hired in the company. Everyone likes a challenge and is willing to work really hard. The company has great future potential.", "cons": "Restricted upward mobility. Compensation is not great.", "advice": "More compensation, more structure"}, {"title": "Good pay with benefits", "text": "Pros Pay is great for a job that doesn't require much. Lunch, snacks, and drinks are provided. Co-workers are friendly and understanding. Location was ideal for me. Benefits are good. Cons Either be comfortable with customer service (because you will spend 4/5 days on the phone with unhappy customers) or be the type that just doesn't care and can brush it off. Advice to Management Improve training process for employees; while new employee training is streamlined and presents diverse scenarios, there are many issues still needing to be dealt with in a uniform manner (updates, new training, macros, etc.)", "rating": 5, "pros": "Pay is great for a job that doesn't require much. Lunch, snacks, and drinks are provided. Co-workers are friendly and understanding. Location was ideal for me. Benefits are good.", "cons": "Either be comfortable with customer service (because you will spend 4/5 days on the phone with unhappy customers) or be the type that just doesn't care and can brush it off.", "advice": "Improve training process for employees; while new employee training is streamlined and presents diverse scenarios, there are many issues still needing to be dealt with in a uniform manner (updates, new training, macros, etc.)"}, {"title": "Amazing for high performers, bad for under-performers. If you want to win this is for you.", "text": "Pros I've never worked anywhere that has grown this quickly, the pace of change is incredible. The opportunities for personal / professional growth are everywhere - you can suggest ideas and if they are good they will be live within days across tens of thousands of customers. This is great... and also a little scary. If you perform there is no limit to where you can go at Handybook. The organization is extremely flat - it has gone from 25 people to over 180 people in less than 10 months. The two founders still sit right in the middle of the office - which is v cramped! If you think you're a high performing team member then this is the place for you. The founders hold each other to a really high standard - they both work CRAZY hours and regularly challenge each other about the best way of doing things. If you're there for these conversations it is really fun - sometimes scary - but normally v fun. Cons Not suitable for mediocrity... if you don't give it 100% every day then this is not the place for you. The founders hold the management team to v high standards and as a result the managers hold everyone to high standards. This can be scary. I see the bad reviews and although I disagree with them... I can understand them. I've had some friends who were fired / managed out of Handybook and although I really liked them as people and friends I thought they were not giving it 100% and didn't think they were focused on their careers at Handybook. If you don't want to win and aren't willing to give it 100% every single day then Handybook is not for you. Advice to Management More structured opportunities for improvement for under-performers... I know startups don't normally do a great job at this.", "rating": 5, "pros": "I've never worked anywhere that has grown this quickly, the pace of change is incredible.", "cons": "Not suitable for mediocrity... if you don't give it 100% every day then this is not the place for you.", "advice": "More structured opportunities for improvement for under-performers... I know startups don't normally do a great job at this."}, {"title": "Avoid at all costs", "text": "Pros Free meals and a paycheck despite how small Cons Everyone outside of management hates it. No efforts to make things better. Sky high turnover since all you're doing is being yelled at by customers or supervisors improve your metrics. Half the people you start with will be gone by 3 months. You're another number and not a human being. It's absolutely not worth it. Your life and wallet would be better off if you spent more time looking for a different job if you're even considering Handybook. Advice to Management Focus on keeping everyone happy.", "rating": 1, "pros": "Free meals and a paycheck despite how small", "cons": "Everyone outside of management hates it. No efforts to make things better. Sky high turnover since all you're doing is being yelled at by customers or supervisors improve your metrics. Half the people you start with will be gone by 3 months. You're another number and not a human being. It's absolutely not worth it. Your life and wallet would be better off if you spent more time looking for a different job if you're even considering Handybook.", "advice": "Focus on keeping everyone happy."}, {"title": "Phenomenal", "text": "Pros There are a million pros I could write about this job, truly. Office culture is top notch. Everyone is very, very intelligent, but not only that, they are also social, fun, and very diverse. The days fly by, I start work at 9am and only ever even think to look at the clock for the first time after 2:30pm. There's awesome office lunches and dinners catered every day & 2 happy hours a month on the company. Tons of snacks like multiple kinds of granola bars, chocolate, chips, candy, popcorn, crackers, peanut butter pretzels, fresh fruit, trail mix, fruit snacks..also fully stocked beverages like sodas, seltzers, juice, coffees, beers & ciders. You're trusted to do your job very quickly, you won't feel like \"the new person\" for very long or that you have to earn your keep. There is a buddy system where each new employee gets partnered up with someone from their same department one week & someone totally random and from another department the next, to go out and get coffee or walk around and get to know each other for a bit, so you really get to meet people. You will laugh & smile more throughout your workweek than you would anywhere else. You will bond with your coworkers & gain some of your best friends at this company. There are also company retreat weekends and other fun social things. Cons Other reviews make it seem much, much worse than it is, but there is just a little truth behind them. 1) The company is growing very, VERY rapidly, so our office is pretty full during the day. It's clear we need more space, and we are moving this summer! 2) That being said, the office also can seem a bit cluttered, but not really disgusting/filthy. We have our own cleaning professionals come in 3 times a day to clean. The back pantry room has lots of boxes of snacks, beverages, and other pantry supplies stacked up, but that is because the ordering has to be done for so many people now, there just isn't room to put everything on the shelves. The only other solution would be for them to stop ordering the snacks for now, and I need my granola bars, so I don't want to see this happening! Also, the place is not \"roach infested\" as I saw mentioned in another review--the building does occasionally have a few cockroaches, and sometimes there will be one in the very back hallway by the trash room & freight elevator, which are not part of the main Handybook office. Even when there is the report of someone seeing just one, the managers are sure to not only let the building owner know, but they even call in and pay for exterminators on their OWN, on the company's dime, so that we don't have to wait for the sometimes unresponsive building managers and property owners to solve the issue. 3) Communication--this is nowhere near a hostile environment, and even reading that in a review startled me & made me hope that the person writing it has solved the personal issues they may have had with one or two other people, because that is just so crazy to hear. Right now since the team is so huge, there are days where you can feel like you are out of the loop on what is going on as far as where the company is heading, but they actively try to combat this by sending out update emails on what every team has and is doing, posting the quarterly initiatives on our team site, sharing links to what's being said about the company in the news, and having quarterly all-hands meetings, meaning everyone in the entire company. I know that communication is one of the most important things that will be focused on improving in the next few weeks, I think it was just rough for them to keep up with everything while we grew so fast, but you can tell they really want to make sure things are smoother going forward. 4) Again, goes with the fact that this company is experiencing tremendous growth--the founders clearly want to be approachable--they sit right in the middle of the office! Even though it is the noisiest & busiest area of the office and they would like to work in a more secluded & quiet area, I'm sure! But there haven't been as many opportunities to meet with them and talk about things and ask questions as there were before, because they are busier than ever right now too. Advice to Management More time to talk with you and ask questions would be appreciated, but I understand you're busy right now!", "rating": 5, "pros": "There are a million pros I could write about this job, truly. Office culture is top notch. Everyone is very, very intelligent, but not only that, they are also social, fun, and very diverse. The days fly by, I start work at 9am and only ever even think to look at the clock for the first time after 2:30pm. There's awesome office lunches and dinners catered every day & 2 happy hours a month on the company. Tons of snacks like multiple kinds of granola bars, chocolate, chips, candy, popcorn, crackers, peanut butter pretzels, fresh fruit, trail mix, fruit snacks..also fully stocked beverages like sodas, seltzers, juice, coffees, beers & ciders. You're trusted to do your job very quickly, you won't feel like \"the new person\" for very long or that you have to earn your keep. There is a buddy system where each new employee gets partnered up with someone from their same department one week & someone totally random and from another department the next, to go out and get coffee or walk around and get to know each other for a bit, so you really get to meet people. You will laugh & smile more throughout your workweek than you would anywhere else. You will bond with your coworkers & gain some of your best friends at this company. There are also company retreat weekends and other fun social things.", "cons": "Other reviews make it seem much, much worse than it is, but there is just a little truth behind them.", "advice": "More time to talk with you and ask questions would be appreciated, but I understand you're busy right now!"}, {"title": "Corporate Greed Strikes Again (Stay Far, Far Away!)", "text": "Pros You may meet some kind hearted, cool people here. However, it won't matter because they will be just as downtrodden, overworked, underpaid, and undervalued as you are. Yippee. Cons Advice: do not work for Handybook. -There is a \"dude-bro,\" fraternity flavored, elitist culture that permeates the office. They play favorites here. Be warned. -The heads of the company want to give the impression that they run a forward thinking, progressive company that works to improve the lives of their employees and the world at large, when it actually seems like it's run on old fashioned, corporate/Ivy League greed and apathy. And no, they do not care about employee burnout or turnover as the mindset is to treat employees as disposable commodity. You come, you go. Easy as that. Same attitude goes for their customers and their contract laborers who perform the actual jobs for them. -You think with this being a cleaning company that they would not have issues with keeping the office clean but yet they do! The garbage cans in the food/pantry area overflow with garbage at all times of the day which draws flies and other vermin. Food is often left out, uncovered, and/or left strewn all over the tables after the lunch rush. Oh, and the amount of food that goes to waste there; it's extremely shameful and sad given how many hungry people reside in this city. -They will lie to you during the interview process and tout the company as a great place to work with a ton of benefits and opportunity for mobility. No. They will bait and switch on you claiming that the nonsense taking place is all a part of the \"growth\" of the company. If you are silly enough to take a job there, expect little to no support or resources to successfully do your job. The only time management cares to acknowledge you is when sending intimidating emails about following/not following ambiguous company policies. I could go on all day about this place. Moral of the story: just stay away. Advice to Management Be true mavericks and actually care about the people putting money into your pockets and food into your mouths. Arrogance and privileged attitudes among key staff do not make for a rewarding working environment and will ultimately cause your business to suffer.", "rating": 1, "pros": "You may meet some kind hearted, cool people here. However, it won't matter because they will be just as downtrodden, overworked, underpaid, and undervalued as you are. Yippee.", "cons": "Advice: do not work for Handybook.", "advice": "Be true mavericks and actually care about the people putting money into your pockets and food into your mouths. Arrogance and privileged attitudes among key staff do not make for a rewarding working environment and will ultimately cause your business to suffer."}, {"title": "Pay of a startup with the culture of a corporate bank (and the career opportunity of neither)", "text": "Pros Catered lunches, dinners, snacks and drinks included Company events outside the office (happy hours, parties, retreats, etc.) are generally very fun, informal, and open There are definitely awesome, smart, fun, and caring people who work here. Unfortunately it doesn't extend to the broader company culture. Cons Higher ups in the company have a very cocky, entitled, and arrogant attitude, and tend play favorites amongst specific individuals within the company. This is a trend that has gotten increasingly worse as the company has grown. Expect to be micromanaged. Don't think that working hard will result in you getting acknowledged or rewarded. Initiative and taking ownership of a problem is more likely to increase your liability or get you reprimanded rather than get you any recognition (priorities are always on growth and doing things quickly rather than correctly). This is a company where if you put in 150%, you'll get 50% in return. As a result, employees (admittedly myself included) are motivated to care more about their individual numbers and and apparent performance rather than doing what's best for the company, customers, or contracted professionals. This issue is made much worse by the fact that people lower within the company are treated much more critically than those on top. Handybook has been very poor, bordering on unethical, in upholding their terms of the hiring contract. This is particularly true with respect to policies regarding vacation, overtime. Don't think that there's actually an open policy around vacation (although again, this depends on who you are and who you report to). The company has grown quickly, but unfortunately it hasn't grown well. As a result things are constantly broken and your ability to work effectively will be inhibited by factors completely outside of your control (software bugs, operational or communication backlogs, etc). Also, the office is EXTREMELY crowded, although to be fair management is working hard to sign a new lease so hopefully this will change in the near future. Finally, it's highly, highly likely that some of the five star reviews here are planted. Beware. Advice to Management Please be more ethical. Listen, communicate, and be more open and transparent to those within the lower ranks of the company. There's a LOT of opportunities for improvement across the company that wouldn't require a Harvard degree to recognize. Why put so much emphasis on hiring, but so little on retention? The latter is far more costly than the former... Don't encourage people to write positive Glassdoor reviews. It might backfire if someone writes a negative review (case in point).", "rating": 1, "pros": "Catered lunches, dinners, snacks and drinks included", "cons": "Higher ups in the company have a very cocky, entitled, and arrogant attitude, and tend play favorites amongst specific individuals within the company. This is a trend that has gotten increasingly worse as the company has grown.", "advice": "Please be more ethical. Listen, communicate, and be more open and transparent to those within the lower ranks of the company. There's a LOT of opportunities for improvement across the company that wouldn't require a Harvard degree to recognize."}, {"title": "A Chance to Make Your Own Path", "text": "Pros As a recent college grad, I didn't expect to find a work environment that was so based on intellectualism and fraternity in the real world. You can tell from just the interviews that the company isn't looking for space fillers, but for people that are going to make long-term impact. Handybook truly embodies the entrepreneurial culture of a start-up, but also encourages individuality and transparency- making it clear that the future lies with in the hands of the current employees. I can honestly say that this is a change of a lifetime, a chance for growth and opportunity, both for yourself and for the company. Cons The hours can be long, but that being said, Handybook makes a sincere effort to hire unique and engaging people which certainly makes the day fly by. Advice to Management Even though we are growing tremendously, try to keep encouraging team collaborations/interactions!", "rating": 5, "pros": "As a recent college grad, I didn't expect to find a work environment that was so based on intellectualism and fraternity in the real world. You can tell from just the interviews that the company isn't looking for space fillers, but for people that are going to make long-term impact. Handybook truly embodies the entrepreneurial culture of a start-up, but also encourages individuality and transparency- making it clear that the future lies with in the hands of the current employees. I can honestly say that this is a change of a lifetime, a chance for growth and opportunity, both for yourself and for the company.", "cons": "The hours can be long, but that being said, Handybook makes a sincere effort to hire unique and engaging people which certainly makes the day fly by.", "advice": "Even though we are growing tremendously, try to keep encouraging team collaborations/interactions!"}, {"title": "Highly recommended place to work!", "text": "Pros Handybook is a great place to work. It has a fun and energetic culture, extremely smart and motivated people and wonderful benefits. The work is definitely stimulating-- new projects come up all the time and I'm constantly learning. There's a lot of potential to grow with the company and the company itself is growing extremely fast. It's exciting to be a part of that. Cons No cons-- wonderful place to work!", "rating": 5, "pros": "Handybook is a great place to work. It has a fun and energetic culture, extremely smart and motivated people and wonderful benefits. The work is definitely stimulating-- new projects come up all the time and I'm constantly learning. There's a lot of potential to grow with the company and the company itself is growing extremely fast. It's exciting to be a part of that.", "cons": "No cons-- wonderful place to work!", "advice": null}, {"title": "Ambitious company with incredible opportunities", "text": "Pros Endless growth potential -- personally and professionally. Extremely intelligent colleagues from the top down. A friendly, social and exciting environment. Nearly everyone is motivated to make the company a fun, electrifying place to work while we shoot for big targets. Absolutely never a dull moment. Cons No cons! Extremely happy here and looking forward to growing with the team. Advice to Management Perhaps a bit more interaction with the teams would be nice, but overall we have attentive and easily accessible management.", "rating": 5, "pros": "Endless growth potential -- personally and professionally. Extremely intelligent colleagues from the top down. A friendly, social and exciting environment. Nearly everyone is motivated to make the company a fun, electrifying place to work while we shoot for big targets. Absolutely never a dull moment.", "cons": "No cons! Extremely happy here and looking forward to growing with the team.", "advice": "Perhaps a bit more interaction with the teams would be nice, but overall we have attentive and easily accessible management."}, {"title": "Not Great", "text": "Pros Good Concept People working there were really cool Cons They have complete disregard for the cleaners and employees. Wouldn't describe as the most ethical company around", "rating": 3, "pros": "Good Concept", "cons": "They have complete disregard for the cleaners and employees.", "advice": null}, {"title": "Fun time", "text": "Pros Great working experience and fun environment Cons Long hours that require to stay late", "rating": 3, "pros": "Great working experience and fun environment", "cons": "Long hours that require to stay late", "advice": null}, {"title": "Awesome", "text": "Pros The pay is great. I would definitely recommend if you want to work part time for a decent salary. Cons I don;t have any cons Advice to Management Thanks for all your encouragement.", "rating": 5, "pros": "The pay is great. I would definitely recommend if you want to work part time for a decent salary.", "cons": "I don;t have any cons", "advice": "Thanks for all your encouragement."}, {"title": "Short sighted", "text": "Pros Company is work hard and customer experience and operations are evolving very quickly so you can see change happening. Cons Lack of office culture. Constantly shifting in staff. No investment in employees.", "rating": 3, "pros": "Company is work hard and customer experience and operations are evolving very quickly so you can see change happening.", "cons": "Lack of office culture. Constantly shifting in staff. No investment in employees.", "advice": null}, {"title": "Experience", "text": "Pros The company gives us work flexibility which I want most from my company. The salary range of the company is fair and it gives us other facilities too. The work environment is good and helpful. Cons Sometimes the work pressure is too high. It makes us feel anxious. The customers behave well but sometimes they do not keep that behavior. Advice to Management researching the potential market and local demographic will be key in determining the type of cleaning business you should start. If you’re planning on running a domestic cleaning venture you’ll need to ensure that people in the local area are financially able to pay for someone else to do their domestic chores, likewise for a commercial business are there enough viable contracts to win? Market research will also be key in determining your prices.", "rating": 5, "pros": "The company gives us work flexibility which I want most from my company. The salary range of the company is fair and it gives us other facilities too. The work environment is good and helpful.", "cons": "Sometimes the work pressure is too high. It makes us feel anxious. The customers behave well but sometimes they do not keep that behavior.", "advice": "researching the potential market and local demographic will be key in determining the type of cleaning business you should start. If you’re planning on running a domestic cleaning venture you’ll need to ensure that people in the local area are financially able to pay for someone else to do their domestic chores, likewise for a commercial business are there enough viable contracts to win? Market research will also be key in determining your prices."}, {"title": "Great work place!", "text": "Pros Best company I ever work with! Value for every employee decision! Nice work environment! Cons I found literally found NO cons from my side! Advice to Management You are doing well..keep going!", "rating": 5, "pros": "Best company I ever work with!", "cons": "I found literally found NO cons from my side!", "advice": "You are doing well..keep going!"}, {"title": "Positive culture", "text": "Pros In the time I worked with Handy I experienced a positive culture, and work practices were maintained to a very good level. It was a pleasure to be a part of this company, as I learned a lot from the more experienced staff. Cons Sometimes clients can make your day a hard one, but I guess that applies to every job where you have to deal with clients Advice to Management keep hiring positive people", "rating": 5, "pros": "In the time I worked with Handy I experienced a positive culture, and work practices were maintained to a very good level. It was a pleasure to be a part of this company, as I learned a lot from the more experienced staff.", "cons": "Sometimes clients can make your day a hard one, but I guess that applies to every job where you have to deal with clients", "advice": "keep hiring positive people"}]