[{"title": "Current employee", "text": "Pros Work environment is friendly, open and supportive Opportunities to growth Great people Flexibility Work from home option Cons some processes and systems should be improved", "rating": 5, "pros": "Work environment is friendly, open and supportive", "cons": "some processes and systems should be improved", "advice": null}, {"title": "HCL review", "text": "Pros Great place for those who look for balance of life. Cons salary not as per what industry leaders offer Advice to Management willing to pay more for better talent. Some times it is difficult to get the right talent when there are business opportunities.", "rating": 5, "pros": "Great place for those who look for balance of life.", "cons": "salary not as per what industry leaders offer", "advice": "willing to pay more for better talent. Some times it is difficult to get the right talent when there are business opportunities."}, {"title": "It is a good place to work with", "text": "Pros OVerall good company.. opportunities and growth Cons need to inprove working culture", "rating": 5, "pros": "OVerall good company.. opportunities and growth", "cons": "need to inprove working culture", "advice": null}, {"title": "Good opportunities for growth", "text": "Pros Great place to learn skills Cons No cons as per my experience", "rating": 5, "pros": "Great place to learn skills", "cons": "No cons as per my experience", "advice": null}, {"title": "Work Environment", "text": "Pros Ample opportunities available to explore Cons Work life balance is tough to maintain", "rating": 5, "pros": "Ample opportunities available to explore", "cons": "Work life balance is tough to maintain", "advice": null}, {"title": "Stable career and work-life balance", "text": "Pros HCL is a great place to learn and grow. A lot of opportunities to explore and good work-life balance! Culture is good, everyone is ready to help you succeed. Cons The career growth is slow. Compensation is moderate as per industry standards. Corporate structure is rigid and it is not easy to bring radical changes.", "rating": 5, "pros": "HCL is a great place to learn and grow. A lot of opportunities to explore and good work-life balance! Culture is good, everyone is ready to help you succeed.", "cons": "The career growth is slow. Compensation is moderate as per industry standards. Corporate structure is rigid and it is not easy to bring radical changes.", "advice": null}, {"title": "OK company to work", "text": "Pros They provide good opportunities for freshers. Senior employees are very knowledgeable about the work they do. Cons Salary and bonus is very low. There is no yearly increment. And it takes very long time to get a promotion", "rating": 3, "pros": "They provide good opportunities for freshers. Senior employees are very knowledgeable about the work they do.", "cons": "Salary and bonus is very low. There is no yearly increment. And it takes very long time to get a promotion", "advice": null}, {"title": "Software QA Engineer", "text": "Pros Friendly, helpful and opportunity to learn. Cons Not adequate training opportunity available.", "rating": 3, "pros": "Friendly, helpful and opportunity to learn.", "cons": "Not adequate training opportunity available.", "advice": null}, {"title": "HCL Review", "text": "Pros Good place to learn and get hands on experience in multiple domains. Secured job Cons Don't expect that much salary hike in your appraisal", "rating": 5, "pros": "Good place to learn and get hands on experience in multiple domains. Secured job", "cons": "Don't expect that much salary hike in your appraisal", "advice": null}, {"title": "Level 1 Analyst", "text": "Pros Work is steady and consistent Cons Managers need better communication skills Advice to Management Managers need leadership training", "rating": 3, "pros": "Work is steady and consistent", "cons": "Managers need better communication skills", "advice": "Managers need leadership training"}, {"title": "Senior Technical Manager", "text": "Pros Great benefits, flexible schedule, and self-discipline work. Cons There are many systems within HCL's organization. Many are centred around their IT business. HCL systems can be difficult to learn. Advice to Management Set more time for on-boarding with reviews each month for 3 months.", "rating": 5, "pros": "Great benefits, flexible schedule, and self-discipline work.", "cons": "There are many systems within HCL's organization. Many are centred around their IT business. HCL systems can be difficult to learn.", "advice": "Set more time for on-boarding with reviews each month for 3 months."}, {"title": "Diversity and other concerns", "text": "Pros Flexibility based on client need, 401k, good health benefits Cons Lot of internal policies. Women are missing in leadership roles. HCL is trying but whenever new role comes, women leadership is filled from outside rather enhancing skills internally. Women will be mostly given delivery or project management type roles. Advice to Management Self assessment", "rating": 3, "pros": "Flexibility based on client need, 401k, good health benefits", "cons": "Lot of internal policies. Women are missing in leadership roles. HCL is trying but whenever new role comes, women leadership is filled from outside rather enhancing skills internally. Women will be mostly given delivery or project management type roles.", "advice": "Self assessment"}, {"title": "Cool place to settle down", "text": "Pros work environment is very good Cons salary and increments are very low", "rating": 5, "pros": "work environment is very good", "cons": "salary and increments are very low", "advice": null}, {"title": "Average Across the Board", "text": "Pros Got experience working on Microsoft websites which boosted my resume. Cons My first team was good and we had daily stand up (Skype) meetings. The project manager of my last team never had any meetings so it was difficult to communicate. We only communicated via email.", "rating": 3, "pros": "Got experience working on Microsoft websites which boosted my resume.", "cons": "My first team was good and we had daily stand up (Skype) meetings. The project manager of my last team never had any meetings so it was difficult to communicate. We only communicated via email.", "advice": null}, {"title": "Good Company", "text": "Pros Over all good company to work with. Cons I would say HR people to be more active and supportive to ground workers not just to support higher managers.", "rating": 5, "pros": "Over all good company to work with.", "cons": "I would say HR people to be more active and supportive to ground workers not just to support higher managers.", "advice": null}, {"title": "Good", "text": "Pros Work Culture is good compqny policies are Company policies are goodGrowing company no hire and fire policy so in that way it’s good Cons ManagementIs not so good they need to understand the needs of them ploys and work accordinglyIt was forcing me to tell about cons but I didn’t had anything to say so just filled up the words Advice to Management Nothing", "rating": 5, "pros": "Work Culture is good compqny policies are Company policies are goodGrowing company no hire and fire policy so in that way it’s good", "cons": "ManagementIs not so good they need to understand the needs of them ploys and work accordinglyIt was forcing me to tell about cons but I didn’t had anything to say so just filled up the words", "advice": "Nothing"}, {"title": "Some positives, but overall experience has been difficult", "text": "Pros Regular budget provided to allow me to host parties and meals for my team. Reimbursed for relocation for this job; in general, reimbursement process for business expenses has been fair and expedient. In my experience, HCL works hard to recognize people for jobs well done and to encourage (nearly force) people to submit their ideas for improvement. Good people with whom I most closely work. Cons Micro-managing by a senior management that is clearly out of touch with day-to-day operations, yet decisions are made and marching orders given that often make little sense to those in the trenches, so to speak, who most understand what is needed. This managerial approach has led to stress on the team and has negatively impacted, in some ways, the service we provide our client. Advice to Management Senior Management, when first-level and middle managers provide you with input and feedback regarding concerns and improvement needs, please take it to heart and consider it an opportunity for dialogue for purposes of arriving at the best solution. Lower-level management has valuable input that will not always be apparent in data reports.", "rating": 3, "pros": "Regular budget provided to allow me to host parties and meals for my team. Reimbursed for relocation for this job; in general, reimbursement process for business expenses has been fair and expedient. In my experience, HCL works hard to recognize people for jobs well done and to encourage (nearly force) people to submit their ideas for improvement. Good people with whom I most closely work.", "cons": "Micro-managing by a senior management that is clearly out of touch with day-to-day operations, yet decisions are made and marching orders given that often make little sense to those in the trenches, so to speak, who most understand what is needed. This managerial approach has led to stress on the team and has negatively impacted, in some ways, the service we provide our client.", "advice": "Senior Management, when first-level and middle managers provide you with input and feedback regarding concerns and improvement needs, please take it to heart and consider it an opportunity for dialogue for purposes of arriving at the best solution. Lower-level management has valuable input that will not always be apparent in data reports."}, {"title": "software engineer", "text": "Pros good place to work in seattle Cons consultant job (no much benefits) Advice to Management Nothing specific to mentioned from experience.", "rating": 3, "pros": "good place to work in seattle", "cons": "consultant job (no much benefits)", "advice": "Nothing specific to mentioned from experience."}, {"title": "Poor management substandard pay", "text": "Pros Somewhat flexible hours, nice work site, ok benefits Cons Substandard pay, incompetent management, dishonest recruiters, questionably ethical business practices, employees are treated like children, check box training, apathetic coworkers that only do the bare minimum to not get fired, company values are preached but never observed, highly political work environment. Advice to Management Take a more active role in learning what your software development teams do. Stop letting incompetence thrive by allowing those that are incompetent to deflect and delegate responsibilities. Hold your employees accountable for their actions and stop being so greedy (yes its that obvious).", "rating": 3, "pros": "Somewhat flexible hours, nice work site, ok benefits", "cons": "Substandard pay, incompetent management, dishonest recruiters, questionably ethical business practices, employees are treated like children, check box training, apathetic coworkers that only do the bare minimum to not get fired, company values are preached but never observed, highly political work environment.", "advice": "Take a more active role in learning what your software development teams do. Stop letting incompetence thrive by allowing those that are incompetent to deflect and delegate responsibilities. Hold your employees accountable for their actions and stop being so greedy (yes its that obvious)."}, {"title": "Not Much", "text": "Pros Your job is safe if you play politics. Cons No salary increments. Doesnt matter even if you work smart you still would get average rating. Lots of politics and higher management always try to save their jobs rather than mentoring teams. No investment in training people on latest technologies. They love support projects and bid at low prices and in turn keep employees salaries low. Advice to Management Not required. If a resource is good they will jump the ship the moment they understand the culture. We have 8 people in our team moved out of company in the last 2 years.", "rating": 1, "pros": "Your job is safe if you play politics.", "cons": "No salary increments.", "advice": "Not required. If a resource is good they will jump the ship the moment they understand the culture. We have 8 people in our team moved out of company in the last 2 years."}, {"title": "Analyst", "text": "Pros Funny nothing comes to mind. Even managers resigned. Cons Workloads , revolving door, monthly reviews, micro management and pay scale below market rate. Must use your own vehicle. Advice to Management Implement a automated \"Call Distribution \" process so that request will be issued fairly and hire special teams for Executive support and special projects and escalations. Hire more technicians for Break/Fix team and have only one request queue.", "rating": 1, "pros": "Funny nothing comes to mind. Even managers resigned.", "cons": "Workloads , revolving door, monthly reviews, micro management and pay scale below market rate. Must use your own vehicle.", "advice": "Implement a automated \"Call Distribution \" process so that request will be issued fairly and hire special teams for Executive support and special projects and escalations. Hire more technicians for Break/Fix team and have only one request queue."}, {"title": "Need access in us", "text": "Pros Get pay check on time. Salary stated out good then no raises . No support don’t care only want the money Cons Never enough support. Working in US with Hcl has been difficult Need better managers, need to care about what they, seems to only be about money on both sides and the employees in us work like at a sweatshop, terrible. They court you when you are first hired because they don’t know anything. How they get the contracts bewilders me. They can’t keep them though Beware", "rating": 1, "pros": "Get pay check on time. Salary stated out good then no raises . No support don’t care only want the money", "cons": "Never enough support. Working in US with Hcl has been difficult", "advice": null}, {"title": "Software Engineer", "text": "Pros Challenging Work Environment, Good Projects Cons No proper Hikes you will mostly end up getting a production support L1 or L2 project.", "rating": 3, "pros": "Challenging Work Environment, Good Projects", "cons": "No proper Hikes", "advice": null}, {"title": "Good company", "text": "Pros Good and open working environment, good growth opportunities, decent benefits. Cons Low salary is the biggest con. Advice to Management Better pay to retain competitive employees", "rating": 3, "pros": "Good and open working environment, good growth opportunities, decent benefits.", "cons": "Low salary is the biggest con.", "advice": "Better pay to retain competitive employees"}, {"title": "Senior Help Desk Analyst", "text": "Pros Great benefits package. Great team-members. Casual atmosphere. Cons Your experience will vary depending upon the project you're assigned to. HCL is a large company, so it is incredibly easy to feel like you're just a number. • Their HR department is practically non-existent, and most normal channels that you'd expect to easily be able to access (Payroll Dept, Quality Assurance) are disjointed, and spread throughout. I suspect this evasiveness may be intended. • You will NOT receive a meaningful raise. Should you manage to be promoted, it may take an eternity to receive your compensation. Red tape seems to be woven into the very fabric of HCL. Advice to Management Simplify your processes. Pay your employees better. Consider making opportunities for growth *also* available to your American-born employees.", "rating": 3, "pros": "Great benefits package. Great team-members. Casual atmosphere.", "cons": "Your experience will vary depending upon the project you're assigned to. HCL is a large company, so it is incredibly easy to feel like you're just a number.", "advice": "Simplify your processes. Pay your employees better. Consider making opportunities for growth *also* available to your American-born employees."}, {"title": "company", "text": "Pros Job security may be comparatively high. Cons No bond between company and management. Employee has to drive all his basic needs like documents, Visa extensions and everything that he need from company. Advice to Management Appreciate hardworking employees and dont ignore just because they stay longer in your organization.", "rating": 3, "pros": "Job security may be comparatively high.", "cons": "No bond between company and management. Employee has to drive all his basic needs like documents, Visa extensions and everything that he need from company.", "advice": "Appreciate hardworking employees and dont ignore just because they stay longer in your organization."}, {"title": "Technical Architect", "text": "Pros HCL has good client especially if you in ERS department , work life balance is gud , you get to learn and implement latest technologies. Some folks in Senior Management are good , but due to Company Policies can't do much. Cons Salary Less , esp. in Bay Area survival is not enough esp when you have clients like google, cisco and citrix , they shud pay more to employees. Advice to Management Pay attention to Employees problems", "rating": 3, "pros": "HCL has good client especially if you in ERS department , work life balance is gud , you get to learn and implement latest technologies. Some folks in Senior Management are good , but due to Company Policies can't do much.", "cons": "Salary Less , esp. in Bay Area survival is not enough esp when you have clients like google, cisco and citrix , they shud pay more to employees.", "advice": "Pay attention to Employees problems"}, {"title": "Very good", "text": "Pros stable. take care of employee Cons less project, but work wise very good", "rating": 5, "pros": "stable. take care of employee", "cons": "less project, but work wise very good", "advice": null}, {"title": "Good First IT Job", "text": "Pros Match 6% 401k, healthcare, will definitely increase your technical expertise if you are a newbie. Great place for women to be hired into the IT field. When a contract terminated they try and move you to another contract t keep you employed. Cons Financial Compensation is poor. Contracts in US do not last many years. Advice to Management 10 cent raises in america just doesn't cut it. why don't you learn from all the other outsourcing companies, you get what you pay for. If you want to keep your employees pay them better. Stop being so cheap! have your managers more engaged in employee development, or actually have an employee development department that will improve what resources you have. Stop over working people. Stop under bidding contracts and adding more stress to your workforce.", "rating": 3, "pros": "Match 6% 401k, healthcare, will definitely increase your technical expertise if you are a newbie. Great place for women to be hired into the IT field. When a contract terminated they try and move you to another contract t keep you employed.", "cons": "Financial Compensation is poor. Contracts in US do not last many years.", "advice": "10 cent raises in america just doesn't cut it. why don't you learn from all the other outsourcing companies, you get what you pay for. If you want to keep your employees pay them better. Stop being so cheap!"}, {"title": "Great to work", "text": "Pros It’s good to work with Hcl organization , which has lot of clients and opportunities to explore our ideas. Cons It’s good if salary can be increased as per market standards.", "rating": 5, "pros": "It’s good to work with Hcl organization , which has lot of clients and opportunities to explore our ideas.", "cons": "It’s good if salary can be increased as per market standards.", "advice": null}, {"title": "excellent", "text": "Pros company provides work life balance. Cons company provides less wage rate as compared to other IT firms. Advice to Management senior management eats all the fruits", "rating": 5, "pros": "company provides work life balance.", "cons": "company provides less wage rate as compared to other IT firms.", "advice": "senior management eats all the fruits"}, {"title": "Tier II", "text": "Pros Good to get your foot into IT Cons they got this great thing here that they do, when you are really good at your job, they don't reward you with a pay raise, they reward you with the privilege to do other peoples jobs also! Advice to Management You got competition coming, better start paying your employees what they're worth", "rating": 3, "pros": "Good to get your foot into IT", "cons": "they got this great thing here that they do, when you are really good at your job, they don't reward you with a pay raise, they reward you with the privilege to do other peoples jobs also!", "advice": "You got competition coming, better start paying your employees what they're worth"}, {"title": "Senior Technical Lead", "text": "Pros Time flexibility . Get chance work all over the world. Huge offices all over India Cons Appraisal is too low. Own product development is not their Advice to Management Start working on your own products. Pro Activeness is the need of an hour", "rating": 5, "pros": "Time flexibility . Get chance work all over the world. Huge offices all over India", "cons": "Appraisal is too low. Own product development is not their", "advice": "Start working on your own products. Pro Activeness is the need of an hour"}, {"title": "Good Experience with HCL", "text": "Pros More effort & More reward Employer First and Customer Second Flexibility on office Timings Cons Some times too much of load Advice to Management Focus on process, Invest on training for resource on new technologies", "rating": 5, "pros": "More effort & More reward", "cons": "Some times too much of load", "advice": "Focus on process, Invest on training for resource on new technologies"}, {"title": "Software developer", "text": "Pros Good for entry level developer Cons I dont see any negatives", "rating": 5, "pros": "Good for entry level developer", "cons": "I dont see any negatives", "advice": null}, {"title": "Project Manager", "text": "Pros Good Company with good leadership in some accounts Cons not a pay master compared to market", "rating": 5, "pros": "Good Company with good leadership in some accounts", "cons": "not a pay master compared to market", "advice": null}, {"title": "Technical Analyst", "text": "Pros HCL provides good medical benefits Cons Doesn't develop talent , does not recognize accomplishment. Advice to Management Provide opportunities for growth.", "rating": 3, "pros": "HCL provides good medical benefits", "cons": "Doesn't develop talent , does not recognize accomplishment.", "advice": "Provide opportunities for growth."}, {"title": "Technical Architect", "text": "Pros Good environment for working on technologies. Cons Long working hours depends on for which client you are working.", "rating": 5, "pros": "Good environment for working on technologies.", "cons": "Long working hours depends on for which client you are working.", "advice": null}, {"title": "Deputy General Manager", "text": "Pros Stable work environment and several projects Cons Huge enterprise and you can lost in the midst of other employees", "rating": 5, "pros": "Stable work environment and several projects", "cons": "Huge enterprise and you can lost in the midst of other employees", "advice": null}, {"title": "Run as fast as you can", "text": "Pros Quick payment of death benefits to family. Cons Get everything in writing. Lies abound freely. Advice to Management Employee first should be more than lip service.", "rating": 1, "pros": "Quick payment of death benefits to family.", "cons": "Get everything in writing. Lies abound freely.", "advice": "Employee first should be more than lip service."}, {"title": "Good", "text": "Pros Good team, Good work culture, ethics Cons No cons as far my opinion", "rating": 5, "pros": "Good team, Good work culture, ethics", "cons": "No cons as far my opinion", "advice": null}, {"title": "SAP ABAP / PI", "text": "Pros It will very good place to work. Excellent environment, Benefits & good management . Learned a lot of things from this company. Cons Make you promised and don't keep them. Advice to Management Nothing.", "rating": 5, "pros": "It will very good place to work. Excellent environment, Benefits & good management . Learned a lot of things from this company.", "cons": "Make you promised and don't keep them.", "advice": "Nothing."}, {"title": "Not very good place to work", "text": "Pros Culture and values are good to be considered. Cons With the salary they provide, Can't manage to live with family in bay area.", "rating": 3, "pros": "Culture and values are good to be considered.", "cons": "With the salary they provide, Can't manage to live with family in bay area.", "advice": null}, {"title": "GOOD", "text": "Pros great place to work lot of new opportunity Cons Salary is low..... onsite opportunity is less", "rating": 5, "pros": "great place to work", "cons": "Salary is low.....", "advice": null}, {"title": "Best place to work.", "text": "Pros Salary is comparatively less than market Cons Can balance work and life", "rating": 5, "pros": "Salary is comparatively less than market", "cons": "Can balance work and life", "advice": null}, {"title": "Competitive company with little professional development", "text": "Pros Experienced colleagues, salary, and string of successful implementations. Cons Lack of professional development, HR North America is run by India with no authority.", "rating": 3, "pros": "Experienced colleagues, salary, and string of successful implementations.", "cons": "Lack of professional development, HR North America is run by India with no authority.", "advice": null}, {"title": "Incident Manager", "text": "Pros Good benefits, Work/Life balance Cons Lack of Upward mobility in department", "rating": 5, "pros": "Good benefits, Work/Life balance", "cons": "Lack of Upward mobility in department", "advice": null}, {"title": "Good company to work for", "text": "Pros Employee get flexible hours Work environment is good Processes are defined Employees get opportunities for career growth Training are provided to employees Cons There is no bench at onsite Advice to Management None at this time", "rating": 5, "pros": "Employee get flexible hours", "cons": "There is no bench at onsite", "advice": "None at this time"}, {"title": "Call centre technical support representative", "text": "Pros Training provided, good floor staff Cons Low salary, shift work required", "rating": 3, "pros": "Training provided, good floor staff", "cons": "Low salary, shift work required", "advice": null}, {"title": "Great Telecommuting Job", "text": "Pros Interesting projects; enjoyed working with another culture Cons Some downtime between projects with little to do", "rating": 5, "pros": "Interesting projects; enjoyed working with another culture", "cons": "Some downtime between projects with little to do", "advice": null}, {"title": "Disorganized", "text": "Pros Benefits and that is it Cons Disorganized. No one knows what's going on. Out of state/country management Advice to Management Be fair. Have onsite management run location not offsite. Actually live your values", "rating": 3, "pros": "Benefits and that is it", "cons": "Disorganized. No one knows what's going on. Out of state/country management", "advice": "Be fair. Have onsite management run location not offsite. Actually live your values"}, {"title": "You're on your own.", "text": "Pros Normal work hours and bi-weekly pay. Cons No support from management they focus on whatever the client wants. Advice to Management Support your own employees.", "rating": 1, "pros": "Normal work hours and bi-weekly pay.", "cons": "No support from management they focus on whatever the client wants.", "advice": "Support your own employees."}, {"title": "Need change in Job", "text": "Pros Good Technical info we get to work in Embedded Projects Cons Pay is very less We need to work more than 12 hours without proper Salary", "rating": 5, "pros": "Good Technical info we get to work in Embedded Projects", "cons": "Pay is very less", "advice": null}, {"title": "Good overall, but lack of cohesion between HCL co-workers", "text": "Pros I took it as an interim job. Then I kept getting interesting, challenging roles that I had to overcome. However, I had no contact with other HCL employees except for those I directly worked with. Cons Internal Human Resources at HCL is really bad. If you will need HR help on anything, forget it. Review system is a joke. Skills testing is worse than useless. You review the materials and the assessment is on another topic or actually has errors in the test itself. You get spammed within the internal MyHCL email system. It's so bad you end up deleting important mail trying to keep it clear. Advice to Management Stop the Spam! Fix the system that lets you update your skill set.", "rating": 5, "pros": "I took it as an interim job. Then I kept getting interesting, challenging roles that I had to overcome. However, I had no contact with other HCL employees except for those I directly worked with.", "cons": "Internal Human Resources at HCL is really bad. If you will need HR help on anything, forget it.", "advice": "Stop the Spam! Fix the system that lets you update your skill set."}, {"title": "Work experience", "text": "Pros Friendly and encouraging atmosphere. Good teams to work with. Cons Tight working schedules, though it is challenging and interesting.", "rating": 5, "pros": "Friendly and encouraging atmosphere. Good teams to work with.", "cons": "Tight working schedules, though it is challenging and interesting.", "advice": null}, {"title": "Avoid if you can", "text": "Pros HCL covered my moving expenses. Cons I was with HCL for a little under a year. Overall experience was extremely poor. I was working onsite with a client and felt like a number on my team. I interacted with my manager less than 5 times over the course of 10 months. He just didn't care to interact, share HCL values, or act like a manager. I moved across the country on a whim to start at the beginning of the month. From day 1 the manager shows up an hour late and tell me he doesn't have anything for me to do and to come back tomorrow. Same things happens for the next 4 days (he forgot to set up a meeting with the client to get me onboarded). Keep in mind he knew I was driving 40 miles one-way to get there. There is no real culture other than work your 40 hours and go home. There was never a day I felt excited to work for HCL. Everything was just disorganized & slow. I gave my manager a month's notice that I was interviewing elsewhere and thinking about leaving. I was told they would \"take legal action against me and I would get in trouble\" for leaving. I promptly left the next day and never looked back. If you have other options, take them. Advice to Management Show up on time on the first day. Don't threaten employees.", "rating": 1, "pros": "HCL covered my moving expenses.", "cons": "I was with HCL for a little under a year. Overall experience was extremely poor. I was working onsite with a client and felt like a number on my team.", "advice": "Show up on time on the first day. Don't threaten employees."}, {"title": "Very Good Company", "text": "Pros I have been working in this company for 11+ years and i am very much satisfied with the work culture.There are lots of projects going on and you will not be left out. Cons Not much of a high pay company. No much benefits. Advice to Management Please raise the salary that is equivalent to the Market value.Else employees will leave.", "rating": 5, "pros": "I have been working in this company for 11+ years and i am very much satisfied with the work culture.There are lots of projects going on and you will not be left out.", "cons": "Not much of a high pay company. No much benefits.", "advice": "Please raise the salary that is equivalent to the Market value.Else employees will leave."}, {"title": "Analyst", "text": "Pros Benefits and compensation is great Cons Management needs to listen to employees", "rating": 5, "pros": "Benefits and compensation is great", "cons": "Management needs to listen to employees", "advice": null}, {"title": "Sr. CSR", "text": "Pros Location at which I was working at was near my house. The only reason for me to have worked there Cons Sharing the downsides of working here is not gonna help much. Im pretty sure noone is gonna bother abt it. Advice to Management Continue the amazing work. Keep rocking. Have a blast.", "rating": 3, "pros": "Location at which I was working at was near my house. The only reason for me to have worked there", "cons": "Sharing the downsides of working here is not gonna help much. Im pretty sure noone is gonna bother abt it.", "advice": "Continue the amazing work. Keep rocking. Have a blast."}, {"title": "Traditional Working Strategies", "text": "Pros Standard Workflow and no chances of downfall during crisis. Cons No Room for new innovative ideas and thoughts Advice to Management Please listen to ideas instead of giving little time and corner the person.", "rating": 5, "pros": "Standard Workflow and no chances of downfall during crisis.", "cons": "No Room for new innovative ideas and thoughts", "advice": "Please listen to ideas instead of giving little time and corner the person."}, {"title": "Review", "text": "Pros Good working environment and colleagues Cons None at this point in time", "rating": 5, "pros": "Good working environment and colleagues", "cons": "None at this point in time", "advice": null}, {"title": "A perfect work life balance", "text": "Pros A company with Perfect work life balance. Cons Not a fast paced environment and the pay is less.", "rating": 5, "pros": "A company with Perfect work life balance.", "cons": "Not a fast paced environment and the pay is less.", "advice": null}, {"title": "Not Impressed", "text": "Pros I had been hunting for a job for a while and they offered me one Cons I was told I would be a software engineer for them but then they had me doing support engineer work. So, I got hired by someone else. Advice to Management Be more honest", "rating": 3, "pros": "I had been hunting for a job for a while and they offered me one", "cons": "I was told I would be a software engineer for them but then they had me doing support engineer work. So, I got hired by someone else.", "advice": "Be more honest"}, {"title": "Worst Place to work", "text": "Pros Good place to start your career. Cons no work life balance. They will load you with work.", "rating": 1, "pros": "Good place to start your career.", "cons": "no work life balance. They will load you with work.", "advice": null}, {"title": "Good", "text": "Pros They are giving better opportunities Cons They are giving better opportunities, but payment is very less Advice to Management Increase salaries", "rating": 5, "pros": "They are giving better opportunities", "cons": "They are giving better opportunities, but payment is very less", "advice": "Increase salaries"}, {"title": "HCL is a great place to work at.", "text": "Pros Great benefits and lots of learning opportunities. Cons Salaries are not as competitive when compared to the market.", "rating": 5, "pros": "Great benefits and lots of learning opportunities.", "cons": "Salaries are not as competitive when compared to the market.", "advice": null}, {"title": "Analyst", "text": "Pros Offer great opportunities to explore Cons Long working hours and Cab issues", "rating": 5, "pros": "Offer great opportunities to explore", "cons": "Long working hours and Cab issues", "advice": null}, {"title": "Good place to work", "text": "Pros Good place to work . Friendly management Cons Salary is compritively low to market", "rating": 5, "pros": "Good place to work . Friendly management", "cons": "Salary is compritively low to market", "advice": null}, {"title": "Not too good, not to bad.", "text": "Pros Their clients are world leaders and you get great exposure if you work at their client site. Projects are long. Cons Employees of HCL are bad at communication. Expect delays to emails and getting information from them is next to impossible no matter how urgent the issue is. Advice to Management Needimprovement in communication.", "rating": 3, "pros": "Their clients are world leaders and you get great exposure if you work at their client site. Projects are long.", "cons": "Employees of HCL are bad at communication. Expect delays to emails and getting information from them is next to impossible no matter how urgent the issue is.", "advice": "Needimprovement in communication."}, {"title": "Senior Analyst", "text": "Pros Pay is relatively pretty good Cons Very little communication with Employees", "rating": 5, "pros": "Pay is relatively pretty good", "cons": "Very little communication with Employees", "advice": null}, {"title": "Alright Starter job", "text": "Pros Good health insurance Usually can leave work at not worry about it Cons High Call volumne Short staffed Low pay Overtime is half pay not time and a half", "rating": 3, "pros": "Good health insurance", "cons": "High Call volumne", "advice": null}, {"title": "STAY FAR AWAY", "text": "Pros Basic benefits, but other than that... Cons Management is TERRIBLE, will not fire bad employees (Ex. doesn't show up for work, shows up but watches youtube the entire time and does nothing) but only move them to another project to be terrible there instead so that it doesn't look like there is high turnover. My team has been waiting for THREE MONTHS to get the overtime we worked (mandatory overtime work for an entire month, only one day off that whole month), management promised it would be last month but obviously it was not. Unrealistic expectations for the team, especially after not paying us. Made a lot of big promises like after 1 year they would help you find a better project or if you are interested in a different field they would help you... obviously they have not delivered there, either. NO CAREER GROWTH unless you are Indian and male. They don't care about their customers, they just want the numbers to look good even if they client is unhappy with the service because they have them roped in with a contract. Advice to Management Try to CARE about your employees and customers. Just because numerical data is quantifiable does not mean it is the only way to show progress. You guys talk a big game, but it means nothing if you don't follow through. Running good employees into the ground is an excellent way to lose good employees.", "rating": 1, "pros": "Basic benefits, but other than that...", "cons": "Management is TERRIBLE, will not fire bad employees (Ex. doesn't show up for work, shows up but watches youtube the entire time and does nothing) but only move them to another project to be terrible there instead so that it doesn't look like there is high turnover. My team has been waiting for THREE MONTHS to get the overtime we worked (mandatory overtime work for an entire month, only one day off that whole month), management promised it would be last month but obviously it was not. Unrealistic expectations for the team, especially after not paying us. Made a lot of big promises like after 1 year they would help you find a better project or if you are interested in a different field they would help you... obviously they have not delivered there, either. NO CAREER GROWTH unless you are Indian and male. They don't care about their customers, they just want the numbers to look good even if they client is unhappy with the service because they have them roped in with a contract.", "advice": "Try to CARE about your employees and customers. Just because numerical data is quantifiable does not mean it is the only way to show progress. You guys talk a big game, but it means nothing if you don't follow through. Running good employees into the ground is an excellent way to lose good employees."}, {"title": "Pays Peanuts", "text": "Pros Trying to find some good things about the company. Not able to. Cons Pays Peanuts, Needs to improve lot in Management, Marketing if it serious about competing with Accenture, Deloitte", "rating": 1, "pros": "Trying to find some good things about the company. Not able to.", "cons": "Pays Peanuts, Needs to improve lot in Management, Marketing if it serious about competing with Accenture, Deloitte", "advice": null}, {"title": "Worst place for a fresher", "text": "Pros No pressure on dress code or timings Cons This company will never care about Employee's career , all they need is their work to be completed. They treat employees like slaves Advice to Management This is a shoutout to the HRs as well. Please do not play with the employees' career. Its after all the client's satisfaction is needed for u, but for an employee his/her career depends on how and what she learns here. Please do not spoil employees career to take the credits from the client into ur account. Writing this with so much pain.", "rating": 3, "pros": "No pressure on dress code or timings", "cons": "This company will never care about Employee's career , all they need is their work to be completed. They treat employees like slaves", "advice": "This is a shoutout to the HRs as well. Please do not play with the employees' career. Its after all the client's satisfaction is needed for u, but for an employee his/her career depends on how and what she learns here. Please do not spoil employees career to take the credits from the client into ur account. Writing this with so much pain."}, {"title": "HCL treats their non-indian counterparts like crap", "text": "Pros I get a paycheck and decent benefits Cons There are good people on the vendor side, but all the HCL of Indian decent stick together and do not let me into the club. The HCL manager never reaches out to me unless my timesheet is late. All HCL cares about is getting a check. Advice to Management Change your culture", "rating": 1, "pros": "I get a paycheck and decent benefits", "cons": "There are good people on the vendor side, but all the HCL of Indian decent stick together and do not let me into the club. The HCL manager never reaches out to me unless my timesheet is late. All HCL cares about is getting a check.", "advice": "Change your culture"}, {"title": "Good job for entry level help desk positions", "text": "Pros Health benefits are pretty good Cons Pay doesn't not compensate workload", "rating": 3, "pros": "Health benefits are pretty good", "cons": "Pay doesn't not compensate workload", "advice": null}, {"title": "Overview", "text": "Pros Good learning environment, infrastructure and growth Cons Low Compensation, Frequently changing management", "rating": 5, "pros": "Good learning environment, infrastructure and growth", "cons": "Low Compensation, Frequently changing management", "advice": null}, {"title": "A Great Place to work", "text": "Pros 1. Freedom to chart your own path 2. Ability to move across roles 3. Opportunities to work across the globe Cons 1. Limited processes so relationships become key 2. More of an individual performer culture", "rating": 5, "pros": "1. Freedom to chart your own path 2. Ability to move across roles 3. Opportunities to work across the globe", "cons": "1. Limited processes so relationships become key 2. More of an individual performer culture", "advice": null}, {"title": "Poor Onboarding, No Communication, no one takes responsibility", "text": "Pros On Boarding is done online and electronically. Allowed to update multiple accounts for direct deposit. I was told by HCL recruiter pay was bi-weekly. Cons On Boarding is repeated on first day so everything you did prior does not matter. When your on board you re enter your direct deposit and only one account is allowed for pay distribution. Must wait 4 to 5 weeks for first pay. Pay is bi-monthly (15th and end of month). After 4 weeks I still have not been paid. Advice to Management Get your head in the game. Your co-workers and team members are on the side of the client. Help them do their job.", "rating": 1, "pros": "On Boarding is done online and electronically.", "cons": "On Boarding is repeated on first day so everything you did prior does not matter.", "advice": "Get your head in the game. Your co-workers and team members are on the side of the client. Help them do their job."}, {"title": "Great Opportunity", "text": "Pros I love my on site role through HCL. I've learned so much, love my colleagues and love that I can be left to do my work without any micromanagement. Cons Slightly disorganized during the on boarding process, but suspect this was due to the use of a 3rd party recruiting company. Advice to Management Give raises in line with inflation. Currently, I am not on track to make more than a 1% raise even with exceeding goals and expectations.", "rating": 5, "pros": "I love my on site role through HCL. I've learned so much, love my colleagues and love that I can be left to do my work without any micromanagement.", "cons": "Slightly disorganized during the on boarding process, but suspect this was due to the use of a 3rd party recruiting company.", "advice": "Give raises in line with inflation. Currently, I am not on track to make more than a 1% raise even with exceeding goals and expectations."}, {"title": "Devops Lead", "text": "Pros good company to work and employee benefits are good Cons i didnt feel any cons about hcl", "rating": 5, "pros": "good company to work and employee benefits are good", "cons": "i didnt feel any cons about hcl", "advice": null}, {"title": "I am working for HCL for 3 years", "text": "Pros Working environment is good, have job security here. Cons Salary hike is not up to the mark, mostly no work from home.", "rating": 3, "pros": "Working environment is good, have job security here.", "cons": "Salary hike is not up to the mark, mostly no work from home.", "advice": null}, {"title": "System Analysts", "text": "Pros A very good company to work for Cons Managers should be more supervised Advice to Management Managers should care more about employee acomomodations/", "rating": 5, "pros": "A very good company to work for", "cons": "Managers should be more supervised", "advice": "Managers should care more about employee acomomodations/"}, {"title": "Reasonable Company", "text": "Pros Wider scope of responsibilities that are not accessible in other companies Cons Salary not very good. No perks. Overall compensation very poor. Advice to Management None", "rating": 3, "pros": "Wider scope of responsibilities that are not accessible in other companies", "cons": "Salary not very good. No perks. Overall compensation very poor.", "advice": "None"}, {"title": "Breeding a political ecosystem", "text": "Pros The brand name is all that is left! Cons Bad Review system Zero appreciation Pathetic Management Nepotism Self obsessed leaders! Advice to Management Good luck to you in losing more accounts with your pathetic leadership skills!", "rating": 1, "pros": "The brand name is all that is left!", "cons": "Bad Review system", "advice": "Good luck to you in losing more accounts with your pathetic leadership skills!"}, {"title": "Good company, low pay", "text": "Pros Great contract work at Google, many of the Google benefits like free meals. Cons HCL salary is lackluster. Teams are the backbone of the specific Google deparment, but get paid less than half what Googlers make. Google class system. Almost no room for growth. Advice to Management Needs improvement.", "rating": 5, "pros": "Great contract work at Google, many of the Google benefits like free meals.", "cons": "HCL salary is lackluster. Teams are the backbone of the specific Google deparment, but get paid less than half what Googlers make. Google class system. Almost no room for growth.", "advice": "Needs improvement."}, {"title": "Employment Review", "text": "Pros Good consulting environment and stable work life balance. Roles and responsibilities are distinct and adds value to career. Having scope of progression. Cons Salary should be better and should be more training programs for the upcoming technologies.", "rating": 3, "pros": "Good consulting environment and stable work life balance.", "cons": "Salary should be better and should be more training programs for the upcoming technologies.", "advice": null}, {"title": "Good company to work", "text": "Pros Good employer. Good Insurance. Decent salary. Cons Less paid vacation. Growth depends on reporting manager", "rating": 3, "pros": "Good employer. Good Insurance. Decent salary.", "cons": "Less paid vacation. Growth depends on reporting manager", "advice": null}, {"title": "About HCL", "text": "Pros Good Indian service based Company. Pay or work culture wise, better than other top indian service based companies like TCS, infosys and Wipro. Cons There is not much process in place comparatively other Indian service based companies and one way this is good. It all depends on how you take, it could be Pro or Con :). Advice to Management I working in one of the telecom Client and HCL management is pretty good and i liked them", "rating": 5, "pros": "Good Indian service based Company. Pay or work culture wise, better than other top indian service based companies like TCS, infosys and Wipro.", "cons": "There is not much process in place comparatively other Indian service based companies and one way this is good. It all depends on how you take, it could be Pro or Con :).", "advice": "I working in one of the telecom Client and HCL management is pretty good and i liked them"}, {"title": "Employment at hcl", "text": "Pros Great benefits , Time offs and work Cons Lack of formal induction process Advice to Management Formal induction after hiring Roles and Responsibility on assignments", "rating": 5, "pros": "Great benefits , Time offs and work", "cons": "Lack of formal induction process", "advice": "Formal induction after hiring"}, {"title": "Review for HCL America", "text": "Pros The benefits were awesome. Cons Micro management drove the most experienced employees to resign.", "rating": 1, "pros": "The benefits were awesome.", "cons": "Micro management drove the most experienced employees to resign.", "advice": null}, {"title": "software developer", "text": "Pros there is nothing to consider as Pros Cons does not provide good compensation Advice to Management need to treat employee with respect.", "rating": 3, "pros": "there is nothing to consider as Pros", "cons": "does not provide good compensation", "advice": "need to treat employee with respect."}, {"title": "Good Place to Work", "text": "Pros The Benefits are very nice Cons The career plan is very poor", "rating": 5, "pros": "The Benefits are very nice", "cons": "The career plan is very poor", "advice": null}, {"title": "OK work but don't expect support or good pay", "text": "Pros The benefits are good and the rates aren't bad for full family coverage Cons Pay under industry average, no support between engagements, constant additional internal duties as an HCL employee, all about the money Advice to Management Your one and only focus is revenue. If you focused on your people more (at least on your North American division), payed them a better wage, and cut back on the internal HCL programs they a required to focus on, you would have happier, more engaged employees with a lower turnover rate. Your revenues would get much better.", "rating": 3, "pros": "The benefits are good and the rates aren't bad for full family coverage", "cons": "Pay under industry average, no support between engagements, constant additional internal duties as an HCL employee, all about the money", "advice": "Your one and only focus is revenue. If you focused on your people more (at least on your North American division), payed them a better wage, and cut back on the internal HCL programs they a required to focus on, you would have happier, more engaged employees with a lower turnover rate. Your revenues would get much better."}, {"title": "It was a great experience", "text": "Pros Learnt a lot .Helped me understand the value of team work and how to work efficiently. Cons Lots of trainings was the only concern . Advice to Management They are good. No advice .", "rating": 5, "pros": "Learnt a lot .Helped me understand the value of team work and how to work efficiently.", "cons": "Lots of trainings was the only concern .", "advice": "They are good. No advice ."}, {"title": "java developer", "text": "Pros good team friendly management good salary Cons no proper communication. no feedback or status on the interview", "rating": 5, "pros": "good team", "cons": "no proper communication.", "advice": null}, {"title": "Sr UX Designer", "text": "Pros - Supportive internal design team, great Creative Director and UX Design Manager - Great health benefits and 401k matching program - Excellent engineers, onshore and offshore teams were great to work with Cons - Confusing UI on internal websites can be frustrating till you learn the system - Rough on boarding experience and no exit interview - Full time position ended abruptly due to lack of sales in design areas - Extremely complex bureaucracy and complicated corporate culture Advice to Management - Conduct user testing on your website and consider a complete overhaul of existing system - Give exiting employees the opportunity to offer feedback", "rating": 3, "pros": "- Supportive internal design team, great Creative Director and UX Design Manager", "cons": "- Confusing UI on internal websites can be frustrating till you learn the system", "advice": "- Conduct user testing on your website and consider a complete overhaul of existing system"}, {"title": "Software Engineer", "text": "Pros great health benefit, flexible work time Cons low salary, no monitor", "rating": 3, "pros": "great health benefit, flexible work time", "cons": "low salary, no monitor", "advice": null}, {"title": "Great Company to be a Network Engineer", "text": "Pros They have really good projects with different clients all over USA. Good for people who are entering in Networking Cons Some projects are not that great depending on the client. Advice to Management Need to get more projects in Infra in the future", "rating": 5, "pros": "They have really good projects with different clients all over USA.", "cons": "Some projects are not that great depending on the client.", "advice": "Need to get more projects in Infra in the future"}, {"title": "Keep your options close...", "text": "Pros Tons of work to do so you stay busy and there are some good people to work with. Cons Not impressed with their ideas of \"technology\". You're busy fixing things that are broken. System limitations, red tape, poor communication, narrow mindsets and general disappointment at all levels. Advice to Management Hire people who know what they're doing and let them do their job. Put money into improving systems instead of always looking for the shortcut and saving money.", "rating": 1, "pros": "Tons of work to do so you stay busy and there are some good people to work with.", "cons": "Not impressed with their ideas of \"technology\". You're busy fixing things that are broken. System limitations, red tape, poor communication, narrow mindsets and general disappointment at all levels.", "advice": "Hire people who know what they're doing and let them do their job. Put money into improving systems instead of always looking for the shortcut and saving money."}, {"title": "Solutions Architect", "text": "Pros Lots of Clients to work with Cons Poor Salaries, Poor Management (Client and Program), No Innovation Advice to Management Focus on the talent company has and invest into the workforce to upgrade and keep them in.", "rating": 5, "pros": "Lots of Clients to work with", "cons": "Poor Salaries, Poor Management (Client and Program), No Innovation", "advice": "Focus on the talent company has and invest into the workforce to upgrade and keep them in."}, {"title": "Enter at your own risk", "text": "Pros A job if you need one to meet your financial responsibilities. Otherwise \"Enter at your own risk\" Cons I became an employee of HCL when they took over the IT operations of the company I worked for, due to the company Outsourcing the entire IT department to HCL. I had to train my replacement but I was one of the few lucky ones who was offered an opportunity to remain with HCL. I stayed with them for a little over a year, but left because management was all over the place. There were too many managers and not enough people to actually perform the work. Also if you were not Indian or of Indian decent you were treated like a second class citizen and many times not even included in your own departmen's meetings. the non-Indian employees used to refer to the company as HCHell instead of HCL... that tells a lot... Advice to Management Management needs to be more responsive. I know they are based in India but responsiveness needs to improve. They also need to properly determine the undertaking of projects so that they can provide adequate levels of staff and support.", "rating": 1, "pros": "A job if you need one to meet your financial responsibilities. Otherwise \"Enter at your own risk\"", "cons": "I became an employee of HCL when they took over the IT operations of the company I worked for, due to the company Outsourcing the entire IT department to HCL. I had to train my replacement but I was one of the few lucky ones who was offered an opportunity to remain with HCL. I stayed with them for a little over a year, but left because management was all over the place. There were too many managers and not enough people to actually perform the work. Also if you were not Indian or of Indian decent you were treated like a second class citizen and many times not even included in your own departmen's meetings. the non-Indian employees used to refer to the company as HCHell instead of HCL... that tells a lot...", "advice": "Management needs to be more responsive. I know they are based in India but responsiveness needs to improve. They also need to properly determine the undertaking of projects so that they can provide adequate levels of staff and support."}, {"title": "For purposes of Transperancy", "text": "Pros Creative Freedom in Vision Implementation Cons Not Enough hours in the day Advice to Management none", "rating": 3, "pros": "Creative Freedom in Vision Implementation", "cons": "Not Enough hours in the day", "advice": "none"}, {"title": "Was great place to work, but not anymore", "text": "Pros Provides very good Insurance plans for less cost Cons 1. No recognition unless you are aligned with your manager even if you are excellent at your work 2. No salary hike for past 3 years 3. Too much politics 4. Focuses only on profit margin and does not care about retaining talents Advice to Management Need a high level shake up to change the way employees are treated as an expense quotient", "rating": 3, "pros": "Provides very good Insurance plans for less cost", "cons": "1. No recognition unless you are aligned with your manager even if you are excellent at your work", "advice": "Need a high level shake up to change the way employees are treated as an expense quotient"}, {"title": "Good to start", "text": "Pros Easy to get into company, low expectation of skill t ostart Cons Promotions and raises are extremely hard to come by, doesn't feel like the company Advice to Management Learn to value your employees before they're gone", "rating": 1, "pros": "Easy to get into company, low expectation of skill t ostart", "cons": "Promotions and raises are extremely hard to come by, doesn't feel like the company", "advice": "Learn to value your employees before they're gone"}, {"title": "software developer", "text": "Pros good company to start with Cons none, not available, none, none Advice to Management nothing,", "rating": 5, "pros": "good company to start with", "cons": "none, not available, none, none", "advice": "nothing,"}, {"title": "Worst Management", "text": "Pros good medical and insurance benefits. 401K plan available. Cons They will hire employee as a full time role and after project completions they will fire immediately. After laid off within next 30 days I saw many requirement on job portal from same company, then what is use of zero bench policy. Low pay so negotiate before join. Worst management. Advice to Management If you want to run your business in USA, then start working with contract peoples, don't screw employee's carrier.", "rating": 1, "pros": "good medical and insurance benefits. 401K plan available.", "cons": "They will hire employee as a full time role and after project completions they will fire immediately. After laid off within next 30 days I saw many requirement on job portal from same company, then what is use of zero bench policy.", "advice": "If you want to run your business in USA, then start working with contract peoples, don't screw employee's carrier."}, {"title": "Working for HCL", "text": "Pros Great benefits, Great people to work with, a real just show up and keep your job. Cons Management cannot maintain a schedule, HR cases get poorly handled, overtime is 1/2 pay and not time and a 1/2. They hold a promotion over your head and make you do the work for promises they do not keep. Advice to Management Treat service desk as a service desk and not like a call center.", "rating": 3, "pros": "Great benefits, Great people to work with, a real just show up and keep your job.", "cons": "Management cannot maintain a schedule, HR cases get poorly handled, overtime is 1/2 pay and not time and a 1/2. They hold a promotion over your head and make you do the work for promises they do not keep.", "advice": "Treat service desk as a service desk and not like a call center."}, {"title": "it analyst", "text": "Pros easy job, no stress, easy to handle Cons lack of motivation, no future", "rating": 3, "pros": "easy job, no stress, easy to handle", "cons": "lack of motivation, no future", "advice": null}, {"title": "Good for experience but not to work for", "text": "Pros Such a broad range of experience you will pick up on. Great! Depends on the contract though. Cons You cannot advance, they only really promote Indians it seems. They gave us a .09 cent raise and said it is industry standard. Advice to Management Promote some Americans and don't say .09 cents is industry standard raise.", "rating": 3, "pros": "Such a broad range of experience you will pick up on. Great! Depends on the contract though.", "cons": "You cannot advance, they only really promote Indians it seems. They gave us a .09 cent raise and said it is industry standard.", "advice": "Promote some Americans and don't say .09 cents is industry standard raise."}, {"title": "help desk", "text": "Pros Being able to help end users Cons No cons with this employer", "rating": 5, "pros": "Being able to help end users", "cons": "No cons with this employer", "advice": null}, {"title": "Great company to work for", "text": "Pros I liked working for them. Pretty laid back and understanding of life/work balance. They treated me well. I think they get a bad rep for being an Indian based company but their managers are very down to earth and willing to work with you to advance your career. Cons Too much spam from the company regarding things irrelevant to the job Advice to Management Internal website is a disaster. Hard to find simple things and everything has a acronym without any explanation for what to do.", "rating": 5, "pros": "I liked working for them. Pretty laid back and understanding of life/work balance. They treated me well. I think they get a bad rep for being an Indian based company but their managers are very down to earth and willing to work with you to advance your career.", "cons": "Too much spam from the company regarding things irrelevant to the job", "advice": "Internal website is a disaster. Hard to find simple things and everything has a acronym without any explanation for what to do."}, {"title": "Technical Lead", "text": "Pros Work Life Balance is good Cons Compensation is not very good Advice to Management Increase the compensation for senior developers", "rating": 3, "pros": "Work Life Balance is good", "cons": "Compensation is not very good", "advice": "Increase the compensation for senior developers"}, {"title": "Review on my current employer", "text": "Pros Supportive, Always try to bring new things/system in work space. Cons Lack of opportunities and HR Responses. Advice to Management Need to be more responsive to employees in free pools or getting in to free pool. Positive or negative , One should response to employee mail on the opportunity.", "rating": 5, "pros": "Supportive, Always try to bring new things/system in work space.", "cons": "Lack of opportunities and HR Responses.", "advice": "Need to be more responsive to employees in free pools or getting in to free pool. Positive or negative , One should response to employee mail on the opportunity."}, {"title": "HCL can provide you with employment when no other options immediately available", "text": "Pros Good Health Insurance. There is a possibility to transfer to other locations. Cons NO raises. Job is only as good as your manager. Only 2 weeks vacation. Advice to Management Provide more training and at least a 2-3% cost-of-living salary increase.", "rating": 3, "pros": "Good Health Insurance. There is a possibility to transfer to other locations.", "cons": "NO raises. Job is only as good as your manager. Only 2 weeks vacation.", "advice": "Provide more training and at least a 2-3% cost-of-living salary increase."}, {"title": "Technical Lead", "text": "Pros Nothing as such. No benefits. No decent client. Cons They don't value talent. HR is disgrace.", "rating": 3, "pros": "Nothing as such. No benefits. No decent client.", "cons": "They don't value talent.", "advice": null}, {"title": "Cyber Security Risk- Incident Response and Investigations", "text": "Pros You have a lot of flexibility with your role. Cons There isn't any cons I can think of.", "rating": 5, "pros": "You have a lot of flexibility with your role.", "cons": "There isn't any cons I can think of.", "advice": null}, {"title": "Normal work envionment", "text": "Pros HCL provides good medical plans Cons there are no medical leaves Advice to Management there should be medical leaves", "rating": 5, "pros": "HCL provides good medical plans", "cons": "there are no medical leaves", "advice": "there should be medical leaves"}, {"title": "Company review", "text": "Pros Good Medical benefits, Managers are cooperative Cons Low salary, works gets too hectic, low increments. Advice to Management Pay veteran employees at par with new joiners.", "rating": 3, "pros": "Good Medical benefits, Managers are cooperative", "cons": "Low salary, works gets too hectic, low increments.", "advice": "Pay veteran employees at par with new joiners."}, {"title": "Process Manager", "text": "Pros Flexibility to work from home Cons Company is too large and getting something done takes way to long. Too many levels of approvals. Make poor financial decisions. Advice to Management Work with current staff and be transparent with decisions.", "rating": 1, "pros": "Flexibility to work from home", "cons": "Company is too large and getting something done takes way to long. Too many levels of approvals. Make poor financial decisions.", "advice": "Work with current staff and be transparent with decisions."}, {"title": "Job Security", "text": "Pros Job Security if you do things right, handle only one account at a time, decent benefits and pay. The new CEO C.Vijaya Kumar. Cons Typical management layer, no sick days, only 10 vacation days per year, minimum salary raise for even the top most performers. Promotions go to the folks who are close to their managers Advice to Management You do not have to bring in managers always from offshore. Company's slogan \"Employees First\" should be taken seriously for at least once !!! I hope the new CEO will bring in the necessary changes.", "rating": 5, "pros": "Job Security if you do things right, handle only one account at a time, decent benefits and pay. The new CEO C.Vijaya Kumar.", "cons": "Typical management layer, no sick days, only 10 vacation days per year, minimum salary raise for even the top most performers. Promotions go to the folks who are close to their managers", "advice": "You do not have to bring in managers always from offshore. Company's slogan \"Employees First\" should be taken seriously for at least once !!! I hope the new CEO will bring in the necessary changes."}, {"title": "Group Manager", "text": "Pros Always good to work with HCL and they take care for their employees, flexible in all situations for employee. Cons so many internal processes and need to focus for clients", "rating": 5, "pros": "Always good to work with HCL and they take care for their employees, flexible in all situations for employee.", "cons": "so many internal processes and need to focus for clients", "advice": null}, {"title": "Senior Analyst", "text": "Pros Very good teams to work with Cons nothing specific that I can think of Advice to Management continue the good work", "rating": 5, "pros": "Very good teams to work with", "cons": "nothing specific that I can think of", "advice": "continue the good work"}, {"title": "Managed Well,", "text": "Pros When inquiring some personal related issues to the organization, get it be taken care seriously and response is fast Cons Salary is low compared to the other similar level position, the company seems trying to get the most profit out of each employee.", "rating": 5, "pros": "When inquiring some personal related issues to the organization, get it be taken care seriously and response is fast", "cons": "Salary is low compared to the other similar level position, the company seems trying to get the most profit out of each employee.", "advice": null}, {"title": "Good company to work with", "text": "Pros Very good work culture.I am working for the past 12 years Cons no specific i would think of.", "rating": 5, "pros": "Very good work culture.I am working for the past 12 years", "cons": "no specific i would think of.", "advice": null}, {"title": "Good to start your career but not a pay master", "text": "Pros Job security, Good benefits, Free environment Cons Not a pay master, internal politics in higher management", "rating": 3, "pros": "Job security, Good benefits, Free environment", "cons": "Not a pay master, internal politics in higher management", "advice": null}, {"title": "review", "text": "Pros Got a lot to learn Cons Company doesn't take care of the employee.", "rating": 3, "pros": "Got a lot to learn", "cons": "Company doesn't take care of the employee.", "advice": null}, {"title": "Experience with HCL", "text": "Pros Good company to start a career and for onsite opportunities Cons Not good to grow skills as projects are short terms and irrespective of the persons skill set try to involve him to execute the project. Limited learning scope. Advice to Management Please not just think about the business and pay attention to overall growth of an employee which is eventually a asset of organisation.", "rating": 5, "pros": "Good company to start a career and for onsite opportunities", "cons": "Not good to grow skills as projects are short terms and irrespective of the persons skill set try to involve him to execute the project. Limited learning scope.", "advice": "Please not just think about the business and pay attention to overall growth of an employee which is eventually a asset of organisation."}, {"title": "Project Manager", "text": "Pros Very good supportive system given. Cons Too Many managers to report Advice to Management Combining salary with bonus is not a good way of giving perks.", "rating": 5, "pros": "Very good supportive system given.", "cons": "Too Many managers to report", "advice": "Combining salary with bonus is not a good way of giving perks."}, {"title": "Terrible Management", "text": "Pros Offered payed time off, affordable benefits, and there were a lot of company offered programs, discounts, loans, and such. Cons Expect nothing from upper management. They are in it only for their bonuses. Advice to Management Take a class or 2 on business and management at one our great local colleges.", "rating": 3, "pros": "Offered payed time off, affordable benefits, and there were a lot of company offered programs, discounts, loans, and such.", "cons": "Expect nothing from upper management. They are in it only for their bonuses.", "advice": "Take a class or 2 on business and management at one our great local colleges."}, {"title": "No future in this company", "text": "Pros Better than average salary compared to other offshore companies. Benefits are OK even though every year benefits are getting cut here and there. You can meet bright people here as well Cons HCL looks at employee as a commodity - W2 contractor with benefits, nothing more. No training. They just put you on any project so that you are billable. If you are not on the project there is no bench time - they call you and let you go immediately or force you to take unpaid leave. It is likely illegal to ask full time employee to take an unpaid leave. But since many employees are on H1B they have to be quiet and compliant. During Christmas time they force you to take vacation. They win projects by price dumping and using majority of offshore resources but quality of many consultants are really bad. Customers who thought they saved money are getting poorly implemented projects. As a result some SAP implementations end up in a disaster - recent $100 million Miller Coors lawsuit against HCL is an example. It adds to HCL poor reputation. Advice to Management HCL has a good slogan \"Employees first\" but it is not working in real life. In fact, employee is a \"last thing\" at HCL. Take care of your employees, invest in them and you will be rewarded.", "rating": 1, "pros": "Better than average salary compared to other offshore companies. Benefits are OK even though every year benefits are getting cut here and there. You can meet bright people here as well", "cons": "HCL looks at employee as a commodity - W2 contractor with benefits, nothing more. No training. They just put you on any project so that you are billable. If you are not on the project there is no bench time - they call you and let you go immediately or force you to take unpaid leave. It is likely illegal to ask full time employee to take an unpaid leave. But since many employees are on H1B they have to be quiet and compliant. During Christmas time they force you to take vacation. They win projects by price dumping and using majority of offshore resources but quality of many consultants are really bad. Customers who thought they saved money are getting poorly implemented projects. As a result some SAP implementations end up in a disaster - recent $100 million Miller Coors lawsuit against HCL is an example. It adds to HCL poor reputation.", "advice": "HCL has a good slogan \"Employees first\" but it is not working in real life. In fact, employee is a \"last thing\" at HCL. Take care of your employees, invest in them and you will be rewarded."}, {"title": "Engineer", "text": "Pros Opportunity to (albeit on contract) at some great companies Cons Incompetent, irresponsible and inept management", "rating": 1, "pros": "Opportunity to (albeit on contract) at some great companies", "cons": "Incompetent, irresponsible and inept management", "advice": null}, {"title": "Technical Program Manager", "text": "Pros Great Place to work and explore Cons No growth as such and cannot reveal more than this on a public forum Advice to Management Can still help employees to grow", "rating": 5, "pros": "Great Place to work and explore", "cons": "No growth as such and cannot reveal more than this on a public forum", "advice": "Can still help employees to grow"}, {"title": "Okay company, could use improvement on Work/Life Balance", "text": "Pros As long as you do your required work and meet your deadlines, you will have no problems here. Leadership opportunities are available if you show that you have what it takes. Company works in developing a good relationship with their clients, but this may depend on the customer and manager you work for. Cons No more than 2 weeks vacation and 2 floating holidays is ever given. No sick days. Employee web site is very fragmented, leading to lots of confusion in finding HR information, or in performing online training. If you request leave without pay you may forfeit bonuses. Raises are small. Advice to Management Increase benefits by providing higher 401k matching. Increase vacation to 3 weeks after 5 years employment, 4 weeks for 10 years to match up with company standards. Provide for some six leave.", "rating": 3, "pros": "As long as you do your required work and meet your deadlines, you will have no problems here. Leadership opportunities are available if you show that you have what it takes. Company works in developing a good relationship with their clients, but this may depend on the customer and manager you work for.", "cons": "No more than 2 weeks vacation and 2 floating holidays is ever given. No sick days. Employee web site is very fragmented, leading to lots of confusion in finding HR information, or in performing online training. If you request leave without pay you may forfeit bonuses. Raises are small.", "advice": "Increase benefits by providing higher 401k matching. Increase vacation to 3 weeks after 5 years employment, 4 weeks for 10 years to match up with company standards. Provide for some six leave."}, {"title": "Program Manager", "text": "Pros Good working environment, full support from management and many projects in USA Cons Sometime work life balance is challenge", "rating": 5, "pros": "Good working environment, full support from management and many projects in USA", "cons": "Sometime work life balance is challenge", "advice": null}, {"title": "Technician", "text": "Pros easy onboarding and decent benefits Cons Disorganized, not forthcoming with information, will outsource your job.", "rating": 3, "pros": "easy onboarding and decent benefits", "cons": "Disorganized, not forthcoming with information, will outsource your job.", "advice": null}, {"title": "Excellent place", "text": "Pros Excellent place to work for women. Cons Not much public transportation to this office.", "rating": 5, "pros": "Excellent place to work for women.", "cons": "Not much public transportation to this office.", "advice": null}, {"title": "Poor Appraisal model and Lack of Transparency", "text": "Pros Flexible work timings and culture Cons Poor Appraisal model and Lack of Transparency", "rating": 3, "pros": "Flexible work timings and culture", "cons": "Poor Appraisal model and Lack of Transparency", "advice": null}, {"title": "working on Experience in HCL Technology", "text": "Pros work culture,learning and development,team sprite,Personality development,Experienced people. Cons there are no any reason i have. Advice to Management Keep maintain current process", "rating": 5, "pros": "work culture,learning and development,team sprite,Personality development,Experienced people.", "cons": "there are no any reason i have.", "advice": "Keep maintain current process"}, {"title": "Low salary", "text": "Pros Microsoft as a major client Cons Top Management does not care about the employees. What they care about is how less the resource is getting paid and how more they are getting paid from client for that resource. Advice to Management You should try to retain your existing employees first.", "rating": 1, "pros": "Microsoft as a major client", "cons": "Top Management does not care about the employees. What they care about is how less the resource is getting paid and how more they are getting paid from client for that resource.", "advice": "You should try to retain your existing employees first."}, {"title": "Engg Manager", "text": "Pros Multi dimensional technology services work Cons Bad employee benefits and policies", "rating": 3, "pros": "Multi dimensional technology services work", "cons": "Bad employee benefits and policies", "advice": null}, {"title": "Review", "text": "Pros Employee friendly and good work environment Cons Relocation problem and more work pressure Advice to Management Good", "rating": 5, "pros": "Employee friendly and good work environment", "cons": "Relocation problem and more work pressure", "advice": "Good"}, {"title": "Lead Engineer", "text": "Pros Flexible, good productive environment, good organisation Cons too much pressure, too many managers Advice to Management please give some freedom to the employee and trust your developers", "rating": 5, "pros": "Flexible, good productive environment, good organisation", "cons": "too much pressure, too many managers", "advice": "please give some freedom to the employee and trust your developers"}, {"title": "HCL Review", "text": "Pros 1. Great People and very knowledgeable 2. Great SAP Practice 3. Medical benefits are good Cons 1. Application Strategy seems to be focuses on application management services. HCL acquires development resources of application no longer competitive in the marketplace and provides application maintenance services. 2. For a technology company, the applications supporting the business are outdated. Email approvals are required for all travel and you have to work through a travel agency in India. 3. Even with some of the tools like Skype, you cannot utilize the VOIP capability or collaborate with any external 3rd parties. 4. A Remedy ticket is required for everything and it usually takes 3-4 emails to get the work done. 5 Travel is required, and they have some very unrealistic policies, ie- max hotel cost is $75 in some cities, which leave real crap hotels. Advice to Management The focus on application maintenance is good for your business, unfortunately as business move to cloud, AMS services will be dropping.", "rating": 3, "pros": "1. Great People and very knowledgeable", "cons": "1. Application Strategy seems to be focuses on application management services. HCL acquires development resources of application no longer competitive in the marketplace and provides application maintenance services.", "advice": "The focus on application maintenance is good for your business, unfortunately as business move to cloud, AMS services will be dropping."}, {"title": "Great for a first time IT job", "text": "Pros Paid twice a month. Free coffee Cons too many employees. hot building to work in", "rating": 3, "pros": "Paid twice a month. Free coffee", "cons": "too many employees. hot building to work in", "advice": null}, {"title": "Technical Lead", "text": "Pros Good compensation and benefits while joining Cons Slow promotions after few years", "rating": 5, "pros": "Good compensation and benefits while joining", "cons": "Slow promotions after few years", "advice": null}, {"title": "Go for HCL or not??", "text": "Pros Good & friendly team environment. Cons Less salary and more work( non-technical).", "rating": 3, "pros": "Good & friendly team environment.", "cons": "Less salary and more work( non-technical).", "advice": null}, {"title": "Overview", "text": "Pros HCL Technologies - Americas is a large, decentralized organization with hundreds of large and small IT Services contracts in commercial and defense companies. As a 'hosted' India-based company, HCL is required to employ a minimum percentage of US nationals. So, while your current-job at HCL may not be secure, if deemed a value-add employe, your career potential at HCL is more secure than most corporations. Cons Unlike most US corporations with local overhead functions like HR, IT, Accounting, and Facilities, HCL Technologies is decentralized with most business support functions managed by off-shore operations in India. So, (not if but..) when you have issues with your basic SW/HW tools, travel expenses, or benefits, you will either suffer through a bureaucratic maze of approvals, referrals, and waiting...or give up and live with broken/unresolved issue. Advice to Management More attention to and internal investment in new employee on-boarding processes and local management oversight of basic internal IT/HR support will improve employee productivity, reduce turn-over, and cover the gaps created by low-bid contracts.", "rating": 3, "pros": "HCL Technologies - Americas is a large, decentralized organization with hundreds of large and small IT Services contracts in commercial and defense companies. As a 'hosted' India-based company, HCL is required to employ a minimum percentage of US nationals. So, while your current-job at HCL may not be secure, if deemed a value-add employe, your career potential at HCL is more secure than most corporations.", "cons": "Unlike most US corporations with local overhead functions like HR, IT, Accounting, and Facilities, HCL Technologies is decentralized with most business support functions managed by off-shore operations in India. So, (not if but..) when you have issues with your basic SW/HW tools, travel expenses, or benefits, you will either suffer through a bureaucratic maze of approvals, referrals, and waiting...or give up and live with broken/unresolved issue.", "advice": "More attention to and internal investment in new employee on-boarding processes and local management oversight of basic internal IT/HR support will improve employee productivity, reduce turn-over, and cover the gaps created by low-bid contracts."}, {"title": "Director", "text": "Pros Nice place to work, diversity, and chance to grow Cons too big and hence getting too confused", "rating": 5, "pros": "Nice place to work, diversity, and chance to grow", "cons": "too big and hence getting too confused", "advice": null}, {"title": "Poor Employee Engagement", "text": "Pros remote, work from home position Cons poor management, not given necessary tools to properly do job", "rating": 3, "pros": "remote, work from home position", "cons": "poor management, not given necessary tools to properly do job", "advice": null}, {"title": "Poor Recognition for Long Time Fulltime Employees", "text": "Pros N o t h I n g Cons HCL pays more salary for unknown new comers from outside. Worst Salary and Recognition for existing employees. $60k or less for existing top performing employees, min $95k+ for unknown new comers. Advice to Management Pay MARKET STANDARD salary for knowledge and work the employee do for organization. Treat and respect to all the employees.", "rating": 1, "pros": "N o t h I n g", "cons": "HCL pays more salary for unknown new comers from outside. Worst Salary and Recognition for existing employees.", "advice": "Pay MARKET STANDARD salary for knowledge and work the employee do for organization. Treat and respect to all the employees."}, {"title": "Great company unless you actually like getting paid", "text": "Pros Hard working, fast paced environment Opportunity to travel (mostly out of your own pocket, of course) Cons Not concerned what so ever with making sure paychecks are received If you are unfortunate enough to be a sub-contractor to HCL, you are lower than dirt Only supplying one tech to a contract that obviously needs more Advice to Management Quit making issues overly complicated, just resolve them Quit passing blame Actually look out for the lower level tech", "rating": 3, "pros": "Hard working, fast paced environment", "cons": "Not concerned what so ever with making sure paychecks are received", "advice": "Quit making issues overly complicated, just resolve them"}, {"title": "Assistant Manager", "text": "Pros Work life balance is good. They focus on employee benefits like Healthcare and medical benefits for all employees. Focus is given to meeting the customer values and achieving to add values add to client. Cons higher management is very hard to get in contact with.", "rating": 5, "pros": "Work life balance is good. They focus on employee benefits like Healthcare and medical benefits for all employees. Focus is given to meeting the customer values and achieving to add values add to client.", "cons": "higher management is very hard to get in contact with.", "advice": null}, {"title": "Linux System Admin", "text": "Pros Great benefits and great professional growth Cons Salaries could be a little more competitive.", "rating": 5, "pros": "Great benefits and great professional growth", "cons": "Salaries could be a little more competitive.", "advice": null}, {"title": "HCL America Inc", "text": "Pros Good Managers gives you what you ask Cons Not as such as I have seen, I am just ONE year old in HCL", "rating": 5, "pros": "Good Managers gives you what you ask", "cons": "Not as such as I have seen, I am just ONE year old in HCL", "advice": null}, {"title": "Each contract will be different", "text": "Pros Good pay. I did my job well and management left me alone. Friendly co-workers. Cons Low amount of vacation time. Pay increases very rare. Stingy; no investment into developing personnel if it costs anything. No opportunity for lateral movement into more interesting work. Advice to Management I got hired in at a great pay rate because they needed my skill set to support a customer in an area where my skills were rare. Management and co-workers were friendly and supportive, despite my being non-Indian and the odd man out. To their credit, once I proved to management I had my responsibilities in hand they took a hands off approach, just checking up on me regularly and approaching for my input on technical issues. However, management would not hear of the possibility of me moving to another role. You need to hire in at a good salary because pay raises are extremely rare. One year I was congratulated at being the only team member to get a perfect score on annual review - but I still received no pay increase. Part of that may be my fault because I hired in at a great rate and so increases were not a personal priority. Support for finding another role when the contract ended was almost non-existent. Assurances of some time to find another place were quickly forgotten by HR and you are terminated very quickly, so have your resume and skill set ready to go when a contract is nearing its end.", "rating": 3, "pros": "Good pay.", "cons": "Low amount of vacation time.", "advice": "I got hired in at a great pay rate because they needed my skill set to support a customer in an area where my skills were rare. Management and co-workers were friendly and supportive, despite my being non-Indian and the odd man out. To their credit, once I proved to management I had my responsibilities in hand they took a hands off approach, just checking up on me regularly and approaching for my input on technical issues. However, management would not hear of the possibility of me moving to another role."}, {"title": "Nice place to work", "text": "Pros All benefits at at par with industry standard in similar companies Cons Nothing much of a concern", "rating": 5, "pros": "All benefits at at par with industry standard in similar companies", "cons": "Nothing much of a concern", "advice": null}, {"title": "Tech Lead", "text": "Pros Good policies with respect to employees Cons HR people not responsive", "rating": 3, "pros": "Good policies with respect to employees", "cons": "HR people not responsive", "advice": null}, {"title": "Great Company to be employed in", "text": "Pros Good staff and good Company Cons All the processes inside the company can be little faster", "rating": 5, "pros": "Good staff and good Company", "cons": "All the processes inside the company can be little faster", "advice": null}, {"title": "na", "text": "Pros a nice environment to work Cons Can't expect much with appraisal.", "rating": 3, "pros": "a nice environment to work", "cons": "Can't expect much with appraisal.", "advice": null}, {"title": "Operations Manager", "text": "Pros The Benefits are amazing and are reminisce of the early 1990's. There are many projects that offer the ability to move and learn something new. Cons The company has way too many independent tools that to not sync with each other. This is a huge lack of training on how to use any of the tools. Advice to Management Process tends to rule over logical thought, you need to think outside of the box and trust in your employees.", "rating": 1, "pros": "The Benefits are amazing and are reminisce of the early 1990's. There are many projects that offer the ability to move and learn something new.", "cons": "The company has way too many independent tools that to not sync with each other. This is a huge lack of training on how to use any of the tools.", "advice": "Process tends to rule over logical thought, you need to think outside of the box and trust in your employees."}, {"title": "Decent employer", "text": "Pros 1) some projects are good. 2) easy to get through if you had worked in top 3 it companies. Cons 1)Poor work environment. 2) Not employee friendly. 3) compensation is less compared to other peers. Advice to Management Can be more employee friendly", "rating": 3, "pros": "1) some projects are good.", "cons": "1)Poor work environment.", "advice": "Can be more employee friendly"}, {"title": "Review", "text": "Pros fun place to work in Cons salary increments not great. Very difficult to switch tracks within the organization Advice to Management Need to care more for employees", "rating": 3, "pros": "fun place to work in", "cons": "salary increments not great. Very difficult to switch tracks within the organization", "advice": "Need to care more for employees"}, {"title": "Solutions Architect", "text": "Pros Nice place to work at this company. Cons Middle level management is having personal agendas.", "rating": 5, "pros": "Nice place to work at this company.", "cons": "Middle level management is having personal agendas.", "advice": null}, {"title": "Associate Consultant", "text": "Pros Good Medical benefits and tension free environment Cons Work depends on the project", "rating": 5, "pros": "Good Medical benefits and tension free environment", "cons": "Work depends on the project", "advice": null}, {"title": "Great experience if a job is needed", "text": "Pros Diverse portfolio of customers across numerous industries Cons corporate politics override local needs hampering local execution; verticals don't cross-collaborate Advice to Management Pay attention to the employees especially with the motto being \"Employees First, Customers Second\"", "rating": 3, "pros": "Diverse portfolio of customers across numerous industries", "cons": "corporate politics override local needs hampering local execution; verticals don't cross-collaborate", "advice": "Pay attention to the employees especially with the motto being \"Employees First, Customers Second\""}, {"title": "HCL is a great company to work for", "text": "Pros Benefits (401K and Medical ), Management, Flexibility Cons Management needs to focus of new business Advice to Management Proactive hiring on new technologies", "rating": 5, "pros": "Benefits (401K and Medical ), Management, Flexibility", "cons": "Management needs to focus of new business", "advice": "Proactive hiring on new technologies"}, {"title": "Not Bad but could be better", "text": "Pros Good flexibility and opportunity to excel. Cons Depending on job can be a grind. They will push you to innovate and theres an expectation to create value for the customer, which could be a good thing. But the push is to monetize these ideas. New projects will get alot of resources once the environment is stable thats when the cuts begin. Work out your salary going in.. Dont depend on raises/bonuses. Raises dont keep up with cost of living. And thats if you get one. Advice to Management Focus on how Americans Work and thier expectations. The Indian Business Model makes for unhappy employees in US.", "rating": 3, "pros": "Good flexibility and opportunity to excel.", "cons": "Depending on job can be a grind. They will push you to innovate and theres an expectation to create value for the customer, which could be a good thing. But the push is to monetize these ideas.", "advice": "Focus on how Americans Work and thier expectations. The Indian Business Model makes for unhappy employees in US."}, {"title": "Senior Director", "text": "Pros Competitive Salary compared to other similar employers Cons More Individual performance related culture versus company wide support Advice to Management More focus to support group and internal trainings", "rating": 3, "pros": "Competitive Salary compared to other similar employers", "cons": "More Individual performance related culture versus company wide support", "advice": "More focus to support group and internal trainings"}, {"title": "Lack of communication", "text": "Pros Job itself is not bad, it's the lack of consistency and communication that makes things so difficult. Along with outdated databases needed to locate information needed to perform our jobs in a timely matter. Example: *Needs to find \"something\"... Search and search and search... Runs into outdated info or dead ends... Finally ask coworker and they tell me what I need to know... I ask, \"how would I find that out in the event no one is around to help?\"... Coworker states \"I just know from a past experience\".... And that helps a newbie how???? Cons Management tells it's team nothing.Performance (until you make a large mistake, plus training is sub par), hires, fires, time off request, HR/payroll issues, nothing. Everything is left to speculation, team morale is low as we have no idea what is to happen from a day to day basis. In terms of the work to be completed, questions are looked down upon, superiors have a condescending, \"you should know attitude\". Despite the fast pace, ever changing environment. Advice to Management Talk to, properly educate, and stand up for your team.", "rating": 3, "pros": "Job itself is not bad, it's the lack of consistency and communication that makes things so difficult. Along with outdated databases needed to locate information needed to perform our jobs in a timely matter. Example: *Needs to find \"something\"... Search and search and search... Runs into outdated info or dead ends... Finally ask coworker and they tell me what I need to know... I ask, \"how would I find that out in the event no one is around to help?\"... Coworker states \"I just know from a past experience\".... And that helps a newbie how????", "cons": "Management tells it's team nothing.Performance (until you make a large mistake, plus training is sub par), hires, fires, time off request, HR/payroll issues, nothing. Everything is left to speculation, team morale is low as we have no idea what is to happen from a day to day basis. In terms of the work to be completed, questions are looked down upon, superiors have a condescending, \"you should know attitude\". Despite the fast pace, ever changing environment.", "advice": "Talk to, properly educate, and stand up for your team."}]