[{"title": "Decent place to work", "text": "Pros Had great health benefits and 401k Cons Didn’t receive promotion or raise that I was promised Advice to Management Keep your word", "rating": 3, "pros": "Had great health benefits and 401k", "cons": "Didn’t receive promotion or raise that I was promised", "advice": "Keep your word"}, {"title": "Awesome company absolutely taking off right now!", "text": "Pros - Best technical team. - Awesome project. - Awesome mission. - Awesome technical leadership. - Cool technical stack. - Fast paced and good for personal development. - Friendly and caring team and management. - Exciting time to work here. - Rewarding. Cons - Chaotic - Technical specs could be better but it's understandable and new product processes are already being rolled out. - Lot's of founder pressure at the moment.", "rating": 5, "pros": "- Best technical team.", "cons": "- Chaotic", "advice": null}, {"title": "A Rocket Ship!", "text": "Pros An amazing environment! A company striving to make a real change in the world. Very bright people who work hard and believe in the art of the possible. An inspirational startup /scale-up environment. Really cool office and company brownie's on Friday's. Cons Not for the fainthearted and a little cult like - if that not your thing probably not a fit. Fast growing with the atypical issues that this causes. Advice to Management Don't forget to celebrate the journey and the office dog, Winks, should be a permanent 5 day a week presence.", "rating": 5, "pros": "An amazing environment! A company striving to make a real change in the world. Very bright people who work hard and believe in the art of the possible. An inspirational startup /scale-up environment. Really cool office and company brownie's on Friday's.", "cons": "Not for the fainthearted and a little cult like - if that not your thing probably not a fit. Fast growing with the atypical issues that this causes.", "advice": "Don't forget to celebrate the journey and the office dog, Winks, should be a permanent 5 day a week presence."}, {"title": "Wouldn't recommend it", "text": "Pros Interesting, small, tech-focused and insights into different areas of business Cons Staff treated badly, no structure, bad pay, no communication", "rating": 1, "pros": "Interesting, small, tech-focused and insights into different areas of business", "cons": "Staff treated badly, no structure, bad pay, no communication", "advice": null}, {"title": "Great start-up to work in", "text": "Pros - Amazing leadership team caring about individuals' aspirations and helping the team grow through day to day responsibilities - Great team culture with a healthy balance between friendliness and strong work ethic - Open and supportive team members - it's very easy to become friends - Inspiring company's mission - the work is fulfilling - Unique opportunity to learn in practice about entrepreneurship, start-ups and scaling up - Getting real responsibility to add value to the company Cons None that I can think of.", "rating": 5, "pros": "- Amazing leadership team caring about individuals' aspirations and helping the team grow through day to day responsibilities", "cons": "None that I can think of.", "advice": null}, {"title": "Brand Ambassador", "text": "Pros Working hours are completely flexible. You try to find new potential 'sign ups' whenever you can/want! Cons Couldn't name one. Perhaps feeling a bit closer to the founders of the App?", "rating": 5, "pros": "Working hours are completely flexible. You try to find new potential 'sign ups' whenever you can/want!", "cons": "Couldn't name one. Perhaps feeling a bit closer to the founders of the App?", "advice": null}]