[{"title": "Fast-paced, innovative, dedicated to members", "text": "Pros Large company with a strong hold on the market. Allows for individual contributions and growth. Cons Growth may be limited, some departments take on too much work at once.", "rating": 5, "pros": "Large company with a strong hold on the market. Allows for individual contributions and growth.", "cons": "Growth may be limited, some departments take on too much work at once.", "advice": null}, {"title": "Good Employer, Would Recommend", "text": "Pros Management cares and does listen, management will always be willing to work with you regardless of the circumstances. Cons Communication can be lacking and everyone seems to want to do their own thing instead of the right thing. Advice to Management Communication is recognized as key, but communication was not really ever improved upon.", "rating": 5, "pros": "Management cares and does listen, management will always be willing to work with you regardless of the circumstances.", "cons": "Communication can be lacking and everyone seems to want to do their own thing instead of the right thing.", "advice": "Communication is recognized as key, but communication was not really ever improved upon."}, {"title": "Good company", "text": "Pros Benefits, salary, excellent training programs, beautiful offices Cons Pto time, management hierarchy too multilayered,", "rating": 5, "pros": "Benefits, salary, excellent training programs, beautiful offices", "cons": "Pto time, management hierarchy too multilayered,", "advice": null}, {"title": "Where do I begin", "text": "Pros Telecommute and the remaining honest people that work at Healthfirst Cons Clinicians control the work but blame the (little people) administrative and support teams for their constant failures. I just can’t believe the skewed information medical directors and clinical management fed senior management. Everything starts from the front end face the true problems and stop finding excuses for the same repetitive failures clinicians aren’t perfect you’ve created robotic workers who are just worried about pushing cases out regardless if it wrong Advice to Management Hire more staff to do the work. BT has been a failure that is taking up to much of our needed resources. The launch of the new system platforms are a failure and this was due to lack of pre launch testing and no communication or response from BT team. The entire BT got a promotion at ONCE nothing for them to strive for or care to improve.", "rating": 3, "pros": "Telecommute and the remaining honest people that work at Healthfirst", "cons": "Clinicians control the work but blame the (little people) administrative and support teams for their constant failures. I just can’t believe the skewed information medical directors and clinical management fed senior management. Everything starts from the front end face the true problems and stop finding excuses for the same repetitive failures clinicians aren’t perfect you’ve created robotic workers who are just worried about pushing cases out regardless if it wrong", "advice": "Hire more staff to do the work. BT has been a failure that is taking up to much of our needed resources. The launch of the new system platforms are a failure and this was due to lack of pre launch testing and no communication or response from BT team. The entire BT got a promotion at ONCE nothing for them to strive for or care to improve."}, {"title": "Member Service Representative", "text": "Pros PTO (19 days) and benefits are great Cons It takes a lot of time and to effort to be able to grow within the company Advice to Management Take more care of those who stand out and create a more competitive environment within the department", "rating": 5, "pros": "PTO (19 days) and benefits are great", "cons": "It takes a lot of time and to effort to be able to grow within the company", "advice": "Take more care of those who stand out and create a more competitive environment within the department"}, {"title": "A good place to start if you've never had an office job", "text": "Pros Work life balance is respected in some departments. Cons Compensation. Hardly any PTO. Management made up of people who have seniority and aren't necessarily qualified candidates to lead teams.", "rating": 3, "pros": "Work life balance is respected in some departments.", "cons": "Compensation. Hardly any PTO. Management made up of people who have seniority and aren't necessarily qualified candidates to lead teams.", "advice": null}, {"title": "Provider Relations Rep", "text": "Pros Great inexpensive benefits available to you from the first day. Very organized training. Opportunity to grow within the company. Cons Lowest salary within the industry.", "rating": 5, "pros": "Great inexpensive benefits available to you from the first day. Very organized training. Opportunity to grow within the company.", "cons": "Lowest salary within the industry.", "advice": null}, {"title": "Business Analyst", "text": "Pros Great Location and Work Environment, Promotes from witin Cons Management Inflexible, unrealistic and not people centered Advice to Management While production and efficiency are important. Investment in staff and consideration of people is equally important", "rating": 3, "pros": "Great Location and Work Environment, Promotes from witin", "cons": "Management Inflexible, unrealistic and not people centered", "advice": "While production and efficiency are important. Investment in staff and consideration of people is equally important"}, {"title": "Great learning and career opportunities, management can be unrealistic", "text": "Pros great reputation, offices beautiful and company supports wellness. Lots of internal promotions across departments Cons expectations of what can get done are insane", "rating": 5, "pros": "great reputation, offices beautiful and company supports wellness. Lots of internal promotions across departments", "cons": "expectations of what can get done are insane", "advice": null}, {"title": "Claims", "text": "Pros Great company to lean new things, and advance quickly. Cons A lot of work to be done Advice to Management Need to manage the department", "rating": 5, "pros": "Great company to lean new things, and advance quickly.", "cons": "A lot of work to be done", "advice": "Need to manage the department"}, {"title": "Claims Department", "text": "Pros Great company to learn new things. Cons The Department needs better/organization- not organized. Advice to Management Needs better departmental management", "rating": 5, "pros": "Great company to learn new things.", "cons": "The Department needs better/organization- not organized.", "advice": "Needs better departmental management"}, {"title": "Revenue Cycle Manager", "text": "Pros the company culture was great Cons too many manual process. no one to give you advice. you always have to figure out things on your own.", "rating": 3, "pros": "the company culture was great", "cons": "too many manual process. no one to give you advice. you always have to figure out things on your own.", "advice": null}, {"title": "Intern", "text": "Pros The Internship program is crafted well, and provides opportunities to work collaboratively. They also provided a mentor, which oversaw the work as well as growth of the interns. Cons From interacting with others, the experience may depend on the mentor selected. Advice to Management n/a", "rating": 5, "pros": "The Internship program is crafted well, and provides opportunities to work collaboratively. They also provided a mentor, which oversaw the work as well as growth of the interns.", "cons": "From interacting with others, the experience may depend on the mentor selected.", "advice": "n/a"}, {"title": "Provider services", "text": "Pros Great shift. Company that really cares about you Cons Training needs to be longer with more on the phone experience Advice to Management Keep up the great work. Give raises", "rating": 5, "pros": "Great shift. Company that really cares about you", "cons": "Training needs to be longer with more on the phone experience", "advice": "Keep up the great work. Give raises"}, {"title": "Marketing Specialist", "text": "Pros Always great to work with Professionals Cons No downsides so far. I`ve been with the company 1 year.", "rating": 5, "pros": "Always great to work with Professionals", "cons": "No downsides so far. I`ve been with the company 1 year.", "advice": null}, {"title": "Engineers", "text": "Pros Great place to learn different technology Cons No balance between work and family life.", "rating": 5, "pros": "Great place to learn different technology", "cons": "No balance between work and family life.", "advice": null}, {"title": "Register Nurse", "text": "Pros There are great opportunities to grow in this company. Cons Things are always changing.", "rating": 5, "pros": "There are great opportunities to grow in this company.", "cons": "Things are always changing.", "advice": null}, {"title": "DISSATISFIED!!", "text": "Pros Only pro is that you get to work from home. That is very convenient to not have to commute. That’s their selling point. Cons They do not care about their employees. NO ROOM FOR GROWTH! Will not allow you to leave your department or be promoted to a better department. Upper management will blackball you from being approved to transfer. Recruitment is horrible! Its all about favoritism. Supervisor favor the employees that speak their language. Esp the spanish ones. Upper management gives you tasks they cant even do themselves and expect employees to use systems with major glitches that they don’t even know how to use. And lastly, God forbid you need to use the bathroom. You will return to tons of emails telling you to return to work. Advice to Management Allow employees to grow! Stop the favoritism!", "rating": 3, "pros": "Only pro is that you get to work from home. That is very convenient to not have to commute. That’s their selling point.", "cons": "They do not care about their employees. NO ROOM FOR GROWTH! Will not allow you to leave your department or be promoted to a better department. Upper management will blackball you from being approved to transfer. Recruitment is horrible! Its all about favoritism. Supervisor favor the employees that speak their language. Esp the spanish ones. Upper management gives you tasks they cant even do themselves and expect employees to use systems with major glitches that they don’t even know how to use. And lastly, God forbid you need to use the bathroom. You will return to tons of emails telling you to return to work.", "advice": "Allow employees to grow! Stop the favoritism!"}, {"title": "Account Manager", "text": "Pros Good income and good people Cons Not for profit, means at will termination Advice to Management no", "rating": 3, "pros": "Good income and good people", "cons": "Not for profit, means at will termination", "advice": "no"}, {"title": "3 year + employee", "text": "Pros Great benefits, great pay, telecommuter possibilities Cons Hard to move up the ladder Advice to Management Loosen the reigns", "rating": 5, "pros": "Great benefits, great pay, telecommuter possibilities", "cons": "Hard to move up the ladder", "advice": "Loosen the reigns"}, {"title": "Decent company to work for", "text": "Pros Very easy and user friendly systems. Streamlined policies and procedures. Great medical, dental, and vision insurance. Good management team and friendly coworkers. Cons Low starting pay. Very hard to qualify for quaterly bonuses. Constant billing discrepancies caused by finance department. No more than fifteen second dead air requirement, while doable, is super annoying. Advice to Management Do something about the billing discepancies and raise the starting pay.", "rating": 3, "pros": "Very easy and user friendly systems.", "cons": "Low starting pay.", "advice": "Do something about the billing discepancies and raise the starting pay."}, {"title": "Annoyed", "text": "Pros Working from home, benefits, working for a reputable company Cons Work life balance, gossip, favoritism, no growth, disorganized Advice to Management Listen to employees", "rating": 3, "pros": "Working from home, benefits, working for a reputable company", "cons": "Work life balance, gossip, favoritism, no growth, disorganized", "advice": "Listen to employees"}, {"title": "New people came in messed it up completely!!!", "text": "Pros Great Benefits. 401k dental, vision. Great co workers. Who willing to help each other out. Working from home sometimes is a plus!!! Cons Lots of favoritism. Gossip is very big there. Atmosphere is great when fake team leads who don’t know their jobs aren’t there. That place is a revolving door... no growth. At all, unless you know somebody that’s higher up ... Advice to Management Need better leads someone who knows their job and doesn’t gossip all day ... promote people who actually like the place .... and yea,,,, the pay for all the work . Not worth it ..... pay more or hire more people.", "rating": 3, "pros": "Great Benefits. 401k dental, vision. Great co workers. Who willing to help each other out. Working from home sometimes is a plus!!!", "cons": "Lots of favoritism. Gossip is very big there. Atmosphere is great when fake team leads who don’t know their jobs aren’t there. That place is a revolving door... no growth. At all, unless you know somebody that’s higher up ...", "advice": "Need better leads someone who knows their job and doesn’t gossip all day ... promote people who actually like the place .... and yea,,,, the pay for all the work . Not worth it ..... pay more or hire more people."}, {"title": "Claims Examiner", "text": "Pros Telecommuting is the best for work life balance Cons Management is not knowledgeable of claims processes Advice to Management Should be trained as well", "rating": 5, "pros": "Telecommuting is the best for work life balance", "cons": "Management is not knowledgeable of claims processes", "advice": "Should be trained as well"}, {"title": "Good starting point", "text": "Pros It has a fast paced working environment. Cons too much work and not enough employees", "rating": 5, "pros": "It has a fast paced working environment.", "cons": "too much work and not enough employees", "advice": null}, {"title": "Dissapointed", "text": "Pros Location is easily accessible, good work/life balance and flexible work schedules, generous PTO policy, annual bonus structure, support to apply for jobs in other departments, 401k match, bright/sunny office space. Cons Healthfirst was on its way to becoming a great place to work but recently took a wrong turn and has lost the ability to articulate purpose and goals -- creating an environment where employees who were previously highly engaged are chasing their tails in attempt to keep up with consistently moving targets and frequent changes in leadership. The favoritism and gossip mentioned in other reviews is present in the most disheartening ways and enabled through “calibration”, the annual review process. A process intended to do well has created tension among managers as they feel the need to defend their staff in the town hall style performance reviews. If you're just looking for a job, Healthfirst will probably work. If you have pride in your work and a desire to grow and learn, I would think twice.", "rating": 3, "pros": "Location is easily accessible, good work/life balance and flexible work schedules, generous PTO policy, annual bonus structure, support to apply for jobs in other departments, 401k match, bright/sunny office space.", "cons": "Healthfirst was on its way to becoming a great place to work but recently took a wrong turn and has lost the ability to articulate purpose and goals -- creating an environment where employees who were previously highly engaged are chasing their tails in attempt to keep up with consistently moving targets and frequent changes in leadership.", "advice": null}, {"title": "Good company", "text": "Pros good company to work for Cons no raise, a lot of gossip", "rating": 5, "pros": "good company to work for", "cons": "no raise, a lot of gossip", "advice": null}, {"title": "Excellent Company! Amazing team to work with!", "text": "Pros I had an incredible run while working at HF. Extremely fast moving company with growth and vision. I had a loyal team that produced and put up some numbers that have not been matched as of yet. I tried to get back in but due to some new rules and regulations I was unable to apply. Maybe next time. Cons No cons to report. One of the best companies I ever worked for. Advice to Management I say use experience and past performance as a bar for the role you are trying to fill. The \"degree\" is nice but WILL not guarantee the results you would like.", "rating": 5, "pros": "I had an incredible run while working at HF. Extremely fast moving company with growth and vision. I had a loyal team that produced and put up some numbers that have not been matched as of yet. I tried to get back in but due to some new rules and regulations I was unable to apply. Maybe next time.", "cons": "No cons to report. One of the best companies I ever worked for.", "advice": "I say use experience and past performance as a bar for the role you are trying to fill. The \"degree\" is nice but WILL not guarantee the results you would like."}, {"title": "Member Services Supervisor", "text": "Pros Good employee benefits, opportunity to get experience and further advancement in the company or elsewhere. Cons Low pay Lack of interdepartmental communication Lack of accountability from Management Lack of quality employees Advice to Management poor pay= poor quality employees= poor performance=unhappy members", "rating": 1, "pros": "Good employee benefits, opportunity to get experience and further advancement in the company or elsewhere.", "cons": "Low pay", "advice": "poor pay= poor quality employees= poor performance=unhappy members"}, {"title": "Process Improvement Specialist", "text": "Pros There is flexible work environment Cons Lack of clear sense of management purpose Advice to Management Supervisors must have keen interest in the development of their direct reports", "rating": 3, "pros": "There is flexible work environment", "cons": "Lack of clear sense of management purpose", "advice": "Supervisors must have keen interest in the development of their direct reports"}, {"title": "Program Coordinator", "text": "Pros Decent benefits, great office location, interesting work on a large scale Cons Appears to be zero room for growth", "rating": 3, "pros": "Decent benefits, great office location, interesting work on a large scale", "cons": "Appears to be zero room for growth", "advice": null}, {"title": "Member Services Representative", "text": "Pros Bonuses for QA and adherence nice incentive Cons Being the front line you have to deal with upset customers", "rating": 5, "pros": "Bonuses for QA and adherence nice incentive", "cons": "Being the front line you have to deal with upset customers", "advice": null}, {"title": "Canary in a coal mine.", "text": "Pros PTO, but try to have it approved. Diversity (but some departments decided to use racial preferences to build their team - not good). Cons I've never seen such level of nepotism and favoritism. I mean seriously, why do they need 10 managers (whose qualification and knowledge are a big question) for 1 department? A healthcare company which penalizes its employees for catching a cold? - Welcome to HF. Depending on the department you work for, your mental health gets damaged during either the first year or much faster. The Member/Provider Services? I'm sorry, but a godforsaken sweatshop is the only way to describe them. Oh, also beware of verbal agreements! once they've got what they need from you, they can easily deny everything what was promised (read \"email/screenshot\"). The Claim Department, well it looks as though some \"higher people\" used to work for a torture chamber. Advice to Management Be respectful, caring and understanding. Maybe it's about time to get a subscription for Lynda.com and watch a few tutorials? Just remember that \"torches and pitchforks\" won't help you build any relationship with your teams.", "rating": 1, "pros": "PTO, but try to have it approved.", "cons": "I've never seen such level of nepotism and favoritism. I mean seriously, why do they need 10 managers (whose qualification and knowledge are a big question) for 1 department? A healthcare company which penalizes its employees for catching a cold? - Welcome to HF. Depending on the department you work for, your mental health gets damaged during either the first year or much faster. The Member/Provider Services? I'm sorry, but a godforsaken sweatshop is the only way to describe them. Oh, also beware of verbal agreements! once they've got what they need from you, they can easily deny everything what was promised (read \"email/screenshot\"). The Claim Department, well it looks as though some \"higher people\" used to work for a torture chamber.", "advice": "Be respectful, caring and understanding. Maybe it's about time to get a subscription for Lynda.com and watch a few tutorials? Just remember that \"torches and pitchforks\" won't help you build any relationship with your teams."}, {"title": "Interpreter", "text": "Pros Company benefits are average. Cons Manager of the department is the devil Advice to Management Change the management", "rating": 3, "pros": "Company benefits are average.", "cons": "Manager of the department is the devil", "advice": "Change the management"}, {"title": "Still here for salary", "text": "Pros Allowed to work from home, decent benefits, cool employee perks. Cons Management is horrible! Managers, Directors, VPs and above. Advice to Management Listen to your employees and stop bringing people in from the outside. One of the best thing this place WAS known for was promoting within. That's a thing of the pass.", "rating": 3, "pros": "Allowed to work from home, decent benefits, cool employee perks.", "cons": "Management is horrible! Managers, Directors, VPs and above.", "advice": "Listen to your employees and stop bringing people in from the outside. One of the best thing this place WAS known for was promoting within. That's a thing of the pass."}, {"title": "Wasting money", "text": "Pros Very nice colleagues, good benefits, can work from home Cons Most of the IT department is made up of consultants/contractors. They have little to zero knowledge about the industry and they do not receive training. The code that is produced is horrible and it takes a very long time to get any sort of quality, if ever, because the only thing Sr. Management is concerned about is meeting a date. Often the business gets less than a day to test with immense pressure to meet the deadline even though everything was days or weeks late. Management wonders why there are so many production breaks! There are way too many cooks in the kitchen. Very few people actually do the work and the others ask for a status constantly so they can fill out a bogus report that makes everything look good to Sr. Management....Can't blame them, they don't want the wrath of the high and mighty Sr Leadership either. Coupled with the lack of knowledge in IT and the lack of knowledge on the business side, it spell disaster. Training is severely lacking and most do not know the reason why they do certain things certain ways, they are just told to do it . The company has major billing and claims problems but the same leadership remains. Clinical is replacing their software and most of the work is being done by consultants who have very little knowledge, not only about Healthfirst, but about the industry. It is headed for a train wreck. Agile is also a disaster. Millions of dollars spent on consultants but there is no standard process. Advice to Management Hire people in IT and the business who know the business. You will save a lot of money and get quality outcomes instead of having constant do-overs and still ending up with poor quality. Put your seasoned employees on major projects, backfill their roles with consultants if you must. Most of all, Sr leadership needs to respect and trust the staff and listen to their needs. Sr management needs to get out of their seats and walk around and talk to people who do the work. Try to make a flat organization. Perhaps if they saw what really goes on it would affect real change. Train your staff. Get rid of high priced consultants and invest in the staff instead. Take time to implement things well. If it looks good on paper, that doesn't mean it's implemented.", "rating": 1, "pros": "Very nice colleagues, good benefits, can work from home", "cons": "Most of the IT department is made up of consultants/contractors. They have little to zero knowledge about the industry and they do not receive training. The code that is produced is horrible and it takes a very long time to get any sort of quality, if ever, because the only thing Sr. Management is concerned about is meeting a date. Often the business gets less than a day to test with immense pressure to meet the deadline even though everything was days or weeks late. Management wonders why there are so many production breaks! There are way too many cooks in the kitchen. Very few people actually do the work and the others ask for a status constantly so they can fill out a bogus report that makes everything look good to Sr. Management....Can't blame them, they don't want the wrath of the high and mighty Sr Leadership either. Coupled with the lack of knowledge in IT and the lack of knowledge on the business side, it spell disaster. Training is severely lacking and most do not know the reason why they do certain things certain ways, they are just told to do it . The company has major billing and claims problems but the same leadership remains. Clinical is replacing their software and most of the work is being done by consultants who have very little knowledge, not only about Healthfirst, but about the industry. It is headed for a train wreck. Agile is also a disaster. Millions of dollars spent on consultants but there is no standard process.", "advice": "Hire people in IT and the business who know the business. You will save a lot of money and get quality outcomes instead of having constant do-overs and still ending up with poor quality. Put your seasoned employees on major projects, backfill their roles with consultants if you must. Most of all, Sr leadership needs to respect and trust the staff and listen to their needs. Sr management needs to get out of their seats and walk around and talk to people who do the work. Try to make a flat organization. Perhaps if they saw what really goes on it would affect real change. Train your staff. Get rid of high priced consultants and invest in the staff instead. Take time to implement things well. If it looks good on paper, that doesn't mean it's implemented."}, {"title": "Frustrated and Annoyed", "text": "Pros Able to work from home Cons The Claims department is a disater. No type of organization, the workflows are terrible. It's a very stressful and demanding department and it's like they want to see you fail. No employee morale everyone feels trapped and disgusted! Advice to Management Too many people trying to be in charge.", "rating": 1, "pros": "Able to work from home", "cons": "The Claims department is a disater. No type of organization, the workflows are terrible. It's a very stressful and demanding department and it's like they want to see you fail. No employee morale everyone feels trapped and disgusted!", "advice": "Too many people trying to be in charge."}, {"title": "Care Coordinator", "text": "Pros Telecommute, paid time off, not having to go into the office much Cons constant wrongful transfers and incoming calls Advice to Management Assist employees with calls when needed. Stop trying to pass the work to others or ignore your responsibility", "rating": 3, "pros": "Telecommute, paid time off, not having to go into the office much", "cons": "constant wrongful transfers and incoming calls", "advice": "Assist employees with calls when needed. Stop trying to pass the work to others or ignore your responsibility"}, {"title": "Interpreter/ administrative medical records", "text": "Pros Excellent management, great benefit package, room for growth, friendly co-workers, excellent office facility Cons Budget cut on business travel reimbursement Advice to Management Hiring more staffs and raising salary would be helpful to keep current employees from leaving.", "rating": 5, "pros": "Excellent management, great benefit package, room for growth, friendly co-workers, excellent office facility", "cons": "Budget cut on business travel reimbursement", "advice": "Hiring more staffs and raising salary would be helpful to keep current employees from leaving."}, {"title": "The department I worked for needs improvement", "text": "Pros Benefit package is pretty amazing, offering great coverage. 401k is the best I have seen. You start off with 19 days of PTO, plus Holidays. Close to home. Hours were good. Cons Favoritism between leads, managers, and employees. Afraid of completing tasks on your own without being criticized on how they were submitted. Felt like I needed to be held by the hand for all my responsibilities without given a chance to learn when I failed. After reading all the reviews, and before posting mine, I do agree with the fact that you have to kiss up to your managers in order to get somewhere. Advice to Management Pay attention to your employees and what their feelings are about new processes and procedures. Having a good open relationship with them, instead of only thinking of yourself, will only make you look better in the long run, than to ignore their thoughts and ideas, that could perhaps help on improving not only your future goals, but theirs as well.", "rating": 3, "pros": "Benefit package is pretty amazing, offering great coverage. 401k is the best I have seen. You start off with 19 days of PTO, plus Holidays. Close to home. Hours were good.", "cons": "Favoritism between leads, managers, and employees. Afraid of completing tasks on your own without being criticized on how they were submitted. Felt like I needed to be held by the hand for all my responsibilities without given a chance to learn when I failed. After reading all the reviews, and before posting mine, I do agree with the fact that you have to kiss up to your managers in order to get somewhere.", "advice": "Pay attention to your employees and what their feelings are about new processes and procedures. Having a good open relationship with them, instead of only thinking of yourself, will only make you look better in the long run, than to ignore their thoughts and ideas, that could perhaps help on improving not only your future goals, but theirs as well."}, {"title": "Manager", "text": "Pros Benefits and work from home Cons Too many politics and favoritism; difficult to get promoted unless you are in the circle; senior management is a joke and wonder why they are placed in such position Advice to Management Take a look at your senior management team and clean house if you want to be the eminent plan in the marketplace by 2020", "rating": 3, "pros": "Benefits and work from home", "cons": "Too many politics and favoritism; difficult to get promoted unless you are in the circle; senior management is a joke and wonder why they are placed in such position", "advice": "Take a look at your senior management team and clean house if you want to be the eminent plan in the marketplace by 2020"}, {"title": "Not a bad company, just not for me", "text": "Pros benefits, people are nice for the most part, corporate office is in the city which is convenient . room for growth. Not bad if you're looking for work in corporate office with 30 min lunch break, long hours on the computer and phone. Cons environment is dull and stoic. Everyone is too serious walking on edge in corporate environment. starting pay is low for entry level. boring Advice to Management Add lively color to work areas, play light jazz or music on each floor, less extensive computer training and more hands on, increase pay for entry level", "rating": 3, "pros": "benefits, people are nice for the most part, corporate office is in the city which is convenient . room for growth. Not bad if you're looking for work in corporate office with 30 min lunch break, long hours on the computer and phone.", "cons": "environment is dull and stoic. Everyone is too serious walking on edge in corporate environment. starting pay is low for entry level. boring", "advice": "Add lively color to work areas, play light jazz or music on each floor, less extensive computer training and more hands on, increase pay for entry level"}, {"title": "Claims reviewer", "text": "Pros The work from home schedule. Cons No advancement, promotions are only given to the inner circle people with little to no knowledge. A lot of middle man dept that do nothing but cause confusion. Advice to Management Get rid of the middle men depts, treat people as adults, promote within, having a degree doesn't give you a pass to climb the ladder, look for knowledgeable individuals within the company.", "rating": 3, "pros": "The work from home schedule.", "cons": "No advancement, promotions are only given to the inner circle people with little to no knowledge. A lot of middle man dept that do nothing but cause confusion.", "advice": "Get rid of the middle men depts, treat people as adults, promote within, having a degree doesn't give you a pass to climb the ladder, look for knowledgeable individuals within the company."}, {"title": "Member service representative", "text": "Pros Great company. Great benefits and pay. Great hours and steady schedule. Cons The lights are bright and micro management. Policies are ever changing. Advice to Management Communication is key, try it.", "rating": 5, "pros": "Great company. Great benefits and pay. Great hours and steady schedule.", "cons": "The lights are bright and micro management. Policies are ever changing.", "advice": "Communication is key, try it."}, {"title": "Medical Managment", "text": "Pros Growing company; the CEO has managed the healthcare financial climate well. Cons Very hierarchical; upper management controls everything, very paranoid environment about who knows what, who is included in meetings, emails, etc. Executive staff are well compensated but lower management not so much. A lot of pressure on lower level personnel to follow directions; a lot of micromanagement and heavy emphasis on performance analysis of lower level staff. As a result, a high turnover of employees at all levels. Operational strategy and directions change constantly. They offer remote employment but the unspoken expectation is that employees do a lot for that privilege (salaried/non-hourly workers aren't compensated appropriately for excessive overtime. Constant availability expected). The expectation is for very high volume work. I left for a better opportunity.", "rating": 3, "pros": "Growing company; the CEO has managed the healthcare financial climate well.", "cons": "Very hierarchical; upper management controls everything, very paranoid environment about who knows what, who is included in meetings, emails, etc. Executive staff are well compensated but lower management not so much. A lot of pressure on lower level personnel to follow directions; a lot of micromanagement and heavy emphasis on performance analysis of lower level staff. As a result, a high turnover of employees at all levels. Operational strategy and directions change constantly. They offer remote employment but the unspoken expectation is that employees do a lot for that privilege (salaried/non-hourly workers aren't compensated appropriately for excessive overtime. Constant availability expected). The expectation is for very high volume work. I left for a better opportunity.", "advice": null}, {"title": "Member Services Pit", "text": "Pros First everyone wants to know, the pay. Well, your pay when you start in 2017 would typically start at about $17.33 an hour, which adds up to about $36,050 a year. There is a 3% yearly increase every year as long as you do what you are supposed to do. Everyone gets this increase. You can get more if you take special projects and ect. You can work this position for as long as you want and they will increase in pay every year. There are people that are working this position for more than 15 years and they are the nicest people you will ever meet! For every $1 you contribute to your 401k (up to 6% of your pay), Healthfirst, will make a company matching contribution of $1 to your account which is administered by Vanguard. PTO (Paid time off) is offered in days, so you start initially with 152 hours which is 19 days. The offer paid holiday leave for the following days, New Year’s , Dr. Martin Luther King, Jr. Day, Presidents Day, Memorial Day, Independence Day, Labor Day, Thanksgiving Day and Christmas Day. They close at 3pm the business day before the paid holiday mentioned. You get paid for the hours your shift runs past the 3pm mark. Cons Working here at Healthfirst is currently a test of civil and social dexterity. I will break down to you some points about this Member Service position. The Dress code is business casual and they have dress down Fridays on occasions. There is a monthly one on one review with your supervisor where you can get an update on how you are doing on the phone. Typically you would know all of your attendance metrics since this in the Verint system they use to track all your calls. The first month you get no official scored, just FYI’s. After that, the calls are graded and will affect your payout and overall call metrics. Managers of customer service seem to be, well, obtuse to the customer service experience. Ironically, most of them were Member services representatives. You will meet the during training and see them walk around. You will see what I mean. You earn a quarterly bonus for keeping your attendance, which includes not missing days and being at your desk. You have to keep it above 98% to receive the quarterly incentive max payout of $450. Then it breaks down to $350 (97 – 97.99%), $250 (96% – 96.99%) and $150 (95-95.99%). Anything below 95, there is no monetary reward. You also earn a quarterly bonus for the QA (Quality Assurance) calls. Now the max for this bonus is $725 if your QA call averages above 99% and above. Then it breaks down to $650 (98-98.9 %), $500 (97-97.9%). Anything below 97 % does not merit a reward. One major thing to note is that your calls will be reviewed by the Florida Healthfirst call center. I’m not sure if it’s the sun down there but there are always errors in these monthly calls which can dramatically crash your score. So you guess it, it will affect your payout. You have the right to rebut your calls and have the scores reviewed. You are given a chance to listen to the calls, so you can correct the Florida rep errors and have your score back up where it belongs, thus allowing your pay to be the max. The rebuttal process is not web based, it via email using a word document template. Go figure. Advice to Management hire Outside management who can see things from fresh eyes. Your daily business structure is eroding the member services department which can be a downfall.", "rating": 1, "pros": "First everyone wants to know, the pay. Well, your pay when you start in 2017 would typically start at about $17.33 an hour, which adds up to about $36,050 a year.", "cons": "Working here at Healthfirst is currently a test of civil and social dexterity. I will break down to you some points about this Member Service position.", "advice": "hire Outside management who can see things from fresh eyes. Your daily business structure is eroding the member services department which can be a downfall."}, {"title": "Manager Clinical Eligibility", "text": "Pros Great colleagues and good teamwork. Cons Upper management is inefficient. Too much stress on productivity, metrics and data. Utterly inefficient information system to gather useful data and information. Micromanagement and overly controlling upper management who care a hoot for their direct reports. Less said about the HR management is better. The consultants try to manipulate the clinical staff to get the desired data to reach the STAR goals...pathetic. Very very stressful place to work. Don't recommend it anyone. And no room to grow due to favoritism. Advice to Management Look at all the advises above and learn from it.", "rating": 3, "pros": "Great colleagues and good teamwork.", "cons": "Upper management is inefficient. Too much stress on productivity, metrics and data. Utterly inefficient information system to gather useful data and information. Micromanagement and overly controlling upper management who care a hoot for their direct reports. Less said about the HR management is better. The consultants try to manipulate the clinical staff to get the desired data to reach the STAR goals...pathetic. Very very stressful place to work. Don't recommend it anyone. And no room to grow due to favoritism.", "advice": "Look at all the advises above and learn from it."}, {"title": "Case Manager", "text": "Pros Working from home and a lot of PTO Cons Time sensitive work means a lot of pressure to finish work by end of business and possible overtime. Also a lot of micromanagement/mistrust Advice to Management Allow your employees more flexibility in balance of work/home life. Just because we work from home doesn't mean we are glued to our computers 24/7 and allow more involvement and input in evolving policies and procedures that effect our day to day", "rating": 3, "pros": "Working from home and a lot of PTO", "cons": "Time sensitive work means a lot of pressure to finish work by end of business and possible overtime. Also a lot of micromanagement/mistrust", "advice": "Allow your employees more flexibility in balance of work/home life. Just because we work from home doesn't mean we are glued to our computers 24/7 and allow more involvement and input in evolving policies and procedures that effect our day to day"}, {"title": "Bad management", "text": "Pros Flexibility, work from home, new management, hours Cons Poor management, gossip, attitude, favoritism, bias", "rating": 5, "pros": "Flexibility, work from home, new management, hours", "cons": "Poor management, gossip, attitude, favoritism, bias", "advice": null}, {"title": "Poor Executive Management! Toxic Environment", "text": "Pros Salary, Benefits, Work from home Cons Discriminates against women in IT Advice to Management Clean house! Start with the CIO and his VP's who bully the staff.", "rating": 1, "pros": "Salary, Benefits, Work from home", "cons": "Discriminates against women in IT", "advice": "Clean house! Start with the CIO and his VP's who bully the staff."}, {"title": "Toxic mess", "text": "Pros Coworkers, office neighborhood, the company's mission Cons You have an out-of-touch CEO who's more interested in making long-winded internal videos in which she condescends to us like we're children. You have executives who know less than their direct reports, and who lie to their managers about what they know. One executive spends most of his time on Skype talking to friends and relatives. Another who watches YouTube videos all day long. Another who puts together PowerPoints that no one asks for, on topics that aren't important. You have egotistical maniacs at the middle and upper management level, who are allowed to give their input on processes about which they know nothing. There's so much jockeying for power. So much. And in between jockeying for power and playing these games, some of these folks forget they have an actual job to do. You have poor processes all around. You have a lack of investment in real infrastructure and technology that would help the company grow. Just look at the reviews on Yelp. The foray into the commercial market was a disaster thanks to the lack of systems to support that kind of growth. They do not value, nor understand, technology, and they're going to get clobbered in the marketplace because of it. You have favoritism galore. One person is so highly favored that she's been promoted multiple times over just a few years, all while being detested by her colleagues for her nastiness, being terrible at her actual job, and having no identifiable skills. But, she's gone out for drinks with her bosses and cozied up to people who mattered, so they protect her despite multiple complaints. You have a completely unethical review process. You're reviewed by your colleagues, your boss, and any direct reports you have. Fair, right? Well, it would be, except that everything those people say about you is then reviewed in a room with 20+ OTHER PEOPLE WHO DO NOT KNOW YOU OR YOUR JOB. Those people are allowed to weigh in on whether you need improvement, meet expectations, or exceed expectations. They then use everyone's input to place you somewhere on a *BELL CURVE* (yes, the measurement of human capability that has since been thoroughly debunked). Oh! Also! Those 20+ people who weighed in on your job? They get to see what everyone said about you, but you, yourself, don't. You have a culture that focuses on the wrong things.There is no better example of this than the fact that they spent millions on consultants to come up with a terrible metaphor that they push on every employee: TRAILBLAZER. \"Are you being a trailblazer?\" \"Can you recite the trailblazer culture drivers?\" They spent so much money coming up with an internal campaign for employees based on a hiking/mountain metaphor. For city dwellers. Who service other city dwellers. Yet they never spent the money to fix *major* billing and enrollment issues for our customers before entering the commercial market. Also, the NYC office is battling a bed bug problem. There are *smart,* wonderful people here who will never be valued for their contributions, and who will never flourish or grow. They will leave, snatched up by better companies doing better things. Those who stay are often depressed, cynical, and hopeless. To use their own metaphor: don't blaze this trail. Advice to Management Value your employees like adults . Take a good look at what you're trying to accomplish, then bring in better people to do it. Invest in technology.", "rating": 1, "pros": "Coworkers, office neighborhood, the company's mission", "cons": "You have an out-of-touch CEO who's more interested in making long-winded internal videos in which she condescends to us like we're children.", "advice": "Value your employees like adults . Take a good look at what you're trying to accomplish, then bring in better people to do it. Invest in technology."}, {"title": "member services", "text": "Pros easy office job, not much stress Cons too much regulation and limited growth", "rating": 3, "pros": "easy office job, not much stress", "cons": "too much regulation and limited growth", "advice": null}, {"title": "Avoid like Zika", "text": "Pros High compensation, generous work from home policy Cons A veritable cluster of incompetence, disrespect, and lack of talent. Appalling favoritism. Infested with bed bugs. Top-heavy management structure. Zero career development. Overpriced health plan. Crummy benefits. Employees are constantly promoted to positions they are unqualified for, and the rest of us pick up the slack and suffer. Lack of management training results in bumbling bosses who don't have a clue. Values are in the toilet. Plus, the dress code is stupid. Advice to Management Honestly, I think it's hopeless.", "rating": 1, "pros": "High compensation, generous work from home policy", "cons": "A veritable cluster of incompetence, disrespect, and lack of talent. Appalling favoritism. Infested with bed bugs. Top-heavy management structure. Zero career development. Overpriced health plan. Crummy benefits. Employees are constantly promoted to positions they are unqualified for, and the rest of us pick up the slack and suffer. Lack of management training results in bumbling bosses who don't have a clue. Values are in the toilet. Plus, the dress code is stupid.", "advice": "Honestly, I think it's hopeless."}, {"title": "Utilization Management", "text": "Pros Horrible place to work for Cons Managers and Supervisors belittle you Advice to Management Give raises to the hard dedicated workers that get the job done in the department. Don't take away the raises they worked hard for. I only give the ratings 1 star, for this company DOES NOT stand up for their mission. Its who you know in the company, and if you are clingy with upper management, you will get places....", "rating": 1, "pros": "Horrible place to work for", "cons": "Managers and Supervisors belittle you", "advice": "Give raises to the hard dedicated workers that get the job done in the department. Don't take away the raises they worked hard for. I only give the ratings 1 star, for this company DOES NOT stand up for their mission. Its who you know in the company, and if you are clingy with upper management, you will get places...."}, {"title": "Healthfirst Has An Incredibly Toxic Work Environment", "text": "Pros The big selling point of Healthfirst is its work from home option. Depending on team that you work for, they can be liberal when allowing work from home options. This is good because the actual work environment is incredibly toxic, see below. Cons Healthfirst had the most toxic work environment that I have witnessed in my career. First, I should note that I was involved in the hiring process and my superiors openly stated that they were adverse to hiring anyone that was 1.) Older 2.) Not \"Americanized\" (their words, not mine). Be mindful of these two factors when applying to Healthfirst. In addition, I was subjected to racism (I was told by a co-worker that he'd always be better than me because he had \"white skin\"), I witnessed blatant sexism (a female co-worker that had bought a Nintendo Switch was told \"no wonder you're single!\" by my BOSS because she's a woman that plays video games). When I went to my superiors or told HR about the environment, I was either called a liar or virtually ignored. I waited a month to meet with HR (the HR office is primarily based in Florida, so expecting anything to happen in the NY office is an exercise in futility). This company has also has a very turnover rate. I was the second most tenured member of my department that wasn't management. The department has ~15 people that aren't management. I ended up quitting without future employment lined up I found the environment so toxic. Working at Healthfirst was one of the most difficult periods of my life.", "rating": 1, "pros": "The big selling point of Healthfirst is its work from home option. Depending on team that you work for, they can be liberal when allowing work from home options. This is good because the actual work environment is incredibly toxic, see below.", "cons": "Healthfirst had the most toxic work environment that I have witnessed in my career. First, I should note that I was involved in the hiring process and my superiors openly stated that they were adverse to hiring anyone that was 1.) Older 2.) Not \"Americanized\" (their words, not mine). Be mindful of these two factors when applying to Healthfirst.", "advice": null}, {"title": "Don't Expect Much Support To Succeed Here", "text": "Pros Everyone I worked with was generally friendly which can be pro and a con. Cons When you really need help, don't expect to receive much from those that claim to want to help you. Training to do you job well is severely lacking. You have to fend for yourself to get the answers you need and often the answers you receive for others or conflicting. As I mentioned in the \"Pros\" section, everyone is friendly and this can also lead to misunderstandings as to how well you are doing. They are friendly from when you start to the minute they let you go. I found myself asking \"what just happened\" as I was walking out the door. This company needs to do better in their training, as well as communication between departments. I would recommend looking at their competitors before applying for a job at HealthFirst. Advice to Management Get organized, improve training, and make sure your employees get a fair start so that they have an equal opportunity to succeed compared to their peers.", "rating": 1, "pros": "Everyone I worked with was generally friendly which can be pro and a con.", "cons": "When you really need help, don't expect to receive much from those that claim to want to help you. Training to do you job well is severely lacking. You have to fend for yourself to get the answers you need and often the answers you receive for others or conflicting. As I mentioned in the \"Pros\" section, everyone is friendly and this can also lead to misunderstandings as to how well you are doing. They are friendly from when you start to the minute they let you go. I found myself asking \"what just happened\" as I was walking out the door. This company needs to do better in their training, as well as communication between departments. I would recommend looking at their competitors before applying for a job at HealthFirst.", "advice": "Get organized, improve training, and make sure your employees get a fair start so that they have an equal opportunity to succeed compared to their peers."}, {"title": "Member Services Department", "text": "Pros Management tries to work with employees in order to find a good work/life balance. Based on you performance you can qualify for a 3% salary increase and bonus. The corporate offices building is beautiful and next to the Oculus mall in Manhattan. Cons Long commute to get to the different offices throughout NYC and LI. Billing and enrollment department have a lot of issues working together making your job difficult and sometimes frustrated Advice to Management Have a better training program for people that are totally new to the industry and fix the issue with billing and enrollment.", "rating": 5, "pros": "Management tries to work with employees in order to find a good work/life balance.", "cons": "Long commute to get to the different offices throughout NYC and LI.", "advice": "Have a better training program for people that are totally new to the industry and fix the issue with billing and enrollment."}, {"title": "Great job if you are strong enough to handle it", "text": "Pros Good life work balance Company actually cares about employees Great benefits Quarterly incentive Great schedules Holidays off Overtime available Ability to move within the company Cons One gets the feeling that upper management would be a lot more forgiving than middle management. Many changes that do not have advanced notice. Needs to have more in depth training. Advice to Management Watch what middle management does. Often instructions are not clear or contradictory.", "rating": 5, "pros": "Good life work balance", "cons": "One gets the feeling that upper management would be a lot more forgiving than middle management.", "advice": "Watch what middle management does. Often instructions are not clear or contradictory."}, {"title": "Good short-term job, not career", "text": "Pros Excellent co-workers, relaxed but hard-working culture, good work-life balance Cons Failing at agile, poor rating system Advice to Management Agile - more training needed for managers and those implementing the Scaled Agile Framework. The company could benefit greatly by following agile vs waterfall. Upper management is pushing this goal, but it's getting lost in the middle, holding on to too many of the old ways, keeping waterfall processes in place that slow down the process with no benefit. The result, a disorganized mess, that results in higher risk of failure. Agile can succeed, if it's fully embraced. Rating system - the bell curve! On the surface, the bell curve system appears to be a great way to implement \"pay for performance\". Management and high performers should appreciate this system, where average and poor performers would not. Except, too often, as in the case of Healthfirst, it rewards mediocre performance, and stagnates high performers. Scenario, 10 employees, 2 get rated as high performers because, it's a curve. The following year, those 2 are still performing high, as are 2 others. Are you going to lower the rating on the employees who previously received the high rating, and rate the new high performers high? Or are the new high performers out of luck, because the others got there first. This system demotivates high performers while retaining mediocre/poor employees, resulting in poor retention, at least for high performers. Mediocre and poor employees have a good chance of making the the average rating, simply based on odds. Unfortunately, high performers also have a good chance at making the average, also based on odds.", "rating": 5, "pros": "Excellent co-workers, relaxed but hard-working culture, good work-life balance", "cons": "Failing at agile, poor rating system", "advice": "Agile - more training needed for managers and those implementing the Scaled Agile Framework. The company could benefit greatly by following agile vs waterfall. Upper management is pushing this goal, but it's getting lost in the middle, holding on to too many of the old ways, keeping waterfall processes in place that slow down the process with no benefit. The result, a disorganized mess, that results in higher risk of failure. Agile can succeed, if it's fully embraced."}, {"title": "Medical Records Coordinator", "text": "Pros Extraordinary company culture when it's actually being followed and implemented by management within departments. Cons Company culture drivers are not implemented through management and there is a lack of effective communication through management and staff Advice to Management Active listen and communicate without judgement without negative and condescending comments to develop safe open line of communication so leadership and be effective and work can be done more efficiently.", "rating": 3, "pros": "Extraordinary company culture when it's actually being followed and implemented by management within departments.", "cons": "Company culture drivers are not implemented through management and there is a lack of effective communication through management and staff", "advice": "Active listen and communicate without judgement without negative and condescending comments to develop safe open line of communication so leadership and be effective and work can be done more efficiently."}, {"title": "Claims Examiner", "text": "Pros Telecommute People Opportunities Culture Climate Cons Have to come in city twice a month incremental raises", "rating": 5, "pros": "Telecommute People Opportunities Culture Climate", "cons": "Have to come in city twice a month", "advice": null}, {"title": "Team Lead - Member Services", "text": "Pros Work with a good group of smart, intelligent & knowledgeable Team Leads. Cons Management feels they are all powerful and whatever they say goes. They will ask for ideas to shoot them down without truly taking it under consideration. They lack showing appreciation. Advice to Management Truly listen to your staff!", "rating": 3, "pros": "Work with a good group of smart, intelligent & knowledgeable Team Leads.", "cons": "Management feels they are all powerful and whatever they say goes. They will ask for ideas to shoot them down without truly taking it under consideration. They lack showing appreciation.", "advice": "Truly listen to your staff!"}, {"title": "A decent company. Tries to do right by its employees, even if it doesn't always succeed...", "text": "Pros Good work/life balance, focus on cultivating positive culture, fair compensation. Cons Execs can be slow to discipline poor managers", "rating": 5, "pros": "Good work/life balance, focus on cultivating positive culture, fair compensation.", "cons": "Execs can be slow to discipline poor managers", "advice": null}, {"title": "IT staff", "text": "Pros Great, hardworking people you work with and they care. They are knowledgeable and willing to work with one another. Cons Read every review. Same tbeme...management is fascist! Do what they say, not what they do. Only they know what is right. Advice to Management Read Jack Welch's book and take it to heart.", "rating": 3, "pros": "Great, hardworking people you work with and they care. They are knowledgeable and willing to work with one another.", "cons": "Read every review. Same tbeme...management is fascist! Do what they say, not what they do. Only they know what is right.", "advice": "Read Jack Welch's book and take it to heart."}, {"title": "HF review", "text": "Pros No room for growth, dishonest, oppressive work environment, disregard for employee value. No appreciation from management. Cons Set up for failures. Management is not knowledgeable.", "rating": 1, "pros": "No room for growth, dishonest, oppressive work environment, disregard for employee value. No appreciation from management.", "cons": "Set up for failures. Management is not knowledgeable.", "advice": null}, {"title": "Good place to cruise", "text": "Pros Big company with opportunities to jump to other departments. Still gives out bonuses considering we're talking about health care insurance. Cons Performance review is based on a bell-curve, and people come and go too quickly. Advice to Management Quit the politics and listen to your employees.", "rating": 5, "pros": "Big company with opportunities to jump to other departments.", "cons": "Performance review is based on a bell-curve, and people come and go too quickly.", "advice": "Quit the politics and listen to your employees."}, {"title": "Business Analyst", "text": "Pros Flexible, enjoyable coworkers, understanding supervisors, they made attempts at improving culture Cons Sometimes could seem somewhat disjointed at times. Often times projects involve cross-departmental cooperation, and things constantly fall through the cracks when the cohesiveness of the project teams just isn't solid. Advice to Management Keep working on culture, try to improve cohesiveness of projects involving many different departments. It doesn't hurt to impose constructive consequences on departments that aren't pulling their weight on projects, or are falling behind in the process.", "rating": 5, "pros": "Flexible, enjoyable coworkers, understanding supervisors, they made attempts at improving culture", "cons": "Sometimes could seem somewhat disjointed at times. Often times projects involve cross-departmental cooperation, and things constantly fall through the cracks when the cohesiveness of the project teams just isn't solid.", "advice": "Keep working on culture, try to improve cohesiveness of projects involving many different departments. It doesn't hurt to impose constructive consequences on departments that aren't pulling their weight on projects, or are falling behind in the process."}, {"title": "N/A", "text": "Pros Friendly work environment between colleagues Cons Systemic issues that should not occur", "rating": 3, "pros": "Friendly work environment between colleagues", "cons": "Systemic issues that should not occur", "advice": null}, {"title": "Finance Team", "text": "Pros - Good Salary - The low level staffs are good people - The company was created for a good cause but now it is all about making money instead of providing healthcare coverage to low income and old individuals New York Cons - Unprofessional - Finance team is lack of smart individuals - - They feel threaten by smart staffs --- they over-protective of their work - Management is not knowledgeable - Many upper management staffs are sexist and the CEO has no clue - HR is incompetent - Sexual harassment happened and no investigation took place Advice to Management - Member hospitals or state needs to investigate - Member and Non member hospitals are clueless with their deals with Healthfirst - Healthfirst does not have their interest when it comes to maximize profit or revenue issue or expense issues", "rating": 1, "pros": "- Good Salary", "cons": "- Unprofessional", "advice": "- Member hospitals or state needs to investigate"}, {"title": "Good Company to work for.", "text": "Pros Benefits. PTO hours, Good People. A lot of work but worth it. Cons Management treats you like you're just a number and its really hard to get PTO approved. No shift bids available. Advice to Management If you want people to succeed then provide them with the proper tools and training.", "rating": 3, "pros": "Benefits. PTO hours, Good People. A lot of work but worth it.", "cons": "Management treats you like you're just a number and its really hard to get PTO approved. No shift bids available.", "advice": "If you want people to succeed then provide them with the proper tools and training."}, {"title": "Labels stick", "text": "Pros If your boss allows it, WFH option available. Most of middle management is kind. Dressing well and kissing up pays off. Upper management seem to genuinely care about phone reps. Cons No teamwork. Cannot get a response from people you've previously assisted. Metrics for advancement/pay raise doesn't account for duties outside of your regular work. You can beg for training to be better in your role and not get it, but they'll come down hard on you if you mess up. Unashamed gossip on all levels and everyone gets an unshakable label; seen it affect people's wallet. Advice to Management Learn about discretion.", "rating": 3, "pros": "If your boss allows it, WFH option available. Most of middle management is kind. Dressing well and kissing up pays off. Upper management seem to genuinely care about phone reps.", "cons": "No teamwork. Cannot get a response from people you've previously assisted.", "advice": "Learn about discretion."}, {"title": "Change Is Good", "text": "Pros Major transformation and change management to build the future Cons The pace of change is sometimes too rapid Advice to Management Take time to explain what and why and how it will impact individuals", "rating": 5, "pros": "Major transformation and change management to build the future", "cons": "The pace of change is sometimes too rapid", "advice": "Take time to explain what and why and how it will impact individuals"}, {"title": "social worker", "text": "Pros salary, benefits, 401K, and employees Cons Not transparent, and don't really care about the employees idea. Advice to Management Constant change in not necessary, if its not broke don't fix it.", "rating": 3, "pros": "salary, benefits, 401K, and employees", "cons": "Not transparent, and don't really care about the employees idea.", "advice": "Constant change in not necessary, if its not broke don't fix it."}, {"title": "Healthfirst Culture is more like a \"Cult", "text": "Pros I can't think of any. I was warned about this place and should have listened. If you're considering a position here...DON'T!! Cons Management has no clue of what they're doing. If you don't adapt to the \"culture\" you might as well have a target on your back. Once they don't like you, they scam and scheme to get you out. HR is a complete and utter joke! People that shop online all day gets promotions and people that ask for training and questions get fired...go figure! Advice to Management Clean house! You have so many mangers there that don't have a clue. They were only promoted based on who they know or because they've been with the company since inception. Too much nepotism and not enough knowledge. Train your employees! If not, stop blaming them for there short comings if you're not giving them the tools they need to succeed.", "rating": 1, "pros": "I can't think of any. I was warned about this place and should have listened. If you're considering a position here...DON'T!!", "cons": "Management has no clue of what they're doing. If you don't adapt to the \"culture\" you might as well have a target on your back. Once they don't like you, they scam and scheme to get you out. HR is a complete and utter joke! People that shop online all day gets promotions and people that ask for training and questions get fired...go figure!", "advice": "Clean house! You have so many mangers there that don't have a clue. They were only promoted based on who they know or because they've been with the company since inception. Too much nepotism and not enough knowledge. Train your employees! If not, stop blaming them for there short comings if you're not giving them the tools they need to succeed."}, {"title": "Administrative assistant", "text": "Pros Great place to work, good benefits, transparent, and organize, friendly Cons Overwhelming at time, in case you are new takes a while yo be used to the diversity Advice to Management Continue to motivate", "rating": 5, "pros": "Great place to work, good benefits, transparent, and organize, friendly", "cons": "Overwhelming at time, in case you are new takes a while yo be used to the diversity", "advice": "Continue to motivate"}, {"title": "Care Manager", "text": "Pros PTO, Salary, Benefits, Work from home Cons Poor management. No support from management", "rating": 3, "pros": "PTO, Salary, Benefits, Work from home", "cons": "Poor management. No support from management", "advice": null}, {"title": "Nurse", "text": "Pros You are able to Work from home Cons Reclassification of employees seems unfair Advice to Management Look internally first", "rating": 5, "pros": "You are able to Work from home", "cons": "Reclassification of employees seems unfair", "advice": "Look internally first"}, {"title": "work culture", "text": "Pros Have to fight your way up to grow Cons the trailblazer not helping much Advice to Management Recognize hard working people", "rating": 3, "pros": "Have to fight your way up to grow", "cons": "the trailblazer not helping much", "advice": "Recognize hard working people"}, {"title": "Company culture equates to fear", "text": "Pros One hour lunch break and coffee machines on each floor. Some people were very kind, but their kindness was very secretive. Cons Many in management were clearly cut-throat. They care about numbers only, and not treating people with dignity and respect. Racism is rampant with some employees and some management, and thinly veiled at that. Advice to Management Give all tiers of employees a chance to anonymously give feedback about who they work with and who they work for. The culture in reality is much different than the vision. There is a very wide income gap between lower level employees and the six figure income upper level employees earn on top of their bonuses.", "rating": 1, "pros": "One hour lunch break and coffee machines on each floor. Some people were very kind, but their kindness was very secretive.", "cons": "Many in management were clearly cut-throat. They care about numbers only, and not treating people with dignity and respect.", "advice": "Give all tiers of employees a chance to anonymously give feedback about who they work with and who they work for. The culture in reality is much different than the vision. There is a very wide income gap between lower level employees and the six figure income upper level employees earn on top of their bonuses."}, {"title": "Sometimes Change is not all good", "text": "Pros Benefits,Compensation and some sense of work life balance from some managers Cons There are some consultants turned executives that have no clue of what a good employee is, consultants churn numbers .. Great employees don't leave a job they leave horrible managers Advice to Management Stop all the \"cultural changes\" the employees didn't ask for \"trailblazing\" they bought you this far.. or did you forget.. get in touch with your staff .. listen .. stop thinking its old vs new", "rating": 3, "pros": "Benefits,Compensation and some sense of work life balance from some managers", "cons": "There are some consultants turned executives that have no clue of what a good employee is, consultants churn numbers .. Great employees don't leave a job they leave horrible managers", "advice": "Stop all the \"cultural changes\" the employees didn't ask for \"trailblazing\" they bought you this far.. or did you forget.. get in touch with your staff .. listen .. stop thinking its old vs new"}, {"title": "Love to cheat Hospitals and Doctors", "text": "Pros Reasonable salary, good chance for advancement Cons HEAVY Pressure to deny claims that are legitimate", "rating": 1, "pros": "Reasonable salary, good chance for advancement", "cons": "HEAVY Pressure to deny claims that are legitimate", "advice": null}, {"title": "Management should value their direct reports opinion.", "text": "Pros Work life balance within the organization. Cons No room for growth within the organization.", "rating": 1, "pros": "Work life balance within the organization.", "cons": "No room for growth within the organization.", "advice": null}, {"title": "Planning", "text": "Pros Great Mission, dedicated rank & file Cons Management plans poorly and over estimates its ability to accomplish projects", "rating": 3, "pros": "Great Mission, dedicated rank & file", "cons": "Management plans poorly and over estimates its ability to accomplish projects", "advice": null}, {"title": "Managing Consultant Quality", "text": "Pros Employee moral is one of the best, people are positive, helpful and committed. Flexibility to work remote 1 day per week. Cons I cannot think of any", "rating": 5, "pros": "Employee moral is one of the best, people are positive, helpful and committed. Flexibility to work remote 1 day per week.", "cons": "I cannot think of any", "advice": null}, {"title": "Data Analyst", "text": "Pros Good performance reviews telecommute available Cons Management react poorly to performance reviews", "rating": 3, "pros": "Good performance reviews telecommute available", "cons": "Management react poorly to performance reviews", "advice": null}, {"title": "Middle of the road", "text": "Pros Telecommuting available in some departments Cons The employees with the most knowledge go unappreciated Advice to Management It's nothing wrong with getting training for leadership it can only benefit yourself, your staff and the organization as a whole", "rating": 3, "pros": "Telecommuting available in some departments", "cons": "The employees with the most knowledge go unappreciated", "advice": "It's nothing wrong with getting training for leadership it can only benefit yourself, your staff and the organization as a whole"}, {"title": "Terrible performance evaluation process", "text": "Pros Excellent culture drivers but leadership does not lead by example and average benefits. Provides professional development if within budget. Also success sharing. Cons Managers will place you in one category for your performance evaluation but higher leadership will force manager to place employees into different categories without understanding their performance - bell curve. Advice to Management Take care of your people", "rating": 1, "pros": "Excellent culture drivers but leadership does not lead by example and average benefits. Provides professional development if within budget. Also success sharing.", "cons": "Managers will place you in one category for your performance evaluation but higher leadership will force manager to place employees into different categories without understanding their performance - bell curve.", "advice": "Take care of your people"}, {"title": "A great organization focused on driving corporate culture and moving in the right direction...", "text": "Pros Diverse Leadership Experience Innovative Vision Industry Leader, Ranked #1 for Quality in NYC Opportunities for Career Development and Advancement Cons Expectations and Industry changes can often out pace Business Transformation efforts. Advice to Management Keep at it....", "rating": 5, "pros": "Diverse Leadership Experience", "cons": "Expectations and Industry changes can often out pace Business Transformation efforts.", "advice": "Keep at it...."}, {"title": "Good company. Good benefits", "text": "Pros Job safety Good benefits Understanding supervisors Cons Lots of changes Senior management unrealistic Advice to Management Too many changes, very confusing at times", "rating": 5, "pros": "Job safety", "cons": "Lots of changes", "advice": "Too many changes, very confusing at times"}, {"title": "Good Stepping stone company", "text": "Pros In the city, great benefits, 401K match. Met some real nice people I should've kept in better contact with. I worked here for about 5-6yrs so I learned a lot and gained a lot of knowledge Cons Overworked and under-appreciated, supervisor, manager or director may take advantage of you. Pay wasn't a lot. I worked my butt off. Stayed late. And even before they offered overtime I stayed late getting work done. And only got a 2% percent raise Advice to Management Take good care of your staff so that they will want to come into work, want to stay within the dept or want to continue working at this company.", "rating": 3, "pros": "In the city, great benefits, 401K match. Met some real nice people I should've kept in better contact with. I worked here for about 5-6yrs so I learned a lot and gained a lot of knowledge", "cons": "Overworked and under-appreciated, supervisor, manager or director may take advantage of you. Pay wasn't a lot. I worked my butt off. Stayed late. And even before they offered overtime I stayed late getting work done. And only got a 2% percent raise", "advice": "Take good care of your staff so that they will want to come into work, want to stay within the dept or want to continue working at this company."}, {"title": "Medicare sales", "text": "Pros great company to work for very good benefit and work ethics, the keep their employee for a long time and the management team its very helpful. Cons A LOT STRESS IF YOU HAVE SALES POSITION AND ALSO AND SOMETIMES WORK EVENING AND WEEKEND TOO MUCH AUDITING AND SECRET SHOPPERS.", "rating": 5, "pros": "great company to work for very good benefit and work ethics, the keep their employee for a long time and the management team its very helpful.", "cons": "A LOT STRESS IF YOU HAVE SALES POSITION AND ALSO AND SOMETIMES WORK EVENING AND WEEKEND TOO MUCH AUDITING AND SECRET SHOPPERS.", "advice": null}, {"title": "Member Services", "text": "Pros Work at home is a good option Cons Overworked, underpaid, unappreciated.The company has strict guidelines to follow with no consistency. Quality department makes it difficult to pass your calls. The company only focuses on their members not their employees. You are just a number and its proven with their huge turn over rate. They hire from the outside so your supervisor or manager do not have your back. Advice to Management No", "rating": 1, "pros": "Work at home is a good option", "cons": "Overworked, underpaid, unappreciated.The company has strict guidelines to follow with no consistency. Quality department makes it difficult to pass your calls. The company only focuses on their members not their employees. You are just a number and its proven with their huge turn over rate. They hire from the outside so your supervisor or manager do not have your back.", "advice": "No"}, {"title": "Great Place to Work", "text": "Pros Fairness and competitive atmosphere. Massive opportunity for anyone willing to work hard. Cons Gets hectic. The pace can be intimidating for those unfamiliar with the industry. Advice to Management Keep breaking down the walls", "rating": 5, "pros": "Fairness and competitive atmosphere. Massive opportunity for anyone willing to work hard.", "cons": "Gets hectic. The pace can be intimidating for those unfamiliar with the industry.", "advice": "Keep breaking down the walls"}, {"title": "Overall review", "text": "Pros Good benefits, good-looking office, work from home opportunities Cons too much bureaucracy, poor leadership, depending on the department but mostly throughout the company executive teams do not care about regular employees, it is hard to move up. HR is not for employees but more for the company interests. People are title-driven.", "rating": 3, "pros": "Good benefits, good-looking office, work from home opportunities", "cons": "too much bureaucracy, poor leadership, depending on the department but mostly throughout the company executive teams do not care about regular employees, it is hard to move up. HR is not for employees but more for the company interests. People are title-driven.", "advice": null}, {"title": "Disorganized. Many leaders have poor management skills.", "text": "Pros There are some highly talented and motivated people at this organization. Cons A lot of management lacks strong (or any) leadership skills. To be fair, the company IS trying to develop it's leaders. This can be a slow and difficult process for an organization that has grown so quickly, but I think there is a reluctance to remove incompetent managers. Very poor planning, at least in my department, which causes unnecessary and often superfluous work. The company is trying to encourage good planning practices, and I'm sure this varies by department.", "rating": 3, "pros": "There are some highly talented and motivated people at this organization.", "cons": "A lot of management lacks strong (or any) leadership skills. To be fair, the company IS trying to develop it's leaders. This can be a slow and difficult process for an organization that has grown so quickly, but I think there is a reluctance to remove incompetent managers.", "advice": null}, {"title": "account manager", "text": "Pros Leadership is great they'll listen to you , but don't go with complaints bring solutions. Culture is amazing and teamwork is the best Cons late technology, no much value outside of health care Advice to Management dont take soooo long to make a decision.", "rating": 5, "pros": "Leadership is great they'll listen to you , but don't go with complaints bring solutions. Culture is amazing and teamwork is the best", "cons": "late technology, no much value outside of health care", "advice": "dont take soooo long to make a decision."}, {"title": "Horrible..", "text": "Pros Free coffee, beautiful office, helping people. Cons Managers & Directors in TA & OC are never there and only concerned with saving themselves. Advice to Management Pay attention to your employees, instead of pointing a finger at them realize you are the problem.", "rating": 1, "pros": "Free coffee, beautiful office, helping people.", "cons": "Managers & Directors in TA & OC are never there and only concerned with saving themselves.", "advice": "Pay attention to your employees, instead of pointing a finger at them realize you are the problem."}, {"title": "Medicare Sales", "text": "Pros The company is well organized, the medicare advantage plans was easy to sell due to large age in membership Cons They sent out auditors to track down where you are. Vacations are limited to 2 weeks max. Advice to Management Keep doing the great job", "rating": 5, "pros": "The company is well organized, the medicare advantage plans was easy to sell due to large age in membership", "cons": "They sent out auditors to track down where you are. Vacations are limited to 2 weeks max.", "advice": "Keep doing the great job"}, {"title": "HARP Clinical Manager", "text": "Pros Competitive salary and good training. The program is new with room for advancement. Adequate paid time off. Working from home is a huge plus. Cons Management is inflexible, supervisors can be verbally abusive. Company has different time off and work rules for management. Management is a tight knit group who looks out for each other at the expensive of its workers. Advice to Management Be fair and consistent. Be more flexible and understanding of your workers we are not machines who process data.", "rating": 3, "pros": "Competitive salary and good training. The program is new with room for advancement. Adequate paid time off. Working from home is a huge plus.", "cons": "Management is inflexible, supervisors can be verbally abusive. Company has different time off and work rules for management. Management is a tight knit group who looks out for each other at the expensive of its workers.", "advice": "Be fair and consistent. Be more flexible and understanding of your workers we are not machines who process data."}, {"title": "Financial analyst", "text": "Pros Interesting project and work..... smart people, Nice people Cons Work Life Balance, no growth", "rating": 3, "pros": "Interesting project and work.....", "cons": "Work Life Balance, no growth", "advice": null}, {"title": "Assistant Director", "text": "Pros The onboarding is the best part. Everything is a let down from there. Cons The company is taking advantage of the chaos created by the affordable care act to exploit sick, poor people in the \"markeplace\" in order for its own 1 percent (at the very top) to make a huge profit. Nothing else really matters, which is why a small group of incompetent, political \"yes\" people -- directly under executive management -- yield at so much power. Advice to Management Keep doing exactly what you are doing, because it seems the great majority of people working at HF (middle management and below) are actually very motivated and cause driven people. You've got them running on such a fast gerbil wheel, they can't see the smoke and mirrors and don't realize the sole purpose for the company's existence is so that the CEO can continue to gross $1 million + annually and so that others at the very top (executive management) can continue to line their pockets. But hey, as long as the numbers pan out, and this opportunity to exploit the sick and the poor exists, keep the party going folks. What a disappointment.", "rating": 1, "pros": "The onboarding is the best part. Everything is a let down from there.", "cons": "The company is taking advantage of the chaos created by the affordable care act to exploit sick, poor people in the \"markeplace\" in order for its own 1 percent (at the very top) to make a huge profit. Nothing else really matters, which is why a small group of incompetent, political \"yes\" people -- directly under executive management -- yield at so much power.", "advice": "Keep doing exactly what you are doing, because it seems the great majority of people working at HF (middle management and below) are actually very motivated and cause driven people. You've got them running on such a fast gerbil wheel, they can't see the smoke and mirrors and don't realize the sole purpose for the company's existence is so that the CEO can continue to gross $1 million + annually and so that others at the very top (executive management) can continue to line their pockets. But hey, as long as the numbers pan out, and this opportunity to exploit the sick and the poor exists, keep the party going folks. What a disappointment."}, {"title": "MSR medicare", "text": "Pros well they do have pretty good benefits PTO , the company will match your 401k Cons they do not accommodate your schedule if your trying to further your education and work here find somewhere else because you will have to work around your schedule and if you have kids oh definitely no they will not compromise your schedule at all and you will be penalized for everything they are very strict on attendance and do not care if you were in car accident or anything.. Advice to Management none", "rating": 3, "pros": "well they do have pretty good benefits PTO , the company will match your 401k", "cons": "they do not accommodate your schedule if your trying to further your education and work here find somewhere else because you will have to work around your schedule and if you have kids oh definitely no they will not compromise your schedule at all and you will be penalized for everything they are very strict on attendance and do not care if you were in car accident or anything..", "advice": "none"}, {"title": "Current experience", "text": "Pros Intensive training. Room for growth. Cons half hour lunch break. Short bathroom breaks.", "rating": 5, "pros": "Intensive training. Room for growth.", "cons": "half hour lunch break. Short bathroom breaks.", "advice": null}, {"title": "A great place for managers/Sr. staff, but that's about it.", "text": "Pros - I was able to pay my bills Cons - Lack of support from managers/supervisors - An environment where assigning blame was more important than solving issues - No room for growth in my position - Overworked, underpaid, and undervalued Advice to Management Expecting a team of 3-4 people to handle the responsibilities of a team 3 times their size is a sure sign that you have no idea what your team handles.", "rating": 3, "pros": "- I was able to pay my bills", "cons": "- Lack of support from managers/supervisors", "advice": "Expecting a team of 3-4 people to handle the responsibilities of a team 3 times their size is a sure sign that you have no idea what your team handles."}, {"title": "Great start", "text": "Pros I love it here my role is fulfilling and I enjoy my time Cons Can't Think of anything", "rating": 3, "pros": "I love it here my role is fulfilling and I enjoy my time", "cons": "Can't Think of anything", "advice": null}, {"title": "Overall Good Intentioned- Management has old world views", "text": "Pros Great benefits and mobility. I enjoyed my co-workers and learned a lot. Employees in any position are willing to talk to you. Cons They don't always plan for the long term. Often I learned, \"what not to do as a manager.\" People are afraid, to be honest with their manager or higher up if an idea is not strong, even if it can help the company. I have heard a VP threaten his team's job if they don't start working the way he works.", "rating": 3, "pros": "Great benefits and mobility. I enjoyed my co-workers and learned a lot. Employees in any position are willing to talk to you.", "cons": "They don't always plan for the long term. Often I learned, \"what not to do as a manager.\" People are afraid, to be honest with their manager or higher up if an idea is not strong, even if it can help the company. I have heard a VP threaten his team's job if they don't start working the way he works.", "advice": null}, {"title": "Supervisor member services", "text": "Pros 1) more room to grow within the company; 2) one hour lunch break; 3) organized system (member service department only) Cons 1) micro management; 2) office politics ; 3) low salary Advice to Management Higher salary", "rating": 5, "pros": "1) more room to grow within the company;", "cons": "1) micro management;", "advice": "Higher salary"}, {"title": "Mbr services representive", "text": "Pros None what so ever sorry but not sorry Cons Worst company to work for Favoritism will prevent you to get a promotion Advice to Management stop the favoritism", "rating": 1, "pros": "None what so ever", "cons": "Worst company to work for", "advice": "stop the favoritism"}, {"title": "Anonymous", "text": "Pros nice office, nice location, good values, mission, business model, and good intentions on culture change Cons poor planning and execution of projects; lots of fear, intimidation and selfish behavior; silos; poor leadership, management, employee development and employee relations; poor work life balance Advice to Management CEO clearly is passionate about customer base and putting customers first however, isn't passionate about employees and making the company a great place to work.", "rating": 1, "pros": "nice office, nice location, good values, mission, business model, and good intentions on culture change", "cons": "poor planning and execution of projects; lots of fear, intimidation and selfish behavior; silos; poor leadership, management, employee development and employee relations; poor work life balance", "advice": "CEO clearly is passionate about customer base and putting customers first however, isn't passionate about employees and making the company a great place to work."}, {"title": "Health Care Professionals", "text": "Pros Growing company; many opportunities; good work-life balance Cons Ever changing management due to growth.", "rating": 5, "pros": "Growing company; many opportunities; good work-life balance", "cons": "Ever changing management due to growth.", "advice": null}, {"title": "Don't sweat it, just a job", "text": "Pros - No probation period at hire - Good benefits - Recognition for ideas Cons - Relationships matters more than competency - Unclear career path - Lack of recognition for implementing ideas - Corporate does not have a standard for management style, each department varies in culture & productivity. Advice to Management Anyone can open their mouth, but only a few can make things happen.", "rating": 3, "pros": "- No probation period at hire", "cons": "- Relationships matters more than competency", "advice": "Anyone can open their mouth, but only a few can make things happen."}, {"title": "Leaders never learn so employees turnover or suffer trough it", "text": "Pros work-life balance is decent, mostly a 8:30 - 5 schedule (other than if you're in departments during second half of the year with pressure to go live on application changes, even if the systems aren't good or ready (especially BT(now called SI) and IT roles)), co-workers are intelligent and friendly, but beware of family and friends within the company as there is a culture of finger pointing downward when the leaders who cause the problems are excused. I stay because their benefits are good, like 4+ weeks PTO, 6% 401k matching, and easy work to do (you just need a thick skin to work here as the VPs and SVPs are ready to throw anyone under the bus when they don't know what to do - many of the newer SVPs (1-3 years new) don't have the background or skills needed to do the role they have accepted. If you are intelligent and can deal with stupidity on a regular basis from your leadership, it's a great place to work. Oh and don't count on receiving any bonus in 2017 or 2018 as the company's costs have skyrocketed while their enrollment has stagnated and revenues decreased. Cons The leadership cannot be trusted, even the employee surveys year after year say it is the #1 issue since 2013. Don't be fooled by their new \"Trailblazer\" culture terminology as they spend more money on naming things than actually trying to solve real issues. They are beginning to outsource everything to consultants in order to increase their temporary costs as tax benefits, while the best workers have/are leaving or being fired because they don't agree with doing the wrong thing any longer. There has been a 40% turnover year over year for the past 5+ years and a 60% turnover in the newly established Business Transformation (SI) department. Advice to Management If you really want to be the pre-eminent healthplan in our market, fire incompetent SVPs who cannot or will not take the good advice of those who have the experience and skills they lack. Stop wasting 10's of millions of dollars per year on consultants who actually know what they are talking about and say the same things year-after-year and listen to the employees who actually stay because they want to see the company succeed. Stop promoting men and women who sleep with their superiors - it's disgusting to be around and makes the departments feel like they have no choice but to feel bad, unless one wants to lose their job. I’ve seen too many people fired for whistleblowing rather than performance-based. HR is a joke - well, actually, I guess one could say the HR department is good because you don't see much press on the CMS negative findings or the payments made to employees who go on medical leave or are let go from the abuse received from managers. HR is great at their job – covering up anything that might hurt the organization, but is horrible at balancing that with retaining talent – even HR has a 40%+ turnover rate.", "rating": 1, "pros": "work-life balance is decent, mostly a 8:30 - 5 schedule (other than if you're in departments during second half of the year with pressure to go live on application changes, even if the systems aren't good or ready (especially BT(now called SI) and IT roles)), co-workers are intelligent and friendly, but beware of family and friends within the company as there is a culture of finger pointing downward when the leaders who cause the problems are excused. I stay because their benefits are good, like 4+ weeks PTO, 6% 401k matching, and easy work to do (you just need a thick skin to work here as the VPs and SVPs are ready to throw anyone under the bus when they don't know what to do - many of the newer SVPs (1-3 years new) don't have the background or skills needed to do the role they have accepted. If you are intelligent and can deal with stupidity on a regular basis from your leadership, it's a great place to work. Oh and don't count on receiving any bonus in 2017 or 2018 as the company's costs have skyrocketed while their enrollment has stagnated and revenues decreased.", "cons": "The leadership cannot be trusted, even the employee surveys year after year say it is the #1 issue since 2013. Don't be fooled by their new \"Trailblazer\" culture terminology as they spend more money on naming things than actually trying to solve real issues. They are beginning to outsource everything to consultants in order to increase their temporary costs as tax benefits, while the best workers have/are leaving or being fired because they don't agree with doing the wrong thing any longer. There has been a 40% turnover year over year for the past 5+ years and a 60% turnover in the newly established Business Transformation (SI) department.", "advice": "If you really want to be the pre-eminent healthplan in our market, fire incompetent SVPs who cannot or will not take the good advice of those who have the experience and skills they lack. Stop wasting 10's of millions of dollars per year on consultants who actually know what they are talking about and say the same things year-after-year and listen to the employees who actually stay because they want to see the company succeed. Stop promoting men and women who sleep with their superiors - it's disgusting to be around and makes the departments feel like they have no choice but to feel bad, unless one wants to lose their job. I’ve seen too many people fired for whistleblowing rather than performance-based. HR is a joke - well, actually, I guess one could say the HR department is good because you don't see much press on the CMS negative findings or the payments made to employees who go on medical leave or are let go from the abuse received from managers. HR is great at their job – covering up anything that might hurt the organization, but is horrible at balancing that with retaining talent – even HR has a 40%+ turnover rate."}, {"title": "Company itself was ok", "text": "Pros NIce environment, coworkers were nice. The salary was decent. Cons I had issues with my direct manager. It turned out I wasn't the only one who complained about her. The director liked her so the way she treated people didn't matter to him.", "rating": 3, "pros": "NIce environment, coworkers were nice. The salary was decent.", "cons": "I had issues with my direct manager. It turned out I wasn't the only one who complained about her. The director liked her so the way she treated people didn't matter to him.", "advice": null}, {"title": "An Experience", "text": "Pros Big on work life balance. Cons People are hired for their experience but not allowed to use it. Very poor senior leadership Advice to Management Stop looking at team members as a the problem. The problem is Senior Leadership - AVP and above.", "rating": 1, "pros": "Big on work life balance.", "cons": "People are hired for their experience but not allowed to use it. Very poor senior leadership", "advice": "Stop looking at team members as a the problem. The problem is Senior Leadership - AVP and above."}, {"title": "Love it", "text": "Pros I personally love being able to work from home. I believe the pay is great and the fact that there is no need to spend money on commute or lunch is a great advantage for me. Your always very busy with the workload and it makes your day fly by. Have been here less than a year but love it so far Cons Too many changes very quickly and at times management is not on the same page Advice to Management Wish change was not made as often but I guess it needs to be done. Maybe better communication amongst department", "rating": 5, "pros": "I personally love being able to work from home. I believe the pay is great and the fact that there is no need to spend money on commute or lunch is a great advantage for me. Your always very busy with the workload and it makes your day fly by.", "cons": "Too many changes very quickly and at times management is not on the same page", "advice": "Wish change was not made as often but I guess it needs to be done. Maybe better communication amongst department"}, {"title": "Customer Services", "text": "Pros some of the reason if they fix all the manager and supervisor it will probably will be a little better. Cons You are not secure in this company, you always worry went you are going to be next to let go and, will not provide you with a good explanation way you being let go, I'll never recommend this company to noboby, not even my worst enemy. Advice to Management A few unprofessional Supervisor and Manager that need to be fix, they do a poor job", "rating": 1, "pros": "some of the reason if they fix all the manager and supervisor it will probably will be a little better.", "cons": "You are not secure in this company, you always worry went you are going to be next to let go and, will not provide you with a good explanation way you being let go, I'll never recommend this company to noboby, not even my worst enemy.", "advice": "A few unprofessional Supervisor and Manager that need to be fix, they do a poor job"}, {"title": "Medicare Marketing Representative", "text": "Pros Great company to work. Great learning experience Cons Not competitive basic salary which did not meet my expectations", "rating": 3, "pros": "Great company to work. Great learning experience", "cons": "Not competitive basic salary which did not meet my expectations", "advice": null}, {"title": "Medicare Marketing Representative", "text": "Pros Great learning experience in all the areas Cons Like all the companies have. I am not that satisfied with the comp plan.", "rating": 3, "pros": "Great learning experience in all the areas", "cons": "Like all the companies have. I am not that satisfied with the comp plan.", "advice": null}, {"title": "Marketing Rep", "text": "Pros Great company to work for. You will be rewarded for you hard work! Cons Just waiting annually for a bonus", "rating": 5, "pros": "Great company to work for. You will be rewarded for you hard work!", "cons": "Just waiting annually for a bonus", "advice": null}, {"title": "Associate Medical Director", "text": "Pros well-respected, '4 Star' Managed Care plan; has grown quickly; very diverse racial/cultural blend; many women at the Executive level; many customizable work-from-home/remote opportunities Cons Not-for-Profit- older technology (although updating) & salaries likely less than for-profit/private; very corporate hierarchy; big gap between upper-most management and rank and file, just starting to develop middle management. Advice to Management The company still has a very exclusive approach to overall company planning, development, strategy. It feels like you need to know the 'right' person to get ahead.", "rating": 3, "pros": "well-respected, '4 Star' Managed Care plan; has grown quickly; very diverse racial/cultural blend; many women at the Executive level; many customizable work-from-home/remote opportunities", "cons": "Not-for-Profit- older technology (although updating) & salaries likely less than for-profit/private; very corporate hierarchy; big gap between upper-most management and rank and file, just starting to develop middle management.", "advice": "The company still has a very exclusive approach to overall company planning, development, strategy. It feels like you need to know the 'right' person to get ahead."}, {"title": "Member Service Representative", "text": "Pros Great benefits. Major holidays are paid off. Cons Vacation time is hard to put in when working for call center. If time is not available you can't take your vacation. Advice to Management Need to have more employees to cover son that other employees are able to request the vacation time they need.", "rating": 5, "pros": "Great benefits. Major holidays are paid off.", "cons": "Vacation time is hard to put in when working for call center. If time is not available you can't take your vacation.", "advice": "Need to have more employees to cover son that other employees are able to request the vacation time they need."}, {"title": "Change of Culture - Same old story though", "text": "Pros Free coffee, nice views, hard working employees Cons Top heavy with directors, assistant VPs and VPs. Favoritism in promotions and no room for advancement if you're not one of them Advice to Management There's no point in having an employee survey if you're not going to listen", "rating": 3, "pros": "Free coffee, nice views, hard working employees", "cons": "Top heavy with directors, assistant VPs and VPs. Favoritism in promotions and no room for advancement if you're not one of them", "advice": "There's no point in having an employee survey if you're not going to listen"}, {"title": "Member Service Rep", "text": "Pros great place to move up in your career Cons very stressful environment, very strict policies, you are timed and watched on everything you do", "rating": 3, "pros": "great place to move up in your career", "cons": "very stressful environment, very strict policies, you are timed and watched on everything you do", "advice": null}, {"title": "Provider Service Representative", "text": "Pros Good company, easy to move up Cons it is disorganized and there seems to be a lack of leadership. The pay is ok, but you are doing more work which doesn't compensate", "rating": 3, "pros": "Good company, easy to move up", "cons": "it is disorganized and there seems to be a lack of leadership. The pay is ok, but you are doing more work which doesn't compensate", "advice": null}, {"title": "Working at HF", "text": "Pros Good pay and nice location Cons Disorganization and unfortunately your success is tied to your supervisor.", "rating": 3, "pros": "Good pay and nice location", "cons": "Disorganization and unfortunately your success is tied to your supervisor.", "advice": null}, {"title": "Sr. QA Analyst", "text": "Pros Great culture - fosters development & forward thinking mindset Not much importance given to titles, but rather an individual's contribution is evaluated based on overall contribution to team goals Work from home option with flexible schedule Cons Lack of proper planing, funding & execution of key projects. SDLC process is not stable, lots of ideas thrown around by different people but only a few in management have the expertise & vision to implement the ideas Advice to Management Have proper alignment with business stake holders on key projects Implement more structured SDLC process & track progress against company goals not personal or department goals.", "rating": 5, "pros": "Great culture - fosters development & forward thinking mindset", "cons": "Lack of proper planing, funding & execution of key projects.", "advice": "Have proper alignment with business stake holders on key projects"}, {"title": "Provider Services", "text": "Pros No pros within this company. A horrible place to work Cons Not fair when it comes to absences knowing if you have a known medical condition, not understanding when you have small children that are very ill... Advice to Management Awful place to work", "rating": 1, "pros": "No pros within this company. A horrible place to work", "cons": "Not fair when it comes to absences knowing if you have a known medical condition, not understanding when you have small children that are very ill...", "advice": "Awful place to work"}, {"title": "just ok", "text": "Pros office space is new, open and modern Cons focus is primarily on management", "rating": 3, "pros": "office space is new, open and modern", "cons": "focus is primarily on management", "advice": null}, {"title": "Nice place to work", "text": "Pros Traditionally a .net shop, now transitioning into Salesforce, Mulesoft, and PEGA technologies. A growing and exciting climate. Cons Still transitioning into a fully mature organization with the typical growing pains. Advice to Management A big part of maturity is getting to a place where you can relax and let go a bit.", "rating": 5, "pros": "Traditionally a .net shop, now transitioning into Salesforce, Mulesoft, and PEGA technologies. A growing and exciting climate.", "cons": "Still transitioning into a fully mature organization with the typical growing pains.", "advice": "A big part of maturity is getting to a place where you can relax and let go a bit."}, {"title": "member service rep", "text": "Pros good benefits no weekends great people around you Cons though to move up changes happen everyday", "rating": 5, "pros": "good benefits", "cons": "though to move up", "advice": null}, {"title": "Outreach Coordinator", "text": "Pros The culture is amazing and competitive salaries. Cons Changing departments requires you to work for 1 year in your current position. Advice to Management None right now.", "rating": 5, "pros": "The culture is amazing and competitive salaries.", "cons": "Changing departments requires you to work for 1 year in your current position.", "advice": "None right now."}, {"title": "Registered Dietitian", "text": "Pros No commute, you get out of bed, get your coffee and you at work; work for home Cons Extreme Micro Manangement; ongoing changes in work load/responsibilties", "rating": 1, "pros": "No commute, you get out of bed, get your coffee and you at work; work for home", "cons": "Extreme Micro Manangement; ongoing changes in work load/responsibilties", "advice": null}, {"title": "Healthfirst belongs in the hall of shame!!", "text": "Pros Members first, employees last. Free coffee/tea, pleasant physical surroundings. Wants to change into something it can't be, classy.. Bonuses for all. Some employees are very committed and others need to be committed. Cons Company mission is excellent, execution is poor. No management/leadership training. Expectations unrealistic given the environment .Mandate to change coming from the top is driving many to drink (at work). Senior leaders do not respect one another and often they do not respect the employees. Advice to Management If you want to change company culture, senior leaders need to walk the talk. Must wear suit of armor and expect no work life balance.", "rating": 3, "pros": "Members first, employees last. Free coffee/tea, pleasant physical surroundings. Wants to change into something it can't be, classy.. Bonuses for all. Some employees are very committed and others need to be committed.", "cons": "Company mission is excellent, execution is poor. No management/leadership training. Expectations unrealistic given the environment .Mandate to change coming from the top is driving many to drink (at work).", "advice": "If you want to change company culture, senior leaders need to walk the talk. Must wear suit of armor and expect no work life balance."}, {"title": "A great place to work, right time, and right industry!", "text": "Pros Great mission, truly dedicated to serving the community and really wants to the do the right thing by their members, providers, employees and all stakeholders! Cons They are still going through a transition in culture. While they have advanced they still have some work to do. The entire leadership team is not \"all in\" and this has the ability to impact newly-hired employees. Advice to Management Don't be afraid of change - although change comes with a level of chaos and confusion, it also comes with tons of opportunities!", "rating": 5, "pros": "Great mission, truly dedicated to serving the community and really wants to the do the right thing by their members, providers, employees and all stakeholders!", "cons": "They are still going through a transition in culture. While they have advanced they still have some work to do. The entire leadership team is not \"all in\" and this has the ability to impact newly-hired employees.", "advice": "Don't be afraid of change - although change comes with a level of chaos and confusion, it also comes with tons of opportunities!"}, {"title": "member services representative", "text": "Pros Opportunities to work from home based on performance. Cons Limited oportunity for advancement due to corporate office in NY. Performance of extra tasks outside of normal duties is not always recognized.", "rating": 3, "pros": "Opportunities to work from home based on performance.", "cons": "Limited oportunity for advancement due to corporate office in NY. Performance of extra tasks outside of normal duties is not always recognized.", "advice": null}, {"title": "Lacks integrity", "text": "Pros Fair wages and benefits. Employees can work from home sometimes. Good 401k. Company is growing. I worked with really great people. Cons Senior management has different rules than the rest of the staff. They implemented a calibration process for performance reviews and say that the bell curve is a target, not forced, yet managers are forced to lower team member ratings to meet the curve. What is ridiculous is that all senior staff but one were given \"exceeds standards\". Wondering how that bell curve looks? They should really take a look at who can see performance ratings. Their security is a joke and many people have access to see this that should not. Also a very high level management person was caught on surveillance having sex at the office with an employee. Both are still employed and have since been promoted. Sickening. They call themselves Trailblazers but it is all words. They don't walk the walk and talk the talk. Advice to Management Practice what you preach. Your lack of honesty and integrity is pathetic.", "rating": 3, "pros": "Fair wages and benefits. Employees can work from home sometimes. Good 401k. Company is growing. I worked with really great people.", "cons": "Senior management has different rules than the rest of the staff. They implemented a calibration process for performance reviews and say that the bell curve is a target, not forced, yet managers are forced to lower team member ratings to meet the curve. What is ridiculous is that all senior staff but one were given \"exceeds standards\". Wondering how that bell curve looks? They should really take a look at who can see performance ratings. Their security is a joke and many people have access to see this that should not. Also a very high level management person was caught on surveillance having sex at the office with an employee. Both are still employed and have since been promoted. Sickening. They call themselves Trailblazers but it is all words. They don't walk the walk and talk the talk.", "advice": "Practice what you preach. Your lack of honesty and integrity is pathetic."}, {"title": "great place to work", "text": "Pros nice environment, opportunity to grow. Cons depends on your direct report", "rating": 5, "pros": "nice environment, opportunity to grow.", "cons": "depends on your direct report", "advice": null}, {"title": "Work ethic", "text": "Pros Great immediate supervisor Benefits Schedule - off weekends \"Quarterly\" Incentive pay out Constant opportunities for growth Cons Some degrading supervisors Pay outs are never on time No shift bids Advice to Management Educate your supervisors on how to speak to their representatives.", "rating": 5, "pros": "Great immediate supervisor", "cons": "Some degrading supervisors", "advice": "Educate your supervisors on how to speak to their representatives."}, {"title": "Medicare Marketing Rep", "text": "Pros Great company to work for with a great reputation in its market. Really cares about its members. Great culture and the leadership is committed to becoming the preeminent plan in our market ( I believe we're there in most of our product lines!). Potential to make very good money. Cons Healthfirst has a big market share of the Medicare population so it can be difficult to reach your monthly goal if you don't have a referral system in place. Advice to Management Management has done a great job in creating a culture where every employee understand that their role is important for the company to achieve its goal.", "rating": 5, "pros": "Great company to work for with a great reputation in its market. Really cares about its members. Great culture and the leadership is committed to becoming the preeminent plan in our market ( I believe we're there in most of our product lines!). Potential to make very good money.", "cons": "Healthfirst has a big market share of the Medicare population so it can be difficult to reach your monthly goal if you don't have a referral system in place.", "advice": "Management has done a great job in creating a culture where every employee understand that their role is important for the company to achieve its goal."}, {"title": "Not a good place to work", "text": "Pros providing working remote opportunity . This is the only advantages Cons more manager than developers and manager has no idea about how the technology perform .Lot of *BAD* politics . for technology prospective , company running at least 10 years behind . Advice to Management Reduce unnecessary managers and red-tape type attitude of mangers and behave respectfully .", "rating": 3, "pros": "providing working remote opportunity . This is the only advantages", "cons": "more manager than developers and manager has no idea about how the technology perform .Lot of *BAD* politics . for technology prospective , company running at least 10 years behind .", "advice": "Reduce unnecessary managers and red-tape type attitude of mangers and behave respectfully ."}, {"title": "HF", "text": "Pros Work from home flexibility, beautiful office, great location, great people, supporting New Yorkers! Cons Annual salary increases minimal, not enough vacation days", "rating": 5, "pros": "Work from home flexibility, beautiful office, great location, great people, supporting New Yorkers!", "cons": "Annual salary increases minimal, not enough vacation days", "advice": null}, {"title": "Manager Clinical Quality", "text": "Pros Job location is great near lots of public transportation. Great potential to work from home. 401k PTO bright and airy place to work. Cons Employees work in fear..managers are not leaders and do not have integrity. Favoritism plays a huge favor in getting promoted. Work ethic is reactionary vs being proactive. Advice to Management Trailblazer model needs to start with leadership. Especially review the employees who have been employed with Healthfirst for many years. Change will never happen if you don't hold the right people accountable.", "rating": 1, "pros": "Job location is great near lots of public transportation. Great potential to work from home. 401k PTO bright and airy place to work.", "cons": "Employees work in fear..managers are not leaders and do not have integrity. Favoritism plays a huge favor in getting promoted. Work ethic is reactionary vs being proactive.", "advice": "Trailblazer model needs to start with leadership. Especially review the employees who have been employed with Healthfirst for many years. Change will never happen if you don't hold the right people accountable."}, {"title": "Community Outreach Coordinator", "text": "Pros Pre-Emient Plan in the Market Cons Competeing with the Commercial markets Advice to Management I am an outstanding Employee at Healthfirst in NYC and want to make a move to Florida so I can continue at HF", "rating": 5, "pros": "Pre-Emient Plan in the Market", "cons": "Competeing with the Commercial", "advice": "I am an outstanding Employee at Healthfirst in NYC and want to make a move to Florida so I can continue at HF"}, {"title": "Nice place to work!", "text": "Pros Great company! I loved the telecommute opportunity. Nice environment! I would work there again. Cons Yearly raises aren't great, and neither are bonuses. However, they do offer both! Advice to Management I had no issues with management. My boss was great- no micromanagement.", "rating": 5, "pros": "Great company! I loved the telecommute opportunity. Nice environment! I would work there again.", "cons": "Yearly raises aren't great, and neither are bonuses. However, they do offer both!", "advice": "I had no issues with management. My boss was great- no micromanagement."}, {"title": "IT Programmer", "text": "Pros The company is quickly growing and there is lots of opportunities to make an impact. Very good work/life balance. Cons Things are done slow. Issues with leadership. Culture is weak. Advice to Management Improve culture and actually get rid of people holding the company back.", "rating": 5, "pros": "The company is quickly growing and there is lots of opportunities to make an impact. Very good work/life balance.", "cons": "Things are done slow. Issues with leadership. Culture is weak.", "advice": "Improve culture and actually get rid of people holding the company back."}, {"title": "It's about culture", "text": "Pros Progressive company with wonderful mission,vision and values. Cons Despite a huge focus on culture drivers there's a big divide between what we say we do and what we really do Advice to Management Speak up! Think critically and deliver with pride by taking a stand against the bullying that is led and fed by leadership in CMO. It's a contagious and very powerful culture driver that will lead us to no where fast", "rating": 3, "pros": "Progressive company with wonderful mission,vision and values.", "cons": "Despite a huge focus on culture drivers there's a big divide between what we say we do and what we really do", "advice": "Speak up! Think critically and deliver with pride by taking a stand against the bullying that is led and fed by leadership in CMO. It's a contagious and very powerful culture driver that will lead us to no where fast"}, {"title": "Data Analyst", "text": "Pros The company is aggressive about improving culture and transforming the businesses technology and data to prepare for more growth. This allows for many job openings with technical skills and room for growth. Telecomuting is a plus. Cons Management is a toss up. Quick growth seems to have let some of the early employees and otherwise mediocre managers rise to the higher positions. The turnover rate is high-- In the past year I can count about 15 people who have left whom I worked with directly. Work ethic varies greatly from depending upon department. Advice to Management Adopt new best practices and give credit back where deserved. Treat the people who work for you good and they will perform better and communication will improve providing better insight and transparency to what is happening.", "rating": 5, "pros": "The company is aggressive about improving culture and transforming the businesses technology and data to prepare for more growth. This allows for many job openings with technical skills and room for growth. Telecomuting is a plus.", "cons": "Management is a toss up. Quick growth seems to have let some of the early employees and otherwise mediocre managers rise to the higher positions. The turnover rate is high-- In the past year I can count about 15 people who have left whom I worked with directly. Work ethic varies greatly from depending upon department.", "advice": "Adopt new best practices and give credit back where deserved. Treat the people who work for you good and they will perform better and communication will improve providing better insight and transparency to what is happening."}, {"title": "Not worth it", "text": "Pros Competitive Salary, well know in the industry Cons Politics, racism, old-fashioned, HR is for managers and upper management not for all employees Advice to Management Listen to all levels of employees.", "rating": 1, "pros": "Competitive Salary, well know in the industry", "cons": "Politics, racism, old-fashioned, HR is for managers and upper management not for all employees", "advice": "Listen to all levels of employees."}, {"title": "Very unprofessional management and executive team.", "text": "Pros The only pros of working for this company are a regular paycheck and health insurance but then again so do cashiers at big-box stores. Cons The list of reasons why not to work here is long. Bullying from by management that is supported and encouraged by the human resources department. The CEO who boasts of her law degree looks the other way and pretends she knows nothing about the bullying and harassment going on. Her great idea is to revamp the vision and mission to change corporate culture while firing the employees who speak out against the harassment and bullying. Constant monitoring to the degree that management feels the need to tell employees they know when they take a bathroom break. Unqualified and incompetent people put in management positions based on the bobble head principle only. Advice to Management Shame shame shame. A corporate take over needs to happen and the executive team and management staff need to be remove with no severance package.", "rating": 1, "pros": "The only pros of working for this company are a regular paycheck and health insurance but then again so do cashiers at big-box stores.", "cons": "The list of reasons why not to work here is long. Bullying from by management that is supported and encouraged by the human resources department. The CEO who boasts of her law degree looks the other way and pretends she knows nothing about the bullying and harassment going on. Her great idea is to revamp the vision and mission to change corporate culture while firing the employees who speak out against the harassment and bullying. Constant monitoring to the degree that management feels the need to tell employees they know when they take a bathroom break. Unqualified and incompetent people put in management positions based on the bobble head principle only.", "advice": "Shame shame shame. A corporate take over needs to happen and the executive team and management staff need to be remove with no severance package."}, {"title": "MSR", "text": "Pros Good work space. Great work environment. Cons Company at times chooses a difficult approach to resolve issues.", "rating": 5, "pros": "Good work space. Great work environment.", "cons": "Company at times chooses a difficult approach to resolve issues.", "advice": null}, {"title": "a start up job", "text": "Pros welcome environment with decent benefit plan Cons no much room to grow", "rating": 3, "pros": "welcome environment with decent benefit plan", "cons": "no much room to grow", "advice": null}, {"title": "Its not sob", "text": "Pros work from home, great benefits , early close at 3pm on days before holidays, PTO is provided at a lump sum which is awesome! Cons A bit difficult to move on to another position but very possible. Too many jobs that work from home which is great but is call center like which i don't like. Doesn't observe all the holidays so less time off. Advice to Management Up the PTO plans or add more holidays, offer more money to internal staff", "rating": 5, "pros": "work from home, great benefits , early close at 3pm on days before holidays, PTO is provided at a lump sum which is awesome!", "cons": "A bit difficult to move on to another position but very possible. Too many jobs that work from home which is great but is call center like which i don't like. Doesn't observe all the holidays so less time off.", "advice": "Up the PTO plans or add more holidays, offer more money to internal staff"}, {"title": "Support Coordinator", "text": "Pros Good pay and benefits, work from home Cons Lack of accountability, communication, education,", "rating": 5, "pros": "Good pay and benefits, work from home", "cons": "Lack of accountability, communication, education,", "advice": null}, {"title": "Great place to work", "text": "Pros Positive environment great management team. Company goal is well known and communicated in a very positive manner. Sense in work that you are doing for healthcare Cons Health insurance horrible. Work hours are long they require u to take lunch but it's non paid. They say that there not looking into providing employees health ins until 2019.", "rating": 5, "pros": "Positive environment great management team. Company goal is well known and communicated in a very positive manner. Sense in work that you are doing for healthcare", "cons": "Health insurance horrible. Work hours are long they require u to take lunch but it's non paid. They say that there not looking into providing employees health ins until 2019.", "advice": null}, {"title": "Director", "text": "Pros Colleagues, Mission of company, Members, Hospital connection Cons Executive Leadership, especially in HR Advice to Management Keep your words consistent with behavior. Stop losing great and dedicated professionals due to bullying behavior of executive leader", "rating": 1, "pros": "Colleagues, Mission of company, Members, Hospital connection", "cons": "Executive Leadership, especially in HR", "advice": "Keep your words consistent with behavior. Stop losing great and dedicated professionals due to bullying behavior of executive leader"}, {"title": "Interpreter", "text": "Pros Great company that has tons of growth. Cons I Haven't found any yet", "rating": 5, "pros": "Great company that has tons of growth.", "cons": "I Haven't found any yet", "advice": null}, {"title": "Member Service Rep", "text": "Pros Excellent benefits and paid time off, decent salary. Great team leaders. Cons The company is driven by quantity versus quality and the amount of verbal abuse that the employee must endure by members is absolutely unheard of. Healthfirst is very micromanaged and employee confidentiality/discretion is non-existent..Essentially you are a number and a disposable product. I will never again work for a company that operates on a grading scale that deciphers whether or not you are worthy enough to keep your job. Advice to Management This extends higher than than the management-more towards the CEO and the Chief Executive officer, focus more on quality customer service as opposed to quantity-not all issues can be resolved in 5 min or less-acknowledge and\\ reward your dedicated and caring employees more , then perhaps employee turnover would not be so high.", "rating": 3, "pros": "Excellent benefits and paid time off, decent salary. Great team leaders.", "cons": "The company is driven by quantity versus quality and the amount of verbal abuse that the employee must endure by members is absolutely unheard of. Healthfirst is very micromanaged and employee confidentiality/discretion is non-existent..Essentially you are a number and a disposable product. I will never again work for a company that operates on a grading scale that deciphers whether or not you are worthy enough to keep your job.", "advice": "This extends higher than than the management-more towards the CEO and the Chief Executive officer, focus more on quality customer service as opposed to quantity-not all issues can be resolved in 5 min or less-acknowledge and\\ reward your dedicated and caring employees more , then perhaps employee turnover would not be so high."}, {"title": "Member Services bilingual", "text": "Pros good pay, great knowledge, trainers are good, benefits perfect, 401k perfect, HR department perfect. Cons Now the good stuff, call center management's complete cero, lack of experience and expertise, specially when they are hiring supervisor with call center experience from the outside they realize the internals are not so good, I have personally interacted with a few of the management, and I will say there is a handful of supervisor some of them managers now that have a the knowledge and capacity to handle the job. 2.you will never have a clear answer for questions or procedures to do your job. please create workflow, try outsourcing your QA , many companies practice to avoid conflict of interest on the job. Advice to Management verify previous employment history to match employee to related jobs, stop been too friendly with your subordinates, don't be cheap with technology, good job on the CRM upgrade, should have been sooner.", "rating": 3, "pros": "good pay, great knowledge, trainers are good, benefits perfect, 401k perfect, HR department perfect.", "cons": "Now the good stuff, call center management's complete cero, lack of experience and expertise, specially when they are hiring supervisor with call center experience from the outside they realize the internals are not so good, I have personally interacted with a few of the management, and I will say there is a handful of supervisor some of them managers now that have a the knowledge and capacity to handle the job. 2.you will never have a clear answer for questions or procedures to do your job. please create workflow, try outsourcing your QA , many companies practice to avoid conflict of interest on the job.", "advice": "verify previous employment history to match employee to related jobs, stop been too friendly with your subordinates, don't be cheap with technology, good job on the CRM upgrade, should have been sooner."}, {"title": "Member service rep", "text": "Pros Good insurance and benefits, Christmas was excellent and new healthy vending machines Cons Micromanage, low pay, quality assurance scores expectation, I score 95.4% and was written up twice and passing score is 96% it's ridiculous", "rating": 3, "pros": "Good insurance and benefits, Christmas was excellent and new healthy vending machines", "cons": "Micromanage, low pay, quality assurance scores expectation, I score 95.4% and was written up twice and passing score is 96% it's ridiculous", "advice": null}, {"title": "Fear, Loathing, and Sexism", "text": "Pros Free coffee. That's about it. There are some talented, good-natured, and solid people here. Unfortunately, they are in the minority. Cons When I first began working here, the fear and paranoia was palpable. Unfortunately, in most offices these days, this is the rule rather than the exception--and the working environment at Healthfirst has an almost Cold War quality to it. After you get used to this, then you have to deal with favoritism, incompetence, dishonesty, and gossip. A number of reviewers here have mentioned racism--and it is a problem at HF. But sexism is also rampant--especially in the Marketing Department. If you summon the courage to complain to Human Resources, it is utterly futile. HR is useless. Upper management is entrenched in bias, incompetence, and a deep seeded desire to be surrounded by \"yes\" men. Clever, bold ideas are rejected on a regular basis. Originality is discouraged. Just look at any of Healthfirst's boring print ads (\"Hardworking Insurance for Hardworking New Yorkers\". Seriously?) or amateurish television commercials, and you'll see what I mean. If you are a talented writer or graphic designer with new ideas and, God forbid, a sense of humor, this is NOT the place for you. Because at Healthfirst, mediocrity is the rule of the day. Advice to Management Grow a conscious. Treat your employees with some respect. Work to create a more relaxed, creative, and productive working environment.", "rating": 1, "pros": "Free coffee. That's about it. There are some talented, good-natured, and solid people here.", "cons": "When I first began working here, the fear and paranoia was palpable. Unfortunately, in most offices these days, this is the rule rather than the exception--and the working environment at Healthfirst has an almost Cold War quality to it. After you get used to this, then you have to deal with favoritism, incompetence, dishonesty, and gossip.", "advice": "Grow a conscious. Treat your employees with some respect. Work to create a more relaxed, creative, and productive working environment."}, {"title": "Manager", "text": "Pros -Large company -Multi-cultural -High Pay/ with Annual Bonus -Benefits -Career advancement/growth (if you are a \"yes\" person, brown-nose or of the \"right\" ethnicity) Cons Having been at HF since 2011 I have been witness to the ever changing environment or as the call it \"culture\". Up until 2014 culture was an unheard of term. For years I was my VP's beckon call - day in and day out, weekends, holidays and even vacation. From the top the company is poorly managed, whether it be as simple as the hiring process or or new product role out (I have one seen one go smoothly). The individuals responsible for operations or implementation/development are never held accountable, rather front line staff is demonized for the leaderships shortcomings and broken inferior IT systems. This hostile environment is not limited to Managers ( my equals at the time) or Directors, but extends to the COO; whom has made inappropriate comments to me, in front of co-workers, which were demeaning and derogatory---not to mention wrong and inaccurate. Last but certainly not least, the HR Department. During HF's \"desire\" for culture change, the HR Department transformed by creating HR Business Partners (HRBP). These individuals are the sole link between your work group and HR, in theory GREAT. But not when these individuals are granted unlimited unchecked power. My former groups HRBP actions are/were reprehensible, deceptive, accusatory, intimidating and vengeful. With these traits of the HRBP, in conjunction with my unblemished and exceptional personnel record/ annual reviews this HR \"leader\" terminated my employment with defaming and unverified accusations; which my superiors could not interject or stop this injustice as \"it was out of their hands\". In what organization does your Director or VP have no weight or input to this type of situation? Advice to Management Learn from your mistakes don't keep making them. As a profitable non-for-profit, HF needs to invest in new IT operating systems, software and security: the temporary \"band-aides\" can no longer sustain the systems needs or capability. This hinders all employees from meeting their highest potential and maximizing member satisfaction. Also, the organization is loosing valuable employee due to the misguided and unchecked actions of your HR Department. HR by design is to serve and protect the company, they however are destroying your good reputation - built on over two decades of success.", "rating": 1, "pros": "-Large company", "cons": "Having been at HF since 2011 I have been witness to the ever changing environment or as the call it \"culture\". Up until 2014 culture was an unheard of term. For years I was my VP's beckon call - day in and day out, weekends, holidays and even vacation. From the top the company is poorly managed, whether it be as simple as the hiring process or or new product role out (I have one seen one go smoothly). The individuals responsible for operations or implementation/development are never held accountable, rather front line staff is demonized for the leaderships shortcomings and broken inferior IT systems. This hostile environment is not limited to Managers ( my equals at the time) or Directors, but extends to the COO; whom has made inappropriate comments to me, in front of co-workers, which were demeaning and derogatory---not to mention wrong and inaccurate.", "advice": "Learn from your mistakes don't keep making them."}, {"title": "Anonymous", "text": "Pros . . . . . Cons Supervisors are immature, unprofessional, and inappropriate. They are poor communicators and need more experience. Advice to Management Hire supervisors or managers that are experienced with managing people. A lot of managers have no clue what their employees do. They need a lot training on how to interact and communicate with their employees.", "rating": 3, "pros": ". . . . .", "cons": "Supervisors are immature, unprofessional, and inappropriate. They are poor communicators and need more experience.", "advice": "Hire supervisors or managers that are experienced with managing people. A lot of managers have no clue what their employees do. They need a lot training on how to interact and communicate with their employees."}, {"title": "Management is very un-professional. They speak a lot of slang and street from directors to managers.", "text": "Pros Benefits are good. Their time lines suck. N9t able to meet deadlines as per P& P to much red tape to get one simple answer annoying to members as well as employee, make you look as if you don't know what you are doing Cons Many changes, adapting communication methods are at times contradictory. Today is green tomorrow is yellow. To much info peovided to Members they just one solutions not all the things about surveys or health assessments. Advice to Management Talk to your peers in a professional vocabulary. And hire people for their knowledge, not because they are the preferred candidate", "rating": 3, "pros": "Benefits are good. Their time lines suck. N9t able to meet deadlines as per P& P to much red tape to get one simple answer annoying to members as well as employee, make you look as if you don't know what you are doing", "cons": "Many changes, adapting communication methods are at times contradictory. Today is green tomorrow is yellow. To much info peovided to Members they just one solutions not all the things about surveys or health assessments.", "advice": "Talk to your peers in a professional vocabulary. And hire people for their knowledge, not because they are the preferred candidate"}, {"title": "No respect from Management", "text": "Pros They are very data driven at the time I worked there. I think you could learn on the data side as they are a SAS shop. But there's other healthcare insurance companies such as Oscar, Fidelis, Anthem that are also data driven. Cons There are a few good eggs, but management overall don't treat people well. It's all about getting the job done. Finance/Health Analytics dept spends long hours and they don't care if you have to get there at 4 AM to get it done. Hence there's a lot of churn and burnout at this company. I'd rather prospective employees go to another company that value their employees while also getting the job done. More than half my old team left and they shut that department down for a bit. That's sort of the flavor at this company. Advice to Management Celebrate your successes as well. It's a team effort rather than churn and burn.", "rating": 1, "pros": "They are very data driven at the time I worked there. I think you could learn on the data side as they are a SAS shop. But there's other healthcare insurance companies such as Oscar, Fidelis, Anthem that are also data driven.", "cons": "There are a few good eggs, but management overall don't treat people well. It's all about getting the job done. Finance/Health Analytics dept spends long hours and they don't care if you have to get there at 4 AM to get it done. Hence there's a lot of churn and burnout at this company. I'd rather prospective employees go to another company that value their employees while also getting the job done. More than half my old team left and they shut that department down for a bit. That's sort of the flavor at this company.", "advice": "Celebrate your successes as well. It's a team effort rather than churn and burn."}, {"title": "the worst", "text": "Pros none at all the worst Cons the healthcare case workers are the worst.", "rating": 1, "pros": "none at all the worst", "cons": "the healthcare case workers are the worst.", "advice": null}, {"title": "Mediocre", "text": "Pros Good coworkers work here usually and the company is very diverse Cons Middle management either is incompetent and not provide insight into how to do the job or competent but lack of leadership and development ability. Very few departments have good leadership in place, but that may be out there everywhere. Advice to Management Do a better job of rewarding high performers", "rating": 3, "pros": "Good coworkers work here usually and the company is very diverse", "cons": "Middle management either is incompetent and not provide insight into how to do the job or competent but lack of leadership and development ability. Very few departments have good leadership in place, but that may be out there everywhere.", "advice": "Do a better job of rewarding high performers"}, {"title": "Stay Away", "text": "Pros Not much for the Pros Cons IT Management is the worst", "rating": 1, "pros": "Not much for the Pros", "cons": "IT Management is the worst", "advice": null}, {"title": "Medical Interpreter", "text": "Pros It is a wonderful company to work within, allowing employee to grow up. Cons till now I do not see any cons Advice to Management keep doing a great job", "rating": 5, "pros": "It is a wonderful company to work within, allowing employee to grow up.", "cons": "till now I do not see any cons", "advice": "keep doing a great job"}, {"title": "experience", "text": "Pros Good benefits and vacation timeWorking at healthfirst, I learn a lot about the healthcare industry and worked with many wonderful employees. Cons the hiring process of supervisors and mangemet needs to be more professional. Some mangement lack respect for there employees", "rating": 5, "pros": "Good benefits and vacation timeWorking at healthfirst, I learn a lot about the healthcare industry and worked with many wonderful employees.", "cons": "the hiring process of supervisors and mangemet needs to be more professional. Some mangement lack respect for there employees", "advice": null}, {"title": "Summer Experience", "text": "Pros -seems stable...good job for stability in raising a family Cons -not a youthful culture -it's insurance so not a very interesting topic to stay in for a long time Advice to Management -perhaps try to recruit younger analysts?", "rating": 5, "pros": "-seems stable...good job for stability in raising a family", "cons": "-not a youthful culture", "advice": "-perhaps try to recruit younger analysts?"}]