[{"title": "Very Stressful", "text": "Pros Hearst is a very big company with a lot of great products. They don't have any debt and job security is strong. Cons It depends on which station you work for. Sometimes the people they appoint to leadership have no business leading anything. Advice to Management Stop micro managing and let your reps do what they do. Scare tactics only upset them even more.", "rating": 5, "pros": "Hearst is a very big company with a lot of great products. They don't have any debt and job security is strong.", "cons": "It depends on which station you work for. Sometimes the people they appoint to leadership have no business leading anything.", "advice": "Stop micro managing and let your reps do what they do. Scare tactics only upset them even more."}, {"title": "Digital Designer", "text": "Pros Get to be creative in a cool environment Cons Not a lot of company culture", "rating": 3, "pros": "Get to be creative in a cool environment", "cons": "Not a lot of company culture", "advice": null}, {"title": "Photo Editor", "text": "Pros Freedom to do your best work. Cons Mild chaos, management not supportive.", "rating": 3, "pros": "Freedom to do your best work.", "cons": "Mild chaos, management not supportive.", "advice": null}, {"title": "Sales Representative", "text": "Pros Great people to work with Cons Declining industry. Poor management and benefits", "rating": 1, "pros": "Great people to work with", "cons": "Declining industry. Poor management and benefits", "advice": null}, {"title": "Magazine Company / Annoying", "text": "Pros Beautiful building on Columbus Circle. On premise gym. Cafeteria onsite. Brands that most media people already know. Twenty word minimum. Cons Working at Hearst was similar to being the tallest midget. Yes- Hearst is better than the other magazine companies at digital ---but they are very much a magazine (first)company. Support teams are inexperienced and over worked & there seems to be a lack of clear direction overall--- on anything. There is a HUGE power struggle regarding print vs digital. Digital management seems to fear print managers. Print managers are prehistoric and are desperate to get involved with digital conversations. It's a very strange place and the power struggle / undermining is very distracting. There are so many strategic and nimble digital pure plays that are way more focused and flexible. If you are going to work here- be very prepared for a lot of politics and all of the distracting background noise that comes along with it...it's really all just annoying. You will rot from boredom and aggravation. Advice to Management Lose all the layers and fragments. Train your support staff. Pay people.", "rating": 3, "pros": "Beautiful building on Columbus Circle. On premise gym. Cafeteria onsite. Brands that most media people already know. Twenty word minimum.", "cons": "Working at Hearst was similar to being the tallest midget. Yes- Hearst is better than the other magazine companies at digital ---but they are very much a magazine (first)company. Support teams are inexperienced and over worked & there seems to be a lack of clear direction overall--- on anything. There is a HUGE power struggle regarding print vs digital. Digital management seems to fear print managers. Print managers are prehistoric and are desperate to get involved with digital conversations. It's a very strange place and the power struggle / undermining is very distracting. There are so many strategic and nimble digital pure plays that are way more focused and flexible. If you are going to work here- be very prepared for a lot of politics and all of the distracting background noise that comes along with it...it's really all just annoying. You will rot from boredom and aggravation.", "advice": "Lose all the layers and fragments. Train your support staff. Pay people."}, {"title": "Socail intern", "text": "Pros fun, active, insightful, glamorous and educational Cons intimidating and quiet office environment.", "rating": 3, "pros": "fun, active, insightful, glamorous and educational", "cons": "intimidating and quiet office environment.", "advice": null}, {"title": "i do the same thing as a \"Manager\" would", "text": "Pros As a marketer, great opportunity to build valuable campaigns. Great work/life balance. Cons Compensation. Impossible to live in NYC on this salary. It does not feel like the company values employees, until they get a job offer elsewhere. Very corporate environment and hard to grow. Advice to Management Value employees and don't try to pay the absolute minimum possible. Employees should be prioritized", "rating": 3, "pros": "As a marketer, great opportunity to build valuable campaigns. Great work/life balance.", "cons": "Compensation. Impossible to live in NYC on this salary. It does not feel like the company values employees, until they get a job offer elsewhere. Very corporate environment and hard to grow.", "advice": "Value employees and don't try to pay the absolute minimum possible. Employees should be prioritized"}, {"title": "WXII 12 / Hearst Television", "text": "Pros - Provides the proper tools and training to be succesful - Competitive in the DMA Cons - Working in the broadcast industry can be damaging to one's personal life and relationships. You have to love what you are doing or it will always be uphill. Advice to Management For the most the management at WXII 12 are great and easy to deal with.", "rating": 5, "pros": "- Provides the proper tools and training to be succesful", "cons": "- Working in the broadcast industry can be damaging to one's personal life and relationships. You have to love what you are doing or it will always be uphill.", "advice": "For the most the management at WXII 12 are great and easy to deal with."}, {"title": "Recruitment Advertising Consultant", "text": "Pros great opportunity to receive a hefty comp plan (as of 2016), promoted quickly under the right management team Cons most recent management is brutal, can blame you for not reaching goals which can be unattainable, misunderstanding of changing media outlets and difference in local market, takes good employees for granted, doesn't recognize great talent or ethical minded employees Advice to Management don't take advantage of your employees who love the industry, they're fading away fast along with your precious newspaper. And most of them can adapt to the digital world. Stop making it a habit to ask former employees to come back when it's clear nothing has changed ;)", "rating": 3, "pros": "great opportunity to receive a hefty comp plan (as of 2016), promoted quickly under the right management team", "cons": "most recent management is brutal, can blame you for not reaching goals which can be unattainable, misunderstanding of changing media outlets and difference in local market, takes good employees for granted, doesn't recognize great talent or ethical minded employees", "advice": "don't take advantage of your employees who love the industry, they're fading away fast along with your precious newspaper. And most of them can adapt to the digital world. Stop making it a habit to ask former employees to come back when it's clear nothing has changed ;)"}, {"title": "former employee", "text": "Pros nice gym and cafe fun perks Cons absolutely full of mean girls from high school. people are vapid and materialistic. reprimanded and questioned for overtime hours even though the pay is terrible. the industry is changing. just let everyone know their shelf life for print.", "rating": 1, "pros": "nice gym and cafe", "cons": "absolutely full of mean girls from high school. people are vapid and materialistic. reprimanded and questioned for overtime hours even though the pay is terrible. the industry is changing. just let everyone know their shelf life for print.", "advice": null}, {"title": "Great Company", "text": "Pros Great culture, resources, open communication Cons There are none I can think of.", "rating": 5, "pros": "Great culture, resources, open communication", "cons": "There are none I can think of.", "advice": null}, {"title": "cost cutting and shady", "text": "Pros strong corporate structure should allow movement Cons no loyalty, looking for cheaper, not better Advice to Management focus more on your employees and less on making money", "rating": 3, "pros": "strong corporate structure should allow movement", "cons": "no loyalty, looking for cheaper, not better", "advice": "focus more on your employees and less on making money"}, {"title": "Great Company, Lots of Opportunity", "text": "Pros If you are looking for a place to hang your hat, Hearst is it! Upward movement, a lot of opportunities, and locations throughout the US. Cons Facing lots of challenges with the ever-changing media environment. If you don't like change and moving fast, may not be the place for you.", "rating": 5, "pros": "If you are looking for a place to hang your hat, Hearst is it! Upward movement, a lot of opportunities, and locations throughout the US.", "cons": "Facing lots of challenges with the ever-changing media environment. If you don't like change and moving fast, may not be the place for you.", "advice": null}, {"title": "Art Director", "text": "Pros Nice building and great cafeteria. Company is a name that is recognized on a resume. Cons Very little opportunity for growth. Jobs are siloed with little exposure to learn new things. No chance to affect change. Disorganized. Horrible upper management. Poor pay and crappy benefits for a company of it’s size. Advice to Management Better pay and benefits for employees. Stop constantly reorganizing and restructuring teams. Pay attention to what the people in charge are doing to their teams. Make content on the websites something people can be proud of.", "rating": 3, "pros": "Nice building and great cafeteria. Company is a name that is recognized on a resume.", "cons": "Very little opportunity for growth. Jobs are siloed with little exposure to learn new things. No chance to affect change. Disorganized. Horrible upper management. Poor pay and crappy benefits for a company of it’s size.", "advice": "Better pay and benefits for employees. Stop constantly reorganizing and restructuring teams. Pay attention to what the people in charge are doing to their teams. Make content on the websites something people can be proud of."}, {"title": "Hearst Digital Media", "text": "Pros Great work/life balance but depends on team. Cons Benefits are just OK, nothing to write home about.", "rating": 3, "pros": "Great work/life balance but depends on team.", "cons": "Benefits are just OK, nothing to write home about.", "advice": null}, {"title": "Caring Team", "text": "Pros I worked with a team who really cared about each other and their work. People worked hard to accomplish goals, and I️ always felt supported. Cons Not always easy to advance, but that’s the same across the magazine industry. Fewer jobs as more and more companies continue to consolidate.", "rating": 5, "pros": "I worked with a team who really cared about each other and their work. People worked hard to accomplish goals, and I️ always felt supported.", "cons": "Not always easy to advance, but that’s the same across the magazine industry. Fewer jobs as more and more companies continue to consolidate.", "advice": null}, {"title": "Good", "text": "Pros Gain good experience in publishing and editorial. Good benefits and atmosphere. Excellent place to gain experience in magazines. Now there's the digital magazines too. Cons I found it difficult to move between departments. I had an offer to move to international division from a senior vice president but the managing editor of my magazine wouldn't allow it.", "rating": 3, "pros": "Gain good experience in publishing and editorial. Good benefits and atmosphere. Excellent place to gain experience in magazines. Now there's the digital magazines too.", "cons": "I found it difficult to move between departments. I had an offer to move to international division from a senior vice president but the managing editor of my magazine wouldn't allow it.", "advice": null}, {"title": "Great office space, good people", "text": "Pros Working in the Tower is a huge bonus over anywhere else. Culture is much more laid back and friendly than typical Manhattan corporate. Cons More internal cooperation needed - a lot of duplicated work", "rating": 5, "pros": "Working in the Tower is a huge bonus over anywhere else. Culture is much more laid back and friendly than typical Manhattan corporate.", "cons": "More internal cooperation needed - a lot of duplicated work", "advice": null}, {"title": "Editor", "text": "Pros Salary was good, and the talent was strong on almost every team. Cons The culture was unapologetically cutthroat, and expectations were absurdly high given the resources allocated. Felt depressing to go to work every day. Advice to Management Set clear, realistic expectations for employees with regular reviews, instead of just expecting constant miracles.", "rating": 3, "pros": "Salary was good, and the talent was strong on almost every team.", "cons": "The culture was unapologetically cutthroat, and expectations were absurdly high given the resources allocated. Felt depressing to go to work every day.", "advice": "Set clear, realistic expectations for employees with regular reviews, instead of just expecting constant miracles."}, {"title": "Editorial Assistant", "text": "Pros good benefits good perks potential growth Cons below standard pay low office morale", "rating": 3, "pros": "good benefits good perks potential growth", "cons": "below standard pay low office morale", "advice": null}, {"title": "Director", "text": "Pros Good benefits Nice corporate gym Great building Very commutable Awesome cafe that's reasonably priced good time off policy Great location in midtown Great magazines Cons On the editorial side, raises are marginal, if you even get one, but this is typical across publishing", "rating": 5, "pros": "Good benefits", "cons": "On the editorial side, raises are marginal, if you even get one, but this is typical across publishing", "advice": null}, {"title": "CBS Coordinator", "text": "Pros Great company to work for, welcoming team, wonderful management Cons hard to move up", "rating": 5, "pros": "Great company to work for, welcoming team, wonderful management", "cons": "hard to move up", "advice": null}, {"title": "A Company in Transition", "text": "Pros Truly beginning to act like a digital first organization in the magazine group. Cons Needed to stay on new leadership's good side and not appear to be part of the old guard", "rating": 3, "pros": "Truly beginning to act like a digital first organization in the magazine group.", "cons": "Needed to stay on new leadership's good side and not appear to be part of the old guard", "advice": null}, {"title": "PR Manager", "text": "Pros Amazing benefits, great team, beautiful building, exposure to senior team Cons Not enough job growth to keep employees.", "rating": 5, "pros": "Amazing benefits, great team, beautiful building, exposure to senior team", "cons": "Not enough job growth to keep employees.", "advice": null}, {"title": "Great Legacy Company Struggling to Keep Good Talent", "text": "Pros Location Building Perks Access to multiple brands Access to multiple job functions/roles Easy access to management Cons Top-heavy Poor top-down communication Too many \"re-orgs\" No career development No interest from upper management in fostering young talent or career growth Advice to Management Value your employees. Don't make them feel expendable.", "rating": 5, "pros": "Location", "cons": "Top-heavy", "advice": "Value your employees. Don't make them feel expendable."}, {"title": "Negatively impacted my career", "text": "Pros Amenities and building are world class Cons Endless cons including poor management from the top down, overworked employees because of tight magazine budgets, nasty colleagues (some), bureaucratic rules prevented me from taking another job within the company. Making $32k in NYC doesn’t really work either. I was reprimanded for submitting my overtime hours. Advice to Management Be less concerned about numbers and instead focus on work quality as well as happier culture", "rating": 1, "pros": "Amenities and building are world class", "cons": "Endless cons including poor management from the top down, overworked employees because of tight magazine budgets, nasty colleagues (some), bureaucratic rules prevented me from taking another job within the company. Making $32k in NYC doesn’t really work either. I was reprimanded for submitting my overtime hours.", "advice": "Be less concerned about numbers and instead focus on work quality as well as happier culture"}, {"title": "My Experience", "text": "Pros - Great iconic building. - Great events Cons - Bad management. - Demanding without great reward Advice to Management Take care of the people who are putting long hours.", "rating": 3, "pros": "- Great iconic building.", "cons": "- Bad management.", "advice": "Take care of the people who are putting long hours."}, {"title": "A good company overall but it depends on the department and magazine.", "text": "Pros Solid benefits, gorgeous centrally-located building, gym in the building, convenient cafeteria, good health initiatives Cons Corporate red tape, raises and promotions hard to come by, doesn't make the employees feel valued or special, possible long work hours", "rating": 3, "pros": "Solid benefits, gorgeous centrally-located building, gym in the building, convenient cafeteria, good health initiatives", "cons": "Corporate red tape, raises and promotions hard to come by, doesn't make the employees feel valued or special, possible long work hours", "advice": null}, {"title": "Good place to start a career but not to finish one", "text": "Pros Intelligent coworkers, nice location, decent benefits. Cons A toxic working environment, where one risks getting fired just for voicing her/his opinion. The management structure is entrenched from what it looks like older days of Hearst. It is full with ego driven individuals with contempt for anyone challenging their views. I guess this depends on the team, but this negative corporate culture seems to be pervasive in the company. I've witnessed many senseless fires of intelligent people for voicing their opinions. Needless to say such manifestations of power kill the moral among employees. Another glaring issue is lack of diversity in management and in some groups particular. They tend to hire clones of themselves resulting in cliquey boy's club. If you are not part of such groups you are treated as an outcast without a voice., and expected to blindly follow their directives. One outcome of such an approach is the effect on the quality of the work. The deep pockets of Hearst allows mediocre individuals with influence among the management to impose their (lack of) vision, which translates in lots of inefficiencies and wasted money and opportunities. Hearst is probably good to start one's career but not a place for experienced and ambitious individuals. Advice to Management You definitely need someone with integrity to improve your corporate culture.", "rating": 3, "pros": "Intelligent coworkers, nice location, decent benefits.", "cons": "A toxic working environment, where one risks getting fired just for voicing her/his opinion. The management structure is entrenched from what it looks like older days of Hearst. It is full with ego driven individuals with contempt for anyone challenging their views. I guess this depends on the team, but this negative corporate culture seems to be pervasive in the company.", "advice": "You definitely need someone with integrity to improve your corporate culture."}, {"title": "Great people, but not much oversight", "text": "Pros The people are fantastic. I don't think there's one jerk in the whole building, not that I've encountered. My market is very sticky for some reason, so a lot of the talent has been in the area for most of their careers. Hearst is also very well-positioned in a number of fields, so I don't have to worry about downsizing or cutbacks, especially in the unique role that I have in Hearst Television. There aren't a lot of mandates or meddling from up top, at least when it comes to our station. Cons Because of the odd nature of my role in digital, I serve masters in two different departments. My December self-evaluation, therefore, got \"lost in the mail\" amid a change in news directors and I didn't get to sit down with my actual supervisor to talk about it until August. There isn't much of a structure for feedback and such, at least for me. I have heard that the insurance can be rather stingy about which provider you can use for what. Like regardless of whether you have a dentist already, they may pick one for you. But I haven't made use of the insurance yet. Unless you're talent, there isn't a whole lot of mobility within the building. I've seen a few people in production and such take promotions out of town to sister stations, however.", "rating": 5, "pros": "The people are fantastic. I don't think there's one jerk in the whole building, not that I've encountered. My market is very sticky for some reason, so a lot of the talent has been in the area for most of their careers.", "cons": "Because of the odd nature of my role in digital, I serve masters in two different departments. My December self-evaluation, therefore, got \"lost in the mail\" amid a change in news directors and I didn't get to sit down with my actual supervisor to talk about it until August. There isn't much of a structure for feedback and such, at least for me.", "advice": null}, {"title": "InVue Digital - Growing, Full Service Digital Marketing Agency!", "text": "Pros Level of Expertise and Passion for Delivering Results! Cons Aside from the parking for the main building, InVue is expanding!", "rating": 5, "pros": "Level of Expertise and Passion for Delivering Results!", "cons": "Aside from the parking for the main building, InVue is expanding!", "advice": null}, {"title": "Advertising Services Director", "text": "Pros compensation, have a gym on site, good cafeteria Cons inflexible, old fashioned in improving work flow processes Advice to Management take a new perspective so you can revitalize your business", "rating": 1, "pros": "compensation, have a gym on site, good cafeteria", "cons": "inflexible, old fashioned in improving work flow processes", "advice": "take a new perspective so you can revitalize your business"}, {"title": "Catty Sorority Girls!", "text": "Pros The cafeteria and beauty sales Cons Full of those mean girls from high school, poor pay", "rating": 3, "pros": "The cafeteria and beauty sales", "cons": "Full of those mean girls from high school, poor pay", "advice": null}, {"title": "Chaos", "text": "Pros Salaries are competitive, very fast pace, high stress. Environment. Benefits competitive. Career opportunities de to the size of the company. Cons High stress, no work /home life balance. Poor culture - employees come second,. Training is non existent no budgets. Employees are not a team, everyone is out for themselves.", "rating": 3, "pros": "Salaries are competitive, very fast pace, high stress. Environment. Benefits competitive. Career opportunities de to the size of the company.", "cons": "High stress, no work /home life balance. Poor culture - employees come second,. Training is non existent no budgets. Employees are not a team, everyone is out for themselves.", "advice": null}, {"title": "Good company, but top-heavy with management", "text": "Pros A lot of hard-working, talented people focused on doing the job. Cons Management is top-heavy and doesn't give workers all the resources they need to succeed. Advice to Management Get involved. See how employees do their day-to-day jobs.", "rating": 5, "pros": "A lot of hard-working, talented people focused on doing the job.", "cons": "Management is top-heavy and doesn't give workers all the resources they need to succeed.", "advice": "Get involved. See how employees do their day-to-day jobs."}, {"title": "Corporate Communications", "text": "Pros Impressive office, responsive IT, nice cafeteria, comfortable work space with quality technology. Cons Uncompetitive compensation, no work-life balance, little opportunity for advancement, unqualified management. Horrible health insurance. Advice to Management Seek training on the basic essentials of managing employees, foster an environment free from intimidation and retaliation based on personal emotion, respect employees' time out of the office, and incentivize staff by offering competitive compensation and advancement when it's due.", "rating": 3, "pros": "Impressive office, responsive IT, nice cafeteria, comfortable work space with quality technology.", "cons": "Uncompetitive compensation, no work-life balance, little opportunity for advancement, unqualified management. Horrible health insurance.", "advice": "Seek training on the basic essentials of managing employees, foster an environment free from intimidation and retaliation based on personal emotion, respect employees' time out of the office, and incentivize staff by offering competitive compensation and advancement when it's due."}, {"title": "Good experience", "text": "Pros Main offices have a great location in New York Cons I left for a higher salary elsewhere--could be more opportunities for movement", "rating": 5, "pros": "Main offices have a great location in New York", "cons": "I left for a higher salary elsewhere--could be more opportunities for movement", "advice": null}, {"title": "Great place to work", "text": "Pros Friendly environment, great work culture Cons Doesn't offer maternity leave for full time employees", "rating": 5, "pros": "Friendly environment, great work culture", "cons": "Doesn't offer maternity leave for full time employees", "advice": null}, {"title": "digital media executive", "text": "Pros great money, fast paced, great opportunity to make decent money Cons large work load must be able to multi task", "rating": 5, "pros": "great money, fast paced, great opportunity to make decent money", "cons": "large work load must be able to multi task", "advice": null}, {"title": "Fun place to work", "text": "Pros Beautiful building to come to everyday. Nice cafeteria, gym and wellness center. Cons The pay is usually on the low side. Advice to Management Give people more opportunities to advance.", "rating": 5, "pros": "Beautiful building to come to everyday. Nice cafeteria, gym and wellness center.", "cons": "The pay is usually on the low side.", "advice": "Give people more opportunities to advance."}, {"title": "Executive Assistant", "text": "Pros Great benefits, good working atmosphere Cons going thru structural changes last year", "rating": 5, "pros": "Great benefits, good working atmosphere", "cons": "going thru structural changes last year", "advice": null}, {"title": "Account executive", "text": "Pros The only good thing was the money. Cons All they care about is numbers they use you up in a year and move to the next. Advice to Management Look at your high turn over rate and realize you have had some awesome employees but ran them off.", "rating": 1, "pros": "The only good thing was the money.", "cons": "All they care about is numbers they use you up in a year and move to the next.", "advice": "Look at your high turn over rate and realize you have had some awesome employees but ran them off."}, {"title": "Benefits are good", "text": "Pros Takes care of employees. Goes the extra mile. Great company to grow among other things. I have no bad things to say at all Cons I can't say anything bad really. Its a great large company to work at and I love it. New York office is beautiful", "rating": 5, "pros": "Takes care of employees. Goes the extra mile. Great company to grow among other things. I have no bad things to say at all", "cons": "I can't say anything bad really. Its a great large company to work at and I love it. New York office is beautiful", "advice": null}, {"title": "Only good at the Tower", "text": "Pros Getting to work with respected journalists. Cons Negative/stressful work environment at satellite offices, mostly due to understaffing and unrealistic expectations. Some corporate executives are abusive towards their DRs and are constantly cutting budgets. Advice to Management Don't dangle a carrot and then set people up to fail. Treat people with respect.", "rating": 3, "pros": "Getting to work with respected journalists.", "cons": "Negative/stressful work environment at satellite offices, mostly due to understaffing and unrealistic expectations. Some corporate executives are abusive towards their DRs and are constantly cutting budgets.", "advice": "Don't dangle a carrot and then set people up to fail. Treat people with respect."}, {"title": "Solid job, but was laid off", "text": "Pros Great resources, lots of wonderful people, huge huge company so plenty of cool parties and benefits- not to mention the cheap cafeteria! Also always have updated tools and software which is unusual for a big company. Great 401K match and healthcare. Cons Everything moves like molasses. As with big companies (especially publishing) when things are going bad, it only gets addressed when it's too late. My whole team was laid off with probably a year of decline where something could have been addressed- but its the slow ignoring of problems and pretending publishing is doing great that will cause these big problems. As with big companies too, meetings about meetings are king- and doing any actual work falls to the side. Also only 2 weeks vacation for your first 3 years, and thats terrible compared to all the new modern companies out there. Advice to Management With publishing (I've been in the industry for 8+ years) I've noticed that the higher up you are the more you can do whatever you want, things fall to the side, lots of vacation/\"working from home\", leaving your team to clean up. Publishing/media ends up being this land of sorely underpaid workers doing amazing work, never being able to really move around unless you're there for 10 years. Publishing is kind of a mess right now, but Hearst has been able to pull through usually. Still a solid job, solid company to work for, but the typical complaints about an old school company not really changing with the times.", "rating": 3, "pros": "Great resources, lots of wonderful people, huge huge company so plenty of cool parties and benefits- not to mention the cheap cafeteria! Also always have updated tools and software which is unusual for a big company. Great 401K match and healthcare.", "cons": "Everything moves like molasses. As with big companies (especially publishing) when things are going bad, it only gets addressed when it's too late. My whole team was laid off with probably a year of decline where something could have been addressed- but its the slow ignoring of problems and pretending publishing is doing great that will cause these big problems. As with big companies too, meetings about meetings are king- and doing any actual work falls to the side. Also only 2 weeks vacation for your first 3 years, and thats terrible compared to all the new modern companies out there.", "advice": "With publishing (I've been in the industry for 8+ years) I've noticed that the higher up you are the more you can do whatever you want, things fall to the side, lots of vacation/\"working from home\", leaving your team to clean up. Publishing/media ends up being this land of sorely underpaid workers doing amazing work, never being able to really move around unless you're there for 10 years. Publishing is kind of a mess right now, but Hearst has been able to pull through usually. Still a solid job, solid company to work for, but the typical complaints about an old school company not really changing with the times."}, {"title": "Decent place to work", "text": "Pros Great people, great work environment. Leadership is supportive and understanding Cons Pay is a bit low and have to pay for parking", "rating": 5, "pros": "Great people, great work environment. Leadership is supportive and understanding", "cons": "Pay is a bit low and have to pay for parking", "advice": null}, {"title": "Recruitment Manager", "text": "Pros Best place I have ever worked! I work for Hearst Business Media (a division of Hearst) and the leadership from top Downs is exceptional. From the CEO to my direct manager the VP of Recruitment I have experienced loyalty in myself, trust in my work and an incredible work environment. Cons The con is the size of our organization, Hearst is huge. But they way we fix this problem is allowing individual business unites to focus on their mission statements with flexibility of and running like a smaller organization with backing of a very large organization. Advice to Management Keep doing what you are doing. It really is an amazing place to work. Try to keep looking at individuals as they are, CONTRIBUTORS and keep taking care of those people.", "rating": 5, "pros": "Best place I have ever worked! I work for Hearst Business Media (a division of Hearst) and the leadership from top Downs is exceptional. From the CEO to my direct manager the VP of Recruitment I have experienced loyalty in myself, trust in my work and an incredible work environment.", "cons": "The con is the size of our organization, Hearst is huge. But they way we fix this problem is allowing individual business unites to focus on their mission statements with flexibility of and running like a smaller organization with backing of a very large organization.", "advice": "Keep doing what you are doing. It really is an amazing place to work. Try to keep looking at individuals as they are, CONTRIBUTORS and keep taking care of those people."}, {"title": "A Great Company, At A Crossraods", "text": "Pros Cash rich, debt free, broadly diversified company that is willing to take chances on new brands and potential marketing opportunities. A positive work environment that encourages and fosters an atmosphere of respect, courtesy and team spirit. Open access to professional development tools and inspirational content. Friendly competition between brands in the building that drives innovation and work ethic. Upward mobility possible given a good-fit opportunity. Cons Lack of clear communication about the company's strategy for thriving in a very and increasingly disrupted marketplace, particularly the impact on individual roles and job security. Advice to Management Be more open and honest with the troops about what's going on behind the scenes and what the REAL potential impacts will be, including OPPORTUNITIES for advancement and proactive career pivoting.", "rating": 5, "pros": "Cash rich, debt free, broadly diversified company that is willing to take chances on new brands and potential marketing opportunities. A positive work environment that encourages and fosters an atmosphere of respect, courtesy and team spirit. Open access to professional development tools and inspirational content. Friendly competition between brands in the building that drives innovation and work ethic. Upward mobility possible given a good-fit opportunity.", "cons": "Lack of clear communication about the company's strategy for thriving in a very and increasingly disrupted marketplace, particularly the impact on individual roles and job security.", "advice": "Be more open and honest with the troops about what's going on behind the scenes and what the REAL potential impacts will be, including OPPORTUNITIES for advancement and proactive career pivoting."}, {"title": "Ad Sales", "text": "Pros Really great brands, huge audience following, clients and consumers know the brands very well. Cons Very large organization and can feel like management is out of touch with local market struggles.", "rating": 5, "pros": "Really great brands, huge audience following, clients and consumers know the brands very well.", "cons": "Very large organization and can feel like management is out of touch with local market struggles.", "advice": null}, {"title": "Reporter - Full Time", "text": "Pros Working here provided a good amount of opportunity to show initiative to do work that you thought was important. A great opportunity to pitch and write original content every day. Cons They expect a lot of content every day from their reporters, such that opportunities to get in depth on certain issues could be difficult to come by on a regular basis. Advice to Management Invest more resources in helping reporters take time to invest in larger, important projects.", "rating": 3, "pros": "Working here provided a good amount of opportunity to show initiative to do work that you thought was important. A great opportunity to pitch and write original content every day.", "cons": "They expect a lot of content every day from their reporters, such that opportunities to get in depth on certain issues could be difficult to come by on a regular basis.", "advice": "Invest more resources in helping reporters take time to invest in larger, important projects."}, {"title": "VP", "text": "Pros Smart, Motivate People doing highly creative and innovative work Cons Difficult to cross silos of business Advice to Management Continue to engage and host executive engagement through Thinc programs.", "rating": 5, "pros": "Smart, Motivate People doing highly creative and innovative work", "cons": "Difficult to cross silos of business", "advice": "Continue to engage and host executive engagement through Thinc programs."}, {"title": "Art Assistant", "text": "Pros Fast paced, creative environment; inspiring office setting; ability to work with in-house photo studios and digital teams a plus Cons Vertical growth is difficult at a single company, necessary to move companies for any sort of promotion or title change Advice to Management Lots of changes happening, important to keep employees happy and in the loop", "rating": 5, "pros": "Fast paced, creative environment; inspiring office setting; ability to work with in-house photo studios and digital teams a plus", "cons": "Vertical growth is difficult at a single company, necessary to move companies for any sort of promotion or title change", "advice": "Lots of changes happening, important to keep employees happy and in the loop"}, {"title": "Standard Company", "text": "Pros Large corporation is a good benefit. Cons Minimal training can limit your growth opportunity.", "rating": 5, "pros": "Large corporation is a good benefit.", "cons": "Minimal training can limit your growth opportunity.", "advice": null}, {"title": "Great Place to Work, Very Little Pay", "text": "Pros -HDM is growing, leading the industry in digital - Collaborative work environment - Start up environment with perks - Great building Cons - Less pay than other companies (Conde Nast) that aren't doing as well - Long hours, often on the weekeneds Advice to Management Help people move within the company easier.", "rating": 3, "pros": "-HDM is growing, leading the industry in digital", "cons": "- Less pay than other companies (Conde Nast) that aren't doing as well", "advice": "Help people move within the company easier."}, {"title": "Great opportunity", "text": "Pros very creative environment, everyone is smart and willing to help you get to know the industry inside out Cons no guaranteed career advancement for interns Advice to Management none", "rating": 5, "pros": "very creative environment, everyone is smart and willing to help you get to know the industry inside out", "cons": "no guaranteed career advancement for interns", "advice": "none"}, {"title": "Senior Driector", "text": "Pros As an established media company, you have the opportunity to work with a variety of top-tier brands and partner companies. A tour of the building is also very worthwhile. Cons Very corporate environment and risky ideas with potential for high returns are often not considered", "rating": 5, "pros": "As an established media company, you have the opportunity to work with a variety of top-tier brands and partner companies. A tour of the building is also very worthwhile.", "cons": "Very corporate environment and risky ideas with potential for high returns are often not considered", "advice": null}, {"title": "Your Experience May Greatly Depend on Your Magazine and position", "text": "Pros Great boss, perks, casual enviroment Cons Hard to move up, a lot of turnover Advice to Management Make more clear pathways to climb the ladder for those that want it", "rating": 5, "pros": "Great boss, perks, casual enviroment", "cons": "Hard to move up, a lot of turnover", "advice": "Make more clear pathways to climb the ladder for those that want it"}, {"title": "Sales Executive", "text": "Pros Love the people and clients I work with Cons Wasn't told the truth up front Advice to Management Tell your reps the truth and they will respect you.", "rating": 5, "pros": "Love the people and clients I work with", "cons": "Wasn't told the truth up front", "advice": "Tell your reps the truth and they will respect you."}, {"title": "Nice Place + People", "text": "Pros Amazing work-life balance. Most days you can be out by 5pm with an hour lunch break. Gym and cafeteria at the office - people work out during the day! Beautiful building. Feels the most financially stable out of all the publishing companies out there. Company wide programming is great though. Cons For the division that I worked in, I found it to be a bit boring. I didn't love the sales reps and found them to be very ungrateful and rude. Promotions for my division weren't easy to come by either.", "rating": 5, "pros": "Amazing work-life balance. Most days you can be out by 5pm with an hour lunch break. Gym and cafeteria at the office - people work out during the day! Beautiful building. Feels the most financially stable out of all the publishing companies out there. Company wide programming is great though.", "cons": "For the division that I worked in, I found it to be a bit boring. I didn't love the sales reps and found them to be very ungrateful and rude. Promotions for my division weren't easy to come by either.", "advice": null}, {"title": "Web Mill", "text": "Pros Good earning potential, pretty lax environment, as long as you produce you dont really get messed with. Cons Products are PURE GARBAGE. You spend a week, a month, a year cultivating relationships with clients and customers and within 3 months of \"making the sale\" you will be dodging their calls. The websites are third party, open-source trash, which isnt the worst part, they then actually out-source the development of the sites to third world countries to save on even that which then comes back to the US for proof check before going to the client. The DMS offered is hands-off, they wont proactively plan a marketing strategy, everything is reactive, basically if they dont hear from the client and the client pays the bill they wont do anything until there is a complaint or threat of cancellation. Advice to Management Train your sales-staff on real digital marketing, hiring debt collectors and others that dont have any technical knowledge or experience hurts the image of our entire industry/profession.", "rating": 1, "pros": "Good earning potential, pretty lax environment, as long as you produce you dont really get messed with.", "cons": "Products are PURE GARBAGE. You spend a week, a month, a year cultivating relationships with clients and customers and within 3 months of \"making the sale\" you will be dodging their calls. The websites are third party, open-source trash, which isnt the worst part, they then actually out-source the development of the sites to third world countries to save on even that which then comes back to the US for proof check before going to the client. The DMS offered is hands-off, they wont proactively plan a marketing strategy, everything is reactive, basically if they dont hear from the client and the client pays the bill they wont do anything until there is a complaint or threat of cancellation.", "advice": "Train your sales-staff on real digital marketing, hiring debt collectors and others that dont have any technical knowledge or experience hurts the image of our entire industry/profession."}, {"title": "Marketing Director", "text": "Pros Great people. Good opportunities. Easy to be a lifer. Cons Pay is low and it takes forever to get a raise. Advice to Management Pay your employees better so they can focus on producing not pinching pennies.", "rating": 5, "pros": "Great people. Good opportunities. Easy to be a lifer.", "cons": "Pay is low and it takes forever to get a raise.", "advice": "Pay your employees better so they can focus on producing not pinching pennies."}, {"title": "work", "text": "Pros company care about you and your health Cons management does not care the employees Advice to Management pay attention", "rating": 5, "pros": "company care about you and your health", "cons": "management does not care the employees", "advice": "pay attention"}, {"title": "Innovative company with a strong focus on doing it right.", "text": "Pros Values the role design plays in branding and marketing. Very talented and diverse perspectives make group projects engaging and successful. The company genuinely care for employees like family. Cons Some disconnect with local stations and corporate. The communication is getting better with more group initiatives and fresh talent. Advice to Management Continue to break down communication barriers with group team exercises.", "rating": 5, "pros": "Values the role design plays in branding and marketing. Very talented and diverse perspectives make group projects engaging and successful. The company genuinely care for employees like family.", "cons": "Some disconnect with local stations and corporate. The communication is getting better with more group initiatives and fresh talent.", "advice": "Continue to break down communication barriers with group team exercises."}, {"title": "Ok", "text": "Pros You'll mostly have the resources you need Cons Lack of training, lot's of opinions", "rating": 3, "pros": "You'll mostly have the resources you need", "cons": "Lack of training, lot's of opinions", "advice": null}, {"title": "Great place to work but no room for growth or increases", "text": "Pros Great office location and amazing building in NYC. Great cafeteria. Cons Hearst boasts of (record profits) $10.8 billion revenue growth yet they had layoffs and gave everyone I know less than 2% annual merit increases. Pretty shameful for a company that is so diversified and swimming in profits to treat employees this way. Enough with 2008 recession era excuses. The economy has fully recovered for Hearst but their employees wouldn't know it. Advice to Management Reward your star employees.", "rating": 5, "pros": "Great office location and amazing building in NYC. Great cafeteria.", "cons": "Hearst boasts of (record profits) $10.8 billion revenue growth yet they had layoffs and gave everyone I know less than 2% annual merit increases. Pretty shameful for a company that is so diversified and swimming in profits to treat employees this way. Enough with 2008 recession era excuses. The economy has fully recovered for Hearst but their employees wouldn't know it.", "advice": "Reward your star employees."}, {"title": "Account Manager", "text": "Pros Great schedule for the money you make! Cons Constantly changing pay structure (it has always been good though)", "rating": 5, "pros": "Great schedule for the money you make!", "cons": "Constantly changing pay structure (it has always been good though)", "advice": null}, {"title": "Photojournalist", "text": "Pros Big company to work for Cons Issues with management. Ego-driven, immature personality. Occasionally assignment desk would send me on wild goose chases with little information to go on....some may see that as bad time/resource management.", "rating": 3, "pros": "Big company to work for", "cons": "Issues with management. Ego-driven, immature personality. Occasionally assignment desk would send me on wild goose chases with little information to go on....some may see that as bad time/resource management.", "advice": null}, {"title": "It's good while it lasts", "text": "Pros Generous salaries, cutting edge services, many resources Cons Male dominated, highly structured, don't listen. Advice to Management Relax", "rating": 3, "pros": "Generous salaries, cutting edge services, many resources", "cons": "Male dominated, highly structured, don't listen.", "advice": "Relax"}, {"title": "Good Company", "text": "Pros Very exciting fast-paced newsroom driven by a goal to cover the news of the day. Able to work with 26 hearst owned local stations across the country. Cons Overnight morning producer shift is from 1:30AM-10:30AM Requires thorough knowledge of journalism terms and language Advice to Management n/a", "rating": 5, "pros": "Very exciting fast-paced newsroom driven by a goal to cover the news of the day.", "cons": "Overnight morning producer shift is from 1:30AM-10:30AM", "advice": "n/a"}, {"title": "Integrated Brand Director", "text": "Pros Well-regarded company with good corporate culture Cons At the time, did not nurture or incentivize talented media sellers to expand across mediums (print, event, digital, etc)", "rating": 5, "pros": "Well-regarded company with good corporate culture", "cons": "At the time, did not nurture or incentivize talented media sellers to expand across mediums (print, event, digital, etc)", "advice": null}, {"title": "Pretty good", "text": "Pros it is what you would expect Cons hours could be a little crazy", "rating": 5, "pros": "it is what you would expect", "cons": "hours could be a little crazy", "advice": null}, {"title": "Not a job for those with a family", "text": "Pros decent pay structure and benefits Cons The expectation was to work day in and out. Don't expect to have a personal life. Also, it's selling phone book ads for a lot of money, in this day and age it's a tough sell. Also the internet packages are a lot cheaper from other providers.", "rating": 3, "pros": "decent pay structure and benefits", "cons": "The expectation was to work day in and out. Don't expect to have a personal life. Also, it's selling phone book ads for a lot of money, in this day and age it's a tough sell. Also the internet packages are a lot cheaper from other providers.", "advice": null}, {"title": "Hearst Connecticut - AVOID - YIKES", "text": "Pros Close to a car wash Cons Two Directors, old school , corny sweat shop factory environment, they have no clue , and are out of touch with reality. Like two old car salesman, cheap sales tactics and down right lie to clients. Most clients have been burned so you will be searching for fresh blood to sell the most current renamed bag of goods. Advice to Management Clear out the old baggage and fire the sales VPs who are driving the high turn over, and slinging the BS. The clients know it anytime they are asked for a contract your CT leadership will be having a fire sale anyway so no need for a contract. Old hack tactics and phony scripts wont cut it anymore.", "rating": 1, "pros": "Close to a car wash", "cons": "Two Directors, old school , corny sweat shop factory environment, they have no clue , and are out of touch with reality. Like two old car salesman, cheap sales tactics and down right lie to clients. Most clients have been burned so you will be searching for fresh blood to sell the most current renamed bag of goods.", "advice": "Clear out the old baggage and fire the sales VPs who are driving the high turn over, and slinging the BS. The clients know it anytime they are asked for a contract your CT leadership will be having a fire sale anyway so no need for a contract. Old hack tactics and phony scripts wont cut it anymore."}, {"title": "Internship Review", "text": "Pros Paid, Great hands-on experience, Cons Non-collaborative environment, Work is shared via other sites without compensation", "rating": 3, "pros": "Paid, Great hands-on experience,", "cons": "Non-collaborative environment, Work is shared via other sites without compensation", "advice": null}, {"title": "Your typical slow moving 130 year old company. For non-tech, it's fine. For tech, look elsewhere.", "text": "Pros Stability. Multitude of business arms. Cons Red tape. Slow moving. IT asks for your password over the phone.", "rating": 3, "pros": "Stability. Multitude of business arms.", "cons": "Red tape. Slow moving. IT asks for your password over the phone.", "advice": null}, {"title": "Hearst", "text": "Pros Beautiful offices and a great location Cons no room for growth unless you are looking for a position within their women's fashion group", "rating": 3, "pros": "Beautiful offices and a great location", "cons": "no room for growth unless you are looking for a position within their women's fashion group", "advice": null}, {"title": "AE", "text": "Pros Perks Perks Perks Perks Perks Cons Managers are not helpful and pay is horrible", "rating": 1, "pros": "Perks Perks Perks Perks Perks", "cons": "Managers are not helpful and pay is horrible", "advice": null}, {"title": "Ad Ops Coordinator/Traffic Manager/Campaign Manager", "text": "Pros Allowed to work from home. Cons Everything else. Low salary compared to the market in Seattle, expensive and bad health insurance. DON'T WORK HERE IF YOU'RE FEMALE AND EXPECT TO BE PAID FAIRLY, especially in a non-sales position. This is an environment of extreme favoritism and discrimination where Exec management protects his \"buddies\". Advice to Management Stop treating your employees like dumpsters. Don't change their entire job on a whim without renegotiating terms like roles, responsibilities, and SALARY.", "rating": 1, "pros": "Allowed to work from home.", "cons": "Everything else. Low salary compared to the market in Seattle, expensive and bad health insurance. DON'T WORK HERE IF YOU'RE FEMALE AND EXPECT TO BE PAID FAIRLY, especially in a non-sales position. This is an environment of extreme favoritism and discrimination where Exec management protects his \"buddies\".", "advice": "Stop treating your employees like dumpsters. Don't change their entire job on a whim without renegotiating terms like roles, responsibilities, and SALARY."}, {"title": "Sr VP", "text": "Pros Career building attitude towards employees Cons Lack of intra-entity collaboration Advice to Management Encourage intra- entity collabaration", "rating": 5, "pros": "Career building attitude towards employees", "cons": "Lack of intra-entity collaboration", "advice": "Encourage intra- entity collabaration"}, {"title": "Sales Rep", "text": "Pros Residual money from accounts and commission pay outs are quick Cons Stressful at times especially of your at a phone book location", "rating": 5, "pros": "Residual money from accounts and commission pay outs are quick", "cons": "Stressful at times especially of your at a phone book location", "advice": null}, {"title": "Great Company!", "text": "Pros Good mentors that have been in the business for many years. Cons Lots of mergers happening.", "rating": 5, "pros": "Good mentors that have been in the business for many years.", "cons": "Lots of mergers happening.", "advice": null}, {"title": "Could have been better", "text": "Pros impressive office, nice perks, cafeteria Cons poor management, no advancement, snobbish", "rating": 3, "pros": "impressive office, nice perks, cafeteria", "cons": "poor management, no advancement, snobbish", "advice": null}, {"title": "Hearst Magazines", "text": "Pros Great benefits, collaborative environment, competitive salaries. Cons Lots of jobs being outsourced.", "rating": 3, "pros": "Great benefits, collaborative environment, competitive salaries.", "cons": "Lots of jobs being outsourced.", "advice": null}, {"title": "work with different businesses across the US.", "text": "Pros Leads , People, environment, managment, products Cons Training was poor and lacked direction.", "rating": 5, "pros": "Leads , People, environment, managment, products", "cons": "Training was poor and lacked direction.", "advice": null}, {"title": "Executive Assistant", "text": "Pros - Long hours. - Can be interesting and you can learn alot Cons - Happiness depends on management", "rating": 5, "pros": "- Long hours.", "cons": "- Happiness depends on management", "advice": null}, {"title": "Account Manager", "text": "Pros Great connections within the advertising industry Cons Dog eat dog culture. Very cut throat environment", "rating": 3, "pros": "Great connections within the advertising industry", "cons": "Dog eat dog culture. Very cut throat environment", "advice": null}, {"title": "5-year Employee", "text": "Pros If you are willing to work hard and go above and beyond the job description, there are lots of opportunities to learn about the business and move up Cons Job security can be an issue in this ever-changing media business. It is a fast-paced industry that is not for the lazy or the unmotivated employee as you often work long hard hours. Advice to Management Communicate more than you think you have to. Understand each employees strengths and weakness and allow them to take on projects that play to their strengths.", "rating": 5, "pros": "If you are willing to work hard and go above and beyond the job description, there are lots of opportunities to learn about the business and move up", "cons": "Job security can be an issue in this ever-changing media business. It is a fast-paced industry that is not for the lazy or the unmotivated employee as you often work long hard hours.", "advice": "Communicate more than you think you have to. Understand each employees strengths and weakness and allow them to take on projects that play to their strengths."}, {"title": "OK Company", "text": "Pros We don't have to hit a time clock! Great culture Cons Salary Benefits suck! Nothing is confidential Advice to Management Please be more understanding to employees with children", "rating": 3, "pros": "We don't have to hit a time clock!", "cons": "Salary", "advice": "Please be more understanding to employees with children"}, {"title": "Oppressive Place to work", "text": "Pros Good training program in digital media for sales reps Cons Awful sales management - favoritism ran rampant. Job description vs actual job very different. Salespeople have no defined territories resulting in back biting conflict.", "rating": 3, "pros": "Good training program in digital media for sales reps", "cons": "Awful sales management - favoritism ran rampant. Job description vs actual job very different. Salespeople have no defined territories resulting in back biting conflict.", "advice": null}, {"title": "Great", "text": "Pros Great benefits and perks with beautiful cafeteria, on site nurse, full gym, and wide range of classes and seminars. Gorgeous building in a good location. Nice interesting co-workers (depends on your division). Secure corporate environment. Cons Long hours. Nothing really bad to say.", "rating": 5, "pros": "Great benefits and perks with beautiful cafeteria, on site nurse, full gym, and wide range of classes and seminars. Gorgeous building in a good location. Nice interesting co-workers (depends on your division). Secure corporate environment.", "cons": "Long hours. Nothing really bad to say.", "advice": null}, {"title": "Started out great but ended rather frustrating as bad behavior kept getting promoted", "text": "Pros Charlotte is the Hub for all of the Hearst stations' traffic departments. The best part was being surrounded by like minded people who only handled traffic. It was also wonderful to work with all of the stations in various states. Hearst Corporate management were very approachable and down to earth. Cons Poor training, people being hired with no experience, disconnect between the Hub and the stations, incompetent people being promoted into Assistant Manager positions resulting in a toxic work environment.", "rating": 5, "pros": "Charlotte is the Hub for all of the Hearst stations' traffic departments. The best part was being surrounded by like minded people who only handled traffic. It was also wonderful to work with all of the stations in various states. Hearst Corporate management were very approachable and down to earth.", "cons": "Poor training, people being hired with no experience, disconnect between the Hub and the stations, incompetent people being promoted into Assistant Manager positions resulting in a toxic work environment.", "advice": null}, {"title": "Executive Assistant", "text": "Pros Amazing experience. Great way to start your career. Learned a lot on the job. Office space is amazing along with the food in the cafeteria. Great location & fun work enviornment Cons Salary was very low. Health benefits were not the greatest. No bonus or incentive. Lots of personal work. Unfair treatment by management. Advice to Management Treat your employees better and offer more incentives. Pay your employees the salary they deserve especially with how hard they work.", "rating": 3, "pros": "Amazing experience. Great way to start your career. Learned a lot on the job. Office space is amazing along with the food in the cafeteria. Great location & fun work enviornment", "cons": "Salary was very low. Health benefits were not the greatest. No bonus or incentive. Lots of personal work. Unfair treatment by management.", "advice": "Treat your employees better and offer more incentives. Pay your employees the salary they deserve especially with how hard they work."}, {"title": "It is a job....", "text": "Pros I have been working there for over a year on a part time basis. I know I do a great job. You would think they would offer me a full-time position at some point. The pay is fair and the benefits are very good if you're a full-time employee. Cons I would like to advance with the company but there doesn't seem to be a right time fore you move up to full time in over a year. Advice to Management Take note of your good employees and offer them a full time position to retain them. They will definitely perform better for you.", "rating": 3, "pros": "I have been working there for over a year on a part time basis. I know I do a great job. You would think they would offer me a full-time position at some point. The pay is fair and the benefits are very good if you're a full-time employee.", "cons": "I would like to advance with the company but there doesn't seem to be a right time fore you move up to full time in over a year.", "advice": "Take note of your good employees and offer them a full time position to retain them. They will definitely perform better for you."}, {"title": "Its a great place to work if you are single and have no family to worry about.", "text": "Pros Great building and some nice perks to go with it, including the location right at Central Park. Good restaurants around too. Cons Most of the people working at Hearst don't have families because they live alternative lifestyles and they in turn don't get what it means to have employees that do have families. They rarely hire people that have families or they fire them very easily because they don't understand why you can't be available 24/7. Advice to Management You should even the playing field and allow people with families to thrive with you instead of shunning them. It is unbalanced in the way they treat women who want to have families and women that already have families.", "rating": 1, "pros": "Great building and some nice perks to go with it, including the location right at Central Park. Good restaurants around too.", "cons": "Most of the people working at Hearst don't have families because they live alternative lifestyles and they in turn don't get what it means to have employees that do have families. They rarely hire people that have families or they fire them very easily because they don't understand why you can't be available 24/7.", "advice": "You should even the playing field and allow people with families to thrive with you instead of shunning them. It is unbalanced in the way they treat women who want to have families and women that already have families."}, {"title": "Editorial Assistant", "text": "Pros Great staff, clear career trajectory with relatively quick promotions, beautiful building. Cons Low pay, decent (not great) medical benefits.", "rating": 3, "pros": "Great staff, clear career trajectory with relatively quick promotions, beautiful building.", "cons": "Low pay, decent (not great) medical benefits.", "advice": null}, {"title": "Nice place to work, but the downside is that it's publishing", "text": "Pros Beautiful building with tons of sunlight and great views. Cafeteria is great, gym in the building is amazing, good full benefits, generally a pleasant atmosphere to work in a nice area with good food options. Work day starts at 10am, which is nice. Cons Publishing is a tough industry where it doesn't seem to be getting any better. Every year there are more cuts and layoffs. If someone leaves, the job never gets filled....the work just gets redistributed. It can feel like you're juggling way too much at times because you're doing the work of multiple people. Pay is not so great, and upward mobility is difficult. Good to work for a couple years, but hard to stay long term because it doesn't seem to be getting any better. For example, holiday parties were canceled this year. Employees often feel nickled and dimed and expected to work late for no overtime. Advice to Management Higher pay would attract and retain more talent, especially if you're going to eliminate positions and push more work onto everyone else.", "rating": 5, "pros": "Beautiful building with tons of sunlight and great views. Cafeteria is great, gym in the building is amazing, good full benefits, generally a pleasant atmosphere to work in a nice area with good food options. Work day starts at 10am, which is nice.", "cons": "Publishing is a tough industry where it doesn't seem to be getting any better. Every year there are more cuts and layoffs. If someone leaves, the job never gets filled....the work just gets redistributed. It can feel like you're juggling way too much at times because you're doing the work of multiple people. Pay is not so great, and upward mobility is difficult. Good to work for a couple years, but hard to stay long term because it doesn't seem to be getting any better. For example, holiday parties were canceled this year. Employees often feel nickled and dimed and expected to work late for no overtime.", "advice": "Higher pay would attract and retain more talent, especially if you're going to eliminate positions and push more work onto everyone else."}, {"title": "International Marketing", "text": "Pros Exposure to a lot of different markets, due to the wide range of partnerships they had internationally. Cons Upper management does not realize how much work goes into garnering international deals, it's not as black/white as US deals. They should've invested more resources/efforts in international so that the department can truly flourish.", "rating": 3, "pros": "Exposure to a lot of different markets, due to the wide range of partnerships they had internationally.", "cons": "Upper management does not realize how much work goes into garnering international deals, it's not as black/white as US deals. They should've invested more resources/efforts in international so that the department can truly flourish.", "advice": null}, {"title": "Salary", "text": "Pros Good people that work there Cons Corporate is a little lax in benefits Advice to Management Listen to employees that do the work", "rating": 3, "pros": "Good people that work there", "cons": "Corporate is a little lax in benefits", "advice": "Listen to employees that do the work"}, {"title": "Company Overview", "text": "Pros Work in many different fields, including sales, accounting and the corporate side. Flexible hours. Great work life balance. Given freedom and trust to complete work. Cons Work comes in waves. Slammed with work or completely dead at times. Corporate office is a cubicle with a desktop. Not a place where the culture is free range and open.", "rating": 5, "pros": "Work in many different fields, including sales, accounting and the corporate side. Flexible hours. Great work life balance. Given freedom and trust to complete work.", "cons": "Work comes in waves. Slammed with work or completely dead at times. Corporate office is a cubicle with a desktop. Not a place where the culture is free range and open.", "advice": null}, {"title": "HDM Group", "text": "Pros Major player in the digital publishing industry Cons Toxic environment. Full of sychopants climbing the ladder at any cost.", "rating": 1, "pros": "Major player in the digital publishing industry", "cons": "Toxic environment. Full of sychopants climbing the ladder at any cost.", "advice": null}, {"title": "Chief Revenue Officer", "text": "Pros Strong corporate mission and vision, Great leadership, Smart and strategic approach to business and media, growth opportunities, productive and supportive environment. the company of the future. Cons i can't think of one.", "rating": 5, "pros": "Strong corporate mission and vision, Great leadership, Smart and strategic approach to business and media, growth opportunities, productive and supportive environment. the company of the future.", "cons": "i can't think of one.", "advice": null}, {"title": "Digital ad sales", "text": "Pros Good Starting point. potential to grow Cons Management can be overwhelming at certain times", "rating": 3, "pros": "Good Starting point. potential to grow", "cons": "Management can be overwhelming at certain times", "advice": null}, {"title": "Good Place to start", "text": "Pros Great place to start your career. Very good work life balance (9-5) The building is beautiful Cafeteria is great Cons No movement Very underpaid No recognition for work done", "rating": 3, "pros": "Great place to start your career.", "cons": "No movement", "advice": null}, {"title": "Roller Coaster", "text": "Pros forward-thinking corporate culture, beautiful building, fairly good benefits Cons Depending on which division you work for, can be cut-throat", "rating": 5, "pros": "forward-thinking corporate culture, beautiful building, fairly good benefits", "cons": "Depending on which division you work for, can be cut-throat", "advice": null}, {"title": "Great place to work", "text": "Pros Open and collaborative working environment, great benefits Cons wish there were bigger budgets for print Advice to Management keep doing what you are doing", "rating": 5, "pros": "Open and collaborative working environment, great benefits", "cons": "wish there were bigger budgets for print", "advice": "keep doing what you are doing"}, {"title": "Marketing Manager", "text": "Pros Innovative media company with tremendous room for growth for someone starting out in their career. Cons Not enough staff to most effectively manage the amount of work.", "rating": 5, "pros": "Innovative media company with tremendous room for growth for someone starting out in their career.", "cons": "Not enough staff to most effectively manage the amount of work.", "advice": null}, {"title": "Editorial Assistant", "text": "Pros Great place to start career....observe major holidays Cons HR pretty much stands between you and meeting the team. I have been on over 10 interviews at Hearst but seems like HR determines the fate of being selected as a valid candidate. I can imagine how many good talent doesn't get to meet teams. Very rare to move up within company. Advice to Management Try standing up to your word and being an Equal Opportunity Affirmative Action employer......", "rating": 3, "pros": "Great place to start career....observe major holidays", "cons": "HR pretty much stands between you and meeting the team. I have been on over 10 interviews at Hearst but seems like HR determines the fate of being selected as a valid candidate. I can imagine how many good talent doesn't get to meet teams. Very rare to move up within company.", "advice": "Try standing up to your word and being an Equal Opportunity Affirmative Action employer......"}, {"title": "Good place to start", "text": "Pros Great benefits, atmosphere and location Cons Part of a large, multi-layered, multi-divisional company", "rating": 5, "pros": "Great benefits, atmosphere and location", "cons": "Part of a large, multi-layered, multi-divisional company", "advice": null}, {"title": "Senior Sales Director", "text": "Pros Great building, great people, great products. Starting salaries are not as high as other companies, they don't have to pay since great working environment and great brands. Cons Bonuses are smaller than other companies.", "rating": 5, "pros": "Great building, great people, great products. Starting salaries are not as high as other companies, they don't have to pay since great working environment and great brands.", "cons": "Bonuses are smaller than other companies.", "advice": null}, {"title": "Account manager", "text": "Pros Conservative company pay is average overall professional attitudes cretain managers are great Cons NON competes it is ridiculous companies still have these with all access to info we all have. no company secrets anymore. Not enough great leaders", "rating": 3, "pros": "Conservative company pay is average overall professional attitudes cretain managers are great", "cons": "NON competes it is ridiculous companies still have these with all access to info we all have. no company secrets anymore. Not enough great leaders", "advice": null}, {"title": "Hearst magazines", "text": "Pros Great building to work in Cons The magazine industry is in crisis mode", "rating": 3, "pros": "Great building to work in", "cons": "The magazine industry is in crisis mode", "advice": null}, {"title": "Inside Sales Rep", "text": "Pros Good benefits, health, life insurance, 401K match Cons Too many directors and not enough support staff", "rating": 3, "pros": "Good benefits, health, life insurance, 401K match", "cons": "Too many directors and not enough support staff", "advice": null}, {"title": "Great Experience", "text": "Pros Good experience Learned a lot Hands on Cons Unpaid Intern when the company has funds", "rating": 5, "pros": "Good experience", "cons": "Unpaid Intern when the company has funds", "advice": null}, {"title": "Best of a distressed industry", "text": "Pros Hearst Tower, innovation focused, values excellence Cons Revenue plan unclear, esp with push into digital", "rating": 5, "pros": "Hearst Tower, innovation focused, values excellence", "cons": "Revenue plan unclear, esp with push into digital", "advice": null}, {"title": "Great opportunities depending on business unit", "text": "Pros Excellent physical environment, very good benefits. Driving innovation in a fragmented media environment. Rewards and exposes talent within the organization. Cons Not enough exec level women. HR not helpful. Reality doesn't map to touted culture Advice to Management Listen to your employees.", "rating": 3, "pros": "Excellent physical environment, very good benefits. Driving innovation in a fragmented media environment. Rewards and exposes talent within the organization.", "cons": "Not enough exec level women. HR not helpful. Reality doesn't map to touted culture", "advice": "Listen to your employees."}, {"title": "News", "text": "Pros Benefits, Resources, Opportunity to advance within company Cons Extremely long hours for salaried news employees", "rating": 5, "pros": "Benefits, Resources, Opportunity to advance within company", "cons": "Extremely long hours for salaried news employees", "advice": null}, {"title": "Great company, bad magazine", "text": "Pros Hearst leads the industry in its focus on digital innovation. The company provides solid benefits, and it's a joy to walk into that beautiful building every morning. Plus the caf can't be beat. Cons I worked at a brand that was rife with organizational and managerial problems. Dysfunctional relationships at the top of the masthead infected the entire staff. HR was notified on at least two occasions, and by different individuals, about the wildly inappropriate behavior of one staffer in particular, but did not intervene. Late, messy closes were the rule, not the exception. There was no performance review process. Talented editors were offered little feedback and no path to promotion. The magazine hemorrhaged staff. Advice to Management Invest in your workhorses. Create a meaningful mentorship program, and find new ways to grow young leaders. HR: Pay attention, please.", "rating": 3, "pros": "Hearst leads the industry in its focus on digital innovation. The company provides solid benefits, and it's a joy to walk into that beautiful building every morning. Plus the caf can't be beat.", "cons": "I worked at a brand that was rife with organizational and managerial problems. Dysfunctional relationships at the top of the masthead infected the entire staff. HR was notified on at least two occasions, and by different individuals, about the wildly inappropriate behavior of one staffer in particular, but did not intervene. Late, messy closes were the rule, not the exception. There was no performance review process. Talented editors were offered little feedback and no path to promotion. The magazine hemorrhaged staff.", "advice": "Invest in your workhorses. Create a meaningful mentorship program, and find new ways to grow young leaders. HR: Pay attention, please."}, {"title": "A good company", "text": "Pros good people, good longevity, fun Cons So-so health insurance, salaries not always competitive Advice to Management value your employees more and you'll get more out of them", "rating": 5, "pros": "good people, good longevity, fun", "cons": "So-so health insurance, salaries not always competitive", "advice": "value your employees more and you'll get more out of them"}, {"title": "HDM", "text": "Pros Great people, a lot of good talent, array of different projects. Cons Many moving pieces, tough to coordinate between teams. Advice to Management Need to value work/life balance more", "rating": 3, "pros": "Great people, a lot of good talent, array of different projects.", "cons": "Many moving pieces, tough to coordinate between teams.", "advice": "Need to value work/life balance more"}, {"title": "Large company, no opportunity for growth as an intern", "text": "Pros Amazing company to have on your resume Cons No pay, lots of busy work Advice to Management Pay your interns", "rating": 5, "pros": "Amazing company to have on your resume", "cons": "No pay, lots of busy work", "advice": "Pay your interns"}, {"title": "Deputy Editor", "text": "Pros Exposed to great ideas and talent. The company is open to innovation and working hard to grow and lead the industry. Exciting time across all divisions. Love the diversity of the business, and that building! Cons Layers of bureaucracy can lead to slower-than-desired change and too many cooks in the kitchen. Some big, fragile egos in key roles. Average employees often need to rely on industry news for company updates. Advice to Management Send out more company-wide announcements, especially about critical staff and/or brand changes. Become a leader in parental leave and other key benefits. Amp up your employee wellness programs as well as your sustainable workplace initiatives.", "rating": 5, "pros": "Exposed to great ideas and talent. The company is open to innovation and working hard to grow and lead the industry. Exciting time across all divisions. Love the diversity of the business, and that building!", "cons": "Layers of bureaucracy can lead to slower-than-desired change and too many cooks in the kitchen. Some big, fragile egos in key roles. Average employees often need to rely on industry news for company updates.", "advice": "Send out more company-wide announcements, especially about critical staff and/or brand changes. Become a leader in parental leave and other key benefits. Amp up your employee wellness programs as well as your sustainable workplace initiatives."}, {"title": "N/A", "text": "Pros Upper management is always nice to work with. They are always open to new ideas. They make you feel valued a lot of the time. Cons I haven't had anything to complain about yet.", "rating": 5, "pros": "Upper management is always nice to work with. They are always open to new ideas. They make you feel valued a lot of the time.", "cons": "I haven't had anything to complain about yet.", "advice": null}, {"title": "This is a great company to work for. There are many platforms to sell and the benefits are good .", "text": "Pros If you are in sales and are able to perform, you can create the flexibility you need to balance work and family. Cons They seen to put somewhat of a cap on your earnings once you get to a certain level. There is also a lot of turnover because of this. Advice to Management Many of the top talent leaves once they realize they are capped . It's tough to find good people and there seems to be a lot of turnover . Let your sales people make the money they have earned .", "rating": 3, "pros": "If you are in sales and are able to perform, you can create the flexibility you need to balance work and family.", "cons": "They seen to put somewhat of a cap on your earnings once you get to a certain level. There is also a lot of turnover because of this.", "advice": "Many of the top talent leaves once they realize they are capped . It's tough to find good people and there seems to be a lot of turnover . Let your sales people make the money they have earned ."}, {"title": "Assistant", "text": "Pros Great people and great work place! Cons None that I can think of Advice to Management None", "rating": 5, "pros": "Great people and great work place!", "cons": "None that I can think of", "advice": "None"}, {"title": "Good Company, but needs to pay more", "text": "Pros Cafeteria and gym on-site, access to great brands Cons Way too crowded, barely any offices, low pay Advice to Management Pay your employees more so they don't leave!", "rating": 5, "pros": "Cafeteria and gym on-site, access to great brands", "cons": "Way too crowded, barely any offices, low pay", "advice": "Pay your employees more so they don't leave!"}, {"title": "Working at Hearst", "text": "Pros Intelligent, driven people. Want to help you grow Great company culture Cons Slow room for growth. If you are promoted you will not see the money that comes with it", "rating": 5, "pros": "Intelligent, driven people.", "cons": "Slow room for growth. If you are promoted you will not see the money that comes with it", "advice": null}, {"title": "Regional Media Consultant", "text": "Pros Outstanding company that has a cutting edge, diverse, and well funded base. Best of breed products, and continuously investing in new businesses. Cons Local Management is out of touch with the staff. A lack of focus on the employees needs, and a system designed for constant replacement of many of the staff. Advice to Management Put a higher salary base in the local budget, so that employees will consider a career and not a job.", "rating": 5, "pros": "Outstanding company that has a cutting edge, diverse, and well funded base. Best of breed products, and continuously investing in new businesses.", "cons": "Local Management is out of touch with the staff. A lack of focus on the employees needs, and a system designed for constant replacement of many of the staff.", "advice": "Put a higher salary base in the local budget, so that employees will consider a career and not a job."}, {"title": "Hearst TV", "text": "Pros A solid company with great benefits. Promotes from within and is generally a pleasant place to work. Cons Large company that has the to be expected large company challenges.", "rating": 3, "pros": "A solid company with great benefits. Promotes from within and is generally a pleasant place to work.", "cons": "Large company that has the to be expected large company challenges.", "advice": null}, {"title": "You need to be the right", "text": "Pros Big company. Good location. Nice coworkers(most). Cons There's no growth here unless what I've mentioned in the title. If you looks across the manager levels and up, they are all the same. There are no minorities hired for manager positions. You can work as many hours as they need you to but at the end of the project deadline, they don't appreciate all the time and effort you put in. Advice to Management Don't you see there has been a lot of turnovers lately?", "rating": 1, "pros": "Big company. Good location. Nice coworkers(most).", "cons": "There's no growth here unless what I've mentioned in the title. If you looks across the manager levels and up, they are all the same. There are no minorities hired for manager positions.", "advice": "Don't you see there has been a lot of turnovers lately?"}, {"title": "Once in a Lifetime Experience!", "text": "Pros Worked as an intern on the Ad/Sales side for the Hearst Design Group. Everyone on the team was supportive and encouraged interns to be proactive, curious, and hard working. Learned a lot about the publishing industry and how it is integral to a magazine. Hearst community is unified and strong! Cons The only con is that interns are unpaid (school credit only). Especially since living in New York is very expensive, would encourage interns to look for grant or funding for costs. Advice to Management Hopefully interns will be able to receive a stipend or have at least some costs covered (meals, travel, etc.)", "rating": 5, "pros": "Worked as an intern on the Ad/Sales side for the Hearst Design Group. Everyone on the team was supportive and encouraged interns to be proactive, curious, and hard working. Learned a lot about the publishing industry and how it is integral to a magazine. Hearst community is unified and strong!", "cons": "The only con is that interns are unpaid (school credit only). Especially since living in New York is very expensive, would encourage interns to look for grant or funding for costs.", "advice": "Hopefully interns will be able to receive a stipend or have at least some costs covered (meals, travel, etc.)"}, {"title": "Encourages long careers; uncompetitive salaries", "text": "Pros The tower in Columbus Circle is the most beautiful place I've ever worked. The natural light – it is leed-certified – makes an enormous difference. I have worked with the company off and on over the years, and I accepted my last full-time gig there based on the cafeteria alone.  This is a very corporate environment, but everything depends on the particular group you work in. There are some extraordinarily lovely human beings in this company. Abigail Greene, who has been with the company for 15 or 20 years, is a goddess. Cons Hours can be brutal. Salaries tend to be low. One gets the sense that the company can keep celery slow because it attracts a certain demographic – those with trust funds – of employee. Who don't need to be properly paid. Advice to Management Properly compensate your people.", "rating": 5, "pros": "The tower in Columbus Circle is the most beautiful place I've ever worked. The natural light – it is leed-certified – makes an enormous difference. I have worked with the company off and on over the years, and I accepted my last full-time gig there based on the cafeteria alone.", "cons": "Hours can be brutal. Salaries tend to be low. One gets the sense that the company can keep celery slow because it attracts a certain demographic – those with trust funds – of employee. Who don't need to be properly paid.", "advice": "Properly compensate your people."}, {"title": "Great Starting Oppertunity", "text": "Pros Some really friendly co-workers great cafe for lunch gym and health center in tower Cons low pay some benefits expensive gym membership disorganized at times Advice to Management be more on top of getting things done, stay informed on what is happening in your department and increase pay to stay equal if not better then other competing publishers.", "rating": 5, "pros": "Some really friendly co-workers", "cons": "low pay", "advice": "be more on top of getting things done, stay informed on what is happening in your department and increase pay to stay equal if not better then other competing publishers."}, {"title": "Digital Sales Specialist", "text": "Pros Good company, nice people and potential Cons compensation and turn over and systems issues", "rating": 3, "pros": "Good company, nice people and potential", "cons": "compensation and turn over and systems issues", "advice": null}, {"title": "executive assistant", "text": "Pros Nice building. friendly people. good benefits Cons The HR dept isn't the most skilled", "rating": 5, "pros": "Nice building. friendly people. good benefits", "cons": "The HR dept isn't the most skilled", "advice": null}, {"title": "Good company to work for", "text": "Pros Leading edge of technology. Great exchange between stations. Cons Room for advancement is not a strong point of this company. Advice to Management Listen to your employees", "rating": 5, "pros": "Leading edge of technology. Great exchange between stations.", "cons": "Room for advancement is not a strong point of this company.", "advice": "Listen to your employees"}, {"title": "ok", "text": "Pros Ok place to work - friendly people overall but not very efficient. Good place to start your career but probably not advance or learn a lot. Cons Outdated tools and technology, high employee turnover. Static industry and the company reflects that. Very corporate culture, not much innovation", "rating": 3, "pros": "Ok place to work - friendly people overall but not very efficient. Good place to start your career but probably not advance or learn a lot.", "cons": "Outdated tools and technology, high employee turnover. Static industry and the company reflects that. Very corporate culture, not much innovation", "advice": null}, {"title": "Sales", "text": "Pros Fun environment and the people are great. Holiday parties and we decorate the office. Lots of contests where you can win money. Cons Lack of Support and the digital campaigns were failing to execute. Too much churn going on and loss of existing customers Advice to Management Listen to your teams ideas and creative concepts. Don't put as much pressure on the employees and expect too much from the people who are ACTUALLY working hard and hitting their goals.", "rating": 3, "pros": "Fun environment and the people are great. Holiday parties and we decorate the office. Lots of contests where you can win money.", "cons": "Lack of Support and the digital campaigns were failing to execute. Too much churn going on and loss of existing customers", "advice": "Listen to your teams ideas and creative concepts. Don't put as much pressure on the employees and expect too much from the people who are ACTUALLY working hard and hitting their goals."}, {"title": "Editorial Assistant", "text": "Pros It's a great place to work Cons It is kind of hard to advance", "rating": 5, "pros": "It's a great place to work", "cons": "It is kind of hard to advance", "advice": null}, {"title": "PR", "text": "Pros Nice cafeteria, nice views on every floor, clean offices, friendly people (depending on the magazine) Cons The PR department will work you like a DOG", "rating": 3, "pros": "Nice cafeteria, nice views on every floor, clean offices, friendly people (depending on the magazine)", "cons": "The PR department will work you like a DOG", "advice": null}, {"title": "Journalist", "text": "Pros Buying power allows journalists to access vital sources, resources and benefits were OK, camaraderie made it all work. I can recommend depending on position. Cons Business-minded approach means people dont get a lot of instruction. People get moved around without notice. Some of the requisites have nothing to do with best for audience. Advice to Management Listen to journalists, especially newer staff from outside. Commit to training and development of young staffers. Stop cutting staff to meet a target. Do right by the people working for you.", "rating": 3, "pros": "Buying power allows journalists to access vital sources, resources and benefits were OK, camaraderie made it all work. I can recommend depending on position.", "cons": "Business-minded approach means people dont get a lot of instruction. People get moved around without notice. Some of the requisites have nothing to do with best for audience.", "advice": "Listen to journalists, especially newer staff from outside. Commit to training and development of young staffers. Stop cutting staff to meet a target. Do right by the people working for you."}, {"title": "Senior Designer", "text": "Pros The people and the hours. Cons Design aesthetic is limited by editors and typically outdated. Design usually panders to middle america. Old school business mentality. Very clicky & fashion driven yet not relevant for the current trends.", "rating": 3, "pros": "The people and the hours.", "cons": "Design aesthetic is limited by editors and typically outdated. Design usually panders to middle america. Old school business mentality. Very clicky & fashion driven yet not relevant for the current trends.", "advice": null}, {"title": "Innovative and on the go", "text": "Pros Great teams and talents. great building. creative environment Cons mostly Always on 24/7", "rating": 5, "pros": "Great teams and talents. great building. creative environment", "cons": "mostly Always on 24/7", "advice": null}, {"title": "Sales Coordinator", "text": "Pros Great management, Excellent Location, Great Company Cons Not a lot of upward mobility in outside offices", "rating": 5, "pros": "Great management, Excellent Location, Great Company", "cons": "Not a lot of upward mobility in outside offices", "advice": null}, {"title": "Great place to start", "text": "Pros I interned with Seventeen magazine after having been a big fan of it for many years. I recommend you plan ahead and get a head start in interning here if you're into the women/teen brands since it's a great start but no longer seen as impressive since they recycle interns each semester, EVERYONE has it on their resume. Don't make seventeen the cherry on top of your resume right before graduation, instead try mixing two internships together, whether it's Good Housekeeping, Cosmo, Dr.Oz , etc. I interned for a few other brands in the building for about a year and a half and I found that you have a lot of freedom to try to make it the best for yourself. it was obvious that a lot of staff members don't trust their interns or are insecure about handing off quality work. Most magazines are shrinking so they can't give away bylines like they're candy. However you have access to a great roster of people to email for coffee or a take a long lunch and go on an informational interview if you can get one. Different types of personalities among staff members, some grumpy and stressed out people and some happy people who are working in an industry they love. Cons You won't always get good work to do and it's easy to get burnt out. Take the opportunity to learn new skills during down time. While there are opportunities to move up, getting an interview with HR through their company website is almost impossible. Some brands are really killing it on the social and digital space (because they're household names not necessarily cause the content is good), but who really buys their print anymore when you can get the exact content for free online? I wouldn't even read them if they were free at the dentists office and I actually know some of the people writing it. Advice to Management It's overwhelming because of the amount of applicants, but have your HR real give more feedback to applicants. One look at some of the new hires' LinkedIn profiles and it's obvious that they got in through a connection because they're not qualified !!! Stop hiring the same white girls over and over and take a look at experience, skills and work ethic.", "rating": 5, "pros": "I interned with Seventeen magazine after having been a big fan of it for many years. I recommend you plan ahead and get a head start in interning here if you're into the women/teen brands since it's a great start but no longer seen as impressive since they recycle interns each semester, EVERYONE has it on their resume. Don't make seventeen the cherry on top of your resume right before graduation, instead try mixing two internships together, whether it's Good Housekeeping, Cosmo, Dr.Oz , etc. I interned for a few other brands in the building for about a year and a half and I found that you have a lot of freedom to try to make it the best for yourself. it was obvious that a lot of staff members don't trust their interns or are insecure about handing off quality work. Most magazines are shrinking so they can't give away bylines like they're candy. However you have access to a great roster of people to email for coffee or a take a long lunch and go on an informational interview if you can get one. Different types of personalities among staff members, some grumpy and stressed out people and some happy people who are working in an industry they love.", "cons": "You won't always get good work to do and it's easy to get burnt out. Take the opportunity to learn new skills during down time. While there are opportunities to move up, getting an interview with HR through their company website is almost impossible. Some brands are really killing it on the social and digital space (because they're household names not necessarily cause the content is good), but who really buys their print anymore when you can get the exact content for free online? I wouldn't even read them if they were free at the dentists office and I actually know some of the people writing it.", "advice": "It's overwhelming because of the amount of applicants, but have your HR real give more feedback to applicants. One look at some of the new hires' LinkedIn profiles and it's obvious that they got in through a connection because they're not qualified !!! Stop hiring the same white girls over and over and take a look at experience, skills and work ethic."}, {"title": "Great Company", "text": "Pros Very nice atmosphere to work in, great people, nice park of NYC. Loved working with a really fantastic staff. Cons Communication between departments need to be improved.", "rating": 5, "pros": "Very nice atmosphere to work in, great people, nice park of NYC. Loved working with a really fantastic staff.", "cons": "Communication between departments need to be improved.", "advice": null}, {"title": "Account Exectuive", "text": "Pros Nice office, friendly co-workers, people work very hard Cons pay is very low for the expectations of you. Systems are horribly slow. Way too much work for the pay. You could work 23 hrs per day and not get done what they expect and get paid on the low end of an AE in KC across the stations. Have non compete so cant go anywhere else to earn a living. Modern advancements in field come slow. All competitors have the newer products before we do. Advice to Management Pay more. get rid of the stupid non-compete.", "rating": 3, "pros": "Nice office, friendly co-workers, people work very hard", "cons": "pay is very low for the expectations of you. Systems are horribly slow. Way too much work for the pay. You could work 23 hrs per day and not get done what they expect and get paid on the low end of an AE in KC across the stations. Have non compete so cant go anywhere else to earn a living. Modern advancements in field come slow. All competitors have the newer products before we do.", "advice": "Pay more. get rid of the stupid non-compete."}, {"title": "Operations Engineer", "text": "Pros Good work environment and interesting job. Cons Not great pay and terrible schedule. Advice to Management Faster raises", "rating": 5, "pros": "Good work environment and interesting job.", "cons": "Not great pay and terrible schedule.", "advice": "Faster raises"}, {"title": "Great", "text": "Pros It's a great atmosphere and everyone knows what they're doing and are always willing to help. Cons NY gets alot more perks than other offices. Advice to Management not applicable", "rating": 5, "pros": "It's a great atmosphere and everyone knows what they're doing and are always willing to help.", "cons": "NY gets alot more perks than other offices.", "advice": "not applicable"}, {"title": "real bad", "text": "Pros They have a great product, but don't know how to use it Cons pretty much everything else. real bad", "rating": 1, "pros": "They have a great product, but don't know how to use it", "cons": "pretty much everything else. real bad", "advice": null}, {"title": "Multimedia Specialist", "text": "Pros Can earn good commission if Hearst doesn't figure out a way to steal it back! Cons Company doesn't care about its employees at all. High turn over rate. Advice to Management Take better care of your employees.", "rating": 3, "pros": "Can earn good commission if Hearst doesn't figure out a way to steal it back!", "cons": "Company doesn't care about its employees at all. High turn over rate.", "advice": "Take better care of your employees."}, {"title": "Video Producer-Editor", "text": "Pros Established company and a difficult to come by full time position in media. If you get lucky you might find a safe little hidey hole in the big tower where you can make your work. Cons The current Head of Video Programming is incompetent and the department is a revolving door. This legacy media company has no idea how to treat its video employees, which makes sense because they have an entrenched magazine model. Advice to Management Fire the current Head of Video Programming. Allow the next person to make far reaching changes to the way that Video Production is handled at Hearst, empowering the video employees with more autonomy and authority, so that they are not subject to scrutiny and direction by those less qualified than them. Adopt a model of cultivating talent as opposed to burning through it and finding someone else. Dedicate more budget resources to videos.", "rating": 3, "pros": "Established company and a difficult to come by full time position in media. If you get lucky you might find a safe little hidey hole in the big tower where you can make your work.", "cons": "The current Head of Video Programming is incompetent and the department is a revolving door. This legacy media company has no idea how to treat its video employees, which makes sense because they have an entrenched magazine model.", "advice": "Fire the current Head of Video Programming. Allow the next person to make far reaching changes to the way that Video Production is handled at Hearst, empowering the video employees with more autonomy and authority, so that they are not subject to scrutiny and direction by those less qualified than them. Adopt a model of cultivating talent as opposed to burning through it and finding someone else. Dedicate more budget resources to videos."}, {"title": "Great place to work", "text": "Pros Friendly staff and management. Workers can see their own progress reports on a daily basis on how they did on a daily basis. Cons Lack of staff for the work that needs to be done Advice to Management Hire more staff", "rating": 5, "pros": "Friendly staff and management. Workers can see their own progress reports on a daily basis on how they did on a daily basis.", "cons": "Lack of staff for the work that needs to be done", "advice": "Hire more staff"}, {"title": "Media Consultant", "text": "Pros Benefits and able to learn alot Cons Poor Management, difficult goals, flexibility", "rating": 3, "pros": "Benefits and able to learn alot", "cons": "Poor Management, difficult goals, flexibility", "advice": null}, {"title": "Great Place to Work", "text": "Pros Lots of room to grow - can easily switch from one magazine to another. A little harder to switch to another one of the Hearst-owned companies but it can be done. Cons Staffs are pretty lean so management may not have the time to train you.", "rating": 5, "pros": "Lots of room to grow - can easily switch from one magazine to another. A little harder to switch to another one of the Hearst-owned companies but it can be done.", "cons": "Staffs are pretty lean so management may not have the time to train you.", "advice": null}, {"title": "Great experience working with a large corporate company", "text": "Pros They are subjective to your needs and WBAL is the number one station in Baltimore so that is a huge PRO. Cons A few internal issues. No training. Advice to Management Work closer with training new AE's.", "rating": 5, "pros": "They are subjective to your needs and WBAL is the number one station in Baltimore so that is a huge PRO.", "cons": "A few internal issues. No training.", "advice": "Work closer with training new AE's."}, {"title": "Visual Designer", "text": "Pros Good work and life balance Cons long process to get projects approved", "rating": 5, "pros": "Good work and life balance", "cons": "long process to get projects approved", "advice": null}, {"title": "Account Executive", "text": "Pros Good benefits, respected in business community Cons leadership is focused on selling specific products even if not necessarily best for the customer.", "rating": 3, "pros": "Good benefits, respected in business community", "cons": "leadership is focused on selling specific products even if not necessarily best for the customer.", "advice": null}, {"title": "Modern Tech Outlook with Antiquated Publishing Culture", "text": "Pros Hearst has done a great job of creating relevant business models in new (tech-centric) distribution channels. Hearst was the first to launch two channels on SnapChat Discover, be part of beta launch with Apple News, and even run a beta test for all new kinds of editorial and ad tech with Facebook and Pinterest. Working on either side of the team, whether it be editorial, tech, UX or biz dev, the company allows you to be part of a project that has never been done before AND allows you to get access to an audience of millions with ideal partnerships like the big social media players. Cons The Hearst tech team, especially on the product side, desperately needs leadership that has experience in product development on the social media or ad tech side. Knowing the ecosystem in those fields, as well as having deep knowledge and experience in agile is crucial. The culture that manifests with poor management or experience in modern tech fosters less than par developers, hierarchies and cliques that mirror the outdated cultural model to that of publishing. Advice to Management Two pieces of advice: 1. Act like a tech environment and be open. It definitely is there, but there is room for improvement especially when it comes to transparency. 2. Bring in leaders or employees from social media, major ad networks or startups that provide B2B services, to lead Hearst Product and culture into the 21st century. Being technical and having experience in agile is crucial to keep up with tech partners.", "rating": 3, "pros": "Hearst has done a great job of creating relevant business models in new (tech-centric) distribution channels. Hearst was the first to launch two channels on SnapChat Discover, be part of beta launch with Apple News, and even run a beta test for all new kinds of editorial and ad tech with Facebook and Pinterest.", "cons": "The Hearst tech team, especially on the product side, desperately needs leadership that has experience in product development on the social media or ad tech side. Knowing the ecosystem in those fields, as well as having deep knowledge and experience in agile is crucial.", "advice": "Two pieces of advice:"}, {"title": "Master Control Operator for 40/29", "text": "Pros Fixed schedule Great co-workers and manager room to move up within your own station and to other Hearst Stations Cons Pay is on lower end Can be stressful at times", "rating": 5, "pros": "Fixed schedule", "cons": "Pay is on lower end", "advice": null}, {"title": "Senior Manager Employee Benefits", "text": "Pros Had the ability to grow within the department over the course of my career. Great team in Charlotte that brought out the best in each of us, created a great team dynamic Cons Senior management not always on the same page with the needs of the department Advice to Management Get a better grasp of what is valuable to the employees.", "rating": 5, "pros": "Had the ability to grow within the department over the course of my career. Great team in Charlotte that brought out the best in each of us, created a great team dynamic", "cons": "Senior management not always on the same page with the needs of the department", "advice": "Get a better grasp of what is valuable to the employees."}, {"title": "Great Experience", "text": "Pros I worked in the editorial department. I worked closely with the home department! We were put into in groups Cons We did a lot of desk work. Coffee errands were a regular thing. I liked them. It allowed me to roam the city.", "rating": 5, "pros": "I worked in the editorial department. I worked closely with the home department!", "cons": "We did a lot of desk work. Coffee errands were a regular thing. I liked them. It allowed me to roam the city.", "advice": null}, {"title": "Great company", "text": "Pros Hearst is a great company to work for. Many talented people. Cons It is a corporation so it runs like a big company.", "rating": 5, "pros": "Hearst is a great company to work for. Many talented people.", "cons": "It is a corporation so it runs like a big company.", "advice": null}, {"title": "Was great at the time", "text": "Pros Working at Hearst was one of my favorite jobs. Of the other major publishers I worked for (Conde Nast, Martha Stewart Living Omnimedia), Hearst had it together in the digital sphere. And that private gym! Cons Pay was lower than most.", "rating": 5, "pros": "Working at Hearst was one of my favorite jobs. Of the other major publishers I worked for (Conde Nast, Martha Stewart Living Omnimedia), Hearst had it together in the digital sphere. And that private gym!", "cons": "Pay was lower than most.", "advice": null}, {"title": "NA", "text": "Pros Downtown location for Employment and commute Cons Young team unorganized fast paced Advice to Management Na", "rating": 5, "pros": "Downtown location for Employment and commute", "cons": "Young team unorganized fast paced", "advice": "Na"}, {"title": "Digital Content Producer", "text": "Pros great building and perks. you will learn and teach. top of field coworkers. great views and wellness center. near subway and central park.good benefits and 401k match. Cons hard to get promoted. lots of red tape to get things accomplished. cutthroat mentality. you will most likely work in a cube. your view is incredible. Advice to Management promote people who deserve to be promoted. MIX THINGS UP AND ASK new things from employees now and again.", "rating": 5, "pros": "great building and perks. you will learn and teach. top of field coworkers. great views and wellness center. near subway and central park.good benefits and 401k match.", "cons": "hard to get promoted. lots of red tape to get things accomplished. cutthroat mentality. you will most likely work in a cube. your view is incredible.", "advice": "promote people who deserve to be promoted. MIX THINGS UP AND ASK new things from employees now and again."}, {"title": "Analyst", "text": "Pros Great work atmosphere and great benefits Cons I don't have anything bad to say", "rating": 5, "pros": "Great work atmosphere and great benefits", "cons": "I don't have anything bad to say", "advice": null}, {"title": "Great place", "text": "Pros It's a wonderful place to work. I love my bosses and the culture is great Cons I have nothing to say, it'a great", "rating": 5, "pros": "It's a wonderful place to work. I love my bosses and the culture is great", "cons": "I have nothing to say, it'a great", "advice": null}, {"title": "Not ideal", "text": "Pros It pays the bills You are exposed to a unique experience and get to see how magazines are run Many talented writers work there Cons Management doesn't think about the people below them Culture of treating low-level workers badly Ever-shrinking budget puts extra strain on all employees", "rating": 3, "pros": "It pays the bills", "cons": "Management doesn't think about the people below them", "advice": null}, {"title": "Good place to work", "text": "Pros Good staff, decent training programs, good health center, good benefits Cons Alot of bureaucracy to get things done, not very nimble. Bonus structure is inconsistent.", "rating": 5, "pros": "Good staff, decent training programs, good health center, good benefits", "cons": "Alot of bureaucracy to get things done, not very nimble. Bonus structure is inconsistent.", "advice": null}, {"title": "Automotive Media Consultant", "text": "Pros Good work environment. Company has excellent on going training and allows some flexibility. Cons Difficult to move up within company.", "rating": 5, "pros": "Good work environment. Company has excellent on going training and allows some flexibility.", "cons": "Difficult to move up within company.", "advice": null}, {"title": "Hearst at 6 months", "text": "Pros Would rather pay overtime than be short staffed. Ability to transfer to other Hearst Station ls with ease. Cons Although recently aquired stations are upgrading the construction can be annoying", "rating": 5, "pros": "Would rather pay overtime than be short staffed. Ability to transfer to other Hearst Station ls with ease.", "cons": "Although recently aquired stations are upgrading the construction can be annoying", "advice": null}, {"title": "Intern", "text": "Pros Everyone in the company is very nice and willing to help. Lots of things to learn, in my department account executives took me to different sales meetings. Hearst itself has lots of resources to offer. Cons Since lots of work are performance-based, many people work very hard under great stress. The environment sometimes can be intense. All interns are unpaid... which kinda suck. Advice to Management Any form of compensation would be much appreciated - Hearst is a profitable company. Making hours more flexible? Not everyone is a morning person and I personally don't like to be in the office at 8AM or even earlier.", "rating": 5, "pros": "Everyone in the company is very nice and willing to help.", "cons": "Since lots of work are performance-based, many people work very hard under great stress. The environment sometimes can be intense.", "advice": "Any form of compensation would be much appreciated - Hearst is a profitable company."}, {"title": "Fashion Intern", "text": "Pros Everyone was really sweet and friendly Cons Boring culture compared to condenast", "rating": 3, "pros": "Everyone was really sweet and friendly", "cons": "Boring culture compared to condenast", "advice": null}, {"title": "Digital Advertising Sales & Trainer", "text": "Pros Great company to work for in every aspect and always evolving. Recognizes excellence in their sales teams and individuals. Offers challenging sales competitions and great incentives. Fast paced multi -ask happy work environments. Treat their customers with utmost loyalty and awesome entertaining incentives. Cons 90% of Management is excellent and highly professional and an honor to work with. 10% needs major improvement over hall to certain few unprofessional managers holding the company back undetected. For their own personal purposes or unethical preferences. Reporting this unfortunate and unexpected unprofessional or offensive behavior to HR - you get labeled rather then confidential and treated worse. Needs major management inventory audit to prevent ultimately losing revenue in this manner. Any loss is bad for this industry, especially when coming from within. Loss of Customers /advertising media buys - will go elsewhere -if they lose their sales confidant representative with out notice or suspect unfair treatment. The customer is ultimately effected. Grey area. Thus causing unnecessary confusion, mistakes, reprints, make goods, chaos and growing escalation departments. Risking millions and costing company more to compensate for escalate. Possibly create a position on the inside to monitor over authoritarian management 95%abuse- on the DL incognito. A win win for company, representative and most importantly your loyal customers. Advice to Management Treat all employees fairly and respectfully. Certain Managers think it may be their gain to operate otherwise. The company's financial loss if not corrected immediately, when alerted or notified of these situations.", "rating": 5, "pros": "Great company to work for in every aspect and always evolving. Recognizes excellence in their sales teams and individuals. Offers challenging sales competitions and great incentives. Fast paced multi -ask happy work environments. Treat their customers with utmost loyalty and awesome entertaining incentives.", "cons": "90% of Management is excellent and highly professional and an honor to work with.", "advice": "Treat all employees fairly and respectfully. Certain Managers think it may be their gain to operate otherwise. The company's financial loss if not corrected immediately, when alerted or notified of these situations."}, {"title": "Great place to work", "text": "Pros People are smart. Hearst Tower is great. I love Cafe 57, and wellness center. Cons The mid town west location didn't work for me, my commute was too long.", "rating": 5, "pros": "People are smart. Hearst Tower is great. I love Cafe 57, and wellness center.", "cons": "The mid town west location didn't work for me, my commute was too long.", "advice": null}, {"title": "Great place to work", "text": "Pros Tons of women in executive ranks Cons Healthcare coverage is only average", "rating": 5, "pros": "Tons of women in executive ranks", "cons": "Healthcare coverage is only average", "advice": null}, {"title": "review", "text": "Pros Great brands, a lot of company perks. Great office building and great senior leadership. Cons Low pay, hard to advance career, gap between upper management and junior staff.", "rating": 5, "pros": "Great brands, a lot of company perks. Great office building and great senior leadership.", "cons": "Low pay, hard to advance career, gap between upper management and junior staff.", "advice": null}, {"title": "Director", "text": "Pros I love this company because of the modern environment, great workspaces, good benefits, friendly people, there is a wonderful gym and café. The pay varies a lot depending on what you do. Cons I find the different magazines are silos that don't communicate with each other and there is duplication of duties for each silo. This is being changed but the lack of communication is still quite apparent.", "rating": 5, "pros": "I love this company because of the modern environment, great workspaces, good benefits, friendly people, there is a wonderful gym and café. The pay varies a lot depending on what you do.", "cons": "I find the different magazines are silos that don't communicate with each other and there is duplication of duties for each silo. This is being changed but the lack of communication is still quite apparent.", "advice": null}, {"title": "Senior Editor", "text": "Pros The company invests a lot in resources and continued learning for employees. Cons Experience differs wildly based on your department.", "rating": 5, "pros": "The company invests a lot in resources and continued learning for employees.", "cons": "Experience differs wildly based on your department.", "advice": null}, {"title": "You get what you put in", "text": "Pros Great location, stable jobs (as stable as they can be in a volatile industry). Cons Some corporate red tape here and there.", "rating": 5, "pros": "Great location, stable jobs (as stable as they can be in a volatile industry).", "cons": "Some corporate red tape here and there.", "advice": null}]