[{"title": "All fine - Hiring more and more - Great Team", "text": "Pros salary, team, atmosphere, parties, learning Cons unfortunately some lazy guys who demotivate the rest of the team Advice to Management right course now", "rating": 5, "pros": "salary, team, atmosphere, parties, learning", "cons": "unfortunately some lazy guys who demotivate the rest of the team", "advice": "right course now"}, {"title": "Never ever go there", "text": "Pros good product, nice customers, friendly team beside of the manager Cons Worst management I ever experienced. Yelling at people until they cry and afterward making jokes about them crying at the office. Don't go there. Advice to Management Change the Management (one person everybody knows)", "rating": 1, "pros": "good product, nice customers, friendly team beside of the manager", "cons": "Worst management I ever experienced. Yelling at people until they cry and afterward making jokes about them crying at the office. Don't go there.", "advice": "Change the Management (one person everybody knows)"}, {"title": "Great Team, Good Learning, Company on the growth", "text": "Pros Office, Good developer's team with high skill set, great product Cons communication between sales and product could be improved Advice to Management more meetings for product and sales, continue expansive course", "rating": 5, "pros": "Office, Good developer's team with high skill set, great product", "cons": "communication between sales and product could be improved", "advice": "more meetings for product and sales, continue expansive course"}, {"title": "it's getting worse", "text": "Pros - nice location - nice team member Cons - This is not a start up anymore but a corporation with no money - Home Office is not allowed anymore - You have to fight for the company to buy necessary equipment for 20 euros. (if they lure you with the \"New, stylish and fast equipment\" in the position description you will be very disappointed) - The politic of \"we pay your salary so we can ask whatever we want\", it is quite common in companies but in heavenhr it is emphasised. - The lack of respect toward some employees because of their position Advice to Management if you do not give importance to your human resource/employees they are going to leave or to deliver poor quality", "rating": 1, "pros": "- nice location", "cons": "- This is not a start up anymore but a corporation with no money", "advice": "if you do not give importance to your human resource/employees they are going to leave or to deliver poor quality"}, {"title": "Good learning experience!", "text": "Pros Great chances to learn a lot in quite a short time, you get to take over many tasks, and most of the times you can work very independently and implement ideas / processes on your own responsibility. Young and international team of colleagues, everyone very friendly and helpful especially when I started! Performing well, you get the opportunity to develop yourself as you plan! Cons Being a start up, they can still improve some benefits for employees (e.g. Holidays / team events), but it is work in progress!", "rating": 5, "pros": "Great chances to learn a lot in quite a short time, you get to take over many tasks, and most of the times you can work very independently and implement ideas / processes on your own responsibility.", "cons": "Being a start up, they can still improve some benefits for employees (e.g. Holidays / team events), but it is work in progress!", "advice": null}, {"title": "Disappointing.", "text": "Pros - The people (although most of the good ones are leaving or have already left). At one point HeavenHR had engaged employees who genuinely enjoyed spending time with each other in and outside of the office. - Autonomy. For the most part I was given the freedom to bring in new ideas and execute them as I wish. I also appreciate how much management valued my opinions in certain situations/projects. - Nice location. Cons - Chaos. With the new MD joining, we expected disruptions and instead received chaos. While some of the changes were in the right direction (pricing model), most of it seemed like a power struggle. For example: our sales team sits facing the same direction, mainly so the new MD can see everyone's screens and monitor all activities. - Poor communication & transparency. I've seen management make condescending comments and yell at employees in front of the entire office. Our in-house meetings were bare minimum, and most of the time employees are not informed of the honest reasons behind managements' decisions, which makes it hard to trust management and stay engaged. - Lack of development. While I appreciate how much autonomy I was given, my superiors were often too preoccupied to give me the direction and feedback I wanted and needed. - Lack of culture. To be fair, I think the company wants to have a positive culture, but more in the way of \"it would be great if someone can take initiative and take charge\" rather than \"culture is important to the management team and we're going to dedicate resources to developing a culture\". We do have a drinks fridge and monthly office parties, but overall engagement is quite low. Advice to Management To the new MD: Treat your employees better. You may be the boss but none of us are under you. You don't act like you care about the company or any of us in it, and it is destroying team morale. You want to implement all these ideas and push people to grow the company, but you're not going about it the right way. This fear culture you are establishing is not going to be successful in the long run. The only way for people to become motivated intrinsically is if you inspire them and make them feel like they're a part of the journey, instead of a tool to help you reach a certain KPI. Also, don't exhaust your best employees. There are still dedicated people at the company and they're getting too much pressure. Show them how valuable they are.", "rating": 3, "pros": "- The people (although most of the good ones are leaving or have already left). At one point HeavenHR had engaged employees who genuinely enjoyed spending time with each other in and outside of the office.", "cons": "- Chaos. With the new MD joining, we expected disruptions and instead received chaos. While some of the changes were in the right direction (pricing model), most of it seemed like a power struggle. For example: our sales team sits facing the same direction, mainly so the new MD can see everyone's screens and monitor all activities.", "advice": "To the new MD: Treat your employees better. You may be the boss but none of us are under you. You don't act like you care about the company or any of us in it, and it is destroying team morale. You want to implement all these ideas and push people to grow the company, but you're not going about it the right way. This fear culture you are establishing is not going to be successful in the long run. The only way for people to become motivated intrinsically is if you inspire them and make them feel like they're a part of the journey, instead of a tool to help you reach a certain KPI."}, {"title": "Kleenex Firma", "text": "Pros der Kiez, die HR Manager Cons Schlechte Stimmung, Kein Management, Keine Achtung", "rating": 1, "pros": "der Kiez, die HR Manager", "cons": "Schlechte Stimmung, Kein Management, Keine Achtung", "advice": null}, {"title": "Chaos, schlechte Stimmung, Kündigungen wegen Lappalien", "text": "Pros HeavenHR ist ein junges Start-Up, was in kurzer Zeit eine enorme Entwicklung hingelegt hat. Dadurch, dass Investoren viel Geld in die Hand nehmen, gibt es noch viel Entwicklungspotenzial und schöne Gimmicks, wie z.B. Getränke (Club Mate, Apfelsaft), Office Drinks (1x/Monat) oder auch halb-jährliche Company Meetings. Das Team bestehend aus ca. 40 Leuten ist super nett, sehr international und man macht häufiger Sachen zusammen auch außerhalb der Arbeit. Cons Dadurch, dass die Investoren so eine große Rolle spielen, liegt viel Druck auf dem Management, der oft ungefiltert nach unten weitergegeben wird. Einer der zwei Managing Directors ist noch sehr jung und unerfahren, muss sich aber ständig profilieren und dementsprechend ist die Stimmung um ihn herum und generell immer wenn er da ist sehr schlecht. Außerhalb der IT-Abteilung (nicht in seinem Zuständigkeitsgebiet) ist der Mitarbeiter turnover ist so hoch, dass innerhalb von 2 Monaten fast 70% der alten Mitarbeiter entweder fristlos entlassen wurden (man sieht sich wieder vor dem Arbeitsgericht) oder gekündigt haben. Das Motto ist \"Wer nicht passt, geht. Wer nicht liefert, geht. Wer ein paar Sachen anspricht, geht.\". Leute kommen zur Arbeit und wissen nicht, ob sie am Ende des Tages noch Mitarbeiter sind oder nicht. Das erzeugt ein Klima von Angst, Unzufriedenheit und geringer Produktivität. Einige Mitarbeiter haben schon angefangen, gegen ihn zu arbeiten, z.B. freuen sie sich, wenn ihn mal wieder jemand ankotzt, lachen darüber, wenn er sich aufregt oder reden einfach nur schlecht über ihn hinter seinem Rücken. Der Erfolg wird nur sehr kurzfristig gemessen und die Strategie nur sehr kurzsichtig verfolgt. Es gab einen Fall, da hat ein Mitarbeiter gekündigt und die letzten drei Wochen seines Vertrages dann darauf verwendet seine Nachfolgerin auf seiner (relativ wichtigen) Position einzuarbeiten. Da diese Mitarbeiterin aber angeblich zu langsam gearbeitet und währenddessen noch Musik gehört hat (bei monotonen Tätigkeiten nachvollziehbar), wurde ihr am letzten Tag des Trainings fristlos gekündigt aus dem Affekt heraus. Dies führte zu weiteren Kündigungen von seitens anderer Mitarbeiter, was dann zu dem Ausfall eines kompletten Arbeitsbereiches geführt hat. Advice to Management Das Management verbrät seine Human Resources wie Butter in der Pfanne. Die Direktoren sind sich nicht des Arbeits- und Kostenaufwandes bewusst, der benötigt wird, um neues Personal zu suchen, einzustellen und zu trainieren. Insbesondere der junge, unerfahrene Manager muss viel klarer zwischen persönlichen Abneigungen und professionellem Verhalten unterscheiden. Es geht ihm noch viel zu viel darum, wie ein Chef zu wirken, sich zu profilieren, Autorität zu erlangen und im Team anzukommen. Da er seine Autorität nur über seinen Titel und die Fähigkeit, Leute zu feuern bezieht, wirkt er nur durch das Erzeugen von Angst und Unsicherheit als Chef, und scheint oft hilflos, wie ein kleines Kind in seinen Rechtfertigungen, warum er wieder jemanden entlassen hat.", "rating": 3, "pros": "HeavenHR ist ein junges Start-Up, was in kurzer Zeit eine enorme Entwicklung hingelegt hat. Dadurch, dass Investoren viel Geld in die Hand nehmen, gibt es noch viel Entwicklungspotenzial und schöne Gimmicks, wie z.B. Getränke (Club Mate, Apfelsaft), Office Drinks (1x/Monat) oder auch halb-jährliche Company Meetings. Das Team bestehend aus ca. 40 Leuten ist super nett, sehr international und man macht häufiger Sachen zusammen auch außerhalb der Arbeit.", "cons": "Dadurch, dass die Investoren so eine große Rolle spielen, liegt viel Druck auf dem Management, der oft ungefiltert nach unten weitergegeben wird. Einer der zwei Managing Directors ist noch sehr jung und unerfahren, muss sich aber ständig profilieren und dementsprechend ist die Stimmung um ihn herum und generell immer wenn er da ist sehr schlecht. Außerhalb der IT-Abteilung (nicht in seinem Zuständigkeitsgebiet) ist der Mitarbeiter turnover ist so hoch, dass innerhalb von 2 Monaten fast 70% der alten Mitarbeiter entweder fristlos entlassen wurden (man sieht sich wieder vor dem Arbeitsgericht) oder gekündigt haben. Das Motto ist \"Wer nicht passt, geht. Wer nicht liefert, geht. Wer ein paar Sachen anspricht, geht.\". Leute kommen zur Arbeit und wissen nicht, ob sie am Ende des Tages noch Mitarbeiter sind oder nicht. Das erzeugt ein Klima von Angst, Unzufriedenheit und geringer Produktivität. Einige Mitarbeiter haben schon angefangen, gegen ihn zu arbeiten, z.B. freuen sie sich, wenn ihn mal wieder jemand ankotzt, lachen darüber, wenn er sich aufregt oder reden einfach nur schlecht über ihn hinter seinem Rücken. Der Erfolg wird nur sehr kurzfristig gemessen und die Strategie nur sehr kurzsichtig verfolgt. Es gab einen Fall, da hat ein Mitarbeiter gekündigt und die letzten drei Wochen seines Vertrages dann darauf verwendet seine Nachfolgerin auf seiner (relativ wichtigen) Position einzuarbeiten. Da diese Mitarbeiterin aber angeblich zu langsam gearbeitet und währenddessen noch Musik gehört hat (bei monotonen Tätigkeiten nachvollziehbar), wurde ihr am letzten Tag des Trainings fristlos gekündigt aus dem Affekt heraus. Dies führte zu weiteren Kündigungen von seitens anderer Mitarbeiter, was dann zu dem Ausfall eines kompletten Arbeitsbereiches geführt hat.", "advice": "Das Management verbrät seine Human Resources wie Butter in der Pfanne. Die Direktoren sind sich nicht des Arbeits- und Kostenaufwandes bewusst, der benötigt wird, um neues Personal zu suchen, einzustellen und zu trainieren. Insbesondere der junge, unerfahrene Manager muss viel klarer zwischen persönlichen Abneigungen und professionellem Verhalten unterscheiden. Es geht ihm noch viel zu viel darum, wie ein Chef zu wirken, sich zu profilieren, Autorität zu erlangen und im Team anzukommen. Da er seine Autorität nur über seinen Titel und die Fähigkeit, Leute zu feuern bezieht, wirkt er nur durch das Erzeugen von Angst und Unsicherheit als Chef, und scheint oft hilflos, wie ein kleines Kind in seinen Rechtfertigungen, warum er wieder jemanden entlassen hat."}, {"title": "So ist es.", "text": "Pros Ein sehr gutes und motiviertes Team Cons In Unternehmen sollte mehr transparenz herschen.", "rating": 5, "pros": "Ein sehr gutes und motiviertes Team", "cons": "In Unternehmen sollte mehr transparenz herschen.", "advice": null}]