[{"title": "Way more engaged", "text": "Pros Rather than focus on the results, they care on how to achieve them and what problems we face on a daily basis so that it can be improved. I'm way more responsible for my progression than in other companies, I can request to learn different skills and assist seminars that will get me better. Lots of bonuses thrown on a regular basis, either in cash or special events, which makes every week fun and enjoyable. Cons Lots of social events outside of work hours, people who live far can go home late.", "rating": 5, "pros": "Rather than focus on the results, they care on how to achieve them and what problems we face on a daily basis so that it can be improved.", "cons": "Lots of social events outside of work hours, people who live far can go home late.", "advice": null}, {"title": "So many improvements in the last year", "text": "Pros The quality of work is constantly improving since I started, 10 months ago. The pay has gone up three times already, the environment is way more social and friendly. More activities as a team to remember it's more than just work. Great job from management, listening to the employees and making sure everyone works better. The CEO actually cares about his team. Cons None to mention yet. Everything problem that arises gets fixed.", "rating": 5, "pros": "The quality of work is constantly improving since I started, 10 months ago. The pay has gone up three times already, the environment is way more social and friendly. More activities as a team to remember it's more than just work.", "cons": "None to mention yet. Everything problem that arises gets fixed.", "advice": null}, {"title": "Super social, involves applying lots of different skills", "text": "Pros There is a good team spirit and social environment. The colleagues are supportive and friendly. The work is fair and not overcomplicated. It does come with challenges on a daily basis. Cons One window doesn't shut properly, so one room is ice cold this winter.", "rating": 5, "pros": "There is a good team spirit and social environment. The colleagues are supportive and friendly.", "cons": "One window doesn't shut properly, so one room is ice cold this winter.", "advice": null}, {"title": "Good year summary", "text": "Pros Year full of achievements, saw lots of promotions, met plenty of great people who joined the team and the growth has been phenomenal. The current campaign/project is stable and has been going for months with increasing success. Looking forward to beat new records. Doing so well the client is investing more in bonuses for us! Cons Wifi is inconsistent. When you want hot food for lunch, the restaurant is the better solution.", "rating": 5, "pros": "Year full of achievements, saw lots of promotions, met plenty of great people who joined the team and the growth has been phenomenal.", "cons": "Wifi is inconsistent.", "advice": null}, {"title": "Honest and helpful management staff", "text": "Pros The work is simple, ethical, and the campaigns help to improve the quality of life of many people. The company is transparent, within my first week I attended different inductions that walked me through every aspect of the company, from its structure, to business model and statistics. Heaters in every room. Cons The front door gets the whole ground floor a bit chilly when it's on automatic opening.", "rating": 5, "pros": "The work is simple, ethical, and the campaigns help to improve the quality of life of many people.", "cons": "The front door gets the whole ground floor a bit chilly when it's on automatic opening.", "advice": null}, {"title": "I value my work and take pride in it", "text": "Pros I work within the Marketing department, I focus on the Customer Service aspect, working on the pipeline to deliver a positive experience to people. Our clients recognised the hardwork invested, and have thus raised the funds for us to increase pay. The job is rewarding in itself, I make a direct impact on the people I interact with, whether it is customers, colleagues I train or assist, but also on the company's growth. Everyone is directly involved in making the work environment a better place, always aiming for perfection. It is also rewarding in regards to progression, Management is always looking for people that care about the company and work with. Everything is fast pace and negotiable, which has helped me earn more as I gained more responsibilities. Cons It can take some time to get lunch depending on where you want hot food.", "rating": 5, "pros": "I work within the Marketing department, I focus on the Customer Service aspect, working on the pipeline to deliver a positive experience to people. Our clients recognised the hardwork invested, and have thus raised the funds for us to increase pay.", "cons": "It can take some time to get lunch depending on where you want hot food.", "advice": null}, {"title": "Been a good time and great way to improve my CV", "text": "Pros I went through intense training to learn four different career paths (marketing, administration, management and sales) for about 7 months. Developed a team of high performers, trained them to high standards and coached them to develop their own. I have developed great friendships with most colleagues, and a good mentorship with the CEO that will carry on as I start my own company in a foreign country. Herocorp can definitely value itself for its young and dynamic members. A fair hierarchy structure that focuses on performance over seniority, which is a great way to recognise hard work with success. The work culture revolves around solving problems rather than finding them, whether they are personal, professional or other. Cons People that need coffee to start the day better like coffee shops, because there is no coffee machine inside the office. An alternative is instant coffee...", "rating": 5, "pros": "I went through intense training to learn four different career paths (marketing, administration, management and sales) for about 7 months.", "cons": "People that need coffee to start the day better like coffee shops, because there is no coffee machine inside the office. An alternative is instant coffee...", "advice": null}, {"title": "Easy to pick up", "text": "Pros You feel more confident within your first week with the team: they are friendly, supportive and have started on day 1 too. The stress of the first day wears off pretty fast as you get busy and go through induction and participate in meetings. People hang out with each other on a regular basis, so it's easy to get to know each other. People come from different educational or social backgrounds, so there always is someone you relate to the most. Cons Socialising around the kettle in the lounge while waiting for it to boil is awkward. A coffee machine would be much better.", "rating": 5, "pros": "You feel more confident within your first week with the team: they are friendly, supportive and have started on day 1 too. The stress of the first day wears off pretty fast as you get busy and go through induction and participate in meetings.", "cons": "Socialising around the kettle in the lounge while waiting for it to boil is awkward. A coffee machine would be much better.", "advice": null}, {"title": "Great social events", "text": "Pros Great professional environment that mixes work and social life. The more people you meet, the better you network and are able to get the best advice from different mentors in the business. To this end, the company funds seminars and hosts events where other companies attend and share information together. On the plus side, the Christmas Party is a night to be remembered, as all business partners and consultants were invited too. It is great to see that different companies can work together beyond the simple limits of the office. Cons Social and professional events are organised outside of business hours, so you have to invest extra time to attend these. Advice to Management Keep organising events on a regular basis!", "rating": 5, "pros": "Great professional environment that mixes work and social life.", "cons": "Social and professional events are organised outside of business hours, so you have to invest extra time to attend these.", "advice": "Keep organising events on a regular basis!"}, {"title": "Great training for new people", "text": "Pros Well structured. Organised. People are encouraged to be on time as a respect for everybody. New people go through different inductions, one on one coaching and receive support in their progression. Amazing opportunity to attend National level seminars in the industry. Cons We can't cook hot food inside the office, just a microwave and a kettle in the lounge.", "rating": 5, "pros": "Well structured. Organised.", "cons": "We can't cook hot food inside the office, just a microwave and a kettle in the lounge.", "advice": null}, {"title": "Supportive in my career", "text": "Pros The company provides career advice and guidance for progression. The entry level is very short and simple to understand. The training is short but condenses a lot of useful information. The communication and marketing skills involved actually apply to everything else in life. You listen to people better, you explain things and motivate people better. All it takes is to care a bit more and the decision to make things happen. Cons Commuting after work can be difficult depending on the transport you need. Advice to Management Change the top floor carpet, it deserves a fresh revamp.", "rating": 5, "pros": "The company provides career advice and guidance for progression.", "cons": "Commuting after work can be difficult depending on the transport you need.", "advice": "Change the top floor carpet, it deserves a fresh revamp."}, {"title": "Good business values", "text": "Pros The management team encourages the teams to work on their image. That is not only about having a professional and respectable appearance, but also avoid the bad language and work on a good reputation. Seniors help people develop their skills to perform to a professional level. The CEO has respectable moral values both at work and in private and expects people to have their own. People are reliable, tolerant and keep their word. Hard work is recognised and rewarded. Seniors praise the performance of others and encourage people to move forward. Cons The music is the only unprofessional bit about the business, but we're not robots after all.", "rating": 5, "pros": "The management team encourages the teams to work on their image. That is not only about having a professional and respectable appearance, but also avoid the bad language and work on a good reputation. Seniors help people develop their skills to perform to a professional level.", "cons": "The music is the only unprofessional bit about the business, but we're not robots after all.", "advice": null}, {"title": "Best way to develop yourself, helped me get my career started.", "text": "Pros Finally a company that cares about your growth and skills. Even though i had just 18 months on my visa management invested the same time and effort in myself as anyone else who applied themselves. Hero Corp provides an environment for you to learn and improve yourself everyday. I have been able to achieve so much in a very short time. You can progress at your own pace within the company, and get promoted fast. The skills all helped me move up in my career and ended up getting a senior role currently based on my skills learnt there. Glad to see hero corp still going strong. Cons You must be willing to put a lot of effort to achieve the results you want. Was alot of competition for the interview and felt i had to work really hard to get the start. Advice to Management Keep up making people greater. Never stop investing in the under dogs.", "rating": 5, "pros": "Finally a company that cares about your growth and skills. Even though i had just 18 months on my visa management invested the same time and effort in myself as anyone else who applied themselves.", "cons": "You must be willing to put a lot of effort to achieve the results you want.", "advice": "Keep up making people greater. Never stop investing in the under dogs."}, {"title": "Good addition to my CV", "text": "Pros The first few days of training are fun and instructive. It is structured and I had goals to achieve. Managed to see a clear progression in communication and problem solving skills after just a week of working with Hero Corp. Worked part time as I had Uni. The CEO was flexible to let me choose the days I had to work, and they still invested time in helping me progress. Never had experience in Leadership and Project management. I used what I learned there to successfully lead my different University projects, including the full production of a short movie which proved challenging. Also learned some values regarding positive thinking and time management, which in my opinion were essential in getting me a First Class degree. Cons I drink a lot of coffee and the fact there was no coffee machine inside the office was a bit sad. Advice to Management Keep hiring part timers! The experience we get is essential.", "rating": 5, "pros": "The first few days of training are fun and instructive. It is structured and I had goals to achieve. Managed to see a clear progression in communication and problem solving skills after just a week of working with Hero Corp.", "cons": "I drink a lot of coffee and the fact there was no coffee machine inside the office was a bit sad.", "advice": "Keep hiring part timers! The experience we get is essential."}, {"title": "Good manager and a nice office", "text": "Pros You have plenty of shops, supermarkets, restaurants on the main street. The office is close to the cinema and to the gym. Colleagues go to either, for working out or socialising. Good management team. Targets are hit. Rather than put only pressure on the marketing team, there is coaching and investment in order to help the progression and make the team more competitive. Super easy to commute from anywhere on London, and work hours are flexible enough to avoid rush hour. Cons No coffee machine inside the office. So it's either instant, or coffee shop.", "rating": 5, "pros": "You have plenty of shops, supermarkets, restaurants on the main street. The office is close to the cinema and to the gym. Colleagues go to either, for working out or socialising.", "cons": "No coffee machine inside the office. So it's either instant, or coffee shop.", "advice": null}, {"title": "The managers don't hate their lives", "text": "Pros I am pleased that the company offers an opportunity to progress and develop skills at every stage of the hierarchy. I've had too many jobs were I hated the job as much the supervisors did. Here we get to make money, and hang out in Angel, which is cool. Been here for a bit more than two months now, been to two seminars, have had a professional coach track my progression every week and have been on three business trips. Basically, I've been very busy and learned as much as I could. I like the fact there is a lot of information that you can acquire, from books, videos and also colleagues or business partners. CEO runs a meeting for everyone in the morning, to show our results, recognise our work and inspire us to keep progressing. Love the social events, at least one per week. Cons Getting hot food and coffee is expensive in Angel. Music can be too loud sometimes.", "rating": 5, "pros": "I am pleased that the company offers an opportunity to progress and develop skills at every stage of the hierarchy. I've had too many jobs were I hated the job as much the supervisors did. Here we get to make money, and hang out in Angel, which is cool.", "cons": "Getting hot food and coffee is expensive in Angel.", "advice": null}, {"title": "The heroes", "text": "Pros Great work values, making a difference for things that matter. I work as part of the administration team, and meet great people everyday. People have so many stories to tell and are great to work with. The management team is always open for talk and very helpful. There is good communication between the different teams. Cons Too many restaurants to pick from outside the office for lunch.", "rating": 5, "pros": "Great work values, making a difference for things that matter.", "cons": "Too many restaurants to pick from outside the office for lunch.", "advice": null}, {"title": "Love the pay", "text": "Pros Very fast pace progression. They trained me for four days and three weeks later I have made from bonuses alone more than five hundred pounds. Great coaching from the team managers and one on one mentoring with the CEO. Learned many skills, including communication, public speaking, management and coaching. Great location for social events with colleagues. Cons Not hot food or drink facilities in the office. No coffee machine. No parking slot, it is London after all. Only one toilet available.", "rating": 5, "pros": "Very fast pace progression. They trained me for four days and three weeks later I have made from bonuses alone more than five hundred pounds.", "cons": "Not hot food or drink facilities in the office.", "advice": null}, {"title": "Nice progression", "text": "Pros Flexible and understanding; I was looking for a summer job before going back to uni in September. Got the position in June, learned the basics and got promoted to a senior marketing role by August. Opportunity to meet inspiring people, I met CEOs from different companies while travelling all over the UK. Had fun and made decent money to help me in my studies. Cons They have no coffee machine in the office. Which makes the social area a bit empty. Advice to Management Get a business discount from the nearby coffee shop as a benefit of working at herocorp.", "rating": 5, "pros": "Flexible and understanding; I was looking for a summer job before going back to uni in September. Got the position in June, learned the basics and got promoted to a senior marketing role by August.", "cons": "They have no coffee machine in the office. Which makes the social area a bit empty.", "advice": "Get a business discount from the nearby coffee shop as a benefit of working at herocorp."}, {"title": "Six stars", "text": "Pros When I started at Hero Corp it felt weird because it was so different than any standard business. After I understood that the point was just to have a friendly work place and help people develop themselves, I enjoyed it a lot more and saw my performance rise. The business is transparent, you are told during the interview how the progression works within the company. The managers run induction meetings for new people to explain the business in depth and run through why it is growing fast. The career path is really appealing, as well as all the skills you pick up from early entry level. I have seen people stay for the summer and learn new skills quickly, like communication and public speaking. You get to travel whenever you want, with the best people around. Which means you have fun and learn as you progress. There are seminars very often, for people at different stages of their career. The managers are open to any questions and really know how to support you. Hanging out with them is motivating. Fun social events. Enough games to play in the office in order to chill and enjoy some time after work. Cons It requires more than simple hourly shifts. It's a different perspective of how you should pick a career. There is little choice for coffee but to go to a coffee shop and buy some.", "rating": 5, "pros": "When I started at Hero Corp it felt weird because it was so different than any standard business. After I understood that the point was just to have a friendly work place and help people develop themselves, I enjoyed it a lot more and saw my performance rise.", "cons": "It requires more than simple hourly shifts.", "advice": null}, {"title": "Six stars", "text": "Pros When I started at Hero Corp it felt weird because it was so different than any standard business. After I understood that the point was just to have a friendly work place and help people develop themselves, I enjoyed it a lot more and saw my performance rise. The business is transparent, you are told during the interview how the progression works within the company. The managers run induction meetings for new people to explain the business in depth and run through why it is growing fast. The career path is really appealing, as well as all the skills you pick up from early entry level. I have seen people stay for the summer and learn new skills quickly, like communication and public speaking. You get to travel whenever you want, with the best people around. Which means you have fun and learn as you progress. There are seminars very often, for people at different stages of their career. The managers are open to any questions and really know how to support you. Hanging out with them is motivating. Fun social events. Enough games to play in the office in order to chill and enjoy some time after work. Cons It requires more than simple hourly shifts. It's a different perspective of how you should pick a career. There is little choice for coffee but to go to a coffee shop and buy some.", "rating": 5, "pros": "When I started at Hero Corp it felt weird because it was so different than any standard business. After I understood that the point was just to have a friendly work place and help people develop themselves, I enjoyed it a lot more and saw my performance rise.", "cons": "It requires more than simple hourly shifts.", "advice": null}, {"title": "Great for new starters", "text": "Pros I only joined Hero Corp three weeks ago, the company has been helpful from the very start. I was lacking so much confidence on my first day, but I was able to speak with a mentor every day to help with my training. The CEO is very inspirational and a world class coach. Fast pace progression. I put 100% effort into my work and the results showed up immediately. I was able to hit records, get bonuses and get promoted. I am now learning a lot about leadership, management, recruitment and lots of different areas as I go further in the company. Cons Very intimidating at first. I did not believe it was made for me. The business made sense though, it's impossible to explain in a few lines. Being an entrepreneur means you are willing to do whatever it takes to make it work, and while we believe we deserve success, we actually need to work harder than we think to achieve it.", "rating": 5, "pros": "I only joined Hero Corp three weeks ago, the company has been helpful from the very start.", "cons": "Very intimidating at first. I did not believe it was made for me. The business made sense though, it's impossible to explain in a few lines. Being an entrepreneur means you are willing to do whatever it takes to make it work, and while we believe we deserve success, we actually need to work harder than we think to achieve it.", "advice": null}, {"title": "Work WITH the company, not for a company", "text": "Pros People aren't here to work for the company, they are here to make a difference and work WITH the company. It requires a lot of effort to change one's mindset from employee to entrepreneur, and everyone is here to support you. The moment you realise that what you can do is so much more than what you thought you could do, there is massive room for progress. The CEO is an amazing coach and great at helping you set goals to make you are on the right track. No one feels \"new\", the environment is brilliant and allows everyone to socialise. Hanging out in Angel Islington is purely badass when the teams go out together. Cons Limited toilet facilities. No indoor facilities for hot food or drink. Advice to Management I would advise to repair the other toilet. And bring back movie nights!", "rating": 5, "pros": "People aren't here to work for the company, they are here to make a difference and work WITH the company.", "cons": "Limited toilet facilities.", "advice": "I would advise to repair the other toilet."}, {"title": "Sales and Marketing Junior Assistant", "text": "Pros I applied for the entry level position, so I didn't need any experience. They provide all the inductions, courses, training and invited me to seminars the same week I started. I have a wide range of bonuses and records I can hit in order to earn extra. Great location, Angel, to hang out after work. Lots of pubs and restaurants around to choose. One on one personalised coaching. The CEO and senior members know I don't progress under pressure. So they found ways to motivate me in order to help me progress faster. I love the team. Cons Tiring at the beginning, got used to working harder than most jobs. No indoors coffee machine is costly.", "rating": 5, "pros": "I applied for the entry level position, so I didn't need any experience. They provide all the inductions, courses, training and invited me to seminars the same week I started.", "cons": "Tiring at the beginning, got used to working harder than most jobs.", "advice": null}, {"title": "Fun team and good structure", "text": "Pros The team is international and friendly. Great for some social time after work. The CEO is a good leader and mentor. He also has a sense of humour. Work is structured and follows guidelines to help people progress and get better. The company invests time in you. I am motivated to go to work when I wake up, which is a change. Cons Very superficial cons, such as impossible to park. No coffee or hot food available directly in the office, has to be brought in. Only one toilet facility for the staff. Advice to Management Do everything to keep the office fun.", "rating": 5, "pros": "The team is international and friendly. Great for some social time after work.", "cons": "Very superficial cons, such as impossible to park. No coffee or hot food available directly in the office, has to be brought in.", "advice": "Do everything to keep the office fun."}, {"title": "Relaxed office environment", "text": "Pros Close to the tube station, northern line. Perfect location for lunch breaks, almost too much choice. It's a fun environment, multicultural and open minded. People progress fast within the company. There is music playing in the reception and lounge, making it more social and entertaining. The management team is actually available when you need them, and they answer to your issues with solutions. Cons Music can be a bit loud sometimes.", "rating": 5, "pros": "Close to the tube station, northern line.", "cons": "Music can be a bit loud sometimes.", "advice": null}, {"title": "Unique.", "text": "Pros This company is amazing. Unique and by far the best chance I took. I have learnt so much from the first 3 days here. More then any business I have had the pleasure of spending time with. Cons None, You get what you put in. The cons aren't there Advice to Management Keep doing what your doing. I know I can come to you if I need to.", "rating": 5, "pros": "This company is amazing. Unique and by far the best chance I took. I have learnt so much from the first 3 days here. More then any business I have had the pleasure of spending time with.", "cons": "None, You get what you put in. The cons aren't there", "advice": "Keep doing what your doing. I know I can come to you if I need to."}, {"title": "Fast pace", "text": "Pros No seniority in the business. Determined and productive people progress really fast towards higher roles. Full training provided, great entry level positions. I have developed my communication and management skills to a high level in a very short amount of time. Cons No parking slot. No coffee machine.", "rating": 5, "pros": "No seniority in the business. Determined and productive people progress really fast towards higher roles.", "cons": "No parking slot.", "advice": null}, {"title": "Achieved my goals", "text": "Pros Great coaching. I wanted to have great communication skills, as well as the knowledge to train and manage a team. Through constant training and evaluation I was able to progress to the point where I could manage and coach a team of 10. People that are determined and can ignore negatives succeed. Cons Slow learners will not progress until they decide to change the way they think. Advice to Management Keep training people to be great.", "rating": 5, "pros": "Great coaching. I wanted to have great communication skills, as well as the knowledge to train and manage a team.", "cons": "Slow learners will not progress until they decide to change the way they think.", "advice": "Keep training people to be great."}, {"title": "Interesting day with Nicolas", "text": "Pros A really good experience. Spent a day with the manager Nicolas who show me all the aspects of his work. Cons Nothing to say, that was a really interesting day.", "rating": 5, "pros": "A really good experience. Spent a day with the manager Nicolas who show me all the aspects of his work.", "cons": "Nothing to say, that was a really interesting day.", "advice": null}, {"title": "Worked while studying", "text": "Pros Pushed me to work on my communication skills and face to face interactions. They educated me on my habits, be more professional and give a 100%. Applied the same mentality and new skills to my studies and finished with a 1st Class. Open minded CEO. Flexible hours.  The culture is great, and have been able to learn from successful people in the business. I travelled to other cities in the UK to improve my skills. Also had the opportunity to win a trip to New York and Miami. Cons No hot food or coffee distributed in the building.", "rating": 5, "pros": "Pushed me to work on my communication skills and face to face interactions.", "cons": "No hot food or coffee distributed in the building.", "advice": null}, {"title": "Interview day", "text": "Pros Fun and friendly environment Cons None, the job is exciting", "rating": 5, "pros": "Fun and friendly environment", "cons": "None, the job is exciting", "advice": null}, {"title": "scam", "text": "Pros chugging and paid by comission Cons no one wants to sign up for something they dont want and you only get paid if you can force them to sign up. long hours everyday of the week v v v if no pay Advice to Management be honest with people", "rating": 1, "pros": "chugging and paid by comission", "cons": "no one wants to sign up for something they dont want and you only get paid if you can force them to sign up. long hours everyday of the week v v v if no pay", "advice": "be honest with people"}, {"title": "Flexible and great environment", "text": "Pros People from many backgrounds and international. Lots of young entrepreneurs. Management is always eager to get feedback and push the company in the right direction. Cons No parking slot, like the rest of London.", "rating": 5, "pros": "People from many backgrounds and international. Lots of young entrepreneurs.", "cons": "No parking slot, like the rest of London.", "advice": null}, {"title": "Hero Corp London", "text": "Pros Great working full time along side Managers and CEOs of Hero Corp and their clients. Exposed to lots of strong networking opportunities and mentoring. Perfect for people looking for career development and personal development. The company values are to reward the best students and work ethics. Having crititria based progression means that we have full control over our own progression and development. Once criteria is reached and you have the skills and experience to complete the tasks of senior opportunities at hero Corp you can progress to that level. Working full time and studying full time means progression can be fast, just this would require extra time to do both. Spending time with like minded people who have positive attitudes towards their work and careers makes a great environment Cons Based in Angel central London it's got zero parking spaces at the office. Constantly leaving personal comfort zones when taking on new challenges and responsibilities with progression. Advice to Management With so much effort placed in personal and team development Hero Corp should also focus a little on their online branding to match what they have built. Company should promote its successes more online and be proud of its achievements.", "rating": 5, "pros": "Great working full time along side Managers and CEOs of Hero Corp and their clients.", "cons": "Based in Angel central London it's got zero parking spaces at the office.", "advice": "With so much effort placed in personal and team development Hero Corp should also focus a little on their online branding to match what they have built. Company should promote its successes more online and be proud of its achievements."}, {"title": "World Class Organisation!", "text": "Pros Coaching and mentoring Fast progression Opportunity to grow Personal and professional development Training Learn skills in recruitment, customer service, communication skills, branding, team management, accounting, administration, HR, PR, client liaison, advertising, event management No seniority No politics Incredible environment and atmosphere Networking Business trips and road trips Opportunity for travel Cons No downsides of the business at all", "rating": 5, "pros": "Coaching and mentoring", "cons": "No downsides of the business at all", "advice": null}, {"title": "Rubbish, full of lies", "text": "Pros Nothing, there is zero good about this \"job\", you run around like a little dog for 12 hrs a day to not get paid Cons Everything, self absorbed, people who think they're better than everybody else Advice to Management Stop advertising like this is a good paying job, set it as work experience", "rating": 1, "pros": "Nothing, there is zero good about this \"job\", you run around like a little dog for 12 hrs a day to not get paid", "cons": "Everything, self absorbed, people who think they're better than everybody else", "advice": "Stop advertising like this is a good paying job, set it as work experience"}, {"title": "Hero Corp", "text": "Pros Fast first process, friendly approach, seem to be willing to develop your skills with fast management position given, young personnel Cons Doubtful positions available and not sufficient explanation. Commission plus bonus only. Job description doesn’t fully match the actual role (people do get confused!). Advice to Management There is a need of better and clearer job description and more informative interviews in the first stage. All positions seem the same and for a first approach in the field there is a need of more information in regards the nature of the role. The job should have a fixed base salary and on top of that the commission and bonuses.", "rating": 3, "pros": "Fast first process, friendly approach, seem to be willing to develop your skills with fast management position given, young personnel", "cons": "Doubtful positions available and not sufficient explanation.", "advice": "There is a need of better and clearer job description and more informative interviews in the first stage. All positions seem the same and for a first approach in the field there is a need of more information in regards the nature of the role."}, {"title": "Educational and Fun", "text": "Pros - Lots of resources to learn and thrive within the business - Incentive/Bonuses for making a certain amount of commission per day - Weekly trips. Cons -Extremely hardwork dealing with customers if you don't have the people skill -Only commission based so the money you earn its gained solely through making a sale.", "rating": 3, "pros": "- Lots of resources to learn and thrive within the business", "cons": "-Extremely hardwork dealing with customers if you don't have the people skill", "advice": null}, {"title": "Amazing company", "text": "Pros Great enviorment, great place for progression and to achieve your goals Cons Don't have a parking spot Advice to Management Keep it up !!", "rating": 5, "pros": "Great enviorment, great place for progression and to achieve your goals", "cons": "Don't have a parking spot", "advice": "Keep it up !!"}, {"title": "THIS IS A SCAM", "text": "Pros The manager seems like a cool guy and progression is possible Cons 99% of things told to you are a lie. From the moment you walk into your interview. 1 - they tell you about the progression but don’t talk about the big turn over. 2 - once you quit, you are basically dead to them, and once you do quit. Boyd will make up stories about why that person quit. For example, Boyd has had over 5 managers at least from when I wasn’t there, who have quit. That is why he took him 8 years and he isn’t even a VP yet. 3 - long hours, 14 hour days sometimes 6 days a week. Boyd has a flashy lifestyle but makes you work long hours. You won’t have time for lunch or dinner. 4 - you will have no social life outside the company. 5 - always told to be positive and 6 - they lie to you about pay. Don’t expect to earn more than 10k a year. Sometimes they will tell you that a customer you acquired cancelled and keep the pay for themselves. 7 - Once you get to leadership they show you how they trick applicants into working for them. If this doesn’t open your eyes, then I don’t know what will. 8 - Boyd will only pay attention to you if you do well. He has his favourites, he never motivates you if you’re doing bad. He will however shout at you. 9 - Boyds history is questionable, he contradicts his own stories many times. He says he got to management very quickly but there is no proof of this. 10. Most of the reviews on here are probably written by him or his staff. Advice to Management Start paying people a base salary, it shouldn’t be just commission based pay.", "rating": 1, "pros": "The manager seems like a cool guy and progression is possible", "cons": "99% of things told to you are a lie. From the moment you walk into your interview.", "advice": "Start paying people a base salary, it shouldn’t be just commission based pay."}, {"title": "Interview process", "text": "Pros Everyone is incredibly enthusiastic and all of the managers and leaders are really down to want nothing but the best for you. The interview process is very straight forward and it is always really clear as to what is expected from you. There is a very passionate and inspirational environment, which is crucial to achieve your targets. Cons It can be a long day and its all on your feet but that comes with any sales role. The days can also be quite long but you are incontrol of your own time so your goal is to get as many sales as possible. Advice to Management Perhaps try to have the interview more structured because it does run on a while longer than.", "rating": 5, "pros": "Everyone is incredibly enthusiastic and all of the managers and leaders are really down to want nothing but the best for you.", "cons": "It can be a long day and its all on your feet but that comes with any sales role.", "advice": "Perhaps try to have the interview more structured because it does run on a while longer than."}, {"title": "Great opportunities to progress", "text": "Pros I think Herocorp is a great opportunity for all does who want a full-filling job in which you can progress in a wonderful career, enjoy yourself while earning good money and meeting great people. Cons So far everything has been wonderful, I can not say anything wrong about this company. Advice to Management Keep it up! 😃", "rating": 5, "pros": "I think Herocorp is a great opportunity for all does who want a full-filling job in which you can progress in a wonderful career, enjoy yourself while earning good money and meeting great people.", "cons": "So far everything has been wonderful, I can not say anything wrong about this company.", "advice": "Keep it up! 😃"}, {"title": "ISR", "text": "Pros An incredible opportunity to build your own business Cons It's not 8 to 5 business, a more adventurous", "rating": 5, "pros": "An incredible opportunity to build your own business", "cons": "It's not 8 to 5 business, a more adventurous", "advice": null}, {"title": "sneakily worded job titles and job description. they fail to mention its door to door. but room for growth", "text": "Pros there is potential for good progression and start managing your own team Cons the job descriptions are worded sneakily. it is in fact door to door sales (junior marketing assistant/trainee marketing assistant/sales assistant/direct marketing coordinator/graduate sales representative, from what I heard from peers who also applied its all pretty much the same door to door gig) Advice to Management put the correct facts in the job description. I'm sure you do get people that love it there. but you miss key words in the job description to lure in unsuspecting victims", "rating": 1, "pros": "there is potential for good progression and start managing your own team", "cons": "the job descriptions are worded sneakily. it is in fact door to door sales (junior marketing assistant/trainee marketing assistant/sales assistant/direct marketing coordinator/graduate sales representative, from what I heard from peers who also applied its all pretty much the same door to door gig)", "advice": "put the correct facts in the job description. I'm sure you do get people that love it there. but you miss key words in the job description to lure in unsuspecting victims"}, {"title": "Full of lies", "text": "Pros Boyd good person to work with Cons Misleading information Door to Door", "rating": 1, "pros": "Boyd good person to work with", "cons": "Misleading information", "advice": null}, {"title": "Invaluable Experience!", "text": "Pros Working at Hero Corp was an invaluable learning experience both professionally and personally. The company culture and people are amazing! I would highly recommend that anyone with entrepreneurial ambitions should work in residential field sales at least once in their life. The skills you gain cannot be learned in any other environment but can be transferred to any role/industry. You'd be surprised how many billionaire's cut their teeth knocking on doors! Approach with an open mind and don't believe the stigma. The training and development program is one of the best I have experienced and being 100% performance based as well as promotion from within the financial and career opportunities are fantastic BUT It's up to you to make it happen. It's a lot of hard work and not for the faint hearted but the rewards are there for the taking if you're willing to work hard enough for them. Cons The main con for me was that hours of work made it difficult to have a work/life balance and keep a steady routine. Especially when having to go on back to back business trips. However if you're willing to sacrifice your time and put in the hard work now the career progression opportunities make it worth it in the long run.", "rating": 5, "pros": "Working at Hero Corp was an invaluable learning experience both professionally and personally. The company culture and people are amazing! I would highly recommend that anyone with entrepreneurial ambitions should work in residential field sales at least once in their life. The skills you gain cannot be learned in any other environment but can be transferred to any role/industry. You'd be surprised how many billionaire's cut their teeth knocking on doors! Approach with an open mind and don't believe the stigma. The training and development program is one of the best I have experienced and being 100% performance based as well as promotion from within the financial and career opportunities are fantastic BUT It's up to you to make it happen. It's a lot of hard work and not for the faint hearted but the rewards are there for the taking if you're willing to work hard enough for them.", "cons": "The main con for me was that hours of work made it difficult to have a work/life balance and keep a steady routine. Especially when having to go on back to back business trips. However if you're willing to sacrifice your time and put in the hard work now the career progression opportunities make it worth it in the long run.", "advice": null}, {"title": "Avoid at all costs, unless you want to slave away for little/no money", "text": "Pros Absolutely nothing. This company is terrible and I would highly recommend you avoid them as I explain why this is. Cons Complete Scam of a company, it's structure is based on a pyramid scheme. You may progress but you certainly won't be earning 70k as the promised. You aren't told until your observation day that the job is door to door sales. You are expected to spend 11 hours a day and 6 days a week begging people to change energy company. Boyd, and all the other 'people' you will learn about when you join this company are actually just pathetic con artists who make up a bunch of fake 'motivational' stories to keep you making them money. Advice to Management Stop behaving so sneakily and fix your company!", "rating": 1, "pros": "Absolutely nothing. This company is terrible and I would highly recommend you avoid them as I explain why this is.", "cons": "Complete Scam of a company, it's structure is based on a pyramid scheme.", "advice": "Stop behaving so sneakily and fix your company!"}, {"title": "Awful", "text": "Pros Nothing of note to mention Cons The job is going out everyday and trying to sell to people on the street", "rating": 1, "pros": "Nothing of note to mention", "cons": "The job is going out everyday and trying to sell to people on the street", "advice": null}, {"title": "Exploiters", "text": "Pros None they brainwash you. They tell you that you will have a company and in the end you are always stuck to them Cons Boyd is getting richer while you get poorer and tired Advice to Management None. The whole management is a lie. Lies and motivational stories that are not true. All of them have stories and all of them are a lie", "rating": 1, "pros": "None they brainwash you. They tell you that you will have a company and in the end you are always stuck to them", "cons": "Boyd is getting richer while you get poorer and tired", "advice": "None. The whole management is a lie. Lies and motivational stories that are not true. All of them have stories and all of them are a lie"}, {"title": "Motivating and Challenging", "text": "Pros Highlights all the potential you have the way to get there with the support of a structured system. Cons Have to work hard, reason is that I put equals output in this business. So whatever I put in, I will get out. Advice to Management I just want to learn and improve in every area. I am very excited by this opportunity.", "rating": 5, "pros": "Highlights all the potential you have the way to get there with the support of a structured system.", "cons": "Have to work hard, reason is that I put equals output in this business. So whatever I put in, I will get out.", "advice": "I just want to learn and improve in every area. I am very excited by this opportunity."}, {"title": "SCAM!!", "text": "Pros There are zero pros for working here. The job titles are a scam, everyone is given the same role as a door to door sales person! Cons It's a scam, they try and convince you that you will be earning a crazy figure in a few months but fail to mention that the role is of a door to door salesman who is selling gas and electric. I also believe that a lot of the reviews on here are written by people who work there and are trying to bring people into the scam. Please stay away! Advice to Management Stop scamming people. Be up front with the job role because you don't know if it's someone's last penny they've used to get to the interview, only to realise it is not the job they want or applied for.", "rating": 1, "pros": "There are zero pros for working here. The job titles are a scam, everyone is given the same role as a door to door sales person!", "cons": "It's a scam, they try and convince you that you will be earning a crazy figure in a few months but fail to mention that the role is of a door to door salesman who is selling gas and electric. I also believe that a lot of the reviews on here are written by people who work there and are trying to bring people into the scam. Please stay away!", "advice": "Stop scamming people. Be up front with the job role because you don't know if it's someone's last penny they've used to get to the interview, only to realise it is not the job they want or applied for."}, {"title": "Best opportunity in the world", "text": "Pros One of my main reasons of working at Hero Corp is being able to receive guidance on how to prosper in life and continuously developing to be the better version of myself. Cons One of the downsides of working at Hero Corp is that there isn't one. Advice to Management One of my main advice to management would be to carry on their good work in helping others such as myself to develop.", "rating": 5, "pros": "One of my main reasons of working at Hero Corp is being able to receive guidance on how to prosper in life and continuously developing to be the better version of myself.", "cons": "One of the downsides of working at Hero Corp is that there isn't one.", "advice": "One of my main advice to management would be to carry on their good work in helping others such as myself to develop."}, {"title": "Good Opportunity for Everyone", "text": "Pros fun working environment where everyone is learning from each other. Set of skills that can be learned, improved and taught to others! Cons Lack of toilet facilities and unfortunately the parking can be dreadful! Advice to Management Keep up the good work!", "rating": 5, "pros": "fun working environment where everyone is learning from each other. Set of skills that can be learned, improved and taught to others!", "cons": "Lack of toilet facilities and unfortunately the parking can be dreadful!", "advice": "Keep up the good work!"}, {"title": "Amazing Opportunity", "text": "Pros Learn Customer Acquisition Good Atmosphere Good team support Cons Could provide more toiletsToilets Expensive parking in Central London Advice to Management Keep up the great work", "rating": 5, "pros": "Learn Customer Acquisition", "cons": "Could provide more toiletsToilets", "advice": "Keep up the great work"}, {"title": "Great working environment", "text": "Pros It has a very fun working environment with great learning opportunity, fast progression and also, you get to meet a lot of very experienced entrepreneurs i would say it is a life changing experience Cons The toilet facility in the office is very limited Advice to Management Managers and leaders are very inspiring. Thanks to the open door policy, whenever I've got questions, I can get detailed answers really easily.", "rating": 5, "pros": "It has a very fun working environment with great learning opportunity, fast progression and also, you get to meet a lot of very experienced entrepreneurs", "cons": "The toilet facility in the office is very limited", "advice": "Managers and leaders are very inspiring. Thanks to the open door policy, whenever I've got questions, I can get detailed answers really easily."}, {"title": "Unbelievable experience. The team is full of self motivated and ambitious people.", "text": "Pros The main factor that I absolutely love is the fact that everyone in Herocorp, are not only ambitious and motivated, but all have a clearly set out goal which they all are striving to achieve. Working with Herocorp has developed my growth mind set so much that it is difficult to fully explain. Cons The only negative was that at the beginning I struggled to find the office from the Main Street at Angel. Advice to Management Keep up the great work!!!!", "rating": 5, "pros": "The main factor that I absolutely love is the fact that everyone in Herocorp, are not only ambitious and motivated, but all have a clearly set out goal which they all are striving to achieve. Working with Herocorp has developed my growth mind set so much that it is difficult to fully explain.", "cons": "The only negative was that at the beginning I struggled to find the office from the Main Street at Angel.", "advice": "Keep up the great work!!!!"}, {"title": "Great place to work!", "text": "Pros Fun working environment, a team of people determined to help you achieve your dreams and a fantastic business model that outlines the opportunity to progress as far as you want to! Cons no parking facilities, local area always extremely busy.", "rating": 5, "pros": "Fun working environment, a team of people determined to help you achieve your dreams and a fantastic business model that outlines the opportunity to progress as far as you want to!", "cons": "no parking facilities, local area always extremely busy.", "advice": null}, {"title": "Great experience and opportunity.", "text": "Pros Ample opportunities and an irreplaceable experience. A great opportunity to learn, grow and develop. Cons The walk between the station and the office was said to be 5 minutes. It was actually 6! Advice to Management Let the atmosphere and the interaction/relationship between the staff remain as it is", "rating": 5, "pros": "Ample opportunities and an irreplaceable experience. A great opportunity to learn, grow and develop.", "cons": "The walk between the station and the office was said to be 5 minutes. It was actually 6!", "advice": "Let the atmosphere and the interaction/relationship between the staff remain as it is"}, {"title": "But in 100% get back 100%!!!", "text": "Pros Take charge of own income and value as a person. Cons Need to be able to throw yourself into the role. Advice to Management N/A", "rating": 5, "pros": "Take charge of own income and value as a person.", "cons": "Need to be able to throw yourself into the role.", "advice": "N/A"}, {"title": "An atmosphere of motivation with a team of fun, aspirational people.", "text": "Pros You're constantly being encouraged to work towards achieving your goals whilst gaining all the skills necessary to run your own business. You don't need any experience, just the drive and mentality to want to learn. Cons If you don't have the drive to work very hard during the day then it can be extremely challenging but if you are a person who doesn't mind working hard then there are no cons.", "rating": 5, "pros": "You're constantly being encouraged to work towards achieving your goals whilst gaining all the skills necessary to run your own business. You don't need any experience, just the drive and mentality to want to learn.", "cons": "If you don't have the drive to work very hard during the day then it can be extremely challenging but if you are a person who doesn't mind working hard then there are no cons.", "advice": null}, {"title": "Awesome !", "text": "Pros Great working environment, with great people ! Loads of opportunities to grow. Cons There is no parking space unfortunately.", "rating": 5, "pros": "Great working environment, with great people ! Loads of opportunities to grow.", "cons": "There is no parking space unfortunately.", "advice": null}, {"title": "Fantastic opportunity and great atmosphere to work in. Young and energetic employees striving to succeed", "text": "Pros Fun. Rewarding and full of energy. Many options for food and drink around the area to be able to get away from the office for a personal meeting Cons Limited parking, and busy trains make getting to work a bit difficult. Due to the tube strikes, the train delays make getting to your destination difficult to meet clients Advice to Management Continue to reach the goals set, and continue to hire the best professionals to develop the company further", "rating": 5, "pros": "Fun. Rewarding and full of energy. Many options for food and drink around the area to be able to get away from the office for a personal meeting", "cons": "Limited parking, and busy trains make getting to work a bit difficult. Due to the tube strikes, the train delays make getting to your destination difficult to meet clients", "advice": "Continue to reach the goals set, and continue to hire the best professionals to develop the company further"}, {"title": "Waste of time - Company name always changes", "text": "Pros None at all. Don't apply. Cons They hire pretty much anyone. Don't bother.", "rating": 1, "pros": "None at all. Don't apply.", "cons": "They hire pretty much anyone. Don't bother.", "advice": null}, {"title": "Entry level Marketing Assistant", "text": "Pros Great environment to work in and superb career development depending on your work ethic so you're aren't limited. Cons There can be a lot of pressure but that's necessary to help push you to succeed and profess within the company Advice to Management Do nothing different. incredible team and excellent introduction into marketing and the world of direct sales.", "rating": 5, "pros": "Great environment to work in and superb career development depending on your work ethic so you're aren't limited.", "cons": "There can be a lot of pressure but that's necessary to help push you to succeed and profess within the company", "advice": "Do nothing different. incredible team and excellent introduction into marketing and the world of direct sales."}, {"title": "Irreplacable opportunity", "text": "Pros A lot of young cool people to socialize, everybody is helpful, caring, dynamic and striving to progress. The experience you get here vs the amount of time, you can't get anywhere else. Also the atmosphere is te msot friendly place ive ever been to, Cons The only negative is that there aren't more people that should join us on this journey. Also the windows are always closed. Advice to Management More time for the inspirational morning meetings and training. Keep up the good work!", "rating": 5, "pros": "A lot of young cool people to socialize, everybody is helpful, caring, dynamic and striving to progress. The experience you get here vs the amount of time, you can't get anywhere else. Also the atmosphere is te msot friendly place ive ever been to,", "cons": "The only negative is that there aren't more people that should join us on this journey. Also the windows are always closed.", "advice": "More time for the inspirational morning meetings and training. Keep up the good work!"}, {"title": "Unparalleled career and personal development", "text": "Pros The company truly lives by its core values and is an embodiment of their company motto: \"train and develop your team so great that they can work anywhere, then treat them so great they would never want to.\" Hands down, this is the best team I've ever had a chance to work with - building each other and creating a greenhouse effect for uncapped growth and progression. One-on-one mentorship, coaching and guidance from world class CEO and world class training managers. Unparalleled opportunity. I would recommend to everyone! Cons Wish there were better parking services as central London gets really busy! And more rubbish bins in the office would be useful. Advice to Management The morning meetings and training sessions have changed and shaped my mentality to be more sharp and more of it would be amazing!", "rating": 5, "pros": "The company truly lives by its core values and is an embodiment of their company motto: \"train and develop your team so great that they can work anywhere, then treat them so great they would never want to.\" Hands down, this is the best team I've ever had a chance to work with - building each other and creating a greenhouse effect for uncapped growth and progression. One-on-one mentorship, coaching and guidance from world class CEO and world class training managers. Unparalleled opportunity. I would recommend to everyone!", "cons": "Wish there were better parking services as central London gets really busy! And more rubbish bins in the office would be useful.", "advice": "The morning meetings and training sessions have changed and shaped my mentality to be more sharp and more of it would be amazing!"}, {"title": "Incredible growth and progression opportunities", "text": "Pros It's motivating to know the rate at which you can progress through this company and the skills you learn along the way. The working environment is upbeat, happy and enthusiastic and every day you are being pushed and helped by your colleagues to be the best. Everyone working here are super approachable and driven. This energy rubs off on you and acts as a motivator to work hard and enjoy yourself. Cons The cloak room in the building is a bit small unfortunately and in typical London fashion there's no onsite parking Advice to Management Keep pushing entry level advisors to become the best", "rating": 5, "pros": "It's motivating to know the rate at which you can progress through this company and the skills you learn along the way. The working environment is upbeat, happy and enthusiastic and every day you are being pushed and helped by your colleagues to be the best. Everyone working here are super approachable and driven. This energy rubs off on you and acts as a motivator to work hard and enjoy yourself.", "cons": "The cloak room in the building is a bit small unfortunately and in typical London fashion there's no onsite parking", "advice": "Keep pushing entry level advisors to become the best"}, {"title": "SCAM -Stay away", "text": "Pros Nothing at all; the company is a scam..gives you big hopes but all is a lie nothing else. Cons all of it; going door to door and convincing people to save money on electricity. Absurd job Advice to Management Next time be truthful in the job description- do mention that the job requires direct marketing(door to door service) and is commission based.", "rating": 1, "pros": "Nothing at all; the company is a scam..gives you big hopes but all is a lie nothing else.", "cons": "all of it; going door to door and convincing people to save money on electricity.", "advice": "Next time be truthful in the job description- do mention that the job requires direct marketing(door to door service) and is commission based."}, {"title": "Positivity and strong work ethic", "text": "Pros You get opportunities that are impossible elsewhere. There is such a fast progression to management, it's incredible! And the management position isn't a regular manager's position, it's an owner position! They are looking to train people who want to become managers and open their own office. You are helped so much to achieve big things, the only thing you have to do is listen, say yes, and apply the advice they give you. Cons From the outside people see the work hours as long but if you're in it to win it, you should know it's worth it for the short-term to earn long-term freedom, recognition, and success. I did wait quite long for my first interview but don't let this affect you because once you're through the interview process, it's rocketship speed. Advice to Management Keep smashing those morning meetings, they are so motivational!", "rating": 5, "pros": "You get opportunities that are impossible elsewhere. There is such a fast progression to management, it's incredible! And the management position isn't a regular manager's position, it's an owner position! They are looking to train people who want to become managers and open their own office.", "cons": "From the outside people see the work hours as long but if you're in it to win it, you should know it's worth it for the short-term to earn long-term freedom, recognition, and success.", "advice": "Keep smashing those morning meetings, they are so motivational!"}, {"title": "Hero Corp", "text": "Pros Fast prgression. Friendly team help you to achieve all your goals. Good working environment Cons Theres no parking. Very busy area. Advice to Management Theyre doing a great job", "rating": 5, "pros": "Fast prgression. Friendly team help you to achieve all your goals. Good working environment", "cons": "Theres no parking. Very busy area.", "advice": "Theyre doing a great job"}, {"title": "Interview", "text": "Pros The working environment is great, everyone is polite and friendly. Also the support system is great, because you're not alone but have help to progress. Cons Working in the field you won't always get a yes from the customers. Can put you down. Advice to Management Management are doing a good job with being involved with their employees. So far there is nothing bad I can say. Just my experience so far as been great!", "rating": 5, "pros": "The working environment is great, everyone is polite and friendly. Also the support system is great, because you're not alone but have help to progress.", "cons": "Working in the field you won't always get a yes from the customers. Can put you down.", "advice": "Management are doing a good job with being involved with their employees. So far there is nothing bad I can say. Just my experience so far as been great!"}, {"title": "The best experience I've had by far!", "text": "Pros I have been working for Hero Corp for the past couple of months and it has been really good so far. The level of progression you get to go through is an experience. The fact that you get to share thus experience with a fantastic team is also a plus. Cons I do have to travel quite far every single day to the office. Advice to Management Keep on doing what you're doing! I have learnt so much in the time that I have been working for Hero Corp. It has also developed my skills and gas made me grow as a person. I am eternally grateful for everything.", "rating": 5, "pros": "I have been working for Hero Corp for the past couple of months and it has been really good so far. The level of progression you get to go through is an experience. The fact that you get to share thus experience with a fantastic team is also a plus.", "cons": "I do have to travel quite far every single day to the office.", "advice": "Keep on doing what you're doing! I have learnt so much in the time that I have been working for Hero Corp. It has also developed my skills and gas made me grow as a person. I am eternally grateful for everything."}, {"title": "From no experience in marketing to overseeing a whole team", "text": "Pros When I first applied to the role, I wasn't really sure if I would be suitable for the position due to the fact that I had no experience what so ever and my communication skills were not the best, but once I got the position offered all of these concerns vanished. Everything that you need to know is thought in the first few weeks of the business and even skills like leadership, management or public speaking are part of the training. Friendly environment and definitely to recommend for people who are looking into an career Cons The only con is that the competition is high when I had my interview", "rating": 5, "pros": "When I first applied to the role, I wasn't really sure if I would be suitable for the position due to the fact that I had no experience what so ever and my communication skills were not the best, but once I got the position offered all of these concerns vanished.", "cons": "The only con is that the competition is high when I had my interview", "advice": null}, {"title": "Great", "text": "Pros A great way to develop as a person on the training programme. Cons Hard to progress on a part-time basis, long working hours and super competitive. Advice to Management Need a common room, a water dispenser and a microwave for the staff.", "rating": 5, "pros": "A great way to develop as a person on the training programme.", "cons": "Hard to progress on a part-time basis, long working hours and super competitive.", "advice": "Need a common room, a water dispenser and a microwave for the staff."}, {"title": "Incredible experience", "text": "Pros Hero Corp is not only a job but it is a place where you learn how to Win! Cons This company gave me the chance to learn, work, earn money and build a winner mentality at the same time. So incredible to travel in Uk, to expand yourself and live different experiences.", "rating": 5, "pros": "Hero Corp is not only a job but it is a place where you learn how to Win!", "cons": "This company gave me the chance to learn, work, earn money and build a winner mentality at the same time.", "advice": null}, {"title": "Best review ever!!", "text": "Pros -there's a very friendly environment -everyone is very welcoming -its a place where you can be yourself Cons -Working hours are too long ! -takes time to adjust to the social environment Advice to Management - to provide more one to one practical training where you can properly judge your strengths and weaknesses.", "rating": 5, "pros": "-there's a very friendly environment", "cons": "-Working hours are too long !", "advice": "- to provide more one to one practical training where you can properly judge your strengths and weaknesses."}, {"title": "Life changing career opportunity!", "text": "Pros Working here has been life changing! Definitely worked in a lot of places, but the atmosphere and the great people working here is just incredible! Besides all of that, I had started from an entry level role and got my way up to the TOP in just 5 months! Working alongside the CEO had helped me develop in my career a long way! Cons No parking near the office. And along side of it is a bit pricy to park in central London. Rather just take public transport. Advice to Management CEO - keep up the great work!", "rating": 5, "pros": "Working here has been life changing! Definitely worked in a lot of places, but the atmosphere and the great people working here is just incredible!", "cons": "No parking near the office. And along side of it is a bit pricy to park in central London. Rather just take public transport.", "advice": "CEO - keep up the great work!"}, {"title": "Event interview", "text": "Pros Very positive environment and a lot of room for personal and career growth. Perfect role for anyone who is self motivated and hard working. Cons Requires emotional strength and self discipline. Advice to Management Super motivating and very inspirational! Great business model.", "rating": 5, "pros": "Very positive environment and a lot of room for personal and career growth. Perfect role for anyone who is self motivated and hard working.", "cons": "Requires emotional strength and self discipline.", "advice": "Super motivating and very inspirational! Great business model."}, {"title": "Work ethic second to none!", "text": "Pros Working for HeroCorp for the last year has shown me the amount of work and dedication put into making client marketing strategies work! The Amount of details you learn in 2 weeks can never be covered by a higher education in a year.( i am a Finance and Marketing Graduate) My Coworkers are incredibly helpful in providing everything needed to succeed. While there is an air of competition, it is always friendly and unselfish and the outcome pushes everyone forward. if you are looking for a bright future with opportunities to work for very big clients; then look no forward then HeroCorp. Cons No Parking facilities available on site Advice to Management keep winning !", "rating": 5, "pros": "Working for HeroCorp for the last year has shown me the amount of work and dedication put into making client marketing strategies work! The Amount of details you learn in 2 weeks can never be covered by a higher education in a year.( i am a Finance and Marketing Graduate) My Coworkers are incredibly helpful in providing everything needed to succeed. While there is an air of competition, it is always friendly and unselfish and the outcome pushes everyone forward. if you are looking for a bright future with opportunities to work for very big clients; then look no forward then HeroCorp.", "cons": "No Parking facilities available on site", "advice": "keep winning !"}, {"title": "bad job", "text": "Pros I guess you can progress but quickly Cons Its a scam dont work here", "rating": 1, "pros": "I guess you can progress but quickly", "cons": "Its a scam dont work here", "advice": null}, {"title": "Inspiring", "text": "Pros From working with Boyd it give me the inspiration to set my own business up. Learned so much from his company Cons No cons at all was completely transforming as an individual and motivating Advice to Management Keep up the amazing work of producing young entrepreneurs", "rating": 5, "pros": "From working with Boyd it give me the inspiration to set my own business up. Learned so much from his company", "cons": "No cons at all was completely transforming as an individual and motivating", "advice": "Keep up the amazing work of producing young entrepreneurs"}, {"title": "Herocorp Opportunity!", "text": "Pros Constant opportunity to develop self characteristics with a vibrant atmosphere each day. Great opportunity for a career choice and learn as you grow. Develop management skills with an open communication environment amongst everyone around you. Cons Limited parking spaces, expensive to also park and slightly difficult to find on your visit. Advice to Management Maintain that great level of work!", "rating": 5, "pros": "Constant opportunity to develop self characteristics with a vibrant atmosphere each day. Great opportunity for a career choice and learn as you grow. Develop management skills with an open communication environment amongst everyone around you.", "cons": "Limited parking spaces, expensive to also park and slightly difficult to find on your visit.", "advice": "Maintain that great level of work!"}, {"title": "Marketing assistant", "text": "Pros The people were nice and friendly, they were really approachable and knew how to speak pleasantly. Cons Its all a scam, they literally make you go around knocking on doors to scam people. Advice to Management Let future employees know what the real job is, instead of lying and scamming.", "rating": 1, "pros": "The people were nice and friendly, they were really approachable and knew how to speak pleasantly.", "cons": "Its all a scam, they literally make you go around knocking on doors to scam people.", "advice": "Let future employees know what the real job is, instead of lying and scamming."}, {"title": "Fantastic place to start and build a career", "text": "Pros Training provided, supportive and inspiring management team, mentoring opportunities, fast-track progression opportunities, collaborative and team-oriented environment Cons None that are noticeable. In order to be successful, you have to want to work work hard, be committed and dedicated", "rating": 5, "pros": "Training provided, supportive and inspiring management team, mentoring opportunities, fast-track progression opportunities, collaborative and team-oriented environment", "cons": "None that are noticeable. In order to be successful, you have to want to work work hard, be committed and dedicated", "advice": null}, {"title": "An unique learning experience", "text": "Pros If you are a proactive and ambitious individual with positive mindset, it's the perfect place. Cons You need to be able to receive feedback and work efficiently without using excuses.", "rating": 5, "pros": "If you are a proactive and ambitious individual with positive mindset, it's the perfect place.", "cons": "You need to be able to receive feedback and work efficiently without using excuses.", "advice": null}, {"title": "Best Job I've had so far!!", "text": "Pros I enjoy every aspect of this job, aside the company feeling like a big family the growth and opportunities Hero Corp is offering is better than any other job I've been in. It's a fast developing company , from when I start till when I finish at the end of everyday is filled with laughs and positive energy! Cons I couldn't say anything negative about this company. Everything they do has a reason behind it , the harder you work , the further you will go in the company Advice to Management Every manager and Leader is so inspiring. Whenever you need to talk to someone they are always available to sit down with, everyone is motivational and doesn't just want us the succeed but wants us to achieve our goals", "rating": 5, "pros": "I enjoy every aspect of this job, aside the company feeling like a big family the growth and opportunities Hero Corp is offering is better than any other job I've been in. It's a fast developing company , from when I start till when I finish at the end of everyday is filled with laughs and positive energy!", "cons": "I couldn't say anything negative about this company. Everything they do has a reason behind it , the harder you work , the further you will go in the company", "advice": "Every manager and Leader is so inspiring. Whenever you need to talk to someone they are always available to sit down with, everyone is motivational and doesn't just want us the succeed but wants us to achieve our goals"}, {"title": "Great career path. Place to grow big!", "text": "Pros Extremely ambitious and motivated work environment. Everyone is helpful on each stage without even asking. No seniority encourage people to move quickly in career path and develop on day to day basis! Cons Loud music sometimes is a bit annoying. Advice to Management Keep up great work!", "rating": 5, "pros": "Extremely ambitious and motivated work environment. Everyone is helpful on each stage without even asking. No seniority encourage people to move quickly in career path and develop on day to day basis!", "cons": "Loud music sometimes is a bit annoying.", "advice": "Keep up great work!"}, {"title": "Direct sales", "text": "Pros It really boosts your confidence and moves your career forward. Valuable skills gained Cons You need to be patient to receive the results you want, but it's worth it Advice to Management Keep doing what you're doing", "rating": 5, "pros": "It really boosts your confidence and moves your career forward. Valuable skills gained", "cons": "You need to be patient to receive the results you want, but it's worth it", "advice": "Keep doing what you're doing"}, {"title": "Enviroment", "text": "Pros Fun environment to work in Cons Adapting to the fast pace environment Advice to Management Being the best student", "rating": 5, "pros": "Fun environment to work in", "cons": "Adapting to the fast pace environment", "advice": "Being the best student"}, {"title": "This is just the beginning", "text": "Pros This business has given me an opportunity to build a career for myself and has helped me to have the work ethic to succeed. Cons No cons its up to the individual to succeed Advice to Management None", "rating": 5, "pros": "This business has given me an opportunity to build a career for myself and has helped me to have the work ethic to succeed.", "cons": "No cons its up to the individual to succeed", "advice": "None"}, {"title": "Motivational Environment", "text": "Pros Since starting at HeroCorp, my development has been phenomenal, not only have I improved my work ethic and my attitude, I have also progressed my career. The whole team at HeroCorp is very united and they accepted and helped me from day 1 which you don't get in many places. Cons Parking is very limited on site!", "rating": 5, "pros": "Since starting at HeroCorp, my development has been phenomenal, not only have I improved my work ethic and my attitude, I have also progressed my career. The whole team at HeroCorp is very united and they accepted and helped me from day 1 which you don't get in many places.", "cons": "Parking is very limited on site!", "advice": null}, {"title": "Here's were your dreams start", "text": "Pros Starting Hero corp for me was a blessing, I always say I wish I started a while back. This business is not only changing my mentality but it is overall building the way I approach my life. Using the skills and knowledge taught in this business I now feel like my approach to situations are a lot better. Cons No cons. It's all up to the individual. Advice to Management None", "rating": 3, "pros": "Starting Hero corp for me was a blessing, I always say I wish I started a while back. This business is not only changing my mentality but it is overall building the way I approach my life. Using the skills and knowledge taught in this business I now feel like my approach to situations are a lot better.", "cons": "No cons. It's all up to the individual.", "advice": "None"}, {"title": "Inspirational working environment", "text": "Pros For the duration of my time at HeroCorp, I have developed dramatically not only in skill, but in confidence. Everyday I have a goal and a dream, which is reinforced everyday by a workforce of people who propel you forwards! Cons No car parking in the area and limited lunchtime facilities on site.", "rating": 5, "pros": "For the duration of my time at HeroCorp, I have developed dramatically not only in skill, but in confidence. Everyday I have a goal and a dream, which is reinforced everyday by a workforce of people who propel you forwards!", "cons": "No car parking in the area and limited lunchtime facilities on site.", "advice": null}, {"title": "HeroCorp... An Opportunity To Grow!", "text": "Pros I'm privileged to be amongst the business here at Herocorp. A place that breeds excellence and progression. An atmosphere of sheer determination with a cohesive group of business partners! Working at Herocorp has allowed me to grow in confidence, perseverance and helps overwhelm your goals from your doubts. I'm happy to work alongside such an expansive and enthusiastic organization where each day you get closer to your dream! \"When you work more then what you're paid for, you'd soon get paid more for what you do!\" Cons Travel to work can sometimes be havock in the morning especially with the location of the office.", "rating": 5, "pros": "I'm privileged to be amongst the business here at Herocorp. A place that breeds excellence and progression. An atmosphere of sheer determination with a cohesive group of business partners!", "cons": "Travel to work can sometimes be havock in the morning especially with the location of the office.", "advice": null}]