[{"title": "Excellent Start Up Experience!", "text": "Pros New and fresh doing business like nobody else. The company is still in its infancy stage so there is a lot of room for growth and opportunity. Casual culture and work environment. Cons Decision making and processes are a little slow as with any startup as we are still trying to gain a lot of traction in our industry.", "rating": 5, "pros": "New and fresh doing business like nobody else. The company is still in its infancy stage so there is a lot of room for growth and opportunity. Casual culture and work environment.", "cons": "Decision making and processes are a little slow as with any startup as we are still trying to gain a lot of traction in our industry.", "advice": null}, {"title": "Great company, Great direction, Great opportunity", "text": "Pros Great company, still very new to Phoenix, and to the US. Amazing opportunity to grow and develop with upper management right next to you. Unique growth opportunities that are only available in a start-up. Very flat leadership structure, and which provides an excellent opportunity to connect and converse with global leadership. Very unique in that Hombell has a confident and clear direction/vision for the future, but is also willing to evaluate and adjust as needed. Cons Compensation is one huge challenge, as with any start-up. It is challenging to deal with policies and procedures that are focused on the European market that may, or may not apply to the US market. Some decisions move significantly slower than they should for a start-up, this is partially understandable because management is split between the US and Berlin.", "rating": 5, "pros": "Great company, still very new to Phoenix, and to the US.", "cons": "Compensation is one huge challenge, as with any start-up. It is challenging to deal with policies and procedures that are focused on the European market that may, or may not apply to the US market. Some decisions move significantly slower than they should for a start-up, this is partially understandable because management is split between the US and Berlin.", "advice": null}, {"title": "Good company overall - still some growing pains in Phoenix", "text": "Pros -Really really nice and driven people you get to work with -Awesome idea and seems like a lot of great opportunity if you perform well -Strong and talented leadership in the US -Fun environment -Seems like it's gearing up for crazy growth Cons -The US is still experiencing some growing pains (moved main operations from NYC to Phoenix rather quickly/abruptly, cramped PHX office, figuring out the best pay structures, etc.) -It's a start up so pay is not what you would get at a larger, more established company -Pressure to perform which could also be a pro maybe sometimes", "rating": 5, "pros": "-Really really nice and driven people you get to work with", "cons": "-The US is still experiencing some growing pains (moved main operations from NYC to Phoenix rather quickly/abruptly, cramped PHX office, figuring out the best pay structures, etc.)", "advice": null}, {"title": "Run by children!!", "text": "Pros Can't think of many, aside from benefits. Cons Where to start: it's run by kids in their mid 20's who have no idea how to manage people or communicate. For a sales organization, they're one of the most disorganized groups of people I have ever met. This is a startup, and that means disorganization to some degree, but this is off the hook. The left hand has no idea what right hand is doing. They pay like crap and promise things they cannot deliver (like great commissions, etc). There is no company culture to speak of. It's work hard, and never hard enough. Advice to Management If you're going to pay like junk--at least offer some type of company culture. Free drinks, etc. Don't fight people when they try to take their promised vacation time and pay like you say you are going to. Also--take a management class or two. Harvard didn't educate you well enough to survive in the real world. Pay people what they're worth and don't promise big things that you can't produce (i.e a crappy contract, with high hopes for commissions).", "rating": 1, "pros": "Can't think of many, aside from benefits.", "cons": "Where to start: it's run by kids in their mid 20's who have no idea how to manage people or communicate. For a sales organization, they're one of the most disorganized groups of people I have ever met. This is a startup, and that means disorganization to some degree, but this is off the hook. The left hand has no idea what right hand is doing.", "advice": "If you're going to pay like junk--at least offer some type of company culture. Free drinks, etc. Don't fight people when they try to take their promised vacation time and pay like you say you are going to."}, {"title": "Great enthusiasm and direction", "text": "Pros Opportunity to personally develop in a fast growing company - exciting outlook for the company Immediate responsibility and flexibility of tasks Company leadership is passionate, supportive and structured Cons Processes are improving - no cons yet! Advice to Management Keep up the enthusiasm and hiring!", "rating": 5, "pros": "Opportunity to personally develop in a fast growing company - exciting outlook for the company", "cons": "Processes are improving - no cons yet!", "advice": "Keep up the enthusiasm and hiring!"}, {"title": "Not a great company", "text": "Pros Homebell offers food at their office and the environment is generally relaxed. Most people are friendly and made some good friends there. Room to pick up own projects. Cons Company direction changes every couple of weeks, there is a very overpowering German group at the top who say they believe in flat hierarchy (probably because that's part of the fun startup idea) but do not seem to realize how to put it in to practice. Very poor pay and hardly any benefits (training/self-development/etc.) that make the poor payment worthwile Advice to Management Change HR practices to focus more on employee retention, do not ask employees to write favorable reviews on websites like Glassdoor to improve online presence, engage more with the people in the company.", "rating": 3, "pros": "Homebell offers food at their office and the environment is generally relaxed. Most people are friendly and made some good friends there. Room to pick up own projects.", "cons": "Company direction changes every couple of weeks, there is a very overpowering German group at the top who say they believe in flat hierarchy (probably because that's part of the fun startup idea) but do not seem to realize how to put it in to practice. Very poor pay and hardly any benefits (training/self-development/etc.) that make the poor payment worthwile", "advice": "Change HR practices to focus more on employee retention, do not ask employees to write favorable reviews on websites like Glassdoor to improve online presence, engage more with the people in the company."}, {"title": "Beware of The Wolf in Sheep disguise", "text": "Pros Good colleagues, Free breakfast, different projects Cons - Bosses want extra hours all the time for a low salary - People gets fire for being good at work after 3 months - Do not take seriously your contract because you will not stay more than 3 months - Extra work is not recognize and is consider useless because of change of objectives Advice to Management Stop hiring people with the promise of career path, you don't have a career path, you have rotation people, every 3 months people goes way (or fired) and new people enter, Stop pretending you are stable, better give freelance contracts and pay more. Do not give a free food or free parties just to gain 2 or 3 hours more per day to your employees, no one will stay a party when you have to do 3 hours more of work just for to drink two beers.", "rating": 1, "pros": "Good colleagues, Free breakfast, different projects", "cons": "- Bosses want extra hours all the time for a low salary", "advice": "Stop hiring people with the promise of career path, you don't have a career path, you have rotation people, every 3 months people goes way (or fired) and new people enter, Stop pretending you are stable, better give freelance contracts and pay more."}, {"title": "One of the best places to work", "text": "Pros - Supportive, hard working & talented peers - Great office with flexible timings. - Awesome place to grow personally and professionally. Management not only focuses on developing the product organically but also keeps in mind the personal growth of their employee's Cons - Cannot find any cons as of now. Advice to Management keep rocking :)", "rating": 5, "pros": "- Supportive, hard working & talented peers", "cons": "- Cannot find any cons as of now.", "advice": "keep rocking :)"}, {"title": "Best growing experience ever", "text": "Pros Experience that make me grow professionally and personally. Working in Homebell means working with the strongest people in the market and working with a potential unicorn startup. All company teams and the founders were simply amazing. Cons Office location (Tempelhof) and office too big (I like boiler room). Advice to Management Let's keeping pushing on the quality of the people.", "rating": 5, "pros": "Experience that make me grow professionally and personally. Working in Homebell means working with the strongest people in the market and working with a potential unicorn startup. All company teams and the founders were simply amazing.", "cons": "Office location (Tempelhof) and office too big (I like boiler room).", "advice": "Let's keeping pushing on the quality of the people."}, {"title": "Startup which I love working for!", "text": "Pros Startup which I love working for! Good work environment which allows you to set your own goals and take on a variety of roles and tasks. Team is international - You meet a lot of cool and nice people. ‘Get sh*t done’ attitude. Cons HQ location Quick staff rotation Few team events Advice to Management Invest in people management Better internal communication", "rating": 5, "pros": "Startup which I love working for! Good work environment which allows you to set your own goals and take on a variety of roles and tasks. Team is international - You meet a lot of cool and nice people. ‘Get sh*t done’ attitude.", "cons": "HQ location", "advice": "Invest in people management"}, {"title": "steep learning curve", "text": "Pros A lot of Responsibilities. A lot of possibilities too grow your personal skill set. Interesting and challenging tasks. Great colleagues. Cons Not really any cons but Homebell expects a lot of drive from their employees. You have to be able to always be motivated and passionate about your job.", "rating": 5, "pros": "A lot of Responsibilities. A lot of possibilities too grow your personal skill set. Interesting and challenging tasks. Great colleagues.", "cons": "Not really any cons but Homebell expects a lot of drive from their employees. You have to be able to always be motivated and passionate about your job.", "advice": null}, {"title": "Homebell high growth start up", "text": "Pros - Lot of freedom in your job - lots of chances to learn ( create your own tasks - make your own job ) - Innovative atmosphere in the office - Young team with experience Cons - Can be a routine job sometimes, but like I said; you can assign your own tasks Advice to Management - Keep hiring people who are motivated to work in this industry", "rating": 5, "pros": "- Lot of freedom in your job - lots of chances to learn ( create your own tasks - make your own job )", "cons": "- Can be a routine job sometimes, but like I said; you can assign your own tasks", "advice": "- Keep hiring people who are motivated to work in this industry"}, {"title": "Homebell review 2016", "text": "Pros Easygoing, flexible staff, nice work environment and the possibility to do a variety of tasks. (when you ask for it) Working here gives you the possibility to develop project management and communication skills. Cons Downsides are that departments aren't working together smoothly. Too less, or too many employees in one department creates that the other department has either way too much workload, or way too less. This can have demotivating effect. Advice to Management Try to find a way to create an overview of employees needed to get the job done, and react faster to changes in demand. And overall try to minimize staff turnover.", "rating": 5, "pros": "Easygoing, flexible staff, nice work environment and the possibility to do a variety of tasks. (when you ask for it) Working here gives you the possibility to develop project management and communication skills.", "cons": "Downsides are that departments aren't working together smoothly. Too less, or too many employees in one department creates that the other department has either way too much workload, or way too less. This can have demotivating effect.", "advice": "Try to find a way to create an overview of employees needed to get the job done, and react faster to changes in demand. And overall try to minimize staff turnover."}, {"title": "Start-up Berlin", "text": "Pros Nice collegues, fun activities organized outside work good work atmosphere, lot of learning possibilites and side projects you can do, possibility to work in the weekend and get a weekday of. Cons The working days are quite long and the basic salary could be higher, it`s quite hard to earn your commision.", "rating": 5, "pros": "Nice collegues, fun activities organized outside work good work atmosphere, lot of learning possibilites and side projects you can do, possibility to work in the weekend and get a weekday of.", "cons": "The working days are quite long and the basic salary could be higher, it`s quite hard to earn your commision.", "advice": null}, {"title": "nice company to work for", "text": "Pros Open atmosphere, independent work yet team directed, good location, good facilities Cons It is a fairly new company, but the organisation is improving. Ideal if you are full of ideas for improvement Advice to Management Do not look down on the problems that each position encourents. The reality is as important as the theories.", "rating": 5, "pros": "Open atmosphere, independent work yet team directed, good location, good facilities", "cons": "It is a fairly new company, but the organisation is improving. Ideal if you are full of ideas for improvement", "advice": "Do not look down on the problems that each position encourents. The reality is as important as the theories."}, {"title": "Fastgrowing game-changing startup!", "text": "Pros Enormous responsibility from day one. There is a relaxed atmosphere with a lot of opportunities and inspiring colleagues! We got good parties on Fridays! Cons They expect you to work hard, with sometimes high targets. This results in long days but that will keep the company alive! Advice to Management Please keep listening to your employees and try to focus a bit more on the wishes of the workers to make sure they stay happy!", "rating": 5, "pros": "Enormous responsibility from day one. There is a relaxed atmosphere with a lot of opportunities and inspiring colleagues! We got good parties on Fridays!", "cons": "They expect you to work hard, with sometimes high targets. This results in long days but that will keep the company alive!", "advice": "Please keep listening to your employees and try to focus a bit more on the wishes of the workers to make sure they stay happy!"}, {"title": "awesome", "text": "Pros the team is like a family. here you have great development possibilities. Cons to less sun in berlin Advice to Management keep on rocking", "rating": 5, "pros": "the team is like a family. here you have great development possibilities.", "cons": "to less sun in berlin", "advice": "keep on rocking"}, {"title": "Good working environment!", "text": "Pros This young company is on the right path to get to be a big Start up , first of all because of the way they take care of there employees, they provide a good working environment. They achieved through their actions, to create a sense of friendship and loyalty to their employees. Cons - Working space not perfect but normal for such a young company.", "rating": 5, "pros": "This young company is on the right path to get to be a big Start up , first of all because of the way they take care of there employees, they provide a good working environment.", "cons": "- Working space not perfect but normal for such a young company.", "advice": null}, {"title": "Disrupt the home improvement industry with top-notch technology", "text": "Pros -Great people with a passion to learn and grow. If you enjoy working with the latest technology in a rewarding, fast-paced environment, a career at Homebell may be for you -Flat structure, which allows to be nimble and move fast -Above-average salary with several perks (free coffee, free dinner, tons of team-building activities) -Highly skilled marketing team Cons -Like any tech company, the work is big and complicated so work/life balance can suffer from time to time Advice to Management - Improve communication - Set clear goals within the teams", "rating": 5, "pros": "-Great people with a passion to learn and grow. If you enjoy working with the latest technology in a rewarding, fast-paced environment, a career at Homebell may be for you", "cons": "-Like any tech company, the work is big and complicated so work/life balance can suffer from time to time", "advice": "- Improve communication"}, {"title": "Great Company to work with", "text": "Pros 1. Flexible timings. 2. Lots of opportunities to learn and grow. 3. Great work culture. 4. Talented peers around who are ready to help whenever asked. 5. Management is supportive. Cons Everything is smooth as of now so can't think of any con right now.", "rating": 5, "pros": "1. Flexible timings.", "cons": "Everything is smooth as of now so can't think of any con right now.", "advice": null}, {"title": "Best environment to work", "text": "Pros Awesome place to work, friendly environment and good values. Amazing work culture and really smart and passionate people to work with. Management really cares about everyone in the company and gives full freedom to go beyond limits for innovation. Cons There are no cons. Things are moving pretty fast and in good direction. Advice to Management Keep up the good work and keep rocking.", "rating": 5, "pros": "Awesome place to work, friendly environment and good values. Amazing work culture and really smart and passionate people to work with. Management really cares about everyone in the company and gives full freedom to go beyond limits for innovation.", "cons": "There are no cons. Things are moving pretty fast and in good direction.", "advice": "Keep up the good work and keep rocking."}, {"title": "Amazing company to work with great potential", "text": "Pros Have been working here for almost 8 months now, and every day its an awesome day to work with people here. The journey till date has been exciting for me with lot of challenging work and scope to learn new things. Cons The company is growing up and is an early stage startup so with it comes cons of a startup but company is doing it best to handle them and keep employees happy. Advice to Management keep doing the good work and be like a startup always. Lets also keep some healthy stuff to eat in cafeteria.", "rating": 5, "pros": "Have been working here for almost 8 months now, and every day its an awesome day to work with people here. The journey till date has been exciting for me with lot of challenging work and scope to learn new things.", "cons": "The company is growing up and is an early stage startup so with it comes cons of a startup but company is doing it best to handle them and keep employees happy.", "advice": "keep doing the good work and be like a startup always. Lets also keep some healthy stuff to eat in cafeteria."}, {"title": "Rewarding work in a good company", "text": "Pros Wide range of task and responsibilities if wanted, great colleagues, work and effort is appreciated and rewarded. Cons high workload, a bit far off.", "rating": 5, "pros": "Wide range of task and responsibilities if wanted, great colleagues, work and effort is appreciated and rewarded.", "cons": "high workload, a bit far off.", "advice": null}, {"title": "Startup at its best!", "text": "Pros Great international team in a tech-driven startup that puts its employees and customers first! What i really like is the dynamic and flexible work environment that lets you get involved in all parts of the customer experience and service-type you are working with. Top management is also really open and will listen to any inquiry , good or bad. +Good parties +Good events +Good food Homebell is an awesome place for anyone in the beginning of his/her carrier but also for the specialists who want to become even better and/or broader! If you want to take part in building a great company in all what that includes, for me, this is the place. Cons Some processes are not yet specified due to the quick growth and can add some additional challenges when you start something new. The office is getting better and better but still have some more details that needs to be added. Advice to Management Continue building and bettering the processes for an even better experience.", "rating": 5, "pros": "Great international team in a tech-driven startup that puts its employees and customers first! What i really like is the dynamic and flexible work environment that lets you get involved in all parts of the customer experience and service-type you are working with. Top management is also really open and will listen to any inquiry , good or bad.", "cons": "Some processes are not yet specified due to the quick growth and can add some additional challenges when you start something new.", "advice": "Continue building and bettering the processes for an even better experience."}, {"title": "Fantastic experience so far", "text": "Pros 1. Right approach. For example: profitability focus, no short term half measures, hard decisions whenever required for healthy growth. 2. Open environment which fosters learning. 3. Active participation allowed in decision making of all kinds. Cons 1. Less space, more people(hopefully will be sorted with new office) Advice to Management They are doing a decent job. Keep going.", "rating": 5, "pros": "1. Right approach. For example: profitability focus, no short term half measures, hard decisions whenever required for healthy growth.", "cons": "1. Less space, more people(hopefully will be sorted with new office)", "advice": "They are doing a decent job. Keep going."}, {"title": "One of those rare tech companies in Berlin", "text": "Pros Clear vision to use advanced technology to disrupt this industry Management (top and Middle) more experienced than in most other start ups and hence much better in helping to tackle problems Great Team and Spirit Cons Do not staff new positions as quickly as company grows therefore not the usual nine to five job Office location in Tempelhof Advice to Management Keep hiring the good people! They drive your business and make it a motivating place to work. Better communication on where the company as a whole is going to", "rating": 5, "pros": "Clear vision to use advanced technology to disrupt this industry", "cons": "Do not staff new positions as quickly as company grows therefore not the usual nine to five job", "advice": "Keep hiring the good people! They drive your business and make it a motivating place to work."}, {"title": "Homebell, a company with an enthusiastic and passionate work environment!", "text": "Pros The entire team at Homebell is very passionate about bringing the company to the next level. The enthusiasm is great and the people working here are smart and have a heart for what they are doing, and what they are good at. It is a nice learning environment with a wide variety of tasks which offers the possibility to learn new things every day. Cons The working hours are quite long while there is little compensation for these extra hours Advice to Management Grow slowly, make sure to keep hiring enthusiastic employees and keep up with the good work and Friday night parties!", "rating": 5, "pros": "The entire team at Homebell is very passionate about bringing the company to the next level. The enthusiasm is great and the people working here are smart and have a heart for what they are doing, and what they are good at. It is a nice learning environment with a wide variety of tasks which offers the possibility to learn new things every day.", "cons": "The working hours are quite long while there is little compensation for these extra hours", "advice": "Grow slowly, make sure to keep hiring enthusiastic employees and keep up with the good work and Friday night parties!"}, {"title": "Terrible, dishonest company.", "text": "Pros The company will probably still be here this time next year. You get paid (eventually). If you're desperate for a job, this is one. Cons Was misled by hiring managers regarding hours and made to work 9 to 7 everyday, despite having a 40 hour contract. Oppressive micromanaging culture with no trust from management team. HR are patronising, enforce trivial rules and act like strict teachers. Payment was late every month. Targets were changed arbitrarily with no foresight. I was often asked to mislead customers and partners as result of changing targets. This was comfortably the worst job I ever had. I resigned without another job, as I see unemployment as better option. Advice to Management Treat your employees with more respect. Don't lie in the hiring process.", "rating": 1, "pros": "The company will probably still be here this time next year. You get paid (eventually). If you're desperate for a job, this is one.", "cons": "Was misled by hiring managers regarding hours and made to work 9 to 7 everyday, despite having a 40 hour contract. Oppressive micromanaging culture with no trust from management team. HR are patronising, enforce trivial rules and act like strict teachers.", "advice": "Treat your employees with more respect. Don't lie in the hiring process."}, {"title": "Great starting position", "text": "Pros At Homebell you get lot's of responsibility from day one and start your career in an interesting technology environment. Cons As the company moved to a very large new office the delivery of couches etc. is not fully completed yet. Advice to Management Do more of these exciting team events!", "rating": 5, "pros": "At Homebell you get lot's of responsibility from day one and start your career in an interesting technology environment.", "cons": "As the company moved to a very large new office the delivery of couches etc. is not fully completed yet.", "advice": "Do more of these exciting team events!"}, {"title": "Great opportunity to develop yourself", "text": "Pros You get to work in a young and motivated team, dynamic environment with the possibility to learn a lot within a short amount of time. Because of the flat hierarchies within the company, it is easy to pitch your own ideas to, for example, the two founders. Everyone is working with the same goals in mind and because of that the team spirit is really high. Cons Working in this dynamic environment is not for everyone, because it is constantly changing, you need to be able to adapt very fast to keep up with the growth of the company. If you have a nine-to-five mentality, you will have a hard time within this company. Advice to Management Keep up the good work and love your employees even more :-)", "rating": 5, "pros": "You get to work in a young and motivated team, dynamic environment with the possibility to learn a lot within a short amount of time. Because of the flat hierarchies within the company, it is easy to pitch your own ideas to, for example, the two founders. Everyone is working with the same goals in mind and because of that the team spirit is really high.", "cons": "Working in this dynamic environment is not for everyone, because it is constantly changing, you need to be able to adapt very fast to keep up with the growth of the company. If you have a nine-to-five mentality, you will have a hard time within this company.", "advice": "Keep up the good work and love your employees even more :-)"}, {"title": "Excellent Start Up Experience!", "text": "Pros New and fresh doing business like nobody else. The company is still in its infancy stage so there is a lot of room for growth and opportunity. Casual culture and work environment. Cons Decision making and processes are a little slow as with any startup as we are still trying to gain a lot of traction in our industry.", "rating": 5, "pros": "New and fresh doing business like nobody else. The company is still in its infancy stage so there is a lot of room for growth and opportunity. Casual culture and work environment.", "cons": "Decision making and processes are a little slow as with any startup as we are still trying to gain a lot of traction in our industry.", "advice": null}, {"title": "Great company, Great direction, Great opportunity", "text": "Pros Great company, still very new to Phoenix, and to the US. Amazing opportunity to grow and develop with upper management right next to you. Unique growth opportunities that are only available in a start-up. Very flat leadership structure, and which provides an excellent opportunity to connect and converse with global leadership. Very unique in that Hombell has a confident and clear direction/vision for the future, but is also willing to evaluate and adjust as needed. Cons Compensation is one huge challenge, as with any start-up. It is challenging to deal with policies and procedures that are focused on the European market that may, or may not apply to the US market. Some decisions move significantly slower than they should for a start-up, this is partially understandable because management is split between the US and Berlin.", "rating": 5, "pros": "Great company, still very new to Phoenix, and to the US.", "cons": "Compensation is one huge challenge, as with any start-up. It is challenging to deal with policies and procedures that are focused on the European market that may, or may not apply to the US market. Some decisions move significantly slower than they should for a start-up, this is partially understandable because management is split between the US and Berlin.", "advice": null}, {"title": "Good company overall - still some growing pains in Phoenix", "text": "Pros -Really really nice and driven people you get to work with -Awesome idea and seems like a lot of great opportunity if you perform well -Strong and talented leadership in the US -Fun environment -Seems like it's gearing up for crazy growth Cons -The US is still experiencing some growing pains (moved main operations from NYC to Phoenix rather quickly/abruptly, cramped PHX office, figuring out the best pay structures, etc.) -It's a start up so pay is not what you would get at a larger, more established company -Pressure to perform which could also be a pro maybe sometimes", "rating": 5, "pros": "-Really really nice and driven people you get to work with", "cons": "-The US is still experiencing some growing pains (moved main operations from NYC to Phoenix rather quickly/abruptly, cramped PHX office, figuring out the best pay structures, etc.)", "advice": null}, {"title": "Run by children!!", "text": "Pros Can't think of many, aside from benefits. Cons Where to start: it's run by kids in their mid 20's who have no idea how to manage people or communicate. For a sales organization, they're one of the most disorganized groups of people I have ever met. This is a startup, and that means disorganization to some degree, but this is off the hook. The left hand has no idea what right hand is doing. They pay like crap and promise things they cannot deliver (like great commissions, etc). There is no company culture to speak of. It's work hard, and never hard enough. Advice to Management If you're going to pay like junk--at least offer some type of company culture. Free drinks, etc. Don't fight people when they try to take their promised vacation time and pay like you say you are going to. Also--take a management class or two. Harvard didn't educate you well enough to survive in the real world. Pay people what they're worth and don't promise big things that you can't produce (i.e a crappy contract, with high hopes for commissions).", "rating": 1, "pros": "Can't think of many, aside from benefits.", "cons": "Where to start: it's run by kids in their mid 20's who have no idea how to manage people or communicate. For a sales organization, they're one of the most disorganized groups of people I have ever met. This is a startup, and that means disorganization to some degree, but this is off the hook. The left hand has no idea what right hand is doing.", "advice": "If you're going to pay like junk--at least offer some type of company culture. Free drinks, etc. Don't fight people when they try to take their promised vacation time and pay like you say you are going to."}, {"title": "Great enthusiasm and direction", "text": "Pros Opportunity to personally develop in a fast growing company - exciting outlook for the company Immediate responsibility and flexibility of tasks Company leadership is passionate, supportive and structured Cons Processes are improving - no cons yet! Advice to Management Keep up the enthusiasm and hiring!", "rating": 5, "pros": "Opportunity to personally develop in a fast growing company - exciting outlook for the company", "cons": "Processes are improving - no cons yet!", "advice": "Keep up the enthusiasm and hiring!"}, {"title": "Not a great company", "text": "Pros Homebell offers food at their office and the environment is generally relaxed. Most people are friendly and made some good friends there. Room to pick up own projects. Cons Company direction changes every couple of weeks, there is a very overpowering German group at the top who say they believe in flat hierarchy (probably because that's part of the fun startup idea) but do not seem to realize how to put it in to practice. Very poor pay and hardly any benefits (training/self-development/etc.) that make the poor payment worthwile Advice to Management Change HR practices to focus more on employee retention, do not ask employees to write favorable reviews on websites like Glassdoor to improve online presence, engage more with the people in the company.", "rating": 3, "pros": "Homebell offers food at their office and the environment is generally relaxed. Most people are friendly and made some good friends there. Room to pick up own projects.", "cons": "Company direction changes every couple of weeks, there is a very overpowering German group at the top who say they believe in flat hierarchy (probably because that's part of the fun startup idea) but do not seem to realize how to put it in to practice. Very poor pay and hardly any benefits (training/self-development/etc.) that make the poor payment worthwile", "advice": "Change HR practices to focus more on employee retention, do not ask employees to write favorable reviews on websites like Glassdoor to improve online presence, engage more with the people in the company."}, {"title": "Beware of The Wolf in Sheep disguise", "text": "Pros Good colleagues, Free breakfast, different projects Cons - Bosses want extra hours all the time for a low salary - People gets fire for being good at work after 3 months - Do not take seriously your contract because you will not stay more than 3 months - Extra work is not recognize and is consider useless because of change of objectives Advice to Management Stop hiring people with the promise of career path, you don't have a career path, you have rotation people, every 3 months people goes way (or fired) and new people enter, Stop pretending you are stable, better give freelance contracts and pay more. Do not give a free food or free parties just to gain 2 or 3 hours more per day to your employees, no one will stay a party when you have to do 3 hours more of work just for to drink two beers.", "rating": 1, "pros": "Good colleagues, Free breakfast, different projects", "cons": "- Bosses want extra hours all the time for a low salary", "advice": "Stop hiring people with the promise of career path, you don't have a career path, you have rotation people, every 3 months people goes way (or fired) and new people enter, Stop pretending you are stable, better give freelance contracts and pay more."}, {"title": "One of the best places to work", "text": "Pros - Supportive, hard working & talented peers - Great office with flexible timings. - Awesome place to grow personally and professionally. Management not only focuses on developing the product organically but also keeps in mind the personal growth of their employee's Cons - Cannot find any cons as of now. Advice to Management keep rocking :)", "rating": 5, "pros": "- Supportive, hard working & talented peers", "cons": "- Cannot find any cons as of now.", "advice": "keep rocking :)"}, {"title": "Best growing experience ever", "text": "Pros Experience that make me grow professionally and personally. Working in Homebell means working with the strongest people in the market and working with a potential unicorn startup. All company teams and the founders were simply amazing. Cons Office location (Tempelhof) and office too big (I like boiler room). Advice to Management Let's keeping pushing on the quality of the people.", "rating": 5, "pros": "Experience that make me grow professionally and personally. Working in Homebell means working with the strongest people in the market and working with a potential unicorn startup. All company teams and the founders were simply amazing.", "cons": "Office location (Tempelhof) and office too big (I like boiler room).", "advice": "Let's keeping pushing on the quality of the people."}, {"title": "Startup which I love working for!", "text": "Pros Startup which I love working for! Good work environment which allows you to set your own goals and take on a variety of roles and tasks. Team is international - You meet a lot of cool and nice people. ‘Get sh*t done’ attitude. Cons HQ location Quick staff rotation Few team events Advice to Management Invest in people management Better internal communication", "rating": 5, "pros": "Startup which I love working for! Good work environment which allows you to set your own goals and take on a variety of roles and tasks. Team is international - You meet a lot of cool and nice people. ‘Get sh*t done’ attitude.", "cons": "HQ location", "advice": "Invest in people management"}, {"title": "ambitious working atmosphere", "text": "Pros flat hierarchies projects through all management levels challenging and variating tasks every day working in a young and motivated team diversity of cultures and people coffee, snacks and dinner for free Office next to Templerhofer Harbour Cons location far from city center Advice to Management more decoration in the office", "rating": 5, "pros": "flat hierarchies", "cons": "location far from city center", "advice": "more decoration in the office"}, {"title": "A call center that thinks of being a Tech Company", "text": "Pros - Nice and outgoing collegues - Some smart people inside but overqualified for the task they actually need to accomplish Cons - Lack of communication among departments and among collegues from the same department as well - Low morale after the lay-off of around 40 people at the end of June - There is no clear leadership, the heads of the deparments are left to do whatever they want - One founder thinks is the new Jordan Belfort, stating slogans such as \" let´s make some money\" and \" this is the greatest company in the world\". He barely knows what his employees are doing but tells them how to behave. - There are no values in the company, probably the most common one is to squeeze both customers and clients Advice to Management - Having a strong and clearminded Managing director could help the company", "rating": 3, "pros": "- Nice and outgoing collegues", "cons": "- Lack of communication among departments and among collegues from the same department as well", "advice": "- Having a strong and clearminded Managing director could help the company"}, {"title": "Dreadful company, using all fake reviews from 'current employees' to get people to work for them", "text": "Pros Very difficult to make some professional points for a company that ceases to act professionally. Just making up fake reviews from what was a very difficult few months working there, as the saying goes what goes around comes around. Cons Be very careful before thinking of working at this company, obviously there is a reason the company has only 1 star review for working with them its because they have 1 star quality when it comes to treating their employees and the work that they do. The Directors are only thinking about their wallets first. Its also extremley irritating to find so many 'current employees' saying how great the company is when after working there for 4 months I had no joy only alot of pain during my daily shifts, was never paid any bonus after I got it twice, I was also underpaid on 3 occasions as well as not being paid on time even 3 weeks after the day we were meant to be getting paid. This tells me that there is a problem with financing, they fired 40 people end of June, told us it was becuase of 'Brexit' although actually it turned out the owners were playing with the finance figures and so that when the investors found out they pulled out too. It makes sense considering 1 month you make 1 million euros and then the next getting rid of half the team. Again what goes around comes around. Advice to Management Advice would be to stop actually running a business as they do not know how to, only maybe they should they listen more to their employees and actually not tell them they will get promotions and cry like babies when your firing us all. I dont think they have a right to run a business, just goes to show any one can be a 'director' or 'CEO' these days, only those who put in the time energy and effort will be the ones who shine through. I think that they should try another product as obviously this one does not work well for them.", "rating": 1, "pros": "Very difficult to make some professional points for a company that ceases to act professionally. Just making up fake reviews from what was a very difficult few months working there, as the saying goes what goes around comes around.", "cons": "Be very careful before thinking of working at this company, obviously there is a reason the company has only 1 star review for working with them its because they have 1 star quality when it comes to treating their employees and the work that they do. The Directors are only thinking about their wallets first. Its also extremley irritating to find so many 'current employees' saying how great the company is when after working there for 4 months I had no joy only alot of pain during my daily shifts, was never paid any bonus after I got it twice, I was also underpaid on 3 occasions as well as not being paid on time even 3 weeks after the day we were meant to be getting paid. This tells me that there is a problem with financing, they fired 40 people end of June, told us it was becuase of 'Brexit' although actually it turned out the owners were playing with the finance figures and so that when the investors found out they pulled out too. It makes sense considering 1 month you make 1 million euros and then the next getting rid of half the team. Again what goes around comes around.", "advice": "Advice would be to stop actually running a business as they do not know how to, only maybe they should they listen more to their employees and actually not tell them they will get promotions and cry like babies when your firing us all. I dont think they have a right to run a business, just goes to show any one can be a 'director' or 'CEO' these days, only those who put in the time energy and effort will be the ones who shine through. I think that they should try another product as obviously this one does not work well for them."}, {"title": "Negative experience all around", "text": "Pros Fine business idea, some smart & driven people around, Cons I don't even know where to start. A - The working hours in your contract don't represent what's being expected of you - if your contract states 40h the correct translation is 60h, even if your salary is low. A lot of pressure is being built up by management to work hard (fair enough) but also work late & come in on weekends. Felt like it’s being done for the sake of showing “who’s the boss”, not because it’s particularly necessary. Ideally (for them) you’d get a minimum salary, sleep in the office & deliver like a machine. B – Surely performance is important in this company, however, guidance is rare and unexplained expectations are high. Deliver “correctly” or you are in trouble. As said above, if you don’t take breaks & make one sale after the next, you’re their guy! C – They like to hype things up, lots of clapping & wohoos, doesn’t mean all is well, but if you can’t create momentum from the inside out, you’ll try it that way. Advice to Management Don't take on the world too quickly, you'll shoot yourself in the foot since your processes don't properly work yet. You're fooling a) your customers and b) your employees who have to carry the can for your blind ambition. The fact that you don't seem to care about your own people is concerning & won't be sustainable (which surely you know). Nevertheless, I hope you (especially the founders & senior management) understand that the potential prospect of big money in your own pockets never justifies a condescending attitude towards anyone working for your idea. Instead, lead well, know how it’s done & show how it’s done!", "rating": 1, "pros": "Fine business idea, some smart & driven people around,", "cons": "I don't even know where to start. A - The working hours in your contract don't represent what's being expected of you - if your contract states 40h the correct translation is 60h, even if your salary is low. A lot of pressure is being built up by management to work hard (fair enough) but also work late & come in on weekends. Felt like it’s being done for the sake of showing “who’s the boss”, not because it’s particularly necessary. Ideally (for them) you’d get a minimum salary, sleep in the office & deliver like a machine. B – Surely performance is important in this company, however, guidance is rare and unexplained expectations are high. Deliver “correctly” or you are in trouble. As said above, if you don’t take breaks & make one sale after the next, you’re their guy! C – They like to hype things up, lots of clapping & wohoos, doesn’t mean all is well, but if you can’t create momentum from the inside out, you’ll try it that way.", "advice": "Don't take on the world too quickly, you'll shoot yourself in the foot since your processes don't properly work yet. You're fooling a) your customers and b) your employees who have to carry the can for your blind ambition. The fact that you don't seem to care about your own people is concerning & won't be sustainable (which surely you know). Nevertheless, I hope you (especially the founders & senior management) understand that the potential prospect of big money in your own pockets never justifies a condescending attitude towards anyone working for your idea. Instead, lead well, know how it’s done & show how it’s done!"}, {"title": "They really need to learn how better treat people and the business", "text": "Pros I find it hard to think of any, there was some good people that have been really hard struck by their working ethics. There were some really nice people working at the company but is all about the only positive I could consider. Cons Where do I start..... There was over 150 people inside a 200m2, its very difficult to imagine the kind of oxygen levels in the summer heat in an office like this office, hygiene standards are unadhered too. There was very little options for water and other drinks and all were given was red bull and sweets to keep us going. If your contract states 40 hours then we should be able to do just 40 hours without the pressure of being made to stay upto 60 hours a week including weekends. Maybe if this is German culture then I dont understand how people enjoy their lives outside of the office. This was my first job in Berlin and has really shocked me to think that this is how people work in Germany. We were told that the company made alot of money in May in 1 huge meeting with all the employees in a room the size no bigger than a bedroom thats over 100 people crammed, they moved to a new office and was only 1 week after that at the end of June they fired 5 teams of us thats something like 40 people, blaming it on Brexit telling us all that we had to go for that. It makes no sense, did they invest that much money in the UK market??? What about the Spanish, the Italian and French, these have nothing to do with the Brexit and good markets, better were the Italian and Spanish market made alot of money, and I think the French and UK too. No real processes in place a kind of anything goes and if it works lets do it, this is a terrible way to run a business. They also said to alot of people they would get more pay, I dont ever remember my bonus being paid, I got it 3 times and always was something that got in the way which mean I did not get paid anything like they said and in the contract too. I can only wish them good luck with this business, they have a nice idea but it is thought in the wrong way. Not enough department and help for people who need it even with basic things like pay rolled or Human Resource. Even for selling the product there is no price and always we have to upsell upsell upsell, calling a customer back to say you need more money is not so easy when you did not know the price in the original way only to guess what is the price. Advice to Management Company grow too quickly, better that you keep it simple like now with 2 team DACH and Holland, easier too manage. I think they all need to better work with employee or have real department and customer care, becuase everything is a mess before the Brexit. Also if you put in a contract you get this much explain it how much you really get becuase alot of people work with the belef that they will get more and you did not pay them bonuses. So please be good to your employee, karma always come back to bite you.", "rating": 1, "pros": "I find it hard to think of any, there was some good people that have been really hard struck by their working ethics. There were some really nice people working at the company but is all about the only positive I could consider.", "cons": "Where do I start.....", "advice": "Company grow too quickly, better that you keep it simple like now with 2 team DACH and Holland, easier too manage. I think they all need to better work with employee or have real department and customer care, becuase everything is a mess before the Brexit. Also if you put in a contract you get this much explain it how much you really get becuase alot of people work with the belef that they will get more and you did not pay them bonuses. So please be good to your employee, karma always come back to bite you."}, {"title": "Faster than an Augenblick", "text": "Pros I am really struggling to find something positive about this useless start-up: well, definitely the overqualified and nice colleagues Cons Got fired because the Investors were not feeling safe enough to keep investing in Team Italy (even if it was number 1 in terms of revenue and numbers of deals / amazing successfully team compared to the overcrowded Team Germany. The Investors blamed \"Brexit\" even if \"Brexit\" will happen in 2 years time from now. Advice to Management The day they closed three whole teams down, one of the CEO was crying bitter tears. \"Heul´ leise, Chantal!\"", "rating": 1, "pros": "I am really struggling to find something positive about this useless start-up: well, definitely the overqualified and nice colleagues", "cons": "Got fired because the Investors were not feeling safe enough to keep investing in Team Italy (even if it was number 1 in terms of revenue and numbers of deals / amazing successfully team compared to the overcrowded Team Germany. The Investors blamed \"Brexit\" even if \"Brexit\" will happen in 2 years time from now.", "advice": "The day they closed three whole teams down, one of the CEO was crying bitter tears. \"Heul´ leise, Chantal!\""}, {"title": "Stressiges und untypisches \"Startup", "text": "Pros - barrierefrei dank Fahrstuhl - freundliche Kollegen - gratis Essen abends Cons - Keine flachen Hierarchien - Keine Transparenz intern - Keine abteilungsübergreifende Kommunikation - Kein gutes Gehalt - Stressige Arbeitsatmosphäre mit viel Druck von allen Seiten und wenig Freiheiten - Lautes und chaotisches Büro - Wenig persönliches Potential, relative stumpfe Agentarbeit im Ops und Sales - Wenig Entwicklung, nach einem Monat hast du ausgelernt Advice to Management Kommunikation, Transparenz, etwas für die Zufriedenheit der Mitarbeiter tun, flachere Hierarchien usw. usw", "rating": 1, "pros": "- barrierefrei dank Fahrstuhl", "cons": "- Keine flachen Hierarchien", "advice": "Kommunikation, Transparenz, etwas für die Zufriedenheit der Mitarbeiter tun, flachere Hierarchien usw. usw"}, {"title": "Fairer Arbeitgeber mit guter Teamatmosphäre", "text": "Pros Spannendes Arbeitsumfeld und verantwortungsvolle Aufgaben, kollegiale Atmosphäre, kompetente und erfahrene Abteilungsleiter Cons Keine gratis Mandelmilch in der Kaffeeküche zum gratis Kaffee", "rating": 5, "pros": "Spannendes Arbeitsumfeld und verantwortungsvolle Aufgaben, kollegiale Atmosphäre, kompetente und erfahrene Abteilungsleiter", "cons": "Keine gratis Mandelmilch in der Kaffeeküche zum gratis Kaffee", "advice": null}, {"title": "Business Development Manager", "text": "Pros - Möglichkeit, etwas Großes und Bleibendes zu schaffen - Steile Lernkurve durch spannende Projekte - Möglichkeit, im Unternehmen noch selbst viel zu verändern Cons - Relativ hohe Mitarbeiterfluktuation - Gehalt nicht auf Beraterniveau", "rating": 5, "pros": "- Möglichkeit, etwas Großes und Bleibendes zu schaffen", "cons": "- Relativ hohe Mitarbeiterfluktuation", "advice": null}, {"title": "Spannendes Start-Up in Berlin", "text": "Pros Bei Homebell arbeitet man mit tollen Kollegen an einem spannenden Produkt. Die Aufgaben sind sehr abwechslungsreich, man bekommt viel Verantwortung und die Lernkurve ist sehr hoch. Es herschen flache Hierarchien und eine produktive hands-on-Mentalität. Cons Das Büro könnte etwas zentraler liegen Advice to Management Weiter so", "rating": 5, "pros": "Bei Homebell arbeitet man mit tollen Kollegen an einem spannenden Produkt. Die Aufgaben sind sehr abwechslungsreich, man bekommt viel Verantwortung und die Lernkurve ist sehr hoch. Es herschen flache Hierarchien und eine produktive hands-on-Mentalität.", "cons": "Das Büro könnte etwas zentraler liegen", "advice": "Weiter so"}, {"title": "Spannendes Start-Up mit echtem Zusammenhalt", "text": "Pros - Spannende Aufgaben - Cooles Team - Klasse Kollegen - Aufstiegschancen & Verantwortung - Offene Kommunikation zu Zielen und dem Stand des Unternehmens Cons - Lage des Büros knapp außerhalb des Rings", "rating": 5, "pros": "- Spannende Aufgaben", "cons": "- Lage des Büros knapp außerhalb des Rings", "advice": null}, {"title": "Starting up but never running", "text": "Pros + Looks & sounds promising + Great concept + Possibility to get promoted fast + Great team members Cons - Unhealthy working atmosphere (Pressure, expected long unpaid hours, unreachable targets) - No company transparancy - Horrible management (No people knowledge, only focus on numbers) Advice to Management Getting people in is easy, making them stay is hard. Focus on keeping employees happy, the work enviroment healthy & building teams. Listen to your employees and create a space they enjoy working.", "rating": 3, "pros": "+ Looks & sounds promising", "cons": "- Unhealthy working atmosphere (Pressure, expected long unpaid hours, unreachable targets)", "advice": "Getting people in is easy, making them stay is hard. Focus on keeping employees happy, the work enviroment healthy & building teams. Listen to your employees and create a space they enjoy working."}, {"title": "Sehr zufrieden", "text": "Pros flache Hierarchien, steile Lernkurve, Verantwortung von Tag eins Cons Sitz in Tempelhof und dadurch leider einen langen Anfahrtsweg", "rating": 5, "pros": "flache Hierarchien, steile Lernkurve, Verantwortung von Tag eins", "cons": "Sitz in Tempelhof und dadurch leider einen langen Anfahrtsweg", "advice": null}, {"title": "Guter Einblick in ein Start-Up mit Zukunftspotential", "text": "Pros Junges und nettes Team, flexible Arbeitszeiten, flache Hierarchien, gute Verdienstmöglichkeiten, interessanter Einblick in die Welt der Start-Ups Cons Leider nicht geeignet für Abschlussarbeiten, man bekommt jedoch Unterstützung", "rating": 5, "pros": "Junges und nettes Team, flexible Arbeitszeiten, flache Hierarchien, gute Verdienstmöglichkeiten, interessanter Einblick in die Welt der Start-Ups", "cons": "Leider nicht geeignet für Abschlussarbeiten, man bekommt jedoch Unterstützung", "advice": null}, {"title": "Allgemeine Arbeitsbewertung", "text": "Pros Ein sehr junges Team, welches sich gegenseitig jederzeit hilft. Gewährt Einblick in die Entwicklung eines Startup-Unternehmens. Cons Gehalt ist relativ gering; schwer zu erreichende Provision.", "rating": 5, "pros": "Ein sehr junges Team, welches sich gegenseitig jederzeit hilft.", "cons": "Gehalt ist relativ gering; schwer zu erreichende Provision.", "advice": null}, {"title": "Besten Arbeitskollegen", "text": "Pros - äußerst gutes Team Klima - es wird zusammengehalten und gegenseitig motiviert - hohe Verantwortung von Tag 1 - man arbeitet mit verschiedenen Bereichen des öfteren zusammen und lernt viel dabei - flache Hierarchie, man kann jederzeit die Gründer ansprechen bzw. Teamleiter haben immer ein offenes Ohr für Veränderung - kostenlos Frühstücken(Müsli) und Abendbrot(warm) möglich Cons - es gibt im Bereich Partner Management keine Provisionen Advice to Management - bitte Provisionen als turbo Motivator einführen", "rating": 5, "pros": "- äußerst gutes Team Klima", "cons": "- es gibt im Bereich Partner Management keine Provisionen", "advice": "- bitte Provisionen als turbo Motivator einführen"}, {"title": "Interessantes Arbeitsumfeld", "text": "Pros gute Atmosphäre, junges Team, innovatives Tätigkeitsfeld Cons Startupmarkt, wie szenetypisch üblich, geringes Grundgehalt Advice to Management Die Grundgehälter sollten höher ausfallen", "rating": 5, "pros": "gute Atmosphäre, junges Team, innovatives Tätigkeitsfeld", "cons": "Startupmarkt, wie szenetypisch üblich, geringes Grundgehalt", "advice": "Die Grundgehälter sollten höher ausfallen"}, {"title": "Einblick in die Welt der Handwerker", "text": "Pros - junges dynamisches Team - auch ältere Mitarbeiter werden gut aufgenommen (+45J) - hohe Eigenintiative --> Entscheidungsgewalt - eigene Kritik wird gefordert und versucht im Rahmen schnell umzusetzen - es wird versucht alle Mitarbeiter über alle Bereiche zu informieren (Morning-Huddle) - Cons - Überstunden sind erwünscht - Advice to Management - Fokussierung auf verschiedene Bereiche --> unstetiges Wachstum in den Bereichen", "rating": 5, "pros": "- junges dynamisches Team", "cons": "- Überstunden sind erwünscht", "advice": "- Fokussierung auf verschiedene Bereiche --> unstetiges Wachstum in den Bereichen"}, {"title": "Steile Lernkurve!", "text": "Pros - flache Hierarchien, diesmal aber wirklich - Engagement wird geschätzt und auch gesehen - Persönliche Stärken werden erkannt und gefordert - Benefits und \"beer friday\" Cons Leider gibt es keine, so wie bei manch anderen Berliner Startups, keine Club Mate Flatrate. Überstunden sind natürlich gang und gebe und werden auch erwartet, in Betracht auf die Unternehmensphase ist das aber verständlich Advice to Management Keep rocking!", "rating": 5, "pros": "- flache Hierarchien, diesmal aber wirklich", "cons": "Leider gibt es keine, so wie bei manch anderen Berliner Startups, keine Club Mate Flatrate.", "advice": "Keep rocking!"}, {"title": "Weiter zu empfehlen", "text": "Pros - es herrschen flache Hierachien - Engagement wird geschätzt und auch belohnt - Karrieremöglichkeiten und Aufstiegschancen sind gegeben - nettes und internationales Team - Beneftis Cons Da es ein Startup ist, sind Überstunden und nicht vorhandene Prozesse noch ein Thema - dies kann gleichzeitig aber auch als Chance bzw. Vorteil gesehen werden Advice to Management Momentan gibt es da nicht viel zu kritisieren oder zu raten. Durch die flachen Hierarchien werden viele Leute in Entscheidungsfindungen mit einbezogen und können so für die Strukturierung des Unternehmens mit Verantwortung tragen.", "rating": 5, "pros": "- es herrschen flache Hierachien", "cons": "Da es ein Startup ist, sind Überstunden und nicht vorhandene Prozesse noch ein Thema - dies kann gleichzeitig aber auch als Chance bzw. Vorteil gesehen werden", "advice": "Momentan gibt es da nicht viel zu kritisieren oder zu raten. Durch die flachen Hierarchien werden viele Leute in Entscheidungsfindungen mit einbezogen und können so für die Strukturierung des Unternehmens mit Verantwortung tragen."}, {"title": "Homebell", "text": "Pros flache Hierachien, schön mitzuerleben wie ein junges Startup wächst Cons viel viel Überstunden wenn etwas los ist und verhältnismäßig wenig Geld. Manche Dinge lassen einen gelegentlich wundern.", "rating": 3, "pros": "flache Hierachien, schön mitzuerleben wie ein junges Startup wächst", "cons": "viel viel Überstunden wenn etwas los ist und verhältnismäßig wenig Geld. Manche Dinge lassen einen gelegentlich wundern.", "advice": null}, {"title": "Viel gelernt und ein tolles Team mit dem sich etwas erreichen lässt", "text": "Pros Super Arbeitsklima, sichere Bezahlung mit Umsatzbeteiligung bei guter Leistung, flache Hierarchiene, viele Lernmöglichkeiten wie ein Start Up funktioniert und wächst, tolle Kommunikation zwischen Kollegen und Teams innerhalb eines Prozesses. Cons Manchmal überstunden, aber wenns Spaß macht und noch ein Abendessen spendiert wird kein Problem und dafür immer auch ein guter Ausgleich. Advice to Management Weiter so!", "rating": 5, "pros": "Super Arbeitsklima, sichere Bezahlung mit Umsatzbeteiligung bei guter Leistung, flache Hierarchiene, viele Lernmöglichkeiten wie ein Start Up funktioniert und wächst, tolle Kommunikation zwischen Kollegen und Teams innerhalb eines Prozesses.", "cons": "Manchmal überstunden, aber wenns Spaß macht und noch ein Abendessen spendiert wird kein Problem und dafür immer auch ein guter Ausgleich.", "advice": "Weiter so!"}, {"title": "Incredibly dynamic and inspirational ork environment with great product and awesome people", "text": "Pros - incredibly enthusiastic, young, dynamic and international team - Inspiring and supportive management personell - mature and refined product with huge untaped market and great growth potential - fast lines of communication, which enable speed - supportive and uplifting work environment Cons Sometimes free muesli is empty for a couple of days and team-lasertag is only once a moth Advice to Management Keep inspiring and supporting your staff and keep on building a great company", "rating": 5, "pros": "- incredibly enthusiastic, young, dynamic and international team", "cons": "Sometimes free muesli is empty for a couple of days and team-lasertag is only once a moth", "advice": "Keep inspiring and supporting your staff and keep on building a great company"}]