[{"title": "A cliquish environment of amateurs", "text": "Pros A spacious office but even that is in the boondocks. Cons Everything else, best steer clear.", "rating": 1, "pros": "A spacious office but even that is in the boondocks.", "cons": "Everything else, best steer clear.", "advice": null}, {"title": "Growing company but ...", "text": "Pros Great coworkers, great business model, great tasks, great team spirit. In general it's a fast moving and growing company with young dynamic employees. Cons Unprofessional HR structure/incompetent HR department, top down decisions. Some decisions are made randomly by one MD and are rather unreasonable. Advice to Management More one to one communication since the team lead meeting is useless just like the HR department", "rating": 3, "pros": "Great coworkers, great business model, great tasks, great team spirit.", "cons": "Unprofessional HR structure/incompetent HR department, top down decisions. Some decisions are made randomly by one MD and are rather unreasonable.", "advice": "More one to one communication since the team lead meeting is useless just like the HR department"}, {"title": "Good team, wrong management", "text": "Pros The team! Young, dynamic, smart and brilliant team. And company is growing! Cons Management is far away from reality. Sets unrealistic targets. No room for creative work. The only opinion which counts is the CEO's. CEO is a micro manager, doesn't trust in capabilities of employees and needs to check everything. Flat hierarchies but every workflow, task or project is slowed down since every little details needs to be approved by the CEO. Decisions are not made organically but by the CEO only without discussion with the team before. Advice to Management Trust your employees, leave room for ideas, creative work and DELEGATE tasks and let people do their job. Stop micro managing.", "rating": 3, "pros": "The team! Young, dynamic, smart and brilliant team. And company is growing!", "cons": "Management is far away from reality. Sets unrealistic targets. No room for creative work. The only opinion which counts is the CEO's. CEO is a micro manager, doesn't trust in capabilities of employees and needs to check everything. Flat hierarchies but every workflow, task or project is slowed down since every little details needs to be approved by the CEO. Decisions are not made organically but by the CEO only without discussion with the team before.", "advice": "Trust your employees, leave room for ideas, creative work and DELEGATE tasks and let people do their job. Stop micro managing."}]