[{"title": "Visual Designer", "text": "Pros Great coworkers, clients and culture. Cons Its so big its easy for people and projects to get lost in the infrastructure.", "rating": 5, "pros": "Great coworkers, clients and culture.", "cons": "Its so big its easy for people and projects to get lost in the infrastructure.", "advice": null}, {"title": "Bad as in bad, not good.", "text": "Pros Huge has managed to attract and hire many highly skilled / talented people in all areas of design and strategy. The level of fit and finish is much higher than other places I have worked, especially on the visual design side of things. People are always willing to give 110% to make things happen as best they can. Finally, you'd be hard pressed to find someone there who will tell you 'No' to a big idea. Huge taught me the value of having a vision (without reality or substance, unfortunately). It's a good place to do a bunch of flashy, shallow work for big brands for a couple of years to boost your portfolio and resume. The benefits are pretty good, including time off policy. The salary wasn't bad either. Brooklyn office is ok but fairly generic. If you have a chance to visit, take note of the fake 'smart office' iPads they have on all of the conference rooms. It really sums Huge up. You can't do anything on them (book a room, checkin, etc.) and some poor person in IT has to go around and change their battery packs every day because they're not hard wired to power. Though that didn't stop the company from including a photo and 'smart office' capability in their presentation decks. Cons Oh man, where to begin. This place is a complete mess, as is prescribed from the top down in their self proclaimed 'culture of chaos'. There's not a single thing that happens that seems to make sense or considers the best interest of the client or the people doing the work 'on the ground'. To be clear, it's not a creative company. There's not a single creative person in an executive level position. They're all former client services people. The couple of people who were in creative executive roles (including CCO) were unceremoniously fired last year, then never replaced (common occurrence at Huge). There are a couple of low-level, puppet creative execs with good intentions, but they're essentially ineffective. Top management is toxic, ultra cliquey and honestly don't seem to have a clue of what they're doing...all constantly over reacting to the whims of the CEO. Speaking of which, this isn't a guy you want to ever have to work with. Something is seriously off with him. Additionally, everyone treats him like a genius. He spouts typical industry headlines like 'AI is the future! at company meetings and everyone acts like he's a prophet. Finally, as with many agencies...it's all about the pitch and win. If you're not pitching you're dead. The company doesn't know what to do with a client / project once they actually win it. Talent that's 100% allocated to paid client work are constantly pulled off to work on new pitches, regardless of the impact to that project. Advice to Management There's no advice that will draw empathy or creativity from a group of inexperienced, crazed wanna be wheelers and dealers.", "rating": 3, "pros": "Huge has managed to attract and hire many highly skilled / talented people in all areas of design and strategy. The level of fit and finish is much higher than other places I have worked, especially on the visual design side of things. People are always willing to give 110% to make things happen as best they can. Finally, you'd be hard pressed to find someone there who will tell you 'No' to a big idea. Huge taught me the value of having a vision (without reality or substance, unfortunately). It's a good place to do a bunch of flashy, shallow work for big brands for a couple of years to boost your portfolio and resume. The benefits are pretty good, including time off policy. The salary wasn't bad either. Brooklyn office is ok but fairly generic. If you have a chance to visit, take note of the fake 'smart office' iPads they have on all of the conference rooms. It really sums Huge up. You can't do anything on them (book a room, checkin, etc.) and some poor person in IT has to go around and change their battery packs every day because they're not hard wired to power. Though that didn't stop the company from including a photo and 'smart office' capability in their presentation decks.", "cons": "Oh man, where to begin. This place is a complete mess, as is prescribed from the top down in their self proclaimed 'culture of chaos'. There's not a single thing that happens that seems to make sense or considers the best interest of the client or the people doing the work 'on the ground'.", "advice": "There's no advice that will draw empathy or creativity from a group of inexperienced, crazed wanna be wheelers and dealers."}, {"title": "If considering just say no", "text": "Pros Huge attracts high level talent for the most part. Most of that talent is junior to mid level and these people tend to be awesome (because they are new to the company) There are a few exceptionally talented individuals (HOWEVER most left to work with former clients, were unceremoniously fired, or are walking around dumbo on extended breaks questioning their lives). Flashy work and big name clients for your portfolio (junior designers) Developers, Visual Designers, and Product Design/Management are strong for the most part (though crunched to utter exhaustion) Great place to meet people on their way to their next big gig. If you are interested in coasting, staying under the radar, collecting a check occasionally working with people you admire but on marketing sites this is the place for you. Pay and work/life balance was generally good (but have a feeling this is all about to change to attract cheaper labor as a result of recent layoffs) The people who clean (after everyone) and work in operations (front desk etc) are the best people you will find! Cons Senior (business) leadership is clueless and will blatantly lie about the \"success\" of the company and then lay people off weeks before major holidays. Departmental leadership is either absent or trying their best to assert really poor strategy without listening to the expertise of fellow teammates. Politics are strong and of the high school nature to the point where you best chance of survival is to shut up and just say YES to everything (to the detriment of the product and your value system) Projects and work is run on a client services model that keeps designers and strategist in a box far from any place of major product decisions All in all a rather toxic environment for anyone looking to produce actual quality work Advice to Management Your business is crumbling and your talent is leaving... Figure out what you want to be - consulting w/ top level \"leaders, marketing production partners, or a product firm and be honest and transparent about your actual goals. Maybe stop assuring people there will be no more layoffs and then following it up two weeks later with layoffs.", "rating": 3, "pros": "Huge attracts high level talent for the most part. Most of that talent is junior to mid level and these people tend to be awesome (because they are new to the company)", "cons": "Senior (business) leadership is clueless and will blatantly lie about the \"success\" of the company and then lay people off weeks before major holidays.", "advice": "Your business is crumbling and your talent is leaving... Figure out what you want to be - consulting w/ top level \"leaders, marketing production partners, or a product firm and be honest and transparent about your actual goals."}, {"title": "Art Director", "text": "Pros Fun people, a lot of sport clubs and the perks of a big company. Cons Boring projects, unorganized teams, Advice to Management Bring back creativity at the center of the company, feels like money has taken its place.", "rating": 3, "pros": "Fun people, a lot of sport clubs and the perks of a big company.", "cons": "Boring projects, unorganized teams,", "advice": "Bring back creativity at the center of the company, feels like money has taken its place."}, {"title": "3 Rounds of Layoffs", "text": "Pros diverse client base great stepping stone before a Facebook, Bloomberg, Foursquare Cons best talent has left sales and middle management oriented agency Advice to Management Execs went through three rounds of layoffs in 2 months. The first round targeted more junior talent. The 2nd and 3rd round went after whole offices and senior level talent not directly tied to the sales wing. At the end of the day, they ran out of money. The sales wing didn't win enough work to keep their best talent. The decision is probably short sighted, basically burning long term bridges to produce a temporary stop gap for declining finances. If you look at the work renewed for the whole year, it's probably 40% renewals (3 mon. or longer) and 60% new biz. The overhead on new biz is your entire decision making wing. Renewals is like 2 gal/guys and 10% time from a PM. TL:DR Huge is just like every other agency now. Come work here as a junior level *blank* and consider the first offer you get from a former client seriously Avoid like the plague if you are hyper talented. Salary is competitive but employment is based on work not yet won. Current business strategy is to replace former talent with lower salaries. Good chance if you are reading this you fit in the 1 - 3 year experience category.", "rating": 3, "pros": "diverse client base", "cons": "best talent has left", "advice": "Execs went through three rounds of layoffs in 2 months. The first round targeted more junior talent. The 2nd and 3rd round went after whole offices and senior level talent not directly tied to the sales wing. At the end of the day, they ran out of money. The sales wing didn't win enough work to keep their best talent. The decision is probably short sighted, basically burning long term bridges to produce a temporary stop gap for declining finances. If you look at the work renewed for the whole year, it's probably 40% renewals (3 mon. or longer) and 60% new biz. The overhead on new biz is your entire decision making wing. Renewals is like 2 gal/guys and 10% time from a PM."}, {"title": "A revolving door of amazing but underutilized talent", "text": "Pros You’ll encounter some of the most interesting and talented individuals across design, UX, product, and technology. Around people like this, you’ll learn more in 3 months than you would in 3 years elsewhere — that’s IF you or the people around you last that long. Cons On the job, always be prepared for long hours. This is not a family-friendly environment. Projects can be really hit or miss. Resourcing teams are terrible at matching talent to clients/projects, seeming to be blind to any combo of past experience, aspirations, or client fit. Finally, always be alert for individuals who have been in agency world for too long. While some are genuinely driven and hard-working, others are adept at sabotaging projects by doing as little work as possible as passing blame to others. Best come with a steel plate on your back. Leadership here most definitely lacks transparency and honesty, and is perhaps borderline incompetent. There are frequent reassurances that company is doing well and staffing is just right, but don’t be fooled. Layoffs are frequent, seemingly random, and without warning. While weak performers should be concerned, they’re few and far between and I’ve seen many exceptional performers get the boot. There’s a tough interview process here resulting in amazing talent (that’s you) but you’ll need to ask yourself: Is it worth the investment if there’s a very good chance you’ll be dismissed inside of 6 months regardless of personal performance? It’s very real here. Buyer beware. Advice to Management No such thing as bad followers, only bad leaders. Look no further than your bathroom mirror in the morning for the answer to your cash concerns. If you have to tell yourself that this is agency life each time you make a new round of layoffs, you've already given up on your amazing talent, the amazing heights they can achieve, and yourself.", "rating": 3, "pros": "You’ll encounter some of the most interesting and talented individuals across design, UX, product, and technology. Around people like this, you’ll learn more in 3 months than you would in 3 years elsewhere — that’s IF you or the people around you last that long.", "cons": "On the job, always be prepared for long hours. This is not a family-friendly environment. Projects can be really hit or miss. Resourcing teams are terrible at matching talent to clients/projects, seeming to be blind to any combo of past experience, aspirations, or client fit. Finally, always be alert for individuals who have been in agency world for too long. While some are genuinely driven and hard-working, others are adept at sabotaging projects by doing as little work as possible as passing blame to others. Best come with a steel plate on your back.", "advice": "No such thing as bad followers, only bad leaders. Look no further than your bathroom mirror in the morning for the answer to your cash concerns. If you have to tell yourself that this is agency life each time you make a new round of layoffs, you've already given up on your amazing talent, the amazing heights they can achieve, and yourself."}, {"title": "Top Heavy", "text": "Pros My immediate team we're some of the best I've ever had. Dogs..dogs..dogs. Location is great - facilities are nice. Cons Top heavy - too many creative directors. Advice to Management Get over yourselves.", "rating": 3, "pros": "My immediate team we're some of the best I've ever had.", "cons": "Top heavy - too many creative directors.", "advice": "Get over yourselves."}, {"title": "You won't do anything here. You'll just make decks.", "text": "Pros Cool people. Treat their employees reasonably well (when they aren't laying them off, of course) Good work life balance, in our office at least. I hear Brooklyn is a different story. Cons No good work. If you are looking to create portfolio pieces and better yourself, look elsewhere. I've been here almost 2 years and I've only seen a couple pieces of good work actually launch. Most everyone here is working on decks, spec work, or pitching, or nothing. Your career will stall here. Advice to Management Figure it out, seriously. Your company is dying, and has developed a bad reputation amongst all of the talent in the area. You won't be able to bring good people in.", "rating": 3, "pros": "Cool people. Treat their employees reasonably well (when they aren't laying them off, of course) Good work life balance, in our office at least. I hear Brooklyn is a different story.", "cons": "No good work. If you are looking to create portfolio pieces and better yourself, look elsewhere. I've been here almost 2 years and I've only seen a couple pieces of good work actually launch. Most everyone here is working on decks, spec work, or pitching, or nothing. Your career will stall here.", "advice": "Figure it out, seriously. Your company is dying, and has developed a bad reputation amongst all of the talent in the area. You won't be able to bring good people in."}, {"title": "Like a family until they don't need you anymore.", "text": "Pros awesome amenities, super amazing talented people to work with, dogs everywhere, snacks galore. Cons No one cares after you get dropped due to company issues. There are no warnings to be made and will work you long late night projects before it happens. Advice to Management A warning would be great.", "rating": 5, "pros": "awesome amenities, super amazing talented people to work with, dogs everywhere, snacks galore.", "cons": "No one cares after you get dropped due to company issues. There are no warnings to be made and will work you long late night projects before it happens.", "advice": "A warning would be great."}, {"title": "Kinda fun while it lasted", "text": "Pros Great pay and perks Lots of holiday time off Dog-friendly Great branding Cons Quite a few people in leadership lack maturity, need managerial training Cliques galore, high school mentality Stunning lack of diversity in an industry that generally lacks diversity Pretty cold and toxic environment Long hours for many The reorg left a lot of people scrambling to get out, a lot of long-time employees jumped ship Advice to Management Stop playing favorites to the \"stars\" of the company. Everybody is important to the success of the company! Grow up and stop trying to be the cool company with the cool work friends. Win some business by hiring people from all different backgrounds. You can't win by hiring the same people over and over again.", "rating": 3, "pros": "Great pay and perks", "cons": "Quite a few people in leadership lack maturity, need managerial training", "advice": "Stop playing favorites to the \"stars\" of the company. Everybody is important to the success of the company! Grow up and stop trying to be the cool company with the cool work friends. Win some business by hiring people from all different backgrounds. You can't win by hiring the same people over and over again."}, {"title": "Great Company", "text": "Pros Good culture, collaborative environment, extremely creative work Cons Long hours can be expected from certain roles", "rating": 5, "pros": "Good culture, collaborative environment, extremely creative work", "cons": "Long hours can be expected from certain roles", "advice": null}, {"title": "Designer", "text": "Pros Incredibly creative employees, focus on side hustles, decent work/life balance. Minors so that employees can master another skill on the company's dime, fellowships, hack-a-thons, hour-long classes nearly every day so we deepen our skills and learn about new technologies. Low level creatives feel just as heard as CDs. Great name, great new clients. Dogs. Brooklyn location is rejuvenating. Skews quite liberal (turned down an offer to redesign Trump's white house website. Twice). Cons Rough lay off process — for those fired and the teams left near-flailing. Could use more juniors and mid-levels to actually do the work. You'll work incredibly hard, but will have something to show for it half the time. Some leadership could do more mentoring. Be communicative and candid. We want constructive criticism, and to know when we're doing well. Someone work til 1am on a project you gave them at 7pm? Say thanks, and let the know how the meeting went. On the other hand, some leadership is incredible, will push you to work your hardest and gladly take on mentoring. I guess it's sink or swim, you've got to put yourself out there to reap the benefits. Advice to Management They're already working on it, but keep communication and being candid as a top priority.", "rating": 5, "pros": "Incredibly creative employees, focus on side hustles, decent work/life balance.", "cons": "Rough lay off process — for those fired and the teams left near-flailing.", "advice": "They're already working on it, but keep communication and being candid as a top priority."}, {"title": "Be careful... this is a revolving door huge company with no room for new ideas.", "text": "Pros Many of the people are very nice. The are a few perks, but less than other companies. There is penny pinching and red tape on every perk. Cons Here today, gone tomorrow. If you work in IT (seeing all hire and fire), it is astounding how fast even high level execs come and go. No warning - the company just shuts people off for no reason, and discriminates against illness or injury. It is all also very butt-kissing oriented to C-level. A team may have a work-stopping issue that is critical, but if an exec walks up with a question about his cell-phone you drop everything. Very poor practice. Expect to get laid off before you even get settled in, and expect management to blame you when they screw up a project. Expect silent discrimination and pressure to stay extra hours or work weekends. Advice to Management Wake up. You are losing great people that you don't even give a chance to. Be careful of discrimination against disabilities. Loosen up a bit so employees can actually enjoy supposed perks. Take responsibility in helping new employees to succeed in a giant (dirty) revolving door office. Allow opportunities for in-team mentoring and advancement.", "rating": 1, "pros": "Many of the people are very nice. The are a few perks, but less than other companies. There is penny pinching and red tape on every perk.", "cons": "Here today, gone tomorrow. If you work in IT (seeing all hire and fire), it is astounding how fast even high level execs come and go. No warning - the company just shuts people off for no reason, and discriminates against illness or injury. It is all also very butt-kissing oriented to C-level. A team may have a work-stopping issue that is critical, but if an exec walks up with a question about his cell-phone you drop everything. Very poor practice. Expect to get laid off before you even get settled in, and expect management to blame you when they screw up a project. Expect silent discrimination and pressure to stay extra hours or work weekends.", "advice": "Wake up. You are losing great people that you don't even give a chance to. Be careful of discrimination against disabilities. Loosen up a bit so employees can actually enjoy supposed perks. Take responsibility in helping new employees to succeed in a giant (dirty) revolving door office. Allow opportunities for in-team mentoring and advancement."}, {"title": "It's a family... until earnings are bad, then it's a business", "text": "Pros Coworkers are generally nice, very competent, interesting hipster people. Employees skew quite liberal. Review system and career advancement are pretty clear and fair. You even get to review your own manager at the end of the year. Great outside-of-the-job culture of different social clubs (funded by the company) and regular department- and company-wide events. There's a guy whose sole job is to find fun things for Hugers to do together. Good perks. Money off your monthly phone data plan, money off your gym expenses, free bagels on Tuesdays (in Brooklyn location), the usual ad world \"free dinner and car service after 8pm\" deal Work culture is one of eager experimentation/iteration. Management/HR regularly asks for feedback on what they can be doing better, and actually take experimental steps to improve. Huge had the best large agency onboarding experience I've undergone so far. Because of its gargantuan size, Huge tends to work with very large name brand clients, which is useful to impress non-designers o your personal website. Cons Everyone is nice, but not necessarily friendly, especially the longer they've been around. It took me a year to build informal relationships with the coworkers I hadn't gotten to work with. Large clients desire risk-averse and not very innovative work. Large clients with the money to afford Huge tend to be morally grey. E.g. we were pitching (and later won) a prominent company at the same time as it was getting flak in the media for being dicks. Small companies with interesting asks—and even some large brands with great prestige—can't afford to work with us. Literally love our pitch work but turn us down because they can't afford us. Layoff process is terrible. It comes with no warning, and you return to your computer after the meeting to find yourself locked out of your computer and get shooed out of the building asap so it's not \"awkward\" for your friends/ex-coworkers to have to see you. From the employee side of things, you will sometimes find out that friends in different departments have been let go just because you can't find them on Slack anymore. Advice to Management Balance boring bread-and-butter clients with poor-yet-interesting or pro bono/social good clients so that employees still feel stimulated.", "rating": 5, "pros": "Coworkers are generally nice, very competent, interesting hipster people. Employees skew quite liberal.", "cons": "Everyone is nice, but not necessarily friendly, especially the longer they've been around. It took me a year to build informal relationships with the coworkers I hadn't gotten to work with.", "advice": "Balance boring bread-and-butter clients with poor-yet-interesting or pro bono/social good clients so that employees still feel stimulated."}, {"title": "Think twice before accepting an offer", "text": "Pros People. Amazing designers. Huge School. Summer fridays. Cons Long hours, boring work, bad clients. They are transitioning from an experience design agency to an advertising one. Advice to Management Before hiring make sure the person knows what they are getting into. Stop hiring account managers from traditional advertising agencies. Continue investing on Huge School.", "rating": 1, "pros": "People. Amazing designers. Huge School. Summer fridays.", "cons": "Long hours, boring work, bad clients. They are transitioning from an experience design agency to an advertising one.", "advice": "Before hiring make sure the person knows what they are getting into."}, {"title": "If you get a job here, you probably shouldn't take it.", "text": "Pros Some of the smartest, most interesting, driven people you will ever encounter in your career. Office setup is really chill too. Couches everywhere. The day-to-day can be really fun, until you have that deadline to hit, of course. People are really good at keeping the energy up here. A good amount of vacation time, and a lot of extra days you can take around the year on top of it. Cons They just laid off a ton of people, even though every company meeting they only talk about how great we're doing and how much new biz we're close to getting. Very confusing. Besides that people come and go here so quick you can't even keep track. Especially high level people. If you're a senior creative or account manager you should probably have a Plan B ready for when you get shafted... and it will happen. Probably in about a year. The CEO and Prez talk nonstop about how the \"chaos\" or the \"constant change\" is what makes this place great, without noticing that they're the only ones who benefit from that garbage. Not the people whose projects and managers change every two seconds because they decided to take things in a different direction. Advice to Management Chill the eff out. Stop shuffling people around in the office like it's your own personal chess board. Figure out why there wasn't enough money for the people who just got let go but there is enough money to keep hiring and firing all these VPs and MDs or why every single meeting seems to have catered lunches or how you're paying for all the free swag you throw at us. Free stuff is nice but having my coworkers and teammates keep their jobs (that they're good at) is nicer.", "rating": 3, "pros": "Some of the smartest, most interesting, driven people you will ever encounter in your career. Office setup is really chill too. Couches everywhere. The day-to-day can be really fun, until you have that deadline to hit, of course. People are really good at keeping the energy up here. A good amount of vacation time, and a lot of extra days you can take around the year on top of it.", "cons": "They just laid off a ton of people, even though every company meeting they only talk about how great we're doing and how much new biz we're close to getting. Very confusing.", "advice": "Chill the eff out. Stop shuffling people around in the office like it's your own personal chess board. Figure out why there wasn't enough money for the people who just got let go but there is enough money to keep hiring and firing all these VPs and MDs or why every single meeting seems to have catered lunches or how you're paying for all the free swag you throw at us. Free stuff is nice but having my coworkers and teammates keep their jobs (that they're good at) is nicer."}, {"title": "Used to be fun", "text": "Pros Brooklyn location in Dumbo gives it a nice vibe. Cons Recent lay offs and uncertain future.", "rating": 3, "pros": "Brooklyn location in Dumbo gives it a nice vibe.", "cons": "Recent lay offs and uncertain future.", "advice": null}, {"title": "Senior Designer", "text": "Pros There are a lot of very talented people to learn from. Cons The size can be an issue.", "rating": 5, "pros": "There are a lot of very talented people to learn from.", "cons": "The size can be an issue.", "advice": null}, {"title": "Good Place Not for Everyone", "text": "Pros - Entrepreneurial attitude, lack of process could be overwhelming for some Cons - Lack of process and staffing causes unnecessary headaches", "rating": 5, "pros": "- Entrepreneurial attitude, lack of process could be overwhelming for some", "cons": "- Lack of process and staffing causes unnecessary headaches", "advice": null}, {"title": "Brilliant talent; great work.", "text": "Pros Strong individual and organizational values. Top-tier clients. Great work. Awesome location and office vibe. Cons Some growing pains as teams become larger and the company builds out a global capability. Advice to Management Build out a strong team of empowered leaders to support global capabilities. Value and develop management skills and provide managers with the time to invest in their teams.", "rating": 5, "pros": "Strong individual and organizational values. Top-tier clients. Great work. Awesome location and office vibe.", "cons": "Some growing pains as teams become larger and the company builds out a global capability.", "advice": "Build out a strong team of empowered leaders to support global capabilities. Value and develop management skills and provide managers with the time to invest in their teams."}, {"title": "Great people, muddled ideas.", "text": "Pros Amazing talent, wonderful teams and people. Cons A lack of consistent leadership means everyone is tossed about all the time. Advice to Management Figure out how to organize a large agency, which is what you are now.", "rating": 3, "pros": "Amazing talent, wonderful teams and people.", "cons": "A lack of consistent leadership means everyone is tossed about all the time.", "advice": "Figure out how to organize a large agency, which is what you are now."}, {"title": "Positive & Innovating", "text": "Pros The agency culture is so positive and unusual – people are collaborative and supportive of one another. Everyone is incredibly smart and best in class. Cons Like most agencies, work hours can be pretty long, and come and go in waves.", "rating": 5, "pros": "The agency culture is so positive and unusual – people are collaborative and supportive of one another. Everyone is incredibly smart and best in class.", "cons": "Like most agencies, work hours can be pretty long, and come and go in waves.", "advice": null}, {"title": "Huge Review", "text": "Pros The people make the culture. Good work and projects. There are always cool activities and food. Cons Projects can take over your life.", "rating": 3, "pros": "The people make the culture. Good work and projects. There are always cool activities and food.", "cons": "Projects can take over your life.", "advice": null}, {"title": "Iterating but not always for the better.", "text": "Pros - At the project level, there are a ton of smart, passionate people - The brand and culture are strong - There is a spirit of innovation - test and learn even if you fail - There is respect for employees with families - The office operations team is one of the best Cons - Leadership as a whole in NY is scattered and uninspiring - Tons of inconsistency with how good employees are acknowledged and rewarded - Internal politics are exhausting, making it sometimes hard to feel trust - Vision is vague and doesn't align with business goals and often times the type of work the agency is going after Advice to Management Practice the bold brand that you preach. Shun the politics that creep up and tarnish every other agency that achieves scale. There are too many exhausting, smoke and mirrors individuals leading for themselves, not the good of the agency or the work. Think differently, empower differently, and value your superstars consistently.", "rating": 3, "pros": "- At the project level, there are a ton of smart, passionate people", "cons": "- Leadership as a whole in NY is scattered and uninspiring", "advice": "Practice the bold brand that you preach. Shun the politics that creep up and tarnish every other agency that achieves scale. There are too many exhausting, smoke and mirrors individuals leading for themselves, not the good of the agency or the work. Think differently, empower differently, and value your superstars consistently."}, {"title": "Run! Don't look back, keep running!", "text": "Pros Best selection of sparkling water and cold pressed brewed coffee. And you get to bring your dog to work! Office manager and her team are the BEST of what LA Huge has to offer. The designers are used and abused. The project managers run around all day with their laptops putting out so called fire drills but your project is blowing up anyways. Management sucks. We are the ugly step child of the Brooklyn office Cons 1. Client management: they usually fire us or we are told to stop work because they won't pay. 2. Leadership: clueless; biggest high school-like clique of passive aggressive bullies. 3. HR: people get fired and you don't know for weeks that that person is gone. People get hired and you have no idea who this person is for months! Can't keep up with new hires and new fires...it happens WEEKLY here. Advice to Management Close your business. It's against the law to swindle people.", "rating": 1, "pros": "Best selection of sparkling water and cold pressed brewed coffee. And you get to bring your dog to work!", "cons": "1. Client management: they usually fire us or we are told to stop work because they won't pay.", "advice": "Close your business. It's against the law to swindle people."}, {"title": "Sadly poor leadership and poor management", "text": "Pros Vibe and culture are solid. Cons Leadership are literally out for themselves and no one else and don't care how the day to day company runs, or their people.", "rating": 1, "pros": "Vibe and culture are solid.", "cons": "Leadership are literally out for themselves and no one else and don't care how the day to day company runs, or their people.", "advice": null}, {"title": "Toxic", "text": "Pros You will work with some of the scrappiest people you've ever met Cons Prepare for some of the purest politics you've ever witnessed.", "rating": 3, "pros": "You will work with some of the scrappiest people you've ever met", "cons": "Prepare for some of the purest politics you've ever witnessed.", "advice": null}, {"title": "Excellent place to learn", "text": "Pros Great culture and atmosphere. They really take care of their employees and for the most part help you work on things that you want to. Cons It's very hard to move upward in the company and access to clients is minimal.", "rating": 5, "pros": "Great culture and atmosphere. They really take care of their employees and for the most part help you work on things that you want to.", "cons": "It's very hard to move upward in the company and access to clients is minimal.", "advice": null}, {"title": "Positive experience", "text": "Pros I have worked @ Huge for 5+ years and my experience has been consistently positive. My manager and the proactiveness of this agency have pushed my career to a new level. Cons No cons from me.", "rating": 5, "pros": "I have worked @ Huge for 5+ years and my experience has been consistently positive. My manager and the proactiveness of this agency have pushed my career to a new level.", "cons": "No cons from me.", "advice": null}, {"title": "Uhhhhh", "text": "Pros Some (I'd say about 5) rad people. Dogs are chill. The ventilation unit is loud enough to drown out the bullspit (can't swear on here) Productivity is at it's max on free sweatshirt day. Bananas are ripe. The office people such as the folks at the front desk and the folks that maintain the office (aka, clean up after the large amounts of pseudo-adolescent people that \"work\" here) are the real Gs. They paid me well enough to put up with this crud. Cons I've worked in my fair share of agencies and have had run ins with a lot of different types of agencies but this one is probably the strangest pink (or is it magenta?) colored Kool Aid cult I've encountered yet. They speak of their culture being \"about the people\" however, if someone gets fired then the company puts them on full blast \" So and so was 'aight but we had to cut them loose... but look at this cool stuff they made for us!\" KPIs! ROIs! GI JOES! They say that they strive in a \"chaotic\" environment and position it to where those who will last are the ones who can work with the chaos but in reality, it's their way of saying that they in no way have their spit together. Replace \"chaotic\" with unorganized drowning episode gargling small bits of doodie while neck deep in sewage water while being held down by bricks and you've got yourself a better idea of what's going on. They seem to accept that their staff members known as \"leads\" are folks who don't necessarily have to lift a finger to make the big bucks. Lead that doesn't know how to use necessary programs or know how the project works and functions and wants to dump all everything on the mid staff? Forgetaboutit. They have the cool-talk dictionary accompanied by a beanie, longboard, and Doc Martens so they're solid. Who needs all that other stuff anyway? In short, this place is \"hella\" weird. Advice to Management I don't even know, you guys seem to know what you want. No advice here. Maybe chill on the pink and ego choking? y'all eat that stuff up way too hard.", "rating": 1, "pros": "Some (I'd say about 5) rad people.", "cons": "I've worked in my fair share of agencies and have had run ins with a lot of different types of agencies but this one is probably the strangest pink (or is it magenta?) colored Kool Aid cult I've encountered yet.", "advice": "I don't even know, you guys seem to know what you want. No advice here. Maybe chill on the pink and ego choking? y'all eat that stuff up way too hard."}, {"title": "Culture of bullying in leadership", "text": "Pros Good creative and design work. Medium and lower management is good. Good clients. Cons Many screw ups at clients due to poor delivery. Leadership only cares about pitches. Quick to hire and quick to fire without respect for individuals. Hi turn over in senior positions. Advice to Management Treat individuals with more respect. Put more care into the quality of deliverable. Measure performance not only for pitches but also for delivery quality.", "rating": 3, "pros": "Good creative and design work. Medium and lower management is good. Good clients.", "cons": "Many screw ups at clients due to poor delivery. Leadership only cares about pitches. Quick to hire and quick to fire without respect for individuals. Hi turn over in senior positions.", "advice": "Treat individuals with more respect. Put more care into the quality of deliverable. Measure performance not only for pitches but also for delivery quality."}, {"title": "A Disaster", "text": "Pros Great place to work if you're a UX designer or Visual Designer. Cons They don't know how to do anything else besides UX design. They're unorganized. They have no process. And Creative Leadership and the CEO do NOT share the same goals, which is very frustrating. They also have some really bad creative leadership in the New York Office. Advice to Management Some of your creative leadership needs to leave. They're beyond disrespectful to your creative talent and it's toxic.", "rating": 3, "pros": "Great place to work if you're a UX designer or Visual Designer.", "cons": "They don't know how to do anything else besides UX design. They're unorganized. They have no process. And Creative Leadership and the CEO do NOT share the same goals, which is very frustrating. They also have some really bad creative leadership in the New York Office.", "advice": "Some of your creative leadership needs to leave. They're beyond disrespectful to your creative talent and it's toxic."}, {"title": "Great people on the ground, but the leadership's a mess", "text": "Pros Skilled developers, some skilled designers, looks good on the resume, you'll get to work on high-profile clients, and they're *usually* pretty good about being flexible, not demanding too many hours, etc. Depends a lot on the client, though. Cons Lots of corporate red tape, management seems self-absorbed and unresponsive to the sincere and repeated requests of its employees. Free beer and similar perks are prioritized over salaries or interesting work. Large clients are often dull, technologically out-of-date, and/or ethically objectionable; the office keeps reorganizing, which has streamlined nothing and just creates confusion and overhead. Tech people are expected to become managers to move up, even if that's not their skillset or interest. Lots of lip service to \"agile\" but implementation is spotty. Advice to Management Everyone constantly tells you the people are the best part of being here, so maybe treat them better? All the engineers I've known and respected here have left, and I can't blame them.", "rating": 3, "pros": "Skilled developers, some skilled designers, looks good on the resume, you'll get to work on high-profile clients, and they're *usually* pretty good about being flexible, not demanding too many hours, etc. Depends a lot on the client, though.", "cons": "Lots of corporate red tape, management seems self-absorbed and unresponsive to the sincere and repeated requests of its employees. Free beer and similar perks are prioritized over salaries or interesting work. Large clients are often dull, technologically out-of-date, and/or ethically objectionable; the office keeps reorganizing, which has streamlined nothing and just creates confusion and overhead. Tech people are expected to become managers to move up, even if that's not their skillset or interest. Lots of lip service to \"agile\" but implementation is spotty.", "advice": "Everyone constantly tells you the people are the best part of being here, so maybe treat them better? All the engineers I've known and respected here have left, and I can't blame them."}, {"title": "NA", "text": "Pros Great company thus far and awesome people. Cons It is too soon to tell.", "rating": 5, "pros": "Great company thus far and awesome people.", "cons": "It is too soon to tell.", "advice": null}, {"title": "Amazing Place to Work", "text": "Pros The people and culture are terrific, everyone is quite skilled and knows what they are doing. Cons Has an Intense drinking culture Advice to Management na", "rating": 5, "pros": "The people and culture are terrific, everyone is quite skilled and knows what they are doing.", "cons": "Has an Intense drinking culture", "advice": "na"}, {"title": "No Respect For Talents", "text": "Pros Dogs everywhere. Good snacks. Nice location. Cons Poor leadership skills and no one cares about you. You're stuck to your title and you cannot get promoted unless you are part a clique. They won't let you experiment, if you want to do commerical but your job doesn't entitle - you are not allowed to be allocated. There's too many creative directors, too many presidents, too many people with high titles that don't do anything. Advice to Management Stop being so toxic and stop hiring presidents who were fired from their last jobs. Treat your employees better and start communicating with them. Enough with the lies.", "rating": 1, "pros": "Dogs everywhere. Good snacks. Nice location.", "cons": "Poor leadership skills and no one cares about you. You're stuck to your title and you cannot get promoted unless you are part a clique. They won't let you experiment, if you want to do commerical but your job doesn't entitle - you are not allowed to be allocated. There's too many creative directors, too many presidents, too many people with high titles that don't do anything.", "advice": "Stop being so toxic and stop hiring presidents who were fired from their last jobs. Treat your employees better and start communicating with them. Enough with the lies."}, {"title": "HUGE mistake.", "text": "Pros Flashy client logos and some cool projects Smart folks though even the smartest of the bunch seem to have huge insecurities. I figure they must have been bullied in their youth. Cons Be warned. This place is toxic- at the executive level. You'll be courted but once you're in it's sink or swim. Horrible communication - I've never experienced such two faced people. It was like a bad movie. Best thing that could have ever happened to me was getting out sooner than later. Advice to Management Stop lying about your company culture being about the people. You're a big PR machine. Use it to do something good not facilitate a toxic environment.", "rating": 1, "pros": "Flashy client logos and some cool projects", "cons": "Be warned. This place is toxic- at the executive level. You'll be courted but once you're in it's sink or swim. Horrible communication - I've never experienced such two faced people. It was like a bad movie. Best thing that could have ever happened to me was getting out sooner than later.", "advice": "Stop lying about your company culture being about the people. You're a big PR machine. Use it to do something good not facilitate a toxic environment."}, {"title": "~!#$!~", "text": "Pros Good people, and relaxed environment made it easier to onboard as new employee. Cons Could've used more diversity in senior level positions.", "rating": 3, "pros": "Good people, and relaxed environment made it easier to onboard as new employee.", "cons": "Could've used more diversity in senior level positions.", "advice": null}, {"title": "Copy Director", "text": "Pros Looks good on a cv The view of the city is amazing There are some good people Free food d Cons The environment is SO toxic, beware! I have never seen such an unorganized agency, and I've been around for some time. If you are not part of a clique you are kept on the outside. They also fire people massively, and then don't communicate that to the teams. I'm glad I left. The work is average to be honest, mostly financial. Lastly they say they are all about the people, but that's a lot of white noise. People are mostly unhappy and leaving. Stay away!", "rating": 1, "pros": "Looks good on a cv", "cons": "The environment is SO toxic, beware! I have never seen such an unorganized agency, and I've been around for some time. If you are not part of a clique you are kept on the outside. They also fire people massively, and then don't communicate that to the teams. I'm glad I left. The work is average to be honest, mostly financial. Lastly they say they are all about the people, but that's a lot of white noise. People are mostly unhappy and leaving. Stay away!", "advice": null}, {"title": "Best culture. All about pushing groundbreaking work.", "text": "Pros Phenomenal people- the smartest I've had the pleasure of working with. Design-led and user-centric. Always delivering ground breaking work whilst keeping things real! Cons Growing pains- as the company looks to evolution within 3-5 years, staying true to core values will be key. Also, non-competitive salary bands. Advice to Management Keep good communication top priority.", "rating": 5, "pros": "Phenomenal people- the smartest I've had the pleasure of working with. Design-led and user-centric. Always delivering ground breaking work whilst keeping things real!", "cons": "Growing pains- as the company looks to evolution within 3-5 years, staying true to core values will be key. Also, non-competitive salary bands.", "advice": "Keep good communication top priority."}, {"title": "Get on your resume, then leave ASAP to get away from the egos", "text": "Pros All of the stuff that doesn't actually matter, Huge does those things right. Looking cool. Having a cool office location in Dumbo. Working for cool brands. Free beer, free food, dog-friendly office. Young, good looking yuppies with \"curated\" wardrobes everywhere. I mean it FEELS really cool to work here. Except.... Cons I was super disappointed to realize: it's just another agency. You're doing the same poorly planned, over-promised, prepare-for-the-terrible-client-review work you'd get to do anywhere else. The only thing different is the facade. At the end of the day you're working to help IPG deliver a good quarter to investors. Except, you're getting paid a smaller slice of the billable hour and the people/egos are terrible to work with. I've run across some of the worst humans I've ever met here. It's amazing that they fit all the egos in through the door in the morning. I stuck it out for 2 years thinking maybe it was just the team I was on, but as I've worked with more Huge folk I've noticed a consistent pattern of sociopathic and narcissistic behavior. It seems the people self-select for similar types when hiring. I'd much rather work towards improving IPG's quarterly numbers at one of their many other agencies. I've worked at numerous shops where there wasn't so many emotionally-stunted man children throwing temper tantrums all day over web designs that will become outdated within a year. Advice to Management You're growing...so who cares? That's the only thing that matters in a publicly traded company so you're gonna keep doing what you're doing. I know you'll never pay better because you have a constant stream of financially-retarded, wannabe-cool-kids lining up to work here at your current salary curves. You sure duped me. Keep doing what you're doing! IPG made a solid investment in you guys. ...but I'm gonna go improve MY quarterly numbers elsewhere using your name on my resume while it's still \"cool.\" Hopefully not too many of the cool kiddies wise up like I did. To all my former sociopathic co-workers: Have fun yelling at each other all day! Just remember, if you were actually as smart and as talented as you think you are, you'd be running a successful business yourself.", "rating": 3, "pros": "All of the stuff that doesn't actually matter, Huge does those things right. Looking cool. Having a cool office location in Dumbo. Working for cool brands. Free beer, free food, dog-friendly office. Young, good looking yuppies with \"curated\" wardrobes everywhere. I mean it FEELS really cool to work here. Except....", "cons": "I was super disappointed to realize: it's just another agency. You're doing the same poorly planned, over-promised, prepare-for-the-terrible-client-review work you'd get to do anywhere else. The only thing different is the facade.", "advice": "You're growing...so who cares? That's the only thing that matters in a publicly traded company so you're gonna keep doing what you're doing. I know you'll never pay better because you have a constant stream of financially-retarded, wannabe-cool-kids lining up to work here at your current salary curves. You sure duped me. Keep doing what you're doing! IPG made a solid investment in you guys."}, {"title": "from temp to senior by the time I left", "text": "Pros The atmosphere is very chill. Beautiful design, stocked kitchen, beer for the taking. Its a cool place in theory. Also, having them on your resume is a HUGE deal. When people see that they seem to be excited because HUGE DOES hire some of the best talent out there. Cons They pay nowhere near market value. They treat you like a number rather than a person. Work/ life balance isnt a thing unless youre in upper management. The projects are NEVER organized and everything is a mad rush. I personally ended up working a minimum of 12 hrs a day, weekends included on a particular project for 2 years. The culture is quite abusive once you see through all of their \"perks\" Its INCREDIBLY clique-y and raises and praise seem to be based on nepotism and not hard work. Its as if thats where tech-bros go to be tech-bros. And if youre not \"in,\" youre no one. And god forbid youre a woman in the tech department. Good luck being taken seriously. They only take you seriously if your leaving would tank a project. Leaving there was painful because of how hard I worked for them but ended up being one of best decisions of my life. Gratitude and repeat go a long way. And let us not forget the money. Leaving there got me an immediate $40k raise. Huge will never pay you what youre worth unless you have a big timer title or are friends w. the right people. Advice to Management If you have someone working at the capacity of a title that is above their own, pay them accordingly. Appreciate your employees and treat them like human beings. the occasional picnic and free beer is not enough. Treat the departments with the same level of respect Give raises because people do their job properly, not because they in your \"boys club\" Stop taking advantage of people who dont know you're lowballing the hell out of them Plan your projects better. *ahem* MUCH better QA is incredibly important, stop pretending it isn't The design process doesn't need to be stretched out week when we have a deadline. It leaves very little wiggle room for tech to actually BUILD the thing, which I'd venture to say is the most important part. Stop treating tech like the redheaded step child. I understand HUGE started as a design firm but now youre a full service agency and have been for some time now. Without tech you're not HUGE. you should behave that way. If you have someone who has been accused of sexual harassment more than once, maybe get rid of them? 1 is enough, but several? Have some respect for the women who work for you. And the guy wasnt even good at his job.", "rating": 3, "pros": "The atmosphere is very chill. Beautiful design, stocked kitchen, beer for the taking. Its a cool place in theory.", "cons": "They pay nowhere near market value. They treat you like a number rather than a person. Work/ life balance isnt a thing unless youre in upper management. The projects are NEVER organized and everything is a mad rush. I personally ended up working a minimum of 12 hrs a day, weekends included on a particular project for 2 years. The culture is quite abusive once you see through all of their \"perks\"", "advice": "If you have someone working at the capacity of a title that is above their own, pay them accordingly."}, {"title": "You're either lucky, or you aren't.", "text": "Pros Lots of added bonuses with extra curricular stuff. Great brand to have on your resume. If you're lucky enough to get on the \"golden egg\" project, you'll go places. Some really cool people. Cons SO MANY LAYERS. so much bloat. Constantly price themselves out of interesting work. Very very political - if you're not part of executive leadership or have a strong advocate who is, you won't get far. The only people who succeed are the people who have exec leaderships' ear - regardless of merit. The most money you'll ever make there is when you're first hired - pay way below market because they're \"Huge.\" Their non-HQ offices (DC, Atlanta, LA) are way better off than Brooklyn at the moment. Advice to Management It feels like you're riding on the coat tails of the \"old Huge\" reputation. Stop trying to hold onto that and redefine yourselves in a way that supports your people holistically.", "rating": 3, "pros": "Lots of added bonuses with extra curricular stuff. Great brand to have on your resume. If you're lucky enough to get on the \"golden egg\" project, you'll go places. Some really cool people.", "cons": "SO MANY LAYERS. so much bloat. Constantly price themselves out of interesting work. Very very political - if you're not part of executive leadership or have a strong advocate who is, you won't get far. The only people who succeed are the people who have exec leaderships' ear - regardless of merit. The most money you'll ever make there is when you're first hired - pay way below market because they're \"Huge.\" Their non-HQ offices (DC, Atlanta, LA) are way better off than Brooklyn at the moment.", "advice": "It feels like you're riding on the coat tails of the \"old Huge\" reputation. Stop trying to hold onto that and redefine yourselves in a way that supports your people holistically."}, {"title": "Dissatisfied QA", "text": "Pros Good benefits, summer Fridays, pet friendly. Beautiful view. Free beer. Free snacks. Some smart people. Couches as you can take your laptop wherever you like to work. Cons High turnover rate. Huge promotes non-people type of employees to managerial positions, then Huge demote them after almost half of the team quit. Salary is below market rate. Advice to Management If Huge promotes to managerial positions at least give them a training how to handle people.", "rating": 3, "pros": "Good benefits, summer Fridays, pet friendly. Beautiful view. Free beer. Free snacks. Some smart people. Couches as you can take your laptop wherever you like to work.", "cons": "High turnover rate. Huge promotes non-people type of employees to managerial positions, then Huge demote them after almost half of the team quit. Salary is below market rate.", "advice": "If Huge promotes to managerial positions at least give them a training how to handle people."}, {"title": "Review", "text": "Pros They make pretty cool stuff. Cons Need less financial services clients.", "rating": 5, "pros": "They make pretty cool stuff.", "cons": "Need less financial services clients.", "advice": null}, {"title": "Director", "text": "Pros Fun environment, youthful energy, no dress code. picturesque Dumbo Brooklyn location. Fun technology to play with. Getting a really nice axe after 5 years Dogs in the workplace Cons At the time they were paying below market. not sure if that is still the case. Original culture was slowly eroding every year as it rapidly expanded. Owned by a bigger less-fun corporate holding company. (what successful agency isn't) revolving door of employees over-promising on work and ramping up at the 11th hour Advice to Management Try to stay true to values and culture of what Huge was founded on. Don't always chase after the dollars.", "rating": 5, "pros": "Fun environment, youthful energy, no dress code. picturesque Dumbo Brooklyn location. Fun technology to play with. Getting a really nice axe after 5 years", "cons": "At the time they were paying below market. not sure if that is still the case.", "advice": "Try to stay true to values and culture of what Huge was founded on. Don't always chase after the dollars."}, {"title": "Please read the below negative reviews CLOSELY BEFORE you apply.", "text": "Pros Nothing noteworthy that you can't get at another \"progressive\" agency. There is always free stuff to distract you from the true issues at hand at all of these places. I guess the unpredictability & chaos can be a positive for some ADHD/ADD peeps out there. If you live in BK and are a hipster it could also be a plus. Cons Like mentioned below it is a social club, WHO you know matters more than WHAT you know. The only thing the one review failed to mention is the fact that politics will happen at ALL LEVELS and you will be exposed to it daily. It WILL affect your work and morale. If I only knew my experience would exactly mirror his/hers 90%+ I would not have applied. Whether you are creative, technical or business etc. you will be stifled, doesn't matter. At the end of the day you better like the taste of Koolaid. Because if you don't then I am not sure what to tell you, that is the only thing they serve there. Advice to Management Nothing. You guys clearly know what you want, so you're gonna go for it anyways. Good Luck!!!", "rating": 1, "pros": "Nothing noteworthy that you can't get at another \"progressive\" agency. There is always free stuff to distract you from the true issues at hand at all of these places.", "cons": "Like mentioned below it is a social club, WHO you know matters more than WHAT you know.", "advice": "Nothing. You guys clearly know what you want, so you're gonna go for it anyways. Good Luck!!!"}, {"title": "Great place to build experience", "text": "Pros Learned a lot about heavy lifting projects and general politics of a big work place. Id recommend to anyone who wants a boot camp experience of trial by fire Cons seems like there was a lot of different opinions about how the company should move forward. they dont place project managers with the right types of projects but are really over protective about making sure the rest of the people at the company work on projects that are \"right for them\" Advice to Management take some time to learn about your PM's and make sure that they are set up for success as a good fit for the client and project requirements", "rating": 5, "pros": "Learned a lot about heavy lifting projects and general politics of a big work place. Id recommend to anyone who wants a boot camp experience of trial by fire", "cons": "seems like there was a lot of different opinions about how the company should move forward. they dont place project managers with the right types of projects but are really over protective about making sure the rest of the people at the company work on projects that are \"right for them\"", "advice": "take some time to learn about your PM's and make sure that they are set up for success as a good fit for the client and project requirements"}, {"title": "Tech dept needs modernizing", "text": "Pros Amazing workers. Really talented. Nice, amazing people. Everyone who leaves ends up at an amazing company. Bagels. Beer. Nice people. Fun parties. Cons Technology has a really high turnover rate. Tech leadership is patronizing when it comes to growth. Most tech workers get stuck with boring work. They encourage extra curricular work but give no recognition or time to do it. Non tech managers force tech decisions and expect the same timeline. They take on a risk and if it fails they pretend like the risk was never known. Estimates quickly become promises, often adjusted by management by \"thinking creative\" Weekend work asked regularly. Advice to Management If your tech staff says it's a bad idea, listen to them. Look up what tech benefits are being offered to the companies your employees are flocking to (better insurance, 10% bonuses, a little better salary, open source initiatives, free lunch, less meetings, more tech educated managers.)", "rating": 3, "pros": "Amazing workers. Really talented. Nice, amazing people. Everyone who leaves ends up at an amazing company. Bagels. Beer. Nice people. Fun parties.", "cons": "Technology has a really high turnover rate. Tech leadership is patronizing when it comes to growth. Most tech workers get stuck with boring work. They encourage extra curricular work but give no recognition or time to do it. Non tech managers force tech decisions and expect the same timeline. They take on a risk and if it fails they pretend like the risk was never known. Estimates quickly become promises, often adjusted by management by \"thinking creative\" Weekend work asked regularly.", "advice": "If your tech staff says it's a bad idea, listen to them. Look up what tech benefits are being offered to the companies your employees are flocking to (better insurance, 10% bonuses, a little better salary, open source initiatives, free lunch, less meetings, more tech educated managers.)"}, {"title": "Smart People. Mediocre Management.", "text": "Pros They hire smart and talented people. Cons Not a lot of premium work to spread around to all the smarts and talent. There's a sweatshop atmosphere, lots of grinding, lots of pitching. Conceptual work is lacking. Latest re-structure was rushed and poorly executed, leaving large gaps in organizational operations. Internal communication needs a reset. They hire quick and fire quick. Team trust is missing. Advice to Management Be what you say you are and not the opposite.", "rating": 3, "pros": "They hire smart and talented people.", "cons": "Not a lot of premium work to spread around to all the smarts and talent. There's a sweatshop atmosphere, lots of grinding, lots of pitching. Conceptual work is lacking. Latest re-structure was rushed and poorly executed, leaving large gaps in organizational operations. Internal communication needs a reset.", "advice": "Be what you say you are and not the opposite."}, {"title": "Getting in on the Ground Floor", "text": "Pros Excellent team members. It's truly about the work. Cons Its all new, so not enough time has passed to make judgements of what is a con.", "rating": 5, "pros": "Excellent team members. It's truly about the work.", "cons": "Its all new, so not enough time has passed to make judgements of what is a con.", "advice": null}, {"title": "Watch Your Back", "text": "Pros - Opportunities to work on top brands - Great people in the trenches - You'll be exposed to truly great design (for an ad agency) - A strong brand that looks good on your resume - If you are below the director level, you'll get to do a lot of good work, you'll have a nice portfolio, and you'll likely be shielded from the politics Cons I asked a friend who is still at Huge how things were going: \"You know that scene in the movie Airplane! where the flight attendant gets on the PA and says, 'I don't mean to alarm anyone, but does anyone onboard know how to fly a plane?' That's what working at Huge is like these days.\" So things haven't changed much, despite the 3 re-orgs in 1 year. - Leadership is political, cliquey and capricious: People are hired and fired at the whim of leadership, sometimes without even telling members of the team or even their managers. People just disappear. Yes, it's a sink or swim environment. But the problem is -- what if you think you're swimming but management thinks you're sinking? You won't be coached or told, you'll just be shoved out. If you're not in the right cliques, you're on the outside. The waaaaaay outside. - Questionable ethics: Simultaneously working on 2 or 3 competitor brands (but telling clients otherwise); being pressured into overbilling to reach targets; misleading interviewees about the state of the business; massively overselling solutions to vulnerable clients. - HR is a joke: Rude and arrogant to interviewees; bait & switch about jobs; inability to do basic HR functions; zero follow-through on issues or complaints, especially if they concern the male-dominated company leadership; glitzy new employees are hired despite past histories of sexual harassment. - They've lost their way: While the brand is still strong, this former product company lead by designers is now just an ad agency lead by account people. It has lost its distinctiveness, and much of the work looks pretty much the same. They haven't evolved much from the \"user-centered design\" philosphy that is now ubiquitous. I've once heard the CEO ask \"Why can't we execute anything reliably?\" Good question. Maybe ask the CE... oh... Survival tips: The recipe is simple -- sell like you've never sold before, and worm your way into the cliques that surround the CEO. Favorites gets paid and promoted at Huge, the rest are left to fight for scraps. Or as a former leader in the London office once told me: \"Aaron thinks he's the Steve Jobs of marketing. Your job is to do everything possible to feed that thinking. Whatever you do -- do not challenge it!\" Huge has earned a reputation for its toxic environment, that it burns and churns through its people, as it stumbles around in the dark, trying to figure out who it is. Unfortunately the cost of this dramatic lack of leadership and vision will not be paid by Huge's management or the IPG owners -- it will be paid by you and your career. Advice to Management If there's one thing that was made clear is that Management couldn't care less about the opinions of people outside the clique. There is a constant air of secrecy around decisions, big and small. But regardless, here is my advice: - Clean the leadership house -- Bring in leaders who care about what you do, have a vision, and actually care about the people. - Stop promoting incompetents who rise on the backs of deception and flattery. - Stop lying to your employees about the state of the company and their jobs. - Take care of the people who are making all the money that is feeding your earn-outs.", "rating": 3, "pros": "- Opportunities to work on top brands", "cons": "I asked a friend who is still at Huge how things were going: \"You know that scene in the movie Airplane! where the flight attendant gets on the PA and says, 'I don't mean to alarm anyone, but does anyone onboard know how to fly a plane?' That's what working at Huge is like these days.\"", "advice": "If there's one thing that was made clear is that Management couldn't care less about the opinions of people outside the clique. There is a constant air of secrecy around decisions, big and small. But regardless, here is my advice:"}, {"title": "Middle Management", "text": "Pros Extremely talented people, great location in Atlanta, part of a larger IPG network of successful agencies doing great work. Cons Atlanta agency leadership is weak.", "rating": 3, "pros": "Extremely talented people, great location in Atlanta, part of a larger IPG network of successful agencies doing great work.", "cons": "Atlanta agency leadership is weak.", "advice": null}, {"title": "Some good, some bad", "text": "Pros Strong work - good opportunity to be involved in high profile projects. Fun office and people, dog-friendly, plenty of stuff going on and opportunities to learn more about your discipline and other disciplines. Lots of free food and drinks and socializing. Cons Too many levels between a regular person and senior management. Can be a cliquey, cult-like atmosphere. Like most agencies, work levels are up and down. Advice to Management Be nice to people who work for you - free bagels aren't as important as recognition.", "rating": 3, "pros": "Strong work - good opportunity to be involved in high profile projects. Fun office and people, dog-friendly, plenty of stuff going on and opportunities to learn more about your discipline and other disciplines. Lots of free food and drinks and socializing.", "cons": "Too many levels between a regular person and senior management. Can be a cliquey, cult-like atmosphere. Like most agencies, work levels are up and down.", "advice": "Be nice to people who work for you - free bagels aren't as important as recognition."}, {"title": "Outstanding place to work!", "text": "Pros Definitely this is THE place to make things we love! Working here is inspirational and people are outstanding. Besides this, company's culture is amazing! Cons It's rare, but workload sometimes can become an issue. But it's not actually a problem if you're engaged with your work! :)", "rating": 5, "pros": "Definitely this is THE place to make things we love! Working here is inspirational and people are outstanding. Besides this, company's culture is amazing!", "cons": "It's rare, but workload sometimes can become an issue. But it's not actually a problem if you're engaged with your work! :)", "advice": null}, {"title": "Great talent, okay work", "text": "Pros The people here are truly talented and fun to work with. Great benefits and decent work hours. Cons The clients we have are getting less and less exciting. The work isn't using the talent's to it's full potential. Advice to Management Ask people what they want to work on. There has been a lot transition in the past few months. There are so many titles that are not necessary.", "rating": 5, "pros": "The people here are truly talented and fun to work with. Great benefits and decent work hours.", "cons": "The clients we have are getting less and less exciting. The work isn't using the talent's to it's full potential.", "advice": "Ask people what they want to work on. There has been a lot transition in the past few months. There are so many titles that are not necessary."}, {"title": "DC office, ouch", "text": "Pros -Agency name is good for the resume -Good pay and benefits -Pretty good work / life balance -Coworkers are cool and talented -Some clients try to make the world a better place (government and nonprofits) Cons -Leadership (weak at local and corporate levels) -Low morale -Most interesting work comes out of Brooklyn -DC Client roster and projects are boring -New office in Union Market (bad location and construction) Advice to Management Pay attention and listen. Care about the satisfaction of your employees. Don't get defensive when you receive feedback.", "rating": 3, "pros": "-Agency name is good for the resume", "cons": "-Leadership (weak at local and corporate levels)", "advice": "Pay attention and listen. Care about the satisfaction of your employees. Don't get defensive when you receive feedback."}, {"title": "A bright bunch to work with", "text": "Pros All offices have their own special sauce Most people stay within the Huge network for a minimum of 3 years Culture is strong Work is top of class Design forward People really care about the work Cons Senior leadership is lacking Resourcing is a disaster Company does little to try and foster/retain talent Onboarding needs improvement Advice to Management Pay attention to your team and their needs - work with them", "rating": 5, "pros": "All offices have their own special sauce", "cons": "Senior leadership is lacking", "advice": "Pay attention to your team and their needs - work with them"}, {"title": "Great people, though company is getting big.", "text": "Pros • People are generally easy going, positive, and care about what they deliver. • Good paid vacation (Summer Fridays, Fryday, Birthday, last week of December). • Decent outside work culture (beer club). Cons • Company is bigger than when I started. Used to know everyone's face but now there are almost 5 new people starting every week. • There are many more execs at the top now. I can't tell who does what some times. • Some of the perks that we used to get now don't happen as frequently or at all now that we're a bigger company.", "rating": 5, "pros": "• People are generally easy going, positive, and care about what they deliver.", "cons": "• Company is bigger than when I started. Used to know everyone's face but now there are almost 5 new people starting every week.", "advice": null}, {"title": "The BEST agency you can work for", "text": "Pros There's a reason #agencylife is a popular hashtag on social medial. If you're going to live agency life, Huge is the best place to do it. I have never, ever worked with such smart people. Also, the scoping, resourcing and project management are much more adult and proactive than I've ever seen. And Huge does fabulous work you can be proud of. Work-life balance is surprisingly good. Also: snacks, beer, etc. are all good. Cons The learning curve is steep (sink or swim, people) and leadership is still pretty much male-dominated. I was a manager and was paid fairly, but many on my team were NOT, not even close. Some people are paid 40% below market, and there are no avenues to fix it for them. Agencies usually pay well. Very well. Huge doesn't, and they even took away the retroactivity of salary raises this year and communicated it poorly and in an untimely manner. Being unable to reward and retain great employees by not showing respect and insulting them by not paying them well is a total deal-breaker for managers who care about their teams. Advice to Management Pay people what they're worth. Your best people will LEAVE if you you don't. The shoulder-shrugging about attrition is costing you money and talent in the long run. The work matters, but the people matter more. They are what make Huge (and the work) awesome.", "rating": 5, "pros": "There's a reason #agencylife is a popular hashtag on social medial. If you're going to live agency life, Huge is the best place to do it. I have never, ever worked with such smart people. Also, the scoping, resourcing and project management are much more adult and proactive than I've ever seen. And Huge does fabulous work you can be proud of. Work-life balance is surprisingly good. Also: snacks, beer, etc. are all good.", "cons": "The learning curve is steep (sink or swim, people) and leadership is still pretty much male-dominated. I was a manager and was paid fairly, but many on my team were NOT, not even close. Some people are paid 40% below market, and there are no avenues to fix it for them. Agencies usually pay well. Very well. Huge doesn't, and they even took away the retroactivity of salary raises this year and communicated it poorly and in an untimely manner. Being unable to reward and retain great employees by not showing respect and insulting them by not paying them well is a total deal-breaker for managers who care about their teams.", "advice": "Pay people what they're worth. Your best people will LEAVE if you you don't. The shoulder-shrugging about attrition is costing you money and talent in the long run. The work matters, but the people matter more. They are what make Huge (and the work) awesome."}, {"title": "ACD", "text": "Pros Really good work, reasonable hours, smart people, top rate talent, good clients. Cons Location is rough (getting there, finding food), Advertising and Social capabilities could be better, IPG is no fun to work with. Advice to Management Think seriously about how a social department would work, Take writing more seriously, more check-ins with employees across the board, make creative and accounts departments be nice to each other.", "rating": 5, "pros": "Really good work, reasonable hours, smart people, top rate talent, good clients.", "cons": "Location is rough (getting there, finding food), Advertising and Social capabilities could be better, IPG is no fun to work with.", "advice": "Think seriously about how a social department would work, Take writing more seriously, more check-ins with employees across the board, make creative and accounts departments be nice to each other."}, {"title": "Very Cliquey", "text": "Pros Super cool Dumbo offices Free snacks and beer Lots of clubs to interact with your coworkers Interesting pitches and work Cons Very cliquey -- if you are not in -- you are very out Some cilents are impossible to get off of Advice to Management Create a formal mentorship program -- people are often lost with no direction.", "rating": 3, "pros": "Super cool Dumbo offices", "cons": "Very cliquey -- if you are not in -- you are very out", "advice": "Create a formal mentorship program -- people are often lost with no direction."}, {"title": "Software Developer", "text": "Pros Great people to work with. Cons Process of jumping between projects was difficult.", "rating": 5, "pros": "Great people to work with.", "cons": "Process of jumping between projects was difficult.", "advice": null}, {"title": "Poorly managed on many levels", "text": "Pros Cool swag, lots of booze in the office, good salary and decent benefits; many big name brands as clients; smart, creative people. Cons People get dropped in and pulled out of projects repeatedly. I never once was able to see a project through from start to finish. Pretty hard to gain any traction and succeed. If an office is short a particular role on a project, resource management would just grab someone from another office and either relocating you for weeks, or having you be remote from the rest of your team. Working from home was only allowed in special circumstances, at least with the manager I had. Even in a case where I was the only person on the team working from another office, i.e., was remote to my team anyway, therefore no reason to be in the office when everyone else was elsewhere. I rarely got to work on projects with people actually located in the same office as me. Advice to Management Treat employees as people, actual humans, and not just resources. Have full-time, in-house HR. Train your managers. Assign employees to projects matching skills and experience, and/or prepare and train employees for assigned projects. Allow flexibility to work from home, especially if/when the rest of an employee's project team is at another location.", "rating": 3, "pros": "Cool swag, lots of booze in the office, good salary and decent benefits; many big name brands as clients; smart, creative people.", "cons": "People get dropped in and pulled out of projects repeatedly. I never once was able to see a project through from start to finish. Pretty hard to gain any traction and succeed. If an office is short a particular role on a project, resource management would just grab someone from another office and either relocating you for weeks, or having you be remote from the rest of your team.", "advice": "Treat employees as people, actual humans, and not just resources. Have full-time, in-house HR. Train your managers. Assign employees to projects matching skills and experience, and/or prepare and train employees for assigned projects. Allow flexibility to work from home, especially if/when the rest of an employee's project team is at another location."}, {"title": "Good opportunity for some", "text": "Pros Talented coworkers and a solid client list Cons No structure. You will work long nights and weekend. They do not pay equally to employees that do the same job. Most people are treated as production workers and only a few get to be creative. Advice to Management Listen to your employees and spend time with the teams", "rating": 3, "pros": "Talented coworkers and a solid client list", "cons": "No structure. You will work long nights and weekend. They do not pay equally to employees that do the same job. Most people are treated as production workers and only a few get to be creative.", "advice": "Listen to your employees and spend time with the teams"}, {"title": "Great Agency", "text": "Pros Best place I have ever worked at. Some of the best, nicest, smartest people you will work with. Fun environment, the dogs make stressful days less stressful, cool work. Love coming to work every day. Cons For some, their career can meet a ceiling if they are not given the opportunity to work on projects that would allow them to demonstrate certain skills or growth. Organization as its growing is becoming a bit more political and less flat, but that's just how things are when any organization grows and expands.", "rating": 5, "pros": "Best place I have ever worked at. Some of the best, nicest, smartest people you will work with. Fun environment, the dogs make stressful days less stressful, cool work. Love coming to work every day.", "cons": "For some, their career can meet a ceiling if they are not given the opportunity to work on projects that would allow them to demonstrate certain skills or growth. Organization as its growing is becoming a bit more political and less flat, but that's just how things are when any organization grows and expands.", "advice": null}, {"title": "Culture", "text": "Pros Great culture, face paced, challenging Cons Awaiting a new office location that is more Hugey", "rating": 5, "pros": "Great culture, face paced, challenging", "cons": "Awaiting a new office location that is more Hugey", "advice": null}, {"title": "Love it here", "text": "Pros Super smart people, good clients, and great culture. Opinions are valued and teams work well together. Cons Little upper management, more or less a sink or swim environment. Advice to Management Provide more of an on-boarding experience for new hires.", "rating": 5, "pros": "Super smart people, good clients, and great culture. Opinions are valued and teams work well together.", "cons": "Little upper management, more or less a sink or swim environment.", "advice": "Provide more of an on-boarding experience for new hires."}, {"title": "Huge opportunity.", "text": "Pros Brilliant people; creative environment, great chance to learn and work with amazing brands Cons Management somewhat out of touch.", "rating": 3, "pros": "Brilliant people; creative environment, great chance to learn and work with amazing brands", "cons": "Management somewhat out of touch.", "advice": null}, {"title": "You should be so lucky to work here", "text": "Pros Culture, work, clients, food, dogs, pay, location, travel, fun, management.. best job I've ever had Cons Absolutely nothing worth noting, any cons would be trivial. There's no place like Huge Advice to Management Keep being awesome, and changing with the times", "rating": 5, "pros": "Culture, work, clients, food, dogs, pay, location, travel, fun, management.. best job I've ever had", "cons": "Absolutely nothing worth noting, any cons would be trivial. There's no place like Huge", "advice": "Keep being awesome, and changing with the times"}, {"title": "Amazingly Creative People", "text": "Pros Fun work environment surrounded by intelligent and creative people. Great collaboration within teams and management makes you feel valued for your skills. Cons Timelines are sometimes more condensed than preferred. There's sometimes the feeling that you can't get your best idea across without time to truly iterate. Advice to Management Keep up the current pace and stick to the core values. It's hard to grow sometimes but so far it looks like it's working well.", "rating": 5, "pros": "Fun work environment surrounded by intelligent and creative people. Great collaboration within teams and management makes you feel valued for your skills.", "cons": "Timelines are sometimes more condensed than preferred. There's sometimes the feeling that you can't get your best idea across without time to truly iterate.", "advice": "Keep up the current pace and stick to the core values. It's hard to grow sometimes but so far it looks like it's working well."}, {"title": "Great teams, management is unfocused", "text": "Pros Project teams are as sharp as any I've seen. Great designers, developers, product managers. Really tight process. Extremely high quality work gets done. Cons Client engagement and department heads live in their own world. Lots of meaningless organizational arrangements and needless layers that add no value and pressure margins. Advice to Management Dump the portfolio model and the career track. Just pay your people to do what they do best. Make people feel valued.", "rating": 5, "pros": "Project teams are as sharp as any I've seen. Great designers, developers, product managers. Really tight process. Extremely high quality work gets done.", "cons": "Client engagement and department heads live in their own world. Lots of meaningless organizational arrangements and needless layers that add no value and pressure margins.", "advice": "Dump the portfolio model and the career track. Just pay your people to do what they do best. Make people feel valued."}, {"title": "Still a good place to work despite growing pains", "text": "Pros Smart people who genuinely care about producing good work. Leadership is in touch with reality and super agile. They are actively working to improve the workplace. Cons The company has become so large that the Brooklyn office feels cold and impersonal. They are actively renovating the space, but it still feels cramped and there aren't enough conference rooms for all the meetings that take place. I'm not a fan of the open floor plan, which creates lots of noise lets the air conditioning go into overdrive. Sometimes even internal meetings can be very political.", "rating": 5, "pros": "Smart people who genuinely care about producing good work. Leadership is in touch with reality and super agile. They are actively working to improve the workplace.", "cons": "The company has become so large that the Brooklyn office feels cold and impersonal. They are actively renovating the space, but it still feels cramped and there aren't enough conference rooms for all the meetings that take place. I'm not a fan of the open floor plan, which creates lots of noise lets the air conditioning go into overdrive. Sometimes even internal meetings can be very political.", "advice": null}, {"title": "It's ok", "text": "Pros Causal work environment, a bunch of hipsters patting themselves on their own backs Cons Cliquey, form management all the way down through interns; not an open or welcoming environment", "rating": 3, "pros": "Causal work environment, a bunch of hipsters patting themselves on their own backs", "cons": "Cliquey, form management all the way down through interns; not an open or welcoming environment", "advice": null}, {"title": "The only thing constant is the change", "text": "Pros People here are some of the smartest I ever met Cons Constantly changing priorities have left me feeling like I'm pulled from one fire to the next, never seeing anything through the completion.", "rating": 3, "pros": "People here are some of the smartest I ever met", "cons": "Constantly changing priorities have left me feeling like I'm pulled from one fire to the next, never seeing anything through the completion.", "advice": null}, {"title": "Not for everyone.", "text": "Pros Many very talented people who truly care about doing a good job. Decent space and decent pay. Bagels once a week. Dogs allowed in the office. Cons Very chaotic. Every six months there seems to be a new structure, a new priority, a new set of systems. Cliquish. In December a bunch of people were fired because of a bad year financially which has made people nervous. Senior management doesn't seem to care about people. There is a culture of instability that is nerve wracking. Lots of churn and burn. Advice to Management Start caring about people. They are the best investment.", "rating": 3, "pros": "Many very talented people who truly care about doing a good job. Decent space and decent pay. Bagels once a week. Dogs allowed in the office.", "cons": "Very chaotic. Every six months there seems to be a new structure, a new priority, a new set of systems. Cliquish. In December a bunch of people were fired because of a bad year financially which has made people nervous. Senior management doesn't seem to care about people. There is a culture of instability that is nerve wracking. Lots of churn and burn.", "advice": "Start caring about people. They are the best investment."}, {"title": "Not for everyone. But if it is for you - it's great.", "text": "Pros Great people, wicked smart, they take care of their employees. Very flat structure, so everyone has something to contribute - if it's good. Cons Lack of a management culture. If you need to be managed, this place ain't for you. Advice to Management Stay focused", "rating": 5, "pros": "Great people, wicked smart, they take care of their employees. Very flat structure, so everyone has something to contribute - if it's good.", "cons": "Lack of a management culture. If you need to be managed, this place ain't for you.", "advice": "Stay focused"}, {"title": "Toxic", "text": "Pros Like so many other reviewers have said: some extremely smart & talented people at Huge. The Dumbo thing is pretty cool too. Cons A toxic environment where bad behavior, lack of clarity and support flow from the top. There have been so many talented people either come and baIl out or get chewed and spit out that it is a wonder the place hasn't fallen apart. Advice to Management Replace yourselves.", "rating": 1, "pros": "Like so many other reviewers have said: some extremely smart & talented people at Huge. The Dumbo thing is pretty cool too.", "cons": "A toxic environment where bad behavior, lack of clarity and support flow from the top. There have been so many talented people either come and baIl out or get chewed and spit out that it is a wonder the place hasn't fallen apart.", "advice": "Replace yourselves."}, {"title": "Amazing", "text": "Pros Amazing culture, people, and clients. It was a wonderful experience and I would go back in a heartbeat. Cons Depending on project/timeline, it can be long hours.", "rating": 5, "pros": "Amazing culture, people, and clients. It was a wonderful experience and I would go back in a heartbeat.", "cons": "Depending on project/timeline, it can be long hours.", "advice": null}, {"title": "Good place to work", "text": "Pros Lots of accounts and different types of projects to work on, and management allows mobility so you don't get bored. Ability to work at other office locations (short term or permanent). Access to a lot of smart disciplines and minds. Cons Politics and many layers of hierarchy makes getting things done and moving up in the company difficult. Advice to Management Ensure your employees have access to decision makers and aren't living under the shadow of their boss.", "rating": 5, "pros": "Lots of accounts and different types of projects to work on, and management allows mobility so you don't get bored. Ability to work at other office locations (short term or permanent). Access to a lot of smart disciplines and minds.", "cons": "Politics and many layers of hierarchy makes getting things done and moving up in the company difficult.", "advice": "Ensure your employees have access to decision makers and aren't living under the shadow of their boss."}, {"title": "huge mistake", "text": "Pros free seltzer. cute dogs. about 5 genuinely cool people. really nice bathrooms. they even play good, loud music so you can do your business and not worry about your neighbor hearing. Cons unless you're willing to play the brooklyn hipster game all day everyday - this won't be for you. don't let the magenta and cool instagram fool you.", "rating": 3, "pros": "free seltzer. cute dogs. about 5 genuinely cool people.", "cons": "unless you're willing to play the brooklyn hipster game all day everyday - this won't be for you. don't let the magenta and cool instagram fool you.", "advice": null}, {"title": "Great Culture and Great Work", "text": "Pros The people are amazing and the work is innovative. Cons There are definite process issues, but the teams are aware and are working to improve that.", "rating": 5, "pros": "The people are amazing and the work is innovative.", "cons": "There are definite process issues, but the teams are aware and are working to improve that.", "advice": null}, {"title": "Great place to work", "text": "Pros Huge has taken the time to develop an amazing culture and hire amazing people. Even if the project is boring, the work is top notch. Cons Huge, like many other digital agencies, is growing very rapidly. This is causing some pain points in process. Advice to Management Work harder to identify unhappy employees before they start looking elsewhere.", "rating": 5, "pros": "Huge has taken the time to develop an amazing culture and hire amazing people. Even if the project is boring, the work is top notch.", "cons": "Huge, like many other digital agencies, is growing very rapidly. This is causing some pain points in process.", "advice": "Work harder to identify unhappy employees before they start looking elsewhere."}, {"title": "Raising the bar.", "text": "Pros Huge Atlanta has an amazing mix of clients, and work. Forward thinking and ambitious. Everyone is talented and genuinely care about what they do, and the work they put out. Most projects are A+ career builders and portfolio stars. Consistently given more work and responsibility by current clients and the amount of new work coming in the door is impressive. Cons Need more people to handle the workload, but see new people almost every week. Initital 'start-up' feel is being diluted as we become a larger company, but is necessary to maintain process and order. Advice to Management Keep culture in mind and guide towards maintaining the feel and success of the Agency. Cut clients who are not a good fit.", "rating": 5, "pros": "Huge Atlanta has an amazing mix of clients, and work. Forward thinking and ambitious. Everyone is talented and genuinely care about what they do, and the work they put out. Most projects are A+ career builders and portfolio stars. Consistently given more work and responsibility by current clients and the amount of new work coming in the door is impressive.", "cons": "Need more people to handle the workload, but see new people almost every week. Initital 'start-up' feel is being diluted as we become a larger company, but is necessary to maintain process and order.", "advice": "Keep culture in mind and guide towards maintaining the feel and success of the Agency. Cut clients who are not a good fit."}, {"title": "No bueño", "text": "Pros Nice office space, Sonos in the bathrooms, and dog friendly environment. But the cons outweigh the minimal pros (see below). Cons Not collaborative except for the small clique of cool kids who are the only ones allowed to contribute. Not a welcoming team environment, so if you haven't worked there for years or come from the Brooklyn office, good luck. Super passive aggressive and straight up bullying behaviour exhibited by those in positions of power. Advice to Management Be nicer and more transparent", "rating": 1, "pros": "Nice office space, Sonos in the bathrooms, and dog friendly environment. But the cons outweigh the minimal pros (see below).", "cons": "Not collaborative except for the small clique of cool kids who are the only ones allowed to contribute. Not a welcoming team environment, so if you haven't worked there for years or come from the Brooklyn office, good luck. Super passive aggressive and straight up bullying behaviour exhibited by those in positions of power.", "advice": "Be nicer and more transparent"}, {"title": "Words about HUGE from a long term employee.", "text": "Pros Great atmosphere and people. They really promote unity amongst departments and have hard deadlines so everyone pushes together Cons They try to keep you there forever. Most people work 65-75 hours a week. Projects are in constant rotation. Advice to Management Keep the small agency attitude. Try to limit the bureaucracy and also give employees a chance to be heard without having to go up the chain of command.", "rating": 5, "pros": "Great atmosphere and people. They really promote unity amongst departments and have hard deadlines so everyone pushes together", "cons": "They try to keep you there forever. Most people work 65-75 hours a week. Projects are in constant rotation.", "advice": "Keep the small agency attitude. Try to limit the bureaucracy and also give employees a chance to be heard without having to go up the chain of command."}, {"title": "A great place to have a rewarding career", "text": "Pros Design-centric, user-centric ethos. Strong commitment to doing great work. Leadership that really believes in growing internal talent and will invest in you and help you progress quickly, allowing you to take risks. Dogs, beer, snacks, and perks and a general commitment to treating people well. Cons Can be chaotic - the downside of a flexible process is sometimes there's no process. New senior people tend to come in thinking they are here to \"teach Huge how it's done\" and quickly run into culture shock. Advice to Management Stay the course in being about great design and great work; don't get sucked into the dream of becoming a \"full service\" agency and turning into blah.", "rating": 5, "pros": "Design-centric, user-centric ethos. Strong commitment to doing great work. Leadership that really believes in growing internal talent and will invest in you and help you progress quickly, allowing you to take risks. Dogs, beer, snacks, and perks and a general commitment to treating people well.", "cons": "Can be chaotic - the downside of a flexible process is sometimes there's no process. New senior people tend to come in thinking they are here to \"teach Huge how it's done\" and quickly run into culture shock.", "advice": "Stay the course in being about great design and great work; don't get sucked into the dream of becoming a \"full service\" agency and turning into blah."}, {"title": "Freelance CG Lighter", "text": "Pros Great laid back place to work. Cool people. Cons None that I can think of.", "rating": 5, "pros": "Great laid back place to work. Cool people.", "cons": "None that I can think of.", "advice": null}, {"title": "Front-End Web Engineer", "text": "Pros The culture and the people are awesome! I love coming to work every day. The scope of work is great and the life/work balance is excellent. I feel valued and respected. Growth is encouraged and the managers really have your best interests at heart. Cons The pay isn't great, the benefits could be better, and promotions/raises only happen once a year. Advice to Management Let each employee dictate how often they need meetings with management. Sometimes we only need to check in once a month or more often if a need arises. Make promotions and salary increases available more than just once a year.", "rating": 5, "pros": "The culture and the people are awesome! I love coming to work every day. The scope of work is great and the life/work balance is excellent. I feel valued and respected. Growth is encouraged and the managers really have your best interests at heart.", "cons": "The pay isn't great, the benefits could be better, and promotions/raises only happen once a year.", "advice": "Let each employee dictate how often they need meetings with management. Sometimes we only need to check in once a month or more often if a need arises. Make promotions and salary increases available more than just once a year."}, {"title": "Wondeful Experience", "text": "Pros I loved my time here and would go back gladly. I loved the environment, the role, the experiences, collaborating across departments/companies. Senior management are very approachable and open minded. There is a constant passion to do the best work, get the best people, and try the hardest that I personally admired greatly. I met some amazing people and learned a lot about myself in the process. It's not for everyone but surprisingly, it was for me. I was very sorry to leave. Cons Everyone is lovely but there is certainly an undercurrent of pretentiousness that can be a little cloying at times. Advice to Management Accept that there needs to be more formal people management and there is a cost to that, fund it and things will be easier.", "rating": 5, "pros": "I loved my time here and would go back gladly. I loved the environment, the role, the experiences, collaborating across departments/companies.", "cons": "Everyone is lovely but there is certainly an undercurrent of pretentiousness that can be a little cloying at times.", "advice": "Accept that there needs to be more formal people management and there is a cost to that, fund it and things will be easier."}]