[{"title": "You get what you put in!", "text": "Pros Hydrogen Group offers a challenging environment providing the structure to build your own book of business and brand to become a successful recruiter. I have seen consultants take home 100K worth of commission in no time – work hard and you will definitely reap the benefits! The company offers fun incentives to top performers, such as all expense paid trips to Ibiza and Tokyo to name a few. There are a lot of driven, hard working people with a great sense of humour working here! Cons Some processes aren’t clearly defined as of yet or can take time to set up – getting agreements out or changes in contracts all need to go through the head office which can take a day or two with the time difference. People are generally helpful when asked though and with the various channels of communication the company offers, it is easy to just pick up the phone or schedule in a VC to discuss things with counterparts in offices across the globe. Employees are also able to log on remotely making it easy to get work done fast despite the time difference. Turnover can be fairly high – the majority of people who quit so quickly do so because they do not understand the work involved to succeed in this business. If all you want is an average salary with easy to meet targets and an environment where there is no room for growth and development, I would recommend an easy non sales 8-5 job.", "rating": 5, "pros": "Hydrogen Group offers a challenging environment providing the structure to build your own book of business and brand to become a successful recruiter. I have seen consultants take home 100K worth of commission in no time – work hard and you will definitely reap the benefits! The company offers fun incentives to top performers, such as all expense paid trips to Ibiza and Tokyo to name a few.", "cons": "Some processes aren’t clearly defined as of yet or can take time to set up – getting agreements out or changes in contracts all need to go through the head office which can take a day or two with the time difference. People are generally helpful when asked though and with the various channels of communication the company offers, it is easy to just pick up the phone or schedule in a VC to discuss things with counterparts in offices across the globe. Employees are also able to log on remotely making it easy to get work done fast despite the time difference.", "advice": null}, {"title": "Opportunity & development", "text": "Pros The opportunity to learn and take ownership and accountability for your own career and speed of development. I was at Hydrogen for 9 years and had 4 different roles during that time and was almost always challenged - I only realised the extent of how much I had gained from my time there when I started working for another company. Cons Hydrogen is relatively agile but this can be a downside - sometimes the message to it’s employees could be more consistent. It has been a few years since I worked there however! Advice to Management Continue to take on high quality recruits who have potential to enable the progressive and fun environment. Keep the strategy and internal company message simple.", "rating": 5, "pros": "The opportunity to learn and take ownership and accountability for your own career and speed of development. I was at Hydrogen for 9 years and had 4 different roles during that time and was almost always challenged - I only realised the extent of how much I had gained from my time there when I started working for another company.", "cons": "Hydrogen is relatively agile but this can be a downside - sometimes the message to it’s employees could be more consistent. It has been a few years since I worked there however!", "advice": "Continue to take on high quality recruits who have potential to enable the progressive and fun environment. Keep the strategy and internal company message simple."}, {"title": "A place to grow", "text": "Pros I have worked at Hydrogen for 1,5 years both in the Technology Division - Perm and in the Life Sciences - Regulatory Affairs Permanent, both in a 360 role developing cold desks in EU markets. I have had the best managers ever who have mentored and supported me all the way. Thanks to them I have been able to develop my leadership and self-expression skills further. I have learned from them by example how to be confident and at ease in a commercial role and how to win business in a truly consultative way. Training is very effective and it is outsourced to former top billers developed into trainers. When something works it is delivered with training across the company. Hydrogen is a global company and it is possible to join the Australian, Singaporean and US branch. Colleagues from these offices come back regularly to update us on their developments. IT is very present with effective tools to facilitate our job. People at Hydrogen are warm, switched on, dedicated and they own their work and results. If you have these qualities you will have a great time here. I have let Hydrogen because I have started my own business in a non related industry and I definitely will make the management style I have experience at Hydrogen my own for my team within my own business. Cons They are working on Flex work hours, so they are a few months away (sometimes 2018?) from a better quality of life. For now Life Sciences starts at 7:30am and the day is long. Advice to Management I trust you will do an amazing job.", "rating": 5, "pros": "I have worked at Hydrogen for 1,5 years both in the Technology Division - Perm and in the Life Sciences - Regulatory Affairs Permanent, both in a 360 role developing cold desks in EU markets.", "cons": "They are working on Flex work hours, so they are a few months away (sometimes 2018?) from a better quality of life. For now Life Sciences starts at 7:30am and the day is long.", "advice": "I trust you will do an amazing job."}, {"title": "A good company if you suit recruitment", "text": "Pros A great team, employees are friendly and positive. Great benefits. Cons They do expect a lot of their employees, the intensity can feel full on and overwhelming.", "rating": 5, "pros": "A great team, employees are friendly and positive. Great benefits.", "cons": "They do expect a lot of their employees, the intensity can feel full on and overwhelming.", "advice": null}, {"title": "Kings of Recruitment", "text": "Pros - If you have the social skills of a normal human being and the work rate of a dog on steroids, then you will in no doubt enjoy the best thing about Hydrogen which is the 'work hard; play hard' attitude that runs throughout the business - Hydrogen offers a clear path of progression which takes you from Digital Researcher all the way through to Senior Manager and beyond - Tailored training approach according to niche market you operate in, as well as an extensive universal training and development programme for the whole of the company (including management) - Strong reputation and market share within respective niches, particularly within Business Transformation, Legal and Life Sciences, which offers exposure to work with some world and UK leading brands - Good performance incentives - Good work/life balance with the aid of the 9-5 working hours, although you are still expected to stay until the work is done - From my experience, most teams don't hire because they need to, but rather hire because they consider you a good fit in terms of work ethic and social fit. If you are hired, and take on advice given and work hard like you promised in the interview and take on criticism well, you will be rewarded, recognised and have a very good time (and wage). If you go there, expect the world, moan and don't succeed, you will leave in 6 months and post a negative review on glassdoor. Your choice. Cons - The new company incentives. The new half yearly incentive should be replaced by the old quarterly lunch. The incentives used to not only reward those who regularly perform well but also give a taste of what success feels like to the trainees and rookies; now it's virtually impossible to get on unless you are top billers - Internal recruitment function doesn't function. - MPA is KPI's small sister Advice to Management Don't force change for the sake of change. Other than that, keep doing what you're doing. I really enjoyed my time here and would recommend Hydrogen to anyone who is looking to have a career in recruitment. Particular shoutout to the Business Transformation director and the Managers (and consultants).", "rating": 5, "pros": "- If you have the social skills of a normal human being and the work rate of a dog on steroids, then you will in no doubt enjoy the best thing about Hydrogen which is the 'work hard; play hard' attitude that runs throughout the business", "cons": "- The new company incentives. The new half yearly incentive should be replaced by the old quarterly lunch. The incentives used to not only reward those who regularly perform well but also give a taste of what success feels like to the trainees and rookies; now it's virtually impossible to get on unless you are top billers", "advice": "Don't force change for the sake of change. Other than that, keep doing what you're doing. I really enjoyed my time here and would recommend Hydrogen to anyone who is looking to have a career in recruitment. Particular shoutout to the Business Transformation director and the Managers (and consultants)."}, {"title": "Hydrogen Group", "text": "Pros Dynamic work environment with a commercial mindset. Cons Not people focused enough. 100% focused on sales. Zero work flexibility. Advice to Management Understand people needs to work flexibly.", "rating": 3, "pros": "Dynamic work environment with a commercial mindset.", "cons": "Not people focused enough. 100% focused on sales. Zero work flexibility.", "advice": "Understand people needs to work flexibly."}, {"title": "Great company to start off your career", "text": "Pros Fun culture and environment. Surrounded by people with a lot of drive, deep knowledge, experience and expertise in the industry. Cons Managerial decisions have to often go through the London office so one might find it difficult to get tasks done.", "rating": 3, "pros": "Fun culture and environment. Surrounded by people with a lot of drive, deep knowledge, experience and expertise in the industry.", "cons": "Managerial decisions have to often go through the London office so one might find it difficult to get tasks done.", "advice": null}, {"title": "My time at Hydrogen", "text": "Pros Really good group of people to work with. All focused on success and are also up for a laugh. A good place to grow and develop. Cons none that I can think of. So far so good! Advice to Management Keep doing what your doing and keep improving with the values of Hydrogen", "rating": 5, "pros": "Really good group of people to work with. All focused on success and are also up for a laugh.", "cons": "none that I can think of. So far so good!", "advice": "Keep doing what your doing and keep improving with the values of Hydrogen"}, {"title": "Glory days are long behind us", "text": "Pros We used to be a great place to work, with supportive senior management who contributed to the business and great incentives, until 2015 when the current COO started and is trying to turn what was a niche, specialist recruiter into his old company. Contractor care are great but over worked so things slip. IT are the best team in the company and hugely under valued. If you're going to join, join as a researcher, get your experience and leave, any level higher than that I wouldn't bother, you'll be valued and better paid elsewhere. Cons All the Directors bar two contribute nothing and piggy back off of their teams successes. One director even tried to steal a placement off of a consultant so she would hit her own targets. The hot headed COO changes targets and his mind on a daily basis. He's also just taken over Legal practice and everyone knows his 90s recruitment approach will not work in this sector. If you have to shout at and threaten staff then it's because YOUR management technique and business acumen is poor. New commission structure was rolled out this year which sounded good at first, but they conveniently kept bad aspects of it quiet hoping people wouldn't notice. Finance needs overhauling and they don't even reply to contractors a lot if the time. And yes I have raised these concerns and many more but nothing gets done. Advice to Management Don't bury complaints. Don't lie/tell half truths about changes or state of the company. Don't give back handers to/bribe clients and rec to recs. Dont steal NFI from consultants.", "rating": 1, "pros": "We used to be a great place to work, with supportive senior management who contributed to the business and great incentives, until 2015 when the current COO started and is trying to turn what was a niche, specialist recruiter into his old company.", "cons": "All the Directors bar two contribute nothing and piggy back off of their teams successes. One director even tried to steal a placement off of a consultant so she would hit her own targets.", "advice": "Don't bury complaints."}, {"title": "You can't polish a turd!", "text": "Pros A few good people but they are drowned out by the ruthless nature of the aggressive and politically motivated ones. Cons This is a prime example of high volume/low value recruitment. If you want to be part of something that is below average then this is your place. They are living off crumbs of past success and the future does not look bright! Advice to Management Sharkish behaviour amongst yourselves sets the precedent. Incompetent COO of Sales. Only collaboration he's been involved in is backhanders to his Rec 2 Rec mates.", "rating": 1, "pros": "A few good people but they are drowned out by the ruthless nature of the aggressive and politically motivated ones.", "cons": "This is a prime example of high volume/low value recruitment. If you want to be part of something that is below average then this is your place.", "advice": "Sharkish behaviour amongst yourselves sets the precedent."}, {"title": "Fantastic employer. Absolutely the right choice", "text": "Pros Forward thinking, strategic risk takers and well educated across multiple functions. Great bunch of employees, all entrepreneurial, commercially astute and intelligent with high values. Cons Recommend some more focus on working on more team work when it comes to delivery. Entrepreneurial spirit is important, but shouldn't become our employees' purpose and therefore the company's by-proxy. Advice to Management As above", "rating": 5, "pros": "Forward thinking, strategic risk takers and well educated across multiple functions. Great bunch of employees, all entrepreneurial, commercially astute and intelligent with high values.", "cons": "Recommend some more focus on working on more team work when it comes to delivery. Entrepreneurial spirit is important, but shouldn't become our employees' purpose and therefore the company's by-proxy.", "advice": "As above"}, {"title": "Excellent Management and Great Incentives!!", "text": "Pros - Great motivational schemes with loads of incentives for different people. - Listen to employee concerns and make changes to see if new office ideas might work - Fantastic bonus structure - Regular catch ups making promotion and career progression feasible and within reach within 18 months. - Interaction with CEO and staff who are at the top of the hierarchy Cons - If you don't like sales this environment is not for you - If you are entering as a digital reseracher some people find this a boring task but within 3 months you can be sitting with management on a sales desk Advice to Management Continue with the great incentives! Bonus strucutre seems to be working! Dont stop investing in your employees!", "rating": 5, "pros": "- Great motivational schemes with loads of incentives for different people.", "cons": "- If you don't like sales this environment is not for you", "advice": "Continue with the great incentives!"}, {"title": "Great people - real up and coming place to work", "text": "Pros - Approachable senior management - Great people - enjoyable place to work with good socials - Great benefits such as 50% gym membership, discount card, in-house massages and free breakfast - Flexible working - Use of advanced tech (everyone gets tablets to promote flexi working) - Global offices with good city locations Cons None that I can think of", "rating": 5, "pros": "- Approachable senior management", "cons": "None that I can think of", "advice": null}, {"title": "All to play for", "text": "Pros Flexible working. 9-5 is unheard of in recruitment, and if you bill enough you can get away with it with minimal fuss. Transparent commission structure Incentives on the rise - free breakfast, corporate discount cards and discounted gym, dress down fridays (based on targets) etc. The Operations team proves that we've made the shift from old boy's club to meritocracy, internally promoting the Head of IT to COO was a great shout - someone who knows and actually cares about the business. Payroll team are great, run by a cracking manager who is always willing to help (and has numerous sweet treats at her desk). Social aspect - I doubt i'd have stayed this long if I didn't have a laugh with the people I work with. If you're not a recluse or social outcast you'll make some good mates. That goes for a few of the Seniors as well, who balance the professional / joker line quite well. Particular shoutout to the Director of Bus Tran. No KPIs. Cons MPAs are re-branded KPIs. Stats can sometimes take precedent at the expense of real work - but that's life. Occasionally have to stay a little past 5pm and get a slightly later train. Advice to Management \"all to play for\" \"all to play for\" \"all to play for\" \"all to play for\" \"all to play for\"", "rating": 5, "pros": "Flexible working. 9-5 is unheard of in recruitment, and if you bill enough you can get away with it with minimal fuss.", "cons": "MPAs are re-branded KPIs.", "advice": "\"all to play for\""}, {"title": "Great place to work", "text": "Pros Clear and structured career path that aims to help you progress your career further Great friendly atmosphere around the office Great Ops team, notably HR and IT who are both extremely knowledgable and supportive whenever called upon Colleagues, Senior Management right up to CEO level are all supportive and willing to offer advice to help progress Employee Benefits are decent, free breakfast, monthly in house massages, various local discounts, hugely discounted corporate gym memberships and travel loans Annual Incentives some of the best Iv worked with, including summer parties, trips abroad etc Flexible working hours is a great plus Cons Can't think of any negatives at all. I love working here. Iv only wrote this many words as there is a 20 word minimum Advice to Management Keep doing what your doing", "rating": 5, "pros": "Clear and structured career path that aims to help you progress your career further", "cons": "Can't think of any negatives at all. I love working here. Iv only wrote this many words as there is a 20 word minimum", "advice": "Keep doing what your doing"}, {"title": "Great place to work!!", "text": "Pros - Hydrogen is filled with opportunities to progress your career and really push you as individuals and live by their values - They have a good workspace and host many collaborative events to get employees working together - Operations staff are very supportive and happy to help and sales work closely with each other to maximise the benefits of collaborate workings - Managers allow flexible working Cons - No cons really at all Advice to Management Keep on going !", "rating": 5, "pros": "- Hydrogen is filled with opportunities to progress your career and really push you as individuals and live by their values", "cons": "- No cons really at all", "advice": "Keep on going !"}, {"title": "Gender & Diversity", "text": "Pros Great facilities and a good chance to make money if you're hungry for it Cons Issues with gender and diversity needed to be acknowledged and improved", "rating": 3, "pros": "Great facilities and a good chance to make money if you're hungry for it", "cons": "Issues with gender and diversity needed to be acknowledged and improved", "advice": null}, {"title": "Good place to work", "text": "Pros -Good opportunity to grow in the business within operations -Working with a great team and have a good manager -Location - Exposure -Opportunity to learn -Great benefits! Free breakfast! 50% gym membership and discount card - Nicest CEO I have met Cons - Really need to focus on the sales department and the arising issues, making sure that they are being dealt with so it does not affect the business as a whole - Needs to be more motivation and ways to encourage others especially in sales Advice to Management Listen more to people and focus less on results.", "rating": 3, "pros": "-Good opportunity to grow in the business within operations", "cons": "- Really need to focus on the sales department and the arising issues, making sure that they are being dealt with so it does not affect the business as a whole", "advice": "Listen more to people and focus less on results."}, {"title": "Terrible Management", "text": "Pros - Nice offices in a good location - Generally friendly and sociable co-workers - Ops and HR teams are very supportive - Great rewards and incentives for hard workers Cons The management style to which I was exposed to at Hydrogen was entirely unprofessional and frankly appalling. It is surprising and disappointing that a great company is being let down by individuals in a position of seniority, who have little respect, understanding or experience in managing a diverse team of genders and ethnicities. During my short time at Hydrogen Group (Please note that I left the company of my own accord) I witnessed, and was subjected to behaviour that was borderline harassing and bullying in the workplace, all of which I must say was dealt with in a very supportive and professional manner by the HR team who endeavoured to improve my situation. It seems that little or no action was, or has been taken since to condemn such behaviour, which in most cases and at most professional organisations would be considered seriously concerning: - Belittling/ humiliating employees/shouting at them on the sales floor in front of other staff. - Breeding an unhealthy level of competition between team mates, and across other practises, encouraging bad mouthing of co-workers and discouraging collaboration. - Zero trust or autonomy, expected to give an explanation of where you have been every second of the day. - No support or guidance in any aspect of the job and always made to feel that position within the company was in jeopardy. Left to own devices yet constantly criticised for \"underperforming\", despite having 100% positive feedback from external parties and colleagues. - Throwaway remarks made about appearance/personal life and previous work experience. - Excluded from widely adopted 'flexible working' i.e not allowed to be flexible with start and finish times despite the entire company promoting this value. Advice to Management You will continue to lose good employees if this behaviour continues to be tolerated. Just because someone brings in business for the company, it shouldn't allow them free reign over how they treat their staff and to blatantly abuse their position/power.", "rating": 1, "pros": "- Nice offices in a good location", "cons": "The management style to which I was exposed to at Hydrogen was entirely unprofessional and frankly appalling. It is surprising and disappointing that a great company is being let down by individuals in a position of seniority, who have little respect, understanding or experience in managing a diverse team of genders and ethnicities.", "advice": "You will continue to lose good employees if this behaviour continues to be tolerated. Just because someone brings in business for the company, it shouldn't allow them free reign over how they treat their staff and to blatantly abuse their position/power."}, {"title": "Avoid", "text": "Pros Location People 1 extra day holiday for each year of service Cons No (or very small) bonuses Lack of training opportunities Boasting about flexible hours and perks when there are hardly any offered in practice Decisions re staff based on short term cost cutting Advice to Management Invest in your employees not in marketing campaigns", "rating": 3, "pros": "Location", "cons": "No (or very small) bonuses", "advice": "Invest in your employees not in marketing campaigns"}, {"title": "At least purple is a nice enough colour", "text": "Pros - Training used to be good (but then the decent trainer left.) - Purple is a nice colour. - The location is an excellent city location. - I've heard other practices are better run. - CEO seems well meaning. - They don't have KPIs.....just another fancy name for KPI's. Cons - Flexible working doesn't mean flexible, management make a lot of noise about various initiatives but it's amazing how many of them are just for show. - Incentives have been cut. Cost cutting means that most of the 'perks' of working in recruitment have been severely diminished i.e. top billers lunches etc. They even got rid of the coffee machines. - Waste of time coming into the business as an inexperienced first jobber. They now make you start on a really low basic salary (anything under 20k is criminal in London), and insist that you work your way up a very long ladder to even have the privilege of calling yourself a Consultant. - Very immature working environment from 'Digital Researchers' to the 'Senior Management'. Shocking behaviour and language is tolerated. - Senior Management, TL's etc will put themselves first over their team. Meaning a lot of people leave. - They don't seem to have a HR department just a series of very incompetent grumpy temps (?), contractors (?), who knows. Advice to Management Get management that want to develop staff not tread on them to make money. Start cracking down on abysmal behaviour and shoddy recruitment practices. Just put KPI's in place - so much more transparent. Also stop reporting reviews that are less than favourable in order to get them removed - shambles.", "rating": 1, "pros": "- Training used to be good (but then the decent trainer left.)", "cons": "- Flexible working doesn't mean flexible, management make a lot of noise about various initiatives but it's amazing how many of them are just for show.", "advice": "Get management that want to develop staff not tread on them to make money. Start cracking down on abysmal behaviour and shoddy recruitment practices. Just put KPI's in place - so much more transparent. Also stop reporting reviews that are less than favourable in order to get them removed - shambles."}, {"title": "Approach with caution.", "text": "Pros Location (two minutes from Monument station) Opportunities to change roles internally (sometimes, if it's cheaper for the company) Opportunities to work remotely (sometimes, depending on role) Cons Unprofessional behaviour (displayed both inside and outside of the office) Lack of career progression Hard to ignore favouritism Lack of bonuses, compensation and minor salary increases (almost non existent for operations staff) Advice to Management I would recommend spending more time on treating staff better rather than spouting all these deceitful messages about how great it is to work for Hydrogen. If you could retain talent then maybe people would take more notice and you wouldn't now be in the situation you are in.", "rating": 3, "pros": "Location (two minutes from Monument station)", "cons": "Unprofessional behaviour (displayed both inside and outside of the office)", "advice": "I would recommend spending more time on treating staff better rather than spouting all these deceitful messages about how great it is to work for Hydrogen. If you could retain talent then maybe people would take more notice and you wouldn't now be in the situation you are in."}, {"title": "Hydrogen have a clear focus - entrepreneurial spirit", "text": "Pros I recently joined Hydrogen Group to set up a new business. Hydrogen have a clear vision and strategy and I have found most people within the organisation to be highly collaborative and supportive. They are keen to support hard working, mature and entrepreneurial people. Looking to start your own recruitment business without the financial risk then Hydrogen is a great place to do this. Hydrogen's delivery teams are some of the best i have worked with in the last 20 years in recruitment. Hydrogen are actively promoting flexible working, so no need to be chained to your desk for extended hours. Do what is required and it is a very mature environment. Cons As with any recruitment company there can sometimes be less collaborative people, however the majority are. Advice to Management Ensure that the vision, values we stand for are managed down successfully through the business. Maximising opportunity through internal collaboration is key.", "rating": 5, "pros": "I recently joined Hydrogen Group to set up a new business. Hydrogen have a clear vision and strategy and I have found most people within the organisation to be highly collaborative and supportive. They are keen to support hard working, mature and entrepreneurial people. Looking to start your own recruitment business without the financial risk then Hydrogen is a great place to do this. Hydrogen's delivery teams are some of the best i have worked with in the last 20 years in recruitment. Hydrogen are actively promoting flexible working, so no need to be chained to your desk for extended hours. Do what is required and it is a very mature environment.", "cons": "As with any recruitment company there can sometimes be less collaborative people, however the majority are.", "advice": "Ensure that the vision, values we stand for are managed down successfully through the business. Maximising opportunity through internal collaboration is key."}, {"title": "Started off as a great place to work and ended up being somewhere I wouldn't recommend even to the most desperate", "text": "Pros Good culture, sociable place to work Hours of work were not too bad, what you would expect from recruitment Good location Cons Management are completely uninterested in supporting or developing individuals within their team, everything is about making themselves look good. There are an awful lot of unnecessary staff with people who are in roles that clearly shouldn't be. It's a company with no loyalty, no interest in what you're doing daily and a place that seems to be going downhill rather quickly! The HR team are also laughable, quite often patronising and do not seem to know what to do next in order to help improve things, constant restructuring! Training needs to be massively improved! Just generally not a good place to work and would not recommend at all.", "rating": 3, "pros": "Good culture, sociable place to work", "cons": "Management are completely uninterested in supporting or developing individuals within their team, everything is about making themselves look good. There are an awful lot of unnecessary staff with people who are in roles that clearly shouldn't be. It's a company with no loyalty, no interest in what you're doing daily and a place that seems to be going downhill rather quickly! The HR team are also laughable, quite often patronising and do not seem to know what to do next in order to help improve things, constant restructuring! Training needs to be massively improved! Just generally not a good place to work and would not recommend at all.", "advice": null}, {"title": "The Sinking Ship", "text": "Pros Good training for entry level staff Cons Uninspiring leadership Unclear career development structure Highly political culture Advice to Management Hydrogen used to be a fantastic place to work but, due to poor strategic decision making and a lack of investment in the internal talent already at it's disposal, the company has lost the edge that made it great; this is evident in the fact that hardly any of the staff that were with the business 5 years ago are there today. Now, following mass-redundancies, poor financial results, and continual restructuring, it is not an organisation I would recommend to anyone trying to build a successful career in recruitment", "rating": 1, "pros": "Good training for entry level staff", "cons": "Uninspiring leadership", "advice": "Hydrogen used to be a fantastic place to work but, due to poor strategic decision making and a lack of investment in the internal talent already at it's disposal, the company has lost the edge that made it great; this is evident in the fact that hardly any of the staff that were with the business 5 years ago are there today. Now, following mass-redundancies, poor financial results, and continual restructuring, it is not an organisation I would recommend to anyone trying to build a successful career in recruitment"}, {"title": "Probably Not Again", "text": "Pros People are friendly (most of them) Office situated in a great location (just off Monuments/Bank stations) Good experience for future sales position New flexible hours make life/work balance better Cons Very cut throat with constant rumours of rifts between teams Quite a childish workforce, with the majority of people being in their early 20's (admittedly including myself) Pay is below industry average and the bonus/incentive scheme(s) for many is no incentive, as it is the usual people taking all the glory 'Open discussions' regarding change/ new processes, yet management has already made up their minds Advice to Management Listen to your staff and take their opinions and ideas on board. They are the ones working in the field, so they are the best people to listen to when new processes/plans are being made. You don't always know best!", "rating": 3, "pros": "People are friendly (most of them)", "cons": "Very cut throat with constant rumours of rifts between teams", "advice": "Listen to your staff and take their opinions and ideas on board. They are the ones working in the field, so they are the best people to listen to when new processes/plans are being made. You don't always know best!"}, {"title": "Recruitment Consultant", "text": "Pros Really friendly people and a fun place to work. Cons -Hours - Commission structure - Training/ Ongoing support Advice to Management Invest more into training", "rating": 3, "pros": "Really friendly people and a fun place to work.", "cons": "-Hours", "advice": "Invest more into training"}, {"title": "Unemployment may be better", "text": "Pros - Location (two minute walk from Monumenf) - Offices (across 3 floors if I recall correctly. Nice kitchens which are fully stocked and each have fancy coffee machjnes). - Smoking breaks (permitted to step outside 3/4 times a day for a smoke) Cons - Everything. I'm only writing this to genuinely warn people before they start. I came to Hydrogen Group in Dec 2015 & left by Jan 2016 (that should tell you something considering it was the Xmas period and it's generally expensive). Anyway, I joined the finance practice and the first thing that puzzled me was the amount of (unnecessary) managers present. They had Associate a Directors, TL's, Assistant TL's, Head of Practices', etc. - just ridiculous. They were ALWAYS in meetings but never about anything practical apparently. Training is poor and a first year college student would think of a better training programs. Dragon Den style activities do NOT make you a good recruiter. Pointless presentations on Hydrogen Group as a company is very, very tedious. It was like a massive immature playground. People dressed any way they liked (unsure of what the dress code actually is), took ages on lunch break and some just simply never returned (management never seemed to care but then again they were normally in meetings), the smoking breaks were a massive distraction with people constantly getting up (I'm a smoker and still thought it was ridiculous) and the on boarding is non existent. Once you start, that's it - no more contact with HR until you're leaving I suppose. You're shown your desk, 'team' who are already in a clique and given your log in details. Huge and enviable client list but absolutely no business development is done. In fact, jobs which seemingly do not exist seem to be the ones chased. Witnessed two cases of 'back stabbing' in my ten weeks of employment here. Colleague lost out on a promotion / commission due to someone else claiming her placement (it blatantly wasn't) and the Manager, sorry 'Associate Director', done nothing. Needless to say she quit soon after that. The entire finance practice team from 2015 either left or got fired. I reckon most left and I was the first. Really, really, terrible place to work. I was a young grad on £20k basic salary + benefits but I still felt unemployment would be better than that mess. Advice to Management Honestly? Shut the company down and perhaps rebrand. Hydrogen gives every other decent recruitment business a terrible name. Shady practices, no actual recruitment done, no support, training or guidance and the management do not care what you do as long as you're in the office from 08:30-6pm.", "rating": 1, "pros": "- Location (two minute walk from Monumenf)", "cons": "- Everything.", "advice": "Honestly? Shut the company down and perhaps rebrand. Hydrogen gives every other decent recruitment business a terrible name. Shady practices, no actual recruitment done, no support, training or guidance and the management do not care what you do as long as you're in the office from 08:30-6pm."}, {"title": "Excellent company to work for!", "text": "Pros - Very accommodating for flexible working - Clear vision and actions to support the delivery of that - Supportive both professionally and personally - Fantastic people and culture Cons - Not a defined career pathway for Operations staff however I think this is in the process of being more clearly laid out Advice to Management - Listen to your staff and continue in the direction you are moving in at present. Hydrogen is a great place to work and had it not been for my own personal circumstance, I would have stayed for the next 10 years!", "rating": 5, "pros": "- Very accommodating for flexible working", "cons": "- Not a defined career pathway for Operations staff however I think this is in the process of being more clearly laid out", "advice": "- Listen to your staff and continue in the direction you are moving in at present. Hydrogen is a great place to work and had it not been for my own personal circumstance, I would have stayed for the next 10 years!"}, {"title": "Good Training", "text": "Pros Its a great place to start your career, they have a good training scheme (UK only). They also work with some great clients (UK). There are some good leaders and people that really believe in the brand. Good commission structure Cons - Not much support to international offices - International offices need more senior leadership - Very competitive environment - Salaries could be better - The culture has changed significantly over the past few years", "rating": 3, "pros": "Its a great place to start your career, they have a good training scheme (UK only). They also work with some great clients (UK). There are some good leaders and people that really believe in the brand.", "cons": "- Not much support to international offices", "advice": null}, {"title": "Reputation in Niche markets", "text": "Pros Perseverance, hard work and good work ethics are often noticed and rewarded. Fellow consultants in the office are helpful and cooperative when collaborating. The Operations team is efficient with queries: there is always a solution for any situation. The working environment in Singapore's office allows one to work with different personalities and working styles. Consultants in niche areas are well respected in the industry by clients and candidates. Clients often seek for consultative advice in implementing their own policies. Cons Hours may be longer than usual but nothing unusual in recruitment. Advice to Management Interaction with team managers and consultants are consistent and will help in growth when expectations and deliverables are clearly discussed. Senior management has gone through changes and this can be effective in attracting new aspiring recruiters.", "rating": 5, "pros": "Perseverance, hard work and good work ethics are often noticed and rewarded.", "cons": "Hours may be longer than usual but nothing unusual in recruitment.", "advice": "Interaction with team managers and consultants are consistent and will help in growth when expectations and deliverables are clearly discussed. Senior management has gone through changes and this can be effective in attracting new aspiring recruiters."}, {"title": "Going places", "text": "Pros Great people Excellent vision and action being taken to achieve it Innovative approach to challenges Big adopters of technology Central location Cons Quite long hours and working week Advice to Management Continue doing what you're doing, maintain focus and keep the momentum going.", "rating": 5, "pros": "Great people", "cons": "Quite long hours and working week", "advice": "Continue doing what you're doing, maintain focus and keep the momentum going."}, {"title": "Good grad Job", "text": "Pros Fun, good training Good starter training for anyone entering sales. OK benefits package. Good location. Cons Long hours with average days 8am to 7pm Target driven, with a lot of micro management Management heavy, not always needed. Advice to Management Probably do not need quite so many management layers. Micro management can be burdensome and actually curtail good performance. Should probably cncentrate more on major accounts and delivering for those than constantly starting new business teams.", "rating": 3, "pros": "Fun, good training", "cons": "Long hours with average days 8am to 7pm", "advice": "Probably do not need quite so many management layers."}, {"title": "Hydrogen - Legal Practice", "text": "Pros Coming into the world of recruitment as a \"second jobber\" having worked in law for several years, it would be safe to say that I had my reservations over the sector and was desperate to avoid becoming the stereotypical aggressive headhunt recruiter. I was made assurances from my first interview that Hydrogen's approach is different and that they are doing all that they can to lift the reputation that surrounds recruitment as a whole. Having been here now near on 6 months I am pleased to say that the Hydrogen approach IS different, the need to develop long term relationships with lawyers is their main focus, they work collaboratively with them to plan their careers rather than coercing an individual into an imperfect move to make the quick pound. The approach to training their staff is quite remarkable and I feel armed to discuss the marketplace at length with any type of candidate. The support of the training team and other consultants is always there, with a smile, if you ever feel unsure or need a little help. The ability to earn money is there from the off because of the unique way Hydrogen structures its commission i.e. working with both candidates and clients can make you money. Once training is complete and you begin to work with clients it's also handled incredibly well in that consultants are handed a number or warm clients as well as targets to develop and make their own. Lastly, the culture is a million miles from that of legal practice, which has felt like an incredibly welcome change. The reward culture is high and being made to feel valued has had a surprising effect on my happiness at work. Success is met with congratulations within the team and the competition between staff is healthy and well meaning rather than cut throat. All in all a very positive move Cons The training could possibly be a little more condensed to allow those wanting to progress quickly a bit more of an accelerated process. Some of the consultants need to work on their jokes! Advice to Management Keep it up, Keep rewarding and recognising hard work. Invest in a new coffee machine", "rating": 5, "pros": "Coming into the world of recruitment as a \"second jobber\" having worked in law for several years, it would be safe to say that I had my reservations over the sector and was desperate to avoid becoming the stereotypical aggressive headhunt recruiter. I was made assurances from my first interview that Hydrogen's approach is different and that they are doing all that they can to lift the reputation that surrounds recruitment as a whole.", "cons": "The training could possibly be a little more condensed to allow those wanting to progress quickly a bit more of an accelerated process.", "advice": "Keep it up, Keep rewarding and recognising hard work. Invest in a new coffee machine"}, {"title": "Take it from me...Its all true", "text": "Pros Some good people working there but diminishing rapidly... Cons The reputation went downhill in all aspects once they opened Singapore. Management were more interested in the social culture and would come in weekdays gloating about how many \"girls\" they slept with. If you didn’t drink you didn’t fit in…. The stories you hear in Singapore are totally true and some actions in the office by a particular staff member were an arresting offense. He was never disciplined for his actions. And from this point it went from one disaster to another. You name it.. Hydrogen did it. Guess what Karma has caught up with them and their reputation in Asia is a complete embarrassment….. Shame on the COO. If you value your career in recruitment then stay clear of this company. Plenty of other reputable companies out there… Advice to Management Get rid of the old and bring in some reputable names who can transform the business around. The originals will never gain the respect back and will never make the company a success.in Asia.. Would love to give the CEO a thumbs up just for being a nice guy but eyes were closed for a long time in this part of the world. End the \"lad\" culture before its too late... I couldn't even give it a 1 star for Culture and Values!!!", "rating": 1, "pros": "Some good people working there but diminishing rapidly...", "cons": "The reputation went downhill in all aspects once they opened Singapore. Management were more interested in the social culture and would come in weekdays gloating about how many \"girls\" they slept with. If you didn’t drink you didn’t fit in…. The stories you hear in Singapore are totally true and some actions in the office by a particular staff member were an arresting offense. He was never disciplined for his actions. And from this point it went from one disaster to another. You name it.. Hydrogen did it.", "advice": "Get rid of the old and bring in some reputable names who can transform the business around. The originals will never gain the respect back and will never make the company a success.in Asia.. Would love to give the CEO a thumbs up just for being a nice guy but eyes were closed for a long time in this part of the world. End the \"lad\" culture before its too late... I couldn't even give it a 1 star for Culture and Values!!!"}, {"title": "Hydrogen Group - Life Sciences", "text": "Pros I am a consultant in the Life Sciences practice of 5 months. I have come on with 3 years recruitment experience and was promised in my interview “to look after a warm desk”. The truth about this is that Hydrogen is a major player in the recruitment game, on a global scale. For the first time in my short recruitment career I have transformed from a recruiter into a specialist consultant recruiter, trust me there is a huge difference. // In 5 months I feel totally comfortable in my role – with colleagues, managers and believe it or not my director. Hydrogen is split into a few sectors: Life Sciences, Business Transformation, Finance, Legal, Oil & Gas, Technology & Power – each of these have their own Director. I can’t comment on other senior management but I can certainly approve of the Life Sciences Director, Steph Murtagh who backs every consultant in her team completely (around 25 people – 15 contract recruitment – 10 perm) // So, pro’s of working for Hydrogen? The big one.. Money. Yes, get ready to double your paycheque every six months. It’s ridiculous. The commission’s structure is fantastic. There are incentives for everything to keep on achieving.. With hard work you get rewards. Simple. I’m not unrealistic though I appreciate money doesn’t just fall into your lap – but if you work hard like all Life Sciences do in a year you will be easily on an OTE of £60k/70k+. I’m serious.// Realistic targets – I don’t need to elaborate on this. But the best part is.. in a 1-1 with your manager you can move your KPI targets depending on what you need more focus on (EG. Candidate short market, more candidate calls than manager calls) // Another pro? Location. 2 minute walk from Monument station – tubes are never ‘overally crowded’ on that circle line therefore getting into work is hassle free (but then again, no excuse to be late). // I mentioned earlier transforming from a recruiter into a specialist. I absolutely mean this. If you want to be better, Hydrogen have the tools to make this happen. The team, the connections, the experience, the continual development training, the directors, the investments, the international business trips, the dedication and the time from everyone ensures you can make it as a specialist and get away from being a “high street recruiter” like I used to be. // I genuinely love coming to work. Things are going very well for me and Life Sciences team members. Cons Not every job is perfect. Even more so in a sales environment. We are salespeople and there are cons. // The length of hours. ANYONE in a sales environment should know recruitment is not a 9-5. If you’ve assumed it is, think again. But Hydrogen is notorious for early starts – late finishes. If performance is dropping, hours need to be made. I work a minimum of 10 hours a day, my social life for most week days have gone. // Large divide between the Hydrogen. I mentioned earlier that Hydrogen is split into a few sectors: Life Sciences, Business Transformation, Finance, Legal, Oil & Gas, Technology & Power. I hardly know these people unless they happen to cross my path or I’m located near them in the office. // The coffee machine provides rubbish coffee (we’re next door to Pret though). Advice to Management Read my Pro's. Read my con's. Invest in nicer coffee.", "rating": 5, "pros": "I am a consultant in the Life Sciences practice of 5 months. I have come on with 3 years recruitment experience and was promised in my interview “to look after a warm desk”. The truth about this is that Hydrogen is a major player in the recruitment game, on a global scale.", "cons": "Not every job is perfect. Even more so in a sales environment. We are salespeople and there are cons. //", "advice": "Read my Pro's. Read my con's. Invest in nicer coffee."}, {"title": "Great training and great support", "text": "Pros I joined Hydrogen 3 months ago as a graduate. So far, Hydrogen has delivered excellent training and support on all levels. I would definitely recommend Hydrogen to fellow graduates who are looking to establish a professional career in recruitment. Cons As to be expected with all recruitment jobs, the hours are long. Hard work, however, never goes unnoticed.", "rating": 5, "pros": "I joined Hydrogen 3 months ago as a graduate. So far, Hydrogen has delivered excellent training and support on all levels. I would definitely recommend Hydrogen to fellow graduates who are looking to establish a professional career in recruitment.", "cons": "As to be expected with all recruitment jobs, the hours are long. Hard work, however, never goes unnoticed.", "advice": null}, {"title": "Small Business Mentality driven by egos", "text": "Pros Social Culture being based in the city New CEO Ian is an improvement on previous leadership Nice offices Cons Company feels armature Very judgmental and opinionated leadership team that can sometimes feel unprofessional 'Entitled' culture that is driven from AD level Unprofessional behavior not addressed by business - Consultants behavior out of hand at times and not addressed. Can be hard to take pride in the brand for this reason. Training is basic and more geared towards graduates Advice to Management AD's - Set clear expectation around what success looks like. Less finger pointing and ego driven behavior and instead, work to enhance a culture that brings out the best abilities within employee base.", "rating": 1, "pros": "Social Culture being based in the city", "cons": "Company feels armature", "advice": "AD's - Set clear expectation around what success looks like. Less finger pointing and ego driven behavior and instead, work to enhance a culture that brings out the best abilities within employee base."}, {"title": "Cowboys", "text": "Pros Nope, Can't think of any Cons Shady practices and outright liars", "rating": 1, "pros": "Nope, Can't think of any", "cons": "Shady practices and outright liars", "advice": null}, {"title": "Highly supportive, challenging & fun place to work", "text": "Pros Great people, culture and values Business recognises, rewards and develops talent Hydrogen Group has many successful Practices with market leading propositions Progressive business, open to ideas from people at all levels Very competitive commission structure and benefits Generous incentives Senior management team are visible, knowledgeable and credible Organisation significantly invests into Learning and Development Cons Complacency in some areas impacting results Lack of consequence for under performance Levels of ownership and accountability", "rating": 5, "pros": "Great people, culture and values", "cons": "Complacency in some areas impacting results", "advice": null}, {"title": "Great support and fantastic training", "text": "Pros Having only been at Hydrogen for less than 3 months, my experience here has been nothing but positive. As a graduate, I searched for a company that would provide me with the best training, support and career prospects. Hydrogen has delivered over and above on all 3 counts. There is great support on all levels especially from consultants and team leaders. All in all, Hydrogen has provided me with a great platform to establish a career within recruitment. Cons The hours are long as is to be expected with any recruitment job. However hard work never goes unnoticed or unrewarded.", "rating": 5, "pros": "Having only been at Hydrogen for less than 3 months, my experience here has been nothing but positive. As a graduate, I searched for a company that would provide me with the best training, support and career prospects. Hydrogen has delivered over and above on all 3 counts. There is great support on all levels especially from consultants and team leaders. All in all, Hydrogen has provided me with a great platform to establish a career within recruitment.", "cons": "The hours are long as is to be expected with any recruitment job. However hard work never goes unnoticed or unrewarded.", "advice": null}, {"title": "Great company & culture!", "text": "Pros I have been working for Hydrogen Legal for over 5 years. All the consultants and senior management across the business are always very approachable and helpful. The working environment is buzzy and exciting and I would recommend Hydrogen to anyone who is looking for a career in recruitment! The training across the company is also great! Cons As with most jobs the days are long and given the nature of recruitment you might be in the office early and leave late but all the hard work is always rewarded!", "rating": 5, "pros": "I have been working for Hydrogen Legal for over 5 years. All the consultants and senior management across the business are always very approachable and helpful. The working environment is buzzy and exciting and I would recommend Hydrogen to anyone who is looking for a career in recruitment! The training across the company is also great!", "cons": "As with most jobs the days are long and given the nature of recruitment you might be in the office early and leave late but all the hard work is always rewarded!", "advice": null}, {"title": "Consultant - Finance Practice", "text": "Pros I started as a graduate in the finance practice. As a few contributors have said, at the graduate level, a lot of pressure is put on you to perform. By it's nature recruitment is always going to be sink or swim by nature, I think Hydrogen gave me adequate training and good support from management in order to succeed. I gained a lot of valuable experience at Hydrogen which I know will be dividends in my further career. Cons Very KPI heavy, sometimes to the companies detriment. Whilst it's important that you show that your activity is high I don't always feel that KPIs should be used alone. I'm sure the company would argue that overall performance is taken into account, in actuality statistics are constantly being analysed and questioned. As a well performing consulting I found that my phone times were raised frequently as being too low, a trivial matter when you are billing consistently. Personally I'd rather send out 5 targeted CVs I know will be strong contenders for a role than waste time spraying further CVs and hoping they stick. I think the KPI models suits junior consultants but as you become more experienced the model becomes less relevant.", "rating": 3, "pros": "I started as a graduate in the finance practice. As a few contributors have said, at the graduate level, a lot of pressure is put on you to perform. By it's nature recruitment is always going to be sink or swim by nature, I think Hydrogen gave me adequate training and good support from management in order to succeed.", "cons": "Very KPI heavy, sometimes to the companies detriment. Whilst it's important that you show that your activity is high I don't always feel that KPIs should be used alone. I'm sure the company would argue that overall performance is taken into account, in actuality statistics are constantly being analysed and questioned. As a well performing consulting I found that my phone times were raised frequently as being too low, a trivial matter when you are billing consistently. Personally I'd rather send out 5 targeted CVs I know will be strong contenders for a role than waste time spraying further CVs and hoping they stick. I think the KPI models suits junior consultants but as you become more experienced the model becomes less relevant.", "advice": null}, {"title": "Can be worth a year to get basic training and work ethic but they do not pay well or reward fairly", "text": "Pros I think coming here was useful as you learn how to become successful as a researcher or consultant in highly contingent tough markets, and under the rule of KPI's become very effective and disciplined at hitting your targets. In other words, its good training for life. I made some good friends during my time there. Cons It was quite a depressing place to work at the same time though. People were being fired left right and centre, and morale was low. The emphasis was on KPI's all the time, sending out mass emails to clients/candidates sent a bad message. It was a ruthless place in a lot of respects, and the place was run like a stereotypical big corporation, where your value is as a number compared to anything else. The KPI stick was the only real management tool used, and employees were not encouraged to develop their own styles or ways of working. The closer to being like a computer, the closer to being a robot, the better you were. Advice to Management rip it up and start again and change the name, it hardly runs of the tongue when on the phone.", "rating": 3, "pros": "I think coming here was useful as you learn how to become successful as a researcher or consultant in highly contingent tough markets, and under the rule of KPI's become very effective and disciplined at hitting your targets. In other words, its good training for life.", "cons": "It was quite a depressing place to work at the same time though. People were being fired left right and centre, and morale was low. The emphasis was on KPI's all the time, sending out mass emails to clients/candidates sent a bad message.", "advice": "rip it up and start again and change the name, it hardly runs of the tongue when on the phone."}, {"title": "Work like a dog", "text": "Pros + High energy workplace + Training and upgrading sessions provided Cons - Very, very UK-centric; minimal attempt to assimilate into the local context - Too aggressive and sometimes childish management - More like a Boys Club (based on after-work bonding sessions and in-company conversations) - Average base salary for Locals - No work/life balance Advice to Management - Try to invest in assimilating to the local culture, customs and conditions. What works in UK might not necessarily work in Asia.", "rating": 3, "pros": "+ High energy workplace", "cons": "- Very, very UK-centric; minimal attempt to assimilate into the local context", "advice": "- Try to invest in assimilating to the local culture, customs and conditions. What works in UK might not necessarily work in Asia."}, {"title": "Great place to start within recruitment", "text": "Pros I joined as a graduate on the legal team. Training was very comprehensive and intense but certainly needed! Senior consultants are always ready to answer any questions you may have even though they're constantly busy. Very close knit team and everyone got along really well. Loads of different personalities who somehow all work very well together! Meritocratic environment - if you work hard and deliver results, you will be recognized and earn your well-deserved commission. No one is under any impression that you will earn a huge commission in your first 6 months within legal and they are very encouraging! Very positive environment to be in. Cons Hours are long, but that's standard across recruitment and if you're in a high performing team with loads of clients, you naturally have more work to do. Base salary is a little lower than competitors, but good commission scheme to make up for it. The training experience can vary - I started with two other graduates and had a great time as we collaborated together, but if you start on your own it can be a bit daunting. Advice to Management Keep doing what you're doing. Keep encouraging junior consultants to speak up.", "rating": 5, "pros": "I joined as a graduate on the legal team. Training was very comprehensive and intense but certainly needed! Senior consultants are always ready to answer any questions you may have even though they're constantly busy.", "cons": "Hours are long, but that's standard across recruitment and if you're in a high performing team with loads of clients, you naturally have more work to do.", "advice": "Keep doing what you're doing. Keep encouraging junior consultants to speak up."}, {"title": "Used to be great but lost it's way", "text": "Pros Working with young, likeminded people. Good social scene although there were lots of cliques. Good brands and reputation in some areas and a few talented and experienced consultants that have stayed. Cons Hired some terrible managers with no experience and credibility in their markets. Very KPI driven and the recruitment target became quantity over quality which was not what Hydrogen used to uphold. Poisonous work culture developed with little collaboration between teams which helped develop a paranoid work force and dog eat dog mentality Work life balance awful. Managers didn't listen and were vacant / unapproachable. A real shame as it used to be a great company with a clear vision but lost the plot recently.", "rating": 3, "pros": "Working with young, likeminded people. Good social scene although there were lots of cliques. Good brands and reputation in some areas and a few talented and experienced consultants that have stayed.", "cons": "Hired some terrible managers with no experience and credibility in their markets. Very KPI driven and the recruitment target became quantity over quality which was not what Hydrogen used to uphold. Poisonous work culture developed with little collaboration between teams which helped develop a paranoid work force and dog eat dog mentality Work life balance awful. Managers didn't listen and were vacant / unapproachable. A real shame as it used to be a great company with a clear vision but lost the plot recently.", "advice": null}, {"title": "Happy overall", "text": "Pros Office at good location Nice office Good staff benefits Wonderful colleagues Supportive management Good training and development opportunities Able to learn and grow Open culture Cons Difficult to work with some people Lack of proper communication Advice to Management Listen to what the people commented and continue to do better.", "rating": 5, "pros": "Office at good location", "cons": "Difficult to work with some people", "advice": "Listen to what the people commented and continue to do better."}, {"title": "Don't mind getting up in the morning....", "text": "Pros great company to work for great environment and forward thinking company Benefits are good and career progression is excellent Cons Bonus money not as high has it should be Advice to Management keep doing what you are doing and keep your employees updated with the company's performance", "rating": 5, "pros": "great company to work for", "cons": "Bonus money not as high has it should be", "advice": "keep doing what you are doing and keep your employees updated with the company's performance"}, {"title": "Good company!", "text": "Pros COO in APAC office has a great personality! Energetic. positive and fast paced work environment. Recently there has been more great benefits to be enjoyed by employees. Colleagues are nice and focused on their daily tasks! Good place to be in. Cons May be abit too statistical when comes to sales and KPIs but understandable as that is the nature of the business! Advice to Management So far great work!", "rating": 5, "pros": "COO in APAC office has a great personality! Energetic. positive and fast paced work environment. Recently there has been more great benefits to be enjoyed by employees. Colleagues are nice and focused on their daily tasks! Good place to be in.", "cons": "May be abit too statistical when comes to sales and KPIs but understandable as that is the nature of the business!", "advice": "So far great work!"}, {"title": "Wouldn't recommend if you are experienced", "text": "Pros Not a great place to work, highly KPI focused, logging call hours etc. They hire a lot of graduates in a sink or swim model and the KPIs are probably a great training ground for them however they then use this model for all levels of experience. Cons The hours here are the worst I've ever seen, 7 am start and 7 pm finish. If you have a few years' experience, they don't pay great. £40k cap on a team leader role. there is a 2% team leader team override bonus, you have to also be working as hard as your team even if you have day to day management responsibilities and your relationship with your current contacts will count for nothing. Don't waste your time here unless you want an entry level job. Advice to Management Understand and appreciate your experienced hires, pay market rate, don;'t make false promises on commission. Realise that someone who knows what they are taking about would be able to get a lot more information from a call a lot quicker than a graduate who waffles around the subject.", "rating": 1, "pros": "Not a great place to work, highly KPI focused, logging call hours etc. They hire a lot of graduates in a sink or swim model and the KPIs are probably a great training ground for them however they then use this model for all levels of experience.", "cons": "The hours here are the worst I've ever seen, 7 am start and 7 pm finish. If you have a few years' experience, they don't pay great. £40k cap on a team leader role. there is a 2% team leader team override bonus, you have to also be working as hard as your team even if you have day to day management responsibilities and your relationship with your current contacts will count for nothing. Don't waste your time here unless you want an entry level job.", "advice": "Understand and appreciate your experienced hires, pay market rate, don;'t make false promises on commission. Realise that someone who knows what they are taking about would be able to get a lot more information from a call a lot quicker than a graduate who waffles around the subject."}, {"title": "Avoid.", "text": "Pros The office is in a good location. Cons The company is restructuring in many offices around the world.", "rating": 1, "pros": "The office is in a good location.", "cons": "The company is restructuring in many offices around the world.", "advice": null}, {"title": "Company full of energy", "text": "Pros New CEO Great Offices Brilliant support functions Fun place to work Lots of team events and trips for performers Great energy to the place, very friendly people Cons Hours are a bit long Advice to Management Keep doing what you are doing and be clear about the direction of the company", "rating": 5, "pros": "New CEO", "cons": "Hours are a bit long", "advice": "Keep doing what you are doing and be clear about the direction of the company"}, {"title": "Avoid", "text": "Pros There is really very little I could say was a positive about my experience working at Hydrogen - maybe the location at a push Cons I joined Hydrogen as a graduate in their legal practice and I genuinely can’t offer anything positive on my experience. The team set up/dynamics were really bizarre; although the average age was mid-thirties, the atmosphere was like being back at school. One manager in particular was very quick to offer their opinion on new members of the team as they came and went (predominantly went) often attributing more opinions on the way they looked or dressed than their quality of work. Support from the team was exceptionally poor, you are encouraged to go up to the more senior consultants to ask their advice and arrange times to present on different practices of law to them, but in reality they want absolutely no interaction with you. Everything about the team appeared very false; undeniably the team Bill a lot so if you are there to make money and can tolerate the lack of integrity then maybe it’s for you – although sharing clients with new consultants was not something the team were particularly willing to do. Lots of junior consultants left as the senior consultants already had a monopoly on the market. Working hours are also ridiculous. Advice to Management Look at the quality of people you hire and don’t forget that the legal sector isn’t that big – I would never recommend your services to anyone I know working in a legal capacity", "rating": 1, "pros": "There is really very little I could say was a positive about my experience working at Hydrogen - maybe the location at a push", "cons": "I joined Hydrogen as a graduate in their legal practice and I genuinely can’t offer anything positive on my experience. The team set up/dynamics were really bizarre; although the average age was mid-thirties, the atmosphere was like being back at school. One manager in particular was very quick to offer their opinion on new members of the team as they came and went (predominantly went) often attributing more opinions on the way they looked or dressed than their quality of work. Support from the team was exceptionally poor, you are encouraged to go up to the more senior consultants to ask their advice and arrange times to present on different practices of law to them, but in reality they want absolutely no interaction with you. Everything about the team appeared very false; undeniably the team Bill a lot so if you are there to make money and can tolerate the lack of integrity then maybe it’s for you – although sharing clients with new consultants was not something the team were particularly willing to do. Lots of junior consultants left as the senior consultants already had a monopoly on the market. Working hours are also ridiculous.", "advice": "Look at the quality of people you hire and don’t forget that the legal sector isn’t that big – I would never recommend your services to anyone I know working in a legal capacity"}, {"title": "A good way to start your career in consulting", "text": "Pros Great Learning and Development Opportunities, friendly staff, sociable company, good commission structure Cons Highly pressured environment. Constantly feel like you are being monitored (they monitor call times and number of calls) Advice to Management Continue doing what you're doing, it's very motivational. Maybe ease off on analysing call times and number of calls - I used to email candidates and clients a lot and would get a positive response that way but there was always too much of a focus on my call data.", "rating": 5, "pros": "Great Learning and Development Opportunities, friendly staff, sociable company, good commission structure", "cons": "Highly pressured environment. Constantly feel like you are being monitored (they monitor call times and number of calls)", "advice": "Continue doing what you're doing, it's very motivational. Maybe ease off on analysing call times and number of calls - I used to email candidates and clients a lot and would get a positive response that way but there was always too much of a focus on my call data."}, {"title": "Terrible culture", "text": "Pros Fairly easy to make money. Cons This is the kind of recruitment company which gives the recruitment sector a bad reputation. The amount of people who got fired in my time there was outrageous and the management was almost no existent. The majority of people working there believe they are high flying traders rather than Recruitment Consultants, it was a painful experience. Advice to Management Choose your managers with care and make sure they are getting rid of people for the correct reasons. Remind employees that they are a service provider helping clients find employees.", "rating": 1, "pros": "Fairly easy to make money.", "cons": "This is the kind of recruitment company which gives the recruitment sector a bad reputation. The amount of people who got fired in my time there was outrageous and the management was almost no existent. The majority of people working there believe they are high flying traders rather than Recruitment Consultants, it was a painful experience.", "advice": "Choose your managers with care and make sure they are getting rid of people for the correct reasons. Remind employees that they are a service provider helping clients find employees."}, {"title": "Don't bother..", "text": "Pros The office and it's location is nice (one of the only positive things I can bring myself to say). Operational set up is great but, sadly they get forgotten about too easily when really, they are the driving support behind the sales teams. But it's OK, they get a diabolical bonus if the spend on the annual 5* trip for top billers is slightly lower than the year before. Cons Micro management, lack of support, unrealistic targets and KPI's, \"cut throat\" way of working, childish culture, ops teams aren't looked after nor respected as they should be and poor business decisions are made on a daily basis; apart from pushing that god awful COO out of the door! Advice to Management Remember a business doesn't function nor is it profitable without good people. Invest in them and concentrate on retaining them.", "rating": 1, "pros": "The office and it's location is nice (one of the only positive things I can bring myself to say). Operational set up is great but, sadly they get forgotten about too easily when really, they are the driving support behind the sales teams. But it's OK, they get a diabolical bonus if the spend on the annual 5* trip for top billers is slightly lower than the year before.", "cons": "Micro management, lack of support, unrealistic targets and KPI's, \"cut throat\" way of working, childish culture, ops teams aren't looked after nor respected as they should be and poor business decisions are made on a daily basis; apart from pushing that god awful COO out of the door!", "advice": "Remember a business doesn't function nor is it profitable without good people. Invest in them and concentrate on retaining them."}, {"title": "Good Company", "text": "Pros For over 4+ years I've worked in operations and throughout this time I've seen the company go through a lot of changes. Working in a highly-demanding environment can be stressful, however the comradery I experience within my team makes my job a lot easier and more enjoyable. Recently, ops and sales have been seated together and this is creating a really vibrant working environment. For the first time since I have been here the business feels more like a single unit rather than just ops and sales. It has also increased visibility so it’s nice to put a face to a name, especially with the new starters. Great team manager who is very supportive and doesn't micro-manage. Instead, he allows you to grow professionally by putting trust in your abilities and handling situations by yourself, but is still on hand if support is needed. Overall, I believe the company is improving and with a new CEO it will only get better. Cons Some managers and consultants need to be more accountable and take ownership of there work. Instead of pointing fingers and passing blame, perhaps they should adopt ‘the buck stops with me’ attitude. Operations is equally as important as the sales teams, however more recognition is needed from senior management. Operations has a number of strong workers with big ideas, but the company isn't recognising this fact. Advice to Management Listen to all levels of staff. Identify a channel that staff can communicate their ideas to senior management for consideration.", "rating": 5, "pros": "For over 4+ years I've worked in operations and throughout this time I've seen the company go through a lot of changes.", "cons": "Some managers and consultants need to be more accountable and take ownership of there work. Instead of pointing fingers and passing blame, perhaps they should adopt ‘the buck stops with me’ attitude.", "advice": "Listen to all levels of staff. Identify a channel that staff can communicate their ideas to senior management for consideration."}, {"title": "8 months in and loving it!", "text": "Pros I joined the legal team at Hydrogen last year, after my gap year, and I've never looked back. Everyone is really friendly and my team are so so lovely. The training was intense but I can definitely see why it is award winning. The commission scheme is excellent, as you get commission when sourcing candidates for other consultants, as well as gaining commission for your own deals. The social events and incentives are so much fun and its a lovely culture here. Cons sad to have seen some lovely people leave over my time here!", "rating": 5, "pros": "I joined the legal team at Hydrogen last year, after my gap year, and I've never looked back. Everyone is really friendly and my team are so so lovely. The training was intense but I can definitely see why it is award winning. The commission scheme is excellent, as you get commission when sourcing candidates for other consultants, as well as gaining commission for your own deals. The social events and incentives are so much fun and its a lovely culture here.", "cons": "sad to have seen some lovely people leave over my time here!", "advice": null}, {"title": "A company built on empty promises", "text": "Pros Modern office - fantastic considering you spend most of your life there Cons Work life balance is non-existent. An 'every man for himself' environment.", "rating": 1, "pros": "Modern office - fantastic considering you spend most of your life there", "cons": "Work life balance is non-existent. An 'every man for himself' environment.", "advice": null}, {"title": "Rec Con", "text": "Pros Joined early 2013, young,vibrant culture! really driven team, and some very good managers and directors Cons If all is going well, Senior staff take to much of a step back and miss out some people cruising through the job due to other peoples good work Advice to Management The biggest billee does not make the best manager", "rating": 3, "pros": "Joined early 2013, young,vibrant culture! really driven team, and some very good managers and directors", "cons": "If all is going well, Senior staff take to much of a step back and miss out some people cruising through the job due to other peoples good work", "advice": "The biggest billee does not make the best manager"}, {"title": "Great", "text": "Pros Great Environment, good commission scheme and loyal client base. Cons The job is overall very good, however the hours are long and can be often difficult to keep up with life outside of work.", "rating": 5, "pros": "Great Environment, good commission scheme and loyal client base.", "cons": "The job is overall very good, however the hours are long and can be often difficult to keep up with life outside of work.", "advice": null}, {"title": "Consultant", "text": "Pros A lot of long standing consultants and some very successful teams. Good atmosphere and commitment and a very mature environment when it comes to working attitude. Management seem to care a lot about success of individuals and the company. Cons Working hours are longer than most companies. A 10 hour day as standard means any chance to have a social life after work is very limited. One of the pros of the company is the mature attitude to work. This means that people will and do stay late when required but when your hours are already to 6.30pm staying late can easily mean eating dinner at 9.30-10pm. It will lead to burnout and it's an easy sell for our competitors looking to poach good consultants. Advice to Management Cut the working hours by an hour per day and trust that the people you have hired want to be successful and will put the work in that is necessary. This will reward people with the freedom to enjoy a work like life balance and not feel like they live in the office when the work is mounting up.", "rating": 3, "pros": "A lot of long standing consultants and some very successful teams. Good atmosphere and commitment and a very mature environment when it comes to working attitude. Management seem to care a lot about success of individuals and the company.", "cons": "Working hours are longer than most companies. A 10 hour day as standard means any chance to have a social life after work is very limited. One of the pros of the company is the mature attitude to work. This means that people will and do stay late when required but when your hours are already to 6.30pm staying late can easily mean eating dinner at 9.30-10pm. It will lead to burnout and it's an easy sell for our competitors looking to poach good consultants.", "advice": "Cut the working hours by an hour per day and trust that the people you have hired want to be successful and will put the work in that is necessary. This will reward people with the freedom to enjoy a work like life balance and not feel like they live in the office when the work is mounting up."}, {"title": "Moving on Up", "text": "Pros Great team members! working with senior members of the team to help understand the market better showing what you can achieve here at Hydrogen. The training has also been excellent, from our learning and development team to members of my individual team helping you identify ways to improve to ensure a clear career progression is put in place... in a fun but hard-working environment! Cons Past experience, some management decisions were questionable, and therefore I felt I was maybe kept 'in the dark' about what was happening but after some internal moves we seem to be moving in the right direction! eg.. monthly wrap ups within the team informing all team members what is happening not only in individual teams but also within the whole company. Advice to Management Keep everyone up to date with what is happening within the Company and after Cancun can NewYork be the next incentive?! :)", "rating": 5, "pros": "Great team members! working with senior members of the team to help understand the market better showing what you can achieve here at Hydrogen. The training has also been excellent, from our learning and development team to members of my individual team helping you identify ways to improve to ensure a clear career progression is put in place... in a fun but hard-working environment!", "cons": "Past experience, some management decisions were questionable, and therefore I felt I was maybe kept 'in the dark' about what was happening but after some internal moves we seem to be moving in the right direction! eg.. monthly wrap ups within the team informing all team members what is happening not only in individual teams but also within the whole company.", "advice": "Keep everyone up to date with what is happening within the Company and after Cancun can NewYork be the next incentive?! :)"}, {"title": "Very Good Company!", "text": "Pros I honestly do not get the bad reviews! I've worked at Hydrogen for 4 years and I can say its honestly a very good place to work. Sure a lot has changed but everything that has changed has been for the best. The company clearly has a vision and is doing everything to support the staff to be as successful as they can be. Ian Temple (CEO) is often walking the sales floor paying an interest in how things are going and being very approachable for advice. The work mentality is mature, not forcing KPI’s down people’s throats but supporting and trusting in you to do well. I have had one of the best quarters I’ve had in 4 years and looking around so have a lot of other consultants. I’ve also recently enjoyed another quarterly top billers lunch, which was a brilliant afternoon out of the office. This was something I achieved through the companies recognition of my work outside of billing, such as; winning new clients and helping train some of the junior consultants. I’ve also been promoted and I know I am not alone as there are constant stories of promotions, showing that there are huge opportunities here. I work amongst some of the best consultants I’ve seen in my career, and the culture is just as good as it was when I first joined in June 2011. There is a really healthy competitive environment, not only in my team and practice but across all practices. In 4 years, I’ve made a lot of friends and many are still here. I am choosing to stay because I believe in the direction of Hydrogen and so far I can 100% say that I made the right decision. Cons There are no real major cons at Hydrogen, as many of the experienced consultants who have joined us often say that they wouldn't work any where else and I think that says a lot. If I have to make a comment then I’d say that Hydrogen’s previous grad schemes’ basic pay weren't something to scream about. But, it’s up to you to put your head down and grab the opportunities when they are presented to you. Advice to Management Encourage more cross business integration through mentoring across all practice areas.", "rating": 5, "pros": "I honestly do not get the bad reviews! I've worked at Hydrogen for 4 years and I can say its honestly a very good place to work. Sure a lot has changed but everything that has changed has been for the best. The company clearly has a vision and is doing everything to support the staff to be as successful as they can be. Ian Temple (CEO) is often walking the sales floor paying an interest in how things are going and being very approachable for advice. The work mentality is mature, not forcing KPI’s down people’s throats but supporting and trusting in you to do well. I have had one of the best quarters I’ve had in 4 years and looking around so have a lot of other consultants. I’ve also recently enjoyed another quarterly top billers lunch, which was a brilliant afternoon out of the office. This was something I achieved through the companies recognition of my work outside of billing, such as; winning new clients and helping train some of the junior consultants. I’ve also been promoted and I know I am not alone as there are constant stories of promotions, showing that there are huge opportunities here. I work amongst some of the best consultants I’ve seen in my career, and the culture is just as good as it was when I first joined in June 2011. There is a really healthy competitive environment, not only in my team and practice but across all practices.", "cons": "There are no real major cons at Hydrogen, as many of the experienced consultants who have joined us often say that they wouldn't work any where else and I think that says a lot. If I have to make a comment then I’d say that Hydrogen’s previous grad schemes’ basic pay weren't something to scream about. But, it’s up to you to put your head down and grab the opportunities when they are presented to you.", "advice": "Encourage more cross business integration through mentoring across all practice areas."}, {"title": "A great home for ambitious recruitment professionals", "text": "Pros Entrepreneurial spirit. Management are not afraid to really back top performers and a completely meritocracy culture. Highly rate new CEO Client and candidate focused and not KPI for KPI sake Good commission structure for high performance Strong team ethic and very little ego centric recruiters Great fun. Various incentives, people generally make close friends during their time here and it is in general a very welcoming and warm company Cons CRM still needs a lot of tweaking Senior management trying to change / implement too many things at once with little follow up or purpose Lack of structured personal development plans, especially for experienced staff Advice to Management Focus on what you are good at Listen and ask the right questions to all levels of staff Further investment into marketing and L&D Be harder on disengaged employees", "rating": 5, "pros": "Entrepreneurial spirit. Management are not afraid to really back top performers and a completely meritocracy culture.", "cons": "CRM still needs a lot of tweaking", "advice": "Focus on what you are good at"}, {"title": "Senior Consultant", "text": "Pros Hard cold calling training methods. Cons Reading all the positive reviews below definitely made me laugh, I can assure you that all of those were 100% fabricated. If you want a honest review the one titled 'the truth' is as close as the truth gets. I've worked for them for 3 years and they are very notorious in the local market for having a very laddish culture. When the boys first started out, monday morning meetings included how many girls they could sleep with over the weekend and never had any respect for any of the other girls in the office. Instead of mouthing off everyone who has left the business they have yet to realise that the reason for such high turnovers have been their internal culture itself. Some of their consultants could have gotten in trouble with the law for the kind of things that they did. However, in true Hydrogen style they've closed both eyes as these consultants were their favourites. In short, I would rather be jobless than to have anything to do with them again. Advice to Management You need to respect consultants, not put up with bad behaviour and actually do something to stop the toxic culture.", "rating": 1, "pros": "Hard cold calling training methods.", "cons": "Reading all the positive reviews below definitely made me laugh, I can assure you that all of those were 100% fabricated. If you want a honest review the one titled 'the truth' is as close as the truth gets.", "advice": "You need to respect consultants, not put up with bad behaviour and actually do something to stop the toxic culture."}, {"title": "A company with structure and vision. Great workplace!", "text": "Pros I was headhunted into Hydrogen. What impressed me from day one was that unlike the other recruitment companies I have worked for, Hydrogen did not oversell and underdeliver. It was rather the opposite. They have stuck to their word and from day 1 they have worked with me towards achieving my career goals. This is a highly ethical recruitment business with structure and vision and although we may make some mistakes, they are always for the better. When I look at some of the cowboys out there, it makes me feel proud I work for Hydrogen. Cons Working hours are longer than industry standard. Advice to Management Put more team based incentives in place.", "rating": 5, "pros": "I was headhunted into Hydrogen. What impressed me from day one was that unlike the other recruitment companies I have worked for, Hydrogen did not oversell and underdeliver. It was rather the opposite. They have stuck to their word and from day 1 they have worked with me towards achieving my career goals.", "cons": "Working hours are longer than industry standard.", "advice": "Put more team based incentives in place."}, {"title": "Great place to work", "text": "Pros Outstanding culture - even on the worst days (which are rare) I enjoy coming to work here. My colleagues are friendly, supportive, and generally good fun to be around Good commission scheme for strong performers, and a totally transparent formula so you always know where you stand Good reputation in the market and generally one of the more successful agencies in our sector Hydrogen was my first \"proper\" job after university, and it's allowed me to build the foundations for what I hope will be a successful career, and earn great money while I'm still young enough to enjoy it, and buy my own flat in London within 3 years of joining Cons Basic salaries are on the low side, however the strong commission scheme more than makes up for this Advice to Management The company has gone through a few changes over the last few months, but stick with it and help us to move forwards. Try not to lose the culture and feel that makes this such a great company to work for.", "rating": 5, "pros": "Outstanding culture - even on the worst days (which are rare) I enjoy coming to work here. My colleagues are friendly, supportive, and generally good fun to be around", "cons": "Basic salaries are on the low side, however the strong commission scheme more than makes up for this", "advice": "The company has gone through a few changes over the last few months, but stick with it and help us to move forwards."}, {"title": "Excellent company with great opportunity", "text": "Pros - Great talent across all teams - Lots of backing for growth, development and to develop your desk - Tight teams - Some very positive changes recently in senior management - I have been here for over a year now and I can honestly say joining Hydrogen has been a great decision Cons - It's sad to see that there are consultants in the company that do not appreciate the opportunity on offer Advice to Management - Very pleased with the new CEO!", "rating": 5, "pros": "- Great talent across all teams", "cons": "- It's sad to see that there are consultants in the company that do not appreciate the opportunity on offer", "advice": "- Very pleased with the new CEO!"}, {"title": "Avoid this place!", "text": "Pros Good company culture - fun work environment Cons Middle management have no clue what they are doing! Managers are not trained on people management and have no ability to lead and motivate a team. 'Team Leaders' and 'Directors' are completely incompetent and quite frankly, a bit of a joke. The place is falling apart from the top down and should be avoided at all costs. Long hours mean you are constantly drained, 8.30am - 6.30pm is far higher than industry average! Advice to Management Quit", "rating": 1, "pros": "Good company culture - fun work environment", "cons": "Middle management have no clue what they are doing! Managers are not trained on people management and have no ability to lead and motivate a team. 'Team Leaders' and 'Directors' are completely incompetent and quite frankly, a bit of a joke. The place is falling apart from the top down and should be avoided at all costs. Long hours mean you are constantly drained, 8.30am - 6.30pm is far higher than industry average!", "advice": "Quit"}, {"title": "Great opportunity (for those who want it)", "text": "Pros - Taking ownership of your own work is encourage, leading to the opportunity to develop accounts - Strong team culture and friendly environment - Fair holiday allowance (increasing with service) - Support and advice available when required - Good Learning & Development Manager who is very approachable and creates bespoke course on request - Clear communication from Senior Management - Great environment to learn - Ethical workplace - Comfortable chairs! Cons - Database compliance can be slack, more onus should be placed on consultants to keep up to date - Contracted working hours are the longest I've come across in the industry Advice to Management - More focus on team based incentives", "rating": 5, "pros": "- Taking ownership of your own work is encourage, leading to the opportunity to develop accounts", "cons": "- Database compliance can be slack, more onus should be placed on consultants to keep up to date", "advice": "- More focus on team based incentives"}, {"title": "Tough times, but coming back stronger", "text": "Pros There have been a number of changes at the company over the past 12 months, but this has created a much leaner company full of top quality recruiters with clear career paths in an environment which offers numerous opportunities as the company is now in heavy growth mode. It now has the right people in the right roles (the new CEO is a breath of fresh air), in the right markets and has embarked on it's next stage of development. IF you've got the stomach for it, you will fly. Cons The environment has become more demanding now as the quality and results per head has increased. Not a place for someone who wants to hide. Also, not for the change-averse. Hydrogen will make the changes they feel need to be made. Advice to Management Keep the promises made to your employees and the results will continue to improve", "rating": 5, "pros": "There have been a number of changes at the company over the past 12 months, but this has created a much leaner company full of top quality recruiters with clear career paths in an environment which offers numerous opportunities as the company is now in heavy growth mode.", "cons": "The environment has become more demanding now as the quality and results per head has increased. Not a place for someone who wants to hide.", "advice": "Keep the promises made to your employees and the results will continue to improve"}, {"title": "Great place to work.", "text": "Pros Culture. Training. Commission. Opportunities. Location. Cons Lazy people who insist on trying to drag the company down. Advice to Management Train all teams like legal train.", "rating": 5, "pros": "Culture. Training. Commission. Opportunities. Location.", "cons": "Lazy people who insist on trying to drag the company down.", "advice": "Train all teams like legal train."}, {"title": "brilliant. best time of my life", "text": "Pros culture is fantastic. everyone is encouraging of each other. training is the best for starting a career in recruitment. Cons none none none none none Advice to Management CEO needs to step down and let the COO take over", "rating": 5, "pros": "culture is fantastic. everyone is encouraging of each other. training is the best for starting a career in recruitment.", "cons": "none none none none none", "advice": "CEO needs to step down and let the COO take over"}, {"title": "Team Leader", "text": "Pros Some great people and good incentives Cons Literally falling apart from the top down with only junior staff left. Advice to Management Sell", "rating": 1, "pros": "Some great people and good incentives", "cons": "Literally falling apart from the top down with only junior staff left.", "advice": "Sell"}, {"title": "Forward Thinking", "text": "Pros Ambitious, professional, good L and D in APAC, innovative.. It's a fast paced environment and is a fair business to work for. They have navigated difficult change recently very well. Cons Lacking sometimes on the communication side of things but this has improved. Can be a bit pressured. That said they are moving to a more consultative approach Advice to Management Raise the communications. Don't be shy about the achievements this company has made", "rating": 5, "pros": "Ambitious, professional, good L and D in APAC, innovative..", "cons": "Lacking sometimes on the communication side of things but this has improved. Can be a bit pressured. That said they are moving to a more consultative approach", "advice": "Raise the communications. Don't be shy about the achievements this company has made"}, {"title": "Don't listen to the moaners - Decent working experience, company going somewhere at last", "text": "Pros Commission scheme colleagues working culture is now much better, they are really making much effort to improve this Opportunity to earn high commission if you working hard The company is on a real good journey and doing well in the market Cons Poor IT / database gets annoying sometimes", "rating": 5, "pros": "Commission scheme", "cons": "Poor IT / database gets annoying sometimes", "advice": null}, {"title": "Fun place to work!", "text": "Pros dynamic, professional, fun, ambitious, growing, open. Company is evolving and going through growing pains to do better. Cons process, communications, training, employee engagement, plc. Advice to Management - improve operations and business processes - timely update and comms from senior leadership team - more regular trainings session to upskill consultants - improve employee engagement", "rating": 5, "pros": "dynamic, professional, fun, ambitious, growing, open. Company is evolving and going through growing pains to do better.", "cons": "process, communications, training, employee engagement, plc.", "advice": "- improve operations and business processes"}, {"title": "Recruitment Consultant (Singapore)", "text": "Pros - Opportunities to think for yourself, be entrepreneurial and get rewarded for it - After a a few wobbles, now a great culture with everyone here focused on getting on, providing an excellent service and making good commission - Strong management team who provide real leadership who are not afraid to make changes (particularly here in APAC) Cons - The IT systems are poor although not so bad it really slows you down - Basic salaries are not that great, however the commission scheme is excellent so if you don't back yourself to be a strong sales person then best not apply (but if you do, then do!) Advice to Management Admit the recruitment system installed last year is not (yet) fit for purpose and spend the money in getting a project team to sort it out.", "rating": 5, "pros": "- Opportunities to think for yourself, be entrepreneurial and get rewarded for it", "cons": "- The IT systems are poor although not so bad it really slows you down", "advice": "Admit the recruitment system installed last year is not (yet) fit for purpose and spend the money in getting a project team to sort it out."}, {"title": "Good vehicle - bad drivers", "text": "Pros Strong CRM system which they spent a lot of money on & incentive trips. Cons Management is poor. Lack of tangible interaction with the staff. Expect you to make money, rather than help you to develop, learn and be successful. Not a meritocracy. Advice to Management Get your hands dirty, be involved with the staff at all levels. Show integrity. A total reshuffle could do the trick.", "rating": 3, "pros": "Strong CRM system which they spent a lot of money on & incentive trips.", "cons": "Management is poor. Lack of tangible interaction with the staff. Expect you to make money, rather than help you to develop, learn and be successful. Not a meritocracy.", "advice": "Get your hands dirty, be involved with the staff at all levels. Show integrity. A total reshuffle could do the trick."}, {"title": "Enjoyable experience so far...", "text": "Pros Good work culture Teams all get along well Good training structure Cons Long hours so can be poor work/life balance Some teams seem to have much better training in place than others.", "rating": 5, "pros": "Good work culture", "cons": "Long hours so can be poor work/life balance", "advice": null}, {"title": "Do not work here.", "text": "Pros Nothing that makes me think positively. Cons Bad culture, lacking in direction, managers were not ready to be leaders, employees were treated as a money making machines, not a healthy environment to work. Advice to Management Managers in APAC need to be changed. COO needs to step down.", "rating": 1, "pros": "Nothing that makes me think positively.", "cons": "Bad culture, lacking in direction, managers were not ready to be leaders, employees were treated as a money making machines, not a healthy environment to work.", "advice": "Managers in APAC need to be changed. COO needs to step down."}, {"title": "The Truth", "text": "Pros Scratch Pros and replace with Cons. Clear that previous \"positive\" posts are written by current management and fake/two faced followers trying to make themselves feel better. The truth is, it all went down the drain when the few office employees thought they were the \"Goldman Sachs\" of recruitment and neglected to create a \"brand\" that was unique. Constant mouthing off on Leavers of the company and betting on New Joiners and how long they going to last for instead of focussing on what really needed to be addressed - to remove the poison that has not started within the lower ranks but from management and up. Professionalism does not exist and here they preach on \"we are a listed company\" Dung beetles would love rolling around in this. This would be a Pro: \"In this local setting, its simply a web of lies, overall human capital sweatshop office for 1 dollar fifty\" Don't bother answering that email sitting in your inbox saying \"Great Opportunity\" \"Career Opportunity\" or any of the cliché titles. Just click, drag and dump into trash where it belongs. Cons It is against the law to leave on time in this environment. Even if you do, mouthing off happens when your back is turn. Many have compared the \"Culture\" as genocide, Civil unrest/war. Enough is enough, this is not a game, these are people's lives. Just drop the act, clean it up and wave the white flag while you have some tiny bit of dignity. You might end up getting a sliver of respect that is left on the streets. Advice to Management There really needs to be a setting where employees are able to speak their minds and provide possible advice that could benefit and/or transform the office. Whatever is mentioned or said, is mentally recorded and used against you. This Good cop, Bad cop scenario only applies to immature individuals that \"get off\" thinking they control the floor. If the office was to be compared to a computer, there are just too many viruses contaminating the rest. Either it needs to be completely cleaned out or just shut the office down. Period.", "rating": 1, "pros": "Scratch Pros and replace with Cons. Clear that previous \"positive\" posts are written by current management and fake/two faced followers trying to make themselves feel better. The truth is, it all went down the drain when the few office employees thought they were the \"Goldman Sachs\" of recruitment and neglected to create a \"brand\" that was unique. Constant mouthing off on Leavers of the company and betting on New Joiners and how long they going to last for instead of focussing on what really needed to be addressed - to remove the poison that has not started within the lower ranks but from management and up. Professionalism does not exist and here they preach on \"we are a listed company\" Dung beetles would love rolling around in this. This would be a Pro: \"In this local setting, its simply a web of lies, overall human capital sweatshop office for 1 dollar fifty\" Don't bother answering that email sitting in your inbox saying \"Great Opportunity\" \"Career Opportunity\" or any of the cliché titles. Just click, drag and dump into trash where it belongs.", "cons": "It is against the law to leave on time in this environment. Even if you do, mouthing off happens when your back is turn. Many have compared the \"Culture\" as genocide, Civil unrest/war. Enough is enough, this is not a game, these are people's lives. Just drop the act, clean it up and wave the white flag while you have some tiny bit of dignity. You might end up getting a sliver of respect that is left on the streets.", "advice": "There really needs to be a setting where employees are able to speak their minds and provide possible advice that could benefit and/or transform the office. Whatever is mentioned or said, is mentally recorded and used against you. This Good cop, Bad cop scenario only applies to immature individuals that \"get off\" thinking they control the floor. If the office was to be compared to a computer, there are just too many viruses contaminating the rest. Either it needs to be completely cleaned out or just shut the office down. Period."}, {"title": "Someone please help me! Get me out of here!", "text": "Pros you would want to be on a lot of cocaine to fill this section out. Cons no direction or leadership from management. strategy from the top down is a mystery. salary is flirting with 3rd World territory. and the comms may as well be paid in string. turnover has new meaning here. staff retention statistics would be a funny read. 57 people since i started. there are no ethics in their provision of a service. the job feels like being paid to annoy and harass people rather than improve their careers or the efficiency of the managers we claim to support and \"partner\" with. the word relationship is thrown around like pennys at homeless people. and the belief that we are providing solutions rather than a glorified theft is bewildering to most people - let alone the ones who work here and have university educations. Advice to Management consider criminal activity or the black market - you have an unused talent there.", "rating": 1, "pros": "you would want to be on a lot of cocaine to fill this section out.", "cons": "no direction or leadership from management.", "advice": "consider criminal activity or the black market - you have an unused talent there."}, {"title": "Ambitious young and energetic", "text": "Pros Great chance and opportunity to grow your recruitment experience. Great incentives trips. Managers trains and advices new recruiters during probation periods to speed up their development. Cons Benefits are not the same globally, unlike their incentives. Lack of staff retention programmes. Need to address employee engagement activities so consultants are able to work well together. Advice to Management Look at staff retention and thought leadership pieces.", "rating": 5, "pros": "Great chance and opportunity to grow your recruitment experience. Great incentives trips. Managers trains and advices new recruiters during probation periods to speed up their development.", "cons": "Benefits are not the same globally, unlike their incentives. Lack of staff retention programmes. Need to address employee engagement activities so consultants are able to work well together.", "advice": "Look at staff retention and thought leadership pieces."}, {"title": "Company fell apart in 2014. CEO should resign to let a more capable Leader take over", "text": "Pros Not many! So many good people got out last year when it became clear that the senior management team had lost the plot and started panicking with mass redundancies and a soviet style purge of management Cons Crap IT really makes it hard to do the job properly. Database a total joke really difficult to find CV's on and lots of your colleagues out to rob you of jobs if you're not on the ball. Advice to Management CEO should resign. His style of management is out of date and limiting to the business. Senior management should get out of the 4th floor bunker and start leading on the floor again!", "rating": 3, "pros": "Not many! So many good people got out last year when it became clear that the senior management team had lost the plot and started panicking with mass redundancies and a soviet style purge of management", "cons": "Crap IT really makes it hard to do the job properly. Database a total joke really difficult to find CV's on and lots of your colleagues out to rob you of jobs if you're not on the ball.", "advice": "CEO should resign. His style of management is out of date and limiting to the business. Senior management should get out of the 4th floor bunker and start leading on the floor again!"}, {"title": "Horrendous company and share price reflects it", "text": "Pros nothing good comes from working in this company unless you like working with mindless leaders Cons it is obvious the recent positive reviews in March are from top management in APAC. (Seems like they have more time writing reviews to save themselves and their mindlessness over running a company properly) You get better commission structure from competitors with a share price that isn't plummeting since 2012. Advice to Management remove the APAC senior person, it is time for him to go.", "rating": 1, "pros": "nothing good comes from working in this company unless you like working with mindless leaders", "cons": "it is obvious the recent positive reviews in March are from top management in APAC. (Seems like they have more time writing reviews to save themselves and their mindlessness over running a company properly)", "advice": "remove the APAC senior person, it is time for him to go."}, {"title": "Don't waste your time", "text": "Pros Nice office A lot of banter (if you're with in crowd) Big company, well known brand Cons Don't expect any real training Clique culture (in crowds & outsiders) Commission structure isn't great Failed promises Low basic pay Advice to Management Improve the commission structure Set out a training programme", "rating": 3, "pros": "Nice office", "cons": "Don't expect any real training", "advice": "Improve the commission structure"}, {"title": "Was great in the beginning, went rapidly down hill.", "text": "Pros Well known brand name in the market (not necessarily always for the right reasons.) Good team members so made the day easier to get through, young environment so a laugh. Cons Terrible pay and commission, everyone fudges the system to get paid because no one is rewarded!! No training because they fired the great L&D team, in addition to majority of management due to loss of profits. Promises that they can never keep which resulted in the business losing a whole sales floor of staff!! Rogue management who think they know everything but cannot crack into clients at all and have no track record of delivery. Management are always on meetings trying to make it look like they are \"strategizing\" when in fact it was probably a crisis meeting due to poor performance. Very reactive business model, chase business with no former relationships just hoping that they can deliver. Like working in the old times, cold BD calls and relationships that have been lost because the senior people in the business were replaced with new directors didn't follow up and do the most obvious thing in recruitment. Couldn't attract any experienced hires or staff because of the poor reputation in the Recruitment world. Treated like a lapdog and even if you are billing, always continuously going on about KPI's rather than rewarding the people who deliver. Incentives were pathetic and unrealistic and always the same people on them. Lot of politics that the management cannot handle, ruined brand name because they stayed at a standstill whilst competition furthered their expertise Advice to Management Don't hire just graduates because it is cheaper, they expect people to train the grads but also do a 360 billing role as well when there isn't enough time for this. Senior Management who have so much experience in the market should get involved into breaking down doors for new clients rather than just moaning about non delivery and sitting drinking coffee doing nothing! Almost guaranteed that the business will shut down or go bust!", "rating": 1, "pros": "Well known brand name in the market (not necessarily always for the right reasons.)", "cons": "Terrible pay and commission, everyone fudges the system to get paid because no one is rewarded!! No training because they fired the great L&D team, in addition to majority of management due to loss of profits. Promises that they can never keep which resulted in the business losing a whole sales floor of staff!!", "advice": "Don't hire just graduates because it is cheaper, they expect people to train the grads but also do a 360 billing role as well when there isn't enough time for this."}, {"title": "Rewards high performers very well.", "text": "Pros Fantastic rewards and incentives for high performers including a clear un-capped commission scheme. Most of my colleagues and I get on very well and I would consider them to be friends. Good opportunities for career progression from graduate level to team leader and above. Structured and thorough training at the junior level. Very supportive of flexible working arrangements for proven high performers. Cons Lack of consistency between what good looks like between different areas. Some parts of the business seem to tolerate low performance and lack of bilings/delivery and this can negatively impact the whole business. Advice to Management Keep incentivising your high performers and don't tolerate lack of performance just to keep someone in their seat.", "rating": 5, "pros": "Fantastic rewards and incentives for high performers including a clear un-capped commission scheme. Most of my colleagues and I get on very well and I would consider them to be friends. Good opportunities for career progression from graduate level to team leader and above. Structured and thorough training at the junior level. Very supportive of flexible working arrangements for proven high performers.", "cons": "Lack of consistency between what good looks like between different areas. Some parts of the business seem to tolerate low performance and lack of bilings/delivery and this can negatively impact the whole business.", "advice": "Keep incentivising your high performers and don't tolerate lack of performance just to keep someone in their seat."}, {"title": "Stay Away", "text": "Pros None - They have no commitments to any employee, you are seen as a lapdog and expected to work day and night for no extra money Cons Everything from IT to the coffee machine breaking Advice to Management They have started to make the right moves but may be too little too late.", "rating": 1, "pros": "None - They have no commitments to any employee, you are seen as a lapdog and expected to work day and night for no extra money", "cons": "Everything from IT to the coffee machine breaking", "advice": "They have started to make the right moves but may be too little too late."}, {"title": "Awful recruitment firm", "text": "Pros None none none none none Cons juvenile culture, middle management have no people skills, quick quid culture, little or no client development Advice to Management give up", "rating": 1, "pros": "None none none none none", "cons": "juvenile culture, middle management have no people skills, quick quid culture, little or no client development", "advice": "give up"}, {"title": "Something to avoid", "text": "Pros Some brand has left in the name - that is all really. Good location also - in the City. They talk a good story which could last 1-2 years depending on team/manager. Cons Dog eats dog culture. Management - senior and middle alike are absolute amateurs. Their total inability to manage people, encourage favoritism, unprofessional often very selfish behaviour. Totally oblivious to the changes in the market - still emphasising on hard sales culture, cold calling and stupid incentives. Base salary, commission, overall benefits - all poor for rather long hours. Advice to Management All senior management must resign - they are incapable of managing themselves let alone the company.", "rating": 1, "pros": "Some brand has left in the name - that is all really.", "cons": "Dog eats dog culture.", "advice": "All senior management must resign - they are incapable of managing themselves let alone the company."}, {"title": "Enjoyable place to work and moving in the right direction", "text": "Pros My experience of the business has been really positive and I genuinely enjoy being at work. The company has grown quickly over the last couple of years and the culture is evolving with this growth which I feel is positive and necessary but I know some people have sruggled to adjust to this change. Having worked in a large recruitment agency it is refreshing to work somewhere where you ideas are taken on board and you feel less of a number and more valued within the organisation. Friendly and approachable senior management Black and white commission structure Nice balance of work hard and play hard culture Best training I have seen in recruitment Good reputation on the market place Strong business relationships and PSL's in place. Cons Need to continue to recruit strong people to move the business forwards.", "rating": 5, "pros": "My experience of the business has been really positive and I genuinely enjoy being at work. The company has grown quickly over the last couple of years and the culture is evolving with this growth which I feel is positive and necessary but I know some people have sruggled to adjust to this change. Having worked in a large recruitment agency it is refreshing to work somewhere where you ideas are taken on board and you feel less of a number and more valued within the organisation.", "cons": "Need to continue to recruit strong people to move the business forwards.", "advice": null}, {"title": "An out of control Sixth Form, with too much money and cocaine.", "text": "Pros Assuming you made friends with the right people, Hydrogen can offer a good social environment. Many of the existing employees are in cliques, with new-comers rarely welcomed. Basic salary is poor and the ability to bill can be difficult if you are on a new business desk. Cons Basic salary is poor and the ability to bill can be difficult if you are on a new business desk. People can get away with murder with HR very rarely, if ever, informed of the goings on in this zoo-like call centre. Advice to Management Take control of your staff.", "rating": 1, "pros": "Assuming you made friends with the right people, Hydrogen can offer a good social environment. Many of the existing employees are in cliques, with new-comers rarely welcomed.", "cons": "Basic salary is poor and the ability to bill can be difficult if you are on a new business desk.", "advice": "Take control of your staff."}, {"title": "Miserable working culture; young uneducated dimwits running the show", "text": "Pros -Good Database -Non-management level colleagues -Some good perks - if they actually follow through with their promises Struggling to find more pros I'm afraid. Basic advice - don't work for this company. Cons -Horrific working environment; nothing you do is ever enough, extremely stressful even if you are doing well -Highly political -Long hours with no flexibility -Appalling commission structure -Low salaries -Very little training for junior consultants -Greedy, egotistical team leaders -Money grabbing CEO and MDs -Management is a joke. Most of the seniors got promoted simply because they moved over when they set up the office, not because they have ever produced anything. Most of them don't even have basic intelligence -Favoritism - some make it to the top because they are friends with the boss, even if they are stepping over colleagues who have more than proved their worth -Untrustworthy - watch out for their contract. They don't have to pay you your hard earned commission if they don't want to! Advice to Management Treat your staff like human beings and not just money making machines.", "rating": 1, "pros": "-Good Database", "cons": "-Horrific working environment; nothing you do is ever enough, extremely stressful even if you are doing well", "advice": "Treat your staff like human beings and not just money making machines."}, {"title": "Was good when I was there!", "text": "Pros \"Be the best\" culture transparent career progression ability to get market share quickly Some very high performing teams - best I've seen in recruitment Cons Very KPI focused business, often distracting from quality changed strategy too frequently Teams didnt work the well together, but relationship function was addressing that Advice to Management Get the old trainers back - they made us better recruiters then the competition, the \"in house\" training was too standard with the rest of the industry. Hire better quality - like when the company was Finance Professionals and Project Partners ect, and far less average grads.", "rating": 3, "pros": "\"Be the best\" culture", "cons": "Very KPI focused business, often distracting from quality", "advice": "Get the old trainers back - they made us better recruiters then the competition, the \"in house\" training was too standard with the rest of the industry."}, {"title": "Started out great - went rapidly down hill", "text": "Pros When I joined I was attracted by the passion and energy of the directors. Good brand ad high growth. Cons It soon became apparent that unless you were one on the old faces (i.e. been there from the beginning) you had no hope of being recognised, whatever your results were. There was a core group of managers that had the ear of certain directors who would throw you under a bus at the first opportunity to make themselves look good. Not what I expected from a PLC. Then came the change (which was needed) but the person making the decisions had no guts and just kept the same poisoned leadership team in place. If you talk about change and opportunity, at least make honest changes rather than pandering to certain people - its so obvious!!! Glad to have moved on. Advice to Management Be honest and make decision for the business rather than ones to please the old timers and friends of the CEO", "rating": 1, "pros": "When I joined I was attracted by the passion and energy of the directors. Good brand ad high growth.", "cons": "It soon became apparent that unless you were one on the old faces (i.e. been there from the beginning) you had no hope of being recognised, whatever your results were. There was a core group of managers that had the ear of certain directors who would throw you under a bus at the first opportunity to make themselves look good. Not what I expected from a PLC. Then came the change (which was needed) but the person making the decisions had no guts and just kept the same poisoned leadership team in place. If you talk about change and opportunity, at least make honest changes rather than pandering to certain people - its so obvious!!! Glad to have moved on.", "advice": "Be honest and make decision for the business rather than ones to please the old timers and friends of the CEO"}, {"title": "Great for someone starting in recruitment but definitely not for the long term.", "text": "Pros - Good starter training. - Enjoyable culture if you like to party. - Something to get your foot in the door. Cons - You are just a number; no one cares about your progression as long as you're billing. - Terrible management. - Salary is poor for the considerable amount of hours. - Favouritism is high; sleep with a manager and you will progress to consultant level/senior consultant!", "rating": 1, "pros": "- Good starter training.", "cons": "- You are just a number; no one cares about your progression as long as you're billing.", "advice": null}, {"title": "Extremely horrible working culture", "text": "Pros Good learning ground, good database system Cons Hydrogen Singapore: It's all about sending spec CVs to clients. Management does not bother to understand their staff on an individual basis. Everything is about KPIs KPIs KPIs. The attrition rate is very high and the management does not look into it as the common believe is that only the fittest will survive and the weak will leave. You are constantly expected to be on the phone and lunch for an hour is frowned upon. Good sales people are promoted as managers and most of the time these are young aggressive boys who have no management skills whatsoever. Advice to Management Look into your working culture. Start a warm and friendly culture. Get more locals to start managing or hire good local talent. You are in Asia not in UK!", "rating": 3, "pros": "Good learning ground, good database system", "cons": "Hydrogen Singapore:", "advice": "Look into your working culture. Start a warm and friendly culture. Get more locals to start managing or hire good local talent. You are in Asia not in UK!"}, {"title": "Recruitment consultant", "text": "Pros Strong brand in some practices - well networked, great reputation for being specialist and delivering. This gives a strong platform for new joiners. The commission structure has some mixed reviews but I tend to find the people who say it's terrible are those who are not performing to the right standard. Having researched into the market, most competitors are very ambiguous as to what you will receive commission wise and it's quite often at the discretion of their managers whereas at Hydrogen it's very transparent with even calculators so you can see what you earn each quarter. Great incentives - if you work hard and perform well you really do reap the benefits. Cons There has been a lot of change - most of it necessary - but the communication from the leadership teams has been dreadful at times which often leads to gossip which spreads like wildfire. It's hard to do a commission scheme where one size fits all - in some areas it can feel easier to make money. New hires are often not up to scratch - overconfident and never deliver. Need a better screening process.", "rating": 5, "pros": "Strong brand in some practices - well networked, great reputation for being specialist and delivering. This gives a strong platform for new joiners.", "cons": "There has been a lot of change - most of it necessary - but the communication from the leadership teams has been dreadful at times which often leads to gossip which spreads like wildfire.", "advice": null}, {"title": "Going... Going... Gone.", "text": "Pros Started off ok last year but novelty wore off very quickly. Great people to work with. If I didn't have this I'd have left 6 months ago. Very relaxed compared with other businesses. Thanks honestly about it. Cons Where do I start. Upper Management are seemingly all idiots. Culture has turned to crap. Salaries are diabolical (I earn less than minimum wage you would do better as a cleaner.) Comission is shocking, completely geared against new starters. You have to \"pay\" for the cost of your seat, so no commission on anything under £10,000. Likely % are about 5-10 after that which is low compared with others. CEO doesn't seem to really know what's happening on the ground. Vision is just a load of smoke Stuffing \"values\" down our throats. Little to no contact between disciplines. Other people always screwing up other people's clients, lost key business as a result. The list goes on.... I would not advice starting here. You'd do much better trying to jump in at the deep end elsewhere. Advice to Management Actually listen to what is happening. Sort out the crap commission structure & pay people a wage that is in line the market average.", "rating": 3, "pros": "Started off ok last year but novelty wore off very quickly.", "cons": "Where do I start.", "advice": "Actually listen to what is happening. Sort out the crap commission structure & pay people a wage that is in line the market average."}, {"title": "Hydrogen has huge potential", "text": "Pros Hydrogen has the right foundations in place to be really successful now that we have undergone a period of change and transition. We had some great characters here but it was too much of a fun place to be and had only a handful of really successful and driven consultants and leaders. We, in recent months appear to have grown up and fingers crossed will see more high earners and leaders develop in the future. I am excited to see how we look this time next year. Cons People have to genuinely want it and expectations need to be exceeded not just met so it concerns me that some people being lazy will delay this change happening quick enough to keep the good people interested. Advice to Management Get out more and be inspirational.", "rating": 5, "pros": "Hydrogen has the right foundations in place to be really successful now that we have undergone a period of change and transition. We had some great characters here but it was too much of a fun place to be and had only a handful of really successful and driven consultants and leaders. We, in recent months appear to have grown up and fingers crossed will see more high earners and leaders develop in the future. I am excited to see how we look this time next year.", "cons": "People have to genuinely want it and expectations need to be exceeded not just met so it concerns me that some people being lazy will delay this change happening quick enough to keep the good people interested.", "advice": "Get out more and be inspirational."}, {"title": "Do not join and if you are in H2 leave for better options!", "text": "Pros Some of the people are ok Cons Low % model, stack them high and sell them cheap model, which means very low earnings for consultants coupled with very long hours. Several examples of woman sleeping there way to the top. Very much a blame culture. Most of the people who work there are either completely untrustworthy or a green at the gills grad. They claim to be what they are not, specialist, expert and thriving.", "rating": 3, "pros": "Some of the people are ok", "cons": "Low % model, stack them high and sell them cheap model, which means very low earnings for consultants coupled with very long hours. Several examples of woman sleeping there way to the top. Very much a blame culture. Most of the people who work there are either completely untrustworthy or a green at the gills grad. They claim to be what they are not, specialist, expert and thriving.", "advice": null}, {"title": "Recruitment Consultant", "text": "Pros Good training. Perfect for a first experience in recruitment. Cons Big variations from A team to another in terms of management. No real long term vision and strategic imput in the work done. Agressive approach to recruitment. Advice to Management More wore on the merit of a consultative approach to recruitment and try to get rid of wrong managers", "rating": 3, "pros": "Good training. Perfect for a first experience in recruitment.", "cons": "Big variations from", "advice": "More wore on the merit of a consultative approach to recruitment and try to get rid of wrong managers"}, {"title": "Disappointing and unsupported", "text": "Pros Brand Colleagues Office is nice Great location Good clients Very relaxed work environment I'm honestly struggling to meet the 20 word minimum for the pros side of things Cons Commission structure Basic salary Salary is less than minimum wage and doesn't even pay my living costs even after a year here They fired half my team All the top billers left Stranded in a slow market with little guidance Company feels like it is dying or will restructure to a much smaller size Advice to Management Try and understand what the employees need and support that. Power points with baseless targets help no one.", "rating": 3, "pros": "Brand", "cons": "Commission structure", "advice": "Try and understand what the employees need and support that. Power points with baseless targets help no one."}, {"title": "Steadily going downhill", "text": "Pros Colleagues, Good brand, Location, Training Cons Low pay Work-life balance/flexibility Commission structure Promotion structure uninspiring No individual treatment Ask for help and don't get it Advice to Management Instead of losing consultants to competitors, retain them by showing them their value in the business. A one size fits all approach does not work with regards to promotions etc, good billers are not necessarily good leaders and if you were more supportive you could unlock much more potential with the staff you have rather than letting them go elsewhere and then spending time and money on recruiting again", "rating": 3, "pros": "Colleagues, Good brand, Location, Training", "cons": "Low pay", "advice": "Instead of losing consultants to competitors, retain them by showing them their value in the business. A one size fits all approach does not work with regards to promotions etc, good billers are not necessarily good leaders and if you were more supportive you could unlock much more potential with the staff you have rather than letting them go elsewhere and then spending time and money on recruiting again"}, {"title": "Politically driven work environment with incompetent senior management...", "text": "Pros Opportunities to move into other departments, good training, newly modernised office, charity work, nice people (though dwindling in numbers), lovely and motivating CEO though he needs to brush up on his internal comms skills (he declared his admiration for Margerat Thatcher at a company meeting once). Cons Political environment, unethical decision making, unprofessional staff, senior management have little variety in their experience (and it shows), senior management are more concerned with their egos and not other people's careers, consultants are followers of the lad bible, rude MDs, sociopathic Ops leaders. Advice to Management Eat some humble pie. The competition is eating you alive and the solution starts with great leaders. Billing insane amounts of money does not make a good leader. Experience, emotional intelligence and refined talent does.", "rating": 3, "pros": "Opportunities to move into other departments, good training, newly modernised office, charity work, nice people (though dwindling in numbers), lovely and motivating CEO though he needs to brush up on his internal comms skills (he declared his admiration for Margerat Thatcher at a company meeting once).", "cons": "Political environment, unethical decision making, unprofessional staff, senior management have little variety in their experience (and it shows), senior management are more concerned with their egos and not other people's careers, consultants are followers of the lad bible, rude MDs, sociopathic Ops leaders.", "advice": "Eat some humble pie. The competition is eating you alive and the solution starts with great leaders. Billing insane amounts of money does not make a good leader. Experience, emotional intelligence and refined talent does."}, {"title": "Hydrogen is still a great place to work", "text": "Pros - Fantastic people, a vibrant high performing culture with some excellent leaders in certain Practices. - Unrivalled commission scheme where high performers are frequently earning + £30k per quarter - Fantastic training and support for new starters - Hard working consultants who are driven to succeed and progress - Ambitious strategy and clear direction of where the company is going Cons Hydrogen has recently undergone a restructure which has probably caused a bit of uncertainty. However, It’s been the right decision for the business and should have a positive impact in the medium term. Every organisation goes through something like this very couple of years. Advice to Management Approach promotions consistently and fairly and continue to reward high performance. In the past I feel we've been too tolerant of mediocre performance.", "rating": 5, "pros": "- Fantastic people, a vibrant high performing culture with some excellent leaders in certain Practices.", "cons": "Hydrogen has recently undergone a restructure which has probably caused a bit of uncertainty. However, It’s been the right decision for the business and should have a positive impact in the medium term. Every organisation goes through something like this very couple of years.", "advice": "Approach promotions consistently and fairly and continue to reward high performance. In the past I feel we've been too tolerant of mediocre performance."}, {"title": "Really good experience thus far", "text": "Pros Upon finishing university, I had no idea what I wanted to do. In an ideal world, I would have entered academia. However, the anaemic pay and poor working conditions (even at many top universities) were enough to put me off this route. Unlike most of my university friends who chose banking, consultancy, the Big 4 and law conversions, I really had no interest in pursuing these options either. I found them generic (and still do). So, it was by complete chance that I applied to Hydrogen. As luck would have it, I couldn't have picked a better place to start my career. Instead of dull and menial tasks, I felt like I was given responsibility from the very beginning. In fact, every month at Hydrogen thus far has been a great learning curve. I work with some great colleagues. They're supportive, witty and, most importantly, work hard. I'm constantly given new targets and regularly receive feedback from my management team. As a result, I know exactly where I am in terms of my progression and what I should be doing in order to improve. I've learned that time-management is key to everything and to keep pushing even when you feel you're getting nowhere. Compared to my friends in larger corporates, I know that I've learned a lot more and have actually enjoyed the content of my work. Will I stay at Hydrogen forever? Who knows, but I do think the company has a great culture and an ambitious vision of what it wants to be. So, to conclude, I'm happy with my time here. Cons There needs to be more emphasis on people using the Hub. Too often candidates are added and left completely or partially unskilled (having said that, the Hub training is pretty comprehensive and organised). More company-wide competitions to encourage a sales culture should take place. If people have to hit certain KPIs, for example, then this should be more standardised i.e. everyone HAS to make 40 calls per day irrespective of your practice. I find the cultures between various desks and practices vary quite a lot. Some desks and practices are great. Some have really good team leaders and a mature atmosphere. Others, however, do not. Advice to Management Don't forget that the growth of APAC is also due to the economic growth of many emerging markets. It's no surprise that we're experiencing a boom there due to the disparity in talent between home-grown recruitment firms, with far less experience and capital, compared to foreign recruitment firms, like ourselves. Get your act together when it comes to taking new consultants onboard. The gap between one consultant and the next is, at times, ridiculous. Be as picky with the sourcing of our consultants as we are with the sourcing of our candidates. Much more discrepancy is needed when trying to find consultants who actually have a decent work-ethic and who can quickly understand what their candidates do. Get rid of certain team leaders. Far too many loud-mouthed consultants seem to have been promoted to positions of authority purely because they've billed respectably for a few quarters. Fortunately, my team leader is more mature, has a lot of experience and commands respect because he's actually good at managing people. However, this does not seem to be a company-wide phenomenon.", "rating": 5, "pros": "Upon finishing university, I had no idea what I wanted to do. In an ideal world, I would have entered academia. However, the anaemic pay and poor working conditions (even at many top universities) were enough to put me off this route. Unlike most of my university friends who chose banking, consultancy, the Big 4 and law conversions, I really had no interest in pursuing these options either. I found them generic (and still do).", "cons": "There needs to be more emphasis on people using the Hub. Too often candidates are added and left completely or partially unskilled (having said that, the Hub training is pretty comprehensive and organised).", "advice": "Don't forget that the growth of APAC is also due to the economic growth of many emerging markets. It's no surprise that we're experiencing a boom there due to the disparity in talent between home-grown recruitment firms, with far less experience and capital, compared to foreign recruitment firms, like ourselves."}, {"title": "Good at first but the company has completely changed and is a poor example of a business and treats employees badly", "text": "Pros Good training and very good Learning and Development team. Good clients - however these clients are starting to see the negatives to doing business with Hydrogen and are choosing other recruitment companies as their preferred partner. I am hearing a lot of negative feedback from key clients, some now refusing to ever work with Hydrogen again because of their approach. Cons The company cannot stick to a vision and do not manage people or create and implement strategies well. The company is very divisional, with each practice area working independently to one another (for example Finance, Law or Oil & Gas). The company has grown too quickly and made many mistakes in terms of structuring and developing teams. They also seem to be confused as to which markets they are entering, with no clear direction or focus. This is poor from a client and candidate perspective (not to mention employee) because Hydrogen are claiming to be experts in things areas they no nothing about. Hydrogen used to be a lovely place, great culture, good consultants and managers, but the turnover is so high that this has completely changed and none of the great people want to stick around for long. This is because of the poor management, poor opinions from industry, poor career progression and also very low salaries compared to market average. The problem seems to be that Hydrogen management are trying to create a 'quick fix' to a financial problem that has been worsening for some time due to running the business badly and growing too quickly in an unsuccessful way. This quick fix is all about money and Hydrogen are forgetting that clients will be around for much longer, they all talk, and the bigger picture is not being considered. All this company look for is where is the next deal? & why are you not working with a particular account? They then bulldoze in without thinking of the client or the candidate - just trying to make quick money, a very unintelligent approach and a poor service to the client. It is not a pleasant place to work and it is somewhere I am very ashamed to be a part of. Advice to Management If you want a quick fix to sell the business- then fair enough. However, if you want a business that is successful in the longer term then you really must re-address everything that is being done, and make better informed, more careful business choices. Don't take my word for it, I urge you to ask clients and candidates what their impression is and I am confident my above comments will be echoed.", "rating": 1, "pros": "Good training and very good Learning and Development team. Good clients - however these clients are starting to see the negatives to doing business with Hydrogen and are choosing other recruitment companies as their preferred partner. I am hearing a lot of negative feedback from key clients, some now refusing to ever work with Hydrogen again because of their approach.", "cons": "The company cannot stick to a vision and do not manage people or create and implement strategies well. The company is very divisional, with each practice area working independently to one another (for example Finance, Law or Oil & Gas). The company has grown too quickly and made many mistakes in terms of structuring and developing teams. They also seem to be confused as to which markets they are entering, with no clear direction or focus. This is poor from a client and candidate perspective (not to mention employee) because Hydrogen are claiming to be experts in things areas they no nothing about. Hydrogen used to be a lovely place, great culture, good consultants and managers, but the turnover is so high that this has completely changed and none of the great people want to stick around for long. This is because of the poor management, poor opinions from industry, poor career progression and also very low salaries compared to market average. The problem seems to be that Hydrogen management are trying to create a 'quick fix' to a financial problem that has been worsening for some time due to running the business badly and growing too quickly in an unsuccessful way. This quick fix is all about money and Hydrogen are forgetting that clients will be around for much longer, they all talk, and the bigger picture is not being considered. All this company look for is where is the next deal? & why are you not working with a particular account? They then bulldoze in without thinking of the client or the candidate - just trying to make quick money, a very unintelligent approach and a poor service to the client. It is not a pleasant place to work and it is somewhere I am very ashamed to be a part of.", "advice": "If you want a quick fix to sell the business- then fair enough. However, if you want a business that is successful in the longer term then you really must re-address everything that is being done, and make better informed, more careful business choices. Don't take my word for it, I urge you to ask clients and candidates what their impression is and I am confident my above comments will be echoed."}, {"title": "Was a good company back in the day........", "text": "Pros - Track records in their core markets - Good database - Global company - Supports charities Cons - NO work-life balance - Low salaries; much lower than most - NO benefits at all - Management by fear - 'One size fits all' metrics - Immature Team Leaders (A good recruiter isn't necessarily a good leader by definition) - Sterile offices with a Clean Desk policy (you have to pack your desk every single day) - Cheesy training (but their Workshops are good) Advice to Management It had a good environment back in the day but the atmosphere deteriorated over time. It was a competent team of recruiters and that's why I joined them. I felt overwhelmed to make a move out of the company due to some poor decisions the management team made. One was about the commission structure which was poorly handled. They changed it and told us about it 20 days after they implemented it. If anything, it should have been announced 3 months BEFORE the implementation. Then we had a massive exodus of Perm Consultants- no surprises there. They changed it back eventually, but the point is that if that has changed the way it did, ANYTHING else could change overnight in that company. My main advice to the management is to start looking after the staff and stop lying to yourselves with your \"Best companies to work for\" accolades. It means nothing and can be easily fabricated/manipulated. Another advice I wanted to give is for Mr Smeaton as he's been applying a lot of pressure on teams and consultants to make money at all costs and we can't even take your full 1hr lunch break sometimes. All that stress and fear so he can boast about his helicopter and mansion.. Not cool!", "rating": 3, "pros": "- Track records in their core markets", "cons": "- NO work-life balance", "advice": "It had a good environment back in the day but the atmosphere deteriorated over time. It was a competent team of recruiters and that's why I joined them."}, {"title": "Churn & burn seems to be management's motto", "text": "Pros Good location, global company, great l&d and ops teams - that's about as far as the pros go. Cons I joined Hydrogen after graduating. The sell is that it's a quick fire way for graduates to earn a fair bit of money with uncapped commission, work in a dynamic, vibrant environment where you work hard play hard with clear opportunities for progression. Unfortunately, not one bit of this sell is true. There is no work/life balance - standard hours are 8.30am - 6.30pm on paper but realistically that's 8am post 7pm most days of the week. Some practices also impose compulsory longer hours if you aren't reaching your targets. Salaries are very poor compared to competitors as is commission structure. Leadership appears to be quite poor across the practices. Within my practice area I felt there was a real lack of professionalism from team leaders who were quick to offer their opinions on more junior members of the practice. There's very little loyalty in the business but at the very least you should expect that your team leader values the work you are doing and the contribution you are making to their pay package every month (team leaders all get a percentage of their consultants' commission...) opposed to voicing their personal opinion on individuals. It felt like being back in high school and it's generally a very unpleasant environment to work inl! It also meant there was a constant atmosphere within the teams. Advice to Management Start reviewing team leadership and holding team leaders accountable for their team's performance (as well as their attitudes) instead of getting rid of more junior members of the team just because on paper they may seem easier to replace. Retention rate is terrible (8 people left our team over the last 5 months and that's just one of many in the London office!).", "rating": 1, "pros": "Good location, global company, great l&d and ops teams - that's about as far as the pros go.", "cons": "I joined Hydrogen after graduating. The sell is that it's a quick fire way for graduates to earn a fair bit of money with uncapped commission, work in a dynamic, vibrant environment where you work hard play hard with clear opportunities for progression. Unfortunately, not one bit of this sell is true. There is no work/life balance - standard hours are 8.30am - 6.30pm on paper but realistically that's 8am post 7pm most days of the week. Some practices also impose compulsory longer hours if you aren't reaching your targets. Salaries are very poor compared to competitors as is commission structure. Leadership appears to be quite poor across the practices. Within my practice area I felt there was a real lack of professionalism from team leaders who were quick to offer their opinions on more junior members of the practice. There's very little loyalty in the business but at the very least you should expect that your team leader values the work you are doing and the contribution you are making to their pay package every month (team leaders all get a percentage of their consultants' commission...) opposed to voicing their personal opinion on individuals. It felt like being back in high school and it's generally a very unpleasant environment to work inl! It also meant there was a constant atmosphere within the teams.", "advice": "Start reviewing team leadership and holding team leaders accountable for their team's performance (as well as their attitudes) instead of getting rid of more junior members of the team just because on paper they may seem easier to replace. Retention rate is terrible (8 people left our team over the last 5 months and that's just one of many in the London office!)."}, {"title": "Please never work here", "text": "Pros The training is good and if you're good then you can make good money. However the pros don't go any further than that... Cons Endless, the pay is really bad, much below market rates. The commission is average. The atmosphere is awful, you are treated like a child, the senior management are really terrible. Total lack on transparency and decisions are just announced out of the blue without any consultation. The very top have been there for years and totally forgotten how to consult and take on any advice.. Advice to Management You are all terrible at your jobs - you should resign Especially the very top - totally incompetent", "rating": 1, "pros": "The training is good and if you're good then you can make good money. However the pros don't go any further than that...", "cons": "Endless, the pay is really bad, much below market rates. The commission is average. The atmosphere is awful, you are treated like a child, the senior management are really terrible. Total lack on transparency and decisions are just announced out of the blue without any consultation. The very top have been there for years and totally forgotten how to consult and take on any advice..", "advice": "You are all terrible at your jobs - you should resign"}, {"title": "Contractors (under NO circumstances work through this bunch) !!!!", "text": "Pros Absolutely nothing from my perspective. Staff appear harassed and incompetent - and those are I assume the good ones! Cons Broken promises from consultants, phone callers never returned, numerous cases of \"I'll look into it and come straight back to you\" and then nothing happens. Took 3 weeks to on board me! And then they have the cheek to pay contractors monthly not weekly in arrears! A month after contract finished I am STILL owed nearly £5k, and despite promises that it will be chased and looked into - NOTHING! Next call will be to my solicitors! Advice to Management Get a grip, fire them all and start again!", "rating": 1, "pros": "Absolutely nothing from my perspective. Staff appear harassed and incompetent - and those are I assume the good ones!", "cons": "Broken promises from consultants, phone callers never returned, numerous cases of \"I'll look into it and come straight back to you\" and then nothing happens. Took 3 weeks to on board me! And then they have the cheek to pay contractors monthly not weekly in arrears! A month after contract finished I am STILL owed nearly £5k, and despite promises that it will be chased and looked into - NOTHING! Next call will be to my solicitors!", "advice": "Get a grip, fire them all and start again!"}, {"title": "There are better agencies out there... Don't get fooled into joining them.", "text": "Pros - Good location in the City - Good training - OK work environment Cons - Extra long work hours, longer than in other agencies, i.e. 8:15am to 6:30pm. They force you to come in early, even though it is not stated in your contract of employment and you cannot argue with this! - Weak commission scheme, way below market average, meaning you will get less money for the same amount of work anywhere else. - They say that they offer plenty of benefits, but in reality they only real benefit is a 15% discounted gym membership. - Awful CRM system that they invested a lot of money into, but in reality it is completely worthless, badly configured and makes your work much harder, allowing your competition to overtake you in sourcing for candidates. - CLEAR DESK policy (!), which means that every single day you have to completely clear your desk and leave it empty and every morning set everything back up again. The office is plain and has no personality. - The work environment, even though social is very immature. The average age of consultants at Hydrogen is 20-22 years of age, straight from Uni. This kind of environment might not be for everyone. - In regards to the type of people who work here... If you are an avid fan of TOWIE and fake tans, you will most likely fit in well in this office, otherwise stay clear. Advice to Management What I wrote in my pros and cons section should point out areas of improvement, right?", "rating": 3, "pros": "- Good location in the City", "cons": "- Extra long work hours, longer than in other agencies, i.e. 8:15am to 6:30pm. They force you to come in early, even though it is not stated in your contract of employment and you cannot argue with this!", "advice": "What I wrote in my pros and cons section should point out areas of improvement, right?"}, {"title": "Consultant at Hydrogen for 1+ year", "text": "Pros good location in the city, some great people who are very good at what they do, good training Cons poor management, very poor communication, constant change, success very dependent on business area allocated to, poor company culture", "rating": 3, "pros": "good location in the city, some great people who are very good at what they do, good training", "cons": "poor management, very poor communication, constant change, success very dependent on business area allocated to, poor company culture", "advice": null}, {"title": "Good company, great vision", "text": "Pros - Great training, and they pride themselves on it - Management understand where the company's heading, and consequently, what they want out of their team - Good atmosphere - Incentives clearly spelled out so you know exactly what you have to do to achieve in the job Cons - Little work/life balance, but that's pretty common in that industry - Management sometimes do not listen to idea's from lower levels as much as they could do", "rating": 5, "pros": "- Great training, and they pride themselves on it", "cons": "- Little work/life balance, but that's pretty common in that industry", "advice": null}, {"title": "Review", "text": "Pros Good office location in the City Cons Political structure, in-experienced consultants, poor inter-personal skills of senior management", "rating": 1, "pros": "Good office location in the City", "cons": "Political structure, in-experienced consultants, poor inter-personal skills of senior management", "advice": null}, {"title": "An out of control Sixth Form, with too much money and cocaine.", "text": "Pros - The social side of this company are a highlight - Employees are all of a similar age Cons - Constant threat of being sacked - 12 hour days are a minimum - Heavily criticised for taking sick days - Poor pay - School playground behaviour on the office floor Advice to Management The place is a zoo.", "rating": 1, "pros": "- The social side of this company are a highlight", "cons": "- Constant threat of being sacked", "advice": "The place is a zoo."}, {"title": "Trainee consultant", "text": "Pros In the city, nice restaurants around Cons Very non chalet approach to employee needs Advice to Management Listen to employees more", "rating": 3, "pros": "In the city, nice restaurants around", "cons": "Very non chalet approach to employee needs", "advice": "Listen to employees more"}, {"title": "Shocking Management Thinking, and Confusing Messaging", "text": "Pros - Some good colleagues - Central work location Cons - Half an hour job induction - No proper training even after 2 weeks in the job. You learn from handouts. - Very process oriented. Risk of getting sacked even after you bring in a new client after 2 weeks in the job without proper training, just because you don't make enough calls. - Singapore office generates a lot of negative vibes. - Long work hours with poor base salary. Advice to Management They should be more clear on what is important. Making deals or making calls.", "rating": 1, "pros": "- Some good colleagues", "cons": "- Half an hour job induction", "advice": "They should be more clear on what is important. Making deals or making calls."}, {"title": "Good Company ... but lots of pressure", "text": "Pros - Young, dynamic environment - Buzzing atmosphere - Good incentives - Strong social aspects - Great training - Good team spirit - Some excellent managers & directors who keep you motivated in the right way and are keen to see you develop your skills Cons - Work-life balance is poor - Long hours, expected to come in early, work late AND work through luch - Office conditions weren't great: cramped, untidy, really hot or really cold, bit bleak in general - Some of the management team could be improved - i.e. some are far too pushy & don't listen to you - Salary and benefits aren't great - Not open to you having time off for sickness (I took 1 day during my year there and got shamed in front of the team!) Advice to Management Hydrogen have a really good foundation and many positive aspects. You strive to be competitive which is essential in the recruitment industry, but sometimes this pushes your employees slightly too far. Management need to listen to their teams a bit more and understand that working 24/7 with intense pressure is going to push people to the edge. I would recommend Hydrogen to others.", "rating": 5, "pros": "- Young, dynamic environment", "cons": "- Work-life balance is poor", "advice": "Hydrogen have a really good foundation and many positive aspects. You strive to be competitive which is essential in the recruitment industry, but sometimes this pushes your employees slightly too far. Management need to listen to their teams a bit more and understand that working 24/7 with intense pressure is going to push people to the edge."}, {"title": "Nice people and good training.", "text": "Pros Training is thorough and well coordinated. Cons High turnover of staff, disappointing commission structure and some team leaders are poor.", "rating": 3, "pros": "Training is thorough and well coordinated.", "cons": "High turnover of staff, disappointing commission structure and some team leaders are poor.", "advice": null}, {"title": "Good graduate opportunity", "text": "Pros Friendly team, good pay, quick start Cons Entry not so competitive, but a good start", "rating": 5, "pros": "Friendly team, good pay, quick start", "cons": "Entry not so competitive, but a good start", "advice": null}, {"title": "Good Training, not a place you want to stay too long", "text": "Pros Training is excellent with 1 full week given to sales skills Good location in the City of London Young employees, great social culture after work Cons Some Managers leave a lot to be desired Constant threats that someone in the team is going to be sacked Very long hours and shocking base salary, especially when compared to competition Lots of broken promises Advice to Management Lead by example rather than just by time spent at the company. Support junior consultants in a better manner.", "rating": 3, "pros": "Training is excellent with 1 full week given to sales skills", "cons": "Some Managers leave a lot to be desired", "advice": "Lead by example rather than just by time spent at the company. Support junior consultants in a better manner."}, {"title": "Excellent place to learn the trade, earn good wedge, but dont drink the cool aid for too long!", "text": "Pros Training, pay is competitive, speed at which you can progress Cons They are good at dangling the carrot of progression and keeping you just wanting more. If you are young you can stay a little too long. Advice to Management Keep on doing as you are doing, but like all recruiters you need to keep the senior management happy, also there is a lot of low hanging fruit in more senior placements if some the TL's/Managers were braver to call an MD or SVP.", "rating": 5, "pros": "Training, pay is competitive, speed at which you can progress", "cons": "They are good at dangling the carrot of progression and keeping you just wanting more. If you are young you can stay a little too long.", "advice": "Keep on doing as you are doing, but like all recruiters you need to keep the senior management happy, also there is a lot of low hanging fruit in more senior placements if some the TL's/Managers were braver to call an MD or SVP."}, {"title": "Excellent chance to earn big money but an old boys network when It came to promotions!", "text": "Pros Good brand in certain markets, Potential to earn six figure salary within one year (pharma & oil and gas teams only), good back office. Cons old boys network, no supposed 'glass ceiling', whispering gossip culture. slow with bonus payments. Advice to Management offer the people who deserve promotions rather than give promotions out to mates and to move yourself higher. This created a feeling of discontent within many teams.", "rating": 3, "pros": "Good brand in certain markets, Potential to earn six figure salary within one year (pharma & oil and gas teams only), good back office.", "cons": "old boys network, no supposed 'glass ceiling', whispering gossip culture. slow with bonus payments.", "advice": "offer the people who deserve promotions rather than give promotions out to mates and to move yourself higher. This created a feeling of discontent within many teams."}, {"title": "Andersoortige omgeving, energetisch!", "text": "Pros Cultuur is anders en iedereen is behulpzaam. Culture is different and everyone is helpful Cons Niets op het moment, alles is nog steeds goed. none at the moment, everything is still good", "rating": 5, "pros": "Cultuur is anders en iedereen is behulpzaam.", "cons": "Niets op het moment, alles is nog steeds goed.", "advice": null}]