[{"title": "Great opportunities to learn and achieve but no long-term prospects", "text": "Pros Staff is excellent; learn from and work with top notch young journalists looking to establish themselves; New York office is generally congenial. Cons Company prioritizes sales staff over journalists, not understanding that there's nothing to sell if the journalism isn't top quality. Main problem with this is there isn't a path for advancement for journalists within the company. Advice to Management Remember that journalists are as crucial as sales staff; in fact, they can be thought of as \"selling\" subscriptions!", "rating": 5, "pros": "Staff is excellent; learn from and work with top notch young journalists looking to establish themselves; New York office is generally congenial.", "cons": "Company prioritizes sales staff over journalists, not understanding that there's nothing to sell if the journalism isn't top quality. Main problem with this is there isn't a path for advancement for journalists within the company.", "advice": "Remember that journalists are as crucial as sales staff; in fact, they can be thought of as \"selling\" subscriptions!"}, {"title": "reporter", "text": "Pros nice colleagues, decent health insurance and vacation policy. Cons low payment and lack of direction Advice to Management pay employees better", "rating": 3, "pros": "nice colleagues, decent health insurance and vacation policy.", "cons": "low payment and lack of direction", "advice": "pay employees better"}, {"title": "Great People, Poor Management", "text": "Pros Coworkers were smart and fun Office happy hours and events Cons Management - Everything is top down and any feedback given falls on deaf ears, and inevitably you will be taken to task when your feedback comes to fruition. Pay is low and they charge for healthcare Advice to Management Listen to your employees, stop trying to force feed your ideas into a market that does not want them.", "rating": 3, "pros": "Coworkers were smart and fun", "cons": "Management - Everything is top down and any feedback given falls on deaf ears, and inevitably you will be taken to task when your feedback comes to fruition.", "advice": "Listen to your employees, stop trying to force feed your ideas into a market that does not want them."}, {"title": "Sales", "text": "Pros Vacation Days - had to think hard! Cons money, no flexibility, managers need to learn to manage Advice to Management put more $$ into sales support and client travel", "rating": 1, "pros": "Vacation Days - had to think hard!", "cons": "money, no flexibility, managers need to learn to manage", "advice": "put more $$ into sales support and client travel"}, {"title": "Sales", "text": "Pros fun atmosphere, nice benefits, helpful management Cons None really come to mind", "rating": 5, "pros": "fun atmosphere, nice benefits, helpful management", "cons": "None really come to mind", "advice": null}, {"title": "Sales", "text": "Pros Great Atmosphere Good compensation scheme Good advice from management Cons None that i can think of Advice to Management None", "rating": 5, "pros": "Great Atmosphere", "cons": "None that i can think of", "advice": "None"}, {"title": "Sales", "text": "Pros 9-5 hours and good Vacay Cons Micromanagement, Low Commission, Boiler Room mentality with HEAVY dials, HAVE to come into office everyday, dying business Advice to Management Treat your reps like adults", "rating": 1, "pros": "9-5 hours and good Vacay", "cons": "Micromanagement, Low Commission, Boiler Room mentality with HEAVY dials, HAVE to come into office everyday, dying business", "advice": "Treat your reps like adults"}, {"title": "Right strategy, poor execution", "text": "Pros Incisive Media at one time had an aggressive investment strategy, led by M&A. They started in vertical publishing for the investment industry and added powerful media brands and trade conferences in the marketing and legal arenas. It was a sound vision. Good benefits. Tight-knit company culture (if you're based in the UK). Decent career opportunities for early-career (low pay) journalists and editors. Cons Incisive is a slow-moving bureaucracy. Decisions need to be cleared through several layers of management, which hinders execution and innovation. The company is hobbled by its investors. Benefits package aside, the company doesn't invest aggressively in its talent and has become more stingy over time as its PE investor. It has missed large opportunities to grow its presence in the US by virtue of its unwillingness to spend money on editorial headcount and marketing.", "rating": 3, "pros": "Incisive Media at one time had an aggressive investment strategy, led by M&A. They started in vertical publishing for the investment industry and added powerful media brands and trade conferences in the marketing and legal arenas. It was a sound vision.", "cons": "Incisive is a slow-moving bureaucracy. Decisions need to be cleared through several layers of management, which hinders execution and innovation. The company is hobbled by its investors.", "advice": null}, {"title": "Great Place", "text": "Pros + Great place to start out your career + Business casual + Very friendly environment + Lots of Vacation Days + Lots of Incentives + Snacks Tuesday and Thursday + Compensation (It's okay for a startup but lots of incentives to help get it up) + Benefits Package + Growing Cons - None that I could think of at the moment", "rating": 5, "pros": "+ Great place to start out your career", "cons": "- None that I could think of at the moment", "advice": null}, {"title": "Decent place to cut your journalistic teeth", "text": "Pros - The in-depth industry knowledge that journalists develop is highly transferable: Many employees move on to larger financial publications or are poached by the financial institutions that they cover. - Regular business travel Cons - Long hours at moderate salaries compared to other B2B publishers - Limited career advancement for those not holding a UK or EU passport Advice to Management None", "rating": 3, "pros": "- The in-depth industry knowledge that journalists develop is highly transferable: Many employees move on to larger financial publications or are poached by the financial institutions that they cover.", "cons": "- Long hours at moderate salaries compared to other B2B publishers", "advice": "None"}, {"title": "The job depends on your supervisor", "text": "Pros -NYC office is far removed from the supervisors in London, so you have a lot of freedom -lots of vacation days -There are a lot of industry events with free food and drink and good conversation Cons -not enough help for new reporters -the subject matter is quite dry Advice to Management Stop trying to crack down on employees with things like dress codes and other frivolous demands that make the office a less pleasant place to be.", "rating": 5, "pros": "-NYC office is far removed from the supervisors in London, so you have a lot of freedom", "cons": "-not enough help for new reporters", "advice": "Stop trying to crack down on employees with things like dress codes and other frivolous demands that make the office a less pleasant place to be."}, {"title": "Cool company", "text": "Pros Laid back company, casual fridays Cons Low Pay, wish there was better commission.", "rating": 3, "pros": "Laid back company, casual fridays", "cons": "Low Pay, wish there was better commission.", "advice": null}, {"title": "Good place", "text": "Pros entrepreneurial, creative, energetic, fast paced Cons a lack of resources and manpower Advice to Management More resources", "rating": 1, "pros": "entrepreneurial, creative, energetic, fast paced", "cons": "a lack of resources and manpower", "advice": "More resources"}, {"title": "Good place to work!", "text": "Pros Entrepreneurial, friendly atmosphere, smart colleagues, good career progression Cons Salaries aren't great and prob below market average, different treatment/ perks depending on your manager.", "rating": 5, "pros": "Entrepreneurial, friendly atmosphere, smart colleagues, good career progression", "cons": "Salaries aren't great and prob below market average, different treatment/ perks depending on your manager.", "advice": null}, {"title": "If I could give 0 stars, I would!", "text": "Pros PTO is pretty good, even in your first year there. The benefits aren't bad either. But that's about it. Cons Everything else! No leadership or room for growth. Advice to Management Terrible place to work - the company is UK based, and they've been taking over the NY office and running everything to the ground. It's also going under, so don't expect a good salary or bonuses for that matter. They do a good job of hiding the fact that the company is a sinking ship that's about to be bought our - everything that comes out of their mouths is pure bs! There is no room for creativity or opinion. You're never heard or supported. There is a reason why there's been a mass exodus in the past several months - since Jan 2014 in particular, 7 people have left. And the NY office is small to begin with (less than 30 people). DO NOT WORK HERE!", "rating": 1, "pros": "PTO is pretty good, even in your first year there. The benefits aren't bad either. But that's about it.", "cons": "Everything else! No leadership or room for growth.", "advice": "Terrible place to work - the company is UK based, and they've been taking over the NY office and running everything to the ground. It's also going under, so don't expect a good salary or bonuses for that matter. They do a good job of hiding the fact that the company is a sinking ship that's about to be bought our - everything that comes out of their mouths is pure bs! There is no room for creativity or opinion. You're never heard or supported. There is a reason why there's been a mass exodus in the past several months - since Jan 2014 in particular, 7 people have left. And the NY office is small to begin with (less than 30 people). DO NOT WORK HERE!"}, {"title": "keep looking", "text": "Pros Opportunities to move around within the company Cons Management flip flops and have zero understanding of the industry they are in. Meanwhile the new management micro-manages everything including things beyond her remit. Advice to Management Invest in your employees and technology.", "rating": 3, "pros": "Opportunities to move around within the company", "cons": "Management flip flops and have zero understanding of the industry they are in. Meanwhile the new management micro-manages everything including things beyond her remit.", "advice": "Invest in your employees and technology."}, {"title": "Meh, keep looking", "text": "Pros The hours are good. And if you stroll in late or have to leave early, no one cares b/c they all do it. Cons Well, the pay is very bad...especially on the editorial side. I've seen job ads for Incisive/American Lawyer Media saying the pay is \"competitive\"...it's not. My friends are shocked at how little I make...entry level salaries are the same as what they were in the editorial world in 1995. There's a lot of \"dead weight\" in the company...people that slack off and just delegate all their work to their subordinates. Upper management likes to believe they're transparent but they're not. The company is completely baffled by the \"digital age\". Websites are still seen as an after thought while ad sales in the print pubs are plummeting. Advice to Management Trim the fat...a round of layoffs (the lazy employees that do NOTHING) would help the bottom line. Focus more on web and new media....i.e: hire more people that know something about it. And if you want to keep employees around, pay a living wage...this isn't McDonalds...", "rating": 3, "pros": "The hours are good. And if you stroll in late or have to leave early, no one cares b/c they all do it.", "cons": "Well, the pay is very bad...especially on the editorial side. I've seen job ads for Incisive/American Lawyer Media saying the pay is \"competitive\"...it's not. My friends are shocked at how little I make...entry level salaries are the same as what they were in the editorial world in 1995. There's a lot of \"dead weight\" in the company...people that slack off and just delegate all their work to their subordinates. Upper management likes to believe they're transparent but they're not. The company is completely baffled by the \"digital age\". Websites are still seen as an after thought while ad sales in the print pubs are plummeting.", "advice": "Trim the fat...a round of layoffs (the lazy employees that do NOTHING) would help the bottom line. Focus more on web and new media....i.e: hire more people that know something about it. And if you want to keep employees around, pay a living wage...this isn't McDonalds..."}, {"title": "Life as a salesperson", "text": "Pros I joined incisive as a graduate pursuing a career in sales (not really knowing what I wanted to sell). Incisive provided the foundation by offering numerous sales training courses straight from the off making sure I was equipped with the basic skills needed to excel and offering further training throughout my time there. I went on to spend the next 3 and half years working my way up the ladder and learning from the experienced members of staff around me. I feel Incisive recognise those who work hard and reward accordingly, but also provide the training and direction to help you achieve your goals. Most notably though, it has to be the people at Incisive Media that really do make working there an absolute pleasure. A very social atmosphere throughout the workforce bringing all the various teams together; something you won't typically find at other companies. Cons Although a fantastic company to work for I feel there could be a better opportunity for career progression within the sales teams. Advice to Management Keep doing what you're doing. Incisive is a great company to work for and going in the right direction to make it even better. Keep recognising young talent and do what is possible to retain them.", "rating": 5, "pros": "I joined incisive as a graduate pursuing a career in sales (not really knowing what I wanted to sell). Incisive provided the foundation by offering numerous sales training courses straight from the off making sure I was equipped with the basic skills needed to excel and offering further training throughout my time there. I went on to spend the next 3 and half years working my way up the ladder and learning from the experienced members of staff around me. I feel Incisive recognise those who work hard and reward accordingly, but also provide the training and direction to help you achieve your goals.", "cons": "Although a fantastic company to work for I feel there could be a better opportunity for career progression within the sales teams.", "advice": "Keep doing what you're doing. Incisive is a great company to work for and going in the right direction to make it even better. Keep recognising young talent and do what is possible to retain them."}, {"title": "Great company to learn and grow", "text": "Pros Always moving forward, looking to expand and to do new things. People are empowered and trusted to deliver. The Flexible working is a great bonus and the people are genuinely friendly and supportive. Cons Middle managers need to learn to actively manage more and plan their staff's development. Advice to Management Keep trusting, keep launching and keep innovating. Ensure the culture remains where ideas are valued and calculated risk is supported. The energy and enthusiasm is tangible and is bursting to be mined.", "rating": 5, "pros": "Always moving forward, looking to expand and to do new things. People are empowered and trusted to deliver. The Flexible working is a great bonus and the people are genuinely friendly and supportive.", "cons": "Middle managers need to learn to actively manage more and plan their staff's development.", "advice": "Keep trusting, keep launching and keep innovating. Ensure the culture remains where ideas are valued and calculated risk is supported. The energy and enthusiasm is tangible and is bursting to be mined."}, {"title": "Great company to start a career", "text": "Pros Generally a very friendly and easy-going atmosphere. Cons Low pay and limited career progression.", "rating": 3, "pros": "Generally a very friendly and easy-going atmosphere.", "cons": "Low pay and limited career progression.", "advice": null}, {"title": "Great company to start your career in media", "text": "Pros excellent training, very well established, good communication between departments Cons Commission scheme could be better", "rating": 5, "pros": "excellent training, very well established, good communication between departments", "cons": "Commission scheme could be better", "advice": null}, {"title": "Events", "text": "Pros - A warm, positive atmosphere. The people truly make the company - Fun and diverse environment - Lots of support from managers when you first start out and you get to take on responsibility early Cons - Unfortunately, remuneration does not equate to the responsibility given and low-level staff members end up saddled with lots of work and projects above their paygrade - General low salaries - A very rigid structure with no true opportunities for progression Advice to Management Invest in young, talented members of staff. Give them a real opportunity to progress or they will just leave. Please don't just overload them with work. Compensate them for that effort.", "rating": 3, "pros": "- A warm, positive atmosphere. The people truly make the company", "cons": "- Unfortunately, remuneration does not equate to the responsibility given and low-level staff members end up saddled with lots of work and projects above their paygrade", "advice": "Invest in young, talented members of staff. Give them a real opportunity to progress or they will just leave. Please don't just overload them with work. Compensate them for that effort."}, {"title": "Events Marketing Executive", "text": "Pros - Great team, probably one of the best reasons to work here are the people - A fair number of training opportunities - Flexible working scheme - Very social Cons - Low pay and small wage brackets - No feedback on managers - Slow progression sometimes - Lack of training on the actual content Advice to Management - Provide the opportunity to feedback about your manager, otherwise there's no knowledge of where to improve (particularly with new managers) - In order to be a good marketer, you have to understand the audience's needs and without a basic understanding of the industry it's very hard to do that. Content training vital!", "rating": 5, "pros": "- Great team, probably one of the best reasons to work here are the people", "cons": "- Low pay and small wage brackets", "advice": "- Provide the opportunity to feedback about your manager, otherwise there's no knowledge of where to improve (particularly with new managers)"}, {"title": "Well-managed", "text": "Pros It has great people and training and has coped with an on-going period of change pretty well in the circumstances. It has been able to invest in some products recently after a very difficult period after the financial crash. Cons The business has divided into two distinct divisions, which has affected its culture. There is a level of uncertainty as several brands have been sold in recent years and it is reportedly exploring a sale.", "rating": 5, "pros": "It has great people and training and has coped with an on-going period of change pretty well in the circumstances. It has been able to invest in some products recently after a very difficult period after the financial crash.", "cons": "The business has divided into two distinct divisions, which has affected its culture. There is a level of uncertainty as several brands have been sold in recent years and it is reportedly exploring a sale.", "advice": null}, {"title": "Great socially, but don't really care about their employees", "text": "Pros Social life - the people are fantastic and always up for a night out Pay is good compared to other media companies Office location is great Benefits package is good Cons Managers have been there years, get paid huge amounts for doing very little, and the junior employees work much harder for much worse pay. When things are going well everything is great but there is very little support available for staff who are having a bad month. Advice to Management Invest in your staff so they feel like you actually have an interest in growing their career beyond seeing how many quid you can wring out of them in any given month. Listen to your junior managers who actually know what's going on day to day", "rating": 3, "pros": "Social life - the people are fantastic and always up for a night out", "cons": "Managers have been there years, get paid huge amounts for doing very little, and the junior employees work much harder for much worse pay. When things are going well everything is great but there is very little support available for staff who are having a bad month.", "advice": "Invest in your staff so they feel like you actually have an interest in growing their career beyond seeing how many quid you can wring out of them in any given month."}, {"title": "Review", "text": "Pros Great people, fantastic training and overall a good culture. Excellent place to grow your career as there are always new opportunities. Fantastic office location too. Cons Poor salaries and senior management should communicate better with staff. Advice to Management Communicate better with staff.", "rating": 5, "pros": "Great people, fantastic training and overall a good culture. Excellent place to grow your career as there are always new opportunities. Fantastic office location too.", "cons": "Poor salaries and senior management should communicate better with staff.", "advice": "Communicate better with staff."}, {"title": "A model company", "text": "Pros Relaxed, personal relationships even when stressful. minimal seperation between different levels of staff up to execs. Supportive Cons Spend a fortune on Pret lunches if you don't prepare! Advice to Management Keep up the current model and promote within as you already do.", "rating": 5, "pros": "Relaxed, personal relationships even when stressful.", "cons": "Spend a fortune on Pret lunches if you don't prepare!", "advice": "Keep up the current model and promote within as you already do."}, {"title": "Badly paid and difficult to move up the ladder", "text": "Pros Good central London location, and the company offers a range of benefits such as subsidised gym memberships and a travel loan. Training is also available. Cons Positions for journalists are very badly paid, and it's difficult to move up the ladder, with \"promotions\" often coming with no pay increase. There are too many staff members who have been in senior roles for a long time taking up space in the company without adding anything in terms of expertise. Advice to Management Take a look at mid- to senior-level managers and see if you can't weed out some of the dead wood.", "rating": 3, "pros": "Good central London location, and the company offers a range of benefits such as subsidised gym memberships and a travel loan. Training is also available.", "cons": "Positions for journalists are very badly paid, and it's difficult to move up the ladder, with \"promotions\" often coming with no pay increase. There are too many staff members who have been in senior roles for a long time taking up space in the company without adding anything in terms of expertise.", "advice": "Take a look at mid- to senior-level managers and see if you can't weed out some of the dead wood."}, {"title": "Editorial", "text": "Pros The people are mainly engaging, enthusiastic people who are fun to be with, enjoy their work but also enjoy socialising with colleagues on a Friday after work. The publication managers also genuinely care about their teams and helping them achieve their potential. The average age of staff is estimated to be around 25-35 and around 50/50 males to females. You are provided with your own equipment and there is a dedicated, friendly team of in-house technicians on hand to help. The rooms are well-lit with all the normal facilities (tea, coffee, water). The company also has an annual fun day (like a traditional school sports day). They also provide in-house training to new recruits. Cons The company has gone under many changes in the past two years after it was bought out by an American consortium. This has all been in the public domain. Following this takeover, a series of publication titles were then sold off or reduced in size with staff posts being made redundant. This has changed the company culture and created a degree of uncertainty amongst many of the staff about their future. There has also been a general movement of senior staff leaving Incisive since the takeover. These have been replaced by more junior journalists. The in-house training is also generally intended for new recruits and is not provided regularly enough. Generally speaking, it is a great place to 'cut your teeth' in business, trade of B2B journalism. However, have a contingency (escape) plan just in case. Advice to Management Happy, well-supported staff often produce better work. Creating a caring, stable working environment where adequate training and guidance is provided will go some way to achieving that.", "rating": 3, "pros": "The people are mainly engaging, enthusiastic people who are fun to be with, enjoy their work but also enjoy socialising with colleagues on a Friday after work. The publication managers also genuinely care about their teams and helping them achieve their potential. The average age of staff is estimated to be around 25-35 and around 50/50 males to females. You are provided with your own equipment and there is a dedicated, friendly team of in-house technicians on hand to help. The rooms are well-lit with all the normal facilities (tea, coffee, water). The company also has an annual fun day (like a traditional school sports day). They also provide in-house training to new recruits.", "cons": "The company has gone under many changes in the past two years after it was bought out by an American consortium. This has all been in the public domain. Following this takeover, a series of publication titles were then sold off or reduced in size with staff posts being made redundant. This has changed the company culture and created a degree of uncertainty amongst many of the staff about their future. There has also been a general movement of senior staff leaving Incisive since the takeover. These have been replaced by more junior journalists. The in-house training is also generally intended for new recruits and is not provided regularly enough. Generally speaking, it is a great place to 'cut your teeth' in business, trade of B2B journalism. However, have a contingency (escape) plan just in case.", "advice": "Happy, well-supported staff often produce better work. Creating a caring, stable working environment where adequate training and guidance is provided will go some way to achieving that."}, {"title": "General", "text": "Pros Incisive Media is on an accelerated growth program through organic and inorganic growth strategy. Cons The commercial and information services divisions sometimes compete. This could be improved by closer collaboration which in turn may translate in to higher revenues. Advice to Management Facilitate a closer collaboration between Commercial and Information Services divisions.", "rating": 3, "pros": "Incisive Media is on an accelerated growth program through organic and inorganic growth strategy.", "cons": "The commercial and information services divisions sometimes compete. This could be improved by closer collaboration which in turn may translate in to higher revenues.", "advice": "Facilitate a closer collaboration between Commercial and Information Services divisions."}, {"title": "A good company ethos and talented people", "text": "Pros Positive environment with some great brands Cons Brands could work better with each other", "rating": 5, "pros": "Positive environment with some great brands", "cons": "Brands could work better with each other", "advice": null}, {"title": "Incisive", "text": "Pros Great opportunities to develop as a journalist and learn about finance. Smart people and good culture. The ability to work remotely is also a huge plus. Cons There are some barriers to career progression. The graduate scheme is lacking in terms of training journalists with the skills they need to succeed. Advice to Management Invest in the people you hire by making sure they are trained properly and have the resources to do the cutting-edge journalism subscribers pay for.", "rating": 3, "pros": "Great opportunities to develop as a journalist and learn about finance. Smart people and good culture. The ability to work remotely is also a huge plus.", "cons": "There are some barriers to career progression. The graduate scheme is lacking in terms of training journalists with the skills they need to succeed.", "advice": "Invest in the people you hire by making sure they are trained properly and have the resources to do the cutting-edge journalism subscribers pay for."}, {"title": "Great learning curve", "text": "Pros People are nice In general, I think they care about their staff. Good place to start a career. Some good socials Cons Salary and unfulfilled promises. Far too many managers done are managing 2 people, everyone in marketing is a \"manager\", far too many internal meetings Advice to Management Pay more, don't use David Brent cliches \"the grass isn't greener\"", "rating": 3, "pros": "People are nice In general, I think they care about their staff. Good place to start a career. Some good socials", "cons": "Salary and unfulfilled promises. Far too many managers done are managing 2 people, everyone in marketing is a \"manager\", far too many internal meetings", "advice": "Pay more, don't use David Brent cliches \"the grass isn't greener\""}, {"title": "incisive Media- working in the heart of central", "text": "Pros Flexible working, great colleagues, Working in the heart of London, Charity foundation. good company for your CV Cons Wages for working in the heart of London,", "rating": 5, "pros": "Flexible working, great colleagues, Working in the heart of London, Charity foundation. good company for your CV", "cons": "Wages for working in the heart of London,", "advice": null}, {"title": "Trainee", "text": "Pros Very healthy working atmosphere Approachable management Flexible working Great location Excellent Training Good company culture- little sense of hierarchy Great people- knowledgeable & with a good sense of humour Cons IT issues, no canteen, the office can't be accessed late in the evening", "rating": 5, "pros": "Very healthy working atmosphere", "cons": "IT issues, no canteen, the office can't be accessed late in the evening", "advice": null}, {"title": "Good Company", "text": "Pros Great brands with great colleagues working on them. Very close company. Good for career development also. Cons Salary could be more competitive with the market rate Advice to Management N/A", "rating": 5, "pros": "Great brands with great colleagues working on them. Very close company. Good for career development also.", "cons": "Salary could be more competitive with the market rate", "advice": "N/A"}, {"title": "Lovely staff", "text": "Pros The best bunch of people to work with Cons Pay should be more competitive, and development plans are spoken of but rarely put into motioin", "rating": 5, "pros": "The best bunch of people to work with", "cons": "Pay should be more competitive, and development plans are spoken of but rarely put into motioin", "advice": null}, {"title": "A lot of change", "text": "Pros It's in a good location with good people Cons There are a lot of changes happening at the moment without a lot of communication.", "rating": 3, "pros": "It's in a good location with good people", "cons": "There are a lot of changes happening at the moment without a lot of communication.", "advice": null}, {"title": "Great company to start your career", "text": "Pros Smart and friendly people, great work-life balance, good name in the industry. Cons It is a B2B firm - a decent one - so make sure you understand what that means if you're looking for a journalistic job. Advice to Management Keep up the good work.", "rating": 3, "pros": "Smart and friendly people, great work-life balance, good name in the industry.", "cons": "It is a B2B firm - a decent one - so make sure you understand what that means if you're looking for a journalistic job.", "advice": "Keep up the good work."}, {"title": "On the better side of office jobs", "text": "Pros Great atmosphere, judged by the work you produce, rather than simply being present. The office is a great place to collaborate with coworkers as there are so many different teams working. Board team keep employees up-to-date on major movememnts. Incisive Media Foundation is the charity center for workers and they are very involved and accommodated within the organisation Cons Quite process intensive, some inefficiencies caused by over involvement of higher band employees in lower end work. Slightly hard to settle with preparation for the as yet unknown sale of one or both halves of the business. Complicated and strenuous rules for things which are stated to be \"available at employees discretion\" such as working out of the office Advice to Management Doing well with employee motivation with the sporadic entertainment factors whilst working. Work on facilitating everyone with necessary equipment such as phones for desks", "rating": 5, "pros": "Great atmosphere, judged by the work you produce, rather than simply being present. The office is a great place to collaborate with coworkers as there are so many different teams working. Board team keep employees up-to-date on major movememnts. Incisive Media Foundation is the charity center for workers and they are very involved and accommodated within the organisation", "cons": "Quite process intensive, some inefficiencies caused by over involvement of higher band employees in lower end work. Slightly hard to settle with preparation for the as yet unknown sale of one or both halves of the business. Complicated and strenuous rules for things which are stated to be \"available at employees discretion\" such as working out of the office", "advice": "Doing well with employee motivation with the sporadic entertainment factors whilst working. Work on facilitating everyone with necessary equipment such as phones for desks"}, {"title": "Business Development Manager", "text": "Pros I haven`t got good reason to working there. Cons not stabile work environment Management is not effective bad salary not clear and fair commission system", "rating": 1, "pros": "I haven`t got good reason to working there.", "cons": "not stabile work environment", "advice": null}, {"title": "High standard of journalism", "text": "Pros Incisive Insight - core business unit - pays well by industry standards, sets the bar high in terms of quality of journalism, has some very good middle managers and a strong reputation among readers. Cons Can't speak for Incisive Business - non-core unit - probably lower morale. Advice to Management Training programme for graduate trainees needs some improvements to make it really effective eg newswriting course should be better tailored to different publications.", "rating": 5, "pros": "Incisive Insight - core business unit - pays well by industry standards, sets the bar high in terms of quality of journalism, has some very good middle managers and a strong reputation among readers.", "cons": "Can't speak for Incisive Business - non-core unit - probably lower morale.", "advice": "Training programme for graduate trainees needs some improvements to make it really effective eg newswriting course should be better tailored to different publications."}, {"title": "Marketing", "text": "Pros Nice people, overall a good culture and offers relatively good training opportunties. Cons Poor salary Lack of progession Does not invest in the right people Advice to Management Too many confusing strategies. Business is being dedicated by the PE investor", "rating": 1, "pros": "Nice people, overall a good culture and offers relatively good training opportunties.", "cons": "Poor salary", "advice": "Too many confusing strategies. Business is being dedicated by the PE investor"}, {"title": "Disappointment sets in quickly", "text": "Pros Easy Interview process, friendly staff, good location Cons Culture of confusion throughout middle management. Reporting lines are very confusing and makes it easier to pass the buck between themselves Staff turnover worryingly high. Bonus is great but a moving target designed to not compensate you for hard work. Advice to Management Reward hard working staff, take ownership of decisions", "rating": 3, "pros": "Easy Interview process, friendly staff, good location", "cons": "Culture of confusion throughout middle management.", "advice": "Reward hard working staff, take ownership of decisions"}, {"title": "great place to start after university", "text": "Pros honestly great benefits and good people Cons staff could be paid more, people seem to be leaving for more money only", "rating": 5, "pros": "honestly great benefits and good people", "cons": "staff could be paid more, people seem to be leaving for more money only", "advice": null}, {"title": "Staff are fab, senior management are confused", "text": "Pros The teams are always friendly, well integrated and willing to help each other. The location is really handy and the travel is a perk. Cons Bonus structure was terrible, and no one really seemed to know what they were doing with the future of the various failing brands. Advice to Management Focus on your key events and publications, and spend some time on a strategic review", "rating": 3, "pros": "The teams are always friendly, well integrated and willing to help each other. The location is really handy and the travel is a perk.", "cons": "Bonus structure was terrible, and no one really seemed to know what they were doing with the future of the various failing brands.", "advice": "Focus on your key events and publications, and spend some time on a strategic review"}, {"title": "The honest truth", "text": "Pros The best people you will ever meet work in this business. It is more like a family than a group of work colleagues. Excellent solid publications and audience groups ensure our clients get the real deal. Cons It is not clear about the future of the business as a whole. More regular communication across the business would help. Middle management are to slow to communicate. Advice to Management Work to maximise cohesion across departments, ensure that strategies are communicated to all staff and be clear about who is leading what. Also include more realistic measurable goals for the business and highlight the success with bonuses.", "rating": 5, "pros": "The best people you will ever meet work in this business.", "cons": "It is not clear about the future of the business as a whole. More regular communication across the business would help.", "advice": "Work to maximise cohesion across departments, ensure that strategies are communicated to all staff and be clear about who is leading what. Also include more realistic measurable goals for the business and highlight the success with bonuses."}, {"title": "Key Account Manager", "text": "Pros Great company and great people who look after staff who show their commitment to the company. Cons No real concerns as it was a great company Advice to Management Try harder to retain good staff who leave for a small pay rise.", "rating": 5, "pros": "Great company and great people who look after staff who show their commitment to the company.", "cons": "No real concerns as it was a great company", "advice": "Try harder to retain good staff who leave for a small pay rise."}, {"title": "Enjoyable", "text": "Pros Young staff Good culture Chilled environment Flexible working (depending on management) Great office location Can get up to 30 days holiday! Cons Slow progression Low salaries Rarely get much in the way of commission Advice to Management Reward and value staff more", "rating": 3, "pros": "Young staff", "cons": "Slow progression", "advice": "Reward and value staff more"}, {"title": "Events Team - Hong Kong", "text": "Pros It was my first job since I graduated. Good management with adequate training Good career prospect and achievable bonus target Cons Exlpore more different topics of events Advice to Management More aggressive", "rating": 5, "pros": "It was my first job since I graduated.", "cons": "Exlpore more different topics of events", "advice": "More aggressive"}, {"title": "Poor pay, poor senior management, lack of opportunities", "text": "Pros If you're a graduate this could be a good start to a career or stepping stone as it is a young buzzy company and basic training is given. Location ok if you want to be in the West End - very touristy area though. Cons Pay is terrible and not competitive at all. Most people seem to be looking to leave for better pay and more opportunities. The company seems to be selling off large parts so development opportunities are scarce. The upper management is an old boys club and they use quite aggressive/bullying tactics to try and get results. Seems to be a company in decline. Advice to Management Pay your staff better. Be transparent about the state of the company. Look at your senior management and have more inspiring people at the top to motivate staff in a positive and encouraging way.", "rating": 1, "pros": "If you're a graduate this could be a good start to a career or stepping stone as it is a young buzzy company and basic training is given. Location ok if you want to be in the West End - very touristy area though.", "cons": "Pay is terrible and not competitive at all. Most people seem to be looking to leave for better pay and more opportunities. The company seems to be selling off large parts so development opportunities are scarce. The upper management is an old boys club and they use quite aggressive/bullying tactics to try and get results. Seems to be a company in decline.", "advice": "Pay your staff better. Be transparent about the state of the company. Look at your senior management and have more inspiring people at the top to motivate staff in a positive and encouraging way."}, {"title": "Account Manager", "text": "Pros -Great atmosphere. -Recruitment is strong within the Sales Division and the majority of my colleagues were very high achievers. -Very organised in terms of platforms and delivery. -Excellent office location. -Use of technology at work to enable working from home/out whilst at meetings. Cons Although Incisive Media is an excellent company to be a part of, it does have its bad points. -Job progression has always been a concern at the company. -People are valued based on time at the company and not really based on performance. - Selling brands like Mr.Kipling sells cakes. -Atmosphere is not quite what it used to be. -Incentives for sales staff is stacking(If its money you are after than try a competitor). Advice to Management -Build better development programmes. -Look into Sales performance. -Sales require a more up to date and effective CRM system -When the business is selling brands be more honest to your staff, they deserve to know the direction of the company in the future.", "rating": 3, "pros": "-Great atmosphere.", "cons": "Although Incisive Media is an excellent company to be a part of, it does have its bad points.", "advice": "-Build better development programmes."}, {"title": "Sales Manager", "text": "Pros Very good work culture Good training Cons I didn't like a couple of people of my team", "rating": 5, "pros": "Very good work culture", "cons": "I didn't like a couple of people of my team", "advice": null}, {"title": "Waste of time", "text": "Pros Fun colleagues, products have recognised quality, company is growing. HR write beautiful Glassdoor reviews. Cons Disappointing management: amateurish, bullying, immature and micromanaging. No clear direction or strategy. Oblivious to their shortcomings. Junior approach to sales, trapped in the 90's. Inefficient processes - for everything. Silly rules like everybody must go for lunch at the same time (1:00pm). It really is like being back to primary school. This company also needs some serious overhaul in operations: nobody cares to resolve persistent problems, nobody seems to be in charge, everything takes ages to be looked into (if ever). CRM system is painful. Advice to Management Replace managers with scented candles. It'll save the company money, boost productivity, and provide for a stimulating environment.", "rating": 3, "pros": "Fun colleagues, products have recognised quality, company is growing. HR write beautiful Glassdoor reviews.", "cons": "Disappointing management: amateurish, bullying, immature and micromanaging. No clear direction or strategy. Oblivious to their shortcomings. Junior approach to sales, trapped in the 90's. Inefficient processes - for everything. Silly rules like everybody must go for lunch at the same time (1:00pm). It really is like being back to primary school.", "advice": "Replace managers with scented candles. It'll save the company money, boost productivity, and provide for a stimulating environment."}, {"title": "Good company to work for", "text": "Pros Entrepreneurial spirit that allows you to shape your own career. For those that put the effort in there are good promotional opportunities. Salaries are not the best, but this is counteracted by a good work/life balance and friendly working environment. Cons Bonus scheme gets changed regularly and it seems the only reason for doing this is to make it more difficult to hit the targets. Lots of company changes at the moment which has affected the atmosphere. Advice to Management Strategy changes too often. Every 6 months there is a new initiative which affects continuity", "rating": 3, "pros": "Entrepreneurial spirit that allows you to shape your own career. For those that put the effort in there are good promotional opportunities. Salaries are not the best, but this is counteracted by a good work/life balance and friendly working environment.", "cons": "Bonus scheme gets changed regularly and it seems the only reason for doing this is to make it more difficult to hit the targets. Lots of company changes at the moment which has affected the atmosphere.", "advice": "Strategy changes too often. Every 6 months there is a new initiative which affects continuity"}, {"title": "Thinking of working at Incisive Media....", "text": "Pros The company have created great products available to many industries. Team spirit is great and people are willing to help you in your role. Senior management are very supportive and are keen to help staff on the ground perform better. Cons Middle management are poor and don't provide support to the working staff. Also if you do not manage your own accounts or never have then you are not in the position to pass judgements! Advice to Management Enable a greater working relationship between editorial, marketing and sales teams. Provide slightly more face time between yourselves and the sales teams, in the form of short discussions bi monthly.", "rating": 3, "pros": "The company have created great products available to many industries.", "cons": "Middle management are poor and don't provide support to the working staff. Also if you do not manage your own accounts or never have then you are not in the position to pass judgements!", "advice": "Enable a greater working relationship between editorial, marketing and sales teams."}, {"title": "Great company & great people but poor payers. Bonus never comes through.", "text": "Pros Fantastic atmosphere, everyone works well together. Very good work - life balance. Cons Pay below the market rate. Promise up to 12k potential bonus but really you don't even see 10% of that", "rating": 5, "pros": "Fantastic atmosphere, everyone works well together. Very good work - life balance.", "cons": "Pay below the market rate. Promise up to 12k potential bonus but really you don't even see 10% of that", "advice": null}, {"title": "Event", "text": "Pros Good environment and good team spirit Colleagues are nice and helpful It's overall a nice place to learn new things Cons Location a bit far from CBD area Not very good bonus scheme and sometimes have ad hoc events coming up Advice to Management Nothing special to tell", "rating": 5, "pros": "Good environment and good team spirit", "cons": "Location a bit far from CBD area", "advice": "Nothing special to tell"}, {"title": "Decent", "text": "Pros Great people, great events, good location, relaxed Cons Pay could be more competitive, not great career progression in sales.", "rating": 5, "pros": "Great people, great events, good location, relaxed", "cons": "Pay could be more competitive, not great career progression in sales.", "advice": null}, {"title": "Great place to learn and grow in your career!", "text": "Pros Incisive houses industry leading publications and every publication is well respected in each of the financial verticals they are in. Great events team with some of the most established conferences in the financial sector. Newcomers are mentored and trained to reach their full potential. Brilliant volunteering opportunities to break up a monotonous work day in the form of the Incisive Media Foundation. Employees are nourished not only in the form of knowledge necessary for their roles but also the nourishment needed for their body to function at optimal levels. Encouragement from top management for internal promotions thus helping employees progress. Adopted the flexible working approach that allows employees tailor make their work schedules to best suit them. This has greatly helped in achieving a work-life balance. Recognition for hard work and going above and beyond your role. Cons None come to mind at the moment.", "rating": 5, "pros": "Incisive houses industry leading publications and every publication is well respected in each of the financial verticals they are in.", "cons": "None come to mind at the moment.", "advice": null}, {"title": "Sales Role", "text": "Pros Good Social aspects and great people, not heard of many people that didn't enjoy working at company. In terms of sales one of the better companies to work for in media, very supportive and positive. Positive attitude to investment of training, expect realistic career development. Cons Environment can vary from positive to negative, quiet to loud depending on brands you work with. You may work in one area and it suits then move to another and find yourself not enjoying work. I would learn as much about specific team culture and environment as possible before taking on a role. Most people leave to get pay rise as these don't come often in comparison to other media companies, ensure you accept a level you are comfortable with.", "rating": 5, "pros": "Good Social aspects and great people, not heard of many people that didn't enjoy working at company. In terms of sales one of the better companies to work for in media, very supportive and positive.", "cons": "Environment can vary from positive to negative, quiet to loud depending on brands you work with. You may work in one area and it suits then move to another and find yourself not enjoying work. I would learn as much about specific team culture and environment as possible before taking on a role.", "advice": null}, {"title": "Senior conference producer", "text": "Pros They plan some fun staff outings and the benefits package is pretty decent. Also, the people are nice and the work/life balance is good. Cons You'll die of boredom. Work is steady but not at all interesting. Advice to Management There's no real focus on innovation, just talk of it. The staff lack energy and aren't good with change. When things do go wrong everyone blames one another. My advice to management would be, be brave and encourage staff to work on interesting content. Stop hiring the same person over and over again.", "rating": 1, "pros": "They plan some fun staff outings and the benefits package is pretty decent. Also, the people are nice and the work/life balance is good.", "cons": "You'll die of boredom. Work is steady but not at all interesting.", "advice": "There's no real focus on innovation, just talk of it. The staff lack energy and aren't good with change. When things do go wrong everyone blames one another."}, {"title": "A great company", "text": "Pros One of Europe's biggest B2B publishing company Good work life balance Polite and supportive co workers motivational environment Cons No clear guidance on career progression for junior staff Low financial rewards but fairly in line with the publishing industry Advice to Management Improve staff retention rates through competitive reward packages Identify low performers Better utilisation of existing talent", "rating": 5, "pros": "One of Europe's biggest B2B publishing company", "cons": "No clear guidance on career progression for junior staff", "advice": "Improve staff retention rates through competitive reward packages"}, {"title": "Run Forrest Run", "text": "Pros Cool People...Sometimes. Good place to start. Cons No Career progression, play it by ear mentality, they have no control (the 'other' owners call the shots), massive wastage. Once people develop a radar and establish what it is like, they go. Often decisions are passed on to the 'consultants'...who overcharge for something management already know. Boys club mentality. Not a meritocracy--if you are in the clique, you'll do well. Advice to Management Just wrap it up before the 'owners' sell if of piece by piece to the highest bidder.", "rating": 1, "pros": "Cool People...Sometimes. Good place to start.", "cons": "No Career progression, play it by ear mentality, they have no control (the 'other' owners call the shots), massive wastage. Once people develop a radar and establish what it is like, they go. Often decisions are passed on to the 'consultants'...who overcharge for something management already know.", "advice": "Just wrap it up before the 'owners' sell if of piece by piece to the highest bidder."}, {"title": "young, friendly atmosphere", "text": "Pros Young friendly company with flexible working Cons It isnt the best company for career progression", "rating": 5, "pros": "Young friendly company with flexible working", "cons": "It isnt the best company for career progression", "advice": null}, {"title": "young friendly environment", "text": "Pros young, friendly, sociable, flexible working hours, Cons poor salary, not much career progression", "rating": 3, "pros": "young, friendly, sociable, flexible working hours,", "cons": "poor salary, not much career progression", "advice": null}, {"title": "Great Company", "text": "Pros I have been with Incisive Media for 10 years and as well as investing in you to make sure you become one of the best sales people in the business they also are extremely accommodating for the work life/ home balance and by bringing in policies like working from home allows staff to spend extra time with their children. The people that work for the company are great people and always have been. Excellent benefits and pay schemes Cons communication from the top has been poor at times Advice to Management be as transparent with staff as possible as your decisions affect their lives", "rating": 5, "pros": "I have been with Incisive Media for 10 years and as well as investing in you to make sure you become one of the best sales people in the business they also are extremely accommodating for the work life/ home balance and by bringing in policies like working from home allows staff to spend extra time with their children. The people that work for the company are great people and always have been. Excellent benefits and pay schemes", "cons": "communication from the top has been poor at times", "advice": "be as transparent with staff as possible as your decisions affect their lives"}, {"title": "First job out of Uni", "text": "Pros Very welcoming atmosphere, everyone is really friendly and genuinely wants to get to know you and make you one of the team. Flexible working hours, although only available after three month probationary period. Really good company benefits to suit your needs Excellent pension scheme Cons Three month probationary period for new starters - I can understand why it is necessary but is rather frustrating when you have a long commute in and flexible working isn't available. The same could also be said about the season ticket loan. Advice to Management Keep doing what your doing! In terms of training, listen to the feedback being given my the trains. Some more practical sessions would have been helpful.", "rating": 5, "pros": "Very welcoming atmosphere, everyone is really friendly and genuinely wants to get to know you and make you one of the team.", "cons": "Three month probationary period for new starters - I can understand why it is necessary but is rather frustrating when you have a long commute in and flexible working isn't available. The same could also be said about the season ticket loan.", "advice": "Keep doing what your doing! In terms of training, listen to the feedback being given my the trains. Some more practical sessions would have been helpful."}, {"title": "Perks of Working at Incisive Media", "text": "Pros Some of the best things about working for Incisive Media are the life long friends that i have made. There is a great work life balance and team socials throughout the year to get to know your team and the teams in the wider business. On top of the great work life balance there is ample opportunity to learn and grow within the company. Incisive is great if you are interested in a career as they will invest in you. Cons One of the downsides to Incisive Media would be when there are staff who are not after a career but more a 9-5. This is a downside as you can sometimes end in a team that is down a member and have to take on added pressure. However with new CRM systems the handovers are a lot easier to follow.", "rating": 5, "pros": "Some of the best things about working for Incisive Media are the life long friends that i have made. There is a great work life balance and team socials throughout the year to get to know your team and the teams in the wider business.", "cons": "One of the downsides to Incisive Media would be when there are staff who are not after a career but more a 9-5. This is a downside as you can sometimes end in a team that is down a member and have to take on added pressure. However with new CRM systems the handovers are a lot easier to follow.", "advice": null}, {"title": "Editorial Trainee Scheme", "text": "Pros 5 weeks of in-depth journalism training by industry professionals before starting full-time on the brand Two year scheme with plenty of opportunity to progress and 6 month salary increase if all goals achieved Lots of benefits including gym membership, private healthcare, shopping discounts and eyecare vouchers Lots of supportive people around in editorial, sales, HR - really understanding of lack of knowledge as a new starter Option to work from home Cons Long hours if evening social/networking events aren't your thing Hot desk policy but everyone pretty much has their own seat - hard for new starters as seated all over the place depending on who is off/working from home", "rating": 5, "pros": "5 weeks of in-depth journalism training by industry professionals before starting full-time on the brand", "cons": "Long hours if evening social/networking events aren't your thing", "advice": null}, {"title": "Lots of reviews on here written by HR, clearly...", "text": "Pros Clean and spacious office. Pay is on time. Friendly people (Exception for the political management team). Cons Clearly a lot of these reviews are written by management themselves. Its not a bad place to work but the management is on the lookout to profit wherever possible. Bonuses--please. Most of the teams have bonus structures but very few ever receive them. Investing in their staff, I'd like to know where this happens? Invest as in providing a computer? Opportunity to move up? Doubt it. Very few do and many great members of the team leave. In the senior positions it gets very tricky and no one is out there to get to know you or help you unless it's helping their bottom line. Pay...is on the low end of the market and pay raises are not common. They rather lose an employee than give a raise. Winning an award...well you can pay for that. That means nothing. But I would say that most of the events are pretty good. Management is stuck in their ways so any changes to evolve with time is not likely to happen.", "rating": 1, "pros": "Clean and spacious office.", "cons": "Clearly a lot of these reviews are written by management themselves.", "advice": null}, {"title": "Great Company to work for", "text": "Pros A nice company to work for with good work life balance and social gatherings throughout the year to get to know your team and other departments. Relaxed and supportive environment plus opportunity to travel. Cons Lack in career development, it's good for a 9-5 job.", "rating": 3, "pros": "A nice company to work for with good work life balance and social gatherings throughout the year to get to know your team and other departments. Relaxed and supportive environment plus opportunity to travel.", "cons": "Lack in career development, it's good for a 9-5 job.", "advice": null}, {"title": "Great company, great people, excellent career opportunities", "text": "Pros Having worked for Incisive for over 13 years I have seen the company evolve following a number acquisitions and restructures. As a result I have enjoyed great career development, having benefited from some excellent opportunities to improve my experience and skills. Incisive's culture and people are two of its greatest strengths, led by a dynamic and inspirational CEO, Tim Weller. With is recent adoption of flexible working practices, staff now enjoy an improved work/life balance,something many of us value greatly. Cons Incisive has made some strategic mistakes along the way and there have been some tough times but it does not rest on its laurels. Advice to Management We have a strong management team. They need to continue to promote the company's core values as well as encouraging and incentivising staff to push the boundaries in what they can deliver personally and as part of a team.", "rating": 5, "pros": "Having worked for Incisive for over 13 years I have seen the company evolve following a number acquisitions and restructures. As a result I have enjoyed great career development, having benefited from some excellent opportunities to improve my experience and skills. Incisive's culture and people are two of its greatest strengths, led by a dynamic and inspirational CEO, Tim Weller. With is recent adoption of flexible working practices, staff now enjoy an improved work/life balance,something many of us value greatly.", "cons": "Incisive has made some strategic mistakes along the way and there have been some tough times but it does not rest on its laurels.", "advice": "We have a strong management team. They need to continue to promote the company's core values as well as encouraging and incentivising staff to push the boundaries in what they can deliver personally and as part of a team."}, {"title": "Best company I've worked for", "text": "Pros Can't highlight enough how friendly the staff are. I think a key hiring requirement is that people fit in and have a good attitude, meaning that the people here are all a genuinely friendly, positive bunch of people. There's also the bonus of it being a big company, but without the big company shortcomings. It's very adaptable and a dynamic place to work, things get done relatively quickly, and everyone has the chance to contribute. Plus Tim Weller is brilliant! Cons I agree with comments that salaries tend to be slightly below the rest of the market. However, this is balanced out by great perks and discounts, and in a lot of cases a quarterly bonus that isn't necessarily mentioned in the job description! Advice to Management Keep doing what you're doing", "rating": 5, "pros": "Can't highlight enough how friendly the staff are. I think a key hiring requirement is that people fit in and have a good attitude, meaning that the people here are all a genuinely friendly, positive bunch of people.", "cons": "I agree with comments that salaries tend to be slightly below the rest of the market. However, this is balanced out by great perks and discounts, and in a lot of cases a quarterly bonus that isn't necessarily mentioned in the job description!", "advice": "Keep doing what you're doing"}, {"title": "OK. Not great.", "text": "Pros Great people make this a good place to work - with some heavy caveats. Location is OK, bit too touristy. Pay is probably slightly above industry average but not brilliant. Cons Lack of communication. Everything is last minute. No clear internal strategy - or if there is it is not communicated. Ideas come down from on high with no discussion - and the people doing the job are expected to learn new skills in short timeframes with little to no training. Lack of care of the non-sales side of the workforce. You always feel dispensable and unsafe - you feel any member of staff could be made redundant at any time. Advice to Management Middle management need to be better at communication to the people who are actually expected to do the work. Treat staff like they are valued, not like numbers on a balance sheet.", "rating": 3, "pros": "Great people make this a good place to work - with some heavy caveats. Location is OK, bit too touristy. Pay is probably slightly above industry average but not brilliant.", "cons": "Lack of communication. Everything is last minute. No clear internal strategy - or if there is it is not communicated. Ideas come down from on high with no discussion - and the people doing the job are expected to learn new skills in short timeframes with little to no training. Lack of care of the non-sales side of the workforce. You always feel dispensable and unsafe - you feel any member of staff could be made redundant at any time.", "advice": "Middle management need to be better at communication to the people who are actually expected to do the work. Treat staff like they are valued, not like numbers on a balance sheet."}, {"title": "The best company I've worked for originating from the owners 'can do' attitude, culture set and fellow employees.", "text": "Pros People, culture, ability to learn, hands on approach, and location all make this company so brilliant to work for. Very understanding managers. Cons Salary isn't great, initiatives can take a while to implement which can leave you a bit underwhelmed with new ideas. Advice to Management Keep going from strength to strength. Not one bad day at Incisive has been had", "rating": 5, "pros": "People, culture, ability to learn, hands on approach, and location all make this company so brilliant to work for. Very understanding managers.", "cons": "Salary isn't great, initiatives can take a while to implement which can leave you a bit underwhelmed with new ideas.", "advice": "Keep going from strength to strength. Not one bad day at Incisive has been had"}, {"title": "Amazing work culture and lots of opportunity", "text": "Pros Today is my last day working at Incisive Media and I will really miss this place. I have been given so much opportunity to learn about different areas of the business developing my skills in areas important to me. There is an amazing work culture here and there is a great work/life balance. The management team are fantastic and they encourage entrepreneurialism and creativity. It isn't often you have the pleasure of working for a company that cares so much about its people. Cons I don't have a single bad word to say about the company or its people. Thank you Incisive - I will never forget you!! Advice to Management Keep trusting and caring about your people - in turn, your people will continue to trust and care about you.", "rating": 5, "pros": "Today is my last day working at Incisive Media and I will really miss this place. I have been given so much opportunity to learn about different areas of the business developing my skills in areas important to me. There is an amazing work culture here and there is a great work/life balance. The management team are fantastic and they encourage entrepreneurialism and creativity. It isn't often you have the pleasure of working for a company that cares so much about its people.", "cons": "I don't have a single bad word to say about the company or its people. Thank you Incisive - I will never forget you!!", "advice": "Keep trusting and caring about your people - in turn, your people will continue to trust and care about you."}, {"title": "Business Development Manager", "text": "Pros This is a good place to start and have the opportunity to learn. You might also create a good network on the meantime. Well recognized firm with an incredible data base of contacts. Cons The conditions are not the greatest considering that its London and any opportunity to progress in the company is fairly limited.", "rating": 3, "pros": "This is a good place to start and have the opportunity to learn. You might also create a good network on the meantime. Well recognized firm with an incredible data base of contacts.", "cons": "The conditions are not the greatest considering that its London and any opportunity to progress in the company is fairly limited.", "advice": null}, {"title": "Avoid if you have ambiution or new ideas", "text": "Pros Nice people Good office location Good Social/Drinking environment ( good and bad) Cons Lacking in quality across the whole business Lack of new ideas and imagination A lack of strategy and direction DO NOT work here if have potential to succeed", "rating": 1, "pros": "Nice people", "cons": "Lacking in quality across the whole business", "advice": null}, {"title": "Central Function", "text": "Pros Great culture, creativity is encouraged and your skills are truly valued. Work / life balance actually exists and I feel enthusiastic about my job everyday! Cons There are none that I can think of.", "rating": 5, "pros": "Great culture, creativity is encouraged and your skills are truly valued. Work / life balance actually exists and I feel enthusiastic about my job everyday!", "cons": "There are none that I can think of.", "advice": null}, {"title": "Some great brands, some great people. Thoroughly enjoyed it, would have stayed if the financial side had been better.", "text": "Pros Some great brands, open culture, great MD (global and regional), Cons Some way to go on the tech side - specific to marketing/events. Database needed substantial dev. Incentive schemes were complex and not motivating. Sales making promises to clients that were very difficult to deliver to expectation Advice to Management Throw some money at technology. Examine the career progression for rising stars to ensure they stay with the business.", "rating": 5, "pros": "Some great brands, open culture, great MD (global and regional),", "cons": "Some way to go on the tech side - specific to marketing/events. Database needed substantial dev.", "advice": "Throw some money at technology."}, {"title": "Worst place I have ever worked", "text": "Pros none that come to mind, bad atmosphere - Cons as above just dire, bad atmosphere - bullying, dire to say the least Advice to Management treat people better", "rating": 1, "pros": "none that come to mind, bad atmosphere -", "cons": "as above just dire, bad atmosphere - bullying, dire to say the least", "advice": "treat people better"}, {"title": "Ok feeling", "text": "Pros Work and life balance Good team and people around you Cons No strategic directions Staff clueless on project goals and objective disconnect Advice to Management Need to communicate and have define clear objectives", "rating": 3, "pros": "Work and life balance", "cons": "No strategic directions", "advice": "Need to communicate and have define clear objectives"}, {"title": "Conference producer", "text": "Pros Flexible time when working and good reputation for many well established Brands. People are generally nice. Cons - very short sighted and focus too much on commercial gain without expanding and grow the brand value. - non- HQ have high turn over rate - not too fair in distributing works and pay - Salary and compensation less than peers - little space to train and grow Advice to Management More emphasis in getting the data fixed,have non HQ employees involve in decision making, value ppl more.", "rating": 3, "pros": "Flexible time when working and good reputation for many well established Brands. People are generally nice.", "cons": "- very short sighted and focus too much on commercial gain without expanding and grow the brand value.", "advice": "More emphasis in getting the data fixed,have non HQ employees involve in decision making, value ppl more."}, {"title": "Producer", "text": "Pros Friendly people, good work life balance and respect of your own plan Cons Sales driven and profit oriented culture, less innovation and not recommend for longer time career development Advice to Management Come to local offices often and hear about peoples real thought", "rating": 3, "pros": "Friendly people, good work life balance and respect of your own plan", "cons": "Sales driven and profit oriented culture, less innovation and not recommend for longer time career development", "advice": "Come to local offices often and hear about peoples real thought"}, {"title": "Disappointing, despite years of hard work, little recognition. Benefits and opportunities not meted out equally/fairly", "text": "Pros Friendly people; company always trying to innovate and advance. Central West End location. Cons Little career advancement or progression. Inconsistent appraisal process. Advice to Management More follow-through on employee satisfaction and career paths required.", "rating": 3, "pros": "Friendly people; company always trying to innovate and advance. Central West End location.", "cons": "Little career advancement or progression. Inconsistent appraisal process.", "advice": "More follow-through on employee satisfaction and career paths required."}, {"title": "Fair to middling", "text": "Pros Most of the staff are generally very good at their jobs and good to be around. Pay not too bad for the industry. Decent work-life balance without much overtime requirement. Cons Great deal of status-waving alpha male stuff from some managers. Dominated by sales culture to detriment of editorial values. Ageing places of work.", "rating": 3, "pros": "Most of the staff are generally very good at their jobs and good to be around. Pay not too bad for the industry. Decent work-life balance without much overtime requirement.", "cons": "Great deal of status-waving alpha male stuff from some managers. Dominated by sales culture to detriment of editorial values. Ageing places of work.", "advice": null}, {"title": "Good for new in the industry, not for long term", "text": "Pros The experience and chance to learn the ropes of publishing and events Cons chaotic and full of politics Advice to Management they should try to work on synergizing every team to work in harmony towards one goal", "rating": 3, "pros": "The experience and chance to learn the ropes of publishing and events", "cons": "chaotic and full of politics", "advice": "they should try to work on synergizing every team to work in harmony towards one goal"}, {"title": "Good place to start out as a journo but low pay", "text": "Pros Work with smart people, great for networking and building contacts in the financial industry. Cons HR are not human, poor management and generally not very many opportunities to progress as the firm ain't very profitable. Oh... and the pay ain't great either. Advice to Management Find some new managers.", "rating": 3, "pros": "Work with smart people, great for networking and building contacts in the financial industry.", "cons": "HR are not human, poor management and generally not very many opportunities to progress as the firm ain't very profitable. Oh... and the pay ain't great either.", "advice": "Find some new managers."}, {"title": "Generally Good but Management needs Improvement", "text": "Pros Relaxed Office Culture Flexibility in working Cons -Senior Management need to be more trusting of their teams and not treat them so patronizingly - Better recognition for newbies who have performed outstandingly -Some people who have been there 10+ years need to be moved on or moved out, they are stagnating and just waiting to retire, they do not seem to want to grow any more= dead wood - Managers need to be more accomodating to the variety of tastes of people, differences need to be celebrated and not shunned Advice to Management Do not assume everybody wants to drink alcohol at all times while socialising with colleagues after work. Focus on moving people and talent into suitable positions- some people are just WAY TOO comfortable!", "rating": 3, "pros": "Relaxed Office Culture", "cons": "-Senior Management need to be more trusting of their teams and not treat them so patronizingly", "advice": "Do not assume everybody wants to drink alcohol at all times while socialising with colleagues after work."}, {"title": "Good for beginning your career, not so great for career progression", "text": "Pros Really good with flexible working conditions, great office location, intelligent colleagues, very good environment for a beginning journalist. Cons A bit of a 'boys club' in my division - very few senior female employees - from what I've seen, most move on after a few years because they are not recognised or promoted to senior positions compared to the similar level male employees. Compensation should be higher for journalists, compared to the sales side, we are underpaid. Advice to Management Look closely as to why your female employees always move on to other jobs! Also, I've heard more than one member of staff mention that taking maternity leave is tantamount to effectively demoting oneself...", "rating": 3, "pros": "Really good with flexible working conditions, great office location, intelligent colleagues, very good environment for a beginning journalist.", "cons": "A bit of a 'boys club' in my division - very few senior female employees - from what I've seen, most move on after a few years because they are not recognised or promoted to senior positions compared to the similar level male employees. Compensation should be higher for journalists, compared to the sales side, we are underpaid.", "advice": "Look closely as to why your female employees always move on to other jobs! Also, I've heard more than one member of staff mention that taking maternity leave is tantamount to effectively demoting oneself..."}, {"title": "Fantastic Place to Work", "text": "Pros Very talented people Promote from within where possible, so great opportunities for first-jobbers through to senior management. Many different departments and there is scope to move from one to another for career progression. Wonderfully diverse workforce - please are employed and promoted on their merit alone. Excellent work/life balance and social life, especially for younger staff. Forward-thinking company committed to pushing new technology and new ways of delivering products. Employees are not micro-managed, and are given a lot of responsibility, so it's up to them to fly. There is a nice culture to the place, staff are treated extremely well compared to most other companies. Good selection of HR benefits - gym membership, childcare vouchers, that type of thing, plus a reasonably generous pension scheme. Some opportunities for senior staff to move to New York or Hong Kong offices. Cons Intra-office communication was difficult when there were two separate offices in London, bu this has now been resolved by consolidating the company to a single, rather super, office. Advice to Management Keep doing what you're doing - Incisive is a great place to work.", "rating": 5, "pros": "Very talented people", "cons": "Intra-office communication was difficult when there were two separate offices in London, bu this has now been resolved by consolidating the company to a single, rather super, office.", "advice": "Keep doing what you're doing - Incisive is a great place to work."}, {"title": "Great company and culture that over extended itself and looks like being broken up", "text": "Pros Brilliant, talented people Location Social life International travel Freedom to make decisions Cons Jobs for the boys at senior mgt level Mgt inability to make tough decisions about unprofitable products Made too many bad acquisitions Senior management very obviously out to protect their investment at the expense of everyone else", "rating": 5, "pros": "Brilliant, talented people", "cons": "Jobs for the boys at senior mgt level", "advice": null}, {"title": "A horrible place to work", "text": "Pros Commission was the only thing to look forward to and work towards Cons Majority of senior management were rude, unwelcoming and used foul language on a daily basis. Miscommunication between departments meant lower level workers were used as scapegoats. (This was also confirmed by the Managing Director himself- that people are used as scapegoats) Bullying is also overlooked-many members of staff reported a bullying culture and were ignored by HR. Advice to Management Listen to staff who have innovative ideas, be open to change, be kind to people", "rating": 1, "pros": "Commission was the only thing to look forward to and work towards", "cons": "Majority of senior management were rude, unwelcoming and used foul language on a daily basis.", "advice": "Listen to staff who have innovative ideas, be open to change, be kind to people"}, {"title": "Diversity", "text": "Pros Many different departments to chose from, great work life balance, good office location Cons Some departments are poorly managed and HR is there to do the bear minimum, trying to avoid any problems in magement of staff Advice to Management More meritocratic handling of staff, again, not in all departments", "rating": 3, "pros": "Many different departments to chose from, great work life balance, good office location", "cons": "Some departments are poorly managed and HR is there to do the bear minimum, trying to avoid any problems in magement of staff", "advice": "More meritocratic handling of staff, again, not in all departments"}, {"title": "Good starting point", "text": "Pros Encouraging managers, freedom to pursue avenues of interest, good training, sociable colleagues, very reasonable hours, relaxed environment and offices around the world. Basically a good place to start your career, I think. Cons The pay is not great, the work can get repetitive, editorial incentives are lacking, the co-ordination across different departments (events, marketing, editorial, sales) can be a little haphazard.", "rating": 5, "pros": "Encouraging managers, freedom to pursue avenues of interest, good training, sociable colleagues, very reasonable hours, relaxed environment and offices around the world. Basically a good place to start your career, I think.", "cons": "The pay is not great, the work can get repetitive, editorial incentives are lacking, the co-ordination across different departments (events, marketing, editorial, sales) can be a little haphazard.", "advice": null}, {"title": "Dinosaur", "text": "Pros Good collegiate culture Fun environment Cons Publishing for the dark ages Naive about the changes in media - until it was too late Sales led culture Advice to Management Set a vision of a new company you are trying to build Trim the old school publishing mentality", "rating": 3, "pros": "Good collegiate culture", "cons": "Publishing for the dark ages", "advice": "Set a vision of a new company you are trying to build"}, {"title": "good starting point for grads", "text": "Pros good stepping stone out of university to start as a graduate Cons poor pay. Certain senior sales roles hit a plateau and no where else to go unless changing division or publication you were on", "rating": 3, "pros": "good stepping stone out of university to start as a graduate", "cons": "poor pay. Certain senior sales roles hit a plateau and no where else to go unless changing division or publication you were on", "advice": null}, {"title": "Journalist at Incisive Media", "text": "Pros Some great colleagues, fairly sociable workplace, respected in the industry Cons Bad pay, some politics/in-fighting, career progression slow and staff turnover is high. Advice to Management Pay staff better, encourage cross company integration, ensure career routes are made clear.", "rating": 3, "pros": "Some great colleagues, fairly sociable workplace, respected in the industry", "cons": "Bad pay, some politics/in-fighting, career progression slow and staff turnover is high.", "advice": "Pay staff better, encourage cross company integration, ensure career routes are made clear."}, {"title": "Fair employers (by and large) in a cut-throat sector", "text": "Pros Collegiate atmosphere, willingness to train staff, generally good people managers, initiative usually encouraged, pretty supportive management in times of personal difficulty. Cons Wages could be better! (Common industry complaint), some inexperience at line management level, could do with more opportunities to stay with company for career progress.", "rating": 5, "pros": "Collegiate atmosphere, willingness to train staff, generally good people managers, initiative usually encouraged, pretty supportive management in times of personal difficulty.", "cons": "Wages could be better! (Common industry complaint), some inexperience at line management level, could do with more opportunities to stay with company for career progress.", "advice": null}, {"title": "An invigorating challenge", "text": "Pros Great people, hard working, good team environment. Cons Long hours, shifting priorities, frequency of change. Advice to Management you do the best you can with what you've got.", "rating": 5, "pros": "Great people, hard working, good team environment.", "cons": "Long hours, shifting priorities, frequency of change.", "advice": "you do the best you can with what you've got."}, {"title": "A good place to learn the ins and outs of B2B publishing", "text": "Pros People People People Nice atmosphere Offices in Soho Easy to commute to Forward thinking company Challenging job Cons Salary and bonus not aggressive Advice to Management Keep investing in people", "rating": 5, "pros": "People", "cons": "Salary and bonus not aggressive", "advice": "Keep investing in people"}, {"title": "A great place to build a career in Media", "text": "Pros Dynamic leadership Great brands Not afraid to try new things Innovation has high priority Cons Some dead wood still needs clearing Sometimes print publisher culture inhibits development Advice to Management Thin out management", "rating": 5, "pros": "Dynamic leadership", "cons": "Some dead wood still needs clearing", "advice": "Thin out management"}, {"title": "Frustrating", "text": "Pros There are some good people there Cons the company is poorly integrated and divided into fiefdoms as a legacy of previous takeovers. There is a sweatshop atmosphere for junior staff. While senior staff are adequately rewarded, it is impossible for a manager to attract or retain talent. A classic case study of private equity leverage proving destructive. Advice to Management Stop believing in your own propaganda", "rating": 3, "pros": "There are some good people there", "cons": "the company is poorly integrated and divided into fiefdoms as a legacy of previous takeovers. There is a sweatshop atmosphere for junior staff. While senior staff are adequately rewarded, it is impossible for a manager to attract or retain talent. A classic case study of private equity leverage proving destructive.", "advice": "Stop believing in your own propaganda"}, {"title": "Aggressive management yet to adapt to different cultural environments", "text": "Pros - Having leading brands in target markets - Talented people - Aggressive growth plans - Generally good leadership in senior management Cons -Lack of inter-BU communications - Yet to adapt to different cutural and business environments outside of the U.K. - conservative and short term view in growing new business lines Advice to Management -Have long term vision - Be more local - Promote inter-departmental communications", "rating": 3, "pros": "- Having leading brands in target markets", "cons": "-Lack of inter-BU communications", "advice": "-Have long term vision"}, {"title": "Great place to work, just a few minor tweaks required", "text": "Pros Inspiring leader Innovation is focus Great people Cons Need to listen Get management structure right Advice to Management Need to communicate", "rating": 5, "pros": "Inspiring leader", "cons": "Need to listen", "advice": "Need to communicate"}, {"title": "It' s better than the average London media companies", "text": "Pros I have worked in a few media companies in the sector: the people are friendly and the management is reliable in general. If you like what you do, and you show a good work and enthusiasm , you could grow in the company. There are more women then in any other media company I worked for; which is good if you consider that men are usually the majority of the staff in such environments. Cons The work is often monotone. Despite there are several meetings to attend for sharing ideas and plans within different departments; it seems there is not real interaction. I have realized that the marketing strategy deployed by the company is sometimes naive. Advice to Management I would organize classes or developments trainings on specific subjects.For example there are several people who are selling products without knowing what is for.", "rating": 3, "pros": "I have worked in a few media companies in the sector: the people are friendly and the management is reliable in general.", "cons": "The work is often monotone.", "advice": "I would organize classes or developments trainings on specific subjects.For example there are several people who are selling products without knowing what is for."}, {"title": "A nice place to work, but poor pay", "text": "Pros Great company culture; a great place to meet lovely people; brilliant location in the city centre, interesting job with international travel Cons pay is really poor and barely livable Advice to Management Pay people at least the market rate!!!", "rating": 3, "pros": "Great company culture; a great place to meet lovely people; brilliant location in the city centre, interesting job with international travel", "cons": "pay is really poor and barely livable", "advice": "Pay people at least the market rate!!!"}, {"title": "Good place to work for awhile...", "text": "Pros Good work life balance and appreciation that people have other things going on in life. Cons Not a lot of opportunity for growth after awhile, at least in my division. Advice to Management I'd put more of an emphasis on technology.", "rating": 5, "pros": "Good work life balance and appreciation that people have other things going on in life.", "cons": "Not a lot of opportunity for growth after awhile, at least in my division.", "advice": "I'd put more of an emphasis on technology."}, {"title": "Kleines Büro und guter Platz zum Arbeiten.", "text": "Pros Gute Kultur und Arbeitswelt, gute Arbeit-Leben-Balance, nettes höheres Management Good culture and work environment, good work/life balance, nice upper management Cons schlechte Entschädigung und Karrierechancen poor compensation and career opportunities", "rating": 3, "pros": "Gute Kultur und Arbeitswelt, gute Arbeit-Leben-Balance, nettes höheres Management", "cons": "schlechte Entschädigung und Karrierechancen", "advice": null}]