[{"title": "Growing B2B Information Company", "text": "Pros Diversified B2B information/content company with lots of varied opportunities through out the world. Cons Sometime bureaucratic; internal systems and processes are a drag on productivity but company is trying to improve this.", "rating": 5, "pros": "Diversified B2B information/content company with lots of varied opportunities through out the world.", "cons": "Sometime bureaucratic; internal systems and processes are a drag on productivity but company is trying to improve this.", "advice": null}, {"title": "Admin", "text": "Pros Awesome company to work for. Great people, wonderful products, fun environment Cons None I can see so far", "rating": 5, "pros": "Awesome company to work for. Great people, wonderful products, fun environment", "cons": "None I can see so far", "advice": null}, {"title": "Assistant", "text": "Pros Nice people to work with Cons Could have better pay and insurance", "rating": 3, "pros": "Nice people to work with", "cons": "Could have better pay and insurance", "advice": null}, {"title": "Unprofessional", "text": "Pros Has different offices to work from. Cons Unprofessional culture and no cohesion in the company, too many ancilliary companies with no shared mission. Advice to Management Streamline your target market. You can't be everything to everybody.", "rating": 3, "pros": "Has different offices to work from.", "cons": "Unprofessional culture and no cohesion in the company, too many ancilliary companies with no shared mission.", "advice": "Streamline your target market. You can't be everything to everybody."}, {"title": "Low Morale", "text": "Pros Breakfast on Mondays, and that I get to travel for work. Cons Terrible pay, no bonus or raise. Every time I bring the conversation up there is always an excuse. \"We were recently acquired so that hasn't been discussed.\" No room for growth. Complete lack of transparency!!! Secrecy everywhere and every time we have a town hall none of our questions are answered. Lots of blame being passed around. Instead of finding productive solutions. Certain teams get better benefits than others. BI gets the week of Christmas off but everyone else has to use their vacation days if they want to have that time off. The company itself is really boring, not a place you want to come work at. We only had a holiday party because people complained there was nothing going on. Advice to Management Make benefits for ALL employees because the way you're doing things is causing a divide.", "rating": 3, "pros": "Breakfast on Mondays, and that I get to travel for work.", "cons": "Terrible pay, no bonus or raise. Every time I bring the conversation up there is always an excuse. \"We were recently acquired so that hasn't been discussed.\"", "advice": "Make benefits for ALL employees because the way you're doing things is causing a divide."}, {"title": "Great People to work with", "text": "Pros Co Workers are amazing, once one of the best commodity data research companies around Cons Pay isn't that great, LONG LONG Hours on Fridays 7/8pm every Friday, Management seems to be disconnected, unorganized company. Advice to Management Management needs to understand what goes on in order to correct the problems instead of turning the other way. To become more in tune with the daily tasks and reports maybe put effort in understanding it by watching or shadowing the positions.", "rating": 3, "pros": "Co Workers are amazing, once one of the best commodity data research companies around", "cons": "Pay isn't that great, LONG LONG Hours on Fridays 7/8pm every Friday, Management seems to be disconnected, unorganized company.", "advice": "Management needs to understand what goes on in order to correct the problems instead of turning the other way. To become more in tune with the daily tasks and reports maybe put effort in understanding it by watching or shadowing the positions."}, {"title": "Manger", "text": "Pros We all work well together and consider each other friends above coworkers. We get plenty of PTO and sick time, as well as great benefits. Everyone has access to the office gym, the coffee is fresh and free and there's covered parking for the veteran employees. Cons Our office was recently acquired by Informa so we're in an awkward stage of becoming \"one\" across the offices worldwide. While the umbrella effect is helpful to some offices, many of our office employees feel handicapped by the corporate approach. Advice to Management One size does not fit all. For the sake of simplicity, I understand the desire for everyone to use the same applications and procedures, but if you have a winning greyhound, you don't amputate one of it's legs so the rest of the pack can catch up.", "rating": 5, "pros": "We all work well together and consider each other friends above coworkers. We get plenty of PTO and sick time, as well as great benefits. Everyone has access to the office gym, the coffee is fresh and free and there's covered parking for the veteran employees.", "cons": "Our office was recently acquired by Informa so we're in an awkward stage of becoming \"one\" across the offices worldwide. While the umbrella effect is helpful to some offices, many of our office employees feel handicapped by the corporate approach.", "advice": "One size does not fit all. For the sake of simplicity, I understand the desire for everyone to use the same applications and procedures, but if you have a winning greyhound, you don't amputate one of it's legs so the rest of the pack can catch up."}, {"title": "Business Analyst", "text": "Pros Work environment and the people in my location are awesome. Cons Too many management layers!!! \"I've got 8 bosses Bob, 8 bosses\"", "rating": 5, "pros": "Work environment and the people in my location are awesome.", "cons": "Too many management layers!!! \"I've got 8 bosses Bob, 8 bosses\"", "advice": null}, {"title": "Company review", "text": "Pros Great work-life balance. Frequent employee morale boosting events Cons Because of salary, No overtime", "rating": 5, "pros": "Great work-life balance. Frequent employee morale boosting events", "cons": "Because of salary, No overtime", "advice": null}, {"title": "Sales Executive", "text": "Pros Great products, excellent co-workers, empower people to take leadership with your product Cons Company moved team to Boston from Suburbs", "rating": 5, "pros": "Great products, excellent co-workers, empower people to take leadership with your product", "cons": "Company moved team to Boston from Suburbs", "advice": null}, {"title": "Good experience", "text": "Pros The company has grown a lot over the last 20 years. Has a strong global network. Lots of opportunities within the company and offers competitive benefits. Cons Upper management turnover over the last few years has changed the direction of the company's strategy. Seemed like the last group of managers had it right, time will tell if the new group will have the same success. Advice to Management Follow the lead of your predecessors.", "rating": 5, "pros": "The company has grown a lot over the last 20 years. Has a strong global network. Lots of opportunities within the company and offers competitive benefits.", "cons": "Upper management turnover over the last few years has changed the direction of the company's strategy. Seemed like the last group of managers had it right, time will tell if the new group will have the same success.", "advice": "Follow the lead of your predecessors."}, {"title": "IT Engineer", "text": "Pros I work with some wonderful people. Cons They should really hire Tier 1 Support.", "rating": 3, "pros": "I work with some wonderful people.", "cons": "They should really hire Tier 1 Support.", "advice": null}, {"title": "Great starting company", "text": "Pros flexible work environment, and benefits Cons Growth, and Company's main focuses are expanding the sales environment", "rating": 3, "pros": "flexible work environment, and benefits", "cons": "Growth, and Company's main focuses are expanding the sales environment", "advice": null}, {"title": "Great Place to Learn", "text": "Pros Great Benefits My manager was super approachable ability to travel dress down environment Cons pay is super low poor moral in office office is outdated (All though their moving) Disconnect from upper management No training No Career growth", "rating": 3, "pros": "Great Benefits", "cons": "pay is super low", "advice": null}, {"title": "Marketing", "text": "Pros My team was excellent and offered great work/life balance. Fun workplace and content. My team was allowed to track OT and take it as lieu time. Cons Extremely low pay. Certain teams (like FAN EXPO) are assigned multiple shows and work like crazy and are not allowed to track their OT and take lieu days and it's hard to see really hard-working, dedicated people being taken advantage of. The management of that show also regularly walks a thin line between what is ethical and what is not. Few opportunities for career advancement or upward movement. A completely useless HR department which was unable to provide any HR support to the staff. Advice to Management Make people feel supported and provide them with opportunities to have a future at Informa.", "rating": 5, "pros": "My team was excellent and offered great work/life balance. Fun workplace and content. My team was allowed to track OT and take it as lieu time.", "cons": "Extremely low pay. Certain teams (like FAN EXPO) are assigned multiple shows and work like crazy and are not allowed to track their OT and take lieu days and it's hard to see really hard-working, dedicated people being taken advantage of. The management of that show also regularly walks a thin line between what is ethical and what is not.", "advice": "Make people feel supported and provide them with opportunities to have a future at Informa."}, {"title": "big, messy company", "text": "Pros flexibility...that's really it for me. Cons horizontal structure of company, misaligned management, communications, and strategy.", "rating": 3, "pros": "flexibility...that's really it for me.", "cons": "horizontal structure of company, misaligned management, communications, and strategy.", "advice": null}, {"title": "KNect 365 - IoT", "text": "Pros San Francisco office is in a popular location. Cons Terrible bonus structure coupled with below market pay. No room for lateral or vertical growth. Professional development is almost nonexistent. Incompetent managers from the UK making senseless decisions in the US that work against the very events they are trying to promote. Complete lack of transparency and direction. Business model focuses more on acquiring other businesses to appease the shareholders rather than development of actual product. Double standards left and right. No HR present in the office, or even centrally at the moment. Severe amounts of micromanagement across the board. Steady use of the 'blame game' for projects that go awry; mostly due to the giant leadership void. Very, very disorganized. Low company morale. Just one giant, mindless machine plugging along. Advice to Management Pretty much fixing everything in listed in the 'cons' section.", "rating": 1, "pros": "San Francisco office is in a popular location.", "cons": "Terrible bonus structure coupled with below market pay. No room for lateral or vertical growth. Professional development is almost nonexistent. Incompetent managers from the UK making senseless decisions in the US that work against the very events they are trying to promote. Complete lack of transparency and direction. Business model focuses more on acquiring other businesses to appease the shareholders rather than development of actual product. Double standards left and right. No HR present in the office, or even centrally at the moment. Severe amounts of micromanagement across the board. Steady use of the 'blame game' for projects that go awry; mostly due to the giant leadership void. Very, very disorganized. Low company morale. Just one giant, mindless machine plugging along.", "advice": "Pretty much fixing everything in listed in the 'cons' section."}, {"title": "Great Management and Training", "text": "Pros Incredibly dedicated managers provide constant training and transparent feedback both through their responsibility as a manager and on request from employees. Cons Some managers being located overseas can prove difficult.", "rating": 5, "pros": "Incredibly dedicated managers provide constant training and transparent feedback both through their responsibility as a manager and on request from employees.", "cons": "Some managers being located overseas can prove difficult.", "advice": null}, {"title": "A look back....", "text": "Pros Working environment and location along with the job function. Cons Upper Management and strategic direction.", "rating": 3, "pros": "Working environment and location along with the job function.", "cons": "Upper Management and strategic direction.", "advice": null}, {"title": "Chaos and overwork", "text": "Pros Potential to travel, offices everywhere, the high level management seems to care about it's people. Lots of varied and interesting work to do. Cons Lots of rule by committee, work is only done by a few individuals and decisions are made by people of questionable compentcy. Advice to Management Reevaulate management positions, middle management especially.", "rating": 3, "pros": "Potential to travel, offices everywhere, the high level management seems to care about it's people. Lots of varied and interesting work to do.", "cons": "Lots of rule by committee, work is only done by a few individuals and decisions are made by people of questionable compentcy.", "advice": "Reevaulate management positions, middle management especially."}, {"title": "Director, Events", "text": "Pros Office is centrally located, you can work from home Cons Sad office, no leadership, very small pay increases", "rating": 3, "pros": "Office is centrally located, you can work from home", "cons": "Sad office, no leadership, very small pay increases", "advice": null}, {"title": "consultant", "text": "Pros good learning exp and great team Cons salary not up to industry level Advice to Management expand coverage", "rating": 5, "pros": "good learning exp and great team", "cons": "salary not up to industry level", "advice": "expand coverage"}, {"title": "You get what you put into it", "text": "Pros I'm always surrounded by some very smart people and I have infinite opportunities to learn new things. Cons The UK headquarters have a massive bureaucratic structure that makes it very hard to react to market opportunities. Advice to Management Give the separate branches more of an opportunity to make autonomous decisions on time critical issues.", "rating": 5, "pros": "I'm always surrounded by some very smart people and I have infinite opportunities to learn new things.", "cons": "The UK headquarters have a massive bureaucratic structure that makes it very hard to react to market opportunities.", "advice": "Give the separate branches more of an opportunity to make autonomous decisions on time critical issues."}, {"title": "If I could give it zero stars I would", "text": "Pros Ability to work from home, which is also a con because you may see your colleagues only a few times a year. Cons This is the worst place I ever worked for many reasons but mostly it's because they don't know how to cultivate employees, have an effective structure or reward performers. Advice to Management Mentor your employees, bring them together as teams, create transparency and an environment where people enjoy working.", "rating": 1, "pros": "Ability to work from home, which is also a con because you may see your colleagues only a few times a year.", "cons": "This is the worst place I ever worked for many reasons but mostly it's because they don't know how to cultivate employees, have an effective structure or reward performers.", "advice": "Mentor your employees, bring them together as teams, create transparency and an environment where people enjoy working."}, {"title": "Awesome place to work!", "text": "Pros Great, smart people. Awesome management team. Cons Client demands can be tough Advice to Management Continuing the good work/life balance", "rating": 5, "pros": "Great, smart people. Awesome management team.", "cons": "Client demands can be tough", "advice": "Continuing the good work/life balance"}, {"title": "Sales Rep for a Tradeshow", "text": "Pros Positive work environment, great people Cons The working hours can be tough.", "rating": 5, "pros": "Positive work environment, great people", "cons": "The working hours can be tough.", "advice": null}, {"title": "Corporate Account Manager", "text": "Pros -Uncapped commission opportunity -lots of opportunity with current customer base and new clients -Room for promotions or vertical and horizontal growth -solid products with good market reputation Cons -Political environment -Weak marketing presence/ lack of inbound leads -little training Advice to Management Train your new employees better! Encourage more face to face meetings with customers and potential new customers.", "rating": 5, "pros": "-Uncapped commission opportunity", "cons": "-Political environment", "advice": "Train your new employees better! Encourage more face to face meetings with customers and potential new customers."}, {"title": "This company is at the top of the heap!", "text": "Pros They are undergoing an extensive \"digital transformation\", they have several women managers, they have good benefits and are growing by leaps and bounds. Additionally, you get exposed to colleagues and cultures all over the world. Cons There really are no cons. Advice to Management Keep doing what you're doing!", "rating": 5, "pros": "They are undergoing an extensive \"digital transformation\", they have several women managers, they have good benefits and are growing by leaps and bounds. Additionally, you get exposed to colleagues and cultures all over the world.", "cons": "There really are no cons.", "advice": "Keep doing what you're doing!"}, {"title": "Downwardly mobile company", "text": "Pros Conveniently located- across the street from Grand Central. Fun and creative people. Cons The company is in massive contraction. London headquarters taking back control. The firm has Bb=een going on an acquisition spree of large events, but once those new events are folded into the Informa \"way\" everyone gets frustrated and looks to the door. Pay is poor, under industry standards. \"Profit sharing\" is a fallacy, if your event makes money, they'll come up with an excuse not to pay you. Advice to Management Leave... you've been there too long. There's a whole world out there with different (and better) ways to run a business.", "rating": 3, "pros": "Conveniently located- across the street from Grand Central. Fun and creative people.", "cons": "The company is in massive contraction. London headquarters taking back control. The firm has Bb=een going on an acquisition spree of large events, but once those new events are folded into the Informa \"way\" everyone gets frustrated and looks to the door. Pay is poor, under industry standards. \"Profit sharing\" is a fallacy, if your event makes money, they'll come up with an excuse not to pay you.", "advice": "Leave... you've been there too long. There's a whole world out there with different (and better) ways to run a business."}, {"title": "Informa - Sales", "text": "Pros Networking Learning Traveling Connection Product Cons Not enough traveling. Not enough digital offerings", "rating": 3, "pros": "Networking Learning Traveling Connection Product", "cons": "Not enough traveling. Not enough digital offerings", "advice": null}, {"title": "Great place to work if you're in sales", "text": "Pros home office support while you're on the road Cons none that i can add", "rating": 5, "pros": "home office support while you're on the road", "cons": "none that i can add", "advice": null}, {"title": "Terrible company/Terrible people/Terrible pay", "text": "Pros Work life balance is the only good thing. Cons There are some people who are writing scam reviews here. I have seen first-hand from my group, where my colleague said he has been asked to write a 'glorious review' using two different email accounts. It is pathetic that management would stoop down to such desperate levels to blatantly lie about the company. This is a terrible org all around. It has many subdivisions under it and the pay is pathetic across all divisions. They lie about the'profit sharing'...ive been with them over three years and got zero bonus and zero pay raise and i was considered as their top performer. Management is shiesty - will probably keep the bulk for themselves and pay nothing to the employees. Highly recommend to not work here. The interview process was like as if they are Goldman Sachs or KKR...when you start working you realize how pathetic the workplace is. Advice to Management Leave - dont act smart - the turnover is high for a reason. Respect people and pay them accordingly.", "rating": 1, "pros": "Work life balance is the only good thing.", "cons": "There are some people who are writing scam reviews here. I have seen first-hand from my group, where my colleague said he has been asked to write a 'glorious review' using two different email accounts. It is pathetic that management would stoop down to such desperate levels to blatantly lie about the company. This is a terrible org all around. It has many subdivisions under it and the pay is pathetic across all divisions. They lie about the'profit sharing'...ive been with them over three years and got zero bonus and zero pay raise and i was considered as their top performer. Management is shiesty - will probably keep the bulk for themselves and pay nothing to the employees. Highly recommend to not work here. The interview process was like as if they are Goldman Sachs or KKR...when you start working you realize how pathetic the workplace is.", "advice": "Leave - dont act smart - the turnover is high for a reason. Respect people and pay them accordingly."}, {"title": "Sales", "text": "Pros Peers are very supportive. Cons Working in the financial vertical was outside the core company strategy of conferencing. The parent refuses to invest in the vertical since it outside its core competency and the result is poor technology and no long term strategy.", "rating": 3, "pros": "Peers are very supportive.", "cons": "Working in the financial vertical was outside the core company strategy of conferencing. The parent refuses to invest in the vertical since it outside its core competency and the result is poor technology and no long term strategy.", "advice": null}, {"title": "Performance analyst", "text": "Pros Easy position if you lack experience. The firm gives you access to bank statements and basic finance subjects. Other than that there is not much good to say. Cons All around poor experience. Low pay with a worthless bonus system. The office is full of people who could care less about their work and even less about the other people in the office. The amount of turnover is beyond high due to the unrealistic work load given to each analyst. Advice to Management Completely change compensation. Increase office culture from zero to anything. Remove the management team and begin anew. To say that they are toxic for the office is an understatement", "rating": 1, "pros": "Easy position if you lack experience. The firm gives you access to bank statements and basic finance subjects. Other than that there is not much good to say.", "cons": "All around poor experience. Low pay with a worthless bonus system. The office is full of people who could care less about their work and even less about the other people in the office.", "advice": "Completely change compensation. Increase office culture from zero to anything. Remove the management team and begin anew. To say that they are toxic for the office is an understatement"}, {"title": "Audience development manager", "text": "Pros Good work environment and work life balance Cons Lack of good benefits and direction", "rating": 3, "pros": "Good work environment and work life balance", "cons": "Lack of good benefits and direction", "advice": null}, {"title": "Great employees, poor executive management", "text": "Pros Dedicated staff with over 10 years experience through acquisitions. Cons Too many new managers with different ideas how to grow and sustain business. They don't see value in long term staff, only want to make changes whether good or bad. Clients will suffer with call center environment. Advice to Management None, you already know everything and don't listen to people below you who might have something beneficial to offer or learn.", "rating": 3, "pros": "Dedicated staff with over 10 years experience through acquisitions.", "cons": "Too many new managers with different ideas how to grow and sustain business. They don't see value in long term staff, only want to make changes whether good or bad. Clients will suffer with call center environment.", "advice": "None, you already know everything and don't listen to people below you who might have something beneficial to offer or learn."}, {"title": "Accountant", "text": "Pros Great place for an entry level position. Cons Pay is extremely low for the work required. Advice to Management Increase pay", "rating": 3, "pros": "Great place for an entry level position.", "cons": "Pay is extremely low for the work required.", "advice": "Increase pay"}, {"title": "Rather not say", "text": "Pros Friendly atmosphere with great people! Telecommuting one day a week (at manager's discretion). Cons Lower than average salaries, tiny raises despite a good review and going above. Few perks to non-sales & execs. Advice to Management Value everyone that makes it happen, not just the execs and sales people. Praise is only given to the manager of a team and ignores the team members.", "rating": 3, "pros": "Friendly atmosphere with great people! Telecommuting one day a week (at manager's discretion).", "cons": "Lower than average salaries, tiny raises despite a good review and going above. Few perks to non-sales & execs.", "advice": "Value everyone that makes it happen, not just the execs and sales people. Praise is only given to the manager of a team and ignores the team members."}, {"title": "Pharma Intelligence Consulting", "text": "Pros People are extremely friendly and talented. Daily work is very enjoyable with the great people around you. A broad coverage of consulting works, and a great learning experience for young professionals with bright exit options. Cons Compensation and bonus incentives are cons. Advice to Management Keep up the great work and awesome characters!", "rating": 5, "pros": "People are extremely friendly and talented. Daily work is very enjoyable with the great people around you. A broad coverage of consulting works, and a great learning experience for young professionals with bright exit options.", "cons": "Compensation and bonus incentives are cons.", "advice": "Keep up the great work and awesome characters!"}, {"title": "Terrible Place- it is NOT a startup culture they claim to be", "text": "Pros NONE- biggest regret and poor decision to work here Cons -terrible management -no clear set goals -terrible culture- no one cares what you do -no growth in the company - redundant tasks Advice to Management - take the time to care about your colleagues FOR ONCE - terrible on-boarding process -no clear strategies or goals - boring place - don't be so short sighted & ignorant", "rating": 1, "pros": "NONE- biggest regret and poor decision to work here", "cons": "-terrible management", "advice": "- take the time to care about your colleagues FOR ONCE"}, {"title": "Toxic Environment - Uninvolved Management", "text": "Pros Work with big name companies Lots of opportunities to develop new skills and learn Cons Management is uninvolved and really just doesn't care about you Team morale is extremely low 70% of the time and you can really feel the drag of being at work Below market wages Sneaky and largely unattainable bonus structures Very little integrity within management which seeps out into the company at large which makes for a very unfulfilling work experience Advice to Management Your employees are watching you whether you want to see it or not", "rating": 1, "pros": "Work with big name companies", "cons": "Management is uninvolved and really just doesn't care about you", "advice": "Your employees are watching you whether you want to see it or not"}, {"title": "Informa: Where we throw away innovation and time, daily!", "text": "Pros Opportunity to work with tech companies. When you build a good number of relationships, jumping ship and finding meaningful work is easy. Cons An example task embodies much of my answer: \"Self -generate and qualify 200 new leads, make 80+ cold calls, close 6 deals, and enter everything about these leads into the new version of Salesforce--which, btw, an internal consultant openly scolded management for not understanding its prior edition--within 48 hours.\" Though I can't stand PC jargon, this is hands-down the most passive-aggressive work climate I've seen in real life or on TV. Couple the previous task with a superior staring at you ~40% of a 15hr day, and while making snarky remarks that everyone will hear and critique you on. Dream job, right? To recount, we've covered unreasonable tasks. uneducated management, zero professionalism, and one more thing--you're selling slots to events that cost $$$s, albeit there are better (and free) exhibits for premier prospects. Bit of a con there... Advice to Management Explore a corporate vision. Build a culture founded on leadership, relationship building, and data analysis that extends beyond internal micro-managing. Take time to analyze your competition. Lose the UK bigotry--it's not appealing in educated, international cities", "rating": 1, "pros": "Opportunity to work with tech companies. When you build a good number of relationships, jumping ship and finding meaningful work is easy.", "cons": "An example task embodies much of my answer: \"Self -generate and qualify 200 new leads, make 80+ cold calls, close 6 deals, and enter everything about these leads into the new version of Salesforce--which, btw, an internal consultant openly scolded management for not understanding its prior edition--within 48 hours.\"", "advice": "Explore a corporate vision. Build a culture founded on leadership, relationship building, and data analysis that extends beyond internal micro-managing. Take time to analyze your competition. Lose the UK bigotry--it's not appealing in educated, international cities"}, {"title": "Worst Company I Have Ever Worked For", "text": "Pros I honestly cannot think of one pro while working at Informa. I did meet some very nice people though. Cons Terrible Leadership. Very fluid working environment. Constant layoffs. Huge big brother mentality watching every single move and call you make. Frequent changes in strategy that shows a lack of leadership and confidence. I would never work for this company again or allow anyone I know to work for them. Advice to Management My advice to management is to get new management. Due to the high turnover and changes, I had five different bosses in the span of two years. Do a better a job.", "rating": 1, "pros": "I honestly cannot think of one pro while working at Informa. I did meet some very nice people though.", "cons": "Terrible Leadership. Very fluid working environment. Constant layoffs. Huge big brother mentality watching every single move and call you make. Frequent changes in strategy that shows a lack of leadership and confidence. I would never work for this company again or allow anyone I know to work for them.", "advice": "My advice to management is to get new management. Due to the high turnover and changes, I had five different bosses in the span of two years. Do a better a job."}, {"title": "Ok job", "text": "Pros Great people at the LA office lots of hours and hard work but everyone made the job at hand easier. Cons Management very set in their ways and felt like it was going to be really hard to move up fast Advice to Management Grow the good people", "rating": 3, "pros": "Great people at the LA office lots of hours and hard work but everyone made the job at hand easier.", "cons": "Management very set in their ways and felt like it was going to be really hard to move up fast", "advice": "Grow the good people"}, {"title": "Heading in a Questionable Direction", "text": "Pros Some really nice and talented people work there. Opportunity to learn quite a bit of useful information about commodity markets in a short amount of time. Ability to glean meaningful experience in practical applications of agricultural economics. Cons Company is overhauling its image to emphasize sales, marketing, and technology but at the expense of quality research and analytics. Senior management in Memphis is stubborn in its decision-making, refusing to budge even after following a course that is clearly wrong-headed. Corporate overseers in London are often overbearing and uncaring. Very collectivist mindset with regard to compensation as opposed to willingness to reward outstanding individual achievement. Tom Scott is the CEO, not Bruce Scherr as the Glassdoor default indicates. Advice to Management Get back to recruiting, investing in, and rewarding/retaining extremely talented people and valuing their contributions and ability to crank out high-quality content to clients or prepare for a big hit to your reputation and possible death spiral of the business structure.", "rating": 3, "pros": "Some really nice and talented people work there. Opportunity to learn quite a bit of useful information about commodity markets in a short amount of time. Ability to glean meaningful experience in practical applications of agricultural economics.", "cons": "Company is overhauling its image to emphasize sales, marketing, and technology but at the expense of quality research and analytics. Senior management in Memphis is stubborn in its decision-making, refusing to budge even after following a course that is clearly wrong-headed. Corporate overseers in London are often overbearing and uncaring. Very collectivist mindset with regard to compensation as opposed to willingness to reward outstanding individual achievement. Tom Scott is the CEO, not Bruce Scherr as the Glassdoor default indicates.", "advice": "Get back to recruiting, investing in, and rewarding/retaining extremely talented people and valuing their contributions and ability to crank out high-quality content to clients or prepare for a big hit to your reputation and possible death spiral of the business structure."}, {"title": "sales", "text": "Pros company phone, happy hours, semi-inolved management Cons very poor training, high stress environment Advice to Management more organized training program", "rating": 3, "pros": "company phone, happy hours, semi-inolved management", "cons": "very poor training, high stress environment", "advice": "more organized training program"}, {"title": "Not as bad as it could be but could be much better, no doubt.", "text": "Pros -Big company name that will supplement you resume/ CV -Exciting industry as a whole -Excellent networking opportunities -Nice people -Good benefits -You do not have to earn PTO, it is given up front -Educative -Depending on what your role is, the bonus incentives are quite generous -Travel opportunities (both domestic and abroad) Cons -Below market pay -Poor interdepartmental communication -Very disorganized -Nontransparent -Undefined company culture -Frequent dips down into low team morale -Leadership from Upper Management is uninvolved -Can be a very \"sneaky\" and \"hush, hush\" environment -Little investment into the employee Advice to Management -Excellent job on staying involved in a leading edge and innovative industry. As a whole, the company direction seems clear. -Strengthen the communication channels between departments and regions, a simple monthly newsletter does not suffice for delivering collective knowledge. -Try to better organize things from the business side. Events seem scrambled and discombobulated when you do not give a step-by-step game plan for how to work an event. This disorganization is compounded when you have weak communication between teams. -Define a company culture. True, there are \"values\" mentioned when hiring on, but these seemed contrived and vague, at best. Make it a place where people will want to work by establishing a culture that breeds success and motivation. Turn over rate is high because people who do not seem to jive with the team are constantly hired. Take a step back and bring in the right people that will further the enjoyment of others working here, along with the company as well. -Weak company culture, plus all the points mentioned thus far, lead to a low team morale. Constant back talking and gossip are all too frequent within the company. It seems like everyone has several issues that they need to vent about, which should suggest an investigation into overall staff satisfaction. -Greatly improve leadership presence, perhaps even enroll your management in proper leadership training. It may be a blow to your managers' egos, but at the end it will increase productivity and morale. Managers will have a better awareness of how to successfully manage a team and employees will rest assured knowing that their manager has the right mindset to lead. There is an obvious gap between the team and the leader. While it may not be intentional, this gap comes off as apathy towards the team, from the leader. Occasional emails of encouragement, or better yet, team bonding will motivate your employees by letting them know you care. We spend much of our daily lives working for you, why not get to know more about us, and us about you? -Create and encourage more transparency. This partially ties into poor communication too, but the opaque nature of this company creates disorganization and distrust. Things, big things, are going on all the time that are not made known: important people are leaving, changes to the event are occurring, moves being made regarding the naming and branding of events. Even a low level employee should be involved when changes to the event that they are working on are happening. -Invest back into your employee. Before I articulate myself on this point, know that I always feel conflicted mentioning this. Reason being is that we get paid and live off our salary for this job. That, in theory, should be enough employee investment. However, in this day in age, the bar had been raised with tech companies/ start ups revolutionizing the modern day work place. Provide better computers to your employees, that way they won't waste time trying to get their programs to work or dealing with other avoidable technical issues. Set up team off-sites to encourage team bonding and camaraderie. Look more into employee training programs. These can be great both for the company and the employee. A better trained employee will do a better job. Doing this will also foster creation and innovation.", "rating": 3, "pros": "-Big company name that will supplement you resume/ CV", "cons": "-Below market pay", "advice": "-Excellent job on staying involved in a leading edge and innovative industry. As a whole, the company direction seems clear."}, {"title": "great over all", "text": "Pros great work place. Management is nice and they are willing to help and work with you. Support team is great and the culture is awesome. Cons vacation time is limited and high sales quotas. not much room for growth though moving up the ladder is not easy.", "rating": 5, "pros": "great work place. Management is nice and they are willing to help and work with you. Support team is great and the culture is awesome.", "cons": "vacation time is limited and high sales quotas. not much room for growth though moving up the ladder is not easy.", "advice": null}, {"title": "Informa is a very top down company", "text": "Pros They are a market leader that has deep pockets Cons Very bureaucratic , top, down company that does not listen much to employees or customers. Advice to Management Let functional units have more decision making sway. Get more customer feedback and be more customer oriented in their offerings and policies.", "rating": 3, "pros": "They are a market leader that has deep pockets", "cons": "Very bureaucratic , top, down company that does not listen much to employees or customers.", "advice": "Let functional units have more decision making sway. Get more customer feedback and be more customer oriented in their offerings and policies."}, {"title": "No Work-Life Balance", "text": "Pros I find it very hard to come up with good reasons to work here. Cons Management expects the GL staff (all salaried) to work several hours of overtime a week. I averaged 55-60 hours a week with no extra pay & no raise! Although 11 holidays are listed as paid time off holidays, if holidays fall during the 3 day time period of close, staff is expected to work that day at the office & take another day off in the month. Management expects staff to be involved in external office activities taking you away from your family for even more hours. Definitely no work-life balance here. Advice to Management Management needs to be more appreciative of all the hard work their staff puts in & needs to promote more within.", "rating": 1, "pros": "I find it very hard to come up with good reasons to work here.", "cons": "Management expects the GL staff (all salaried) to work several hours of overtime a week. I averaged 55-60 hours a week with no extra pay & no raise! Although 11 holidays are listed as paid time off holidays, if holidays fall during the 3 day time period of close, staff is expected to work that day at the office & take another day off in the month.", "advice": "Management needs to be more appreciative of all the hard work their staff puts in & needs to promote more within."}, {"title": "Corporate sucks!", "text": "Pros Casual dress. Fun staff. Good parking. Bridgette is awesome to work for. Great leader. Lori is nice too. I'm not happy here. Cons Pay sucks. Employees are treated like dirt. Heard old president was fired after 30 years and everything went to crap after that. Advice to Management Start your own company without the corporate BS!", "rating": 1, "pros": "Casual dress. Fun staff. Good parking. Bridgette is awesome to work for. Great leader. Lori is nice too. I'm not happy here.", "cons": "Pay sucks. Employees are treated like dirt. Heard old president was fired after 30 years and everything went to crap after that.", "advice": "Start your own company without the corporate BS!"}, {"title": "A lot of potential", "text": "Pros This company has a good laid back environment which enables a good quality of life. People are easy to approach with questions in other departments. Good benefits Cons The company needs to invest more in their product. All of the Ideas are there but they need to put more money into developing the product to keep up with competitors. Advice to Management They need to listen to what the market wants. The company has alot of history but needs to take all that market experience and apply it to the needs of today.", "rating": 3, "pros": "This company has a good laid back environment which enables a good quality of life. People are easy to approach with questions in other departments. Good benefits", "cons": "The company needs to invest more in their product. All of the Ideas are there but they need to put more money into developing the product to keep up with competitors.", "advice": "They need to listen to what the market wants. The company has alot of history but needs to take all that market experience and apply it to the needs of today."}, {"title": "Senior Consultant", "text": "Pros Great place to build a resume. Will work on a wide range of projects. Nice people in Memphis. Cons Switching to a computer based system that devalues the analysts. People making the major decisions are located in London and have a new vision for the company. Very honest about not caring if you like the work environment and believes the employees are overpaid. Advice to Management Does not matter. In two to three years either the company will be transformed or spun off. Bruce Scherr was removed and Tom Scott is now the CEO. A yes man to London.", "rating": 3, "pros": "Great place to build a resume. Will work on a wide range of projects.", "cons": "Switching to a computer based system that devalues the analysts.", "advice": "Does not matter. In two to three years either the company will be transformed or spun off."}, {"title": "Dinosaurs burning money", "text": "Pros Good people & sales team Decent Sales initiative & goals. Cons suggestions not appreciated Lots of red-tape", "rating": 3, "pros": "Good people & sales team", "cons": "suggestions not appreciated", "advice": null}, {"title": "Good benefits but career opportunities limited.", "text": "Pros Good benefits, relaxed atmosphere at least locally, nice people. Cons Starting to be controlled by Corporate office with no local control. No pay increases, (cost of living or merit) the product is starting to get old and stale. Not much opportunity for promotion. Wonder how long we will be here for. Advice to Management Listen to local staff and not try and run this place from London. Respect the staff and invest in the company.", "rating": 3, "pros": "Good benefits, relaxed atmosphere at least locally, nice people.", "cons": "Starting to be controlled by Corporate office with no local control. No pay increases, (cost of living or merit) the product is starting to get old and stale. Not much opportunity for promotion. Wonder how long we will be here for.", "advice": "Listen to local staff and not try and run this place from London. Respect the staff and invest in the company."}, {"title": "Account Manager", "text": "Pros good people, plenty of autonomy Cons compensation plan changes every year, constant restructuring from above, too much attrition with analysts Advice to Management Management focuses on other parts of the Informa business such as the pharma products. Either invest into the other logos, or sell them off.", "rating": 3, "pros": "good people, plenty of autonomy", "cons": "compensation plan changes every year, constant restructuring from above, too much attrition with analysts", "advice": "Management focuses on other parts of the Informa business such as the pharma products. Either invest into the other logos, or sell them off."}, {"title": "Good Company", "text": "Pros I was able to learn a lot and take on a lot of responsibility within a short period of time. Good hours. Nice people. Cons Not a lot of opportunity for advancement. Work can be monotonous at times. Management can be overbearing at times. Advice to Management Identify your goals, and determine the resources needed to achieve them. Get to know each individual's needs, and find out what drives them.", "rating": 5, "pros": "I was able to learn a lot and take on a lot of responsibility within a short period of time. Good hours. Nice people.", "cons": "Not a lot of opportunity for advancement. Work can be monotonous at times. Management can be overbearing at times.", "advice": "Identify your goals, and determine the resources needed to achieve them."}, {"title": "Management needs some work", "text": "Pros great people to work with and fun work in general. alot of learning opportunities Cons no progression and management are very closed off. It's their way or the highway. Advice to Management Have an open door policy", "rating": 1, "pros": "great people to work with and fun work in general. alot of learning opportunities", "cons": "no progression and management are very closed off. It's their way or the highway.", "advice": "Have an open door policy"}, {"title": "Show Manager", "text": "Pros Excellent cross training, promote from within, supportive of career development, approachable management Cons Nothing out of the ordinary as a con", "rating": 5, "pros": "Excellent cross training, promote from within, supportive of career development, approachable management", "cons": "Nothing out of the ordinary as a con", "advice": null}, {"title": "Account Executive for Datamonitor", "text": "Pros great benefits, ecellent training for B2B Cons boiler room sales enviroment, don't be late Advice to Management more competitve base salary needed", "rating": 5, "pros": "great benefits, ecellent training for B2B", "cons": "boiler room sales enviroment, don't be late", "advice": "more competitve base salary needed"}, {"title": "Company Spinning out of control and Failing", "text": "Pros New people bring their ideas from great corporations. Cons No respect for employees. Antagonistic meetings and reviews designed to pressure employees into doing excess amounts of work. Schedules are unrealistic, software has not changed design, it is only replaced by other purchased company software. No research and development budget. Poor sales management by top management. Mr. Toich is not the CEO only a director of the Informa owned company (even the titles are deceptive). Poor outlook on business, failing business. AVOID. Advice to Management Make way for real upper management to take your place.", "rating": 1, "pros": "New people bring their ideas from great corporations.", "cons": "No respect for employees. Antagonistic meetings and reviews designed to pressure employees into doing excess amounts of work. Schedules are unrealistic, software has not changed design, it is only replaced by other purchased company software. No research and development budget. Poor sales management by top management. Mr. Toich is not the CEO only a director of the Informa owned company (even the titles are deceptive). Poor outlook on business, failing business. AVOID.", "advice": "Make way for real upper management to take your place."}, {"title": "Great starting point...", "text": "Pros Great work-life balance, with the ability to work from home. Cons Company makes a lot of changes, and sales and marketing seems to be the company's main focus.", "rating": 3, "pros": "Great work-life balance, with the ability to work from home.", "cons": "Company makes a lot of changes, and sales and marketing seems to be the company's main focus.", "advice": null}, {"title": "Lead Credit Analyst", "text": "Pros Flex Working - Very big on working from home. I work from home everyday and get to attend conferences (relevant to my job) in the city. Good place to work for moms. Company is well known in london. Cons No bonus at all and almost no increase in base salary. always running into budget issues. Turnover of employees is high.", "rating": 5, "pros": "Flex Working - Very big on working from home. I work from home everyday and get to attend conferences (relevant to my job) in the city. Good place to work for moms. Company is well known in london.", "cons": "No bonus at all and almost no increase in base salary. always running into budget issues. Turnover of employees is high.", "advice": null}, {"title": "INFORMA Client facing", "text": "Pros Most coworkers were great people Cons No mission, no direction, obsolete product Advice to Management Overhaul mgmt and don't blame your people!", "rating": 1, "pros": "Most coworkers were great people", "cons": "No mission, no direction, obsolete product", "advice": "Overhaul mgmt and don't blame your people!"}, {"title": "No care for employees", "text": "Pros Not many worth listing. At the lowest levels the people are OK, but best talent never stays long due to the cons. Cons Constantly changing directions, questionable leadership, and a culture of really not caring much about employees and no loyalty to employees that have been with the company a while or contributed significantly. It's all about the money and not much else. Advice to Management Renewed focus on human resource management and caring for employees rather than just treating them like expendable assets that can be disposed of on a whim.", "rating": 1, "pros": "Not many worth listing. At the lowest levels the people are OK, but best talent never stays long due to the cons.", "cons": "Constantly changing directions, questionable leadership, and a culture of really not caring much about employees and no loyalty to employees that have been with the company a while or contributed significantly. It's all about the money and not much else.", "advice": "Renewed focus on human resource management and caring for employees rather than just treating them like expendable assets that can be disposed of on a whim."}, {"title": "analyst", "text": "Pros Iis nc office: Pay is competitive. Coworkers are exceptionally skilled and motivated. Great group of people in nc. Cons This comment is specific to Informa investment solutions IIS management structure is odd and often ineffective. Informa would be better if it offered more recognition for achievements, more opportunity for promotion, more emphasis on quality. Advice to Management Recognize people outside of ny office. Demonstrate leadership.", "rating": 3, "pros": "Iis nc office: Pay is competitive. Coworkers are exceptionally skilled and motivated. Great group of people in nc.", "cons": "This comment is specific to Informa investment solutions", "advice": "Recognize people outside of ny office. Demonstrate leadership."}, {"title": "No chance for advancement", "text": "Pros Good place to start out learning publishing/media industry. Generally good people at company. Many levels of experience on staff. Insurance benefits are generally very good. Cons Low salary, especially for new hires. Not much chance for advancement in certain departments. Don't value opinions and suggestions from those that have been with company for long time (more than 5+ years) President is narcissistic. Favors certain employees, especially those that say \"YES\" to everything he says. If you disagree with him, you will be dismissed. Says there is an open door policy, but that is not the case. He takes projections to his superiors and raises them to unrealistic levels that result in failure. Starts new projects that have no chance to succeed. When they fail, It is never his fault, but the fault of the people that work for him. This usually results in the dismissal of staff. Advice to Management Listen to your employees. Build realistic goals--not every idea is a million dollar idea. Own up to your failures, do not pass along your bad ideas and decision making to your employees. Better management training for mid-management. Create advancement opportunities.", "rating": 3, "pros": "Good place to start out learning publishing/media industry.", "cons": "Low salary, especially for new hires.", "advice": "Listen to your employees. Build realistic goals--not every idea is a million dollar idea. Own up to your failures, do not pass along your bad ideas and decision making to your employees. Better management training for mid-management. Create advancement opportunities."}, {"title": "Review", "text": "Pros Good people to work with, supportive staff and friendly environment Cons Very corporate environment, everyone is treated like a number .", "rating": 3, "pros": "Good people to work with, supportive staff and friendly environment", "cons": "Very corporate environment, everyone is treated like a number .", "advice": null}, {"title": "A mixed review", "text": "Pros Great benefits and excellent travel opportunities Cons Not enough focus on 5-10 year plan - a year to year month to month approach", "rating": 5, "pros": "Great benefits and excellent travel opportunities", "cons": "Not enough focus on 5-10 year plan - a year to year month to month approach", "advice": null}, {"title": "A great place to start out", "text": "Pros Abundance of paid time off. Management fosters growth and learning and shows appreciation. Annual excellence awards give everyone an opportunity to be awarded for their hard work and dedication. A great place to start your career - very well known and respected company. Cons Rigid schedule - usually need to take lunch break at exactly 12:00. Not a lot of opportunity for advancement. Pay scale is lower than average. Offices across the globe suffer from the silo effect.", "rating": 5, "pros": "Abundance of paid time off. Management fosters growth and learning and shows appreciation. Annual excellence awards give everyone an opportunity to be awarded for their hard work and dedication. A great place to start your career - very well known and respected company.", "cons": "Rigid schedule - usually need to take lunch break at exactly 12:00. Not a lot of opportunity for advancement. Pay scale is lower than average. Offices across the globe suffer from the silo effect.", "advice": null}, {"title": "A mixed bag", "text": "Pros Good benefits, flexible working hours, interesting colleagues and challenges abound. Opportunities for working cross-functionally in the business and learning new skills are also available if one knows how to take advantage of these. Cons Constant change with little direction leaves hardworking and committed employees rudderless. Very little opportunity for advancement and when it happens it means that you're usually doing your old job plus your new job at the same time. Also infrastructure seems to be crumbling, which is not good for a company providing business solutions to clients. Politics can be rather nasty however, so it's best to stay clear. Advice to Management Place a higher value on your employees in all areas - not just Sales and BD. More investment in infrastructure is desperately needed. Better training is also needed for managers so that they can better empower their people.", "rating": 3, "pros": "Good benefits, flexible working hours, interesting colleagues and challenges abound. Opportunities for working cross-functionally in the business and learning new skills are also available if one knows how to take advantage of these.", "cons": "Constant change with little direction leaves hardworking and committed employees rudderless. Very little opportunity for advancement and when it happens it means that you're usually doing your old job plus your new job at the same time. Also infrastructure seems to be crumbling, which is not good for a company providing business solutions to clients. Politics can be rather nasty however, so it's best to stay clear.", "advice": "Place a higher value on your employees in all areas - not just Sales and BD. More investment in infrastructure is desperately needed. Better training is also needed for managers so that they can better empower their people."}, {"title": "Nothing great", "text": "Pros Few pros. Unlimited sick days and good healthcare benefits. Opportunity to learn about journal publishing. Cons Directionless management. No support staff. Employees are severely underpaid. Advice to Management Get new managers.", "rating": 3, "pros": "Few pros. Unlimited sick days and good healthcare benefits. Opportunity to learn about journal publishing.", "cons": "Directionless management. No support staff. Employees are severely underpaid.", "advice": "Get new managers."}, {"title": "Trying to Keep Up", "text": "Pros Youthful atmosphere, high energy, new CEO seems to have a vision. Cons Encouraged to sell at the expense of customer needs, so-so benefits, lack of cohesion between departments. Advice to Management Make each department the same company.", "rating": 3, "pros": "Youthful atmosphere, high energy, new CEO seems to have a vision.", "cons": "Encouraged to sell at the expense of customer needs, so-so benefits, lack of cohesion between departments.", "advice": "Make each department the same company."}, {"title": "Worker Bee", "text": "Pros Culture, office, benefits and the people Cons impending culture, unclear expectations, unsure of direction", "rating": 3, "pros": "Culture, office, benefits and the people", "cons": "impending culture, unclear expectations, unsure of direction", "advice": null}, {"title": "Anonymous", "text": "Pros Great Benefits, because Informa is part of a large corporation Cons The lack of communication from management and senior management is frustrating Advice to Management need to be more progressive in today's world. Connect with your employees and share the company vision and goals.", "rating": 3, "pros": "Great Benefits, because Informa is part of a large corporation", "cons": "The lack of communication from management and senior management is frustrating", "advice": "need to be more progressive in today's world. Connect with your employees and share the company vision and goals."}, {"title": "Happy to spend my career here", "text": "Pros Very skilled and knowledgeable management that are not afraid of change. Some of the best services/products on the market which makes the job much easier. Growth opportunities are based on skill/results rather than age and experience, better put \"the best man/woman for the job.\" Friendly and tight knit staff/environment. Cons Past UK focus gave impression of a ceiling to growth. No longer the cas Advice to Management Continue to cultivate potential from within. Good people are hard to come by.", "rating": 5, "pros": "Very skilled and knowledgeable management that are not afraid of change. Some of the best services/products on the market which makes the job much easier. Growth opportunities are based on skill/results rather than age and experience, better put \"the best man/woman for the job.\" Friendly and tight knit staff/environment.", "cons": "Past UK focus gave impression of a ceiling to growth. No longer the cas", "advice": "Continue to cultivate potential from within. Good people are hard to come by."}, {"title": "Acquired and dismissed", "text": "Pros Good publications, high quality databases Cons Informa executives assured employees when it acquired our organization that the company wanted to keep our team intact. A few months later, half of us were dismissed. The layoff process was mismanaged too. Advice to Management The left hand and the right hand should work together.", "rating": 1, "pros": "Good publications, high quality databases", "cons": "Informa executives assured employees when it acquired our organization that the company wanted to keep our team intact. A few months later, half of us were dismissed. The layoff process was mismanaged too.", "advice": "The left hand and the right hand should work together."}, {"title": "Happy to go to work everyday.", "text": "Pros Great group of people to work with and for, flexible schedules, feel appreciated, enough work to keep busy but not overwhelmed constantly, exposure to wide view of accounting and financials, international accounting experience, casual Friday's and often additional casual days during the month, quarterly bonuses offered Cons Work some holidays such as Labor Day or Fourth of July due to timing of the day and publicly traded/headquartered in London; however holidays worked can be redeemed for another day Advice to Management Show great appreciation for additional hours put in for month end and year end close periods.", "rating": 5, "pros": "Great group of people to work with and for, flexible schedules, feel appreciated, enough work to keep busy but not overwhelmed constantly, exposure to wide view of accounting and financials, international accounting experience, casual Friday's and often additional casual days during the month, quarterly bonuses offered", "cons": "Work some holidays such as Labor Day or Fourth of July due to timing of the day and publicly traded/headquartered in London; however holidays worked can be redeemed for another day", "advice": "Show great appreciation for additional hours put in for month end and year end close periods."}, {"title": "Smart people need not apply", "text": "Pros There is a good amount of job security which as a sales person is a nice thing. Also good benefits and a nice office in midtown. Cons Way too much of a hierarchy which causes management to be totally out of touch with what is going on. Also because the company is essentially many smaller companies bound together through Informa's acquisition heavy strategy there are a lot of competing ideas and duplicated efforts. This causes a great deal of inefficiency and an incredibly complicated organizational chart. As a sales person much of what I was told through the interview process were exaggerations (earning potential, growth opportunities, strength of the product) to get me on board. Advice to Management Stop being so scared to innovate. Listen to the people on the ground, and be open to new ideas.", "rating": 1, "pros": "There is a good amount of job security which as a sales person is a nice thing. Also good benefits and a nice office in midtown.", "cons": "Way too much of a hierarchy which causes management to be totally out of touch with what is going on. Also because the company is essentially many smaller companies bound together through Informa's acquisition heavy strategy there are a lot of competing ideas and duplicated efforts. This causes a great deal of inefficiency and an incredibly complicated organizational chart. As a sales person much of what I was told through the interview process were exaggerations (earning potential, growth opportunities, strength of the product) to get me on board.", "advice": "Stop being so scared to innovate. Listen to the people on the ground, and be open to new ideas."}, {"title": "It was a good place to work but the management was not the best", "text": "Pros The co-workers are very great to work with and very personable. The environment is good and laid back with casual Fridays. Cons No career advancement and the management overlooks achievements and only sees mistakes.", "rating": 3, "pros": "The co-workers are very great to work with and very personable. The environment is good and laid back with casual Fridays.", "cons": "No career advancement and the management overlooks achievements and only sees mistakes.", "advice": null}, {"title": "Great place to work.", "text": "Pros People are put first. Benefits are unbelievable! Cons The Salary is below average. Advice to Management Think outside the box", "rating": 5, "pros": "People are put first. Benefits are unbelievable!", "cons": "The Salary is below average.", "advice": "Think outside the box"}, {"title": "Challenging and rewarding", "text": "Pros Availability of training to improve your performance. Potential for big bonuses and working with good people Cons Pretty flat structure not allowing for frequent promotions. Low employee morale and blame culture Advice to Management Listen more to employees ideas and complaints", "rating": 3, "pros": "Availability of training to improve your performance. Potential for big bonuses and working with good people", "cons": "Pretty flat structure not allowing for frequent promotions. Low employee morale and blame culture", "advice": "Listen more to employees ideas and complaints"}, {"title": "Managers are out of touch with their employees, rarely available and don't help and put in more time when it's needed.", "text": "Pros The health benefits are great! When I was 1st hired the managers seemed to care about their employees and the CEO is pretty awesome. Cons Managers/supervisors only see you as a number, low pay/appreciation, new employees aren't trained well, communication is poor, managers expect too much without knowing what it takes to get the job done, managers don't like to be wrong and will hide their mistakes even if it means blaming others and most (not all) salaried managers & supervisors don't put in a full 8 hour work day (e.g. take long lunches, leave early, come in really late, are MIA in the middle of the day). Advice to Management Upper management should start talking to their lower employees more because middle management doesn't appear to be properly communicating issues, concerns and maybe even new ideas the lower employees have. Pay should be better since it's so expensive to live in California. Don't take your employees for granted.", "rating": 3, "pros": "The health benefits are great! When I was 1st hired the managers seemed to care about their employees and the CEO is pretty awesome.", "cons": "Managers/supervisors only see you as a number, low pay/appreciation, new employees aren't trained well, communication is poor, managers expect too much without knowing what it takes to get the job done, managers don't like to be wrong and will hide their mistakes even if it means blaming others and most (not all) salaried managers & supervisors don't put in a full 8 hour work day (e.g. take long lunches, leave early, come in really late, are MIA in the middle of the day).", "advice": "Upper management should start talking to their lower employees more because middle management doesn't appear to be properly communicating issues, concerns and maybe even new ideas the lower employees have. Pay should be better since it's so expensive to live in California. Don't take your employees for granted."}, {"title": "Informa ROCKS!!", "text": "Pros One of the BEST companies I have ever worked for!!! Lots of growth opportunities, great benefits, competitive salary, flexibility, and a very caring, generous and friendly CEO!!! If If didn't move out of state I would retire from Informa..miss my second family!! Cons No cons Informa is a GREAT company to work for!! Advice to Management Keep up the good work!!!", "rating": 5, "pros": "One of the BEST companies I have ever worked for!!! Lots of growth opportunities, great benefits, competitive salary, flexibility, and a very caring, generous and friendly CEO!!! If If didn't move out of state I would retire from Informa..miss my second family!!", "cons": "No cons Informa is a GREAT company to work for!!", "advice": "Keep up the good work!!!"}, {"title": "They hired me, then didn't let me do the job", "text": "Pros I had a fantastic boss and many wonderful colleagues whose insights were incomparable. The company is well respected. The pay and benefits were great. I learned a lot about the telecom and media industries as well as office politics. Cons Informa is notorious for its ongoing rounds of layoffs. They hire great people and then routinely let them go for no apparent reason other than that fact that they must not have won that quarter's popularity contest. There is a core group of analysts who dominate all initiatives and come up with some really silly projects that waste everyone's time and the company's money. It's sad really, because there are so many better, and more lucrative, projects that analysts could spend their time doing. Further, the culture is very male-dominated, and I ended up being prevented from doing my job as an analyst because the men on the sales team included male colleagues on client visits but absolutely refused to take me along. There were a couple of female sales people who were willing to collaborate with me, but they also left the company. There really are no options for promotions or raises once you are in, and, in fact, the bonus I was promised for completing my first year there was never fully paid. Advice to Management Let people do their jobs and stop tolerating discrimination. Stop the incessant hiring and firing. These are people's lives you're messing with. Create a clearer picture of what you really hope to achieve with the company.", "rating": 3, "pros": "I had a fantastic boss and many wonderful colleagues whose insights were incomparable. The company is well respected. The pay and benefits were great. I learned a lot about the telecom and media industries as well as office politics.", "cons": "Informa is notorious for its ongoing rounds of layoffs. They hire great people and then routinely let them go for no apparent reason other than that fact that they must not have won that quarter's popularity contest. There is a core group of analysts who dominate all initiatives and come up with some really silly projects that waste everyone's time and the company's money. It's sad really, because there are so many better, and more lucrative, projects that analysts could spend their time doing.", "advice": "Let people do their jobs and stop tolerating discrimination. Stop the incessant hiring and firing. These are people's lives you're messing with. Create a clearer picture of what you really hope to achieve with the company."}, {"title": "Great place to work and grow", "text": "Pros Great place and smartest people to work with in the industry. Takes care of employee and listens to feedback carefully. Awesome benefits Lots of challenges and competitive projects/products which gives you enough space to grow, polish your skill sets and learn about exciting and new technologies Cons dynamism can be slow sometimes", "rating": 5, "pros": "Great place and smartest people to work with in the industry. Takes care of employee and listens to feedback carefully. Awesome benefits", "cons": "dynamism can be slow sometimes", "advice": null}, {"title": "Loved my time with Informa", "text": "Pros The Management Team in Nashville is FANTASTIC!!! Very much feels like family going into work every day. Very casual atmosphere and lots of fun! Cons I don't know that there are any cons with this company or the Nashville office. Advice to Management Keep doing what you are doing. The HR is the Nashville office is TOP NOTCH and Very caring!", "rating": 5, "pros": "The Management Team in Nashville is FANTASTIC!!! Very much feels like family going into work every day. Very casual atmosphere and lots of fun!", "cons": "I don't know that there are any cons with this company or the Nashville office.", "advice": "Keep doing what you are doing. The HR is the Nashville office is TOP NOTCH and Very caring!"}, {"title": "Makes use of technology for a mostly paperless work environment.", "text": "Pros Co-workers are genuine, pleasant and wonderful to work with. Micro-management is rare allowing for independent work without someone looking over your shoulder 24/7. People are available and easy to approach when you have questions. If you like dynamic environments and adjust to change well this is the company for you. Cons Workloads can be extremely heavy and the foreign parent's expectations can be demanding which tend to fall on several American holidays. Opportunities for learning new things or taking on more and varied work are abundant. Promotions/pay increases, in general, are not. Advice to Management The main motivation for employees are salary, work/life balance and new opportunities to expand one's mind and keep them excited to be there without overloading them. Iron that out and this will be the company that everyone will want to work for.", "rating": 3, "pros": "Co-workers are genuine, pleasant and wonderful to work with. Micro-management is rare allowing for independent work without someone looking over your shoulder 24/7. People are available and easy to approach when you have questions. If you like dynamic environments and adjust to change well this is the company for you.", "cons": "Workloads can be extremely heavy and the foreign parent's expectations can be demanding which tend to fall on several American holidays. Opportunities for learning new things or taking on more and varied work are abundant. Promotions/pay increases, in general, are not.", "advice": "The main motivation for employees are salary, work/life balance and new opportunities to expand one's mind and keep them excited to be there without overloading them. Iron that out and this will be the company that everyone will want to work for."}, {"title": "Not Unhappy", "text": "Pros People actually care about you, great products, great incentives, plenty of opportunities, hard work pays off Cons constant change, some good some bad. pressure can be hard to take but could be a lot worse Advice to Management breathing room goes a long way", "rating": 5, "pros": "People actually care about you, great products, great incentives, plenty of opportunities, hard work pays off", "cons": "constant change, some good some bad. pressure can be hard to take but could be a lot worse", "advice": "breathing room goes a long way"}, {"title": "A company that cares", "text": "Pros -Casual Attire -Positive, Supportive Culture. A fun place to work! -Opportunities to work with other departments -Promote from within Cons -Pay could be higher -As an established company, change can be quite slow and feedback sometimes falls on deaf ears Advice to Management Stay open to your employee's feedback. As with all companies, some managers are better at this than others.", "rating": 5, "pros": "-Casual Attire", "cons": "-Pay could be higher", "advice": "Stay open to your employee's feedback. As with all companies, some managers are better at this than others."}, {"title": "A great place to call home!", "text": "Pros Casual dress. Great managers and coworkers. Great employee recognition. President is a real good guy! Cons Not really a lot of cons here. Sometimes it gets a little cold or hot because the AC is messed up at times. Advice to Management Keep doing what you are doing. Listen more to", "rating": 5, "pros": "Casual dress. Great managers and coworkers. Great employee recognition. President is a real good guy!", "cons": "Not really a lot of cons here. Sometimes it gets a little cold or hot because the AC is messed up at times.", "advice": "Keep doing what you are doing. Listen more to"}, {"title": "A waste of 9 months of my life", "text": "Pros Strict 9:00 to 5:30 hours. Chris Fuller is a great, enthusiastic gentleman to work with. Free lunch once per month! Cons Poor Management - I had two managers. One was good to work with, the other was awful. The obvious choice by this company was to promote the crappy guy because he was in with upper management. Terrible Pay - I have heard that the starting pay is around $30,000 per year for an entry level job. This is barely enough to live. Lazy employees - My manager seemed to be very interested in what was going on with his iPhone. Other that that he focused hard on his golf game and ignoring has managerial responsibilities. No promotion potential - Because of the small size of the company and the connections that the current managers have made there is no hope that you will ever be promoted Boring work - I joined because I was told about several projects I would be involved in. All of these projects were immediately cancelled or delayed upon my arrival. The workload is reconciling custodian data to statement data. I have had more fun getting an endoscopy. Vague bonus structure - Ask them about their bonus structure if you work there. You will never get an answer as to how it is calculated. They will also lie to you in the interview process about how much it will be. They claimed 1800-2000 per quarter. The most I got was 700 dollars gross. Did not honor my resignation date - When I knew I was leaving I gave them a little bit more than 2 weeks of notice because I knew they would be in a jam. Instead, they told me to leave early and did not pay out my final bonus. Hilariously, I received e-mails at my new job for help! All in all, this company is a joke. If you work for them, leave...it is a trap. If you are interviewing with them, they are lying to you. If you have them as a vendor, fire them. Advice to Management Clean house. The management is stale.", "rating": 1, "pros": "Strict 9:00 to 5:30 hours. Chris Fuller is a great, enthusiastic gentleman to work with. Free lunch once per month!", "cons": "Poor Management - I had two managers. One was good to work with, the other was awful. The obvious choice by this company was to promote the crappy guy because he was in with upper management.", "advice": "Clean house. The management is stale."}, {"title": "Stay away from this nasty little shady company", "text": "Pros I don't really have anything nice to say about this place--sorry Cons Although this company's rev is under $50 million it is plauged by Incompetent leadership with 2 (that's right 2) managing director and several stale SVPs that have been in their jobs way too long to be effective. Extremely out of tune with the market Advice to Management Clean house --lots of dead wait at the top level", "rating": 1, "pros": "I don't really have anything nice to say about this place--sorry", "cons": "Although this company's rev is under $50 million it is plauged by Incompetent leadership with 2 (that's right 2) managing director and several stale SVPs that have been in their jobs way too long to be effective. Extremely out of tune with the market", "advice": "Clean house --lots of dead wait at the top level"}, {"title": "Production", "text": "Pros -Great work/life balance -Flexible work hours and great benefits -Some good travel opportunities -Friendly work environment -Most co-workers are friendly -No real politics and most career advancement is based on merit - Business runs smoothly Cons - salary could be higher and wasn't much career growth. Advice to Management -Invest in good workers to keep them.", "rating": 5, "pros": "-Great work/life balance", "cons": "- salary could be higher and wasn't much career growth.", "advice": "-Invest in good workers to keep them."}, {"title": "Large organization with some really talented people", "text": "Pros Stable and growing company in the Business Information space. Good benefits and normal work week hours. Cons Large company feeling, so you tend to get lost in the department and not really feel that connected to what is happening at times. Image is extremely important and sometimes felt like substance was not as important. Advice to Management Very competent management who listen to employee feedback and make positive changes to improve overall efficiency and adapt fairly quickly to new stuff happening in the market. No advice- keep on doing what you are doing.", "rating": 3, "pros": "Stable and growing company in the Business Information space. Good benefits and normal work week hours.", "cons": "Large company feeling, so you tend to get lost in the department and not really feel that connected to what is happening at times. Image is extremely important and sometimes felt like substance was not as important.", "advice": "Very competent management who listen to employee feedback and make positive changes to improve overall efficiency and adapt fairly quickly to new stuff happening in the market. No advice- keep on doing what you are doing."}, {"title": "Learned a lot and worked with as lot of good people.", "text": "Pros Great location to work at. Cons Department Managers at different locations from all their personnel.", "rating": 5, "pros": "Great location to work at.", "cons": "Department Managers at different locations from all their personnel.", "advice": null}, {"title": "A good place to work if you don't push...", "text": "Pros Working at Informa will help you develop your skills to get the job that has already been defined by management done. It offers a comfortable work environment that rarely challenges you once you have mastered the job. Cons They teach simplistic procedures needed to get the job done but not the overall picture. They do not document so that making changes to existing work effort often requires rebuilding from start. Advice to Management Management needs to consider what is locked in the minds and memories of their employees but is not documented.", "rating": 3, "pros": "Working at Informa will help you develop your skills to get the job that has already been defined by management done. It offers a comfortable work environment that rarely challenges you once you have mastered the job.", "cons": "They teach simplistic procedures needed to get the job done but not the overall picture. They do not document so that making changes to existing work effort often requires rebuilding from start.", "advice": "Management needs to consider what is locked in the minds and memories of their employees but is not documented."}, {"title": "Sales -USA", "text": "Pros Loved the Industry & the journal Cons ever decreasing & shrinking compensation plans. Tasked with % of growth for new business, with promise of New Business commission, and then never honored! ~ Hidden agendas, and mis0managed teams = poor morale. Advice to Management Allow your managers to do the job they were hired to do, without changing the things every 3 month!", "rating": 3, "pros": "Loved the Industry & the journal", "cons": "ever decreasing & shrinking compensation plans. Tasked with % of growth for new business, with promise of New Business commission, and then never honored! ~ Hidden agendas, and mis0managed teams = poor morale.", "advice": "Allow your managers to do the job they were hired to do, without changing the things every 3 month!"}, {"title": "Work with great individuals", "text": "Pros - Exec team is understanding and down to earth. - easy business model, great place to learn how businesses run - great team events and group of co workers Cons - not all employees are expected to output the same as their peers - parent company demands are often unrealistic - some processes have unnecessary red tape Advice to Management -remove silos that exist in some departments and move to merit based pay raises.", "rating": 5, "pros": "- Exec team is understanding and down to earth.", "cons": "- not all employees are expected to output the same as their peers", "advice": "-remove silos that exist in some departments and move to merit based pay raises."}, {"title": "Kick start your career", "text": "Pros Great place to start career out. Cons It is a very structured culture.", "rating": 3, "pros": "Great place to start career out.", "cons": "It is a very structured culture.", "advice": null}, {"title": "I'm doing a job I don't love, but my managers and co-workers make it bearable.", "text": "Pros Good camaraderie among employees; managers are fair and have the best interest of the company and their employees at heart. They are understanding if you have to leave for family reasons. Cons It is your typical office / cubical environment. I have a hard time feeling like the work I do there matters. Advice to Management I have no advice. I think we're lucky to have a president like Mike Adler.", "rating": 5, "pros": "Good camaraderie among employees; managers are fair and have the best interest of the company and their employees at heart. They are understanding if you have to leave for family reasons.", "cons": "It is your typical office / cubical environment. I have a hard time feeling like the work I do there matters.", "advice": "I have no advice. I think we're lucky to have a president like Mike Adler."}, {"title": "It's a Learning Experience", "text": "Pros The benefits are decent and had the opportunity to learn about the publishing industry. I was around co-workers who were overall knowledgeable. The group started with good morale and a friendly environment. Cons Morale is dissipated when senior management started involving themselves. The lack of direction with both people and money, coupled with favoritism led to massive lay-offs and resignations. Informa has respectable products, but their refusal to invest leaves the remaining employees disgruntled. Advice to Management Just sell the company. Your employees are suffering.", "rating": 3, "pros": "The benefits are decent and had the opportunity to learn about the publishing industry. I was around co-workers who were overall knowledgeable. The group started with good morale and a friendly environment.", "cons": "Morale is dissipated when senior management started involving themselves. The lack of direction with both people and money, coupled with favoritism led to massive lay-offs and resignations. Informa has respectable products, but their refusal to invest leaves the remaining employees disgruntled.", "advice": "Just sell the company. Your employees are suffering."}, {"title": "Sales at Informa", "text": "Pros Broad range of companies, and excellent pay structure. They are in all the right industries and have presence around the world. Cons There is no contact with upper management about the strength of the business. There is no opportunity for growth within the organization. Advice to Management I think management should spend more time in the division meeting with employees, particularly with those that are on the front lines with customers. I never learn about what other divisions are doing or what opportunities there might be for me there.", "rating": 1, "pros": "Broad range of companies, and excellent pay structure. They are in all the right industries and have presence around the world.", "cons": "There is no contact with upper management about the strength of the business. There is no opportunity for growth within the organization.", "advice": "I think management should spend more time in the division meeting with employees, particularly with those that are on the front lines with customers. I never learn about what other divisions are doing or what opportunities there might be for me there."}, {"title": "Informa Healthcare - look elsewhere", "text": "Pros it's a job, which nowadays is saying a lot Cons directionless management, disrespect for American workforce, national nepotism Advice to Management resign", "rating": 3, "pros": "it's a job, which nowadays is saying a lot", "cons": "directionless management, disrespect for American workforce, national nepotism", "advice": "resign"}, {"title": "financial information services firm is challenging to work for, but rewarding because of that.", "text": "Pros The company is a division of a larger international company, which means there are great benefits. The fields we specialize in allow us to have lots of challenging work oppportunities. The workload is heavy, but manageable. The New York City location (where most of my work comes from) is in a central location, in the building next door to Grand Central Terminal. There are so many different people to work with Cons The workload is heavy. Sometimes there are not enough staffers in-house to get work in on time, so self-imposed deadlines slip, and we suffer. Projects can be pre-assigned in an environment where everyone is supposed to self-assign them. This can create havok with schedules, deadlines, location screw-ups, on-time reporting. The communication is generally great, but when a glitch happens, it can be really bad. In some locations (Atlanta, for example), advancement in the company is limited by the small number of positions available. One has to move, either to California (Los Angeles/Calabasas) or New York (Manhattan, NYC), to advance within the company. Advice to Management I would suggest that Senior Management ensure that project timelines are rational, and projects are not launched before participants understand all the important details they are responsible for. That would include not pre-assigning projects to the evaluators (when the project is getting behind schedule), who need to have some control over their own schedules.", "rating": 5, "pros": "The company is a division of a larger international company, which means there are great benefits. The fields we specialize in allow us to have lots of challenging work oppportunities. The workload is heavy, but manageable. The New York City location (where most of my work comes from) is in a central location, in the building next door to Grand Central Terminal. There are so many different people to work with", "cons": "The workload is heavy. Sometimes there are not enough staffers in-house to get work in on time, so self-imposed deadlines slip, and we suffer. Projects can be pre-assigned in an environment where everyone is supposed to self-assign them. This can create havok with schedules, deadlines, location screw-ups, on-time reporting. The communication is generally great, but when a glitch happens, it can be really bad. In some locations (Atlanta, for example), advancement in the company is limited by the small number of positions available. One has to move, either to California (Los Angeles/Calabasas) or New York (Manhattan, NYC), to advance within the company.", "advice": "I would suggest that Senior Management ensure that project timelines are rational, and projects are not launched before participants understand all the important details they are responsible for. That would include not pre-assigning projects to the evaluators (when the project is getting behind schedule), who need to have some control over their own schedules."}, {"title": "Nice stepping stone if just starting your career.", "text": "Pros The Informa Support Services -Sarasota office offers great opportunities for customer service, cash applications, collections, billing, and accounts payable professionals, as well as a growing finance team open to recruiting college graduates. The office executive team as a whole strongly believes in in-house promotions which is evident in the retention time of the staff. Cons Some Sarasota departments must work national holidays but are given time off later in the month (4th of July, Labor day, etc.). This is only hard to swallow when other international offices are able to get time off for their local holidays that fall during crucial deadlines but the Sarasota finance team does not get the same consideration. Advice to Management Great mix of management styles. The Sarasota office has put together an extraordinary executive team and offer all staff the opportunity to be mentored by these multifaceted accounting professionals.", "rating": 3, "pros": "The Informa Support Services -Sarasota office offers great opportunities for customer service, cash applications, collections, billing, and accounts payable professionals, as well as a growing finance team open to recruiting college graduates. The office executive team as a whole strongly believes in in-house promotions which is evident in the retention time of the staff.", "cons": "Some Sarasota departments must work national holidays but are given time off later in the month (4th of July, Labor day, etc.). This is only hard to swallow when other international offices are able to get time off for their local holidays that fall during crucial deadlines but the Sarasota finance team does not get the same consideration.", "advice": "Great mix of management styles. The Sarasota office has put together an extraordinary executive team and offer all staff the opportunity to be mentored by these multifaceted accounting professionals."}, {"title": "Informa in Massachusetts is hopefully not representative as a whole.", "text": "Pros In this economy, it's a job. Luckily one I left behind me. Cons Rigid hours, uneducated Human Resources, inflexible working conditions, Director-level management openly played favorites. No programs were in place to foster inter-departmental interaction. Lots of layoffs. Some borderline illegal employee practices - i.e. giving one employee flexibility, when employees of equal standing are not given the same benefit or laying off employees with legitimate worker's comp claims. It was a dismal place to work - at least in my group. Advice to Management Employees need better resources, flexibility. When I was there, we had a poorly managed intranet, little information was shared with the staff including in-office Sr. Managers. The work schedule and inflexibility was terrible. I was in a meeting and another employee commented that \"This used to be a good place to work\"...unfortunately he was right and I hadn't worked there when it was considered good.", "rating": 1, "pros": "In this economy, it's a job. Luckily one I left behind me.", "cons": "Rigid hours, uneducated Human Resources, inflexible working conditions, Director-level management openly played favorites. No programs were in place to foster inter-departmental interaction. Lots of layoffs. Some borderline illegal employee practices - i.e. giving one employee flexibility, when employees of equal standing are not given the same benefit or laying off employees with legitimate worker's comp claims. It was a dismal place to work - at least in my group.", "advice": "Employees need better resources, flexibility. When I was there, we had a poorly managed intranet, little information was shared with the staff including in-office Sr. Managers. The work schedule and inflexibility was terrible. I was in a meeting and another employee commented that \"This used to be a good place to work\"...unfortunately he was right and I hadn't worked there when it was considered good."}, {"title": "sponsorship", "text": "Pros brilliant management , ethos, work/life balance Cons A slight lack of career progression", "rating": 5, "pros": "brilliant management , ethos, work/life balance", "cons": "A slight lack of career progression", "advice": null}, {"title": "Surprisingly positive", "text": "Pros After reading a few reviews I was apprehensive but pleasantly surprised at the atmosphere and perks of working in one of the London offices. The company is going through change, but definitely for the better. Cons Restrictive in some departments compared to others Advice to Management Some parts can be a bit management heavy- its better to allow people the room to succeed. Not a problem other places.", "rating": 5, "pros": "After reading a few reviews I was apprehensive but pleasantly surprised at the atmosphere and perks of working in one of the London offices. The company is going through change, but definitely for the better.", "cons": "Restrictive in some departments compared to others", "advice": "Some parts can be a bit management heavy- its better to allow people the room to succeed. Not a problem other places."}, {"title": "fine", "text": "Pros this was a good company to learn at Cons management didnt seem to make joined up decisions or value staff", "rating": 3, "pros": "this was a good company to learn at", "cons": "management didnt seem to make joined up decisions or value staff", "advice": null}, {"title": "Great place to work", "text": "Pros It's a great place to work, with management that really cares about your progress. Cons Pay can be increased for the work we do. Advice to Management Motivate all employees who put in the work to go for promotions", "rating": 5, "pros": "It's a great place to work, with management that really cares about your progress.", "cons": "Pay can be increased for the work we do.", "advice": "Motivate all employees who put in the work to go for promotions"}, {"title": "Not bad, not the best", "text": "Pros Travel opportunity and relaxed working Cons Office culture, ugly office interior", "rating": 3, "pros": "Travel opportunity and relaxed working", "cons": "Office culture, ugly office interior", "advice": null}, {"title": "OK all things considered", "text": "Pros Flexible working environment. Ideas are listened to. Positive culture. Cons Salary is well below market rates. Management fails to understand differences between consulting and the other (syndicated) busines areas. Benefits are barely existent. Advice to Management Take time to understand your business.", "rating": 3, "pros": "Flexible working environment. Ideas are listened to. Positive culture.", "cons": "Salary is well below market rates. Management fails to understand differences between consulting and the other (syndicated) busines areas. Benefits are barely existent.", "advice": "Take time to understand your business."}, {"title": "good", "text": "Pros it is good company for working Cons there is no cons in company", "rating": 3, "pros": "it is good company for working", "cons": "there is no cons in company", "advice": null}, {"title": "Project manager", "text": "Pros Well paid as good for a company in france Cons Nil nothing much though , a bit of pressure but fun Advice to Management Nil", "rating": 5, "pros": "Well paid as good for a company in france", "cons": "Nil nothing much though , a bit of pressure but fun", "advice": "Nil"}, {"title": "Senior Commercial Manager", "text": "Pros Plenty of career opportunity here to move up the ladder. Cons The compensation possibly doesn't seem quite as high as it could be/might be at other firms.", "rating": 3, "pros": "Plenty of career opportunity here to move up the ladder.", "cons": "The compensation possibly doesn't seem quite as high as it could be/might be at other firms.", "advice": null}, {"title": "Editorial review", "text": "Pros Dynamic, excellent products that rapidly developed to keep up with market trends, good travel opportunities, great benefits Cons I felt that my career was not progressing; limited opportunities for promotion Advice to Management Reward and promote talented staff", "rating": 3, "pros": "Dynamic, excellent products that rapidly developed to keep up with market trends, good travel opportunities, great benefits", "cons": "I felt that my career was not progressing; limited opportunities for promotion", "advice": "Reward and promote talented staff"}, {"title": "-", "text": "Pros Young sales force, which is social Cons A quiet sales floor, the most heard noise is keyboard clicking Advice to Management If you're good enough you're old enough", "rating": 3, "pros": "Young sales force, which is social", "cons": "A quiet sales floor, the most heard noise is keyboard clicking", "advice": "If you're good enough you're old enough"}, {"title": "Fine...", "text": "Pros Very good commission structure, if the targets are set up well. Very straight forward sales system. Lots of corporate structures designed to create fairness Cons Very corporate. Not a lot of room for creativity and trying new things. Created too many products for the oversubscribed telco space, becoming its own competition.", "rating": 3, "pros": "Very good commission structure, if the targets are set up well. Very straight forward sales system. Lots of corporate structures designed to create fairness", "cons": "Very corporate. Not a lot of room for creativity and trying new things. Created too many products for the oversubscribed telco space, becoming its own competition.", "advice": null}, {"title": "Doesnt understand IT", "text": "Pros Home working, flexibility, people are generally very friendly. Cons Reliance on external contractors for software development. Short term and insufficient investment which is very quickly spent on contractors.", "rating": 3, "pros": "Home working, flexibility, people are generally very friendly.", "cons": "Reliance on external contractors for software development. Short term and insufficient investment which is very quickly spent on contractors.", "advice": null}, {"title": "Ooops", "text": "Pros Too large to be anything other than a 'starter' job for your career Cons No longer a 'high performance' area - mediocracy rules Advice to Management Create career paths, invest in staff but also in management skills.", "rating": 1, "pros": "Too large to be anything other than a 'starter' job for your career", "cons": "No longer a 'high performance' area - mediocracy rules", "advice": "Create career paths, invest in staff but also in management skills."}, {"title": "I wouldn't wish working at Informa on my worst enemy", "text": "Pros I met a couple of good friends whilst working there, who shared my feelings of how dreadful a place to work it was. Cons Low pay, non-existent bonus or benefits, poor management, frequent restructuring, no progression prospects, constant layoffs, people being poached by former owner's new company, unnecessarily corporate and stuffy, and toxic work environment.", "rating": 1, "pros": "I met a couple of good friends whilst working there, who shared my feelings of how dreadful a place to work it was.", "cons": "Low pay, non-existent bonus or benefits, poor management, frequent restructuring, no progression prospects, constant layoffs, people being poached by former owner's new company, unnecessarily corporate and stuffy, and toxic work environment.", "advice": null}, {"title": "good overall", "text": "Pros good benefits, understanding managers, good team to work with Cons low salary, difficult to move between departments", "rating": 3, "pros": "good benefits, understanding managers, good team to work with", "cons": "low salary, difficult to move between departments", "advice": null}, {"title": "Informa Ops", "text": "Pros Face paced, good culture, going places Cons Hard work, growing pains, challenging", "rating": 5, "pros": "Face paced, good culture, going places", "cons": "Hard work, growing pains, challenging", "advice": null}, {"title": "Mixed bag", "text": "Pros Some great people, excellent flexible working, reasonable benefits package Cons Thinks it is a modern, nimble business, but it is a huge lumbering beast. Trying to meld old-school publishing with the trappings of tech start-up. Layers and layers of management (both product, marketing and senior) meaning the people actually doing the work are miles from the decision making processes. I'm calling this out on a separate line - PAY. No cost of living increases for years - moved to a \"meritocracy\" but that's an excuse to not keep the general pay in line with inflation and save money. Average pay is low anyway. Advice to Management Simplify the structure. You are too top heavy. If you want to act like a modern, nimble business, make decisions which don't need 12 people to sign off on them, Perhaps ask the people working directly with the products what to do rather than spend money on consultants and more layers of product management doing NIHITOs - to then just go and do what we would have suggested anyway. TRUST YOUR PEOPLE otherwise why have you got them in their roles.", "rating": 3, "pros": "Some great people, excellent flexible working, reasonable benefits package", "cons": "Thinks it is a modern, nimble business, but it is a huge lumbering beast. Trying to meld old-school publishing with the trappings of tech start-up. Layers and layers of management (both product, marketing and senior) meaning the people actually doing the work are miles from the decision making processes.", "advice": "Simplify the structure. You are too top heavy. If you want to act like a modern, nimble business, make decisions which don't need 12 people to sign off on them, Perhaps ask the people working directly with the products what to do rather than spend money on consultants and more layers of product management doing NIHITOs - to then just go and do what we would have suggested anyway. TRUST YOUR PEOPLE otherwise why have you got them in their roles."}, {"title": "The worst experience, not sure how they are in ftse100", "text": "Pros Working hours and thats it to be honest. Cons - Management are terrible, they make you work so hard for little to no money - They never stick up for your arguments. To busy helping themselves. -Shocking accounts. They offer every firm a discount 50% plus. BD reps just mail merge all leads and send the same exact email every week. - BD reps sit there roaming around your accounts and trying to steal your sales. - Lad atmosphere and some of the most unmotivated sales people ever. Sit emailing to get sales by offering 80% off the RRP price. - I have now left the firm, who I was owned commission by. They said they would pay me from January to May a total sum of between worse case scenario and best case scenario. I have now waited 6 months for them to conclude \"investigations\" on my accounts and they have confirmed to me that they will not pay any outstanding owing. Lets just say it was a five figure amount and was then reduced to four figures. They actually sent a form and settlement figure and after asking them to send a revised form with the correct details, they ignored the facts and ended up letting me know via an email they will not pay. After being voted Account manager of the year and bringing in more money then there best sales person in the team. This is how they reward hard working individuals. STAY AWAY AT ALL CASE. No progression, no pay rises, weak pay system and poor management. Forget it and join Global Data if you have to. Advice to Management Get rid of 95% of management there and put in some hard working honest individuals. Way to many people are up other backsides.", "rating": 1, "pros": "Working hours and thats it to be honest.", "cons": "- Management are terrible, they make you work so hard for little to no money", "advice": "Get rid of 95% of management there and put in some hard working honest individuals. Way to many people are up other backsides."}, {"title": "Sales Review", "text": "Pros Good people, products, pay is pretty good Cons The 'plan' keeps changing. Weak leadership Advice to Management Improve levels of trust and communication", "rating": 3, "pros": "Good people, products, pay is pretty good", "cons": "The 'plan' keeps changing. Weak leadership", "advice": "Improve levels of trust and communication"}, {"title": "Average FTSE100", "text": "Pros Great experience for junior; opportunity to travel Cons Poor company morale and rely heavily buddy culture, non-existence HR. Low pay.", "rating": 3, "pros": "Great experience for junior; opportunity to travel", "cons": "Poor company morale and rely heavily buddy culture, non-existence HR. Low pay.", "advice": null}, {"title": "X", "text": "Pros Training/ support for progression was good Cons Tight deadlines and too challenging Advice to Management Lower the work pressure by setting easier deadlines", "rating": 3, "pros": "Training/ support for progression was good", "cons": "Tight deadlines and too challenging", "advice": "Lower the work pressure by setting easier deadlines"}, {"title": "Finance", "text": "Pros Good culture and benefits. Understanding management. Cons Potentially long working hours during changes and closing", "rating": 5, "pros": "Good culture and benefits. Understanding management.", "cons": "Potentially long working hours during changes and closing", "advice": null}, {"title": "Digital Content Manager", "text": "Pros Good attention to career progression from managers, with budgets for training Cons Little cohesion between teams, tend to work in silos. Need for Project Manager role to unite teams and overall vision", "rating": 3, "pros": "Good attention to career progression from managers, with budgets for training", "cons": "Little cohesion between teams, tend to work in silos. Need for Project Manager role to unite teams and overall vision", "advice": null}, {"title": "Manager", "text": "Pros You can definitely get away with alot in this organisation! Cons Nothing ever gets done. Everyone seems to like to work blind folded as no one wants to be responsible nor accountable for anything. If only the shareholders took a closer look and not accept everything they have been told by so called top managers who shouldn't even be in their jobs in the first place!!!! Advice to Management Reshuffle your top managers and provide them with the relevant skills and look to those who actually want to work and promote them within!", "rating": 3, "pros": "You can definitely get away with alot in this organisation!", "cons": "Nothing ever gets done. Everyone seems to like to work blind folded as no one wants to be responsible nor accountable for anything. If only the shareholders took a closer look and not accept everything they have been told by so called top managers who shouldn't even be in their jobs in the first place!!!!", "advice": "Reshuffle your top managers and provide them with the relevant skills and look to those who actually want to work and promote them within!"}, {"title": "Good opportunity but not a welcoming environment", "text": "Pros Good opportunities to take initiative Cons Isolating environment, felt discluded from the team", "rating": 3, "pros": "Good opportunities to take initiative", "cons": "Isolating environment, felt discluded from the team", "advice": null}, {"title": "web production", "text": "Pros good benefits package offered after 6 months Cons production team overlooked for sales team", "rating": 3, "pros": "good benefits package offered after 6 months", "cons": "production team overlooked for sales team", "advice": null}, {"title": "Too many chiefs not enough indians", "text": "Pros Great location, good benefits e.g. share plan Cons Too many chiefs not enough indians. Melbourne office closed", "rating": 3, "pros": "Great location, good benefits e.g. share plan", "cons": "Too many chiefs not enough indians. Melbourne office closed", "advice": null}, {"title": "Instable job", "text": "Pros Good benefits ( medical insurance, meal ticket) Cons Instable, low salaries, don't give value to their professionals Advice to Management To get closer with people who work with", "rating": 3, "pros": "Good benefits ( medical insurance, meal ticket)", "cons": "Instable, low salaries, don't give value to their professionals", "advice": "To get closer with people who work with"}, {"title": "Customer Service Exec", "text": "Pros dynamic team always trying to look to renew itself Cons salary is not high enough and they are not acting enough against turn over Advice to Management listen less to expensive consultants and more to your people", "rating": 5, "pros": "dynamic team always trying to look to renew itself", "cons": "salary is not high enough and they are not acting enough against turn over", "advice": "listen less to expensive consultants and more to your people"}, {"title": "BD Manager", "text": "Pros Supportive colleagues, good working environment Cons Recycle data , mkting need to buy new data Advice to Management No comment", "rating": 5, "pros": "Supportive colleagues, good working environment", "cons": "Recycle data , mkting need to buy new data", "advice": "No comment"}, {"title": "Informa in a nut shell", "text": "Pros 1- Good people to work with (mix of different cultures and people) 2 - Big company on your CV if you are working in exhibitions & conferences industry 3 - They are generous with holidays Cons 1 - Scope of work might be limited to exhibitions & conferences only 2 - Work can become boring and strenuous for following reasons (boring; because you are repeating the same type of work, which is promoting exhibitions, strenuous; part of your job role will involve admin work of updating website since website systems are now more marketing friendly) 3 - You are either too busy or too free at times, since exhibitions operate on fixed time periods, 6 weeks out from the show, work becomes hectic and you have to utilise your time in an effective way or you will have to spend extra hours on your desk. Advice to Management None I can think of, this is the nature of exhibitions, hire people who are passionate about exhibitions", "rating": 5, "pros": "1- Good people to work with (mix of different cultures and people)", "cons": "1 - Scope of work might be limited to exhibitions & conferences only", "advice": "None I can think of, this is the nature of exhibitions, hire people who are passionate about exhibitions"}, {"title": "Chance to grow", "text": "Pros Large perspectives and opportunities horizons within the company Cons Lake of agility for some crucial operations", "rating": 5, "pros": "Large perspectives and opportunities horizons within the company", "cons": "Lake of agility for some crucial operations", "advice": null}, {"title": "IT Team", "text": "Pros Good chance to learn and progress, nice morale. Cons Not the highest payers. Advice to Management Look after staff and they will look after you.", "rating": 5, "pros": "Good chance to learn and progress, nice morale.", "cons": "Not the highest payers.", "advice": "Look after staff and they will look after you."}, {"title": "Project Manager", "text": "Pros The organisation is constantly looking for new opportunities to grow. It has many divisions and there are many opportunities to develop within the organisation. Cons Roles are not always defined.", "rating": 5, "pros": "The organisation is constantly looking for new opportunities to grow. It has many divisions and there are many opportunities to develop within the organisation.", "cons": "Roles are not always defined.", "advice": null}, {"title": "AVOID", "text": "Pros Incentives, start early leave early Cons Don't expect any training. Don't expect any progression. Awful salary. Management is laughable. Little to no support. Can best be described as a 'soul draining' environment. Advice to Management Invest in your staff, then there wouldn't be such a high turnover!!!!", "rating": 1, "pros": "Incentives, start early leave early", "cons": "Don't expect any training. Don't expect any progression. Awful salary. Management is laughable. Little to no support. Can best be described as a 'soul draining' environment.", "advice": "Invest in your staff, then there wouldn't be such a high turnover!!!!"}, {"title": "Management", "text": "Pros location was good , right off the subway line Cons terrible place to work, upper management do not know what they are doing Advice to Management get a new upper management team", "rating": 1, "pros": "location was good , right off the subway line", "cons": "terrible place to work, upper management do not know what they are doing", "advice": "get a new upper management team"}, {"title": "Good company", "text": "Pros A good array of benefits offered that employees can sign onto each year including matched pension scheme Cons Titled promotions or pay rises take a long time to be approved by top level management, which tends to delay the process considerably Advice to Management Approving promotion / pay rise decisions more quickly could encourage more employees to stay", "rating": 3, "pros": "A good array of benefits offered that employees can sign onto each year including matched pension scheme", "cons": "Titled promotions or pay rises take a long time to be approved by top level management, which tends to delay the process considerably", "advice": "Approving promotion / pay rise decisions more quickly could encourage more employees to stay"}, {"title": "Senior Analyst", "text": "Pros - Flexible work - Exposure to lots of different research topics - office in central location Cons - Salary - Benefits package - Impersonal - Company values", "rating": 3, "pros": "- Flexible work", "cons": "- Salary", "advice": null}, {"title": "Ok", "text": "Pros Good work life balance and people Cons Below market rate of basic and limited direction in strategy Advice to Management You have good staff listen to them more", "rating": 5, "pros": "Good work life balance and people", "cons": "Below market rate of basic and limited direction in strategy", "advice": "You have good staff listen to them more"}, {"title": "Former employee", "text": "Pros A bit of flexibility in working hours. Cons Haphazard management and high employee turnover.", "rating": 3, "pros": "A bit of flexibility in working hours.", "cons": "Haphazard management and high employee turnover.", "advice": null}, {"title": "Great company", "text": "Pros Innovative and entrepreneurial. Lovely people who are very willing to work with new ideas. A positive culture where people respect and are kind to each other. Flexible working environment. Cons You will need the capacity to handle high levels of diverse workload to thrive here at mid to senior management levels. Advice to Management Be more aware of the capacity and true impact on the work force to deal with complex, multi layered change.", "rating": 5, "pros": "Innovative and entrepreneurial. Lovely people who are very willing to work with new ideas. A positive culture where people respect and are kind to each other. Flexible working environment.", "cons": "You will need the capacity to handle high levels of diverse workload to thrive here at mid to senior management levels.", "advice": "Be more aware of the capacity and true impact on the work force to deal with complex, multi layered change."}, {"title": "Account Manager", "text": "Pros Great work life balance and flexible working hours Cons Below industry average salary packages Advice to Management Better pay", "rating": 3, "pros": "Great work life balance and flexible working hours", "cons": "Below industry average salary packages", "advice": "Better pay"}, {"title": "Account Manager", "text": "Pros Great work life balance and flexible working hours Cons Below industry average salary packages Advice to Management Better pay", "rating": 3, "pros": "Great work life balance and flexible working hours", "cons": "Below industry average salary packages", "advice": "Better pay"}, {"title": "Good Company", "text": "Pros Working from home is OK. Given autonomy. Cons Targets on the high side. But to be expected at PLC,", "rating": 5, "pros": "Working from home is OK. Given autonomy.", "cons": "Targets on the high side. But to be expected at PLC,", "advice": null}, {"title": "Disorganised mess, but good monetary incentive", "text": "Pros Commission structure, simplicity of roles, flexible hours, low expectations of overtime, early finishes, quickly start earning higher commission, industry leading products Cons Boring day to day, monotony makes you feel robotic, poor management, poor customer service throughout company with you taking the brunt of it as primary customer facing employee Advice to Management More transparency between teams less internal competition for revenue and commission results in tactics that are harmful to the company bottom line, improve basic systems of reporting and data input.", "rating": 3, "pros": "Commission structure, simplicity of roles, flexible hours, low expectations of overtime, early finishes, quickly start earning higher commission, industry leading products", "cons": "Boring day to day, monotony makes you feel robotic, poor management, poor customer service throughout company with you taking the brunt of it as primary customer facing employee", "advice": "More transparency between teams less internal competition for revenue and commission results in tactics that are harmful to the company bottom line, improve basic systems of reporting and data input."}, {"title": "Politics", "text": "Pros Best to avoid it now Cons Culture deteriorated , heavy on politics", "rating": 1, "pros": "Best to avoid it now", "cons": "Culture deteriorated , heavy on politics", "advice": null}, {"title": "Business as a whole", "text": "Pros Change and GAP program means that the company is growing Cons it still needs some refining, a lot of changes mean a lot of confusion and trial and error", "rating": 5, "pros": "Change and GAP program means that the company is growing", "cons": "it still needs some refining, a lot of changes mean a lot of confusion and trial and error", "advice": null}, {"title": "Good overall.", "text": "Pros The people and the atmosphere. Cons Career progression and compensation is poor. Advice to Management Review compensation for staff.", "rating": 5, "pros": "The people and the atmosphere.", "cons": "Career progression and compensation is poor.", "advice": "Review compensation for staff."}, {"title": "Great Company", "text": "Pros Great communication between teams. Very Professional people. Cons The office is a bit boring. Maybe add some thinking/ Relaxing space ? Advice to Management None", "rating": 5, "pros": "Great communication between teams.", "cons": "The office is a bit boring.", "advice": "None"}, {"title": "Working in Sales", "text": "Pros Nice people in team Nice offices Good sick pay Good work life balance Cons Bad management Like a school system constantly moving where people sit to \"improve work\"", "rating": 3, "pros": "Nice people in team", "cons": "Bad management", "advice": null}, {"title": "Close company", "text": "Pros - Flexible working time (can work from home) -Wide range of benefits -friendly environment - The victoria office is very nice with a wide range of teas and coffee Cons It can often be extremely bureaucratic and doesn't have as many perks as many other companies on the FTSE 100, not very well known which is a shame as it does not carry the prestige it deserves Advice to Management Begin to market Informa's brand more effectively and provide more opportunities for growth and recognition within the company. Make all the offices more uniform,", "rating": 5, "pros": "- Flexible working time (can work from home)", "cons": "It can often be extremely bureaucratic and doesn't have as many perks as many other companies on the FTSE 100, not very well known which is a shame as it does not carry the prestige it deserves", "advice": "Begin to market Informa's brand more effectively and provide more opportunities for growth and recognition within the company. Make all the offices more uniform,"}, {"title": "Creative Designer", "text": "Pros Good flexibility for remote working, Nice offices and generally nice people working with in teams, decent social events Cons Poor structural knowledge, very poor support, generally people don't leave they just move into different jobs that they are not really qualified to do so a lot of issues with the quality of the products and work that is sent out to clients, poor management interaction as they often leave with in 6 months due to having little support with unrealistic targets, or move to a different department. Generally people seem to be under a lot of pressure and often the case is to just 'send stuff out' with little thought in regards to creativity, usability or quality. In summary it is a modern company with very little depth or substance and little opportunities to grow in your field as well as only just meeting the industry standards of payment to experience. As with myself and most people you leave with in 1- 2 years onto bigger and hopefully prouder things. Advice to Management Make sure that you employ people who understand their roles, want to improve your products and have the knowledge and experience to do this. Most importantly listen to them and get your head out of the 'Its ok we did this for the last 5-10 years and it worked' attitude. Your miles behind your competitors in tech and quality due to this mindset. Also consider more support, training and pay the people what they deserve and more, that's how you keep them at the company. Only keeping management happy with high pay is a sure way to lose decent people.", "rating": 3, "pros": "Good flexibility for remote working, Nice offices and generally nice people working with in teams, decent social events", "cons": "Poor structural knowledge, very poor support, generally people don't leave they just move into different jobs that they are not really qualified to do so a lot of issues with the quality of the products and work that is sent out to clients, poor management interaction as they often leave with in 6 months due to having little support with unrealistic targets, or move to a different department. Generally people seem to be under a lot of pressure and often the case is to just 'send stuff out' with little thought in regards to creativity, usability or quality. In summary it is a modern company with very little depth or substance and little opportunities to grow in your field as well as only just meeting the industry standards of payment to experience. As with myself and most people you leave with in 1- 2 years onto bigger and hopefully prouder things.", "advice": "Make sure that you employ people who understand their roles, want to improve your products and have the knowledge and experience to do this. Most importantly listen to them and get your head out of the 'Its ok we did this for the last 5-10 years and it worked' attitude. Your miles behind your competitors in tech and quality due to this mindset. Also consider more support, training and pay the people what they deserve and more, that's how you keep them at the company. Only keeping management happy with high pay is a sure way to lose decent people."}]