[{"title": "Happy to be here!", "text": "Pros IB has the best work environment ever. You just don't find this in this industry today anywhere else. Smart technical people, hands on executives and NO RED TAPE or politics. The product suite is excellent and innovation is constant. Oh, and the pay is competitive or above the industry scale. Cons Locally, we are trying to grow our partner network and that is moving slower than expected. Advice to Management Continue to support the field, we know we are a priority and being able to just call an executive directly for support and have your request welcomed is a rarity in other companies! Not here!", "rating": 5, "pros": "IB has the best work environment ever. You just don't find this in this industry today anywhere else. Smart technical people, hands on executives and NO RED TAPE or politics. The product suite is excellent and innovation is constant. Oh, and the pay is competitive or above the industry scale.", "cons": "Locally, we are trying to grow our partner network and that is moving slower than expected.", "advice": "Continue to support the field, we know we are a priority and being able to just call an executive directly for support and have your request welcomed is a rarity in other companies! Not here!"}, {"title": "Area SE Manager", "text": "Pros I retired after 20 years with this company. Three things made it a terrific place to work. #1 is the flat structure of the organization. As a field front line manager, I had access to all levels of the company, without impeding bureaucracy, including Support, Management, R&D; #2 the collegial culture of the organization, as the company is large enough to be significant but small enough that I could have working relationships with peers and others throughout the company, both North America and International; and #3 there has always been something new to learn, experience, and work with (as a technologist, this was very important). The company has a technology stack that is broad and deep. Cons Sometimes the company can be entrapped by its own \"traditions\", but I always viewed this as an opportunity in that I and others could work to implement process improvements, and get those process improvements in place. IBI can be a bottom-up company, meaning that innovations can come from all levels of the company. If you are looking for a unilateral, top-down management style, IBI is not your place. If you want a place to make your mark, IBI affords the opportunities.", "rating": 5, "pros": "I retired after 20 years with this company. Three things made it a terrific place to work. #1 is the flat structure of the organization. As a field front line manager, I had access to all levels of the company, without impeding bureaucracy, including Support, Management, R&D; #2 the collegial culture of the organization, as the company is large enough to be significant but small enough that I could have working relationships with peers and others throughout the company, both North America and International; and #3 there has always been something new to learn, experience, and work with (as a technologist, this was very important). The company has a technology stack that is broad and deep.", "cons": "Sometimes the company can be entrapped by its own \"traditions\", but I always viewed this as an opportunity in that I and others could work to implement process improvements, and get those process improvements in place.", "advice": null}, {"title": "Friendly, helpful people. Founder is cheap and won’t invest in marketing or employees.", "text": "Pros Good people who have long tenures and will do anything to help. low stress. They have hundreds of happy large name customers. Selling to the customer base is easy. Getting new customers is a challenge. Gartner has been unfair regarding the technology for the past several years in favor of the bright, shining stars. Cons Nobody knows about the company although it’s over 40 years old. No marketing or name recognition. Hard to sell. There is a very limited partner network. Benefits are sub-par. They only pay $50 for cell phone —  ridiculous and a reflection of the “cheap” attitude. Advice to Management Invest in innovative technology, marketing and a more experienced sales team", "rating": 3, "pros": "Good people who have long tenures and will do anything to help. low stress. They have hundreds of happy large name customers. Selling to the customer base is easy. Getting new customers is a challenge. Gartner has been unfair regarding the technology for the past several years in favor of the bright, shining stars.", "cons": "Nobody knows about the company although it’s over 40 years old. No marketing or name recognition. Hard to sell. There is a very limited partner network. Benefits are sub-par. They only pay $50 for cell phone —  ridiculous and a reflection of the “cheap” attitude.", "advice": "Invest in innovative technology, marketing and a more experienced sales team"}, {"title": "Proud and exhilarated!", "text": "Pros I am proud to be part of such a great company and exhilarated by our renewed sense of purpose to the mission and our future. Cons No cons - it's a brand new day here at Information Builders. Advice to Management Continue to drive value with our customers, take advantage of market opportunities to increase new business, and accelerate product road map timelines for on-going product superiority.", "rating": 5, "pros": "I am proud to be part of such a great company and exhilarated by our renewed sense of purpose to the mission and our future.", "cons": "No cons - it's a brand new day here at Information Builders.", "advice": "Continue to drive value with our customers, take advantage of market opportunities to increase new business, and accelerate product road map timelines for on-going product superiority."}, {"title": "Great Place to Work", "text": "Pros There's a reason people stick around here 20-30 years - the people are genuinely nice and great to work with. It seems like a lot of changes are coming down the pipeline, but in a good way; efforts to modernize and rebrand our image, as well as investments to further innovate our products in order to put us at the top of the game. Cons Some senior staff have a tendency to be old school in their methodology, and a bit resistant to change. Advice to Management Keep pushing the new positive changes.", "rating": 5, "pros": "There's a reason people stick around here 20-30 years - the people are genuinely nice and great to work with. It seems like a lot of changes are coming down the pipeline, but in a good way; efforts to modernize and rebrand our image, as well as investments to further innovate our products in order to put us at the top of the game.", "cons": "Some senior staff have a tendency to be old school in their methodology, and a bit resistant to change.", "advice": "Keep pushing the new positive changes."}, {"title": "Amazing Place to Work and Grow!", "text": "Pros Information Builders is a wonderful company, providing me continued opportunity to be challenged and grow over the years. The culture really does combine the energy of a startup with the knowledge gained from decades of experience in the industry. The people and the culture make it an amazing place to work. There are lot of positive changes happening within the company now to position it for continued growth. I am very excited for this next phase! Cons I really do not see any cons, just very excited about all the new initiatives. Advice to Management Continue to value your customers and employees the way you always have.", "rating": 5, "pros": "Information Builders is a wonderful company, providing me continued opportunity to be challenged and grow over the years. The culture really does combine the energy of a startup with the knowledge gained from decades of experience in the industry. The people and the culture make it an amazing place to work. There are lot of positive changes happening within the company now to position it for continued growth. I am very excited for this next phase!", "cons": "I really do not see any cons, just very excited about all the new initiatives.", "advice": "Continue to value your customers and employees the way you always have."}, {"title": "Account Executive", "text": "Pros Solid Customer Base and References. Great Customer Support Cons Need modern thinking in sales management", "rating": 5, "pros": "Solid Customer Base and References. Great Customer Support", "cons": "Need modern thinking in sales management", "advice": null}, {"title": "Underwhelming", "text": "Pros Decent benefits Base pay is fair Friendly people in the local offices Cons No name recognition in the marketplace Not a lot of new name accounts are added each year (revenues appear to be shrinking) Terrible senior leadership team running the sales division (old dogs, and no new tricks) The technology is old Paper-heavy organization Advice to Management Goldman Sachs and the board need to replace the senior leadership team and hire a rock star Chief Revenue Officer to lead the sales team. The company should also increase their marketing budget, and do a better job supporting sales. While you're at it, find a rockstar Chief Marketing Officer, too.", "rating": 3, "pros": "Decent benefits", "cons": "No name recognition in the marketplace", "advice": "Goldman Sachs and the board need to replace the senior leadership team and hire a rock star Chief Revenue Officer to lead the sales team. The company should also increase their marketing budget, and do a better job supporting sales. While you're at it, find a rockstar Chief Marketing Officer, too."}, {"title": "Dead End", "text": "Pros Easy commute. Not open plan office. Nice people (excluding management). Cons No career progression. Managers are rooted to their posts well past retirement age. Promotions are extremely rare. Top down management style stuck in the 1950's. You are paid to think, but your opinion isn't welcome. Work from home only 4 days a year. Health insurance is extremely expensive. Pay is low and wont get higher. Technology is antiquated. Goldman Sacks, a part owner, will probably shrink the company down to a fraction of its current size. Advice to Management Please stop writing fake \"glowing\" reviews and retire. Oh, sorry, I forgot. My advice isn't welcome.", "rating": 3, "pros": "Easy commute. Not open plan office. Nice people (excluding management).", "cons": "No career progression. Managers are rooted to their posts well past retirement age. Promotions are extremely rare. Top down management style stuck in the 1950's. You are paid to think, but your opinion isn't welcome. Work from home only 4 days a year. Health insurance is extremely expensive. Pay is low and wont get higher. Technology is antiquated. Goldman Sacks, a part owner, will probably shrink the company down to a fraction of its current size.", "advice": "Please stop writing fake \"glowing\" reviews and retire. Oh, sorry, I forgot. My advice isn't welcome."}, {"title": "Information Builders is moving forward", "text": "Pros A lot of positive changes happening within the company. Product innovations, a more collaborative culture, and even some rebranding. I have been happy with the company for the most part since the beginning but it's nice to everyone collaborating together to make these changes. Cons I am very happy in my role and very excited to see what's to come!", "rating": 5, "pros": "A lot of positive changes happening within the company. Product innovations, a more collaborative culture, and even some rebranding. I have been happy with the company for the most part since the beginning but it's nice to everyone collaborating together to make these changes.", "cons": "I am very happy in my role and very excited to see what's to come!", "advice": null}, {"title": "Technical Director", "text": "Pros Great people, great technology. Opportunity to write your own ticket from a career perspective. Great work-life balance. Cons Upward movement can be slow Advice to Management Invest in the product, modernize the workforce.", "rating": 5, "pros": "Great people, great technology. Opportunity to write your own ticket from a career perspective. Great work-life balance.", "cons": "Upward movement can be slow", "advice": "Invest in the product, modernize the workforce."}, {"title": "terrible company to work for", "text": "Pros Good benefits and the heat works fine Cons This is a company stuck in the 90's. Salaries and bonus'(if obtained) reflect it. You get a 3 to 5 year old laptop and it's a paper intensive company...very little internally automated. The products are old and very few new name customers. Revenue has been shrinking for the last 10 years Advice to Management Replace all senior management. Automate internally. Redo the two major product lines to make them competitive", "rating": 1, "pros": "Good benefits and the heat works fine", "cons": "This is a company stuck in the 90's. Salaries and bonus'(if obtained) reflect it. You get a 3 to 5 year old laptop and it's a paper intensive company...very little internally automated. The products are old and very few new name customers. Revenue has been shrinking for the last 10 years", "advice": "Replace all senior management. Automate internally. Redo the two major product lines to make them competitive"}, {"title": "Stable, Secure, Supportive", "text": "Pros - Flexibility with telecommuting options - Convenient location from many different transportation sources - Interactive HR - Full medical/dental package Cons - Aging senior management - Volatility of industry", "rating": 5, "pros": "- Flexibility with telecommuting options", "cons": "- Aging senior management", "advice": null}, {"title": "2018 will be a great year for Information Builders", "text": "Pros Room for growth if you work hard and show dedication. Cons Some long time employees are not contributing enough and need motivation. Advice to Management Have quarterly performance reviews, assign clear quarterly/annual goals to all staff including Executive and Management staff, reward the hard working staff with incentives, review salaries across the organization, and put poor performers on professional improvement plans and cut. Invest in internal training programs to train Managers, Sales, and Marketing. Hire seasoned and creative minds for product development/new innovations.", "rating": 5, "pros": "Room for growth if you work hard and show dedication.", "cons": "Some long time employees are not contributing enough and need motivation.", "advice": "Have quarterly performance reviews, assign clear quarterly/annual goals to all staff including Executive and Management staff, reward the hard working staff with incentives, review salaries across the organization, and put poor performers on professional improvement plans and cut. Invest in internal training programs to train Managers, Sales, and Marketing. Hire seasoned and creative minds for product development/new innovations."}, {"title": "Poor Sales Culture", "text": "Pros Salary was paid on time Cons Unnecessary requirement to be in the office when not at meeting Most micro-managed I've ever been in my life Below average technology Unmotivated sales engineers Mediocrity is the status quo Advice to Management Kill the requirement to come into the office - who wants to schlep 2 hours round trip into Manhattan? Why did you use an outdated CRM when you can easily build something efficient? Who realistically gets 9 onsite meetings per week? Why are you asking for falsely entered data?", "rating": 3, "pros": "Salary was paid on time", "cons": "Unnecessary requirement to be in the office when not at meeting", "advice": "Kill the requirement to come into the office - who wants to schlep 2 hours round trip into Manhattan? Why did you use an outdated CRM when you can easily build something efficient? Who realistically gets 9 onsite meetings per week? Why are you asking for falsely entered data?"}, {"title": "A software company", "text": "Pros Close to train station. Cons Minimal growth and promotion. Working from home is generally not allowed by policy. You have to report to management for days working from home. High deductible health insurance. Lower 401 contribution limit than IRS allowed. Advice to Management As a software company, software engineers are the core of the company. They need to be treated well.", "rating": 3, "pros": "Close to train station.", "cons": "Minimal growth and promotion. Working from home is generally not allowed by policy. You have to report to management for days working from home. High deductible health insurance. Lower 401 contribution limit than IRS allowed.", "advice": "As a software company, software engineers are the core of the company. They need to be treated well."}, {"title": "I have been working at Information Builders full-time 3 years", "text": "Pros Comfortable environment. Very good upper management. Great location (New York, NY) Cons Complete lack of communication between departments No ability to grow.", "rating": 3, "pros": "Comfortable environment. Very good upper management.", "cons": "Complete lack of communication between departments", "advice": null}, {"title": "Long time", "text": "Pros Good place to grow, and gain experience with a variety of computer platforms. Cons Company is not growing but treading water.", "rating": 3, "pros": "Good place to grow, and gain experience with a variety of computer platforms.", "cons": "Company is not growing but treading water.", "advice": null}, {"title": "No Contribution to 401K Plan!", "text": "Pros There is a 401K plan to which employees can contribute Cons No contribution for 2016 from company Advice to Management Be progressive - Take care of your employees and they will take care of your customers", "rating": 3, "pros": "There is a 401K plan to which employees can contribute", "cons": "No contribution for 2016 from company", "advice": "Be progressive - Take care of your employees and they will take care of your customers"}, {"title": "Extra due diligence needed before joining.", "text": "Pros Some dedicated people Attempting to be relevant with newer capabilities Cons Micromanagement - Everything from how to exactly word prospect and customer emails to to constant monitoring of call activities. Incompetent sales managers with no leadership skills- approach to challenges with selling inferior technology (solution dropped to lower left of Gartner Quadrant and was being quickly outflanked by more nimble and savvy competitors) was to constantly harass the sales reps. This included nasty emails (often during weekends) demanding answers to lack of interest from prospects, limited meeting activity, pressure to pressure existing customers into signing deals (\"go wait outside CIO office until they sign\"), constant inspections and lengthy, redundant reviews. Simply no answers or advice around handling a tough situation...no leadership whatsoever. Product evaluation process was something out of the 90s - compared to new competitors, we always appeared to be a pain to work with for a simple evaluation. Advice to prospective sales reps: do your due diligence. Ensure you call reps who are tasked with calling on new logos. Talk to them at length about their experience. Advice to Management Read above, especially the verbiage about micromanagement and sales manager's style of \"directing\" team.", "rating": 1, "pros": "Some dedicated people", "cons": "Micromanagement - Everything from how to exactly word prospect and customer emails to to constant monitoring of call activities.", "advice": "Read above, especially the verbiage about micromanagement and sales manager's style of \"directing\" team."}, {"title": "Grow Career with Information Builders", "text": "Pros Comfortable and welcoming environment Great location (NY) Ability to grow your career Cons Some lack of communication between departments Advice to Management Keep it up!", "rating": 5, "pros": "Comfortable and welcoming environment", "cons": "Some lack of communication between departments", "advice": "Keep it up!"}, {"title": "Potential but stuck in old ways", "text": "Pros Technology is good and most of the people are great. Cons Need to get rid of stubborn close minded management. No room for growth.", "rating": 3, "pros": "Technology is good and most of the people are great.", "cons": "Need to get rid of stubborn close minded management. No room for growth.", "advice": null}, {"title": "Sales", "text": "Pros The company's stability as it was founded over 40 years ago and has endured while other companies in the software industry have come and gone The opportunity to grow with a company in the Software industry is exciting and there seems to be several paths that appear to be rewarding The culture in the office is very positive, team-oriented, and collaborative as we are always helping each other improve our skills and knowledge on a daily basis The sales team has the tools necessary to be able to perform our responsibilities in the most efficient manner possible Cons I haven't experienced anything in the negative category since I started Advice to Management Continue to support the sales team by providing the most updated tools to allow us to succeed", "rating": 5, "pros": "The company's stability as it was founded over 40 years ago and has endured while other companies in the software industry have come and gone", "cons": "I haven't experienced anything in the negative category since I started", "advice": "Continue to support the sales team by providing the most updated tools to allow us to succeed"}, {"title": "Great place to work at", "text": "Pros Supportive management - they let you focus on technical aspects that particularly interest you. Good atmosphere - smart and hard-working coworkers who are willing to help you when needed. Great location - at Penn Station. Easy to get to most of the subways lines, LIRR and NJ Transit. Cons Company does not own a cafeteria or offer free food like other big tech companies do Advice to Management keep it up and retain our competitive advantages", "rating": 5, "pros": "Supportive management - they let you focus on technical aspects that particularly interest you.", "cons": "Company does not own a cafeteria or offer free food like other big tech companies do", "advice": "keep it up and retain our competitive advantages"}, {"title": "Technical Director", "text": "Pros Flexibile schedule. Great co-workers. Great managers. Cons Not a market leader. Slow adopter of technologies. Advice to Management Trust more developers. Stop following, start leading.", "rating": 5, "pros": "Flexibile schedule. Great co-workers. Great managers.", "cons": "Not a market leader. Slow adopter of technologies.", "advice": "Trust more developers. Stop following, start leading."}, {"title": "Find a better job", "text": "Pros Nice coworkers. Easy commute. Good shopping in the area. Cons Worked there for over five years. Toxic environment. Lower than average salaries with no bonuses or raises. Ancient technology with no room for growth. Advice to Management Learn to reward good work.", "rating": 3, "pros": "Nice coworkers. Easy commute. Good shopping in the area.", "cons": "Worked there for over five years. Toxic environment. Lower than average salaries with no bonuses or raises. Ancient technology with no room for growth.", "advice": "Learn to reward good work."}, {"title": "Regional Operations Manager", "text": "Pros IBI is like my second family; people I work with truly care and would go the extra mile to help you. A great place to work; secure; fun and always challenges you to perform your job the best to your ability. Marketing makes the events FUN! Customers love us! I look forward to coming to work each and every day! Cons The only con I can think of is if you've been here a long time like I have; there's no moving up in the corporate ladder; unless you choose sales", "rating": 5, "pros": "IBI is like my second family; people I work with truly care and would go the extra mile to help you. A great place to work; secure; fun and always challenges you to perform your job the best to your ability. Marketing makes the events FUN! Customers love us! I look forward to coming to work each and every day!", "cons": "The only con I can think of is if you've been here a long time like I have; there's no moving up in the corporate ladder; unless you choose sales", "advice": null}, {"title": "Software Engineer", "text": "Pros Friendly People. Good location. O.k pay Cons Very out of date, don't follow modern best practices for software development. Everyone except for our one department (my manager was fighting hard for change) seemed to be very outdated. Advice to Management Spend more time on training your employees or encouraging them to learn new skills/languages themselves. Maybe attend meetups.", "rating": 3, "pros": "Friendly People. Good location. O.k pay", "cons": "Very out of date, don't follow modern best practices for software development. Everyone except for our one department (my manager was fighting hard for change) seemed to be very outdated.", "advice": "Spend more time on training your employees or encouraging them to learn new skills/languages themselves. Maybe attend meetups."}, {"title": "Good Company", "text": "Pros Great products, great people and culture Cons Not any that I can think of", "rating": 3, "pros": "Great products, great people and culture", "cons": "Not any that I can think of", "advice": null}, {"title": "Great Place to Work", "text": "Pros Great product, Willingness by all levels to help you be successful Cons Marketing spend and brand recognition are still an issue", "rating": 5, "pros": "Great product, Willingness by all levels to help you be successful", "cons": "Marketing spend and brand recognition are still an issue", "advice": null}, {"title": "Sr. Account Executive", "text": "Pros If you have real-world sales skills you are in a class of your own. Cons Base Salary is below industry standards. Very old fashion management out of the 80's. Their WebFocus technology \"claim to fame in the hay-day Mainframe era\" is at the core of every product they sell. It's based on a 4th GL called FOCUS.....very old fashion! New accounts do not buy old technology! To make your sales quote your need 90% of your revenue coming from the installed base. If you do not have a big installed base using their products.....QUIT...You will never make your sales quota! Very few sales people make the quota. Advice to Management Fire all management that has worked their for greater than 15-20 years. Some have been there for 20-30yrs and keep doing he things that worked in the 80's is like going back in time. If you", "rating": 1, "pros": "If you have real-world sales skills you are in a class of your own.", "cons": "Base Salary is below industry standards. Very old fashion management out of the 80's. Their WebFocus technology \"claim to fame in the hay-day Mainframe era\" is at the core of every product they sell. It's based on a 4th GL called FOCUS.....very old fashion! New accounts do not buy old technology! To make your sales quote your need 90% of your revenue coming from the installed base. If you do not have a big installed base using their products.....QUIT...You will never make your sales quota! Very few sales people make the quota.", "advice": "Fire all management that has worked their for greater than 15-20 years. Some have been there for 20-30yrs and keep doing he things that worked in the 80's is like going back in time. If you"}, {"title": "Old but good", "text": "Pros Smart people and fun place to work Cons Company is playing catch up with technology Advice to Management Hurry up", "rating": 3, "pros": "Smart people and fun place to work", "cons": "Company is playing catch up with technology", "advice": "Hurry up"}, {"title": "Sales Exec", "text": "Pros Launched new 8.0 platform, this was the boost that the product needed. Nice new look and feel with with unmatched power to access any data asset inside or outside of the organization. Everything is now responsive design, so build it once and it will automatically adjust to the screen you are using. Customers love the new visualization tool called Business Unser Edition, it's trumping Tableau and Qlick time after time, you must see it!!! Cons Some of the Marketing ways in the past have been either outdated or resulted in little exposure, i think mainly due to the lack of budget the company would give to marketing? However i have heard as of late that the company is putting alot more $$$ into marketing, e.g. they are implementing Salesforce.com as we speak. Advice to Management Keep up the positive momentum that we have seen in the last 6 months, it is very exciting and we all see good positive changes happening in the company.", "rating": 5, "pros": "Launched new 8.0 platform, this was the boost that the product needed. Nice new look and feel with with unmatched power to access any data asset inside or outside of the organization. Everything is now responsive design, so build it once and it will automatically adjust to the screen you are using. Customers love the new visualization tool called Business Unser Edition, it's trumping Tableau and Qlick time after time, you must see it!!!", "cons": "Some of the Marketing ways in the past have been either outdated or resulted in little exposure, i think mainly due to the lack of budget the company would give to marketing? However i have heard as of late that the company is putting alot more $$$ into marketing, e.g. they are implementing Salesforce.com as we speak.", "advice": "Keep up the positive momentum that we have seen in the last 6 months, it is very exciting and we all see good positive changes happening in the company."}, {"title": "Senior PC Technician", "text": "Pros Office in Manhattan. Plenty of food options around Cons Pig headed management. Insufficient knowledge base. Insufficient tools/software - homegrown applications are horrible to use/manage. End-users constantly angry and demanding. Office space full of clutter/junk - no straightforward recycling plan. Shady business practices. Attitude of management is \"Just deal with it\" and verbally told dont get on XYZ's bad side, that's XYZ's wife/mistress/son/daughter AKA you will be fired even if its visibly and categorically not your fault, because they dont want to have to deal with it at home/etc ... Day 1 subtext \"this is a private company, we can do whatever we want,\" \"you can figure it out,\" Advice to Management High turnover for the same position shows poor management and leadership.", "rating": 1, "pros": "Office in Manhattan. Plenty of food options around", "cons": "Pig headed management. Insufficient knowledge base. Insufficient tools/software - homegrown applications are horrible to use/manage. End-users constantly angry and demanding. Office space full of clutter/junk - no straightforward recycling plan. Shady business practices. Attitude of management is \"Just deal with it\" and verbally told dont get on XYZ's bad side, that's XYZ's wife/mistress/son/daughter AKA you will be fired even if its visibly and categorically not your fault, because they dont want to have to deal with it at home/etc ...", "advice": "High turnover for the same position shows poor management and leadership."}, {"title": "Great culture, supportive environment.", "text": "Pros Great culture, supportive environment. When projects get hard everyone is helpful and kind. There is a lot of trust in the team and there is nobody I don't like. Cons Can't think of anything bad Advice to Management As the company grows make sure that we keep the culture", "rating": 5, "pros": "Great culture, supportive environment. When projects get hard everyone is helpful and kind. There is a lot of trust in the team and there is nobody I don't like.", "cons": "Can't think of anything bad", "advice": "As the company grows make sure that we keep the culture"}, {"title": "Account Exexcutive", "text": "Pros Excellent software for business analytics Cons Small business mentality for powerful software", "rating": 3, "pros": "Excellent software for business analytics", "cons": "Small business mentality for powerful software", "advice": null}, {"title": "Great place to end your career.", "text": "Pros Work with good people. Located in midtown Manhattan. Office layout is is great. Cons I don' think I have anything new to add here. All you have to do is look through previous reviews for this place and sift out the obvious fake ones generated by hr/account executive types. If you are a software developer, programmer or other technical person , you will do your career a serious disservice by coming here. Management prides itself in keeping your salary and your future career progression at the exact place where it started when you first walked in the door. Unless you are a \"Friend of Gerry\" you will not advance in any way despite your best efforts. Do yourself a favor and look elsewhere unless you want to a job to take you to retirement. Advice to Management Provide a future for your talented people instead suppressing their careers.", "rating": 3, "pros": "Work with good people. Located in midtown Manhattan. Office layout is is great.", "cons": "I don' think I have anything new to add here. All you have to do is look through previous reviews for this place and sift out the obvious fake ones generated by hr/account executive types. If you are a software developer, programmer or other technical person , you will do your career a serious disservice by coming here. Management prides itself in keeping your salary and your future career progression at the exact place where it started when you first walked in the door. Unless you are a \"Friend of Gerry\" you will not advance in any way despite your best efforts. Do yourself a favor and look elsewhere unless you want to a job to take you to retirement.", "advice": "Provide a future for your talented people instead suppressing their careers."}, {"title": "Sales Representative", "text": "Pros Great culture, solid management in NY, great product, family environment Cons Still utilize old methodologies for sales", "rating": 5, "pros": "Great culture, solid management in NY, great product, family environment", "cons": "Still utilize old methodologies for sales", "advice": null}, {"title": "Senior systems engineer", "text": "Pros Flexible with time off People are great Cons Health Insurance Salary is very low Dont value you as an employee Advice to Management Hire younger employees", "rating": 3, "pros": "Flexible with time off", "cons": "Health Insurance", "advice": "Hire younger employees"}, {"title": "Need a time machine to get out", "text": "Pros Privately owned and people who have worked there for years are very proud to still be there Cons Older company process and you feel you are in a time capsule Advice to Management You are a technology company. Use your own technology and value your employees. Bring your process up to date.", "rating": 3, "pros": "Privately owned and people who have worked there for years are very proud to still be there", "cons": "Older company process and you feel you are in a time capsule", "advice": "You are a technology company. Use your own technology and value your employees. Bring your process up to date."}, {"title": "My First Year with Information Builders- All Good!", "text": "Pros Information Builders' for a 40 year old company is both innovative and agile. As a software sales person, Information Builders' product, platform and customer support infrastructure is one that is unique in the BI marketing place and creates a high level of customer satisfaction. Cons Being a private held company, brand recognition is less than our competitors. This also creates added steps of credibility setting, in the selling process. Advice to Management Creative and multi-channel brand recognition approaches should be a focus of executives and marketing management.", "rating": 5, "pros": "Information Builders' for a 40 year old company is both innovative and agile. As a software sales person, Information Builders' product, platform and customer support infrastructure is one that is unique in the BI marketing place and creates a high level of customer satisfaction.", "cons": "Being a private held company, brand recognition is less than our competitors. This also creates added steps of credibility setting, in the selling process.", "advice": "Creative and multi-channel brand recognition approaches should be a focus of executives and marketing management."}, {"title": "Looking for a corporate home? This is the place!!", "text": "Pros Fantastic world-class organization that really invests in their employees. Lots of room for career growth and a very rich compensation package. Superb technology with lots of marketing and executive support. Many tenured employees with lots of experience and willingness to support others. Cons The company is long overdue for an updated CRM, but rumor has it that a change is imminent. Confusing / manual back office business processes. Advice to Management The company should be leveraging their own incredible technology to simplify internal business processes and implement tools that will reduce the amount of administrative work required on a regular basis. The company is in dire need of some automation. Marketing investments should be made for large scale advertising campaigns to improve brand awareness (i.e. Billboards, commercials, sporting events)", "rating": 5, "pros": "Fantastic world-class organization that really invests in their employees. Lots of room for career growth and a very rich compensation package. Superb technology with lots of marketing and executive support. Many tenured employees with lots of experience and willingness to support others.", "cons": "The company is long overdue for an updated CRM, but rumor has it that a change is imminent. Confusing / manual back office business processes.", "advice": "The company should be leveraging their own incredible technology to simplify internal business processes and implement tools that will reduce the amount of administrative work required on a regular basis. The company is in dire need of some automation. Marketing investments should be made for large scale advertising campaigns to improve brand awareness (i.e. Billboards, commercials, sporting events)"}, {"title": "Account Executive", "text": "Pros Information Builders is a stable, well managed company with the very rare ability to put the customer first. Industry surveys prove that out, as the company customarily scores at or near the top in customer satisfaction surveys. Senior Management and corporate resources routinely assist with closing deals and managing customers. As an employee for over a decade, the company is pretty close to being family. Cons Cons are too minor to mention. Advice to Management Keep developing world class technologies, to fight off some of our \"noisy neighbors\" in the visualization and SaaS space.", "rating": 5, "pros": "Information Builders is a stable, well managed company with the very rare ability to put the customer first. Industry surveys prove that out, as the company customarily scores at or near the top in customer satisfaction surveys. Senior Management and corporate resources routinely assist with closing deals and managing customers. As an employee for over a decade, the company is pretty close to being family.", "cons": "Cons are too minor to mention.", "advice": "Keep developing world class technologies, to fight off some of our \"noisy neighbors\" in the visualization and SaaS space."}, {"title": "knowledge complacent", "text": "Pros They pay well and benefits are just OK. If you don't like open workspace, then this is the place for you. 7 foot cubical walls. Cons Still committed to old technology i.e. XML. No rock star developers. Cannot retain good employees. Manhattan office is dark. Window offices take up all the windows so there's no natural light. Advice to Management see cons", "rating": 3, "pros": "They pay well and benefits are just OK. If you don't like open workspace, then this is the place for you. 7 foot cubical walls.", "cons": "Still committed to old technology i.e. XML. No rock star developers. Cannot retain good employees.", "advice": "see cons"}, {"title": "Account Executive", "text": "Pros IBI is a very innovative and loyal company. They treat their employees very well, not like a number as other Tech companies tend to do. Their commitment to Customer success is second to none, which is very important. It's a great company to do business with from a customer perspective. I have seen many people come in the door and rise through the ranks over time. Cons Can't think of many. It would be nice if some of the internal systems were more updated and automated, but that has little effect on employee performance/happiness, or customer success. Advice to Management Keep it up! The Sr. Mgt. team has always done things their own way, which is great. They don't sacrifice the product or Customer Support to please anyone. Being a private company has many benefits. They are not beholden to the Street or outside investors.", "rating": 5, "pros": "IBI is a very innovative and loyal company. They treat their employees very well, not like a number as other Tech companies tend to do. Their commitment to Customer success is second to none, which is very important. It's a great company to do business with from a customer perspective. I have seen many people come in the door and rise through the ranks over time.", "cons": "Can't think of many. It would be nice if some of the internal systems were more updated and automated, but that has little effect on employee performance/happiness, or customer success.", "advice": "Keep it up! The Sr. Mgt. team has always done things their own way, which is great. They don't sacrifice the product or Customer Support to please anyone. Being a private company has many benefits. They are not beholden to the Street or outside investors."}, {"title": "I love Information Builders", "text": "Pros Privately held, customer oriented, long tenured technical staff, keeps up with implementing technology advancements in the product Cons I have worked here 24 years and have been treated with nothing but respect. I have no Cons Advice to Management Keep up being innovative with the technology", "rating": 5, "pros": "Privately held, customer oriented, long tenured technical staff, keeps up with implementing technology advancements in the product", "cons": "I have worked here 24 years and have been treated with nothing but respect. I have no Cons", "advice": "Keep up being innovative with the technology"}, {"title": "Great place to work (twice!)", "text": "Pros I worked at IBI for several years and left to try something new/different/cutting edge. Long story short: there's something to be said for a stable, reputable company with a broad solution portfolio and a large customer base. I'm now back at IBI and am confident I'll be successful here (again). The solutions are solid, well known and have a great reputation in the market.. I've worked for some of the best known software companies on the planet and feel IBI has a mix of solutions/people/culture that allows its employees (I speak for the field sales organization) to make a good living while having a good work/life balance. Information Builders puts their customers first (almost to a fault sometimes!) and has a warm, family-like work environment. Cons Some of their operational systems and processes could use upgrades and IBI would benefit from better name recognition/marketing investments. Advice to Management Invest in getting the word out around our new offerings and capabilities..we're definitely on the right path.", "rating": 5, "pros": "I worked at IBI for several years and left to try something new/different/cutting edge. Long story short: there's something to be said for a stable, reputable company with a broad solution portfolio and a large customer base. I'm now back at IBI and am confident I'll be successful here (again).", "cons": "Some of their operational systems and processes could use upgrades and IBI would benefit from better name recognition/marketing investments.", "advice": "Invest in getting the word out around our new offerings and capabilities..we're definitely on the right path."}, {"title": "Great Place to Work", "text": "Pros Great technology and products - IBI has been able to adapt, evolve and lead the way over time. Also, longevity of the tenure of people. There is a genuine desire to be the best and many former IBI'ers come back to work for IBI. The company private and is driven by customer demand. We make it our business to understand the customer's business problems and work together to provide solutions with products and services. As a former customer, I have always been very impressed by the availability of the staff to listen and provide creative solutions as well as the support provided by the company to be successful. Cons I don't really have any cons to share. I have been employed by IBI for almost 19 years. I believe in the product and was a customer for 10 years prior to that. The company has really good benefits and I have been very fortunate to work there. Advice to Management Stay private - keep the customer first and continue to find opportunity in all the changes in technology and marketplace. That strategy has worked well for over 40 years!", "rating": 5, "pros": "Great technology and products - IBI has been able to adapt, evolve and lead the way over time. Also, longevity of the tenure of people. There is a genuine desire to be the best and many former IBI'ers come back to work for IBI. The company private and is driven by customer demand. We make it our business to understand the customer's business problems and work together to provide solutions with products and services. As a former customer, I have always been very impressed by the availability of the staff to listen and provide creative solutions as well as the support provided by the company to be successful.", "cons": "I don't really have any cons to share. I have been employed by IBI for almost 19 years. I believe in the product and was a customer for 10 years prior to that. The company has really good benefits and I have been very fortunate to work there.", "advice": "Stay private - keep the customer first and continue to find opportunity in all the changes in technology and marketplace. That strategy has worked well for over 40 years!"}, {"title": "Marketing Manager", "text": "Pros Being a company that has sustained many IT industry trends, Information Builders offers the stability and customer service new companies lack. The company offers a family like setting where people have worked together for a very long time and where having a work family balance is truly valued. I have not met anybody at IBI that is not welcoming and willing to stop what they are doing to help others be successful. Cons Some of the internal processes need to be updated. Advice to Management Keep pressing forward you are doing a great job!", "rating": 5, "pros": "Being a company that has sustained many IT industry trends, Information Builders offers the stability and customer service new companies lack. The company offers a family like setting where people have worked together for a very long time and where having a work family balance is truly valued. I have not met anybody at IBI that is not welcoming and willing to stop what they are doing to help others be successful.", "cons": "Some of the internal processes need to be updated.", "advice": "Keep pressing forward you are doing a great job!"}, {"title": "Account Executive", "text": "Pros Enterprise platform to address data governance and BI needs Cons Weak marketing and industry presence. Slow to respond to market demands and changes.", "rating": 3, "pros": "Enterprise platform to address data governance and BI needs", "cons": "Weak marketing and industry presence. Slow to respond to market demands and changes.", "advice": null}, {"title": "Good potential but difficult management style.", "text": "Pros Dedicated people, focused on helping customers succeed. Solid approach to reporting and BI with promising outlook for new release of WebFOCUS. Great teammates. Cons I believe many of the challenges I experienced were specific to my region but were significant enough for me to make a change. The BI/Analytics market is extremely competitive, with many solid vendors and solutions. Marketing at this company was not that effective for generating new account prospects. In addition to this, the process for evaluating the product was not in line with expectations of the market and did not come close to comparing to evaluation offerings of competition. A simple trial was a huge pain, and this created many missed opportunities... Most people hitting their numbers were selling to existing customers. Selling to new accounts is always difficult in IT but my management's expectations was not consistent with the realities of rebuilding a territory. Reps who needed to generate new accounts to achieve quota were held to the same pipeline building metrics as reps with existing accounts (number of new opps/week, meetings/week, etc.). A steady flow of critical emails and messaging emphasizing our failures in hitting activity metrics, lecturing on \"accountability,\" subtle threats, and a heavy dose of micromanagement was one of management's answers to the region's challenges. Constant inspection and reviews was the norm. Building a territory is very taxing and realistically takes 18-24 months in this business. The journey along the way can, and should be fun and fulfilling. For me, the micromanagement and constant criticism was not in the least helpful and by no means enriching the experience. Advice to Management Take a more realistic, productive approach with new account reps, invest in a productive SEO strategy, and evaluate the effect of micromanagement.", "rating": 3, "pros": "Dedicated people, focused on helping customers succeed. Solid approach to reporting and BI with promising outlook for new release of WebFOCUS. Great teammates.", "cons": "I believe many of the challenges I experienced were specific to my region but were significant enough for me to make a change. The BI/Analytics market is extremely competitive, with many solid vendors and solutions. Marketing at this company was not that effective for generating new account prospects. In addition to this, the process for evaluating the product was not in line with expectations of the market and did not come close to comparing to evaluation offerings of competition. A simple trial was a huge pain, and this created many missed opportunities...", "advice": "Take a more realistic, productive approach with new account reps, invest in a productive SEO strategy, and evaluate the effect of micromanagement."}, {"title": "Senior Account Exectuvie", "text": "Pros Everyone truly works together like one big family. Cons Company brand recognition is an area of concern for how long they have been in existence.", "rating": 5, "pros": "Everyone truly works together like one big family.", "cons": "Company brand recognition is an area of concern for how long they have been in existence.", "advice": null}, {"title": "Excessive micromanagement, 80's demand gen tactics", "text": "Pros Some very dedicated and great people at IBI. Company is focused on customer success. For reps with legacy accounts who don't rely on new business to achieve quota, it's a good gig - they pay well for closed deals. Cons This company is not aligned with current market demands, and is badly positioned to generate business from new customers. Some of the capabilities that newer BI/Analytics buyers are seeking are sub-par compared to the competition. The evaluation process, compared to competition, is clunky, cumbersome, and prevents WebFOCUS from even \"going to bat.\" There is no effective in-bound marketing in place. Despite 41 years of existence IBI is still largely unknown by most prospects. Sales Management's answer to the challenges related to all of this is excessive micromanagement (at least this is the case in my region); constant reviews and inspection, steady flow of critical emails and scrutiny, continuous shallow advice and pounding the drum of \"make more calls, get more meetings, etc.\" Focus is to manage the symptoms instead of fixing the problems. In my lengthy career in sales, I have never been micromanaged like this. The moral of my team is very low. If you are considering a sales career here, do your homework! If you are managing an existing customer base consisting of large customers, talk to reps who have similar accounts. If hitting quota in your territory is largely dependent on generating new accounts, be sure to call reps with at least 1 year in the field who have a similar territory. And, understand the management style of the manager in your region. Advice to Management Address the challenges stated above, terminate the micromanagement approach (it doesn't work), and consider a CRM system that integrates with external, modern approaches to demand generation. The reason sales organizations use tools like this is that they actually work.", "rating": 3, "pros": "Some very dedicated and great people at IBI. Company is focused on customer success. For reps with legacy accounts who don't rely on new business to achieve quota, it's a good gig - they pay well for closed deals.", "cons": "This company is not aligned with current market demands, and is badly positioned to generate business from new customers. Some of the capabilities that newer BI/Analytics buyers are seeking are sub-par compared to the competition. The evaluation process, compared to competition, is clunky, cumbersome, and prevents WebFOCUS from even \"going to bat.\" There is no effective in-bound marketing in place. Despite 41 years of existence IBI is still largely unknown by most prospects. Sales Management's answer to the challenges related to all of this is excessive micromanagement (at least this is the case in my region); constant reviews and inspection, steady flow of critical emails and scrutiny, continuous shallow advice and pounding the drum of \"make more calls, get more meetings, etc.\" Focus is to manage the symptoms instead of fixing the problems. In my lengthy career in sales, I have never been micromanaged like this. The moral of my team is very low.", "advice": "Address the challenges stated above, terminate the micromanagement approach (it doesn't work), and consider a CRM system that integrates with external, modern approaches to demand generation. The reason sales organizations use tools like this is that they actually work."}, {"title": "Where good careers go to die", "text": "Pros Credible work experience with an analyst ranked Enterprise Software company Cons This is a place where good careers go to die. Managers are absolutely terrible. The management philosophy is extremely arcane and reminiscent of the glory days of siebel systems or CA. Nano management, heavy handed tactics, constant threats of firing and justification of your employment. Sales tactics are also extremely outdated and ineffective. Some decent folks in the rank in file but overall just a miserable place to work. And as a policy there are no raises and promotions are extremely hard to come by as the company is usually downsizing every 2 - 3 years and the typical promotion cycle is about 4-5 years. Thus, unless you plan on being a lifer whatever you get on the way in is all you're ever going to get. Get your resume cred and get out because you will hate everyday you work here. Advice to Management Sell out and leave whats left of the company to a company like ibm or salesforce where a competant mid level vp will turn it into a darling division, because the product is good, the management from the first line up to the ceo are just not capable of running a modern day software corporation.", "rating": 3, "pros": "Credible work experience with an analyst ranked Enterprise Software company", "cons": "This is a place where good careers go to die. Managers are absolutely terrible. The management philosophy is extremely arcane and reminiscent of the glory days of siebel systems or CA. Nano management, heavy handed tactics, constant threats of firing and justification of your employment. Sales tactics are also extremely outdated and ineffective. Some decent folks in the rank in file but overall just a miserable place to work. And as a policy there are no raises and promotions are extremely hard to come by as the company is usually downsizing every 2 - 3 years and the typical promotion cycle is about 4-5 years. Thus, unless you plan on being a lifer whatever you get on the way in is all you're ever going to get. Get your resume cred and get out because you will hate everyday you work here.", "advice": "Sell out and leave whats left of the company to a company like ibm or salesforce where a competant mid level vp will turn it into a darling division, because the product is good, the management from the first line up to the ceo are just not capable of running a modern day software corporation."}, {"title": "Nobody", "text": "Pros Laid back. Great NJ commute. Fantastic work/life balance. Friendly chit-chats everywhere. Cons Cheap. Very cheap! 20 years behind in everything: management, product, technology. Advice to Management Just make him retire already. And chop some heads in the inner circle. The industry has changed. You are going down the drains fast!", "rating": 3, "pros": "Laid back. Great NJ commute. Fantastic work/life balance. Friendly chit-chats everywhere.", "cons": "Cheap. Very cheap! 20 years behind in everything: management, product, technology.", "advice": "Just make him retire already. And chop some heads in the inner circle. The industry has changed. You are going down the drains fast!"}, {"title": "Good experience; love the staff", "text": "Pros Good office atmosphere with fantastic people. The employees on every level are an enormous asset. It's certainly a family company; people come here and they stay - 10, 20, 30 years - mostly for the stability, friendly office, and decent work. Cons An office above Penn Station is great for commuting but less so for culture. It's an environment for an older crowd, which has it's pluses and minuses.", "rating": 5, "pros": "Good office atmosphere with fantastic people. The employees on every level are an enormous asset. It's certainly a family company; people come here and they stay - 10, 20, 30 years - mostly for the stability, friendly office, and decent work.", "cons": "An office above Penn Station is great for commuting but less so for culture. It's an environment for an older crowd, which has it's pluses and minuses.", "advice": null}, {"title": "QA Analyst", "text": "Pros Laid back atmosphere. Company management philosophy. Great work/life balance. Cons Difficulty moving up ladder. Inadequate compensation.", "rating": 3, "pros": "Laid back atmosphere. Company management philosophy. Great work/life balance.", "cons": "Difficulty moving up ladder. Inadequate compensation.", "advice": null}, {"title": "Good people, old school style of management", "text": "Pros Amazing location in NYC, people are great and they give a fair amount of time to prove your worth Cons Old school style of management, no marketing of their products, good product but highly competitive market so with no marketing it makes selling hard Advice to Management Throw out the old school 1980s management style. Loosen up about the things that don't matter and invest in marketing.", "rating": 3, "pros": "Amazing location in NYC, people are great and they give a fair amount of time to prove your worth", "cons": "Old school style of management, no marketing of their products, good product but highly competitive market so with no marketing it makes selling hard", "advice": "Throw out the old school 1980s management style. Loosen up about the things that don't matter and invest in marketing."}, {"title": "Good people to work with", "text": "Pros On boarding gets you up to speed quickly. Good product set. Healthy environment. Cons Must be at the office no remote offices", "rating": 5, "pros": "On boarding gets you up to speed quickly. Good product set. Healthy environment.", "cons": "Must be at the office no remote offices", "advice": null}, {"title": "Information Builders is a very good place to work.", "text": "Pros Good office atmosphere, great management, professional environment, good structure in New York, decent deadlines. The company treats their employees in a very respectful, humane way. Some departments will allow you to work remotely. Cons There are very few cons that are worth mentioning at the company. The only one that comes to my mind at the moment is the low pay. Living in New York City with an income lower than 60,000 is very hard. Advice to Management The translation team is very well managed. The director does a great job.", "rating": 5, "pros": "Good office atmosphere, great management, professional environment, good structure in New York, decent deadlines. The company treats their employees in a very respectful, humane way. Some departments will allow you to work remotely.", "cons": "There are very few cons that are worth mentioning at the company. The only one that comes to my mind at the moment is the low pay. Living in New York City with an income lower than 60,000 is very hard.", "advice": "The translation team is very well managed. The director does a great job."}, {"title": "Waste of time", "text": "Pros Not many reasons to work there. The training was pretty good. The people in the front lines are dedicated. They're most comfortable in a mainframe environment. Cons Very old school. I'd like jumping in a time capsule and going back to the seventies. Very little creativity. Like being stuck in a time warp Advice to Management Move aside and get some creative thinking in there", "rating": 1, "pros": "Not many reasons to work there. The training was pretty good. The people in the front lines are dedicated. They're most comfortable in a mainframe environment.", "cons": "Very old school. I'd like jumping in a time capsule and going back to the seventies. Very little creativity. Like being stuck in a time warp", "advice": "Move aside and get some creative thinking in there"}, {"title": "Long term employee", "text": "Pros Good people, good technology. Ability to adjust and change some things that affect you/your team. Not a lot of bureaucracy to work around. Cons A few folks do need to retire. Company is a bit too tolerant of some long term employees that should move on. Advice to Management see above.", "rating": 5, "pros": "Good people, good technology. Ability to adjust and change some things that affect you/your team. Not a lot of bureaucracy to work around.", "cons": "A few folks do need to retire. Company is a bit too tolerant of some long term employees that should move on.", "advice": "see above."}, {"title": "Expect the unexpected", "text": "Pros Easy going . Good company. No rules except get the job done.Ability to adjust and change some things that affect you/your team. Cons Lots of bureaucracy to work around.Some people need to retire . Advice to Management See above", "rating": 3, "pros": "Easy going . Good company. No rules except get the job done.Ability to adjust and change some things that affect you/your team.", "cons": "Lots of bureaucracy to work around.Some people need to retire .", "advice": "See above"}, {"title": "Decent Enough", "text": "Pros Good benefits, pleasant work environment, convenient location in NYC Cons At last count, the Customer Support division was supporting 16 releases of the WebFOCUS product. The product was never fully QA'ed, hence a flood of calls whenever a new release was sent out. Advice to Management 1. A total revamp of QA practices is needed. 2. No more than 4 releases should be supported 3. Paid migration services should be provided for customers 4. A more granular documentation of \"how to\" install, upgrade, etc. provided to customer.", "rating": 3, "pros": "Good benefits, pleasant work environment, convenient location in NYC", "cons": "At last count, the Customer Support division was supporting 16 releases of the WebFOCUS product. The product was never fully QA'ed, hence a flood of calls whenever a new release was sent out.", "advice": "1. A total revamp of QA practices is needed."}, {"title": "Sr. Account Executive", "text": "Pros -Excellent, professional environment to work in. Truly a team selling culture from the top of the organization to the front lines. A wealth of knowledge throughout the company due to long tenured personnel in support roles of the sales teams. Cons Unfortunately, the company does not do a good job of self promotion (advertising, etc...), therefore there is no name recognition. As a result, the company doesn't get invited to most competitive solicitations, because they are not on anyone's radar. Advice to Management Make a concerted effort to build brand recognition outside of the analyst reports.", "rating": 5, "pros": "-Excellent, professional environment to work in. Truly a team selling culture from the top of the organization to the front lines. A wealth of knowledge throughout the company due to long tenured personnel in support roles of the sales teams.", "cons": "Unfortunately, the company does not do a good job of self promotion (advertising, etc...), therefore there is no name recognition. As a result, the company doesn't get invited to most competitive solicitations, because they are not on anyone's radar.", "advice": "Make a concerted effort to build brand recognition outside of the analyst reports."}, {"title": "BI Developer", "text": "Pros Very good product Capability to become market leader in BI space Cons Old school mentality No integration between product development and sales team", "rating": 3, "pros": "Very good product", "cons": "Old school mentality", "advice": null}, {"title": "Software Developer", "text": "Pros work and family balance is good. Cons compensation and no pay raises.", "rating": 3, "pros": "work and family balance is good.", "cons": "compensation and no pay raises.", "advice": null}, {"title": "Good place to work", "text": "Pros solid product, great people, dedication to technology and Cons slow to innovate, large enterprise focus not for smaller companies.", "rating": 5, "pros": "solid product, great people, dedication to technology and", "cons": "slow to innovate, large enterprise focus not for smaller companies.", "advice": null}, {"title": "Sales Exec", "text": "Pros Privately held company that maintains good client relationships. Founder/owner is still an active participant in business. Cons Great BI tools but they could be more intuitive. There are other solutions available that are easier to deploy. However, they may not offer the depth of IBs tools Advice to Management Develop an \"entry-level\" analytics tool for the lower end of the market", "rating": 5, "pros": "Privately held company that maintains good client relationships. Founder/owner is still an", "cons": "Great BI tools but they could be more intuitive.", "advice": "Develop an \"entry-level\" analytics tool for the lower end of the market"}, {"title": "Too many Chiefs NOT enough Indians!!!", "text": "Pros You will have a low paying job with medical coverage. Cons Constantly being watched and Analyzed. Employees are basically ballast off a sinking ship. No raises and no advancement in the company unless you know someone or you are a relative. If you do move to another department it will be a lateral move, no increase in salary. Dead end Job. Advice to Management No advice to give, don't want to waste my breath since they will not change, stuck in their ways.", "rating": 1, "pros": "You will have a low paying job with medical coverage.", "cons": "Constantly being watched and Analyzed. Employees are basically ballast off a sinking ship.", "advice": "No advice to give, don't want to waste my breath since they will not change, stuck in their ways."}, {"title": "good company with great product", "text": "Pros good company.nice people to work with Cons Lacks innovation for todays time Advice to Management Get more Enthusiastic teams for product", "rating": 5, "pros": "good company.nice people to work with", "cons": "Lacks innovation for todays time", "advice": "Get more Enthusiastic teams for product"}, {"title": "Information Builders", "text": "Pros Long term company where people join for life Cons Outdated technology, although they are putting in a valiant effort to try and tune up their ford festiva platform to stay in step with competitors. One of biggest problems is that its a long term company where people join for life and have become very complacent Advice to Management Hire talent, be willing to pay market value for it and invest money in marketing and advertising that really works", "rating": 3, "pros": "Long term company where people join for life", "cons": "Outdated technology, although they are putting in a valiant effort to try and tune up their ford festiva platform to stay in step with competitors. One of biggest problems is that its a long term company where people join for life and have become very complacent", "advice": "Hire talent, be willing to pay market value for it and invest money in marketing and advertising that really works"}, {"title": "IBI Work Atmosphere", "text": "Pros Convenient to Penn Station for LIRR and New Jersey Transit commuters, friendly atmosphere. Cons Company does not value its most prized assets, its employees. Random layoffs just to save money! No consideration of employees that have been loyal to the company even though there have been no raises for approximately 10 years. Some upper management personnel are allowed to demean and berate employees via email and verbally with the knowledge of HR and the President of the company. Advice to Management Value your productive and loyal employees. Unless a different approach and new leadership with a younger mindset is in place, the company will continue to lose money and will not be relevant in 10 years or less.", "rating": 3, "pros": "Convenient to Penn Station for LIRR and New Jersey Transit commuters, friendly atmosphere.", "cons": "Company does not value its most prized assets, its employees. Random layoffs just to save money! No consideration of employees that have been loyal to the company even though there have been no raises for approximately 10 years. Some upper management personnel are allowed to demean and berate employees via email and verbally with the knowledge of HR and the President of the company.", "advice": "Value your productive and loyal employees. Unless a different approach and new leadership with a younger mindset is in place, the company will continue to lose money and will not be relevant in 10 years or less."}, {"title": "Great place to work", "text": "Pros Great culture, Innovative, smart people willing to always help you succeed Cons Their marketing awareness could be better and more effective", "rating": 5, "pros": "Great culture, Innovative, smart people willing to always help you succeed", "cons": "Their marketing awareness could be better and more effective", "advice": null}, {"title": "Sr Account Executive", "text": "Pros Established, quality of life culture Cons Lacks sales automation tools, no field support and limited marketing", "rating": 3, "pros": "Established, quality of life culture", "cons": "Lacks sales automation tools, no field support and limited marketing", "advice": null}, {"title": "Good Team, but a sinking ship due to lack of vision.", "text": "Pros A lot of institutional knowledge of their products and a great learning experience because of that. Great people that pull together as a team. Cons Lack of true vision based on industry drivers. Very reactionary. Internal technologies and processes (lack of) make it almost impossible to compete against more nimble organizations. Advice to Management Ego and pride need to be swallowed in order to truly compete in the current BI market. While you have a great product that can't win you deals. Burning every bridge with partners, customers, and former employees is starting to catch up to you.", "rating": 3, "pros": "A lot of institutional knowledge of their products and a great learning experience because of that. Great people that pull together as a team.", "cons": "Lack of true vision based on industry drivers. Very reactionary. Internal technologies and processes (lack of) make it almost impossible to compete against more nimble organizations.", "advice": "Ego and pride need to be swallowed in order to truly compete in the current BI market. While you have a great product that can't win you deals. Burning every bridge with partners, customers, and former employees is starting to catch up to you."}, {"title": "Sales", "text": "Pros Employees were wonderful to work with Cons Management turned over frequently and was forgettable", "rating": 3, "pros": "Employees were wonderful to work with", "cons": "Management turned over frequently and was forgettable", "advice": null}, {"title": "manager", "text": "Pros great corporate culture with friendly atmosphere Cons could have more of a defined career path.", "rating": 5, "pros": "great corporate culture with friendly atmosphere", "cons": "could have more of a defined career path.", "advice": null}, {"title": "A slow sinking ship with a captain that is willing to die at the helm", "text": "Pros Easy commute in nyc if you pass thru Penn Station. Cons A company full of deluded individuals who pretend to work for a large growing concern. No advancement. A horrible name in the software industry that will hurt your resume if you stay more then a year or two. Advice to Management Retire along with all the other old men. Or simply throw in the towel.", "rating": 1, "pros": "Easy commute in nyc if you pass thru Penn Station.", "cons": "A company full of deluded individuals who pretend to work for a large growing concern. No advancement. A horrible name in the software industry that will hurt your resume if you stay more then a year or two.", "advice": "Retire along with all the other old men. Or simply throw in the towel."}, {"title": "Account Executive", "text": "Pros Flexibility. Compensation is higher than most other software solution vendors. Cons Zero advertising. Upper management is very old school. Most have been with company for 10+ years. High turnover. Advice to Management Adapt to change. Respond to the new trends in the industry.", "rating": 3, "pros": "Flexibility. Compensation is higher than most other software solution vendors.", "cons": "Zero advertising. Upper management is very old school. Most have been with company for 10+ years. High turnover.", "advice": "Adapt to change. Respond to the new trends in the industry."}, {"title": "Falling", "text": "Pros Good company to start your career. Cons No collaboration between or within departments. Management and software require updates. Advice to Management Freshen up your employer base and enforce ethical behavior.", "rating": 1, "pros": "Good company to start your career.", "cons": "No collaboration between or within departments.", "advice": "Freshen up your employer base and enforce ethical behavior."}, {"title": "SE", "text": "Pros Good Culture and support staff that know what they are doing. Great people to work with Cons Need to market product much better. Hate going into deals when the client has never heard of us Advice to Management Be more transparent and conduct better processes on post mortem sales opps", "rating": 5, "pros": "Good Culture and support staff that know what they are doing. Great people to work with", "cons": "Need to market product much better. Hate going into deals when the client has never heard of us", "advice": "Be more transparent and conduct better processes on post mortem sales opps"}, {"title": "A Good Company On The Decline", "text": "Pros Very flexible work schedule. Friendly coworkers. Cons Almost no salary increase for more than a decade. Randomly picked layoff -- even some top performers were let go. Business is going down fast. Advice to Management You have a great software in hand but couldn't sell. The problem is obvious -- you need to increase brand awareness. The most important asset of a company is its people -- if you keep letting your best people go just to save some money, the end of the company won't be far. Before each layoff, do some research to find out who is productive and who is not.", "rating": 3, "pros": "Very flexible work schedule.", "cons": "Almost no salary increase for more than a decade.", "advice": "You have a great software in hand but couldn't sell. The problem is obvious -- you need to increase brand awareness. The most important asset of a company is its people -- if you keep letting your best people go just to save some money, the end of the company won't be far. Before each layoff, do some research to find out who is productive and who is not."}, {"title": "Succession plan & a real CRM", "text": "Pros Great work/life balance Nothing else I can think of Cons Needs vision and a clear path to developing a strategy to keep up with today's technology.Please use a real CRM not a home grown application. Advice to Management Communicate to the employees about a succession plan. What will happen to this company in the next 2 - 5 years ? Analytics is a crowded space. How are you standing out from the crowd ?", "rating": 1, "pros": "Great work/life balance", "cons": "Needs vision and a clear path to developing a strategy to keep up with today's technology.Please use a real CRM not a home grown application.", "advice": "Communicate to the employees about a succession plan. What will happen to this company in the next 2 - 5 years ? Analytics is a crowded space. How are you standing out from the crowd ?"}, {"title": "Views on the company", "text": "Pros Great people and great flexibility to work from home and leave early if need be Cons Less pay and movement for way more work. You will do the job of 3+ people. people dont like to share their knowledge. Advice to Management Pay people while they are there and not when they are leaving. as soon as you mention that you are leaving, they will try and match your offer.", "rating": 3, "pros": "Great people and great flexibility to work from home and leave early if need be", "cons": "Less pay and movement for way more work. You will do the job of 3+ people. people dont like to share their knowledge.", "advice": "Pay people while they are there and not when they are leaving. as soon as you mention that you are leaving, they will try and match your offer."}, {"title": "Account Support Manager", "text": "Pros Fast paced and challenging work environment with a lot of opportunity to grow and showcase your technical skills while also using your soft skills. The team works well together to help each other discover new solutions to customer issues Cons One of the mistakes a lot of organizations make is to promote their strongest technical performers into Supervisors and Managers instead of promoting them into Technical Lead roles. By not having a strong leader in place the work, rs have to be strong enough to manage themselves so the environment is not as cohesive and driven as it could be.", "rating": 3, "pros": "Fast paced and challenging work environment with a lot of opportunity to grow and showcase your technical skills while also using your soft skills. The team works well together to help each other discover new solutions to customer issues", "cons": "One of the mistakes a lot of organizations make is to promote their strongest technical performers into Supervisors and Managers instead of promoting them into Technical Lead roles. By not having a strong leader in place the work, rs have to be strong enough to manage themselves so the environment is not as cohesive and driven as it could be.", "advice": null}, {"title": "Technical", "text": "Pros The people are nice. The office is quiet and good for getting lots of work done. Nice atmosphere. Close to transportation. Not too strict as to what technology you can use. Cons No career path. No opportunities for advancement. Senior management take great pride in making sure you do not advance or get any performance related pay increase. The motto seems to be get as much work done for as little pay as possible. Advice to Management Pay your employees who work hard and get things done. There is no need for penny pinching when people strive to make a difference.", "rating": 3, "pros": "The people are nice. The office is quiet and good for getting lots of work done. Nice atmosphere. Close to transportation. Not too strict as to what technology you can use.", "cons": "No career path. No opportunities for advancement. Senior management take great pride in making sure you do not advance or get any performance related pay increase.", "advice": "Pay your employees who work hard and get things done. There is no need for penny pinching when people strive to make a difference."}, {"title": "Regional Sales Manager", "text": "Pros Really good company. Good people, great products and a very autonomous culture. Very focused on customer success. Company is supportive, and has many long tenured employees that support customers and sales engagements. I very much enjoyed my time and successes there. Cons Low overall brand awareness therefore it is difficult to get into deals. Lack of modern CRM and other sales tools. Advice to Management Company should invest in modern CRM technology to enable greater sales efficiency and effectiveness and work to build greater awareness of the amazing products and customer experience.", "rating": 5, "pros": "Really good company. Good people, great products and a very autonomous culture. Very focused on customer success. Company is supportive, and has many long tenured employees that support customers and sales engagements. I very much enjoyed my time and successes there.", "cons": "Low overall brand awareness therefore it is difficult to get into deals.", "advice": "Company should invest in modern CRM technology to enable greater sales efficiency and effectiveness and work to build greater awareness of the amazing products and customer experience."}, {"title": "Great environment, no opportunity for advancement", "text": "Pros Great staff, friendly environment, team-focused, solid products Cons Home-grown, internal systems and manual processes are awful. No clear career path in my department. No raises if you're not in sales. Strategy is very reactive. Advice to Management Pull the company into this century.", "rating": 3, "pros": "Great staff, friendly environment, team-focused, solid products", "cons": "Home-grown, internal systems and manual processes are awful. No clear career path in my department. No raises if you're not in sales. Strategy is very reactive.", "advice": "Pull the company into this century."}, {"title": "Sr. Account Executive", "text": "Pros Great company culture. Great products. Best in customer support. I love the fact that our technical guys have a long tenure with the company. That speaks highly of the quality of the products too. As an AE I like the fact that I can solve practically any problem with the products available in my bag. I can also shepherd resources from corporate as needed. I spent some time at one of our big competitors and delivering that level of customer service simply didn't happen. Great work life balance too. Cons Salaries could be higher. Market awareness could be better. They have great products but not the name recognition of that some of the other players command. That is changing and the continued great ratings by the Analysts is helping to get our name out. Advice to Management Increase salaries. Offer the means to do so on a periodic basis. Increase marketing budgets. Get a modern CRM system.", "rating": 5, "pros": "Great company culture. Great products. Best in customer support. I love the fact that our technical guys have a long tenure with the company. That speaks highly of the quality of the products too. As an AE I like the fact that I can solve practically any problem with the products available in my bag. I can also shepherd resources from corporate as needed. I spent some time at one of our big competitors and delivering that level of customer service simply didn't happen. Great work life balance too.", "cons": "Salaries could be higher. Market awareness could be better. They have great products but not the name recognition of that some of the other players command. That is changing and the continued great ratings by the Analysts is helping to get our name out.", "advice": "Increase salaries. Offer the means to do so on a periodic basis. Increase marketing budgets. Get a modern CRM system."}, {"title": "Sales", "text": "Pros Interesting technology with a wide breadth of solutions that can be offered. Great customer service and support. In Sales there is a lot of support but you need to ask for it. Cons CRM system could be easier to use. Highly competitive market.", "rating": 5, "pros": "Interesting technology with a wide breadth of solutions that can be offered. Great customer service and support. In Sales there is a lot of support but you need to ask for it.", "cons": "CRM system could be easier to use. Highly competitive market.", "advice": null}, {"title": "Review from a Supervisor", "text": "Pros Interesting software that is capable of doing powerful things in the right hands, up to date with data security, flexible scheduling (within reason) Cons Old-fashioned, little to no opportunities for advancement unless someone retires, various departments play the blame game with each other Advice to Management Focus on finding resolutions and the positives of what people do instead of focusing on who is to blame for a situation", "rating": 3, "pros": "Interesting software that is capable of doing powerful things in the right hands, up to date with data security, flexible scheduling (within reason)", "cons": "Old-fashioned, little to no opportunities for advancement unless someone retires, various departments play the blame game with each other", "advice": "Focus on finding resolutions and the positives of what people do instead of focusing on who is to blame for a situation"}, {"title": "ps", "text": "Pros Good projects if only you get to work on them Cons long bench period.Training on the product outdated", "rating": 1, "pros": "Good projects if only you get to work on them", "cons": "long bench period.Training on the product outdated", "advice": null}, {"title": "Disorganization station", "text": "Pros great benefits. People have been there for 25 years. Holiday schedule is robust. Salary is mid level. Customers are interesting Cons People have been there for 25 years. No one is willing to do anything in a different way than the way they've been doing it for 25 years. Very clicky - if you haven't been there for 25 years, you will be fired within 2 years or less. Very old fashioned way of selling and implementation. Plays the 'blame game'. Hyper focused on the small picture instead of the big picture. No raises, ever. No opportunity for upward mobility. Wasted resources. Treat the employees disrespectfully. Best advice: don't take a job here unless you are just looking for a fairly short term paycheck. Advice to Management There isn't really anything to be said here. They wouldn't take anyone's advice, no matter who would give it, or in what capacity.", "rating": 3, "pros": "great benefits. People have been there for 25 years. Holiday schedule is robust. Salary is mid level. Customers are interesting", "cons": "People have been there for 25 years. No one is willing to do anything in a different way than the way they've been doing it for 25 years. Very clicky - if you haven't been there for 25 years, you will be fired within 2 years or less. Very old fashioned way of selling and implementation. Plays the 'blame game'. Hyper focused on the small picture instead of the big picture. No raises, ever. No opportunity for upward mobility. Wasted resources. Treat the employees disrespectfully. Best advice: don't take a job here unless you are just looking for a fairly short term paycheck.", "advice": "There isn't really anything to be said here. They wouldn't take anyone's advice, no matter who would give it, or in what capacity."}, {"title": "ya or na", "text": "Pros great relax environment, great people Cons very low salary for the work but the easy work environment makes up for it. people have their own agendas and dont follow protoccols Upper management are not realistic with their demands on deliverables and the product suffers.", "rating": 3, "pros": "great relax environment, great people", "cons": "very low salary for the work but the easy work environment makes up for it.", "advice": null}, {"title": "Director of Development", "text": "Pros Ability to work with newer tools and technologies (if you have some grit) Good benefits. A good degree of autonomy for progressive managers to do new things Fairly good work/life balance. Some growing enlightenment regarding remote work. Cons Senior management *very* senior, mostly looking to retire soon Team managers have no hiring/firing autonomy - CEO insists on personally approving all HR decisions. Strong culture division between older more 20th century style managers and newer more agile and humanistic managers. Fewer people every year due to frequent reductions in workforce. Despite the above, company constantly takes on new projects, resulting in burnout No room in top tiers of management. Apathy growing among the ranks due to apathetic management Frequent reorgs reshuffle the same people. Expect you'll be paid your initial salary forever - no increases in comp for many years, regardless of your contribution. Intimidation is a constant factor to drive performance. Advice to Management Get out of the way; step aside, retire! Don't worry, there are good people just beneath you ready to take the company someplace great. Pay raises annually for any performers above the average, please. You're losing your most talented people to the market.", "rating": 3, "pros": "Ability to work with newer tools and technologies (if you have some grit)", "cons": "Senior management *very* senior, mostly looking to retire soon", "advice": "Get out of the way; step aside, retire! Don't worry, there are good people just beneath you ready to take the company someplace great."}, {"title": "Product Manager", "text": "Pros Job Stability, Good Sales Teams Bringing Revenue, Good Products, Laid Back Culture Cons Not a growing company, Below Market Salary,", "rating": 5, "pros": "Job Stability, Good Sales Teams Bringing Revenue, Good Products, Laid Back Culture", "cons": "Not a growing company, Below Market Salary,", "advice": null}, {"title": "QA", "text": "Pros The office envrioment is not open which is a rare thing these days Cons Depending on the job, you could be stuck learning something that is not useful outside the industry Advice to Management Get better machines for developers and QA personnel", "rating": 3, "pros": "The office envrioment is not open which is a rare thing these days", "cons": "Depending on the job, you could be stuck learning something that is not useful outside the industry", "advice": "Get better machines for developers and QA personnel"}, {"title": "Great Private Company", "text": "Pros I found over the years always a great team spirit within the company. It's open door policy makes even the CEO someone you can reach to present ideas at almost anytime. Cons It might not be the highest pay in this industry, but on the other hand it is a company that treats you as a person, not just a number.", "rating": 5, "pros": "I found over the years always a great team spirit within the company. It's open door policy makes even the CEO someone you can reach to present ideas at almost anytime.", "cons": "It might not be the highest pay in this industry, but on the other hand it is a company that treats you as a person, not just a number.", "advice": null}, {"title": "if you are not family or a \"lifetimer\", you will not last.", "text": "Pros Pay is reasonable. If you perform well in sales, you do well. Partners and other lines of business profit from Sales hard work. Marketing events build around your needs. Cons Sales CRM is in house grown and horrible to update, does not offer activity history tracking and cumbersome for sales staff to keep up with. Expenses are all done manually and take time along with dealing with difficult Accounting Staff. Nepotism and legacy employers who have been at Information Builders for more than a decade or two decades, do not keep up with the latest technologies, a lot of politics and if you are not part of the \"legacy\" or \"lifetimers\" your voice is not heard. Sales Staff are not valued nor appreciated for the work they do and are only looked at as a means to an end. Advice to Management Allow field and support sales staff to have a say in the corporate culture. Value and appreciate your field employees more. Do not put boundaries on hierarchy to the point where you do not have access to the executive team to have open dialogue and give feedback on both ends.", "rating": 3, "pros": "Pay is reasonable.", "cons": "Sales CRM is in house grown and horrible to update, does not offer activity history tracking and cumbersome for sales staff to keep up with.", "advice": "Allow field and support sales staff to have a say in the corporate culture. Value and appreciate your field employees more. Do not put boundaries on hierarchy to the point where you do not have access to the executive team to have open dialogue and give feedback on both ends."}, {"title": "Analyst", "text": "Pros Information Builders has a very diversified, friendly work space. People are smart and productive. Company culture is good. Cons Information Builders is tool stable, people normally do not leave, does not provide much space for growth. Advice to Management Please provide more growth space for employees, especially for junior person in development group.", "rating": 3, "pros": "Information Builders has a very diversified, friendly work space. People are smart and productive. Company culture is good.", "cons": "Information Builders is tool stable, people normally do not leave, does not provide much space for growth.", "advice": "Please provide more growth space for employees, especially for junior person in development group."}, {"title": "Nice Environment But Slowly Fading", "text": "Pros Nice people. Good work/life balance. Cons The company hasn't grown since the 80's. Advice to Management Need to innovate", "rating": 3, "pros": "Nice people. Good work/life balance.", "cons": "The company hasn't grown since the 80's.", "advice": "Need to innovate"}, {"title": "Technical Account Manager at Information Builders", "text": "Pros Excellent support staff. Very knowledgeable and committed technical teams. Great products Cons Very hard to get a raise, movement upward is tuff as a lot of employees have been around for >20 years", "rating": 5, "pros": "Excellent support staff. Very knowledgeable and committed technical teams. Great products", "cons": "Very hard to get a raise, movement upward is tuff as a lot of employees have been around for >20 years", "advice": null}, {"title": "Company is still in search of its soul and limited by senior management to its current size due to management capability", "text": "Pros Well defined product suite Good marketing and sales model Cons Behaves strictly like a software company versus the solutions company that they are Need better alignment between software sales and services sales Advice to Management Stop the fighting between services and sales Know your mission and seek to serve the customer, not yourselves with higher bonuses Pay your people what they earned", "rating": 3, "pros": "Well defined product suite", "cons": "Behaves strictly like a software company versus the solutions company that they are", "advice": "Stop the fighting between services and sales"}, {"title": "Techie's are door stops.", "text": "Pros It's a job and it did have a decent base pay. Technology is not bleeding edge but will support the skills needed for the industry. Health benefits are not bad. Cons Bonuses are FAR from what they will claim. Many quarters with zero bonuses or even a draw back if a deal changes after a sale and payout. Techie's ( SE's ) are routinely blamed for deals gone wrong. Sales staff is routinely turned over some go as long as 2 years of no sales. Management rules by intimidation and back stabbing so it's very hard to tell who and how to work with others. The SKO is roommates and the most UN-inspiring event on the planet. This is an individual contributor role as needed and the idea of working together is nothing more than words. If you stay long enough you will be numb. Advice to Management Retire the executive level and remove the middle layer. There are no valid, trained or worldly managers here. CEO/Owner is a nice guy and sharp but should not be running the company it is not his strong spot. The products have much more potential but the go-to market plan is stale and the bonuses reflect that.", "rating": 3, "pros": "It's a job and it did have a decent base pay. Technology is not bleeding edge but will support the skills needed for the industry. Health benefits are not bad.", "cons": "Bonuses are FAR from what they will claim. Many quarters with zero bonuses or even a draw back if a deal changes after a sale and payout. Techie's ( SE's ) are routinely blamed for deals gone wrong. Sales staff is routinely turned over some go as long as 2 years of no sales. Management rules by intimidation and back stabbing so it's very hard to tell who and how to work with others. The SKO is roommates and the most UN-inspiring event on the planet. This is an individual contributor role as needed and the idea of working together is nothing more than words. If you stay long enough you will be numb.", "advice": "Retire the executive level and remove the middle layer. There are no valid, trained or worldly managers here. CEO/Owner is a nice guy and sharp but should not be running the company it is not his strong spot. The products have much more potential but the go-to market plan is stale and the bonuses reflect that."}, {"title": "Lots of challenging and exciting work.", "text": "Pros A great place to showcase your skills in your field. Cons Communication could be handled better. Advice to Management Treat people with more respect.", "rating": 5, "pros": "A great place to showcase your skills in your field.", "cons": "Communication could be handled better.", "advice": "Treat people with more respect."}, {"title": "Great company. Great working environment.", "text": "Pros Great company. Great working environment. Cons None. The salary can be better. Advice to Management Great company.", "rating": 5, "pros": "Great company. Great working environment.", "cons": "None. The salary can be better.", "advice": "Great company."}, {"title": "software developer", "text": "Pros 9 to 5 job, competitive salary, no pressure, nice team Cons the company doesn't pay bonuses", "rating": 5, "pros": "9 to 5 job, competitive salary, no pressure, nice team", "cons": "the company doesn't pay bonuses", "advice": null}, {"title": "Stable, Established Great Company with a Forward Thinking Vision of Integration, Integrity and Intelligence Technologies", "text": "Pros The people, management and entrepreneurial spirit. Visionary with practical and executable business plans. Supportive environment that allows creativity, trial and error without penalty. I have worked for a number of companies in my career so I know the grass is not greener on the \"other side\".The work environment is upbeat and supportive. It's a company that you wake up and want to come to work for and have fun. GREAT, GREAT people and culture. Cons Not the company you are looking for if you want a fast track to the C+ corner office. Organization is flat but lots of different lateral moves available. Advice to Management Keep up the positive, teaming environment, it's why many people stay with the company even though they could make more $$ somewhere else. Many long time employees and retreads (returning employees) speaks volumes about the company Gerry Cohen has built.", "rating": 5, "pros": "The people, management and entrepreneurial spirit. Visionary with practical and executable business plans. Supportive environment that allows creativity, trial and error without penalty. I have worked for a number of companies in my career so I know the grass is not greener on the \"other side\".The work environment is upbeat and supportive. It's a company that you wake up and want to come to work for and have fun. GREAT, GREAT people and culture.", "cons": "Not the company you are looking for if you want a fast track to the C+ corner office. Organization is flat but lots of different lateral moves available.", "advice": "Keep up the positive, teaming environment, it's why many people stay with the company even though they could make more $$ somewhere else. Many long time employees and retreads (returning employees) speaks volumes about the company Gerry Cohen has built."}, {"title": "Terrible Management, you don't know how bad it is until you leave and join other companies.", "text": "Pros Good place if you do not want salary increases for several years and no employee recognition. No hard work. Cons Employees stay there too long, nothing changes, no new energy, same old, same old ... Management doesn't know what they are doing but they think they do. Advice to Management Treat employees like you would like people to treat you. Go work for other companies and come back, you have been stuck too long in the same place and don't know better.", "rating": 1, "pros": "Good place if you do not want salary increases for several years and no employee recognition. No hard work.", "cons": "Employees stay there too long, nothing changes, no new energy, same old, same old ... Management doesn't know what they are doing but they think they do.", "advice": "Treat employees like you would like people to treat you. Go work for other companies and come back, you have been stuck too long in the same place and don't know better."}, {"title": "Information Builders", "text": "Pros Good products. Good people. Good work/life balance. Very focused on customer success and satisfaction. Solid customer and maintenance base. Cons Outdated internal systems and processes. Could be much more streamlined with some investment in IT and customer and sales tracking systems. Advice to Management Senior management that is getting to the end of their IBI careers... Need to identify a transition and growth plan to the next team of Senior Leaders.", "rating": 5, "pros": "Good products. Good people. Good work/life balance. Very focused on customer success and satisfaction. Solid customer and maintenance base.", "cons": "Outdated internal systems and processes. Could be much more streamlined with some investment in IT and customer and sales tracking systems.", "advice": "Senior management that is getting to the end of their IBI careers... Need to identify a transition and growth plan to the next team of Senior Leaders."}, {"title": "Good place to work, especially for AE and SEs.", "text": "Pros Work/life balance Messaging Software stack Field sales organization Cons Market awareness Some old school culture", "rating": 5, "pros": "Work/life balance", "cons": "Market awareness", "advice": null}, {"title": "Great Company to work for", "text": "Pros Lots of Smart people to work with Cons Very large company and very lots of red tape", "rating": 5, "pros": "Lots of Smart people to work with", "cons": "Very large company and very lots of red tape", "advice": null}, {"title": "Competitive salary", "text": "Pros Good people to work with. Cons Extremely busy work schedule does not leave time for additional self-education to keep up with new technology. Advice to Management Encourage professional growth.", "rating": 5, "pros": "Good people to work with.", "cons": "Extremely busy work schedule does not leave time for additional self-education to keep up with new technology.", "advice": "Encourage professional growth."}, {"title": "Good Place to work if you don't want to advance in your carrier", "text": "Pros Good Management unless you work for one particular IT Director. Good and friendly environment with multi language colleagues Good hours and calm work place. Good benefit package. Cons Bonuses don't exists, 300 is not a bonus, no place to rise at all.", "rating": 5, "pros": "Good Management unless you work for one particular IT Director. Good and friendly environment with multi language colleagues Good hours and calm work place. Good benefit package.", "cons": "Bonuses don't exists, 300 is not a bonus, no place to rise at all.", "advice": null}, {"title": "Unlimited Opportunity - innovative technology, talented people, forward thinking work environment", "text": "Pros Always been afforded the opportunity to do something new to advance my career and work with new technology. In some cases, creating brand new positions within the organization. Cons The company is very loyal to its employees. In some cases too loyal to those who are not as ambitious and dedicated as they once were.", "rating": 5, "pros": "Always been afforded the opportunity to do something new to advance my career and work with new technology. In some cases, creating brand new positions within the organization.", "cons": "The company is very loyal to its employees. In some cases too loyal to those who are not as ambitious and dedicated as they once were.", "advice": null}, {"title": "Awesome company to work for. Great people, great culture, and the absolute best technology in the industry.", "text": "Pros The people at IB are the best - like family. Working here is an absolute pleasure, it's actually fun coming to work. Work-life balance, as well as time off to recharge at this company is encouraged and is very satisfying. Everyone is competitive and works together because we love the company and want to continue growing our success. Our technology is superior to our competitors and everyone takes great pride in having the best products in the market. Learning is encouraged and there is ample opportunity to learn all you can about our technology and our business. The CEO has an open door policy and will always take the time to talk with any employee. Our customers love us. I never thought I would work for one company for so long, but I have seen many people leave and then come back, because IB is such a great company to work for. Cons There are not many negatives about the company. The medical benefits could always be a little better. T&E policies are a little stringent. Advice to Management Bringing new blood into the company is always good. Give your younger up and coming talent more leadership opportunities. Keep doing what you're doing in terms of the culture and valuing your employees.", "rating": 5, "pros": "The people at IB are the best - like family. Working here is an absolute pleasure, it's actually fun coming to work. Work-life balance, as well as time off to recharge at this company is encouraged and is very satisfying. Everyone is competitive and works together because we love the company and want to continue growing our success. Our technology is superior to our competitors and everyone takes great pride in having the best products in the market. Learning is encouraged and there is ample opportunity to learn all you can about our technology and our business. The CEO has an open door policy and will always take the time to talk with any employee. Our customers love us. I never thought I would work for one company for so long, but I have seen many people leave and then come back, because IB is such a great company to work for.", "cons": "There are not many negatives about the company. The medical benefits could always be a little better. T&E policies are a little stringent.", "advice": "Bringing new blood into the company is always good. Give your younger up and coming talent more leadership opportunities. Keep doing what you're doing in terms of the culture and valuing your employees."}, {"title": "With almost 40 years under its belt, Information Builders continues to be recognized as a market leader.", "text": "Pros Great company culture consisting of highly-motivated, smart people that work hard yet have a good time doing it. Its privately-held status allows Information Builders to focus on the things it finds most important - product / technology innovation and customer service / support. They are continuously recognized for both. This is not a place to coast; however, if you are looking for the opportunity to make significant contributions that have impact to the bottom line, and to be well compensated and recognized for it, this is the place for you. Cons It is not a highly-advertised organization. If you want to work for a company that advertises in the Wall Street Journal, this is not the place for you. Advice to Management Keep doing what you are doing by recognizing your high-value employees.", "rating": 5, "pros": "Great company culture consisting of highly-motivated, smart people that work hard yet have a good time doing it. Its privately-held status allows Information Builders to focus on the things it finds most important - product / technology innovation and customer service / support. They are continuously recognized for both. This is not a place to coast; however, if you are looking for the opportunity to make significant contributions that have impact to the bottom line, and to be well compensated and recognized for it, this is the place for you.", "cons": "It is not a highly-advertised organization. If you want to work for a company that advertises in the Wall Street Journal, this is not the place for you.", "advice": "Keep doing what you are doing by recognizing your high-value employees."}, {"title": "The Best Company I Have Ever Worked For", "text": "Pros I have waited for a chance to work for Information Builders for a very long time. As a customer of IBI’s WebFOCUS product I loved the technology. As a Business Analyst I could always count on WebFOCUS to help facilitate the information I was seeking. Now that I have joined the company, and for the past three years, I can see why openings at IBI come so infrequently. The teaming here is like nowhere else I have ever encountered. Seriously, it’s like I’m a part of the IBI family. My coworkers help me … let me say that again … they help me to be successful. Most of my peers have been with the company for over a decade and longer. The management and leadership care about the best interests of employee and customer alike. In fact, I have never seen customers treated with such a high degree of respect and integrity. The corporate culture at IBI exhibits a teaming partnership throughout. I can just as easily call a peer of mine with a question as I could call an executive in our New York office. People are welcoming and excited to reach out and help each other. That to me is the foundation for the success of this company. Cons How do I come up with Cons? The company has been in business for 40 years. They treat employees and customers like family. The environment is both personal and professional. If you need a Con, well then I would say it is difficult to get a job with IBI because there is relatively little turnover. Advice to Management Keep doing what you are doing. You run a great company. Stay privately held. I have been at two prior companies that maintained great corporate cultures, until, they went public. As a company, reporting to your customers (instead of to Wall street) is what makes this the great place it is. Having the ability to be proactive with customer request was just one thing I loved as a former customer.", "rating": 5, "pros": "I have waited for a chance to work for Information Builders for a very long time. As a customer of IBI’s WebFOCUS product I loved the technology. As a Business Analyst I could always count on WebFOCUS to help facilitate the information I was seeking. Now that I have joined the company, and for the past three years, I can see why openings at IBI come so infrequently. The teaming here is like nowhere else I have ever encountered. Seriously, it’s like I’m a part of the IBI family. My coworkers help me … let me say that again … they help me to be successful. Most of my peers have been with the company for over a decade and longer. The management and leadership care about the best interests of employee and customer alike. In fact, I have never seen customers treated with such a high degree of respect and integrity. The corporate culture at IBI exhibits a teaming partnership throughout. I can just as easily call a peer of mine with a question as I could call an executive in our New York office. People are welcoming and excited to reach out and help each other. That to me is the foundation for the success of this company.", "cons": "How do I come up with Cons? The company has been in business for 40 years. They treat employees and customers like family. The environment is both personal and professional. If you need a Con, well then I would say it is difficult to get a job with IBI because there is relatively little turnover.", "advice": "Keep doing what you are doing. You run a great company. Stay privately held. I have been at two prior companies that maintained great corporate cultures, until, they went public. As a company, reporting to your customers (instead of to Wall street) is what makes this the great place it is. Having the ability to be proactive with customer request was just one thing I loved as a former customer."}, {"title": "Great Company, Great Culture and Great People", "text": "Pros You are given the opportunity to succeed with the time and training required for your role. People genuinely care about your growth and development and will offer help whenever possible. There is a great mix of Passion, Competitiveness and Innovation. If you are able to apply your talent and wish to move to a different role they will create a path for you to keep you happy and growing in the company. Cons I truly love everything about Information Builders and all of the opportunity they have afforded me in my professional development. I don't have anything bad to say about the company at all. Advice to Management Don't lose sight of what has helped to build a lot of the success so far. keep the growth path for new talent open and available and encourage them to push themselves to the next level. Stay proud and positive of the culture and technology that you have created. It is a rare gem in the industry today!", "rating": 5, "pros": "You are given the opportunity to succeed with the time and training required for your role. People genuinely care about your growth and development and will offer help whenever possible. There is a great mix of Passion, Competitiveness and Innovation. If you are able to apply your talent and wish to move to a different role they will create a path for you to keep you happy and growing in the company.", "cons": "I truly love everything about Information Builders and all of the opportunity they have afforded me in my professional development. I don't have anything bad to say about the company at all.", "advice": "Don't lose sight of what has helped to build a lot of the success so far. keep the growth path for new talent open and available and encourage them to push themselves to the next level. Stay proud and positive of the culture and technology that you have created. It is a rare gem in the industry today!"}, {"title": "Amazing Culture, Amazing People, Amazing Company", "text": "Pros - Overall, Information Builders was an amazing company to work for with great people and great products that are always in the leaders quadrant for top analysts. It has a unique family environment with a great work-life balance. - Provides a ton of flexibility for field sales reps to customize deals that make sense for customers - Main focus is on the success of its' customers and prospects, which is not common these days. Customers love the company - Great overall compensation and reward programs for sales reps including quota club trips, commissions, company store rewards program.  - Open access to all executives, including the CEO Cons At times can be difficult to advance in your career based on the longevity of most employees Advice to Management Keep doing what your doing in creating the culture that makes IBI who they are. That being said, I would suggest more focus on career path for rising talent.", "rating": 5, "pros": "- Overall, Information Builders was an amazing company to work for with great people and great products that are always in the leaders quadrant for top analysts. It has a unique family environment with a great work-life balance.", "cons": "At times can be difficult to advance in your career based on the longevity of most employees", "advice": "Keep doing what your doing in creating the culture that makes IBI who they are. That being said, I would suggest more focus on career path for rising talent."}, {"title": "Good place to work", "text": "Pros Great training and compensation program. Lots of opportunity to travel. Great 9-5 job. The company has been around for a long time which helps its credibility. Their annual company meeting is a great way to network and interact with colleagues from around the world. Cons Sometimes dealt with being micromanaged. This sort of strained my relationship with management. I had trouble sharing new ideas. Felt intimidated sometimes by management. Company procedures can be a bit old fashioned and inefficient.", "rating": 5, "pros": "Great training and compensation program. Lots of opportunity to travel. Great 9-5 job. The company has been around for a long time which helps its credibility. Their annual company meeting is a great way to network and interact with colleagues from around the world.", "cons": "Sometimes dealt with being micromanaged. This sort of strained my relationship with management. I had trouble sharing new ideas. Felt intimidated sometimes by management. Company procedures can be a bit old fashioned and inefficient.", "advice": null}, {"title": "Great Company to work for - Rewards people who wish to contribute positivly", "text": "Pros The company is focused on the success of it's customers and prospects, there is nothing that they will not do to make sure you succeed. Cons IBI is what you make of it, you need to know what it is you are trying to do and bring that vision to the table. If you're looking to be a 9-5 'worker bee' doing the same thing, day in and day out for a pay check this is probably not the place for you. Advice to Management Product lines are extensive and deep, it takes a while to come up to speed with the breadth of the offering and anything they can do to make that easier would be helpful.", "rating": 5, "pros": "The company is focused on the success of it's customers and prospects, there is nothing that they will not do to make sure you succeed.", "cons": "IBI is what you make of it, you need to know what it is you are trying to do and bring that vision to the table. If you're looking to be a 9-5 'worker bee' doing the same thing, day in and day out for a pay check this is probably not the place for you.", "advice": "Product lines are extensive and deep, it takes a while to come up to speed with the breadth of the offering and anything they can do to make that easier would be helpful."}, {"title": "I worked here for over 15 years - multiple roles in sales and management", "text": "Pros Lots of field flexibility in creating and managing deals - including pricing and contract structures. Family atmosphere. Owner and senior management rarely overreact to a bad quarter - they stay the course for the long-haul - this shows in the experience and longevity of key personal - both in the field and in corporate roles Minimal bureaucracy - deal making can be very easy Good technology with people that know how to make it sing. Open door policy everywhere - common for IB programmers to be in the CEO's office, common for non-corporate IB staff to wander into CEO's office. Cons Market awareness is lower than other companies in the BI and Integration space - primarily due to more limited mktg budgets and historical lack of advertising. Services organization has very good people but locally-oriented structure occasionally means experts in particular areas are hard to source - few centers of excellence in the PS organization. Culture is family-oriented - if you want a fast-moving, cutthroat organization, with lots of risk and change this may not be for you.", "rating": 5, "pros": "Lots of field flexibility in creating and managing deals - including pricing and contract structures.", "cons": "Market awareness is lower than other companies in the BI and Integration space - primarily due to more limited mktg budgets and historical lack of advertising.", "advice": null}, {"title": "Sales Account Executive at Information Builders", "text": "Pros Great People Dedicated Sales Support and Executive Staff Enterprise Class Innovative Solutions - Gartner Magic Quadrant Award Winning Customer Service/Support Organization Great Opportunity to make $$$ Privately Held Company Founder & CEO has been successful for 40 years Worldwide Organization Hard to beat in head to head competitive Enterprise BI Deal Cons Information Builders does not have any major cons for a hard working, passionate, and intelligent sales professional. Advice to Management Continue to be the market leader in Enterprise BI/Data Management and hiring great people that care about the success of their clients.", "rating": 5, "pros": "Great People", "cons": "Information Builders does not have any major cons for a hard working, passionate, and intelligent sales professional.", "advice": "Continue to be the market leader in Enterprise BI/Data Management and hiring great people that care about the success of their clients."}, {"title": "Great place to coast", "text": "Pros You'll have a great work to life balance with a very laid back environment. Headquarters is also very conveniently located. Cons Do not expect a salary increase more than once every 5 years and it won't be for more than 50 dollars a check. The place is run with nepotism as positions are often given to family members. They compensate 40-50% lower than elsewhere. The company is run by a capable but aged man, and the future of the company is dependent on his health. Advice to Management Make your employees feel valued and they'll try to do more.", "rating": 3, "pros": "You'll have a great work to life balance with a very laid back environment. Headquarters is also very conveniently located.", "cons": "Do not expect a salary increase more than once every 5 years and it won't be for more than 50 dollars a check. The place is run with nepotism as positions are often given to family members. They compensate 40-50% lower than elsewhere. The company is run by a capable but aged man, and the future of the company is dependent on his health.", "advice": "Make your employees feel valued and they'll try to do more."}, {"title": "In for the long haul.", "text": "Pros IBI is a great company to work for, and it has many long term employees for that reason. It is exciting with new and wonderful products and very bright people, most of whom really enjoy working there which provides for a nice atmosphere. Your job is what you make it; it is a place where one can grow and learn. It is informal and relaxed without the pressure of a public company. The compensation is good, and fair, and known to be such, and the benefits continue to be very good. Cons There aren't that many career paths. If you're technical or in Sales, it is a great place to work. There is a lot of independence, so if that is not your thing, it may not be for you. Some find it to be a bit quirky. If you're looking for a tight structure, this might not be for you. Advice to Management Continue to listen to what the employees say and ideas they have. Advertise more because despite the company's wonderful success we are still not well enough known.", "rating": 5, "pros": "IBI is a great company to work for, and it has many long term employees for that reason. It is exciting with new and wonderful products and very bright people, most of whom really enjoy working there which provides for a nice atmosphere. Your job is what you make it; it is a place where one can grow and learn. It is informal and relaxed without the pressure of a public company. The compensation is good, and fair, and known to be such, and the benefits continue to be very good.", "cons": "There aren't that many career paths. If you're technical or in Sales, it is a great place to work. There is a lot of independence, so if that is not your thing, it may not be for you. Some find it to be a bit quirky. If you're looking for a tight structure, this might not be for you.", "advice": "Continue to listen to what the employees say and ideas they have. Advertise more because despite the company's wonderful success we are still not well enough known."}, {"title": "great company, excellent people", "text": "Pros sky is the limit for growth, very creative job creations Cons travel driving but not much flying which is great", "rating": 5, "pros": "sky is the limit for growth, very creative job creations", "cons": "travel driving but not much flying which is great", "advice": null}, {"title": "Strange culture", "text": "Pros Sales team was very friendly Cons My experience with the professional services was that team would do no design or analysis and jump right into development without much thought and preparation. This was major project for a major client and was even a bigger failure. Advice to Management Change culture of putting ineffective leaders in place because they happen to be with you for 20 years", "rating": 1, "pros": "Sales team was very friendly", "cons": "My experience with the professional services was that team would do no design or analysis and jump right into development without much thought and preparation. This was major project for a major client and was even a bigger failure.", "advice": "Change culture of putting ineffective leaders in place because they happen to be with you for 20 years"}, {"title": "Solid Technology, Good Company, Good People, Family Oriented", "text": "Pros Good technology, people are passionate about being successful, good family atmosphere Cons Industry awareness, lead generation, board of directors from other industries helping to drive the vision Advice to Management Strategic Board Members to help drive direction. Marketing to help drive awareness. Lobbyist to help with political positioning in large opportunities.", "rating": 5, "pros": "Good technology, people are passionate about being successful, good family atmosphere", "cons": "Industry awareness, lead generation, board of directors from other industries helping to drive the vision", "advice": "Strategic Board Members to help drive direction. Marketing to help drive awareness. Lobbyist to help with political positioning in large opportunities."}, {"title": "IB has been good to me, but it's no longer the company it once was.", "text": "Pros IB is family friendly and has been good to me over the years in this regard. The product is extremely flexible and powerful. The CEO has managed the company through economic downturns quite well. Cons Minimal professional management. One VP in particular is extremely difficult to work with and often verbally abusive. Business units do not control their own P&L. 1980's \"matrix management\" style still in evidence. No systematic raises in many years, salary increases are hard to come by since the early 2000's. 401k matching is poor. Advice to Management Budgets should be given to some groups to allow them autonomy with regard to finding new business opportunities, leveraging new technologies, and capitalizing on trends. Resellers and other partners should be leveraged much more aggressively to sell into the SMB and stop IB leaving so much money on the table. Fire the caustic VP immediately. No one should have to work with this toxic guy. Hire more people; especially in technical support. Turn product managers into product owners and give them the power to control what goes into the product. To do this you'll need to get them out in the field and send them to industry events so they truly understand what's going on in the marketplace and so they know the pain points of their target customers. Give QA the power it needs to improve product quality--they should be able to veto a product release until it is proven stable--take lessons from IBM in this regard. Stop stifling creative ideas. Allow people to pursue things for which they have passion but which aren't already somewhere in your game plan. Listen to new people you hire. They have skills, talents, and industry knowledge you can't possibly have. Implement a broad-based work-from-home policy. This will result in greatly improved morale and allow you to rent a lot less expensive space. Allow flexible hours wherever possible so people can work at times when they are most productive and be free to integrate work and home life more completely. You'll get more productivity and you'll save money. And get realistic about travel expenses. It's way too difficult to meet all the criteria for reimbursement and the allowable amounts for things are from some decade we haven't seen in a very long time.", "rating": 3, "pros": "IB is family friendly and has been good to me over the years in this regard. The product is extremely flexible and powerful. The CEO has managed the company through economic downturns quite well.", "cons": "Minimal professional management. One VP in particular is extremely difficult to work with and often verbally abusive. Business units do not control their own P&L. 1980's \"matrix management\" style still in evidence. No systematic raises in many years, salary increases are hard to come by since the early 2000's. 401k matching is poor.", "advice": "Budgets should be given to some groups to allow them autonomy with regard to finding new business opportunities, leveraging new technologies, and capitalizing on trends. Resellers and other partners should be leveraged much more aggressively to sell into the SMB and stop IB leaving so much money on the table. Fire the caustic VP immediately. No one should have to work with this toxic guy. Hire more people; especially in technical support. Turn product managers into product owners and give them the power to control what goes into the product. To do this you'll need to get them out in the field and send them to industry events so they truly understand what's going on in the marketplace and so they know the pain points of their target customers. Give QA the power it needs to improve product quality--they should be able to veto a product release until it is proven stable--take lessons from IBM in this regard. Stop stifling creative ideas. Allow people to pursue things for which they have passion but which aren't already somewhere in your game plan. Listen to new people you hire. They have skills, talents, and industry knowledge you can't possibly have. Implement a broad-based work-from-home policy. This will result in greatly improved morale and allow you to rent a lot less expensive space. Allow flexible hours wherever possible so people can work at times when they are most productive and be free to integrate work and home life more completely. You'll get more productivity and you'll save money. And get realistic about travel expenses. It's way too difficult to meet all the criteria for reimbursement and the allowable amounts for things are from some decade we haven't seen in a very long time."}, {"title": "Really good people, culture", "text": "Pros People, branch and regional managers, patience, competitive product, many areas to excel Cons No one knows who we are so it is sometime a hurdle when selling the product. This company does a very poor job at marketing. Typically the product upgrades are behind the times a bit and we are always playing technology catch-up. Product development is a bit quirky when asking for changes. Advice to Management Stop trying to force customers to develop their solutions YOUR way. Let the product allow them to develop their own way. For all the talk we have about customized solutions, the product doesn't really bear that out.", "rating": 5, "pros": "People, branch and regional managers, patience, competitive product, many areas to excel", "cons": "No one knows who we are so it is sometime a hurdle when selling the product. This company does a very poor job at marketing. Typically the product upgrades are behind the times a bit and we are always playing technology catch-up. Product development is a bit quirky when asking for changes.", "advice": "Stop trying to force customers to develop their solutions YOUR way. Let the product allow them to develop their own way. For all the talk we have about customized solutions, the product doesn't really bear that out."}, {"title": "Stable product with happy customers. Good people work here.", "text": "Pros Products work, can link to any back end. Good for long term success of customer projects. Cons Not contemporary - taking care of existing base but not sure if message resonates with new customers looking for exciting \"new stuff\". Advice to Management Analyze core strengths. Be niche player to those strengths. Not everything to everyone.", "rating": 3, "pros": "Products work, can link to any back end. Good for long term success of customer projects.", "cons": "Not contemporary - taking care of existing base but not sure if message resonates with new customers looking for exciting \"new stuff\".", "advice": "Analyze core strengths. Be niche player to those strengths. Not everything to everyone."}, {"title": "Terrible managers, awful products", "text": "Pros Good location on top of Penn Station. Cons Too many psychotic managers who only get promoted to the next level rather than being terminated. The Webfocus product is awful, better BI products are on the market. Core software really hasn't changed much since the 1970's. Advice to Management Sell the company and clean house.", "rating": 1, "pros": "Good location on top of Penn Station.", "cons": "Too many psychotic managers who only get promoted to the next level rather than being terminated.", "advice": "Sell the company and clean house."}, {"title": "Good place to start out, not much opportunity to move up", "text": "Pros Good salary and flexible hours to live a normal life. great place to understand the market and gain industry knowledge. Access to upper management to grow professionally. Great bonus structure for AE's Cons no opportunity to move up, most managers and leaders in the company have been there for 30+ years and aren't going away until they can't see straight. They have an old way of thinking about sales, sales managers are being demoted to sales rep rather than being fired, disjointed approach to sales and marketing. Stagnant growth year over year Advice to Management Stop holding back innovation, there is an innovative solution offering. Embrace that someone can do it better and not chastise them for \"not doing it your old way\"", "rating": 3, "pros": "Good salary and flexible hours to live a normal life. great place to understand the market and gain industry knowledge. Access to upper management to grow professionally. Great bonus structure for AE's", "cons": "no opportunity to move up, most managers and leaders in the company have been there for 30+ years and aren't going away until they can't see straight. They have an old way of thinking about sales, sales managers are being demoted to sales rep rather than being fired, disjointed approach to sales and marketing. Stagnant growth year over year", "advice": "Stop holding back innovation, there is an innovative solution offering. Embrace that someone can do it better and not chastise them for \"not doing it your old way\""}, {"title": "Mature company but still learning", "text": "Pros People. Plenty of opportunities to grow. Cons Don't take risks. Pretty flat.", "rating": 5, "pros": "People. Plenty of opportunities to grow.", "cons": "Don't take risks. Pretty flat.", "advice": null}, {"title": "It's a unique, privately owned company that has all the perks of small business but all the benefits of a large company.", "text": "Pros High base, not micromanaged, decent commission Cons software is tough to sell Advice to Management promote within", "rating": 5, "pros": "High base, not micromanaged, decent commission", "cons": "software is tough to sell", "advice": "promote within"}, {"title": "Talented staff who are great to work; unique company culture.", "text": "Pros Very talented people to work with. If you fit with the company culture there's pretty good job security. The company does make an effort to recognize outstanding achievements. Cons The people are great, but everything about the rest of the company is mediocre, including senior mgt leadership & vision, products, marketing, and ability to execute. \"Good ol' boys club\" mentality. You either fit in or not. Advice to Management Value the field's input on product development and seriously consider doing something with it.", "rating": 3, "pros": "Very talented people to work with.", "cons": "The people are great, but everything about the rest of the company is mediocre, including senior mgt leadership & vision, products, marketing, and ability to execute.", "advice": "Value the field's input on product development and seriously consider doing something with it."}, {"title": "Dying company", "text": "Pros The concept they bring to the marketplace is great, execution of delivery stinks. Cons Too many lifers, no new talent is given the opportunity to thrive. They are living life with a geriatric mindset. Advice to Management Listen to the newer members of the team.", "rating": 1, "pros": "The concept they bring to the marketplace is great, execution of delivery stinks.", "cons": "Too many lifers, no new talent is given the opportunity to thrive. They are living life with a geriatric mindset.", "advice": "Listen to the newer members of the team."}, {"title": "Good company with strong technology offering", "text": "Pros Good company with strong technology offering Cons Perception technology is legacy not as innovative as others in space Advice to Management Doing good job with technology but need to do better job evangelizing.", "rating": 5, "pros": "Good company with strong technology offering", "cons": "Perception technology is legacy not as innovative as others in space", "advice": "Doing good job with technology but need to do better job evangelizing."}, {"title": "Branch/Regional offices are great, a shame corporate executives are stale.", "text": "Pros Great benefits, opp for advancement. Great teamwork at branch/Regional level. Cons Little change in over 10 years. No raises for years. Advice to Management Retire and let someone more qualified run the  shop.", "rating": 5, "pros": "Great benefits, opp for advancement. Great teamwork at branch/Regional level.", "cons": "Little change in over 10 years. No raises for years.", "advice": "Retire and let someone more qualified run the"}, {"title": "Backwards", "text": "Pros Flexible hours. Flexible schedule. Good for moms who want to work and also balance a home life. Easy access to headquarters. Cons Management is horrible. No one knows what they're doing. They waste a lot of money. They don't treat their employees with respect. They don't pay their employees well. Advice to Management Get a consultant to clean up the dead weight.", "rating": 3, "pros": "Flexible hours. Flexible schedule. Good for moms who want to work and also balance a home life. Easy access to headquarters.", "cons": "Management is horrible. No one knows what they're doing. They waste a lot of money. They don't treat their employees with respect. They don't pay their employees well.", "advice": "Get a consultant to clean up the dead weight."}, {"title": "Need to Change Quickly", "text": "Pros Nice enough people to work with.... Cons No senior leadership (C-level and VP) and or interest in looking honestly at the numerous issues that have and continue to halt growth and competitiveness.", "rating": 1, "pros": "Nice enough people to work with....", "cons": "No senior leadership (C-level and VP) and or interest in looking honestly at the numerous issues that have and continue to halt growth and competitiveness.", "advice": null}, {"title": "Great software, challenging management; stagnant workforce", "text": "Pros Software demos well, and is easy to use once installed. The Solutions Consultant team is very knowledgeable and great to work with. Cons Management team is micromanaging the team, and all quotes go through one person, a complete bottleneck. Software is a pain to install - can't quote without consulting, and not many partners work with the software. Advice to Management You've hired great people, let them do their job!", "rating": 3, "pros": "Software demos well, and is easy to use once installed.", "cons": "Management team is micromanaging the team, and all quotes go through one person, a complete bottleneck.", "advice": "You've hired great people, let them do their job!"}, {"title": "Good company, flexible hours", "text": "Pros Flexible environment. Good management. No weekends Cons Too much macro management, less pay and group ism Advice to Management Increase salaries, bonus incentive", "rating": 5, "pros": "Flexible environment. Good management. No weekends", "cons": "Too much macro management, less pay and group ism", "advice": "Increase salaries, bonus incentive"}, {"title": "QA Group Lead", "text": "Pros Interesting Software products, challenge, new technology. Cons I prefer not to answer", "rating": 5, "pros": "Interesting Software products, challenge, new technology.", "cons": "I prefer not to answer", "advice": null}, {"title": "A great company stuck in old times....", "text": "Pros Bar is set low for performance Cons Very political Employees constantly talk bad About each other No urgency People have been there too long to bring about change Advice to Management Hold your employees accountable", "rating": 3, "pros": "Bar is set low for performance", "cons": "Very political", "advice": "Hold your employees accountable"}, {"title": "Large independent software company with a small company feel", "text": "Pros Collaborative environment where all opinions are heard and considered. Management understands that employees have lives outside of work and will accommodate special requests. Gerry (the CEO and majority owner) is very involved in the day to day operations of the company. Cons Less aggressive than smaller/start-up companies on investing in branding and advertising. Advice to Management Don't be afraid to think outside the box and invest more in branding and exposure in order to grow the company.", "rating": 5, "pros": "Collaborative environment where all opinions are heard and considered. Management understands that employees have lives outside of work and will accommodate special requests. Gerry (the CEO and majority owner) is very involved in the day to day operations of the company.", "cons": "Less aggressive than smaller/start-up companies on investing in branding and advertising.", "advice": "Don't be afraid to think outside the box and invest more in branding and exposure in order to grow the company."}, {"title": "A positive work experience", "text": "Pros You have an opportunity to work in the interactive environment, constantly collaborating with the technical professionals and other staff members. You have an opportunity to learn new technologies and to use your knowledge. I truly enjoy working at IBI. Cons The only downside working at IBI is the workload. You always have a big list of things to do, which is perfectly fine for me, but might not suit some others. Advice to Management I'd say, the upper management should enhance the lateral promotional policies.", "rating": 5, "pros": "You have an opportunity to work in the interactive environment, constantly collaborating with the technical professionals and other staff members. You have an opportunity to learn new technologies and to use your knowledge. I truly enjoy working at IBI.", "cons": "The only downside working at IBI is the workload. You always have a big list of things to do, which is perfectly fine for me, but might not suit some others.", "advice": "I'd say, the upper management should enhance the lateral promotional policies."}, {"title": "Not What it Use to Be", "text": "Pros Flexible hours, Midtown so it's easy to get to. Cons No growth, no voice representing the employees, no HR. Advice to Management Listen to your staff.", "rating": 3, "pros": "Flexible hours, Midtown so it's easy to get to.", "cons": "No growth, no voice representing the employees, no HR.", "advice": "Listen to your staff."}, {"title": "No Idea what they are doing", "text": "Pros Nice enough people to be around Cons Not a very high level of business acumen from either the executive, sales or marketing team Advice to Management Need to replace senior management", "rating": 1, "pros": "Nice enough people to be around", "cons": "Not a very high level of business acumen from either the executive, sales or marketing team", "advice": "Need to replace senior management"}, {"title": "Most negative and unprofessional work environment imaginable.", "text": "Pros Fantastic product with tremendous value to business of all sizes. Could be a technology leader based on the product direction. Longevity Cons Very little knowledge and understand of the product application in business outside of what is coached internally. Leadership is stagnant at all levels. Poor Marketing and Product Promotion. Poor integrity and combative workplace is not only rampant, but consistently encouraged. Advice to Management Start cleaning house and hire passionate professionals that are capable of leading and Selling with integrity and intelligence!", "rating": 1, "pros": "Fantastic product with tremendous value to business of all sizes. Could be a technology leader based on the product direction.", "cons": "Very little knowledge and understand of the product application in business outside of what is coached internally.", "advice": "Start cleaning house and hire passionate professionals that are capable of leading and Selling with integrity and intelligence!"}, {"title": "Nepotism at it's finest", "text": "Pros This company has a rather relaxed atmosphere. Cons Nepotism!! I know many instances of where positions are all filled by family members of upper management and execs. Sub-market salary Very poor benefits Advice to Management None. I'm not staying", "rating": 3, "pros": "This company has a rather relaxed atmosphere.", "cons": "Nepotism!! I know many instances of where positions are all filled by family members of upper management and execs.", "advice": "None. I'm not staying"}, {"title": "Nepotism at it's highest", "text": "Pros Big money opportunity in this industry Cons Management and the people they bring on. 3 upper mgmt. got their kids hired on here... seriously. A place of nepotism, not meritocracy. Get in to get experience under your belt if you can't get in anywhere else in this industry if this is the type of work you want to get into, then get the hell out as soon as a hot startup or major player is willing to take you on. See that quite often, new people get on and then hop to IBM and others after paying their dues here. Advice to Management Why tell them, they wouldn't listen anyway. They're all just riding out their careers here and playing office politics, not about getting better.", "rating": 1, "pros": "Big money opportunity in this industry", "cons": "Management and the people they bring on. 3 upper mgmt. got their kids hired on here... seriously. A place of nepotism, not meritocracy. Get in to get experience under your belt if you can't get in anywhere else in this industry if this is the type of work you want to get into, then get the hell out as soon as a hot startup or major player is willing to take you on. See that quite often, new people get on and then hop to IBM and others after paying their dues here.", "advice": "Why tell them, they wouldn't listen anyway. They're all just riding out their careers here and playing office politics, not about getting better."}, {"title": "Nepotism and Good Ole Boy Network is Rampant", "text": "Pros excellent support staff, decent BI niche products, and ok benefits Cons Lack of good sales leadership, no understanding of the market place and most senior executives have been given their jobs as a result of tenure rather than talent, so many are not well qualified to lead. Management is also slow to understand market trends, and Public Sector practice is barely growing. Cloud technology (SaaS) is still not widely accepted by management as an up and coming solution,which has resulted in product dis-enchantment by customers and lack of movement in the marketplace. Base salary below par, and commission structure is complex and confusing Advice to Management Replace most of the regional vp level sales managment with people who are actual sales people and whom understand current market trends and requirements. Consider hiring more marketing savvy people as well as current marketing efforts have led to loss of ground in Gartner's Magic Quadrent", "rating": 3, "pros": "excellent support staff, decent BI niche products, and ok benefits", "cons": "Lack of good sales leadership, no understanding of the market place and most senior executives have been given their jobs as a result of tenure rather than talent, so many are not well qualified to lead. Management is also slow to understand market trends, and Public Sector practice is barely growing. Cloud technology (SaaS) is still not widely accepted by management as an up and coming solution,which has resulted in product dis-enchantment by customers and lack of movement in the marketplace. Base salary below par, and commission structure is complex and confusing", "advice": "Replace most of the regional vp level sales managment with people who are actual sales people and whom understand current market trends and requirements. Consider hiring more marketing savvy people as well as current marketing efforts have led to loss of ground in Gartner's Magic Quadrent"}, {"title": "Stay for experience then get the hell out", "text": "Pros Some sense of privacy Free Water!!! Cons Regular treatment is granted only as special favors. If you manager likes you, you pretty much can do anything you want. If you don't be prepared to hate your job. No room to move up in the ranks. If you want to become a manager, you have to be there for 10-15 years or hope a manager leaves or dies. Advice to Management Pay your employees a decent wage then maybe working there won't suck so bad.", "rating": 3, "pros": "Some sense of privacy", "cons": "Regular treatment is granted only as special favors. If you manager likes you, you pretty much can do anything you want. If you don't be prepared to hate your job. No room to move up in the ranks. If you want to become a manager, you have to be there for 10-15 years or hope a manager leaves or dies.", "advice": "Pay your employees a decent wage then maybe working there won't suck so bad."}, {"title": "Management philosophy", "text": "Pros Being a small coming has its advantages. Ibi can be fairly responsive to customer requests for new features. Cons Management uses poor statistics to measure performance. Very averse to any change. Still makes use of green screen systems that are inefficient for nth the customer support reps and the customers. The irony is that Ibi is a software company and can't even write its own application to replace the mainframe. Advice to Management The whack a mole management strategy went out of style after the industrial age. Learn to set benchmarks that actually matter. Hire more people rather than work people until they literally fall ill with serious health problems trying to support the company.", "rating": 3, "pros": "Being a small coming has its advantages. Ibi can be fairly responsive to customer requests for new features.", "cons": "Management uses poor statistics to measure performance. Very averse to any change. Still makes use of green screen systems that are inefficient for nth the customer support reps and the customers. The irony is that Ibi is a software company and can't even write its own application to replace the mainframe.", "advice": "The whack a mole management strategy went out of style after the industrial age. Learn to set benchmarks that actually matter. Hire more people rather than work people until they literally fall ill with serious health problems trying to support the company."}, {"title": "Great work environment, new technologies, pay laggs", "text": "Pros Very relaxed working environment, friendly coworkers, rarely strict deadlines. Many technologies to work with possibility of moving around. Many non-work related programs such as health fairs, bring your child to work, etc. Cons Pay is below market. Company leadership is very secretive regarding company's success. 401k match is almost non-existent. Advice to Management Provide more autonomy for management below the senior VP level in determing technology trends, employee compensation.", "rating": 5, "pros": "Very relaxed working environment, friendly coworkers, rarely strict deadlines.", "cons": "Pay is below market.", "advice": "Provide more autonomy for management below the senior VP level in determing technology trends, employee compensation."}, {"title": "So so place to work, better options may exist", "text": "Pros good benefits and perks, stability Cons Career growth options are limited. Software is 'old school' and not web/mobile friendly. Advice to Management Implement '360 degree feedback'", "rating": 3, "pros": "good benefits and perks, stability", "cons": "Career growth options are limited. Software is 'old school' and not web/mobile friendly.", "advice": "Implement '360 degree feedback'"}, {"title": "Ok.", "text": "Pros Privately owned, less of the corporate feel and more of a family owned business feel. Cons Well established and networked management that has been there for a long time, leaves not much room for someone coming in from the outside to make things happen.", "rating": 3, "pros": "Privately owned, less of the corporate feel and more of a family owned business feel.", "cons": "Well established and networked management that has been there for a long time, leaves not much room for someone coming in from the outside to make things happen.", "advice": null}, {"title": "Wonderful Product, Fantastic Customers.... Horrible Leadership throughout", "text": "Pros Solid Product and great customer service focus to existing customers Cons Critical Integrity and Leadership problems. I have never seen a company so focused on negativity and personal gain. There is no team work culture. This is very disappointing as the product is solid and the owner is passionate and brilliant! Advice to Management Prepare the company for massive retirement that is coming with most leaders 60+. Hire new Management that is passionate, driven, team orientated, strategically focused and most of all positive attitude focused. Make integrity a valuable asset and reward positive proactive behavior. Reduce unnecessary travel costs to be profitable.", "rating": 1, "pros": "Solid Product and great customer service focus to existing customers", "cons": "Critical Integrity and Leadership problems. I have never seen a company so focused on negativity and personal gain. There is no team work culture. This is very disappointing as the product is solid and the owner is passionate and brilliant!", "advice": "Prepare the company for massive retirement that is coming with most leaders 60+. Hire new Management that is passionate, driven, team orientated, strategically focused and most of all positive attitude focused. Make integrity a valuable asset and reward positive proactive behavior. Reduce unnecessary travel costs to be profitable."}, {"title": "Boring", "text": "Pros - Stable - good technology - good training Cons - Same people have been there for 20 years - Processes are old - Not much room for creative thinking - Cube farm", "rating": 3, "pros": "- Stable", "cons": "- Same people have been there for 20 years", "advice": null}, {"title": "Stable but not a lot of room for growth", "text": "Pros This company has remained fairly stable for an IT company during pretty horrendous economic times. Good people (for the most part) Cons Some of the employees who have been there for eons just skate by with doing the bare minimum. There is not a lot of room to grow within this company. Many managers who have been there for years seem complacent. Advice to Management Hire some new blood and become more innovative.", "rating": 3, "pros": "This company has remained fairly stable for an IT company during pretty horrendous economic times.", "cons": "Some of the employees who have been there for eons just skate by with doing the bare minimum.", "advice": "Hire some new blood and become more innovative."}, {"title": "Decent pay, poor management, lack of strategy, or room for growth.", "text": "Pros Mom and pop feel has its charm. Cons Too many corners are cut. Too much reliance lately on outside code. Stagnant management. No credence given to anything on the administrative side. Key resources are lacking. Advice to Management Hire a Chief Operations Officer and a good General Counsel. Do a top to bottom review of staff and their role/compensation. Get rid of dead wood and rebuild.", "rating": 3, "pros": "Mom and pop feel has its charm.", "cons": "Too many corners are cut. Too much reliance lately on outside code. Stagnant management. No credence given to anything on the administrative side. Key resources are lacking.", "advice": "Hire a Chief Operations Officer and a good General Counsel. Do a top to bottom review of staff and their role/compensation. Get rid of dead wood and rebuild."}, {"title": "Used to be a good place for developers, now its a good place for flibberjibits.", "text": "Pros Easy commute, midtown Manhattan. The last big old school style software house standing. Newer product lines have promise. They tend to overpay people to stay on and keep quiet. Cons Old boys salesforce, stale ideas, stagnant. Waiting for the founder to retire/leave. No real direction or vision. No actual investment at all. Advice to Management Stop pretending to be open and actually be open. Stop being so cheap and petty. Publish and provide direction. Allow telecommuting to widen the available workforce. Enter the 21st century.", "rating": 3, "pros": "Easy commute, midtown Manhattan. The last big old school style software house standing. Newer product lines have promise. They tend to overpay people to stay on and keep quiet.", "cons": "Old boys salesforce, stale ideas, stagnant. Waiting for the founder to retire/leave. No real direction or vision. No actual investment at all.", "advice": "Stop pretending to be open and actually be open. Stop being so cheap and petty. Publish and provide direction. Allow telecommuting to widen the available workforce. Enter the 21st century."}, {"title": "Advise you to do your due diligence and company research before accepting the offer", "text": "Pros First off, Great location of HQ. Manhattan, NY. Software technology stack is ok, Nothing great or Wow about it. Cons * Really old school of thought with Senior management. Remember these people have been with the company since it was founded in 1975. Average tenure I have seen is 15+ years. Which is a good thing, but very bad for the product. The developers and product managers have no idea what goes on in the real world. * Product stack seriously needs maturity and infusion of new technology thoughts. * Limited growth and compensation. One advice - negotiate as much upfront during the offer. * No information sharing amongst peers Advice to Management Get a younger, dynamic workforce and reward your most valuable employees. Please do not take them for granted.", "rating": 1, "pros": "First off, Great location of HQ. Manhattan, NY. Software technology stack is ok, Nothing great or Wow about it.", "cons": "* Really old school of thought with Senior management.", "advice": "Get a younger, dynamic workforce and reward your most valuable employees. Please do not take them for granted."}, {"title": "Nothing to write home about", "text": "Pros The company is relaxed and friendly. Cons Way too Top Heavy and Terribly 'in-bred' It seems they hire complete families, and then management ends up looking after each others kids and playing favorites instead of managing the business. Advice to Management Greatly need to consolidate their product divisions. Could use a bit of deadwood trimming of their top heavy organization and bring in some fresh blood.", "rating": 3, "pros": "The company is relaxed and friendly.", "cons": "Way too Top Heavy and Terribly 'in-bred'", "advice": "Greatly need to consolidate their product divisions. Could use a bit of deadwood trimming of their top heavy organization and bring in some fresh blood."}, {"title": "Excellent Place to work!", "text": "Pros Gerry Cohen and the senior management team is genuinely interested in their customers' successes. The company rewards those who produce results. It is a great environment to learn and apply leading edge technologies and skills. Cons The accounting department is too focused on T&E. Advice to Management Keep doing what you are doing!", "rating": 5, "pros": "Gerry Cohen and the senior management team is genuinely interested in their customers' successes. The company rewards those who produce results. It is a great environment to learn and apply leading edge technologies and skills.", "cons": "The accounting department is too focused on T&E.", "advice": "Keep doing what you are doing!"}, {"title": "A good place to work but without opportunity or reward", "text": "Pros Friendly environment. Managers and colleagues are easy to talk with. There are many people who have worked 20 or 30 years there. Layoff risk is minimum. Cons No bonus or reward based on merit, although the performance rating is excellent. No raise after 4 years of hard working. Because of that, my salary is even lower than new employees. Absolutely nothing beyond base salary. Advice to Management The company is a good place for senior employees who want to work there for the rest of life. No advice beyond that.", "rating": 3, "pros": "Friendly environment. Managers and colleagues are easy to talk with. There are many people who have worked 20 or 30 years there. Layoff risk is minimum.", "cons": "No bonus or reward based on merit, although the performance rating is excellent. No raise after 4 years of hard working. Because of that, my salary is even lower than new employees. Absolutely nothing beyond base salary.", "advice": "The company is a good place for senior employees who want to work there for the rest of life. No advice beyond that."}, {"title": "Great place to work", "text": "Pros A family oriented company that cares about the employees and gives those who want to work hard the opportunity to grow into new roles and responsibilities. Cons The company has a lot of long term employees. While this is often a plus, it may be perceived to be a negative by someone looking for more of a technology startup experience. Advice to Management Management needs to recognize that the market is always changing and that the company needs to constantly strive to re-invent itself to stay fresh and relevent.", "rating": 5, "pros": "A family oriented company that cares about the employees and gives those who want to work hard the opportunity to grow into new roles and responsibilities.", "cons": "The company has a lot of long term employees. While this is often a plus, it may be perceived to be a negative by someone looking for more of a technology startup experience.", "advice": "Management needs to recognize that the market is always changing and that the company needs to constantly strive to re-invent itself to stay fresh and relevent."}, {"title": "I had tremendous opportunities to work on many \"bleeding edge\" technologies.", "text": "Pros The company offers a very good benefits package. I got to work with many new or just-being-developed technologies. I believe they have a generous compensation level. Cons Unfortunately the company growth has stagnated for the past 10+ years. There were a couple of attempts to buy the company that fell through. At one point there was a profit sharing program which was replaced by a 401k but then the company match was reduced. Advice to Management There are a LOT of people at IBI who have been at the company for years and years. It's nice that the company has promoted up through the levels but they learned the system and aren't very creative with ideas to move the company forward. The company needs an infusion of creative thinkers and experienced executives that can help to get things growing again.", "rating": 5, "pros": "The company offers a very good benefits package. I got to work with many new or just-being-developed technologies. I believe they have a generous compensation level.", "cons": "Unfortunately the company growth has stagnated for the past 10+ years. There were a couple of attempts to buy the company that fell through. At one point there was a profit sharing program which was replaced by a 401k but then the company match was reduced.", "advice": "There are a LOT of people at IBI who have been at the company for years and years. It's nice that the company has promoted up through the levels but they learned the system and aren't very creative with ideas to move the company forward. The company needs an infusion of creative thinkers and experienced executives that can help to get things growing again."}, {"title": "Neutral", "text": "Pros Technical skill in their products. Cons No Career path to grow. Advice to Management Develop a definitive career path", "rating": 3, "pros": "Technical skill in their products.", "cons": "No Career path to grow.", "advice": "Develop a definitive career path"}, {"title": "old school ... good team", "text": "Pros many long term employees. good benefits. good people. good technology. IB treats its employees well and if you stay on board awhile you can become well integrated into the big team Cons as one of the few remaining independent and private business intelligence vendors it is difficult too sell into new accounts. Advice to Management it may be a good time for selling the company to one of the big software vendors. Keep the top guns alive.", "rating": 5, "pros": "many long term employees. good benefits. good people. good technology. IB treats its employees well and if you stay on board awhile you can become well integrated into the big team", "cons": "as one of the few remaining independent and private business intelligence vendors it is difficult too sell into new accounts.", "advice": "it may be a good time for selling the company to one of the big software vendors. Keep the top guns alive."}, {"title": "Too incestuous, talent and experience rarely rewarded. No upward mobility - none!", "text": "Pros It's a job in a tough economy. Cons Senior managers have no business experience. They have been with the company so long (most 25+ yrs) they have no connection to the real world. Advice to Management Hire a consulting company to re-organize. Replace senior managers with competent, experienced people. Longevity is not a qualification of leadership.", "rating": 1, "pros": "It's a job in a tough economy.", "cons": "Senior managers have no business experience. They have been with the company so long (most 25+ yrs) they have no connection to the real world.", "advice": "Hire a consulting company to re-organize. Replace senior managers with competent, experienced people. Longevity is not a qualification of leadership."}, {"title": "Great place to learn and work", "text": "Pros Great learning environment with highly talented teams of developers. Cons Quirky management with mixed opportunities for career development and direction. Advice to Management \"Uncle\" Gerry has done a great job of running Information Builders. There are times and places where the technical and management teams could benefit from some coaching and professional development.", "rating": 5, "pros": "Great learning environment with highly talented teams of developers.", "cons": "Quirky management with mixed opportunities for career development and direction.", "advice": "\"Uncle\" Gerry has done a great job of running Information Builders. There are times and places where the technical and management teams could benefit from some coaching and professional development."}, {"title": "a good software company in great location", "text": "Pros Great company with nice people, convenient location, lot of opportunities to learn new stuff, you can always find good people to help you on technical problems and give you suggestions on how to setup your develop environment. Work is not so hard and everybody has the chance to learn and to practice the cutting edge technologies. Good sales team makes great profit for this company so that the company is silll pretty stable in this down economic situation. There are a lot of good restaurants around the headquarter of the company, so that you can easily to taste many good foods. And of course its location is nice to have you commute since penn station is just downstairs. Cons not too much growth recently, some people leave because the company is too stable. Short of challenges, the work is not that interesting since most of the development and products are middleware so that the developers can not see the result and can't feel the excitement when they see the users are really using their products. It's not easy for the employee to talk with high level people, actually we have a lot of suggestions on how to manage the company better and even which products we feel more worth to build and sell. There are too many QAs and product managers. Advice to Management Provide more chances to let the employee to communicate with management to provide suggestions.", "rating": 5, "pros": "Great company with nice people, convenient location, lot of opportunities to learn new stuff, you can always find good people to help you on technical problems and give you suggestions on how to setup your develop environment. Work is not so hard and everybody has the chance to learn and to practice the cutting edge technologies. Good sales team makes great profit for this company so that the company is silll pretty stable in this down economic situation. There are a lot of good restaurants around the headquarter of the company, so that you can easily to taste many good foods. And of course its location is nice to have you commute since penn station is just downstairs.", "cons": "not too much growth recently, some people leave because the company is too stable. Short of challenges, the work is not that interesting since most of the development and products are middleware so that the developers can not see the result and can't feel the excitement when they see the users are really using their products. It's not easy for the employee to talk with high level people, actually we have a lot of suggestions on how to manage the company better and even which products we feel more worth to build and sell. There are too many QAs and product managers.", "advice": "Provide more chances to let the employee to communicate with management to provide suggestions."}, {"title": "Worst Working Environment You Can Imagine", "text": "Pros Benefits, health insurance package and location Cons Company has been downsizing and very little advancement possible. No salary increases for over 5 years. If your looking to work for a company with long term growth this is not the place to be. The entire staff is worried about losing their jobs, rumours and buyouts. Company tried to sell years ago. Depending on who you work for, it can be a miserable experience. My director rarely was in the office and major discrimination prevailed. The worst working environment I've even seen. Promotions and increases in salary (rarely) were rarely based on productivity. Advice to Management Start looking at productivity of directors and employees in managment positions, their responsibilities and work hours. Many key people are rarely at work and have no clue what their employers are doing and don't seem to care unless a problem becomes apparent. Many are completely unaware of what is going on. I have rarely even spoken with my immediate supervisor except when receiving my annual review. My director was so lazy she just would hand me my review with no oral feedback at all. Incredable!! No incentives or reason to even perform in an acceptable manner. Incentives (the few given)were to all the wrong people . I swear my immediate supervisor must take over 200 days off each year and left early the other days she did show up for work. Discrimination galore, many employees (over 10 during my employment) left specifically from the company because of this. Its disgarceful for a company this size to operate this inefficiently and subjectively!", "rating": 1, "pros": "Benefits, health insurance package and location", "cons": "Company has been downsizing and very little advancement possible. No salary increases for over 5 years. If your looking to work for a company with long term growth this is not the place to be. The entire staff is worried about losing their jobs, rumours and buyouts. Company tried to sell years ago.", "advice": "Start looking at productivity of directors and employees in managment positions, their responsibilities and work hours. Many key people are rarely at work and have no clue what their employers are doing and don't seem to care unless a problem becomes apparent."}, {"title": "Objective observations from former manager", "text": "Pros It has a very laid back atmosphere during quiet times and fast-paced during release cycles. The co-workers were easy to get along with. Cons Entrenched upper management tends to stifle creativity. No company-wide salary increases since 2001. Decreasing health benefits. Layoff of vital employees. Some psycho managers ruin the work experience. The organization can be cliqueish. No cross-training of employees in case of excessive work demands. Company will not promote key employees until the key employees attempts to leave company. Advice to Management Perhaps address the issues in the downsides section and the company can actually achieve something formidable.", "rating": 3, "pros": "It has a very laid back atmosphere during quiet times and fast-paced during release cycles. The co-workers were easy to get along with.", "cons": "Entrenched upper management tends to stifle creativity. No company-wide salary increases since 2001. Decreasing health benefits. Layoff of vital employees. Some psycho managers ruin the work experience. The organization can be cliqueish. No cross-training of employees in case of excessive work demands. Company will not promote key employees until the key employees attempts to leave company.", "advice": "Perhaps address the issues in the downsides section and the company can actually achieve something formidable."}, {"title": "Steady Eddy Company.", "text": "Pros Stable work place environment throughout company. Cons No raises and no advancement opportunities Advice to Management Grow the business!! Open new office locations and shut office locations that are not selling. Hire office mgt. from other companies with real sales experience. Get a real marketing department. Put some makeup on WebFOCUS. Looks to be years behind the competition.", "rating": 1, "pros": "Stable work place environment throughout company.", "cons": "No raises and no advancement opportunities", "advice": "Grow the business!! Open new office locations and shut office locations that are not selling. Hire office mgt. from other companies with real sales experience. Get a real marketing department. Put some makeup on WebFOCUS. Looks to be years behind the competition."}, {"title": "Time for some fresh blood", "text": "Pros Potential buy out so hopefully some new direction soon Cons Poor Management, no vision or strategic direction Advice to Management Spend some money on company visibility and increase communications through to all employees", "rating": 1, "pros": "Potential buy out so hopefully some new direction soon", "cons": "Poor Management, no vision or strategic direction", "advice": "Spend some money on company visibility and increase communications through to all employees"}, {"title": "Good company to work for", "text": "Pros Good salary Good bonus system Interesting market Nice colleagues Cons It's a work hard pay hard organisation. If you don't get new customers there is a high change that you will not survive for long Advice to Management Keep up the good work", "rating": 5, "pros": "Good salary", "cons": "It's a work hard pay hard organisation. If you don't get new customers there is a high change that you will not survive for long", "advice": "Keep up the good work"}, {"title": "The always improving Information Builders", "text": "Pros Information Builders is constantly evolving, which in my opinion makes working here interesting. Updates like the website, branding and logo give me confidence that the company is keeping up with our competitors and the market. It gives me confidence that I am working for a forward thinking business. Cons More women in executive roles Advice to Management Keep up the fantastic mentoring!", "rating": 5, "pros": "Information Builders is constantly evolving, which in my opinion makes working here interesting. Updates like the website, branding and logo give me confidence that the company is keeping up with our competitors and the market. It gives me confidence that I am working for a forward thinking business.", "cons": "More women in executive roles", "advice": "Keep up the fantastic mentoring!"}, {"title": "Antiquated", "text": "Pros The size of the company is good - not so big that you don't know what's going on in other divisions, but not so small that you're doing everything yourself. Cons From both a systems and culture point of view, the company is antiquated and desperately needs updating. The people who have been there a long time refuse to change and make it difficult to modernize so anyone capabable to injecting innovation into the company quickly leaves. Advice to Management Bring in and support innovators", "rating": 3, "pros": "The size of the company is good - not so big that you don't know what's going on in other divisions, but not so small that you're doing everything yourself.", "cons": "From both a systems and culture point of view, the company is antiquated and desperately needs updating. The people who have been there a long time refuse to change and make it difficult to modernize so anyone capabable to injecting innovation into the company quickly leaves.", "advice": "Bring in and support innovators"}, {"title": "Great place to work!", "text": "Pros Great people and culture. Work hard, play hard. Great collaboration opportunities and team work internationally between regional teams and corporate head office. Opportunities to do great work with awesome people. Able to get involved in things outside your scope of work if you want to. Cons Still a very traditional company but phasing in change and transformation. Not always fast paced in action. Advice to Management Try new things , learn fail or win! Invest in people so they invest in you, the company. Always think globally, don't silo teams/people. Trust that everyone at IB has something valuable to add to the companies growth and future, and make them feel that no matter what they do, they are apart of that bigger picture.", "rating": 5, "pros": "Great people and culture.", "cons": "Still a very traditional company but phasing in change and transformation.", "advice": "Try new things , learn fail or win!"}, {"title": "Do yourself a favor and look elsewhere", "text": "Pros A few people are really good. Most of them are the short timers . Hopefully the new masters from Goldman will get rid of people who have been there for 20 plus years. Just read the other reviews to understand why. Cons Nothing new to add - Old guard set in their ways. No innovation until they are forced to play catchup. Thinking outside the the box is crushed immediately - too busy trying to make quota, which is perpetually out of reach. Very tough selling environment as the Tableau's are eating their lunch. SE's get thrown under the bus all the time. Pipeline is bare. Things got even worse (if that was even possible) after the latest 2017 Gartner report. Sales Engineers do not get to go to Sales Kickoff! - Need I say more. You have to walk on water to make your Bonus - consider yourself extremely lucky if you get to make 50% of your Bonus.  I recently saw a slide deck posted on slideshare - \"Top 10 Reasons to work at Information Builders\". After years of mistreating employees, it seems desperation is setting in as they were 11 sheets of pure fiction.  People have not gotten raises for years. Current employees can walk out the door and get at a MINIMUM 20 % salary increase. The company has no clue how to take care of their dedicated, underpaid employees and some are walking out the door. If you do get a call from a headhunter regarding their openings - it only means that the headhunter is desperate. Most good headhunters refuse to work with them. I talked to a few and heard nothing but complaints of being underpaid. If you still want to talk to them , ask them to supply you a copy of the comp (bonus/commission) plan before you put any effort into the interview process. - You will thank me later. Advice to Management Keep doing what you are doing. You are doing an awesome job of steering this downward spiral. Most of you would not know how to work anywhere else anyway - so enjoy it while it lasts.", "rating": 1, "pros": "A few people are really good. Most of them are the short timers . Hopefully the new masters from Goldman will get rid of people who have been there for 20 plus years. Just read the other reviews to understand why.", "cons": "Nothing new to add - Old guard set in their ways. No innovation until they are forced to play catchup. Thinking outside the the box is crushed immediately - too busy trying to make quota, which is perpetually out of reach. Very tough selling environment as the Tableau's are eating their lunch. SE's get thrown under the bus all the time. Pipeline is bare. Things got even worse (if that was even possible) after the latest 2017 Gartner report.", "advice": "Keep doing what you are doing. You are doing an awesome job of steering this downward spiral. Most of you would not know how to work anywhere else anyway - so enjoy it while it lasts."}, {"title": "Don't take that 20% raise unless you want to stuck here forever", "text": "Pros -Great place to retire or people more than 50 years old -Nice and friendly elderly people -Good hours (people show up at 10 or 11 and leave at 3 or 4) -Fair pay -Good location -Many people have worked here for more than 20 years and have no plan Cons -Their own language (a type of 4GL) has no future -No career growth (or you might want to wait till those people are retired) -Things you learned could only be applicable in the company, nowhere else -Shrinking client base (their main customers are those still using mainframe) -Lack of management communication -Many people work from home all the time -Low job market demand for their software suite", "rating": 3, "pros": "-Great place to retire or people more than 50 years old", "cons": "-Their own language (a type of 4GL) has no future", "advice": null}, {"title": "Account Manager", "text": "Pros Good company athmosphere, technology with some value differences that helps in the sale. Cons Old fashion marketing. Some of the managment is Jurasic and that's translates to the company choices.", "rating": 5, "pros": "Good company athmosphere, technology with some value differences that helps in the sale.", "cons": "Old fashion marketing. Some of the managment is Jurasic and that's translates to the company choices.", "advice": null}, {"title": "After a few years", "text": "Pros There is a real family culture at Information Builders, which can be seen as good or bad. Personally I see it as a big plus. People tend to either leave quickly or stay for a very long time.You get as much responsibility as can handle and are treated fairly. Cons At times things get done in a certain way because people have been doing them like that for a long time. It can be very hard to break this viscous circle. As such it can take a long time for seemingly trivial things to be agreed upon and executed against. Advice to Management Create a culture where people feel more empowered to bring ideas and review them seriously, a bad idea 5 years ago might be worth executing against today.", "rating": 3, "pros": "There is a real family culture at Information Builders, which can be seen as good or bad. Personally I see it as a big plus. People tend to either leave quickly or stay for a very long time.You get as much responsibility as can handle and are treated fairly.", "cons": "At times things get done in a certain way because people have been doing them like that for a long time. It can be very hard to break this viscous circle. As such it can take a long time for seemingly trivial things to be agreed upon and executed against.", "advice": "Create a culture where people feel more empowered to bring ideas and review them seriously, a bad idea 5 years ago might be worth executing against today."}, {"title": "I worked at Information Builders Full-Time", "text": "Pros Good flexible products: You can do basic visualizations or very complex scenarios to show insights on your company's performance at every level. Cons Although improving and getting there, there is still a old school mentality and culture. A lot of people have been there for so long that they tend to prioritize their own needs as opposed to their customer's. Advice to Management Treat ALL of your employees with respect and fairness. Listen to them: They have great ideas... Especially the new hires...", "rating": 3, "pros": "Good flexible products: You can do basic visualizations or very complex scenarios to show insights on your company's performance at every level.", "cons": "Although improving and getting there, there is still a old school mentality and culture. A lot of people have been there for so long that they tend to prioritize their own needs as opposed to their customer's.", "advice": "Treat ALL of your employees with respect and fairness. Listen to them: They have great ideas... Especially the new hires..."}, {"title": "Very Old School", "text": "Pros Friendly environment. Privately owned so for Sales team, not the constant pressure to hit quarterly goals and not as much regulation on revenue structure. Cons Lots of group-think mentality led by people who are afraid of or uninterested in change. Slow response to market changes is really hurting the company. Advice to Management Bring in some new blood.", "rating": 3, "pros": "Friendly environment. Privately owned so for Sales team, not the constant pressure to hit quarterly goals and not as much regulation on revenue structure.", "cons": "Lots of group-think mentality led by people who are afraid of or uninterested in change. Slow response to market changes is really hurting the company.", "advice": "Bring in some new blood."}, {"title": "exp of 1 year", "text": "Pros offers a work life balance Cons offers no salary hike for fresher Advice to Management increase salary", "rating": 3, "pros": "offers a work life balance", "cons": "offers no salary hike for fresher", "advice": "increase salary"}, {"title": "Best Decision I have ever made was to join this company!", "text": "Pros Career growth available Job Flexibility Work/Personal Balance Reward for Hard Work Great people Cons Career growth within Sales Offices limited", "rating": 5, "pros": "Career growth available", "cons": "Career growth within Sales Offices limited", "advice": null}, {"title": "Flaky middle management throughout entire organisation", "text": "Pros Welcoming when you first join, good product suite, nice people to work with, a respected company within the industry. Outstanding CEO. Cons Poor product training, disorganized and unprofessional. Solution set dated in comparison to competitors, technology not native - using third party vendors despite claims that technology is developed in-house. Poor Implementation performance Middle management out of touch with reality. Advice to Management Clear out the dead wood and move with the times.", "rating": 3, "pros": "Welcoming when you first join, good product suite, nice people to work with, a respected company within the industry. Outstanding CEO.", "cons": "Poor product training, disorganized and unprofessional.", "advice": "Clear out the dead wood and move with the times."}, {"title": "Interesting company", "text": "Pros Nice colleagues. Interesting task's and good place to work. Very deep experience among the staff. Cons Periodically more intensive work schedule", "rating": 5, "pros": "Nice colleagues. Interesting task's and good place to work. Very deep experience among the staff.", "cons": "Periodically more intensive work schedule", "advice": null}, {"title": "IBI", "text": "Pros good products Unlimited opportunity creative pricing Cons everyday is groundhogs day....living it over and over again competitors don't view them as a competitor", "rating": 5, "pros": "good products", "cons": "everyday is groundhogs day....living it over and over again", "advice": null}, {"title": "Only go if you know the people in the know.", "text": "Pros independent, privately owned - family owned company feel (not big public corporation culture) with big boy money to back it up. Big Data is big now, so good IT niche to be in. Cons Good old boys club. Most of the bosses/management are old school networked together people that have been there for a long time. Most came from Boeing/McDonnell Douglas as IT people and now are in sales/managment roles. Not the best training or ongoing support - mostly sink or swim and most sink. Small company in a niche where it has been consolidated down to the big boys mostly. They're struggling to survive and stay afloat in a sea of big sharks/competitors. If you're wanting to get into their outside sales role which pays six figures you'd best be a great internal politician, very good looking, a college athlete, president of sorority/fraternity when in college, and know people internally and get networked well. Most everyone in my office knew someone already there from family, high school, or college is how they got in.", "rating": 1, "pros": "independent, privately owned - family owned company feel (not big public corporation culture) with big boy money to back it up.", "cons": "Good old boys club. Most of the bosses/management are old school networked together people that have been there for a long time. Most came from Boeing/McDonnell Douglas as IT people and now are in sales/managment roles. Not the best training or ongoing support - mostly sink or swim and most sink.", "advice": null}, {"title": "Does not reach its potential", "text": "Pros Great technology Hard working teams Job autonomy Impressive projects Cons Poor US management: operational, micro managers with lack of strategic ability Company is devaluing as it has been run the same way for too long No structural salary increases in 5 years No good at fixing problems Advice to Management Replace yourselves", "rating": 3, "pros": "Great technology", "cons": "Poor US management: operational, micro managers with lack of strategic ability", "advice": "Replace yourselves"}, {"title": "Inmates running the ...", "text": "Pros Hours were reasonable. Limited travel requirements. Cons Lack of any leadership. Very little demonstration of ethical behavior. Advice to Management Lead by example. Make the tough call once in a while This is not the place for politics.", "rating": 1, "pros": "Hours were reasonable. Limited travel requirements.", "cons": "Lack of any leadership. Very little demonstration of ethical behavior.", "advice": "Lead by example. Make the tough call once in a while This is not the place for politics."}, {"title": "Account Executive", "text": "Pros Most staff will go way out of their way to help Above average comp plan if you are one of the fortunate reps with some good customers Very loyal customer base Customer Facing applications are their sweet spot--find these opps and you can do well Cons Disfunctional family--though many do well in this environment Easy to starve even if you're working hard Most products are dated, adding more difficulty selling Company somewhat stuck in the middle-- though Visionary in GartnerMQ it doesn't have the scale to compete well on large projects against the big stacks nor the product 'pizazz' to compete well against Niche players. Professional Services needs to work better with sales Too much emphasis on sales rep metrics Way too much time wasted battling Accounting to get expenses reimbursed. Spend a dollar to save a dime. Advice to Management Invest more to update your products. Manage less by metrics, metrics, metrics. CEO is nice guy but a techie not a visionary, add more visionary people at top and give more leeway", "rating": 3, "pros": "Most staff will go way out of their way to help", "cons": "Disfunctional family--though many do well in this environment", "advice": "Invest more to update your products."}, {"title": "It is what you make of it.", "text": "Pros Plenty of people have come on board with one job description and made a move to a different line of work. Good for administrators who want to move into sales, technical people who would like to move into marketing or sales, etc. Cons The top level never changes. If you don't come here with a VP title, it's unlikely you'll get one. Not ruthless enough about getting rid of dead wood. Advice to Management Get rid of dead wood. Be less averse to change. Hire people who think more strategically in products, sales, and marketing.", "rating": 5, "pros": "Plenty of people have come on board with one job description and made a move to a different line of work. Good for administrators who want to move into sales, technical people who would like to move into marketing or sales, etc.", "cons": "The top level never changes. If you don't come here with a VP title, it's unlikely you'll get one. Not ruthless enough about getting rid of dead wood.", "advice": "Get rid of dead wood. Be less averse to change. Hire people who think more strategically in products, sales, and marketing."}, {"title": "It was interesting but hard one", "text": "Pros reasonable place for fresh graduates it is the suitable place for graduates of the faculty of arts and education. there are nice people there from the administration and teaching staff. Cons salaries are very low the salary is given at the tenth of every month Advice to Management develop your organization", "rating": 3, "pros": "reasonable place for fresh graduates", "cons": "salaries are very low", "advice": "develop your organization"}, {"title": "lack of management, no leadership, no growth", "text": "Pros 1) The benefits are ok. 2) Flexible hours. 3) Earn money while working 7-hours (or less!) a day. 4) The location is ok. Overall, it is a good place to work for if you are looking to earn some extra bucks before retiring in the next couple of years. Cons 1) No innovation and quality control for the past decade. 2) No training nor assistance from the company if you want to learn and grow. 3) Top heavy bureaucratic seniority-based promotion system. No long term career prospect if you are young and/or new to the company. 4) Nepotism. 5) Old school boys club style of management - if you are not part of the club, you could face discrimination, retaliation, bullying, sabotage. 6) No bonus or reward unless you are in the boys club. 7) No transparency in the management operations. 8) No functioning HR. 9) No energy nor excitement in the office. The bottom line, if you are an intelligent, innovative, effective young professional, there is no career growth. Advice to Management Advising management is no use.", "rating": 1, "pros": "1) The benefits are ok.", "cons": "1) No innovation and quality control for the past decade.", "advice": "Advising management is no use."}, {"title": "Nepotism Everywhere...", "text": "Pros 1) Nice colleagues 2) Getting your salary on time 3) Access to senior technical staff if deal is deemed important 4) Good technology Cons 1) Senior Management doesn't performance monitor management 2) Staff gets hired withour proper background check 3) No formal performance review 4) Management takes aaaaages to make decisions 5) Bad communication from management to employees Advice to Management 1) Get some fresh ideas 2) Performance monitor senior management instead of patting each others back for mediocre performance", "rating": 3, "pros": "1) Nice colleagues", "cons": "1) Senior Management doesn't performance monitor management", "advice": "1) Get some fresh ideas"}, {"title": "Frustrating", "text": "Pros Fantastic Software. The company is a technical leader. Cons Weak marketing. They understand what their customers want for upgrades, but IBI doesn't understand strategic marketing and how that relates to sales. Advice to Management Please invest in better product marketing. The customers need to be segmented and the value defined for each group of buyers. Then, have that flow through lead generation, sales and delivery. Right now, it's a technology company, not a marketing company.", "rating": 3, "pros": "Fantastic Software. The company is a technical leader.", "cons": "Weak marketing. They understand what their customers want for upgrades, but IBI doesn't understand strategic marketing and how that relates to sales.", "advice": "Please invest in better product marketing. The customers need to be segmented and the value defined for each group of buyers. Then, have that flow through lead generation, sales and delivery. Right now, it's a technology company, not a marketing company."}, {"title": "Good environment and compensation/benefits, and understanding management", "text": "Pros The company attracts good people, very helpful and friendly. The office amenities are good, as is the compensation and benefits package. Cons A little more attention is needed towards employee career growth and training / education. There is a technical barrier for business oriented staff that is hard to cross with personal effort alone. For Canadian office employees, especially consultants, there can be quite a bit of travel, especially to the USA.", "rating": 5, "pros": "The company attracts good people, very helpful and friendly. The office amenities are good, as is the compensation and benefits package.", "cons": "A little more attention is needed towards employee career growth and training / education. There is a technical barrier for business oriented staff that is hard to cross with personal effort alone. For Canadian office employees, especially consultants, there can be quite a bit of travel, especially to the USA.", "advice": null}, {"title": "Information Builders promotes a culture that motivates personal ambition to drive performance", "text": "Pros Ability to learn and grow, encourages employees to come up with and promote ideas, flexible/family-oriented culture Cons In some cases, does not adapt to industry trends and changes, as quickly as some employees would like", "rating": 5, "pros": "Ability to learn and grow, encourages employees to come up with and promote ideas, flexible/family-oriented culture", "cons": "In some cases, does not adapt to industry trends and changes, as quickly as some employees would like", "advice": null}, {"title": "Once a leader, now a reluctant follower. I think the current management team ran out of ideas (in the 90's).", "text": "Pros Great location and very easy going work atmosphere. If you want a job were you come in do your days work and go home, then you can choose this company or the MTA. Great depth of experience (I would guess the average age is 50+ and average tenure is in the 10 - 15 year range). Cons Very frustrating if you are interested in technology. Terrible management team (I don't mean to be offensive but they are horrible). Many are home grown, who have no idea about the real world, which is o.k. but they also show no interest in the real world either.. No investment (or real interest) in staff development. Micromanagement to the level of insanity, which doesn't help employee development. Morale is very low, staff confidence in management is non-existent. Although the company believes they are interested in the customer, it is not reflected in the way some of them are treated. I think the main problem is that they are stuck somewhere between the 80's and the 90's where general usage of IT was no where near as high as it is now. They are uncomfortable in the \"new landscape\" where pretty much every consumer is tech savvy and have much higher expectations of technology products. Advice to Management Some of you have to take early retirement. You must accept that your attempts (which I'm sure are honest) to help the company grow are just wrong. Invest in ideas, create a landscape where small empowered teams are allowed to evolve the product to new plateaus and allow yourself to be surprised by what they come up with. Accept that you are older than your customer base and their expectations are completely different to what you believe they should be. Devolve some of your internal empires and rigid management structure, in fact flatten the structure completely. Create an infrastructure that allows innovators to evolve and reward them when they succeed and nurture them when they fail. Find visionaries who are bold and inventive. But before you can do any of this, old attitudes to management, nepotistic employment tactics and crazy empire building strategies need to be nipped in the bud. Time to re-invent yourself.. The good news is, is that you'll be surprised how many people (who do not go to the management meetings) will support you. Good luck..", "rating": 3, "pros": "Great location and very easy going work atmosphere. If you want a job were you come in do your days work and go home, then you can choose this company or the MTA. Great depth of experience (I would guess the average age is 50+ and average tenure is in the 10 - 15 year range).", "cons": "Very frustrating if you are interested in technology. Terrible management team (I don't mean to be offensive but they are horrible). Many are home grown, who have no idea about the real world, which is o.k. but they also show no interest in the real world either.. No investment (or real interest) in staff development. Micromanagement to the level of insanity, which doesn't help employee development. Morale is very low, staff confidence in management is non-existent. Although the company believes they are interested in the customer, it is not reflected in the way some of them are treated. I think the main problem is that they are stuck somewhere between the 80's and the 90's where general usage of IT was no where near as high as it is now. They are uncomfortable in the \"new landscape\" where pretty much every consumer is tech savvy and have much higher expectations of technology products.", "advice": "Some of you have to take early retirement. You must accept that your attempts (which I'm sure are honest) to help the company grow are just wrong. Invest in ideas, create a landscape where small empowered teams are allowed to evolve the product to new plateaus and allow yourself to be surprised by what they come up with. Accept that you are older than your customer base and their expectations are completely different to what you believe they should be. Devolve some of your internal empires and rigid management structure, in fact flatten the structure completely. Create an infrastructure that allows innovators to evolve and reward them when they succeed and nurture them when they fail. Find visionaries who are bold and inventive. But before you can do any of this, old attitudes to management, nepotistic employment tactics and crazy empire building strategies need to be nipped in the bud. Time to re-invent yourself.. The good news is, is that you'll be surprised how many people (who do not go to the management meetings) will support you. Good luck.."}, {"title": "good place to coast. no potential to grow. company is losing out to competition", "text": "Pros good work life balance decent product in very niche markets generally happy customers well positioned in the smb space privately held and many employees have been around for a long time Cons always behind industry curve growth has traditionally been flat poor quality products. very often half baked products are expected to be sold. product support sucks. very poor documentation. little investment towards product development and new feature development Advice to Management invest invest invest in product developement. Sales and mktg can only get you the first opportunity. aim for repeat customers", "rating": 3, "pros": "good work life balance", "cons": "always behind industry curve", "advice": "invest invest invest in product developement. Sales and mktg can only get you the first opportunity. aim for repeat customers"}, {"title": "very good start career and good team", "text": "Pros very friendly and family like env. Cons it is little bit small team Advice to Management there is no advice", "rating": 3, "pros": "very friendly and family like env.", "cons": "it is little bit small team", "advice": "there is no advice"}, {"title": "Where's next", "text": "Pros Easy to get by. If you keep your head down and mouth shut, you're ok. Technology could be very interesting. Used to be a really fun company.. Cons It's the ultimate old boys club. Everything thats wrong about nepotism is at Information Builders. The company, the product, the management team are all stuck in the 90's. HR is non-existent. Management are just holding on to their jobs for dear life. No career path for anyone new or with new ideas. The same people are getting promoted (for payrises that no one else gets). The most imaginative thing I've seen them do to inspire staff is to buy them pizza. Oh yeah and they have a real thick glass ceiling. Advice to Management The management team have to look at themselves and be realistic. You run a top heavy team. The people around you are telling you what you want to hear, not what you need to hear. You are failing your staff and your product pedigree. My advice.. Hire an outside consulting firm and listen to what they have to say. Also try retiring some of your management team, they are holding you back (and not just the ones near retirement).", "rating": 3, "pros": "Easy to get by. If you keep your head down and mouth shut, you're ok. Technology could be very interesting. Used to be a really fun company..", "cons": "It's the ultimate old boys club. Everything thats wrong about nepotism is at Information Builders. The company, the product, the management team are all stuck in the 90's. HR is non-existent. Management are just holding on to their jobs for dear life. No career path for anyone new or with new ideas. The same people are getting promoted (for payrises that no one else gets). The most imaginative thing I've seen them do to inspire staff is to buy them pizza. Oh yeah and they have a real thick glass ceiling.", "advice": "The management team have to look at themselves and be realistic. You run a top heavy team. The people around you are telling you what you want to hear, not what you need to hear. You are failing your staff and your product pedigree."}, {"title": "For a Sales rep, it comes down to who you directly report to", "text": "Pros Great people, great product, can craft deals Cons Micromanagement in some offices. Limited marketing. Be prepared to do your own marketing. Advice to Management Weed out the deadwood in middle management.", "rating": 3, "pros": "Great people, great product, can craft deals", "cons": "Micromanagement in some offices. Limited marketing. Be prepared to do your own marketing.", "advice": "Weed out the deadwood in middle management."}, {"title": "A star that burnt out a long time ago.", "text": "Pros Easy place to work. Hard to get fired. Great location (NYC) The people on the ground are a good bunch. Loyal customers. Cons Management is awful, HR is laughable, it's nepotism gone wild at an old boys club. QA is very weak and also has no power. Product mgmt is non-existent and are glorified QA/Customer support people. No standards and procedures for development, QA or PM, which means that the biggest bullies win (which is a mgmt style in IBI). No mentoring or plan to build a new generation of mgmt (remember that this company is nearly 35 years old). Advice to Management Advising management doesn't work..", "rating": 3, "pros": "Easy place to work.", "cons": "Management is awful, HR is laughable, it's nepotism gone wild at an old boys club. QA is very weak and also has no power. Product mgmt is non-existent and are glorified QA/Customer support people. No standards and procedures for development, QA or PM, which means that the biggest bullies win (which is a mgmt style in IBI). No mentoring or plan to build a new generation of mgmt (remember that this company is nearly 35 years old).", "advice": "Advising management doesn't work.."}, {"title": "A 'safe' option", "text": "Pros Great people. Friendly team. Good benefits and compensation package. Good marketing and presentation materials and great customer case studies. Corporate slide deck actually stands up to scrutiny! Cons Difficult to sell in a crowded and increasingly commodotised marketplace. All the big stack vendors now have BI in their product suite, so buying from a little-known independant vendor could be perceived as a risk. Very old fashioned, and aging management team. Advice to Management Bring in some new blood, don't be afraid to take a more aggressive approach. Don't play it safe so much, and spend some money on better corporate fixtures and fittings!", "rating": 5, "pros": "Great people. Friendly team. Good benefits and compensation package. Good marketing and presentation materials and great customer case studies. Corporate slide deck actually stands up to scrutiny!", "cons": "Difficult to sell in a crowded and increasingly commodotised marketplace. All the big stack vendors now have BI in their product suite, so buying from a little-known independant vendor could be perceived as a risk. Very old fashioned, and aging management team.", "advice": "Bring in some new blood, don't be afraid to take a more aggressive approach. Don't play it safe so much, and spend some money on better corporate fixtures and fittings!"}, {"title": "Don't do it, don't accept that offer, you will be sorry!!!", "text": "Pros Great product, great peoople in the rank and file, all trying to do a good job. Cons Worst sales management I have seen in 21 years - micrmanagement to the max, completely inflexible, claim to be focused on client relationships, but it is really a telemarketing job! If you have any experience at all, be prepared to become a robot! You will be told what to do, when to do it, how often to do it and when you are done, what you did wrong! Advice to Management Hire the right people and let them do their job!", "rating": 1, "pros": "Great product, great peoople in the rank and file, all trying to do a good job.", "cons": "Worst sales management I have seen in 21 years - micrmanagement to the max, completely inflexible, claim to be focused on client relationships, but it is really a telemarketing job! If you have any experience at all, be prepared to become a robot! You will be told what to do, when to do it, how often to do it and when you are done, what you did wrong!", "advice": "Hire the right people and let them do their job!"}, {"title": "Some plusses, but a tough place to consistently make good money", "text": "Pros - good quality of co-workers - good HQ presence (5th Ave, NYC) - good to average benefits - capable management team Cons - not enough support for field reps from HQ - salary structure below average for the space - goals can be unrealistic Advice to Management The product messaging is fine, but many of the success stories are woefully out of date. The company seems to maintaining inertia on the clients from 10+ years ago.", "rating": 3, "pros": "- good quality of co-workers", "cons": "- not enough support for field reps from HQ", "advice": "The product messaging is fine, but many of the success stories are woefully out of date. The company seems to maintaining inertia on the clients from 10+ years ago."}, {"title": "Stagnated growth in an industry that has evolved beyond their leadership capabilities.", "text": "Pros Great internal support and communication. Most product managers seem genuinely interested in making sure sales branches are successful in the field. If you are a pre-sales person and you have proven yourself, you can stay on board forever (literally). Will give you time to ramp up if you are a rep, but not much. Cons Where to start? Sales management consists of people that stumbled up through the ranks with no real management experience or training. Unprofessional, outdated, and useless sales tactics (i.e. \"you know, the price goes up if you don't buy at the end of the quarter\"). Severe lack of inside sales support for the account executives. SE ranks consist of many professional people, but they are not all sales-savvy. As in, putting examples in demos within business terms. Focus on what the customer NEEDS to solve their business problems, not all the bells and whistles. SEs are compensated in the old Communist model: if the sales branch does well, you get bonus. If not, no bonus. After 34 years in business, nobody in the marketplace knows who Information Builders is from a brand perspective. This lack of brand recognition and zero inside sales support makes it extremely difficult to build a book of business. Advice to Management Let the AEs do what they do best: sell in person by going on sales calls, not spending hours on the phone. Split that effort with inside sales, it's a no brainer. Comp Sales Engineers in line with the deals THEY help close via demo and pursuit. Stop with the shared revenue model, it's from 1982. Build a REAL channels strategy and let your partners sell the SMB market for you. Concentrate on high end customers. Develop a real consulting partner strategy like all the big guys. Provide real mentoring to your sales reps, especially those that enter in from the outside or from other ranks within the company. Fire your marketing team. Nobody knows who you are. Hire an outside firm and recast yourself in a different light. Gerry, become Chairman of the Board and bring in a real CEO. Your company will not grow while you are in control.", "rating": 3, "pros": "Great internal support and communication. Most product managers seem genuinely interested in making sure sales branches are successful in the field. If you are a pre-sales person and you have proven yourself, you can stay on board forever (literally). Will give you time to ramp up if you are a rep, but not much.", "cons": "Where to start? Sales management consists of people that stumbled up through the ranks with no real management experience or training. Unprofessional, outdated, and useless sales tactics (i.e. \"you know, the price goes up if you don't buy at the end of the quarter\"). Severe lack of inside sales support for the account executives.", "advice": "Let the AEs do what they do best: sell in person by going on sales calls, not spending hours on the phone. Split that effort with inside sales, it's a no brainer."}, {"title": "Old ways, heavy spending by marketing and sales and nuts for the rest of the company.", "text": "Pros Easy environment, some decent people, technology okay as long as you stay away from core products. Great 9-5 job. Wonderful location and a large company with the ability to change positions in the company if you so desire. Cons Upper Management needs to go. Ridiculous spending by the marketing and sales team while company freezes salaries for years at a time. Favoritism and office politics galore. Crazy management that gets more and more 'interesting' as you go up the org chart. Its an experience for sure. Advice to Management You've lead the company very far, but it is time to let go and let some other fresh blood steer the company into the new millennium.", "rating": 3, "pros": "Easy environment, some decent people, technology okay as long as you stay away from core products. Great 9-5 job. Wonderful location and a large company with the ability to change positions in the company if you so desire.", "cons": "Upper Management needs to go. Ridiculous spending by the marketing and sales team while company freezes salaries for years at a time. Favoritism and office politics galore. Crazy management that gets more and more 'interesting' as you go up the org chart. Its an experience for sure.", "advice": "You've lead the company very far, but it is time to let go and let some other fresh blood steer the company into the new millennium."}]