[{"title": "Analytics", "text": "Pros I was lucky to work with a wonderful boss, who led the team with a lot of creativity. We have flexible work hours and also a lot of fun, as long as we delivered on deadlines Cons As with any agency, there are a lot of ups and downs, and time where we have to stay up late or work the weekends to finish a client's request", "rating": 5, "pros": "I was lucky to work with a wonderful boss, who led the team with a lot of creativity. We have flexible work hours and also a lot of fun, as long as we delivered on deadlines", "cons": "As with any agency, there are a lot of ups and downs, and time where we have to stay up late or work the weekends to finish a client's request", "advice": null}, {"title": "Media Planner", "text": "Pros Paid Time Off Summer Days Floating Holiday Coworkers Cons Long hours Excessive workload Short deadlines Stressful Too many clients to manage Advice to Management n/a", "rating": 3, "pros": "Paid Time Off", "cons": "Long hours", "advice": "n/a"}, {"title": "Runaway train", "text": "Pros Nice people, opportunities to get to know other colleagues, good communications Cons Global and US CEOs are not strong leaders. There is so much hypocrisy and double standards. If you're not an Australian guy, then there is no future for your here. All leadership bends to the whims of the global CEO and it is a recipe for disaster. Advice to Management There is no advice to share for a leadership team that does not care about its people.", "rating": 1, "pros": "Nice people, opportunities to get to know other colleagues, good communications", "cons": "Global and US CEOs are not strong leaders. There is so much hypocrisy and double standards. If you're not an Australian guy, then there is no future for your here. All leadership bends to the whims of the global CEO and it is a recipe for disaster.", "advice": "There is no advice to share for a leadership team that does not care about its people."}, {"title": "Associate", "text": "Pros Great coworkers, accepting environment, room to grow, work/life balance excellent Cons Small salary for lower-level jobs", "rating": 5, "pros": "Great coworkers, accepting environment, room to grow, work/life balance excellent", "cons": "Small salary for lower-level jobs", "advice": null}, {"title": "3 years later, still love it here", "text": "Pros People care about each other - truly. Scrappy, start-up-like mentality and vibe. Interesting work. Ability to shift roles based on your expertise. Bagel Fridays Cons Hours can be long, not more than industry standard though. Advice to Management Keep fostering young talent -- loyalty will ensue", "rating": 5, "pros": "People care about each other - truly. Scrappy, start-up-like mentality and vibe. Interesting work. Ability to shift roles based on your expertise. Bagel Fridays", "cons": "Hours can be long, not more than industry standard though.", "advice": "Keep fostering young talent -- loyalty will ensue"}, {"title": "Contract Recruiter", "text": "Pros Excellent managers Dawn Serra, and Violet Moore. Great hiring managers who valued my opinion, and collared with me in the hiring process. Good morale, and fun events. Cons None that I can think of. Advice to Management A couple of managers did not promote their jobs.", "rating": 5, "pros": "Excellent managers Dawn Serra, and Violet Moore. Great hiring managers who valued my opinion, and collared with me in the hiring process. Good morale, and fun events.", "cons": "None that I can think of.", "advice": "A couple of managers did not promote their jobs."}, {"title": "Senior Comms Design", "text": "Pros Good people and culture. Training is always available and nice to take advantage of. Cons teams are quite segmented and have very little interaction with another Advice to Management give people the opportunity to learn from other teams", "rating": 5, "pros": "Good people and culture. Training is always available and nice to take advantage of.", "cons": "teams are quite segmented and have very little interaction with another", "advice": "give people the opportunity to learn from other teams"}, {"title": "Director", "text": "Pros Eager team Interesting approach to cultural branding Cons Tools are not all entirely real just yet Needs more new accounts in the pipeline Bench strength at all levels Advice to Management Need to uplevel the team, and to ensure bench strength is there, for possible rotations", "rating": 3, "pros": "Eager team", "cons": "Tools are not all entirely real just yet", "advice": "Need to uplevel the team, and to ensure bench strength is there, for possible rotations"}, {"title": "Director", "text": "Pros Eager team Strong mid-tier members Interesting approach to cultural branding Cons A new process that is still trying to get off the ground", "rating": 3, "pros": "Eager team", "cons": "A new process that is still trying to get off the ground", "advice": null}, {"title": "Leadership doesn't care about employees", "text": "Pros Some good talent, good perks, part of Mediabrands so access to specialty talent Cons Leadership does not care about junior staff. Even though Mediabrands promotes flexibility across the organization, leadership at Initiativebwill ban you from changing brands, they would rather see you leave. Very little communication, town halls are just repetitive. Even with low Internal NPS scores, little is done to change culture. No response to staff complaints about senior management issues. Teams are understaffed and overworked with no effort to improve. Advice to Management Care more about your employees, staff your accounts better, and focus on improving culture", "rating": 3, "pros": "Some good talent, good perks, part of Mediabrands so access to specialty talent", "cons": "Leadership does not care about junior staff. Even though Mediabrands promotes flexibility across the organization, leadership at Initiativebwill ban you from changing brands, they would rather see you leave. Very little communication, town halls are just repetitive. Even with low Internal NPS scores, little is done to change culture. No response to staff complaints about senior management issues. Teams are understaffed and overworked with no effort to improve.", "advice": "Care more about your employees, staff your accounts better, and focus on improving culture"}, {"title": "group account manager", "text": "Pros Certain planning tools. Certain departments. Cons Senior management has a revolving door. No longevity. Vision gets lost. Has cut to the bone for certain staff positions. Some departments staffed too lean. Advice to Management Find the right people, find the vision and strive to it. Stop the on-going changes and revolving door.", "rating": 3, "pros": "Certain planning tools. Certain departments.", "cons": "Senior management has a revolving door. No longevity. Vision gets lost. Has cut to the bone for certain staff positions. Some departments staffed too lean.", "advice": "Find the right people, find the vision and strive to it. Stop the on-going changes and revolving door."}, {"title": "Long Hours and High Stress", "text": "Pros None, looks good on resume I suppose. Cons Media Planning jobs have always been the worst experiences in my life, and this was no different. Long hours for little pay--no overtime pay. Stay away from this industry.", "rating": 1, "pros": "None, looks good on resume I suppose.", "cons": "Media Planning jobs have always been the worst experiences in my life, and this was no different. Long hours for little pay--no overtime pay. Stay away from this industry.", "advice": null}, {"title": "Associate", "text": "Pros Good place to get your feet in the door Cons Teams may be silo'd at times", "rating": 5, "pros": "Good place to get your feet in the door", "cons": "Teams may be silo'd at times", "advice": null}, {"title": "Assistant media buyer", "text": "Pros Great culture and events. Lots of days off Cons Staffing is a huge issue. Advice to Management hire more people", "rating": 3, "pros": "Great culture and events. Lots of days off", "cons": "Staffing is a huge issue.", "advice": "hire more people"}, {"title": "Digital partnerships", "text": "Pros Office space and people and/or team Cons Salaries and advancement timing needs to improve", "rating": 3, "pros": "Office space and people and/or team", "cons": "Salaries and advancement timing needs to improve", "advice": null}, {"title": "Great place to learn a lot!", "text": "Pros The work is challenging yet rewarding in that you are tossed into the fire very quickly and you learn a lot. Great place to get familiar with the media/advertising industry as you get exposed to and get to work with lots of different teams and parts of the business. Additionally, Initiative has a lot of corporate resources under the IPG umbrella so taking advantage of their trainings and courses is also a huge plus when trying to expand your knowledge and skillset. Cons It's the agency life baby! You work long hours, get ground to dust and if you're unlucky enough you'll be stuck putting out fires most of the time with endless client fire drills and their demanding untimely requests. Reality is turnover can be high because people get burnt out and work/life balance varies from account to account but this is standard. Advice to Management The rebrand is cool, the agency seems to have become a bit more cohesive especially with the work-showcases every couple months. The culture is growing slowly but surely; keep it up.", "rating": 5, "pros": "The work is challenging yet rewarding in that you are tossed into the fire very quickly and you learn a lot. Great place to get familiar with the media/advertising industry as you get exposed to and get to work with lots of different teams and parts of the business. Additionally, Initiative has a lot of corporate resources under the IPG umbrella so taking advantage of their trainings and courses is also a huge plus when trying to expand your knowledge and skillset.", "cons": "It's the agency life baby! You work long hours, get ground to dust and if you're unlucky enough you'll be stuck putting out fires most of the time with endless client fire drills and their demanding untimely requests. Reality is turnover can be high because people get burnt out and work/life balance varies from account to account but this is standard.", "advice": "The rebrand is cool, the agency seems to have become a bit more cohesive especially with the work-showcases every couple months. The culture is growing slowly but surely; keep it up."}, {"title": "Great to Start", "text": "Pros Experience fast paced, fully integrated multi channel environment Cons Need improvement with upper management Advice to Management Organization/Mentorship needed", "rating": 3, "pros": "Experience fast paced, fully integrated multi channel environment", "cons": "Need improvement with upper management", "advice": "Organization/Mentorship needed"}, {"title": "Mediocre At Best!", "text": "Pros Office Space People Location Free Coffee Bar Beer Garden Cons Lack of career growth Lost of clients", "rating": 3, "pros": "Office Space", "cons": "Lack of career growth", "advice": null}, {"title": "Financial Analyst", "text": "Pros Culture of the company is amazing. Very laid back. Cons The job is very fast paced. You need to keep up with the daily ad hoc requests. Also, there's no real team structure.", "rating": 3, "pros": "Culture of the company is amazing. Very laid back.", "cons": "The job is very fast paced. You need to keep up with the daily ad hoc requests. Also, there's no real team structure.", "advice": null}, {"title": "Beware - get ready to compete in a show off competition", "text": "Pros Cool office space, lots of free beer, free coffee. Cons Snobby attitude, egomaniacs, cliquey groups, people talk about each other constantly. Everyone is trying to prove they are smarter than everyone else. Advice to Management Send a serious crackdown message to upper mgmt about how employees should be treated. Play fair. Don't show favoritism. Stop with the double standards. If one employee is wrong for doing something, the next should not be held to a different standard.", "rating": 3, "pros": "Cool office space, lots of free beer, free coffee.", "cons": "Snobby attitude, egomaniacs, cliquey groups, people talk about each other constantly. Everyone is trying to prove they are smarter than everyone else.", "advice": "Send a serious crackdown message to upper mgmt about how employees should be treated. Play fair. Don't show favoritism. Stop with the double standards. If one employee is wrong for doing something, the next should not be held to a different standard."}, {"title": "Great team environment", "text": "Pros Excellent professional environment that fosters team building and leadership skills. Cons Turn over is fairly high", "rating": 5, "pros": "Excellent professional environment that fosters team building and leadership skills.", "cons": "Turn over is fairly high", "advice": null}, {"title": "Inconsistent Experinces", "text": "Pros -Perks -Office is incredible (NYC) -Great accounts to work on -People are great -VERY generous with expensing transportation, food etc when working after hours or are attending work events. Cons -Hours were insane -High turnover -Team organization changed constantly -INCONSISTENT depending on client/team: some teams worked decent hours, while others were VERY under-staffed and worked very, very late on a regular basis.", "rating": 3, "pros": "-Perks", "cons": "-Hours were insane", "advice": null}, {"title": "Terrible company losing clients", "text": "Pros Young office with a lot of recent grads Typical perks that come with working in media Beer Garden Some cool clients Pretty good about letting you take time off Promotions cycle is pretty clear Cons Horrible pay-- below industry standard (even for media) and they won't let you negotiate. HR is joke and a half-- When we were looking to hire a new team member they just dumped 50 resumes in my email without prescreening them. Losing major clients -- not quite sure what their future holds Some teams are super cliquey and spread office gossip (drawback of a young office) You'll be asked to work on new clients or take on the role above you due to high turnover which sounds exciting but will never be compensated. Not a place to stay for more than a year or so to build up your resume. Advice to Management Reward your current staff and listen to their complaints", "rating": 3, "pros": "Young office with a lot of recent grads", "cons": "Horrible pay-- below industry standard (even for media) and they won't let you negotiate.", "advice": "Reward your current staff and listen to their complaints"}, {"title": "Sr. Analyst", "text": "Pros Great coworkers, some good clients, media perks can be good depending on role and account. Cons no work life balance, terrible management & leadership, impossible to do anything innovative, feels like you're solving the same problem every year the same way. managers just delegate and do no production work. Advice to Management allow for more experimentation and innovation. have less middle management that is so keen on just passing on the grunt work they had to do", "rating": 3, "pros": "Great coworkers, some good clients, media perks can be good depending on role and account.", "cons": "no work life balance, terrible management & leadership, impossible to do anything innovative, feels like you're solving the same problem every year the same way. managers just delegate and do no production work.", "advice": "allow for more experimentation and innovation. have less middle management that is so keen on just passing on the grunt work they had to do"}, {"title": "Not the worst but not the best, either", "text": "Pros Great leadership in some departments. Nice clients (both in theory and practice). Beer garden. Free coffee at coffee bar. Nice office. Cons Not appreciative of strong talent. Competition between departments. Toxic people. Understaffed across the board. One of the lowest paying agencies. Advice to Management Reward your employees", "rating": 3, "pros": "Great leadership in some departments. Nice clients (both in theory and practice). Beer garden. Free coffee at coffee bar. Nice office.", "cons": "Not appreciative of strong talent. Competition between departments. Toxic people. Understaffed across the board. One of the lowest paying agencies.", "advice": "Reward your employees"}, {"title": "Media Director", "text": "Pros Fun people and diverse clients. Fun new-business pitch participation opportunities. Quick to build around digital needs. Cons Senior management was at odds with each other. Very political. There was a lot of conflict between media departments, no clear decision makers to take the lead. Lack of analytics support for digital media teams.", "rating": 3, "pros": "Fun people and diverse clients. Fun new-business pitch participation opportunities. Quick to build around digital needs.", "cons": "Senior management was at odds with each other. Very political. There was a lot of conflict between media departments, no clear decision makers to take the lead. Lack of analytics support for digital media teams.", "advice": null}, {"title": "Great place to work", "text": "Pros Great benefits, employee training, fair compensation, and the ability to grow from within make Initiative a GREAT work environment. Cons Can be tough to balance work and personal life.", "rating": 5, "pros": "Great benefits, employee training, fair compensation, and the ability to grow from within make Initiative a GREAT work environment.", "cons": "Can be tough to balance work and personal life.", "advice": null}, {"title": "Agency Life", "text": "Pros Getting a taste of what a bad job is Cons Low pay, long hours, worthless work", "rating": 3, "pros": "Getting a taste of what a bad job is", "cons": "Low pay, long hours, worthless work", "advice": null}, {"title": "Assistant media buyer", "text": "Pros Large company. Great first job Cons There is a high turn over rate", "rating": 5, "pros": "Large company. Great first job", "cons": "There is a high turn over rate", "advice": null}, {"title": "Intern", "text": "Pros Really fun people. Definitely learned a lot. Cons Pay minimum, but to be expected. Sometimes not a ton of work for an intern.", "rating": 5, "pros": "Really fun people. Definitely learned a lot.", "cons": "Pay minimum, but to be expected. Sometimes not a ton of work for an intern.", "advice": null}, {"title": "Director", "text": "Pros Beer garden, free coffee, location Cons Management, pay, morale, Human Resources, client roster, career growth opportunities, training Advice to Management It's disappointing what the agency once was and what it has become. Hopefully the recent changes at the agency will bring in new clients as it seems like the company is only losing business/employees these days. Management is very clicky and if you are not part of the \"cool\" crowd there is no chance you will get a promotion or raise. Beware when speaking to hr in confidence as they tend to gossip about employees. If they cared more about their employees and current clients and won some business there could maybe be potential to be recognized. I suggest finding new management to run the place.", "rating": 3, "pros": "Beer garden, free coffee, location", "cons": "Management, pay, morale, Human Resources, client roster, career growth opportunities, training", "advice": "It's disappointing what the agency once was and what it has become. Hopefully the recent changes at the agency will bring in new clients as it seems like the company is only losing business/employees these days. Management is very clicky and if you are not part of the \"cool\" crowd there is no chance you will get a promotion or raise. Beware when speaking to hr in confidence as they tend to gossip about employees. If they cared more about their employees and current clients and won some business there could maybe be potential to be recognized. I suggest finding new management to run the place."}, {"title": "Investment Resident", "text": "Pros super nice offices, laid back work culture, nice supervisors Cons gossipy employees, low pay, not very engaging work", "rating": 3, "pros": "super nice offices, laid back work culture, nice supervisors", "cons": "gossipy employees, low pay, not very engaging work", "advice": null}, {"title": "Good people, boring work", "text": "Pros The company culture was good and they were actively trying to improve There were decent perks It's a nice office The people were great Cons The work was monotonous and felt like busy work No one seemed to like what they did, but liked working together Turnover is very high", "rating": 5, "pros": "The company culture was good and they were actively trying to improve", "cons": "The work was monotonous and felt like busy work", "advice": null}, {"title": "Ask about their positioning", "text": "Pros I worked there for several years, and liked their flexibility, the people, and the fast-paced culture. My experience was that if I worked hard, opportunities would present themselves, and I felt that I learned and grew a lot with the organization. The company was very accommodating of my growth interests, and I had some really solid bosses. Cons During my tenure, there were quite a few management changes. Each change in management brought its own vision and philosophy for the company. More recent changes have increased the focus that the company is in a commodity business, and that individuals may not matter as much. For that reason, I'd recommend asking how the company sees their current competitive landscape and point of differentiation. Advice to Management Continue to value your people. I appreciate that the agency landscape faces increased competition, and in that sense people on your teams will serve as points of difference.", "rating": 5, "pros": "I worked there for several years, and liked their flexibility, the people, and the fast-paced culture. My experience was that if I worked hard, opportunities would present themselves, and I felt that I learned and grew a lot with the organization. The company was very accommodating of my growth interests, and I had some really solid bosses.", "cons": "During my tenure, there were quite a few management changes. Each change in management brought its own vision and philosophy for the company. More recent changes have increased the focus that the company is in a commodity business, and that individuals may not matter as much. For that reason, I'd recommend asking how the company sees their current competitive landscape and point of differentiation.", "advice": "Continue to value your people. I appreciate that the agency landscape faces increased competition, and in that sense people on your teams will serve as points of difference."}, {"title": "N/A", "text": "Pros good attitude, friendly Cons i don't have any downsides in Initiative", "rating": 5, "pros": "good attitude, friendly", "cons": "i don't have any downsides in Initiative", "advice": null}, {"title": "VP/Director", "text": "Pros Medium sized agency with access to senior management and company intended to change culture to allow innovation Cons Being a change agent was close to impossible; understaffed", "rating": 5, "pros": "Medium sized agency with access to senior management and company intended to change culture to allow innovation", "cons": "Being a change agent was close to impossible; understaffed", "advice": null}, {"title": "A shop figuring itself out before 2017...", "text": "Pros - The layout is pretty nice where they have a cool mini starbucks like area where employees can pay for bagels and fancy coffee for a relatively affordable price. - Has a cool feel to the office where it feels more like a creative spot but it's really strategy and planning teams surrounding the area - Location in my personal opinion is one of the best at the Manhattan Mall locale - Overall, some nice people in the office Cons - Culture is kind of different as the best way I can put it; folks can have a \"too cool for school\" persona and act pretty superficial People have that I'm the coolest/smartest person snob attitude - The organization is still figuring itself out since their recent move into the new office location. This has also triggered ambiguity when it comes to titles where everyone is kind of in the same boat until senior mgmt. appropriately figures out the right titles and scope of responsibility. - Folks are being underpaid and overwhelmed with work where people are flocking to other agencies due to the lack of better bandwidth management - With the transition the company does not have assigned seating. Yes, you've heard it; you do not have an assigned seat so anyone can sit at your desk at any point of the day where you'll need to find a spot to camp out if you have trouble. Silly but it may not be problematic for nomads - Digital teams are still figuring out digital and operations at the basic level which can be nerve wrecking when it comes to strategy and execution Advice to Management Although cliche, it's pivotal to have senior execs pay more attention to their employees before it's too late; with client movement and competition looking to staff up for 2017, it's crucial to start placing more focus on employee development and more importantly set a vision that people can buy into!", "rating": 3, "pros": "- The layout is pretty nice where they have a cool mini starbucks like area where employees can pay for bagels and fancy coffee for a relatively affordable price.", "cons": "- Culture is kind of different as the best way I can put it; folks can have a \"too cool for school\" persona and act pretty superficial People have that I'm the coolest/smartest person snob attitude", "advice": "Although cliche, it's pivotal to have senior execs pay more attention to their employees before it's too late; with client movement and competition looking to staff up for 2017, it's crucial to start placing more focus on employee development and more importantly set a vision that people can buy into!"}, {"title": "Avoid at all cost", "text": "Pros Thursday Happy Hours Open Office Space Front desk (Arthur and Carmen) are literally the most amazing people on the planet Discounts and Health Benefits Cons Little to no on-boarding process Salary is under industry standard Overworked and underpaid -- No work/life/balance Strict with taking time off Upper-management do not care about you, and think you're a robot No real office culture. Everyone just looks stressed out and unhappy High turn-over Hard to get promoted or salary raise. Advice to Management You should take your head out of the clouds and listen to your employees and their needs. Constructive criticism is more effective than talking down to your employees, and treating them like they are disposable. Show that you appreciate them, instead of taking advantage of them", "rating": 1, "pros": "Thursday Happy Hours", "cons": "Little to no on-boarding process", "advice": "You should take your head out of the clouds and listen to your employees and their needs. Constructive criticism is more effective than talking down to your employees, and treating them like they are disposable. Show that you appreciate them, instead of taking advantage of them"}, {"title": "Digital Investment Associate", "text": "Pros Gives associates a chance to learn and grow. Very established in the media processes. Cons Don't really value employees. Compensation is horrible. Advice to Management Compensate your talent fairly. The starting salary isn't even enough money to cover rent in NYC", "rating": 3, "pros": "Gives associates a chance to learn and grow. Very established in the media processes.", "cons": "Don't really value employees. Compensation is horrible.", "advice": "Compensate your talent fairly. The starting salary isn't even enough money to cover rent in NYC"}, {"title": "Associate", "text": "Pros Best coworkers you will ever meet and a very cool office in a convenient location Cons Not much room for growth and losing business Advice to Management Be more supportive of your teams, especially lower level people, and work with them not at them", "rating": 3, "pros": "Best coworkers you will ever meet and a very cool office in a convenient location", "cons": "Not much room for growth and losing business", "advice": "Be more supportive of your teams, especially lower level people, and work with them not at them"}, {"title": "Media Buyer", "text": "Pros positive attitude, eager to learn, team player, organized, can work under pressure Cons perfectionist, not much digital experience Advice to Management work better on communication", "rating": 3, "pros": "positive attitude, eager to learn, team player, organized, can work under pressure", "cons": "perfectionist, not much digital experience", "advice": "work better on communication"}, {"title": "Specialist", "text": "Pros Engaging work, and room for creative input on the investment side. Working with large budgets allow you to take chances in the media market place Cons Late nights and hectic deadlines Advice to Management polish up the training program for new employees", "rating": 5, "pros": "Engaging work, and room for creative input on the investment side. Working with large budgets allow you to take chances in the media market place", "cons": "Late nights and hectic deadlines", "advice": "polish up the training program for new employees"}, {"title": "Lacks Diversity+ Bias Hiring+ Incompetent Mgmt=Initiative", "text": "Pros - Some \"genuine people.\" who you can count on. I would call some of them of my best friends. That is all the pros at this place. Cons - Diversity. The so called \" diverse and greatest city in the world\" isn't so diverse at Initiative. An absolute joke. If you are a minority you can forget about Initiative. The problem with this is that you get the same stale ideas and no creativity. What you do get are people who talk the loudest with no measurable skills. If you're an introvert and a minority, give yourself a pat on the back in getting a job here because for once HR and Upper Management did something right. - Bias Hiring. Hires people who talks the loudest and fakes confidence. HR and Hiring managers are too stupid to see people with potential and transferable skills. Most hires are from employee referrals or internal hires and with the lack of diversity (Men from East Asian and African descent) at Initiatve, you get people with the same personality and mindset. I've know several people who I would vouch for have applied to all 3 (Initiative, UM and BPN) multiple times for assistant level positions with media experience or is trying to get experience, interviewed with multiple teams and not one offer. The new hires on my team tends to be the same like everyone else that plagues this agency. Good job HR and Upper Management... - Incompetent Management- Supervisors, Directors, VP's. Unsupportive people who talk a lot and entertain the client. No clue on what is happening on their account. Junior staff runs everything. It's ironic how they are in a position where they oversee the account. Advice to Management HR and Upper Management should fire yourselves. I feel sorry for any minorities who are trying to start their media career but are unable to do so because of HR and teams. Avoid the media/advertising industry since so many people here have their head in the clouds.", "rating": 3, "pros": "- Some \"genuine people.\" who you can count on. I would call some of them of my best friends. That is all the pros at this place.", "cons": "- Diversity. The so called \" diverse and greatest city in the world\" isn't so diverse at Initiative. An absolute joke. If you are a minority you can forget about Initiative. The problem with this is that you get the same stale ideas and no creativity. What you do get are people who talk the loudest with no measurable skills. If you're an introvert and a minority, give yourself a pat on the back in getting a job here because for once HR and Upper Management did something right.", "advice": "HR and Upper Management should fire yourselves. I feel sorry for any minorities who are trying to start their media career but are unable to do so because of HR and teams. Avoid the media/advertising industry since so many people here have their head in the clouds."}, {"title": "Media Planner", "text": "Pros The people were amazing! There was always something going on whether it was a happy hour or fun outing. it was a fairly chill environment when it wasn't planning season. There were Happy Hour drink carts on Thursdays. Keep in mind this was when Hyundai/Kia were still clients. Not sure how the work environment is now. Cons Really long hours. Work life balance wasn't the greatest, but this is pretty much the norm at an agency.", "rating": 5, "pros": "The people were amazing! There was always something going on whether it was a happy hour or fun outing. it was a fairly chill environment when it wasn't planning season. There were Happy Hour drink carts on Thursdays. Keep in mind this was when Hyundai/Kia were still clients. Not sure how the work environment is now.", "cons": "Really long hours. Work life balance wasn't the greatest, but this is pretty much the norm at an agency.", "advice": null}, {"title": "Director", "text": "Pros Smart people that you work with day to day Cons Mgmt out of touch. Too much focus on bottom line over people. Losing business because of it. Advice to Management Prioritize your talent and that will translate to better work and happier clients.", "rating": 3, "pros": "Smart people that you work with day to day", "cons": "Mgmt out of touch. Too much focus on bottom line over people. Losing business because of it.", "advice": "Prioritize your talent and that will translate to better work and happier clients."}, {"title": "Associate, Strategy", "text": "Pros Culture, environment, people, learning opportunities Cons Salary, accounts, free time (based on the account I work on)", "rating": 5, "pros": "Culture, environment, people, learning opportunities", "cons": "Salary, accounts, free time (based on the account I work on)", "advice": null}, {"title": "Digital investment Associate", "text": "Pros Teams encourage environment for employees to take initiative and ownership of tasks. This provided a very hands on approach to learning and navigating through the landscape of digital advertising. Cons Wish there was more interaction between teams and accounts to help boost company culture.", "rating": 5, "pros": "Teams encourage environment for employees to take initiative and ownership of tasks. This provided a very hands on approach to learning and navigating through the landscape of digital advertising.", "cons": "Wish there was more interaction between teams and accounts to help boost company culture.", "advice": null}, {"title": "Nice People, good work", "text": "Pros People are nice to work with and are trying to do their best and are producing excellent work. Agency is certainly a leader and drives innovation Cons High turn-over due to people work long hours (staying till 8 pm, or later) all the time due to heavy work load. Advice to Management Treat your workers better and maybe you will not have constant turn-over forcing people to assume greater work load which is unmanageable", "rating": 3, "pros": "People are nice to work with and are trying to do their best and are producing excellent work. Agency is certainly a leader and drives innovation", "cons": "High turn-over due to people work long hours (staying till 8 pm, or later) all the time due to heavy work load.", "advice": "Treat your workers better and maybe you will not have constant turn-over forcing people to assume greater work load which is unmanageable"}, {"title": "Perfectly fine first job", "text": "Pros Coworkers were hard workers and friendly people. Cool office space. Flexible lateral movement (ie switch from print to digital teams). Easy interview process. Cons Frequent turnover. Print team was often passed over for digital plans with very little notice. No snacks/lunch. Slow to promote.", "rating": 5, "pros": "Coworkers were hard workers and friendly people. Cool office space. Flexible lateral movement (ie switch from print to digital teams). Easy interview process.", "cons": "Frequent turnover. Print team was often passed over for digital plans with very little notice. No snacks/lunch. Slow to promote.", "advice": null}, {"title": "Associate", "text": "Pros Great exposure, used to be a big agency so people still respect it. Cons Long Hours, some of the worst pay in the industry, very corporate, upper management doesn't educate people on how to grow, growth is limited, lack of culture and HR keeps it that way Advice to Management Please quit. Most managers have not evolved in an evolving industry.", "rating": 3, "pros": "Great exposure, used to be a big agency so people still respect it.", "cons": "Long Hours, some of the worst pay in the industry, very corporate, upper management doesn't educate people on how to grow, growth is limited, lack of culture and HR keeps it that way", "advice": "Please quit. Most managers have not evolved in an evolving industry."}, {"title": "Poor Work Life Balance", "text": "Pros Lots of vacation days, not like you can take them! Cons Terrible work life balance, highest turnover out of any agency in LA. Advice to Management Look at your management! Something needs to change.", "rating": 1, "pros": "Lots of vacation days, not like you can take them!", "cons": "Terrible work life balance, highest turnover out of any agency in LA.", "advice": "Look at your management! Something needs to change."}, {"title": "Get great experience, then move on", "text": "Pros -Great experience, grow quickly -Fun office environment (open seating, free beer, free coffee, lots of events) -Generous vacation policy Initiative has a great culture and a pretty flat hierarchy. Every pro about the place seems to come with a con...You will learn a lot in a short amount of time because you will be over-worked and over-scoped (however, you can use this experience to move up quickly at other agencies). The office is fun a lively, btu this can be a pain when you're just trying to finish up your work and go home. It's no secret that the media industry rewards treating each agency like a revolving door, so if you need to get your foot in the door at Initiative, it's as good a place as any to start your career. Cons -Lowest of the low pay -No overtime for extra hours worked, which is often -B-list clients can make for less creative/inspiring work Advice to Management Reward people for hard work to keep them! Shoot higher for better clients.", "rating": 3, "pros": "-Great experience, grow quickly", "cons": "-Lowest of the low pay", "advice": "Reward people for hard work to keep them! Shoot higher for better clients."}, {"title": "Promoted from sweatshop only to go to high school", "text": "Pros New office with beer garden and coffee bar Promotions can happen quickly, if you get lucky and a spot opens up Managers are willing to cull the people who don't perform, but for those who have been here for over a year they will elongate that person's stay until they either find another job or get promoted off the team Most people are chill, there's a couple of bad apples here and there HR has gotten much better with staffing; spots wold be open for over half a year but now can be filled in within a month Cons Long hours, depending on the team and time of year Low pay - asking for more money is frowned upon and will likely result in some kind of repercussion later down the road Lockers instead of desks, which is a huge waste of time before and after work (the idea is for people to sit somewhere different everyday, but people end up in the same seat anyway) Lack of formal training so it really comes down to who will be teaching you the skills Managers come in late, work from home, or disappear most of the day all, giving the people below them the illusion that upper management doesn't care and therefore highly disconnected from the people who do the most work All managers need a lesson on how to manage, including upper management After becoming a manager, you are thrown into high school where upper management (the seniors) expects a lot from new managers (freshmen) but doesn't bother to show you the ropes. Communication only goes up, but trickles down at the pace of an IV - bitter cold and slow Managers strategically play favoritism, which means the same opportunities are not available to everyone Advice to Management Stop showing disrespect to your own bosses in front of the people below you, it just gives everyone else permission to bad mouth each other Stop encouraging gossip Don't get mad when people leave over money or being burnout if you can't offer more money or a positive change Step up the new business game", "rating": 3, "pros": "New office with beer garden and coffee bar", "cons": "Long hours, depending on the team and time of year", "advice": "Stop showing disrespect to your own bosses in front of the people below you, it just gives everyone else permission to bad mouth each other"}, {"title": "Associate, Local Investment", "text": "Pros Great media perks - tons of PTO, fun company outings Cons No room for growth ultimately at this location Advice to Management Please invest in the lower-level employees because ultimately, they are the foundation of the company", "rating": 3, "pros": "Great media perks - tons of PTO, fun company outings", "cons": "No room for growth ultimately at this location", "advice": "Please invest in the lower-level employees because ultimately, they are the foundation of the company"}, {"title": "Director", "text": "Pros Free coffee. Decent location transportation-wise. Great receptionist. It's really hard to find anything else positive to say about the company. Cons As cheap as they come and particularly adept at eliminating more senior people that make too much money - which isn't a lot given experience and industry norms. New business is the life-blood of any agency and Initiative has been on a significant losing streak with only the most piddling new business wins for the past 5 years. Result: an ability to hire only the most junior, underpaid staff. The new overtime standards will throw a real wrench into the works here because the business model is to hire people making in the very low thirties and working them to death. Advice to Management The future is bleak if you think this can go on forever. Staff and clients deserve better and rotating senior people at the top to make folks think that change is on the way is disingenuous to say the least.", "rating": 1, "pros": "Free coffee. Decent location transportation-wise. Great receptionist. It's really hard to find anything else positive to say about the company.", "cons": "As cheap as they come and particularly adept at eliminating more senior people that make too much money - which isn't a lot given experience and industry norms. New business is the life-blood of any agency and Initiative has been on a significant losing streak with only the most piddling new business wins for the past 5 years. Result: an ability to hire only the most junior, underpaid staff. The new overtime standards will throw a real wrench into the works here because the business model is to hire people making in the very low thirties and working them to death.", "advice": "The future is bleak if you think this can go on forever. Staff and clients deserve better and rotating senior people at the top to make folks think that change is on the way is disingenuous to say the least."}, {"title": "Directionless Organization", "text": "Pros There WERE some genuinely great, caring people in the management team. There are still a few left. Cons Relentlessly leaned on a handful of really smart people for just about every new business opportunity. Not surprisingly most are gone. Advice to Management Figure out your talent problem. You can't get good people, can't keep good people. Beer garden won't solve it.", "rating": 3, "pros": "There WERE some genuinely great, caring people in the management team. There are still a few left.", "cons": "Relentlessly leaned on a handful of really smart people for just about every new business opportunity. Not surprisingly most are gone.", "advice": "Figure out your talent problem. You can't get good people, can't keep good people. Beer garden won't solve it."}, {"title": "Good Company", "text": "Pros Great company with culture and values that anyone can appreciate Cons Compensation and executive management involvement could be better", "rating": 5, "pros": "Great company with culture and values that anyone can appreciate", "cons": "Compensation and executive management involvement could be better", "advice": null}, {"title": "Assistant Media Planner", "text": "Pros - Nice Office - Staff relatively nice - Young employees Cons - Overworked - Frowned upon if you want to leave before 8pm - The team I was on had too much work for too few members - Managers didn't know hot manage and communicate professionally Advice to Management Hire more people for the teams that stay past 8pm EVERY night ALL year. Train your managers, and train your new employees. Lack of training led to time wasted asking managers for help.", "rating": 3, "pros": "- Nice Office", "cons": "- Overworked", "advice": "Hire more people for the teams that stay past 8pm EVERY night ALL year. Train your managers, and train your new employees. Lack of training led to time wasted asking managers for help."}, {"title": "No work/life balance", "text": "Pros Vibrant, active environment with lots of action and young professionals. Cons Terrible work/life balance; upper management disconnected from day to day work", "rating": 3, "pros": "Vibrant, active environment with lots of action and young professionals.", "cons": "Terrible work/life balance; upper management disconnected from day to day work", "advice": null}, {"title": "Supervisor Local Investment", "text": "Pros Good company, good benefits and treat employees well. Cons They care more about Network business than local investment.", "rating": 5, "pros": "Good company, good benefits and treat employees well.", "cons": "They care more about Network business than local investment.", "advice": null}, {"title": "Cool People. Terrible Pay", "text": "Pros I liked my boss and my team. I learned a lot about overall strategy and was trusted to handle big projects Cons Pay is terrible. with the cost of living in LA I would make more at a restaurant job. Initiative only has huge accounts so it's difficult yo have your input heard and actually get presented to the clients Advice to Management Pay people more.", "rating": 3, "pros": "I liked my boss and my team. I learned a lot about overall strategy and was trusted to handle big projects", "cons": "Pay is terrible. with the cost of living in LA I would make more at a restaurant job. Initiative only has huge accounts so it's difficult yo have your input heard and actually get presented to the clients", "advice": "Pay people more."}, {"title": "Great starter company", "text": "Pros Great place to start in media industry and learn the basics. Option to move to other teams after putting in a bit of time. Cons Big office. Can get lost in the crowd and hard to meet people from other teams. Lacks a bit of culture that is at smaller agencies.", "rating": 3, "pros": "Great place to start in media industry and learn the basics. Option to move to other teams after putting in a bit of time.", "cons": "Big office. Can get lost in the crowd and hard to meet people from other teams. Lacks a bit of culture that is at smaller agencies.", "advice": null}, {"title": "Peaks and valleys, more so valleys.", "text": "Pros - Team outings with client and publishers - Free food - Beer garden (even though we rarely got to enjoy it due to being overworked) - A good team will make your experience here. - Ability to develop good working relationships with client and publishers, depending on account Cons - A ton of work that never seemed to end. Inefficient planning structure that seemed to take over your life and lead to burnout. High turnover is a pattern that would concern me if i were a client - A bad team (or supervisor) can really ruin your experience here. We shouldn't have had to suffer for managerial mistakes or them not doing their jobs then wanting to crack down on us. A supervisor shouldn't just be promoted to fill a role, they should be qualified. And a class on how to fulfill the duties of every role (associate, specialist, senior specialist, supervisor, associate director) should be taught - Can be cliquey at times. Some of us don't want to stay in the office till like 10 PM every night to socialize; we actually wanted to go home at an OK time due to the long hours that we worked. - no agency wide trainings on process, so it'll be hard for an associate or someone coming from another agency since process will be handed to them via word of mouth - not competitive with salary - bigger agencies can easily poach top talent, esp if they work longer hours and want to get compensated more - some of us actually had tons of work to do and we couldn't joke around all the time like everyone else, who would then deem you as antisocial or not wanting to be part of the group that was joking around Advice to Management Good luck, you'll need it if you don't address these issues. Don't expect to keep top talent if another agency can offer them more money. Encourage employees and give recognition, don't just let lazy/horrible supervisors take all the credit for the good work being done by associates, specialists and senior specialists. A beer garden isn't cool if your employees are so overworked that they can't enjoy it. Perks and gifts are appreciated, but so is your employees having time in their personal lives to do things and not just working till 9-10 every night and on weekends.", "rating": 1, "pros": "- Team outings with client and publishers", "cons": "- A ton of work that never seemed to end. Inefficient planning structure that seemed to take over your life and lead to burnout. High turnover is a pattern that would concern me if i were a client", "advice": "Good luck, you'll need it if you don't address these issues. Don't expect to keep top talent if another agency can offer them more money."}, {"title": "Awesome agency", "text": "Pros Great benefits and PTO allowance Cons No complaints about agency at this time Advice to Management Focus more on training", "rating": 5, "pros": "Great benefits and PTO allowance", "cons": "No complaints about agency at this time", "advice": "Focus more on training"}, {"title": "Associate, Digital Investment", "text": "Pros Great networking opportunities, fun events Cons long hours and low pay.", "rating": 1, "pros": "Great networking opportunities, fun events", "cons": "long hours and low pay.", "advice": null}, {"title": "Solid teamwork in Atlanta area", "text": "Pros Strong team of people that worked as a strong unit to complete both regular and ad-hoc assignments.Excellent benefits package offered to employees. Cons Due to not being the HQ and limited clients being served out of the area, unable to re-allocate staff when changes happen within the client roster.", "rating": 5, "pros": "Strong team of people that worked as a strong unit to complete both regular and ad-hoc assignments.Excellent benefits package offered to employees.", "cons": "Due to not being the HQ and limited clients being served out of the area, unable to re-allocate staff when changes happen within the client roster.", "advice": null}, {"title": "Director", "text": "Pros Open work space, beer garden, work events. Cons No real onboarding process for junior members. cliquish culture.", "rating": 3, "pros": "Open work space, beer garden, work events.", "cons": "No real onboarding process for junior members. cliquish culture.", "advice": null}, {"title": "Media Supervisor", "text": "Pros Work life balance, Teamwork, Clients, Location, Hours Cons unstructured at times, open space, meeting rooms, Advice to Management NA", "rating": 5, "pros": "Work life balance, Teamwork, Clients, Location, Hours", "cons": "unstructured at times, open space, meeting rooms,", "advice": "NA"}, {"title": "Associate- Prtin Investment", "text": "Pros Free starbucks coffee, cool beer garden in the office, some awesome perks of being in the agency- cool parties and free stuff Cons entitled and rude people (mostly supervisors), long hours with no over time pay, very low base salary", "rating": 3, "pros": "Free starbucks coffee, cool beer garden in the office, some awesome perks of being in the agency- cool parties and free stuff", "cons": "entitled and rude people (mostly supervisors), long hours with no over time pay, very low base salary", "advice": null}, {"title": "media planner", "text": "Pros good culture. good people to work with Cons shrinking client base. too new york-centric", "rating": 5, "pros": "good culture. good people to work with", "cons": "shrinking client base. too new york-centric", "advice": null}, {"title": "Good community, needs a better vetting process for new hires", "text": "Pros I've worked across multiple brands at INI and the senior people are smart and understanding on the Investment side. I think there is a good sense of community at this company (the beer garden in the office may attribute to this) Cons Lower pay and not all brands are fully staffed. HR needs a better screening process for hiring people. Advice to Management HR might want to lose the math test. They should ask more problem solving questions to get a feel for a persons attitude and how they approach problems, rather than vet on basic math skills that are easy to pick up on the job.", "rating": 5, "pros": "I've worked across multiple brands at INI and the senior people are smart and understanding on the Investment side. I think there is a good sense of community at this company (the beer garden in the office may attribute to this)", "cons": "Lower pay and not all brands are fully staffed. HR needs a better screening process for hiring people.", "advice": "HR might want to lose the math test. They should ask more problem solving questions to get a feel for a persons attitude and how they approach problems, rather than vet on basic math skills that are easy to pick up on the job."}, {"title": "Solid job, good place to work overall", "text": "Pros Casual work environment, friendly co-workers, and pretty decent training. Initiative also offered decent pay and accrued PTO. Cons Well my supervisor at the time resigned 2 weeks after I started, I felt like I was left to float in the wind. No one really stepped up to the plate.", "rating": 5, "pros": "Casual work environment, friendly co-workers, and pretty decent training. Initiative also offered decent pay and accrued PTO.", "cons": "Well my supervisor at the time resigned 2 weeks after I started, I felt like I was left to float in the wind. No one really stepped up to the plate.", "advice": null}, {"title": "Assistant Buyer", "text": "Pros Wonderful atmosphere to work in Cons No overtime for assistants. Long hours. Advice to Management Better communication down the ladder", "rating": 5, "pros": "Wonderful atmosphere to work in", "cons": "No overtime for assistants. Long hours.", "advice": "Better communication down the ladder"}, {"title": "Good with room to improve", "text": "Pros Good people- hard workers, smart and truly collaborative. Lack of polarizing personalities or divas. Research is top notch, supported by Mediabrands resources and learning opportunities. They do a very good job of keeping employees up to date on new research, interesting vendors, etc. Training opportunities abound. Cons Unfortunately there is a fairly consistent issue of comparatively low pay across the board. This leads to even higher turnover than normal, which leads to understaffed teams and burnout. This is a consistent issue which the company has been unable to solve for a very long time. A shiny, new office (while nice) will not solve it. Advice to Management Figure out how to be competitive from a salary perspective and own a unique position amongst other agencies.", "rating": 5, "pros": "Good people- hard workers, smart and truly collaborative. Lack of polarizing personalities or divas. Research is top notch, supported by Mediabrands resources and learning opportunities. They do a very good job of keeping employees up to date on new research, interesting vendors, etc. Training opportunities abound.", "cons": "Unfortunately there is a fairly consistent issue of comparatively low pay across the board. This leads to even higher turnover than normal, which leads to understaffed teams and burnout. This is a consistent issue which the company has been unable to solve for a very long time. A shiny, new office (while nice) will not solve it.", "advice": "Figure out how to be competitive from a salary perspective and own a unique position amongst other agencies."}, {"title": "Just started Tanking...", "text": "Pros Good co-workers...good environment physically. Great clients. Ability to learn from people who did care about each other and take younger buyers under their wing was the best. Cons Management just didn't care...it was always about complexes and degrading...higher ups cared more about their friendships than with the stability and growth of its employees. Advice to Management It's not only about you but the people who represent you and learn how to TEACH. Berating just makes people hurt. Help others to get to where you are. It only benefits everyone in the end when you have employees that WANT to be there.", "rating": 3, "pros": "Good co-workers...good environment physically. Great clients. Ability to learn from people who did care about each other and take younger buyers under their wing was the best.", "cons": "Management just didn't care...it was always about complexes and degrading...higher ups cared more about their friendships than with the stability and growth of its employees.", "advice": "It's not only about you but the people who represent you and learn how to TEACH. Berating just makes people hurt. Help others to get to where you are. It only benefits everyone in the end when you have employees that WANT to be there."}, {"title": "Low Pay, High Stress", "text": "Pros Cool office space, the people, free food and gifts, free coffee & tea. Cons LOW PAY, long hours, horrendous training, lack of understanding by managers on workload, cut throat. Advice to Management Be more understanding of your associates and take time to meet with them. Don't hire new associates with no experience and expect them to pick up everything right away.", "rating": 3, "pros": "Cool office space, the people, free food and gifts, free coffee & tea.", "cons": "LOW PAY, long hours, horrendous training, lack of understanding by managers on workload, cut throat.", "advice": "Be more understanding of your associates and take time to meet with them. Don't hire new associates with no experience and expect them to pick up everything right away."}, {"title": "You can do better than Initiative, much better.", "text": "Pros Big name clients, vendor meetings/events with free food and drinks, and a nice office. Cons Paid like dirt. $33k a year starting for an assistant is absolutely dreadful. The team I worked on was full of two faced, manipulative and unprofessional people. I won't name names, but they worked on the digital team that worked on the big pharmaceutical account that rhymes with \"smirk\". If you can't make events that go late at night because of the length your commute, you will be shunned. They will tell you things like use your \"summer days\" as soon as possible, and then hold it against you. Also will tell you to come between 9 and 9:30 and then will be angry if you come in at 9:30. Advice to Management Fire everyone, including yourselves.", "rating": 1, "pros": "Big name clients, vendor meetings/events with free food and drinks, and a nice office.", "cons": "Paid like dirt. $33k a year starting for an assistant is absolutely dreadful. The team I worked on was full of two faced, manipulative and unprofessional people. I won't name names, but they worked on the digital team that worked on the big pharmaceutical account that rhymes with \"smirk\". If you can't make events that go late at night because of the length your commute, you will be shunned. They will tell you things like use your \"summer days\" as soon as possible, and then hold it against you. Also will tell you to come between 9 and 9:30 and then will be angry if you come in at 9:30.", "advice": "Fire everyone, including yourselves."}, {"title": "IPG's hidden agency gem", "text": "Pros Clear company goals, great leadership, limited turnover, amazing office Cons I wish the accounts were integrated instead of digital vs strategy.", "rating": 5, "pros": "Clear company goals, great leadership, limited turnover, amazing office", "cons": "I wish the accounts were integrated instead of digital vs strategy.", "advice": null}, {"title": "Horrible place! Stay away!", "text": "Pros Vendor outings, free food all the time, 2 weeks off for Christmas 18 days PTO time (that includes sick and vacation time) Cons Very low pay, very long hours! upper management doesn't have enough experience, lots of divas. HR is absolutely the worst acting like they own that place. Advice to Management Take a closer look at your HR people, one day you may get sued for them bring absolutely out of line. Pay more attention to your lower level employees they do most of work!", "rating": 1, "pros": "Vendor outings, free food all the time, 2 weeks off for Christmas 18 days PTO time (that includes sick and vacation time)", "cons": "Very low pay, very long hours! upper management doesn't have enough experience, lots of divas. HR is absolutely the worst acting like they own that place.", "advice": "Take a closer look at your HR people, one day you may get sued for them bring absolutely out of line."}, {"title": "Initiative", "text": "Pros Work Environment, people, ability for growth Cons Low pay, Low Pay, Low Pay Advice to Management New York", "rating": 5, "pros": "Work Environment, people, ability for growth", "cons": "Low pay, Low Pay, Low Pay", "advice": "New York"}, {"title": "Fun working environment", "text": "Pros Good company culture. Fun working atmosphere. Cons More transparency in raises and promotions.", "rating": 5, "pros": "Good company culture. Fun working atmosphere.", "cons": "More transparency in raises and promotions.", "advice": null}, {"title": "Great exposure to working on large brand accounts", "text": "Pros Fun people, diverse accounts, great company to learn Cons Longer hours which is to be expected in an agency", "rating": 5, "pros": "Fun people, diverse accounts, great company to learn", "cons": "Longer hours which is to be expected in an agency", "advice": null}, {"title": "Associate Media Strategist", "text": "Pros Good introduction to media. Good PTO & work/life balance Cons More can be done to onboard entry level employees as far as training.", "rating": 3, "pros": "Good introduction to media. Good PTO & work/life balance", "cons": "More can be done to onboard entry level employees as far as training.", "advice": null}, {"title": "Awesome Office, Big Gap Between Lower And Upper Management", "text": "Pros great people to work with during the day-to-day tasks Cons upper management does not get involved at all", "rating": 5, "pros": "great people to work with during the day-to-day tasks", "cons": "upper management does not get involved at all", "advice": null}, {"title": "Media Buyer Review", "text": "Pros Fun upbeat environment, young co-works good benefits Cons Very long working hours, no work life balance, not the most competitive with salaries", "rating": 3, "pros": "Fun upbeat environment, young co-works good benefits", "cons": "Very long working hours, no work life balance, not the most competitive with salaries", "advice": null}, {"title": "Thumbs up", "text": "Pros Solid people, felt well-cared for financially Cons Not a lot of office perks", "rating": 5, "pros": "Solid people, felt well-cared for financially", "cons": "Not a lot of office perks", "advice": null}, {"title": "Good Place to Grow for Proactive People", "text": "Pros Senior leadership is very approachable. Management is open to different opinions and allows planners to explore ideas. There is room to grow if you ask for it and make it known. There are a ton of experts from the industry working here so there is so much to learn from everyone. Great amount of PTO available. Management respects PTO as well, time off is time off. People are nice as well, and you can speak casually to one another. Cons Benefits could be better, as well as salaries - though compensation is still very competitive. Advice to Management Overall management is great in Chicago. Only advice would be to loosen the reigns on arriving on time, schedules fluctuate as client work happens all the time versus just 9-5.", "rating": 5, "pros": "Senior leadership is very approachable. Management is open to different opinions and allows planners to explore ideas. There is room to grow if you ask for it and make it known. There are a ton of experts from the industry working here so there is so much to learn from everyone. Great amount of PTO available. Management respects PTO as well, time off is time off. People are nice as well, and you can speak casually to one another.", "cons": "Benefits could be better, as well as salaries - though compensation is still very competitive.", "advice": "Overall management is great in Chicago. Only advice would be to loosen the reigns on arriving on time, schedules fluctuate as client work happens all the time versus just 9-5."}, {"title": "Analyst Resident", "text": "Pros Great learning experience and mentorship. Cons The pay was not that great.", "rating": 5, "pros": "Great learning experience and mentorship.", "cons": "The pay was not that great.", "advice": null}, {"title": "Assistant Media Planner", "text": "Pros I really loved the people I met there and the staff. Cons Unfortunately, their salary was really not competitive compared to what other agencies were able to offer.", "rating": 5, "pros": "I really loved the people I met there and the staff.", "cons": "Unfortunately, their salary was really not competitive compared to what other agencies were able to offer.", "advice": null}, {"title": "Great place to work!", "text": "Pros Great morale in the office, lots of opportunities to have fun, socialize. Manager really understands work/personal life balance, offering lots of flexibility if needed as long as work is getting done and communication remains open. Office space is beautiful, modern, with competitive views compared to other agencies. Overall just a fantastic place to come to work each day. Cons Difficult to move up being in a smaller, regional office. Lack of visibility between where you are versus where you want to be. Office is dominated by one specific account so it's tough to stand out without making a concerted effort. Employees work late hours but thankfully really like being around each other even if it's at 8pm at night. Advice to Management Celebrate successes of all team members, accounts.", "rating": 5, "pros": "Great morale in the office, lots of opportunities to have fun, socialize. Manager really understands work/personal life balance, offering lots of flexibility if needed as long as work is getting done and communication remains open. Office space is beautiful, modern, with competitive views compared to other agencies. Overall just a fantastic place to come to work each day.", "cons": "Difficult to move up being in a smaller, regional office. Lack of visibility between where you are versus where you want to be. Office is dominated by one specific account so it's tough to stand out without making a concerted effort. Employees work late hours but thankfully really like being around each other even if it's at 8pm at night.", "advice": "Celebrate successes of all team members, accounts."}, {"title": "I+ REVIEW", "text": "Pros Large Company, People are lovely Cons Large Company, Will never give a promotion", "rating": 3, "pros": "Large Company, People are lovely", "cons": "Large Company, Will never give a promotion", "advice": null}, {"title": "Executive Assistant", "text": "Pros Great people, and fun work environment. Cons Open floor plan was a bit too noisy at times.", "rating": 5, "pros": "Great people, and fun work environment.", "cons": "Open floor plan was a bit too noisy at times.", "advice": null}, {"title": "Great place to work!", "text": "Pros Great people, very welcoming, good clients, good experience, growth opportunities Cons long hours like most agencies", "rating": 5, "pros": "Great people, very welcoming, good clients, good experience, growth opportunities", "cons": "long hours like most agencies", "advice": null}, {"title": "Glad I got out", "text": "Pros Big clients, top media partner relationships, access to industry tools, PERKS (free lunches, outings, gifts from media partners) Cons learning cap, client was traditional so we mostly just did as we were told, and accounts were incredibly siloed. Ppl who sat next to or behind one another wouldn't even say hi to each other unless they were on the same account. Pay was also so low", "rating": 3, "pros": "Big clients, top media partner relationships, access to industry tools, PERKS (free lunches, outings, gifts from media partners)", "cons": "learning cap, client was traditional so we mostly just did as we were told, and accounts were incredibly siloed. Ppl who sat next to or behind one another wouldn't even say hi to each other unless they were on the same account. Pay was also so low", "advice": null}, {"title": "Runaway....", "text": "Pros Prime poaching ground for recruiters looking for 1-2 year seasoned talent with media experience Cons People jumping ship left and right..... Advice to Management Examine your new business team and HR staff.....", "rating": 1, "pros": "Prime poaching ground for recruiters looking for 1-2 year seasoned talent with media experience", "cons": "People jumping ship left and right.....", "advice": "Examine your new business team and HR staff....."}, {"title": "Great Opportunity", "text": "Pros You really have to opportunity to get a lot out of your experience. To get hands on experience to work with very well known clients was a huge plus. You're not going to be fetching coffee and copies from the printer Cons Even though the program was 10 weeks it seems like it went by so fast! Advice to Management Try and have planned work and responsibilities for the interns otherwise they will be left bugging their teams everyday for work.", "rating": 5, "pros": "You really have to opportunity to get a lot out of your experience. To get hands on experience to work with very well known clients was a huge plus. You're not going to be fetching coffee and copies from the printer", "cons": "Even though the program was 10 weeks it seems like it went by so fast!", "advice": "Try and have planned work and responsibilities for the interns otherwise they will be left bugging their teams everyday for work."}, {"title": "Great team work!", "text": "Pros -Great people and team to learn from Cons -Supervisors tend not to distribute work evenly Advice to Management -Give everyone on the team a chance to grow", "rating": 3, "pros": "-Great people and team to learn from", "cons": "-Supervisors tend not to distribute work evenly", "advice": "-Give everyone on the team a chance to grow"}, {"title": "Overworked and Underpaid", "text": "Pros Great in-office perks (free lunches, etc.) Relaxed office culture Newly redesigned office space Cons High turnover Not a lot of growth or learning opportunities available within position", "rating": 3, "pros": "Great in-office perks (free lunches, etc.)", "cons": "High turnover", "advice": null}, {"title": "Good place to grow", "text": "Pros Lots of opportunities for growth and promotion. Great location in Miracle Mile. Good people and great environment. Top place for sure. Front desk is the nicest you'll ever meet. Cons Depending on the account, you can expect to work a lot of hours. Some of the computers are pretty bad. Advice to Management Keep winning new business and focus on hiring the best like you have been for the last 4 years. If they continue down that path, things should be good.", "rating": 5, "pros": "Lots of opportunities for growth and promotion. Great location in Miracle Mile. Good people and great environment. Top place for sure. Front desk is the nicest you'll ever meet.", "cons": "Depending on the account, you can expect to work a lot of hours. Some of the computers are pretty bad.", "advice": "Keep winning new business and focus on hiring the best like you have been for the last 4 years. If they continue down that path, things should be good."}, {"title": "Unprofessional, unorganized, unstructured", "text": "Pros Cool office, happy hour, laid back working environment Cons HR is so not professional. Management team is not doing good job", "rating": 3, "pros": "Cool office, happy hour, laid back working environment", "cons": "HR is so not professional. Management team is not doing good job", "advice": null}, {"title": "fun environment, happy employees, questionable upper management", "text": "Pros - amazing work environment (NY office was just redone and beautiful, open space) - employees are happy to work there, they do a lot to ensure there is a great work/life balance - A LOT of PTO days and company holidays Cons - mindless work - low pay - smaller offices do not get as much new business - promotions/raises do not happen frequently", "rating": 3, "pros": "- amazing work environment (NY office was just redone and beautiful, open space)", "cons": "- mindless work", "advice": null}, {"title": "Director", "text": "Pros Office space, people, free coffee Cons Long unending hours. Zero work/life balance. Advice to Management Hire some freaking people", "rating": 3, "pros": "Office space, people, free coffee", "cons": "Long unending hours. Zero work/life balance.", "advice": "Hire some freaking people"}, {"title": "Great company culture", "text": "Pros Great company to work for, good culture, leadership has a presence, HR partners with the employees Cons With such a large population, employees usually get lost in the shuffle. It takes a lot of effort to get noticed and recognized. Advice to Management More emphasis on work/life balance. Leadership needs to support it for everyone else to follow.", "rating": 5, "pros": "Great company to work for, good culture, leadership has a presence, HR partners with the employees", "cons": "With such a large population, employees usually get lost in the shuffle. It takes a lot of effort to get noticed and recognized.", "advice": "More emphasis on work/life balance. Leadership needs to support it for everyone else to follow."}, {"title": "Need to be utilized better", "text": "Pros Lots of opportunities to learn, nice people Cons Feel like I'm not being utilized effectively", "rating": 3, "pros": "Lots of opportunities to learn, nice people", "cons": "Feel like I'm not being utilized effectively", "advice": null}, {"title": "Digital Media Strategist", "text": "Pros Events and outings with clients. Cons Very low pay. Long hours and non-stimulating work.", "rating": 1, "pros": "Events and outings with clients.", "cons": "Very low pay. Long hours and non-stimulating work.", "advice": null}, {"title": "For the most part, OK, but not for the long haul", "text": "Pros has many accounts, if you wanted to switch around teams Cons Bad work-life balance, really low morale, no incentive to stay, very high turnover rate Advice to Management Pay better and appreciate the employees that you have", "rating": 3, "pros": "has many accounts, if you wanted to switch around teams", "cons": "Bad work-life balance, really low morale, no incentive to stay, very high turnover rate", "advice": "Pay better and appreciate the employees that you have"}, {"title": "Just lost the Hyundai/Kia Business", "text": "Pros Not much, frankly. Just Google Initiative, Horizon, Ad Age, Hyundai. Cons A horrible place to work. Leadership is immature, incompetent and overpaid. There's a reason they just lost the Hyundai/Kia business. Lack of transparency. Political. There aren't enough words to describe the experience. Advice to Management I hope you've polished your resumes. You'll need it.", "rating": 1, "pros": "Not much, frankly. Just Google Initiative, Horizon, Ad Age, Hyundai.", "cons": "A horrible place to work. Leadership is immature, incompetent and overpaid. There's a reason they just lost the Hyundai/Kia business. Lack of transparency. Political. There aren't enough words to describe the experience.", "advice": "I hope you've polished your resumes. You'll need it."}, {"title": "Analyst", "text": "Pros Great work/life balance. A lot of PTO days. Everyone is very friendly. Overall great work environment with your coworkers. Most supervisors are extremely approachable and the door is always open for people to voice their concerns, etc. Cons Management can be extremely micro-managing. Rare opportunities for advancement. Management does not listen to employees regarding their career interests and does not make attempts to capitalize on employees' strengths. The annual review process does not accurately reflect an employee's abilities. Advice to Management Be more transparent with employees regarding career opportunities and possibilities of advancement both within the agency and within the larger agency network. Allow employees the chance to showcase their skills as opposed to hoarding all the challenging tasks and ending up performing poorly.", "rating": 1, "pros": "Great work/life balance. A lot of PTO days. Everyone is very friendly. Overall great work environment with your coworkers. Most supervisors are extremely approachable and the door is always open for people to voice their concerns, etc.", "cons": "Management can be extremely micro-managing. Rare opportunities for advancement. Management does not listen to employees regarding their career interests and does not make attempts to capitalize on employees' strengths. The annual review process does not accurately reflect an employee's abilities.", "advice": "Be more transparent with employees regarding career opportunities and possibilities of advancement both within the agency and within the larger agency network. Allow employees the chance to showcase their skills as opposed to hoarding all the challenging tasks and ending up performing poorly."}, {"title": "Don't go here if you want career in digital", "text": "Pros Office is nice for hanging out. For work - not so much. Cons Lot's off arrogant TV people who know about digital by checking their gmail and sometimes going on Facebook. Advice to Management If you don't grow your pool of dedicated digital strategists, you will continue your decline. Your clients will realize it and move on to a smarter agency.", "rating": 3, "pros": "Office is nice for hanging out. For work - not so much.", "cons": "Lot's off arrogant TV people who know about digital by checking their gmail and sometimes going on Facebook.", "advice": "If you don't grow your pool of dedicated digital strategists, you will continue your decline. Your clients will realize it and move on to a smarter agency."}, {"title": "They shouldn't wonder why there is high turnover", "text": "Pros High opportunity to learn about a wide range of media. Even if you think you know it all, the company has such a broad offering that it is likely you pick up new knowledge here and there. Cons Non-competitive salaries and complete lack of recognition of employees. Even when asked for your feedback on key issues by upper management, it goes in one ear and out the other and no constructive actions are taken. There is also a high incentive to push poor performing inter-company solutions to clients even when outside vendors would do a better job. Reorg from a couple years back has still not quite resolved itself - seemed to be super good for upper management and entry level employees but have seen people in the middle get the shaft as their positions magically changed into less senior ones. Advice to Management Listen to your employes. They are telling you what is wrong with the company so if you want to reduce turnover or improve morale or improve performance on new business, would be beneficial to talk to the folks you don't seem to currently value very highly.", "rating": 1, "pros": "High opportunity to learn about a wide range of media. Even if you think you know it all, the company has such a broad offering that it is likely you pick up new knowledge here and there.", "cons": "Non-competitive salaries and complete lack of recognition of employees. Even when asked for your feedback on key issues by upper management, it goes in one ear and out the other and no constructive actions are taken. There is also a high incentive to push poor performing inter-company solutions to clients even when outside vendors would do a better job. Reorg from a couple years back has still not quite resolved itself - seemed to be super good for upper management and entry level employees but have seen people in the middle get the shaft as their positions magically changed into less senior ones.", "advice": "Listen to your employes. They are telling you what is wrong with the company so if you want to reduce turnover or improve morale or improve performance on new business, would be beneficial to talk to the folks you don't seem to currently value very highly."}, {"title": "Average at best", "text": "Pros Desire to evolve into bigger player was there Some name brand clients Open to trying new things Decent people Cons Lack of talent. bench-depth to get there. Uninspiring place to work Felt like you worked at a bank - sterile, no personality Advice to Management Haven't followed the agency closely but noticed current CEO has been there for a couple of years which is huge for Initiative. Must be doing something right", "rating": 3, "pros": "Desire to evolve into bigger player was there", "cons": "Lack of talent. bench-depth to get there. Uninspiring place to work", "advice": "Haven't followed the agency closely but noticed current CEO has been there for a couple of years which is huge for Initiative. Must be doing something right"}, {"title": "Great place", "text": "Pros Good place to work, learn a lot Cons Long late hours, all the time", "rating": 5, "pros": "Good place to work, learn a lot", "cons": "Long late hours, all the time", "advice": null}, {"title": "Too much work for one person with a wage that doesn't match up to the workload.", "text": "Pros Has a great atmosphere and awesome people. It's a fun place to be and the culture is really cool. Has a chill vibe. Cons Very low pay and poorly distributed workload. They lose a lot of great talent because they under-compensate their employees and expect them to work crazy hours. We never sees our friends/families because we are ALWAYS in the office. Advice to Management If you want to keep great people, give them a reasonable wage and evenly distribute the workloads!!", "rating": 3, "pros": "Has a great atmosphere and awesome people. It's a fun place to be and the culture is really cool. Has a chill vibe.", "cons": "Very low pay and poorly distributed workload. They lose a lot of great talent because they under-compensate their employees and expect them to work crazy hours. We never sees our friends/families because we are ALWAYS in the office.", "advice": "If you want to keep great people, give them a reasonable wage and evenly distribute the workloads!!"}, {"title": "Assistant Media Planner", "text": "Pros access to media programs, hands on experience, free happy hours Cons no overtime, lack of formal training / instruction, unprofessional employees!!!! Advice to Management Needs to enforce professionalism among employees and teach above entry level employees how to properly train entry level starters, there's a lot of wasted potential because those with talent and drive don't get recognized for their progress", "rating": 3, "pros": "access to media programs, hands on experience, free happy hours", "cons": "no overtime, lack of formal training / instruction, unprofessional employees!!!!", "advice": "Needs to enforce professionalism among employees and teach above entry level employees how to properly train entry level starters, there's a lot of wasted potential because those with talent and drive don't get recognized for their progress"}, {"title": "Overall, not bad.", "text": "Pros -It's a great work space. The office is brand new and really lends itself to a collaborative environment (and has a beer garden). -Definitely a work hard, play hard culture. LOTS of free happy hours, but that's pretty typical for a media agency. -It seems like the c-suite really cares about employees and the work that's being done. Cons -Sub par training across all departments -Somewhat cliquey -Low salaries, even for the media industry -There's very little to do if you have a bad team dynamic, you will be considered whining and an entitled millennial if you try to address it Advice to Management Good talent is walking out the door because of poor management. You need to train new managers to lead and listen rather than spout orders. Raise the salaries- show people you actually value their work and time.", "rating": 3, "pros": "-It's a great work space. The office is brand new and really lends itself to a collaborative environment (and has a beer garden).", "cons": "-Sub par training across all departments", "advice": "Good talent is walking out the door because of poor management. You need to train new managers to lead and listen rather than spout orders. Raise the salaries- show people you actually value their work and time."}, {"title": "Search Investment Associate", "text": "Pros Great team, ability to grow, constantly learning and good management! Free Starbucks coffee, beer garden and often free food. Overall, everyone is willing to try and help each other out to make sure no one is drowning in work. Cons Occasionally long hours, understaffed, average pay! Management needs to be more understanding when it comes to employees being stretched across accounts. Advice to Management Provide competitive salaries to those who deserve it. Our offers often get turned down due to pay.", "rating": 5, "pros": "Great team, ability to grow, constantly learning and good management! Free Starbucks coffee, beer garden and often free food. Overall, everyone is willing to try and help each other out to make sure no one is drowning in work.", "cons": "Occasionally long hours, understaffed, average pay! Management needs to be more understanding when it comes to employees being stretched across accounts.", "advice": "Provide competitive salaries to those who deserve it. Our offers often get turned down due to pay."}, {"title": "Media Planner", "text": "Pros great work culture, everybody is friendly and helpful Cons - Short staffed, long hours with no OT, no formal training", "rating": 3, "pros": "great work culture, everybody is friendly and helpful", "cons": "- Short staffed, long hours with no OT, no formal training", "advice": null}, {"title": "Media Supervisor", "text": "Pros Great people. Fun culture. Awesome clients. Cons Average pay. New seating arrangement resembles a call center.", "rating": 5, "pros": "Great people. Fun culture. Awesome clients.", "cons": "Average pay. New seating arrangement resembles a call center.", "advice": null}, {"title": "Ideal learning environment.", "text": "Pros Open-office format Wide array of clients/opportunities Very collaborative Lots of benefits Cons Very low salary Inconsistent work hours (sometimes you get out at 6-630p, other days you work until 11p Office politics Advice to Management Offer more opportunities to collaborate with different media platforms (TV -> Digital -> Print etc.)", "rating": 5, "pros": "Open-office format", "cons": "Very low salary", "advice": "Offer more opportunities to collaborate with different media platforms (TV -> Digital -> Print etc.)"}, {"title": "Great place to work where you have room to grow and feel valued as an employee!", "text": "Pros Never-ending food from publishers, fantastic supportive people & managers, opportunities to grow and learn, and a fun environment! Cons Definitely can get busy (typical of any agency) but not so bad since you feel valuable to the work you do and the days go by quickly", "rating": 5, "pros": "Never-ending food from publishers, fantastic supportive people & managers, opportunities to grow and learn, and a fun environment!", "cons": "Definitely can get busy (typical of any agency) but not so bad since you feel valuable to the work you do and the days go by quickly", "advice": null}, {"title": "One the best places to work!", "text": "Pros Both CEO's are cool, inviting and very approachable. Open and flexible work enviornment. You can tell how much the agency tries to care about their people and enviornment. Alot of work has gone into bringing the morale up, new, amazing office spaces, like you've never really seen at a Media agency, coffee hours with the CEO, company sponsored happy hours, entertainment, sponsored trips with Free the Children, I don't know many agencies who put this much effort into creating that type of work enviornment. I've been here a long time and this is the most I've seen a leadership team try to transform and bring up morale here. Cons Managers just need to allow their people to rotate more regularly. Don't be so stingy and be more proactive about allowing your people to rotate. Advice to Management Keep doing what you are doing, just hire some more diversity at the top. We want to see more females in upper management.", "rating": 5, "pros": "Both CEO's are cool, inviting and very approachable. Open and flexible work enviornment. You can tell how much the agency tries to care about their people and enviornment. Alot of work has gone into bringing the morale up, new, amazing office spaces, like you've never really seen at a Media agency, coffee hours with the CEO, company sponsored happy hours, entertainment, sponsored trips with Free the Children, I don't know many agencies who put this much effort into creating that type of work enviornment. I've been here a long time and this is the most I've seen a leadership team try to transform and bring up morale here.", "cons": "Managers just need to allow their people to rotate more regularly. Don't be so stingy and be more proactive about allowing your people to rotate.", "advice": "Keep doing what you are doing, just hire some more diversity at the top. We want to see more females in upper management."}, {"title": "Analytics Intern", "text": "Pros The perfect first job! Initiative is a great experience for anyone starting out in Advertising. At Initiative, they highly encourage learning and growth. They want you to learn as much as possible while exploring other avenues in the advertising industry. Initiative is under IPG Media Brands which has global offices in Media, PR, and advertising. Cons High turnover, but only because employees are moving offices and between affiliate offices within IPG Media Brands. So you're always within the Initiative/ IPG family.", "rating": 5, "pros": "The perfect first job! Initiative is a great experience for anyone starting out in Advertising. At Initiative, they highly encourage learning and growth. They want you to learn as much as possible while exploring other avenues in the advertising industry. Initiative is under IPG Media Brands which has global offices in Media, PR, and advertising.", "cons": "High turnover, but only because employees are moving offices and between affiliate offices within IPG Media Brands. So you're always within the Initiative/ IPG family.", "advice": null}, {"title": "Initiative is a great company that cares about its people and the work they do for clients.", "text": "Pros Great People Lots of training to take advantage of Company Toastmasters group free for employees to join Weekly Happy Hours Live Music Showcases Lots of opportunity within the agency and within the Mediabrands network Cons Hours can be long depending on account but that's typical of most media agencies LA Office could use a bit more color Advice to Management LA Management - Sit out in the open more often with the rest of the employees we want to hang out with you!", "rating": 5, "pros": "Great People", "cons": "Hours can be long depending on account but that's typical of most media agencies", "advice": "LA Management - Sit out in the open more often with the rest of the employees we want to hang out with you!"}, {"title": "Pathetic", "text": "Pros Central location to transportation Best receptionist in the industry Cons Lack of substance at the top Purchased off-the-shelf branding package Thinks plying staff with free beer makes up for rock bottom pay Advice to Management You may still be able to fool the kids but anyone with a scintilla of sense knows this place is nowhere", "rating": 1, "pros": "Central location to transportation", "cons": "Lack of substance at the top", "advice": "You may still be able to fool the kids but anyone with a scintilla of sense knows this place is nowhere"}, {"title": "Buyer", "text": "Pros fast paced growth potential good people to work with helpful with learning on the job Cons traffic getting to and from the office no personal space, everything is open and communal", "rating": 5, "pros": "fast paced", "cons": "traffic getting to and from the office", "advice": null}, {"title": "Great First Job", "text": "Pros Young, friendly company. It's easy to get to know your co-workers and most people are eager to get involved with different projects. There's a ton of learning happening here. The offices and clients are awesome! Cons We've experienced high turnover which makes it very hard to keep a consistent work flow. It can also be difficult to work with departments that are in offices in different cities. Communication can be very challenging. Advice to Management Try to build more corporate culture. This is such a young and vibrant company that it deserves to be more colorful! Try putting on more company wide activities (volunteering, parties, etc.). This will help build morale and hopefully decrease turn over!", "rating": 5, "pros": "Young, friendly company. It's easy to get to know your co-workers and most people are eager to get involved with different projects. There's a ton of learning happening here. The offices and clients are awesome!", "cons": "We've experienced high turnover which makes it very hard to keep a consistent work flow. It can also be difficult to work with departments that are in offices in different cities. Communication can be very challenging.", "advice": "Try to build more corporate culture. This is such a young and vibrant company that it deserves to be more colorful! Try putting on more company wide activities (volunteering, parties, etc.). This will help build morale and hopefully decrease turn over!"}, {"title": "There are greener pastures", "text": "Pros - commute from house wasn't too bad - ad agency perks like food, beer cart and pto days Cons - big pay gap between junior staff and everyone else - many people seem to all be looking for their next jobs, including managers - cliques, egos, bullying, yep, it's like high school all over again - lots of people on the highest grossing accounts have been there less than a year Advice to Management not a well-managed business", "rating": 3, "pros": "- commute from house wasn't too bad", "cons": "- big pay gap between junior staff and everyone else", "advice": "not a well-managed business"}, {"title": "Assistant Media Planner", "text": "Pros I loved the people I worked with. The MillerCoors account was fun. Plenty of PTO. Initiative is trying to make the office more fun and social. Cons MillerCoors account is very very demanding. We do a lot of work that is not always the best. There are people here that do not have a life outside of the office and that can impact the time you leave significantly. HR is not in the Chicago office and it can be a drag to get a hold of them. Morale gets very low especially around busy planning time. Pay is low. Advice to Management Keep working on ways to motivate employees and make the office more social and upbeat.", "rating": 3, "pros": "I loved the people I worked with. The MillerCoors account was fun. Plenty of PTO. Initiative is trying to make the office more fun and social.", "cons": "MillerCoors account is very very demanding. We do a lot of work that is not always the best. There are people here that do not have a life outside of the office and that can impact the time you leave significantly. HR is not in the Chicago office and it can be a drag to get a hold of them. Morale gets very low especially around busy planning time. Pay is low.", "advice": "Keep working on ways to motivate employees and make the office more social and upbeat."}, {"title": "Manager", "text": "Pros Learned basic building blocks of the media industry Cons terrible management siloed teams limited work/life balance promotions are few and far between", "rating": 1, "pros": "Learned basic building blocks of the media industry", "cons": "terrible management", "advice": null}, {"title": "Cool company with a lot of nice perks and benefits.", "text": "Pros Generous time off policy and a lot of cool perks around the office and surrounding buildings. Cons Traffic around the office is a snarl no matter what time it is. Also, no cubicles, more of an open work space which doesn't leave you with much privacy.", "rating": 5, "pros": "Generous time off policy and a lot of cool perks around the office and surrounding buildings.", "cons": "Traffic around the office is a snarl no matter what time it is. Also, no cubicles, more of an open work space which doesn't leave you with much privacy.", "advice": null}, {"title": "Amazing, welcoming, and empowering agency across the country!", "text": "Pros I work on a small local account out of the Chicago office and my teammates are located in LA, NYC, and ATL offices. I have been at Initiative for 4 years and has been my first job out of college. I actually left the account for 9 months to pursue another opportunity however returned to Initiative because i missed the sense of community. Initiative loves to hear from all their employees - from all levels - and i have had the opportunity to meet and speak with leadership whenever i needed. leadership embraces company culture and and individuality and encourages all employees to speak up and have a voice (whether all do or not is another story). Each year the agency sends a team of Initiative representatives on a philanthropy trip with Free the Children and i had the great pleasure of of traveling to the Amazon jungle in Ecuador for a week. it was a live changing experience and i am so thankful to initiative! i have the opportunity to be who i want and to learn as much as i want to and explore options. Cons the chicago office is its own beast and has some kinks to work out but overall there has been some great progress and growth. Advice to Management for the chicago office only: lighten up! for overall initiative leadership: you are awesome and so open and welcoming!", "rating": 5, "pros": "I work on a small local account out of the Chicago office and my teammates are located in LA, NYC, and ATL offices. I have been at Initiative for 4 years and has been my first job out of college. I actually left the account for 9 months to pursue another opportunity however returned to Initiative because i missed the sense of community. Initiative loves to hear from all their employees - from all levels - and i have had the opportunity to meet and speak with leadership whenever i needed. leadership embraces company culture and and individuality and encourages all employees to speak up and have a voice (whether all do or not is another story). Each year the agency sends a team of Initiative representatives on a philanthropy trip with Free the Children and i had the great pleasure of of traveling to the Amazon jungle in Ecuador for a week. it was a live changing experience and i am so thankful to initiative! i have the opportunity to be who i want and to learn as much as i want to and explore options.", "cons": "the chicago office is its own beast and has some kinks to work out but overall there has been some great progress and growth.", "advice": "for the chicago office only: lighten up!"}, {"title": "poor pay", "text": "Pros teams are segregated but fun environment Cons pay is below the norm", "rating": 3, "pros": "teams are segregated but fun environment", "cons": "pay is below the norm", "advice": null}, {"title": "Good Stepping Stone Agency", "text": "Pros - Full training for the position. - good hours - gull benefits and perks Cons - Wage is low - No strong upper management.", "rating": 5, "pros": "- Full training for the position.", "cons": "- Wage is low", "advice": null}, {"title": "Senior management cannot perform their jobs. Be prepared to babysit your managers. This place is seriously in crisis.", "text": "Pros -Flexible work environment and free coffee Cons -Senior management does not stand behind you when you need him but throw you under the bus because of insecurity -Meetings are wasted since no one knows what's going on. A lot of faking over, Nothing has done right -Not only you have to do your job but clean out your manager's mess and damage he has created", "rating": 1, "pros": "-Flexible work environment and free coffee", "cons": "-Senior management does not stand behind you when you need him but throw you under the bus because of insecurity", "advice": null}, {"title": "Assistant Digital Media Planner", "text": "Pros -there is room for growth -great benefits Cons -high turnover rate -people aren't very friendly", "rating": 3, "pros": "-there is room for growth", "cons": "-high turnover rate", "advice": null}, {"title": "Its hard work but the job comes with perks and networking opportunties. Endless PTO", "text": "Pros Industry Perks and unlimited networking opportunities Cons Associates are treated like children and employees have little value to the company Advice to Management Reorganize your Los Angeles HR department. Moral is at an all time low and HR really does not care about the employees.", "rating": 1, "pros": "Industry Perks and unlimited networking opportunities", "cons": "Associates are treated like children and employees have little value to the company", "advice": "Reorganize your Los Angeles HR department. Moral is at an all time low and HR really does not care about the employees."}, {"title": "Great place to work", "text": "Pros Work hard, play harder. Blue chip account Cons Not a lot of accounts, tough to grow past Associate Director", "rating": 5, "pros": "Work hard, play harder. Blue chip account", "cons": "Not a lot of accounts, tough to grow past Associate Director", "advice": null}, {"title": "No career prospect", "text": "Pros new office provides open space environment. Cons The agency has not won any big piece of business for years. Senior management cannot keep up with the latest media trend. Loud voices and dramatic ones are running the shows. Strategy is essential a title of project management. Innovations and ideas are recycles from aged documents. When you find some meetings are just for scheduling other meetings and your boss told you he cannot offer you anything more, you know it's time to move on. Advice to Management Please teach management how to be managers and not just avoid issues", "rating": 1, "pros": "new office provides open space environment.", "cons": "The agency has not won any big piece of business for years. Senior management cannot keep up with the latest media trend. Loud voices and dramatic ones are running the shows. Strategy is essential a title of project management. Innovations and ideas are recycles from aged documents. When you find some meetings are just for scheduling other meetings and your boss told you he cannot offer you anything more, you know it's time to move on.", "advice": "Please teach management how to be managers and not just avoid issues"}, {"title": "Very weak in digital and leadership.", "text": "Pros The new working environment makes the agency look young and fresh. Flexible work schedule Cons Low pay. Leadership is unable to adopt digital age. Strategy is essentially project and account management.", "rating": 1, "pros": "The new working environment makes the agency look young and fresh. Flexible work schedule", "cons": "Low pay. Leadership is unable to adopt digital age. Strategy is essentially project and account management.", "advice": null}, {"title": "Don't. Just, don't. You have such a bright future!", "text": "Pros Free food everywhere, thanks to different vendors coming in 24/7 Cons Everything else. Client list, weak. Management, terrible. Offices, outdated. Growth, non existent.", "rating": 1, "pros": "Free food everywhere, thanks to different vendors coming in 24/7", "cons": "Everything else.", "advice": null}, {"title": "Very corporate company with good chance to move up", "text": "Pros Stable company, good pay and benefits Cons Long hours can affect work life balance Advice to Management balancing out the long hours with more company perks", "rating": 5, "pros": "Stable company, good pay and benefits", "cons": "Long hours can affect work life balance", "advice": "balancing out the long hours with more company perks"}, {"title": "Not for me.", "text": "Pros Fun, fast-paced, lot's of networking, big accounts, lot's of holidays (PTO). Cons Seriously low pay, insane hours (long, long days), management doesn't seem to know how to manage their employees, or care much about them. They get raises/bonuses while the little guys work 16 hour days for an offensively low salary. Advice to Management Manage your employees. Listen to them. If they work hard, then acknowledge it somehow. Fight for better salaries and work/life balance.", "rating": 3, "pros": "Fun, fast-paced, lot's of networking, big accounts, lot's of holidays (PTO).", "cons": "Seriously low pay, insane hours (long, long days), management doesn't seem to know how to manage their employees, or care much about them. They get raises/bonuses while the little guys work 16 hour days for an offensively low salary.", "advice": "Manage your employees. Listen to them. If they work hard, then acknowledge it somehow. Fight for better salaries and work/life balance."}, {"title": "Ok as Agencies go.", "text": "Pros Generous Paid time off. The people are nice but always looking for there next job. Company hires inexperienced people, trains them and looses them. Cons It is a very corporate place to work and the Los Angeles office marches to directions from New York. Leadership has never been strong. Turnover is high.", "rating": 3, "pros": "Generous Paid time off. The people are nice but always looking for there next job. Company hires inexperienced people, trains them and looses them.", "cons": "It is a very corporate place to work and the Los Angeles office marches to directions from New York. Leadership has never been strong. Turnover is high.", "advice": null}, {"title": "Agency plagued by poor management and high turnover", "text": "Pros Fun group of people who are creative and driven and genuinely care about their work. Definitely a work hard play hard culture. Lots of perks from reps, lunches, events, dinners etc. Cons This place will drive you into the ground. They don't replace people when they leave, making the remaining team members stretched so thin they can hardly function. The pay is so low, especially for the hours you work. Be prepared to work late and not feel rewarded. Senior management has no idea how teams are doing because they're too busy entertaining the clients and whatnot. And we get blank stares and speeches about how they don't know why people are leaving... Advice to Management Pay attention to the goings on around you. Realize that losing handfuls of personnel is a greater issue and should be evaluated. Check in on office morale occasionally. Reward the hard workers because if you don't, they leave.", "rating": 3, "pros": "Fun group of people who are creative and driven and genuinely care about their work. Definitely a work hard play hard culture. Lots of perks from reps, lunches, events, dinners etc.", "cons": "This place will drive you into the ground. They don't replace people when they leave, making the remaining team members stretched so thin they can hardly function. The pay is so low, especially for the hours you work. Be prepared to work late and not feel rewarded. Senior management has no idea how teams are doing because they're too busy entertaining the clients and whatnot. And we get blank stares and speeches about how they don't know why people are leaving...", "advice": "Pay attention to the goings on around you. Realize that losing handfuls of personnel is a greater issue and should be evaluated. Check in on office morale occasionally. Reward the hard workers because if you don't, they leave."}, {"title": "Lesser of all evils", "text": "Pros same as many media agencies, you have great people working hard for a common goal, up against tough clients and a corporation built on a foundation of driving people into the ground until they leave Cons See pros. Lack of senior acknowledgement and care", "rating": 5, "pros": "same as many media agencies, you have great people working hard for a common goal, up against tough clients and a corporation built on a foundation of driving people into the ground until they leave", "cons": "See pros. Lack of senior acknowledgement and care", "advice": null}, {"title": "Like working at an automotive factory as 1 of 350 in a never-ending assembly line.", "text": "Pros - meetings with cool brands - free food/snacks almost everyday because of meetings - retirement plan options - lots of vacation time - opportunity to work with a charity - big name brands/accounts in house spending $$$ Cons - BAD RETENTION RATE: people quit ever 10 days! - non-intimate coworking space: you don't know your peers working on other accounts at all - obscenely long hours - \"churn and burn\" type attitude - less instructive, more demanding management - unclear hierarchy - very political landscape - very gossipy - very click-y - bland office location (LA): call center desks, bright lighting, not enough seating or (internal) refreshments/nourishments worthy of such a large shop - inability to speak freely - inability to question the norm - frequent debates over basic media work Advice to Management We get it. There are 350+ people here, but that doesn't mean you have to make us all numbers in your book. The retention rate is SO bad! Try to retain your employees and get better work out of them. They've lost some major accounts recently for a reason! Try to stay away from this place!", "rating": 1, "pros": "- meetings with cool brands", "cons": "- BAD RETENTION RATE: people quit ever 10 days!", "advice": "We get it. There are 350+ people here, but that doesn't mean you have to make us all numbers in your book. The retention rate is SO bad! Try to retain your employees and get better work out of them. They've lost some major accounts recently for a reason! Try to stay away from this place!"}, {"title": "Great place to work", "text": "Pros The perks are great. We get a ton of vacation days, half days before 3 day weekends, 10 day break over Christmas and New Years. Work life balance is ok. Beer cart fridays. Tons of free food and drinks. Cons Promotions seem hard to come by; raises even harder. 401k matching only sticks if you stay with Initiative 3+ years. Advice to Management Be more transparent.", "rating": 5, "pros": "The perks are great. We get a ton of vacation days, half days before 3 day weekends, 10 day break over Christmas and New Years. Work life balance is ok. Beer cart fridays. Tons of free food and drinks.", "cons": "Promotions seem hard to come by; raises even harder. 401k matching only sticks if you stay with Initiative 3+ years.", "advice": "Be more transparent."}, {"title": "Good place", "text": "Pros Great, small teams. Teamwork atmosphere. Everyone is friendly. Overall good experience thus far in my short time here (only been 6 months). Cons Teams may be spread a bit to thin. It seems that in the interest of saving money for the client in the beginning, the teams aren't necessarily staffed to the right capacity for the work load (which comes with the territory sometimes b/c the workload could change or not be clear upfront)", "rating": 5, "pros": "Great, small teams. Teamwork atmosphere. Everyone is friendly. Overall good experience thus far in my short time here (only been 6 months).", "cons": "Teams may be spread a bit to thin. It seems that in the interest of saving money for the client in the beginning, the teams aren't necessarily staffed to the right capacity for the work load (which comes with the territory sometimes b/c the workload could change or not be clear upfront)", "advice": null}, {"title": "Dishonest Hiring Practices at Initiative LA, Broken Agency Structure at Large", "text": "Pros Cool clients and office, good PTO and benefits, good amount of training available Cons Initiative pays less than almost every other agency in LA, and attempts to make up for this by essentially verbally promising overtime totaling up to 33% of your offered salary. Many of my coworkers had the exact same conversation in their interview. And then you begin working at the agency, and are told that you're not allowed to work overtime. Initiative also touts claims that every single person hired on will learn and work with digital. Beware, because this is not at all the case. You'll start on a strategy team, and soon learn that the digital investment team is taking care of 100% of digital strategy. Strategy and investment cannot be separated, but the business structure attempts to do this impossible task. The agency is broken and employees are taking notice, in turn bringing down employee moral and raising turnover rate. I would try to work at any other agency before Initiative- you'll at least have a higher salary. Advice to Management Leadership should be fighting for your employees salaries, fighting for their happiness. At least congratulate them on their work anniversaries, make them feel valued. Otherwise, Initiative will hold consistently understaffed accounts, leading to loss of accounts, leading to a bleak future at Initiative.", "rating": 1, "pros": "Cool clients and office, good PTO and benefits, good amount of training available", "cons": "Initiative pays less than almost every other agency in LA, and attempts to make up for this by essentially verbally promising overtime totaling up to 33% of your offered salary. Many of my coworkers had the exact same conversation in their interview. And then you begin working at the agency, and are told that you're not allowed to work overtime.", "advice": "Leadership should be fighting for your employees salaries, fighting for their happiness. At least congratulate them on their work anniversaries, make them feel valued. Otherwise, Initiative will hold consistently understaffed accounts, leading to loss of accounts, leading to a bleak future at Initiative."}, {"title": "Hard work but great people", "text": "Pros Great people, good benefits, great company to learn a lot of different parts of the marketing/media business, good growth opportunities, awesome perks from sales reps, strong support from upper management Cons Bad work/life balance (but that's normal for the industry), long hours during the busy season, low pay in the beginning but as you move up the pay is very competitive for the industry Advice to Management Create a culture that respects a better work/life balance and you will get even better results from your employees", "rating": 3, "pros": "Great people, good benefits, great company to learn a lot of different parts of the marketing/media business, good growth opportunities, awesome perks from sales reps, strong support from upper management", "cons": "Bad work/life balance (but that's normal for the industry), long hours during the busy season, low pay in the beginning but as you move up the pay is very competitive for the industry", "advice": "Create a culture that respects a better work/life balance and you will get even better results from your employees"}, {"title": "Great place to work but.....", "text": "Pros Great accounts and great team of people who aren't afraid to step up to the plate to get the job done. You never feel like your in this alone. Good benefits in terms of paid holidays, summer days, beer cart Fridays. Cons Unrealistic deadlines; understaffed. A lot of the supervisors are too young and inexperienced which has a domino affect on job performance. Can't seem to hold on to good people due to low pay. Offices are only given to Senior Management so employees are forced to sit in open areas which makes for loud noises and disruptions. Advice to Management Take the time to get to know who works for you. Listen when your employees are begging for help due to unrealistic deadlines. You get what you pay for so dig deeper in your pockets and hire people with experience rather than low pay.", "rating": 5, "pros": "Great accounts and great team of people who aren't afraid to step up to the plate to get the job done. You never feel like your in this alone. Good benefits in terms of paid holidays, summer days, beer cart Fridays.", "cons": "Unrealistic deadlines; understaffed. A lot of the supervisors are too young and inexperienced which has a domino affect on job performance. Can't seem to hold on to good people due to low pay. Offices are only given to Senior Management so employees are forced to sit in open areas which makes for loud noises and disruptions.", "advice": "Take the time to get to know who works for you. Listen when your employees are begging for help due to unrealistic deadlines. You get what you pay for so dig deeper in your pockets and hire people with experience rather than low pay."}, {"title": "Great teams and culture, everyone's opinion counts", "text": "Pros Very solid leadership. The new FBDS (Fast Brave Decisive Simple) culture is reinforced constantly, and not in annoying ways. FBDS Award winners, video updates, Friday beer carts, and even beer pong with the CEO. Cons Depending on the team, hours can be long. Not every department at the agency is FBDS yet. Advice to Management Push for more innovation.", "rating": 5, "pros": "Very solid leadership. The new FBDS (Fast Brave Decisive Simple) culture is reinforced constantly, and not in annoying ways. FBDS Award winners, video updates, Friday beer carts, and even beer pong with the CEO.", "cons": "Depending on the team, hours can be long. Not every department at the agency is FBDS yet.", "advice": "Push for more innovation."}, {"title": "Lack of leadership and direction for the company.", "text": "Pros There are good people who care about doing good work. Cons Not much leadership from Management team.", "rating": 3, "pros": "There are good people who care about doing good work.", "cons": "Not much leadership from Management team.", "advice": null}, {"title": "Below average for industry", "text": "Pros No matter the agency, the best part is the people you connect with. Initiative has some truly amazing people. TV department is historically strong. Some of management are bright and caring. Pitch presentations are aesthetically pleasing. Cons The training has gone from abysmal to non- existent (literally). The expectation is for overworked employees to run it in there spare time. Digital has always been a huge weakness with very long hours and low expertise resulting in very high turnover. Recent cultural changes have felt forced and false. Pitch presentations tend to look good, but be generic. Wins are infrequent. Limited accounts for planning means little to rotate to for growth. Salary increases rarely occur and usually require a threat of leaving. Agency restructure was clumsy and full of bluster, leading to confusion and angst. Advice to Management Invest in areas that need improvement, training and digital expertise. Focus more energy on building a smart, efficient company and less on making people believe it's a smart, efficient company.", "rating": 3, "pros": "No matter the agency, the best part is the people you connect with. Initiative has some truly amazing people. TV department is historically strong. Some of management are bright and caring. Pitch presentations are aesthetically pleasing.", "cons": "The training has gone from abysmal to non- existent (literally). The expectation is for overworked employees to run it in there spare time.", "advice": "Invest in areas that need improvement, training and digital expertise. Focus more energy on building a smart, efficient company and less on making people believe it's a smart, efficient company."}, {"title": "Some great people, some not so great, and a lot of long hours", "text": "Pros I learned some great client management skills. Some truly incredible people - several people I met there became some of my best friends outside of work, and there are others still whom I have the utmost professional respect for. Cons Little to no training. Everything is learn as you go. People don't really teach you the \"why\" of what you're doing, just the \"how.\" Lots of cattiness and people who don't manage their own stress well. Employees are often told that a busy season will only last a month or two, when in reality it often drags on for four-six months. Understaffed. Long hours, no overtime. No concern or consideration from management to improve any of those things. Advice to Management Recognize when your employees are over worked and under paid, and consider improving at least one of those things.", "rating": 3, "pros": "I learned some great client management skills. Some truly incredible people - several people I met there became some of my best friends outside of work, and there are others still whom I have the utmost professional respect for.", "cons": "Little to no training. Everything is learn as you go. People don't really teach you the \"why\" of what you're doing, just the \"how.\" Lots of cattiness and people who don't manage their own stress well. Employees are often told that a busy season will only last a month or two, when in reality it often drags on for four-six months. Understaffed. Long hours, no overtime. No concern or consideration from management to improve any of those things.", "advice": "Recognize when your employees are over worked and under paid, and consider improving at least one of those things."}, {"title": "Sinking ship", "text": "Pros Builds up your career in media planning if you are willing to put in long hours, great place to start, & tons of young people that can be your potential friends. Great PTO days & casual work environment. Cons Incompetent management ever since the restructure of the company and higher ups who do not care about you or know you by your first name. It is obvious that management has favorites so if you're not on their good side, good luck getting a promotion! Long hours for no reason because people are not taught to be efficient. Management/HR does not do a good job of keeping talent - all the smart and passionate people have fled in a mass exodus in the past couple of months. Company morale is low and processes are suddenly very disorganized. Biggest turnover in a long time.. Advice to Management Please respect your employees' voices and concerns. Learn to listen to what they have to say.", "rating": 3, "pros": "Builds up your career in media planning if you are willing to put in long hours, great place to start, & tons of young people that can be your potential friends. Great PTO days & casual work environment.", "cons": "Incompetent management ever since the restructure of the company and higher ups who do not care about you or know you by your first name. It is obvious that management has favorites so if you're not on their good side, good luck getting a promotion! Long hours for no reason because people are not taught to be efficient. Management/HR does not do a good job of keeping talent - all the smart and passionate people have fled in a mass exodus in the past couple of months. Company morale is low and processes are suddenly very disorganized. Biggest turnover in a long time..", "advice": "Please respect your employees' voices and concerns. Learn to listen to what they have to say."}, {"title": "Account Director", "text": "Pros Gain great experience if you are willing to put in long hours. Cons Management can be a bit dysfunctional and removed. ALOT of turnover, which can be a positive if you get promoted Advice to Management Pay attention to front line workers (supervisors - below) and understand the challenges they face", "rating": 3, "pros": "Gain great experience if you are willing to put in long hours.", "cons": "Management can be a bit dysfunctional and removed. ALOT of turnover, which can be a positive if you get promoted", "advice": "Pay attention to front line workers (supervisors - below) and understand the challenges they face"}, {"title": "Assistant Planner", "text": "Pros PTO days Beer Fridays Flexibility Directors are nice Vendor dates Cons If you are not passionate about media planning, this is not the place for you. Pay is not the best Long hours for no reason Advice to Management Don't talk down to the assistant because they are not on the same level as you career wise", "rating": 3, "pros": "PTO days", "cons": "If you are not passionate about media planning, this is not the place for you.", "advice": "Don't talk down to the assistant because they are not on the same level as you career wise"}, {"title": "Long hours, caring people, industry level salary levels", "text": "Pros Great opportunities to learn and grow, open door policy, challenging work environment, Caring people Cons Industry level salary, Long long hours without pay Advice to Management Take care of the aforementioned cons", "rating": 5, "pros": "Great opportunities to learn and grow, open door policy, challenging work environment, Caring people", "cons": "Industry level salary, Long long hours without pay", "advice": "Take care of the aforementioned cons"}, {"title": "Best place to start a career in media!", "text": "Pros Great benefits, PTO, positive team environment, good work-life balance, 4 summer days off of your choice, great clients, and my personal favorite is a week off in December for the holidays!! Cons Average entry level salary common for media agencies, changes in company have increased confusion, not the best initial training depending on the position! Advice to Management Promote from within, you have a lot of talented employees that have the ability to fulfill the needs of higher positions!", "rating": 5, "pros": "Great benefits, PTO, positive team environment, good work-life balance, 4 summer days off of your choice, great clients, and my personal favorite is a week off in December for the holidays!!", "cons": "Average entry level salary common for media agencies, changes in company have increased confusion, not the best initial training depending on the position!", "advice": "Promote from within, you have a lot of talented employees that have the ability to fulfill the needs of higher positions!"}, {"title": "Embarrassingly unprofessional and incompetent", "text": "Pros No positives to working at Initiative. None whatsoever. Cons Even on the highest grossing accounts the leadership is shockingly unprofessional, completely oblivious to innovation and severely under-educated. The worst part is probably the incompetence in management - hours were terrible even though we had about 10 people on our team (I think I made below minimum wage when all the overtime was factored in), every large project was left to the last minute with no structured or helpful instruction, etc. Lastly, and probably most abhorrently, I was continually harassed by a superior (once sexually) and management did nothing to address the situation. So Initiative is pretty much career hell on earth. Go anywhere else. Advice to Management If I was IPG I would divest all interests in Initiative - rebrand and clean house. Take the few capable middle and upper managers and completely start over. And then poach from credible agencies with large incentive packages.", "rating": 1, "pros": "No positives to working at Initiative. None whatsoever.", "cons": "Even on the highest grossing accounts the leadership is shockingly unprofessional, completely oblivious to innovation and severely under-educated. The worst part is probably the incompetence in management - hours were terrible even though we had about 10 people on our team (I think I made below minimum wage when all the overtime was factored in), every large project was left to the last minute with no structured or helpful instruction, etc. Lastly, and probably most abhorrently, I was continually harassed by a superior (once sexually) and management did nothing to address the situation. So Initiative is pretty much career hell on earth. Go anywhere else.", "advice": "If I was IPG I would divest all interests in Initiative - rebrand and clean house. Take the few capable middle and upper managers and completely start over. And then poach from credible agencies with large incentive packages."}, {"title": "Not intellectually stimulating and lots of stories to fit analysis (instead of numbers to prove stories)", "text": "Pros Summer days. Pay time off, Cons People seem to be hard working but it does not mean things have been doing right", "rating": 1, "pros": "Summer days. Pay time off,", "cons": "People seem to be hard working but it does not mean things have been doing right", "advice": null}, {"title": "Don't work there", "text": "Pros Benefits Time - off access to network social gatherings Cons Location Sneaky HR Low employee morale No Opportunities Compensation Lack of leadership skills Major office politics Advice to Management train your supervisors, client directors and HR managers your competitors pay more so do the same working there a long time doesn't mean work is done right", "rating": 1, "pros": "Benefits", "cons": "Location", "advice": "train your supervisors, client directors and HR managers"}, {"title": "Good place to start out in Advertising/Media", "text": "Pros There are a ton of opportunities to immerse yourself in all things digital. You will be exposed to a ton of different material and will have a chance to get a lotttt out of the role. Cons Long long long hours (10-12 hour days are average) with no overtime. The pay is extremely low for the amount of work that is done and the entire orginization is in a transition phase so there is a ton of confusion as to who should be doing what. Advice to Management Deliver more positive feedback and find ways to really compensate employees who are working those long hours.", "rating": 3, "pros": "There are a ton of opportunities to immerse yourself in all things digital. You will be exposed to a ton of different material and will have a chance to get a lotttt out of the role.", "cons": "Long long long hours (10-12 hour days are average) with no overtime. The pay is extremely low for the amount of work that is done and the entire orginization is in a transition phase so there is a ton of confusion as to who should be doing what.", "advice": "Deliver more positive feedback and find ways to really compensate employees who are working those long hours."}, {"title": "Awful experience", "text": "Pros Great PTO policy and benefits, almost always free food and beer Cons Extremely long hours, office culture is non-existent- very siloed, lack of respect from upper level management, does not offer training to new hires making the workload difficult and overwhelming, stressful, does not announce newly acquired accounts or lost ones keeping everyone out of the loop Advice to Management Offer training to new hires! It would make things go smoothly, also treat everyone with respect.", "rating": 3, "pros": "Great PTO policy and benefits, almost always free food and beer", "cons": "Extremely long hours, office culture is non-existent- very siloed, lack of respect from upper level management, does not offer training to new hires making the workload difficult and overwhelming, stressful, does not announce newly acquired accounts or lost ones keeping everyone out of the loop", "advice": "Offer training to new hires! It would make things go smoothly, also treat everyone with respect."}, {"title": "Great people", "text": "Pros I loved our account's team. Everyone's attitude was very team oriented and worked hard. Cons Long hours and expectation to actively sell in other sister companies. Advice to Management Be authentic with clients. It is hard to sell through additional sister agencies if it is a stretch.", "rating": 3, "pros": "I loved our account's team. Everyone's attitude was very team oriented and worked hard.", "cons": "Long hours and expectation to actively sell in other sister companies.", "advice": "Be authentic with clients. It is hard to sell through additional sister agencies if it is a stretch."}, {"title": "Good company that's heading in the right direction", "text": "Pros Great work-life balance, company is aggressively trying to change their culture, process, product Cons The compensation is below average with no bonuses", "rating": 5, "pros": "Great work-life balance, company is aggressively trying to change their culture, process, product", "cons": "The compensation is below average with no bonuses", "advice": null}, {"title": "Great company to start your media career but not great for career development & growth", "text": "Pros Paid time off (PTO, 4 summer days, floating holiday), ok work-life balance three quarters out of a year Cons Difficult to get promotions and raises although always had great performance evaluation/reviews, lack of developed training program for new hires, direct management lacks organization skills Advice to Management Would advise management to do what they preach - handle clients better, don't always say yes to the clients and make the rest of your team work overtime to get on air next week", "rating": 3, "pros": "Paid time off (PTO, 4 summer days, floating holiday), ok work-life balance three quarters out of a year", "cons": "Difficult to get promotions and raises although always had great performance evaluation/reviews, lack of developed training program for new hires, direct management lacks organization skills", "advice": "Would advise management to do what they preach - handle clients better, don't always say yes to the clients and make the rest of your team work overtime to get on air next week"}, {"title": "Going through changes", "text": "Pros Nice people, Great office (LA) Cons Limited opportunity for growth, Weak new business pipeline, Still figuring out culture", "rating": 3, "pros": "Nice people, Great office (LA)", "cons": "Limited opportunity for growth, Weak new business pipeline, Still figuring out culture", "advice": null}, {"title": "Great place to start career..", "text": "Pros The people are great and the upper management here is very willing to help out with anyone that needs help or looking for advice. Cons Training could be better in the Chicago office, not sure about the other Initiative offices. They advertise that everyone should raise their hands if they want to move into a different account, but it's not as easy as they say Advice to Management I think they are good at keeping everyone in the loop", "rating": 5, "pros": "The people are great and the upper management here is very willing to help out with anyone that needs help or looking for advice.", "cons": "Training could be better in the Chicago office, not sure about the other Initiative offices. They advertise that everyone should raise their hands if they want to move into a different account, but it's not as easy as they say", "advice": "I think they are good at keeping everyone in the loop"}, {"title": "Disgraced. Came back, thinking that it would be okay. I was laid off (again) 18 months after I started. Never going back", "text": "Pros Co-workers that are new to the biz are nice to work with. Simply because they dont know anything about the biz. Little do they know... Cons Was canned after they lost major account. Still peeved because I never worked on the account. Senior people looking for the swag and freebies but rarely pass them down to those that really perform. Advice to Management Listen to the little man.", "rating": 3, "pros": "Co-workers that are new to the biz are nice to work with. Simply because they dont know anything about the biz. Little do they know...", "cons": "Was canned after they lost major account. Still peeved because I never worked on the account. Senior people looking for the swag and freebies but rarely pass them down to those that really perform.", "advice": "Listen to the little man."}, {"title": "Fast, Broken, Depressing and Stressed", "text": "Pros Depending on which department you work in, this could be a great agency to work for. If you're interested in media planning or investment, it's a great place to begin your career in advertising. Cons --Beyond the fact that the pay is low, management prides itself on encouraging success through templates and uninspired processes that seldom lead to creative thinking. --Failing to appreciate all of their valued employees, morale is low and the agency lacks any sense of culture. Recently, this has been masked by the agency's efforts to restructure and throw \"mandatory\" parties. --HR is non-existent and does extremely poorly when it comes to communicating with staff. --New, entry-level employees do not receive proper training to succeed. Advice to Management Value your employees and invest in better HR", "rating": 3, "pros": "Depending on which department you work in, this could be a great agency to work for. If you're interested in media planning or investment, it's a great place to begin your career in advertising.", "cons": "--Beyond the fact that the pay is low, management prides itself on encouraging success through templates and uninspired processes that seldom lead to creative thinking.", "advice": "Value your employees and invest in better HR"}, {"title": "Recently Hired", "text": "Pros Interview process and communication throughout was very well kept up. The culture and the attitude of the employees is positive. Cons Starting salary is a bit low but that is to be expected within the industry", "rating": 5, "pros": "Interview process and communication throughout was very well kept up. The culture and the attitude of the employees is positive.", "cons": "Starting salary is a bit low but that is to be expected within the industry", "advice": null}, {"title": "Digital Media Planner", "text": "Pros loved coworkers, team and atmosphere Cons super late hours for no reason", "rating": 3, "pros": "loved coworkers, team and atmosphere", "cons": "super late hours for no reason", "advice": null}, {"title": "A previous poster pretty much said all of these already...", "text": "Pros - company-wide events that include raffles - social outings with vendors - good benefits package and PTO - if you're lucky, you might find a mentor who actually cares about your development as an ad professional Cons - high turnover, people are leaving all the time - along those lines, they're usually understaffed which leads to more work on fewer people and more stress - poor training especially for those new to the advertising field. No set process on how to do things - importance placed on how fast you can get something done right even if you don't understand the meaning or have any context - poor communication among teams - crazy long hours - lack of people's enthusiasm during the day-to-day leads to a lot of negativity - everyone seems in it just for themselves; not exactly a collaborative learning environment - low pay Advice to Management Create a culture of learning with people who have the like mindedness to be collaborative and helpful to others.", "rating": 3, "pros": "- company-wide events that include raffles", "cons": "- high turnover, people are leaving all the time", "advice": "Create a culture of learning with people who have the like mindedness to be collaborative and helpful to others."}, {"title": "Great company, low salary", "text": "Pros Great environment to work, fun colleagues Cons Even though it's a great company to work, they pay pretty low", "rating": 5, "pros": "Great environment to work, fun colleagues", "cons": "Even though it's a great company to work, they pay pretty low", "advice": null}, {"title": "Fine Experience", "text": "Pros Friendly Employees, Reasonable hours, bonuses Cons Salaries below industry standard, tend to take care of certain depts & ignore others, media training not always available, office space needs updating", "rating": 3, "pros": "Friendly Employees, Reasonable hours, bonuses", "cons": "Salaries below industry standard, tend to take care of certain depts & ignore others, media training not always available, office space needs updating", "advice": null}, {"title": "high stress and long hours", "text": "Pros great PTO policy lots of social perks and events good people for the most part flexible dresscode Cons ridiculously long hours disorganization LOW pay work fast, even if its wrong- we'll cover it up later attitude lack of training unprofessional supervisors even though social perks can be great- you are pretty much expected to go and on top of long work hours this can be overwhelming work load sometimes unmanageable bad work/ life balance Advice to Management develop better training, spread out work more evenly", "rating": 3, "pros": "great PTO policy", "cons": "ridiculously long hours", "advice": "develop better training, spread out work more evenly"}, {"title": "Young, shiny, & fun... Kind of an extension of college", "text": "Pros Young, shiny, & fun. Lots of events and beer, etc. It's a great place to start your career, especially if you're without a particularly technical degree. Cons Real academic challenges are scarce and there is little incentive to pursue solutions of any true intellectual rigor. There are, however, many opportunities for advancement & praise for those you employ more of a political or charismatic tool set. The majority of the work is tedious and the pay is poor for more junior staff. Advice to Management Move fast and break stuff. Be more progressive. Embrace change.", "rating": 3, "pros": "Young, shiny, & fun. Lots of events and beer, etc. It's a great place to start your career, especially if you're without a particularly technical degree.", "cons": "Real academic challenges are scarce and there is little incentive to pursue solutions of any true intellectual rigor. There are, however, many opportunities for advancement & praise for those you employ more of a political or charismatic tool set. The majority of the work is tedious and the pay is poor for more junior staff.", "advice": "Move fast and break stuff. Be more progressive. Embrace change."}, {"title": "Great learning experience", "text": "Pros Evolved media planning approach Great people Cons Long work hours Open desk sitting area Silos among the different media teams Advice to Management Need to work on cutting down the long hours", "rating": 5, "pros": "Evolved media planning approach", "cons": "Long work hours", "advice": "Need to work on cutting down the long hours"}, {"title": "Good starting point for an entry level job", "text": "Pros Opportunities to learn, social, perks, a good amount of vacation days throughout the year including a full week off for Christmas. Gym membership discount Cons Low pay, long hours. They pay you a base salary and then offer overtime pay a time and a half. All media jobs require some amount of overtime, but it's disheartening to start and know that you're counting to live on the fact that you will be working over time. Advice to Management Pay more to retain talent", "rating": 5, "pros": "Opportunities to learn, social, perks, a good amount of vacation days throughout the year including a full week off for Christmas. Gym membership discount", "cons": "Low pay, long hours. They pay you a base salary and then offer overtime pay a time and a half. All media jobs require some amount of overtime, but it's disheartening to start and know that you're counting to live on the fact that you will be working over time.", "advice": "Pay more to retain talent"}, {"title": "Decent place to work, not enough opportunities", "text": "Pros Ablilty to have a flexible work schedule Cons Not a lot of room to grow", "rating": 5, "pros": "Ablilty to have a flexible work schedule", "cons": "Not a lot of room to grow", "advice": null}, {"title": "Sometimes I'm not sure where I stand...", "text": "Pros Positive work environment, exposure to really cool new techniques/processes, brainstorming from all involved (nice way to express opinions) Cons Slow moving in recognizing talent and retention, shortfalls in salary bumps in promotion scenarios, quicker turnover Advice to Management Kind words can only suffice for so long, don't make your employees fight to succeed", "rating": 3, "pros": "Positive work environment, exposure to really cool new techniques/processes, brainstorming from all involved (nice way to express opinions)", "cons": "Slow moving in recognizing talent and retention, shortfalls in salary bumps in promotion scenarios, quicker turnover", "advice": "Kind words can only suffice for so long, don't make your employees fight to succeed"}, {"title": "Great place to start a career in advertising, specifically media", "text": "Pros -The PTO and holidays offered are great -Great education system through the many lunch and learns available -People are nice and welcoming Cons -Really depends on the account you work on. Only cons I would say are the late nights but that that's kind of a given in this industry.", "rating": 5, "pros": "-The PTO and holidays offered are great", "cons": "-Really depends on the account you work on. Only cons I would say are the late nights but that that's kind of a given in this industry.", "advice": null}, {"title": "Great place to learn and grow in the media industry.", "text": "Pros Upper management looks to promote from within. Great PTO and benefits. Cons Long hours and no overtime", "rating": 5, "pros": "Upper management looks to promote from within. Great PTO and benefits.", "cons": "Long hours and no overtime", "advice": null}, {"title": "The road to no-where", "text": "Pros -Relaxed work environment -Occasional lunches and events (rare, but available for assistants) Cons -Work is extremely tedious -Clients are hit or miss - Hyundai is the worst. -No room to advance. Many employees are older, and the company would rather higher someone new than promote. (A manager once made a comment that assistants were simply 'warm bodies' for the department. Advice to Management Recognize the talent that your team has. There is plenty.", "rating": 3, "pros": "-Relaxed work environment", "cons": "-Work is extremely tedious", "advice": "Recognize the talent that your team has. There is plenty."}, {"title": "Strong agency, ridden with bad luck.", "text": "Pros Great place to learn and and enhance your skill set. Access to leading industry tools to get your job done right. Upper management cares about the agency culture. Great PTO policy. Cons The recent new business climate has set an unsaid tone throughout the agency that is preventing greater enthusiasm for the company. Advice to Management Just WIN!", "rating": 5, "pros": "Great place to learn and and enhance your skill set. Access to leading industry tools to get your job done right. Upper management cares about the agency culture. Great PTO policy.", "cons": "The recent new business climate has set an unsaid tone throughout the agency that is preventing greater enthusiasm for the company.", "advice": "Just WIN!"}, {"title": "high stress atmosphere... a cover your ass culture.", "text": "Pros able to learn why one should never go into the advertising agency world Cons high stress atmosphere... a cover your ass culture. really a lack of true professionalism. young, inexperienced people running around like they know everything meanwhile, Rome is burning! There is a reason why there is massive churn. When solid talent finds its way through the door, they leave after seeing how dissfunctional and broken the organization is. Advice to Management take a deep look at your senior leaders. they are lacking expertise in true leadership skills and this shows by the teams they hire and the massive churn and issues that arise daily.", "rating": 1, "pros": "able to learn why one should never go into the advertising agency world", "cons": "high stress atmosphere... a cover your ass culture. really a lack of true professionalism. young, inexperienced people running around like they know everything meanwhile, Rome is burning! There is a reason why there is massive churn. When solid talent finds its way through the door, they leave after seeing how dissfunctional and broken the organization is.", "advice": "take a deep look at your senior leaders. they are lacking expertise in true leadership skills and this shows by the teams they hire and the massive churn and issues that arise daily."}, {"title": "Great place to get your foot in the door and build skills, probably not to stay though.", "text": "Pros The people here are awesome. I haven't one complaint about one person. Everyone is very nice and down to earth. It's a comfortable place to learn and build you skills at the entry level. Cons Employee well being is a low priority for management. The pattern seems to be new people come in, acquire a lot of responsibility via bearing the load of the agency's problems, then they leverage their new-found responsibility into a better job elsewhere. Not the best system but at least it gets you somewhere. Advice to Management Value your employee's more before other agencies do.", "rating": 3, "pros": "The people here are awesome. I haven't one complaint about one person. Everyone is very nice and down to earth. It's a comfortable place to learn and build you skills at the entry level.", "cons": "Employee well being is a low priority for management. The pattern seems to be new people come in, acquire a lot of responsibility via bearing the load of the agency's problems, then they leverage their new-found responsibility into a better job elsewhere. Not the best system but at least it gets you somewhere.", "advice": "Value your employee's more before other agencies do."}, {"title": "Great place for growth and skill set development", "text": "Pros Great place to learn a skill set, develop in media, and progress. Clear progression of career available, and upper management WANTS you to learn and move up. Good company culture, lots of PTO, and willingness to teach. Parent company is a media giant, so many opportunities to move across brands/business units after 1 year of work. Cons Enormous company, so you MUST stand out to progress quickly. Not every team is a delight to work with, but get in, learn your skill set, and progress so you can make sure to", "rating": 5, "pros": "Great place to learn a skill set, develop in media, and progress. Clear progression of career available, and upper management WANTS you to learn and move up. Good company culture, lots of PTO, and willingness to teach. Parent company is a media giant, so many opportunities to move across brands/business units after 1 year of work.", "cons": "Enormous company, so you MUST stand out to progress quickly. Not every team is a delight to work with, but get in, learn your skill set, and progress so you can make sure to", "advice": null}, {"title": "Not Secure", "text": "Pros A lot of young, energetic coworkers. Great exposure to digital Media Cons High turnover, volatile job security. Low compensation Advice to Management Promote within and not rely past managment hires that are out dated.", "rating": 3, "pros": "A lot of young, energetic coworkers. Great exposure to digital Media", "cons": "High turnover, volatile job security. Low compensation", "advice": "Promote within and not rely past managment hires that are out dated."}, {"title": "Heading downhill", "text": "Pros Good culture. The office is fairly laid back and isn't the typical \"sweat-shop\" that many agencies are. Cons The agency has been losing businesses. The departments are still very silo-ed. The company is very top heavy - too many chiefs, not enough Indians.", "rating": 3, "pros": "Good culture. The office is fairly laid back and isn't the typical \"sweat-shop\" that many agencies are.", "cons": "The agency has been losing businesses. The departments are still very silo-ed. The company is very top heavy - too many chiefs, not enough Indians.", "advice": null}, {"title": "Great Place to work", "text": "Pros Great Team to work , team environment, flexible schedule Cons low pay, few opportunities outside of media Advice to Management Need to spend more time on development", "rating": 5, "pros": "Great Team to work , team environment, flexible schedule", "cons": "low pay, few opportunities outside of media", "advice": "Need to spend more time on development"}, {"title": "Low employee moral from regime change and restructuring in Los Angeles office", "text": "Pros Overall good work/life balance. Not too much overtime as with some of the other agencies. Good culture and values with lots of holiday events and parties. Cons If your group doesn’t fit with the company’s aggressive annual budgetary bottom line that was promised to their clients, then the entire group will be let go one-by-one from top down; until they have a brand new team in place at a much lower salary range. Advice to Management Set long term goals with your clients and with your employees.", "rating": 3, "pros": "Overall good work/life balance. Not too much overtime as with some of the other agencies. Good culture and values with lots of holiday events and parties.", "cons": "If your group doesn’t fit with the company’s aggressive annual budgetary bottom line that was promised to their clients, then the entire group will be let go one-by-one from top down; until they have a brand new team in place at a much lower salary range.", "advice": "Set long term goals with your clients and with your employees."}, {"title": "Good Company to Work For", "text": "Pros The people here are awesome. Cons Employees are over worked and under paid. Advice to Management a little more employee appreciation would go a long way.", "rating": 5, "pros": "The people here are awesome.", "cons": "Employees are over worked and under paid.", "advice": "a little more employee appreciation would go a long way."}, {"title": "Great team, rough pay", "text": "Pros Great place to learn and grow, and in a great city Cons Horrible pay, and long working hours Advice to Management Focus on growing teams/ internal promotions", "rating": 5, "pros": "Great place to learn and grow, and in a great city", "cons": "Horrible pay, and long working hours", "advice": "Focus on growing teams/ internal promotions"}, {"title": "Great Digital Media Group", "text": "Pros Michael Hayes is a great leader of the digital group. Great people to work with and managers that really care about you and your life, not just what you can do for them. Great clients that were open to being challenged. Cons Long hours, usual for an ad agency. I wish there was more openess to working remotely. The digital team lost some of its closeness due to very fast growth. Advice to Management Find ways to better integrate auto group with other digital planners. It became way too siloed.", "rating": 5, "pros": "Michael Hayes is a great leader of the digital group. Great people to work with and managers that really care about you and your life, not just what you can do for them. Great clients that were open to being challenged.", "cons": "Long hours, usual for an ad agency. I wish there was more openess to working remotely. The digital team lost some of its closeness due to very fast growth.", "advice": "Find ways to better integrate auto group with other digital planners. It became way too siloed."}, {"title": "Great job, good people", "text": "Pros It's nice to work with people my own age (22-25) and get free stuff all the time. Cons The pay is pretty rough", "rating": 5, "pros": "It's nice to work with people my own age (22-25) and get free stuff all the time.", "cons": "The pay is pretty rough", "advice": null}, {"title": "Stepping Stone Agency", "text": "Pros Decent clients Well-known agency Good place for assistants at other agencies to get promoted Cons Very high turnover Non-competitive salaries No annual raises Silo'd teams Advice to Management The lack of annual raises/poor compensation creates a situation where turnover is really high. This is a disservice to the client and to the agency. Pay employees what they are worth or continue to see talent move to better agencies. The HR department takes a long time to fill vacancies and has an apparent bias towards a certain demographic (obvious). The teams are extremely silo'd creating a lack of unity among employees.", "rating": 3, "pros": "Decent clients", "cons": "Very high turnover", "advice": "The lack of annual raises/poor compensation creates a situation where turnover is really high. This is a disservice to the client and to the agency. Pay employees what they are worth or continue to see talent move to better agencies."}, {"title": "A stable but not stimulating environment", "text": "Pros Big Company, good account; Stable environment Cons Team politics, and things are not as rosy as they look like on the suffice; Media person less interested in their work and more interested in treat and bonus from media publishers and sales rep", "rating": 3, "pros": "Big Company, good account; Stable environment", "cons": "Team politics, and things are not as rosy as they look like on the suffice; Media person less interested in their work and more interested in treat and bonus from media publishers and sales rep", "advice": null}, {"title": "It was a summer internship that gave me the chance to learn more about the world of media.", "text": "Pros It was a fun work environment where it was easy to interact with your supervisor and people on the same level as you. It was a place where creativity was welcomed and if you had any ideas it was encouraged to share. Cons The work place was somewhat diverse, but at least in the New York office it was a lot of people in the entry level positions that all came from the same area. You could tell that if you knew someone at the company you were more than likely to get hired. Advice to Management I have none. It was a really open place. During my internship I was even able to ask the president a few questions about the recent changes the company has gone through.", "rating": 5, "pros": "It was a fun work environment where it was easy to interact with your supervisor and people on the same level as you. It was a place where creativity was welcomed and if you had any ideas it was encouraged to share.", "cons": "The work place was somewhat diverse, but at least in the New York office it was a lot of people in the entry level positions that all came from the same area. You could tell that if you knew someone at the company you were more than likely to get hired.", "advice": "I have none. It was a really open place. During my internship I was even able to ask the president a few questions about the recent changes the company has gone through."}, {"title": "My experince has been great. I've had the opportunity to learn so much and contune to grow.", "text": "Pros Culture is great. All levels of emplyees are approchable. You have the opportunity to be acknowledged. Great work gets rewarded Training program for all levels is great. Cons Workspace could be better. Needs an upgrade on one of the floors. Clients in planing are limited. Increaseing the number of clients to rotate to. Advice to Management Work on being competitve to other agencies in terms. Go after larger clients accounts and only keep profitable ones and employee", "rating": 3, "pros": "Culture is great.", "cons": "Workspace could be better. Needs an upgrade on one of the floors.", "advice": "Work on being competitve to other agencies in terms. Go after larger clients accounts and only keep profitable ones and employee"}, {"title": "Satisfying", "text": "Pros A good work environment to be in Cons I live too far from the office Advice to Management none", "rating": 3, "pros": "A good work environment to be in", "cons": "I live too far from the office", "advice": "none"}, {"title": "Initiative: A Fun but Stepping Stone Agency", "text": "Pros I'm convinced that any entry level job is going to be a grind and have mundane tasks associated with it, but it's your fellow minions that really make up your experience. In that regard, Initiative does a good job in finding hungry and intelligent talent. You'll certainly find yourself amongst similarly driven, smart and passionate young professionals beginning or at the early stages of their career. Casual dress, vibrant campus to work in (across the street from E!, above Family Guy) and also ground zero of the LA Food Truck Scene (for now at least) are some of the pros. Cons However, where Initiative succeeds in discovering and bringing on young talent, they ultimately fail at keeping them. It's certainly a great place to start in that the digital department is allegedly the largest digital shop in LA, so you'll definitely be in an environment feeding off of other assistants' enthusiasm. A real serious trend is the number of disgruntled entry level and next tier employees. There's a complete lack of upper management guidance, starting with simple performance reviews and spanning all the way to any sort of training...at all. It is understood that much of this industry lends itself to on-the-job training but guidance is seemingly absent. Despite claims of their affinity to promote within, there has yet to be an assistant planner to planner promotion in the last year. Ok, maybe one. Not really motivating for anyone. Advice to Management Open lines of communication! Now there's certainly some supervisors and AMDs that are better than others but generally, it's been a pretty secretive and disconnected family. Hearing through the grapevine is the only way to hear about anything, no matter how significant or trivial. Don't get me wrong, upper management is damn good at what they do. I'm very proud of that. However, as leaders and managers of people, they fall short. So management or HR, at what point do you notice the hemorrhage of outstanding talent and take a more vested interest in the development of the leadership and management skills of your soups/AMDs?", "rating": 3, "pros": "I'm convinced that any entry level job is going to be a grind and have mundane tasks associated with it, but it's your fellow minions that really make up your experience. In that regard, Initiative does a good job in finding hungry and intelligent talent. You'll certainly find yourself amongst similarly driven, smart and passionate young professionals beginning or at the early stages of their career. Casual dress, vibrant campus to work in (across the street from E!, above Family Guy) and also ground zero of the LA Food Truck Scene (for now at least) are some of the pros.", "cons": "However, where Initiative succeeds in discovering and bringing on young talent, they ultimately fail at keeping them. It's certainly a great place to start in that the digital department is allegedly the largest digital shop in LA, so you'll definitely be in an environment feeding off of other assistants' enthusiasm. A real serious trend is the number of disgruntled entry level and next tier employees. There's a complete lack of upper management guidance, starting with simple performance reviews and spanning all the way to any sort of training...at all. It is understood that much of this industry lends itself to on-the-job training but guidance is seemingly absent. Despite claims of their affinity to promote within, there has yet to be an assistant planner to planner promotion in the last year. Ok, maybe one. Not really motivating for anyone.", "advice": "Open lines of communication! Now there's certainly some supervisors and AMDs that are better than others but generally, it's been a pretty secretive and disconnected family. Hearing through the grapevine is the only way to hear about anything, no matter how significant or trivial. Don't get me wrong, upper management is damn good at what they do. I'm very proud of that. However, as leaders and managers of people, they fall short. So management or HR, at what point do you notice the hemorrhage of outstanding talent and take a more vested interest in the development of the leadership and management skills of your soups/AMDs?"}, {"title": "Neutral", "text": "Pros Young People, Most are friendly, Some nice benefits, lax dress code, great location, offices are nice, client lunches are fun Cons Can be really unorganized, Sometimes people can be very unhelpful to assistants, there are also a lot of cliques within. Advice to Management Initiative needs to select better people to interview prospects. These interviewers should also be better prepared with questions and explanations of departments.", "rating": 1, "pros": "Young People, Most are friendly, Some nice benefits, lax dress code, great location, offices are nice, client lunches are fun", "cons": "Can be really unorganized, Sometimes people can be very unhelpful to assistants, there are also a lot of cliques within.", "advice": "Initiative needs to select better people to interview prospects. These interviewers should also be better prepared with questions and explanations of departments."}, {"title": "Big Name - Troubled Upper Management", "text": "Pros Initiative is a huge media agency with buying power, presence, and numerous resources. They offer a salary that is comparable to other agencies and the benefits package is attractive. When it comes to being \"corporate\", they're the definition of it (if corporate is your thing). Just because we have a very casual dress environment, doesn't mean that those corporate values aren't innate. Cons Depending on what account you work on, you'll have extremely different planning experiences. Working on one of the bigger accounts at the agency, the team runs you hard. High demand, lots of micromanaging (which causes inefficiencies), long hours...etc. Then again, you'll be on the forefront of the media landscape and will be exposed to a lot of innovations. I would say a current issue at Initiative is the disconnect between upper-management and the hoi polloi. It seems that promotions are given thoughtlessly and haphazardly - when you ask why or how, a straight-forward answer is never given, but a passive, overwrought, political answer is given instead. As a result, employees tend to feel overworked and under-appreciated. Initiative is a great company, but as far as agency culture, they need to work on boosting morale and wiping away the sterile hierarchy. Advice to Management Be clear about responsibilities and duties by setting a clear growth path for your employees.", "rating": 3, "pros": "Initiative is a huge media agency with buying power, presence, and numerous resources. They offer a salary that is comparable to other agencies and the benefits package is attractive.", "cons": "Depending on what account you work on, you'll have extremely different planning experiences. Working on one of the bigger accounts at the agency, the team runs you hard. High demand, lots of micromanaging (which causes inefficiencies), long hours...etc. Then again, you'll be on the forefront of the media landscape and will be exposed to a lot of innovations.", "advice": "Be clear about responsibilities and duties by setting a clear growth path for your employees."}, {"title": "Great Atmosphere, Advancement Depends", "text": "Pros - Great work balance and fostering of entrepreneurial ideas - Talented professional however it varies by department - Open door policy even with top management - Training opportunities are good Cons - Grossly underpaid employees - Some of the groups that really matter are highly understaffed - Highly performance driven tools - Employees are often placed in complex political situations and forced to fight it out themselves Advice to Management Pay out the employees who have stuck the agency during tough times, build you mid level talent", "rating": 5, "pros": "- Great work balance and fostering of entrepreneurial ideas", "cons": "- Grossly underpaid employees", "advice": "Pay out the employees who have stuck the agency during tough times, build you mid level talent"}, {"title": "working at initiative", "text": "Pros Experience, coworkers, tools, global agency Cons Pay, possibility of getting raises Advice to Management Be more honest with employees", "rating": 3, "pros": "Experience, coworkers, tools, global agency", "cons": "Pay, possibility of getting raises", "advice": "Be more honest with employees"}, {"title": "Pleasant work environment, but offensive pay and really no demand for employees looking to make a difference.", "text": "Pros - often free lunches and dinners - free outings - relaxed work environment and casual attire - approachable management Cons - little growth potential - no concern for improvement and very little for innovation - due to advertising nature of work environment and difficulty to determine value, promotions have little to do with performance - misleading promises concerning growth Advice to Management Give raises based on performance, or see company wide decline in motivation to provide value and perform", "rating": 3, "pros": "- often free lunches and dinners", "cons": "- little growth potential", "advice": "Give raises based on performance, or see company wide decline in motivation to provide value and perform"}, {"title": "Great place to work", "text": "Pros The culture is strong and its a great place to develop your career. Cons Long working hours , more investment needed in both digital talent and new technology's.", "rating": 5, "pros": "The culture is strong and its a great place to develop your career.", "cons": "Long working hours , more investment needed in both digital talent and new technology's.", "advice": null}, {"title": "Communications Strategist", "text": "Pros Great atmosphere! Great benefits! Lots of company perks as well as good company structure. The President and Group Directors are really talented and well groomed for their roles. Cons There isn't much autonomy. If you want to get promoted you have to follow a particular company timeline despite your overall performance. Compensation is on the lower side of the scale however, you'll be learning from the best of the best. Advice to Management Increase compensation lightly to make your employees feel valued.", "rating": 5, "pros": "Great atmosphere! Great benefits! Lots of company perks as well as good company structure. The President and Group Directors are really talented and well groomed for their roles.", "cons": "There isn't much autonomy. If you want to get promoted you have to follow a particular company timeline despite your overall performance. Compensation is on the lower side of the scale however, you'll be learning from the best of the best.", "advice": "Increase compensation lightly to make your employees feel valued."}, {"title": "Media buying director", "text": "Pros Initiative is one of the leading media solution agencies is UAE and I was proud of handling one of the biggest accounts there, etisalat telecom in addition to other brands. Cons Etisalat Telecom is a very demanding client lot of times asking for lot of activities at the last moments but managed to cater it all. Advice to Management more time for the staff that need training in digital media", "rating": 5, "pros": "Initiative is one of the leading media solution agencies is UAE and I was proud of handling one of the biggest accounts there, etisalat telecom in addition to other brands.", "cons": "Etisalat Telecom is a very demanding client lot of times asking for lot of activities at the last moments but managed to cater it all.", "advice": "more time for the staff that need training in digital media"}, {"title": "World class company", "text": "Pros Great work environment, regular weekly training, and great benefits. Strong senior staff. Cons There's a couple of folks that need to keep their attitude in check and leave personal baggage at home, but this is true anywhere you work. Advice to Management Keep up the good work!", "rating": 5, "pros": "Great work environment, regular weekly training, and great benefits. Strong senior staff.", "cons": "There's a couple of folks that need to keep their attitude in check and leave personal baggage at home, but this is true anywhere you work.", "advice": "Keep up the good work!"}, {"title": "Media Assistant", "text": "Pros - Nice office - Good environment Cons - Lack of training for Jr's - Low pay", "rating": 5, "pros": "- Nice office", "cons": "- Lack of training for Jr's", "advice": null}, {"title": "It's fine", "text": "Pros Great team, I can describe working in my specific office but it may vary across different countries Cons Cuts in benefits, sometimes too much work, a lot of staying late", "rating": 5, "pros": "Great team, I can describe working in my specific office but it may vary across different countries", "cons": "Cuts in benefits, sometimes too much work, a lot of staying late", "advice": null}, {"title": "Independent, fast-moving agency", "text": "Pros Chances to propose creative activity from time to time. Opportunities to rise to the occasion and be involved in client interactions and new projects, especially for junior team members. Cons Many small clients which are demanding. Salary is below competitive. Office politics Team is spread too thin Lack of senior management", "rating": 3, "pros": "Chances to propose creative activity from time to time. Opportunities to rise to the occasion and be involved in client interactions and new projects, especially for junior team members.", "cons": "Many small clients which are demanding.", "advice": null}, {"title": "a good company to work for", "text": "Pros gained a lot of experience working with strategic clients Cons too much work. not enough employees. a lot of overnighters", "rating": 5, "pros": "gained a lot of experience working with strategic clients", "cons": "too much work. not enough employees. a lot of overnighters", "advice": null}, {"title": "rewarding", "text": "Pros lots of opportunities to learn and grow, near-zero politics and conducive working enviornment Cons long working hours which can kill work-life balance", "rating": 5, "pros": "lots of opportunities to learn and grow, near-zero politics and conducive working enviornment", "cons": "long working hours which can kill work-life balance", "advice": null}, {"title": "Average", "text": "Pros Young and energetic, nice location Cons No much progression, all about creativity, no appreciation toward operations and analytics Advice to Management blabla balba blabala blabala blabalb", "rating": 3, "pros": "Young and energetic, nice location", "cons": "No much progression, all about creativity, no appreciation toward operations and analytics", "advice": "blabla balba blabala blabala blabalb"}, {"title": "from junior to team leader", "text": "Pros office culture, this is not 8 am - 5 pm job with all pros and cons - you can leave earlier / come to work later if you need it, but sometimes you have to stay longer.possibility to grow, promotions, great team - people working here are friends Cons needs a clear vision of the future, sometimes you have to work over hours, not enough people to dig in media more then preform daily duties Advice to Management need a clear vision, too many decisions taken by CEO only", "rating": 3, "pros": "office culture, this is not 8 am - 5 pm job with all pros and cons - you can leave earlier / come to work later if you need it, but sometimes you have to stay longer.possibility to grow, promotions, great team - people working here are friends", "cons": "needs a clear vision of the future, sometimes you have to work over hours, not enough people to dig in media more then preform daily duties", "advice": "need a clear vision, too many decisions taken by CEO only"}, {"title": "excellent to work . for an intern", "text": "Pros great atmosphere to work for Cons demanding and challenging for an intern Advice to Management u r the best.. keep it up..", "rating": 5, "pros": "great atmosphere to work for", "cons": "demanding and challenging for an intern", "advice": "u r the best.. keep it up.."}, {"title": "great experience", "text": "Pros managing the client account was very rewarding Cons not a very good work/life balance", "rating": 5, "pros": "managing the client account was very rewarding", "cons": "not a very good work/life balance", "advice": null}, {"title": "analyst banking domain", "text": "Pros good for freshers and interns Cons none during my tenure there Advice to Management none during my tenure there", "rating": 5, "pros": "good for freshers and interns", "cons": "none during my tenure there", "advice": "none during my tenure there"}, {"title": "Initiative nice people short of cash", "text": "Pros like family. nice supervisors, good life/worh balance Cons under paid, depends on your team supervisor Advice to Management increase wages", "rating": 3, "pros": "like family. nice supervisors, good life/worh balance", "cons": "under paid, depends on your team supervisor", "advice": "increase wages"}, {"title": "Account Manager at MeC", "text": "Pros Big clients - big ideas. One is allowed to implement his ideas with his own clients. Everything is in your hands. Pay is not much, but if one is good, he can be promoted on the year by year basis. Cons To some extent there is a small research department. Advice to Management Would be beneficial to invest more in the research staff.", "rating": 5, "pros": "Big clients - big ideas.", "cons": "To some extent there is a small research department.", "advice": "Would be beneficial to invest more in the research staff."}, {"title": "a good stepping stone", "text": "Pros the company culture is very open; it is very easy to seek out opportunities within other departments and learn more from them Cons at times it seemed like the company was in a rut- even with its new method for strategy. still, a fine place to work- more like a stepping stone Advice to Management involve lower level people more in the big decisions; you will find they have a lot to offer despite their experience", "rating": 5, "pros": "the company culture is very open; it is very easy to seek out opportunities within other departments and learn more from them", "cons": "at times it seemed like the company was in a rut- even with its new method for strategy. still, a fine place to work- more like a stepping stone", "advice": "involve lower level people more in the big decisions; you will find they have a lot to offer despite their experience"}, {"title": "Digital Team is a great place to learn and grow your career.", "text": "Pros Opportunity to work with large national and global brands. Digital side has strong job stability and growth opportunity. Cons The added overhead of the holding company squeezes margin and thus resources and payroll in some cases. Advice to Management Participate in the team building with the minions. Great ideas bubble to the top if you have open channels of communication to the top.", "rating": 5, "pros": "Opportunity to work with large national and global brands. Digital side has strong job stability and growth opportunity.", "cons": "The added overhead of the holding company squeezes margin and thus resources and payroll in some cases.", "advice": "Participate in the team building with the minions. Great ideas bubble to the top if you have open channels of communication to the top."}, {"title": "Good intern experience", "text": "Pros Great experience interning. Learned a lot Cons There is not a whole lot of money that can be made working at an advertising agency Advice to Management none", "rating": 5, "pros": "Great experience interning. Learned a lot", "cons": "There is not a whole lot of money that can be made working at an advertising agency", "advice": "none"}, {"title": "Initiative", "text": "Pros Good pay compared with other agencies but only at the level above Asst. Individual teams are fun and often go to vendor events and lunches. Cons Work Work balance. Forget your life. Employee morale is down and people are leaving for larger agencies. Planning and TV teams rule and clients are tough, even rude in some cases. Advice to Management Hear the concerns of the employees and work to build a support system and get a promotion or bonus structure in place to encourage even more outstanding work.", "rating": 3, "pros": "Good pay compared with other agencies but only at the level above Asst. Individual teams are fun and often go to vendor events and lunches.", "cons": "Work Work balance. Forget your life. Employee morale is down and people are leaving for larger agencies. Planning and TV teams rule and clients are tough, even rude in some cases.", "advice": "Hear the concerns of the employees and work to build a support system and get a promotion or bonus structure in place to encourage even more outstanding work."}, {"title": "Not too Bad", "text": "Pros The culture is very relaxed. Casual dress and everyone seems to have a life outsie of work. People give you their 8 hrs and they want to go home and continue other things. Cons No overtime. Clients don't really care about whay you have to do. If they want something done, it has to get done. (but thats with every job) Advice to Management Not much feedback to upper management. I would encourage managers to stay away from the hierarchical way of business and become more open to change.", "rating": 5, "pros": "The culture is very relaxed. Casual dress and everyone seems to have a life outsie of work. People give you their 8 hrs and they want to go home and continue other things.", "cons": "No overtime. Clients don't really care about whay you have to do. If they want something done, it has to get done. (but thats with every job)", "advice": "Not much feedback to upper management. I would encourage managers to stay away from the hierarchical way of business and become more open to change."}, {"title": "OK", "text": "Pros for the most part, things are okay. pay is comparable to other agencies. young environment and for the most part, people are friendly. Cons but there is definitely favoritism, and it's unfortunate. this favoritism is leading many people in the lower ranks to be disenchanted by their jobs and employers, and are pushing them to seek opportunities outside of the company. not enough communication between upper mgmt and the lower ranks to let them know where they stand. Advice to Management stop with the favoritism. or if you do promote certain people, need to explain to others why that is the case and why others are doing better. there needs to be better communication to let people know where they stand.", "rating": 3, "pros": "for the most part, things are okay. pay is comparable to other agencies. young environment and for the most part, people are friendly.", "cons": "but there is definitely favoritism, and it's unfortunate. this favoritism is leading many people in the lower ranks to be disenchanted by their jobs and employers, and are pushing them to seek opportunities outside of the company. not enough communication between upper mgmt and the lower ranks to let them know where they stand.", "advice": "stop with the favoritism. or if you do promote certain people, need to explain to others why that is the case and why others are doing better. there needs to be better communication to let people know where they stand."}, {"title": "Meh", "text": "Pros good vacation benefits, sufficient staffing, there are some big accounts to work on, competent management (for the most part), organized Cons favoritism, certain upper management gets promoted repeatedly while excuses are given why the rest can't get promoted because of the economy Advice to Management recognize merit when it's due and stop with favoritism. stop misassigning credit to your favorites for work done by other people.", "rating": 3, "pros": "good vacation benefits, sufficient staffing, there are some big accounts to work on, competent management (for the most part), organized", "cons": "favoritism, certain upper management gets promoted repeatedly while excuses are given why the rest can't get promoted because of the economy", "advice": "recognize merit when it's due and stop with favoritism. stop misassigning credit to your favorites for work done by other people."}, {"title": "Geringes Gehalt, Überstunden", "text": "Pros Profi Card, nette Kollegen, schöner Standort, viele Events, Kaffee kostenlos Cons Geringes Gehalt, Überstunden, Vorgesetztenverhalten, Großraumbüro, Dauerlärm Advice to Management Kein Kommentar", "rating": 3, "pros": "Profi Card, nette Kollegen, schöner Standort, viele Events, Kaffee kostenlos", "cons": "Geringes Gehalt, Überstunden, Vorgesetztenverhalten, Großraumbüro, Dauerlärm", "advice": "Kein Kommentar"}]