[{"title": "Great company to work for, fantastic people and culture.", "text": "Pros -Company enjoying significant growth -Great culture, fun place to work -Significant value placed on Diversity & Inclusion -Lots of opportunities for those that are interested in accelerating their career in recruitment Cons -Commission structure is second to none for high achievers but struggles to compensate effectively those performing at a reasonable to good level", "rating": 5, "pros": "-Company enjoying significant growth", "cons": "-Commission structure is second to none for high achievers but struggles to compensate effectively those performing at a reasonable to good level", "advice": null}, {"title": "Great Company", "text": "Pros Mature environment, great people, inspiring. Cons Can sometimes be quite long hours", "rating": 5, "pros": "Mature environment, great people, inspiring.", "cons": "Can sometimes be quite long hours", "advice": null}, {"title": "Great company! Great People!", "text": "Pros What a great company to work for! The people here are so friendly and will approach you to see how you are getting on. You are also assigned a buddy who will look after you during your probation period, you also have buddy lunches every month which the company pays for. Just had my first Christmas party and it was great. Great venue, drinks and food. Everyone is up for the theme, no grumpy whinging from anyone, xmas mood in full swing. I heard their summer conference is even bigger and grander so I'm looking forward to that. The working attitute is very good, no micro managing, just full support and confidence. work hard, play hard!! Cons Working hours are 8:30 to 6:00 which is very long compared to other companies. some are on different hours; 9:00 to 5:30 due to old contracts. doesn'd feel great when your colleague starts later than you and leaves work before you. Advice to Management Keep doing what your doing as its clear your staff is very happy. Maybe take a look at the working hours and have everyone on a shorter working day.", "rating": 5, "pros": "What a great company to work for! The people here are so friendly and will approach you to see how you are getting on. You are also assigned a buddy who will look after you during your probation period, you also have buddy lunches every month which the company pays for.", "cons": "Working hours are 8:30 to 6:00 which is very long compared to other companies. some are on different hours; 9:00 to 5:30 due to old contracts.", "advice": "Keep doing what your doing as its clear your staff is very happy. Maybe take a look at the working hours and have everyone on a shorter working day."}, {"title": "Hard - Working Happy Place!", "text": "Pros -My team are a joy to work with and genuinely make me look forward to coming to work -Investigo hosts tons of social events that allow you to get to know people from other teams/regional offices - Exciting growth plans to make it an international business -Transparent commission scheme - Managers that have big expectations of you but give you all the right tools to be able to achieve your targets - Excellent learning & development training sessions on a weekly basis, covering everything from commercial negotiations to client/candidate process management -They have a buddy scheme in place which allows you to have a confidential monthly chat over a glass of wine with another colleague in a separate division of the business - Newly rolled out flexible working/working from home for the high billers in the business - Lots of highly experienced recruiters who are always keen to share advice on tricky situations with clients/candidates - Having come from a small change/transformation agency I was a little concerned that Investigo might be a bit of a jack of all trades, but each team really does operate like a specialist recruiter of their own particular field Cons - Managers can sometimes be a bit thin on the ground during busy periods - There isn't a huge amount of knowledge sharing between different teams regarding who recruits what roles Advice to Management - Keep doing what you are doing and engaging with people of all levels - Keep hiring more experienced recruiters", "rating": 5, "pros": "-My team are a joy to work with and genuinely make me look forward to coming to work", "cons": "- Managers can sometimes be a bit thin on the ground during busy periods", "advice": "- Keep doing what you are doing and engaging with people of all levels"}, {"title": "Top draw", "text": "Pros Great training, team and all-round culture. Would recommend to anyone looking to make that next step Cons Nothing that springs to mind Advice to Management Need more clarity over flexible working", "rating": 5, "pros": "Great training, team and all-round culture. Would recommend to anyone looking to make that next step", "cons": "Nothing that springs to mind", "advice": "Need more clarity over flexible working"}, {"title": "Great Place to Work!", "text": "Pros Highly rewarding place to work! Excellent culture & working environment which is a direct result of how much the company invests into the staff through professional development, support & opportunities, & on the more social side of company/team events & rewards. Cons Quite long hours, but we very recently introduced flexi hours which helps. Advice to Management To ensure the company culture is maintained as we continue to grow", "rating": 5, "pros": "Highly rewarding place to work! Excellent culture & working environment which is a direct result of how much the company invests into the staff through professional development, support & opportunities, & on the more social side of company/team events & rewards.", "cons": "Quite long hours, but we very recently introduced flexi hours which helps.", "advice": "To ensure the company culture is maintained as we continue to grow"}, {"title": "Great culture and Senior Leadership", "text": "Pros Unique culture and leadership that takes on the views of employees. Company isn't shy to reward staff with incentives and away days Cons Working hours can be long but the company recently introduced flexible working", "rating": 5, "pros": "Unique culture and leadership that takes on the views of employees. Company isn't shy to reward staff with incentives and away days", "cons": "Working hours can be long but the company recently introduced flexible working", "advice": null}, {"title": "Best company I've worked for", "text": "Pros There's tons of opportunity at Investigo at all levels and you're really encouraged to seize it. The leaders are great and there are some really inspirational people throughout the business. Unlike some recruitment companies i've worked for in the past, long-term client and candidate relationships are truly cherished and nobody is just out for a 'quick win'. It makes for a much more satisfying working life and I can honestly say i love my job here. Cons A few months ago i would have said 'flexibility' or work/life balance however, with the introduction of flexible working hours and being allowed to go to the gym not at peak times, this is no longer the case! So actually i can't really think of a con right now... Advice to Management Don't lose our awesome culture as we grow. Keep hiring the right people and not just growth for growths sake. Nobody here has any desire to work in a Page/Hayes-like culture!", "rating": 5, "pros": "There's tons of opportunity at Investigo at all levels and you're really encouraged to seize it. The leaders are great and there are some really inspirational people throughout the business. Unlike some recruitment companies i've worked for in the past, long-term client and candidate relationships are truly cherished and nobody is just out for a 'quick win'. It makes for a much more satisfying working life and I can honestly say i love my job here.", "cons": "A few months ago i would have said 'flexibility' or work/life balance however, with the introduction of flexible working hours and being allowed to go to the gym not at peak times, this is no longer the case! So actually i can't really think of a con right now...", "advice": "Don't lose our awesome culture as we grow. Keep hiring the right people and not just growth for growths sake. Nobody here has any desire to work in a Page/Hayes-like culture!"}, {"title": "Good environment to work", "text": "Pros Flexibility Team spirit Diversity Challenging Fun and enjoyable place to work Work-life balance Cons Nothing bad to say. My team especially is extremely friendly, understanding and flexible.", "rating": 5, "pros": "Flexibility", "cons": "Nothing bad to say. My team especially is extremely friendly, understanding and flexible.", "advice": null}, {"title": "Great company with great people", "text": "Pros . An organisation that is very close knit with a desire to continue growing and develop its own people. Cons There needs to be clear feedback from Managers and Directors on performance with merit where deserved Advice to Management Keep it up.", "rating": 5, "pros": ". An organisation that is very close knit with a desire to continue growing and develop its own people.", "cons": "There needs to be clear feedback from Managers and Directors on performance with merit where deserved", "advice": "Keep it up."}, {"title": "Great place to work", "text": "Pros Super transparent, great culture, excellent service standards Cons I can think of no negatives so far", "rating": 5, "pros": "Super transparent, great culture, excellent service standards", "cons": "I can think of no negatives so far", "advice": null}, {"title": "Company overview / Personal Experience at Investigo", "text": "Pros Fantastic people, great working environment in a business that helps you thrive and achieve the best you possibly can. Some fantastic rewards and incentives to encourage you! Cons Some may find it a negative, but I personally do not, you get out what you put in. So if you are willing to work hard and put the time in then you will be rewarded. At Investigo that means both in terms of satisfaction but also monetary rewards, perks and holidays to name a few!", "rating": 5, "pros": "Fantastic people, great working environment in a business that helps you thrive and achieve the best you possibly can. Some fantastic rewards and incentives to encourage you!", "cons": "Some may find it a negative, but I personally do not, you get out what you put in. So if you are willing to work hard and put the time in then you will be rewarded. At Investigo that means both in terms of satisfaction but also monetary rewards, perks and holidays to name a few!", "advice": null}, {"title": "Great Place to work!", "text": "Pros Supportive, Professional, Fun and Flexible place to work with talented colleagues. Cons Working in Central St Albans is hard on the wallet at lunch time.", "rating": 5, "pros": "Supportive, Professional, Fun and Flexible place to work with talented colleagues.", "cons": "Working in Central St Albans is hard on the wallet at lunch time.", "advice": null}, {"title": "New Starter", "text": "Pros Great Team Culture; Mature Environment; Entrepreneurial Cons Sometimes more support would be useful when starting new business areas, including more clarity across regional areas and historic clients within those areas.", "rating": 5, "pros": "Great Team Culture; Mature Environment; Entrepreneurial", "cons": "Sometimes more support would be useful when starting new business areas, including more clarity across regional areas and historic clients within those areas.", "advice": null}, {"title": "A rewarding, engaging and genuinely enjoyable place to work!", "text": "Pros Investigo is a mature, yet fun atmosphere that truly lives up to it's values. Everyone I've encountered here seems happy to go out of their way to help each other and for a recruitment business, that it pretty unique. I have been in recruitment for over five years and genuinely feel that by working here, I am working with some of the best Consultants, Managers and Directors in the industry! Cons There genuinely is very little to complain about - as long as we retain our incredible culture as we grow, it will continue to be an amazing place to work. Advice to Management Keep it up!", "rating": 5, "pros": "Investigo is a mature, yet fun atmosphere that truly lives up to it's values. Everyone I've encountered here seems happy to go out of their way to help each other and for a recruitment business, that it pretty unique. I have been in recruitment for over five years and genuinely feel that by working here, I am working with some of the best Consultants, Managers and Directors in the industry!", "cons": "There genuinely is very little to complain about - as long as we retain our incredible culture as we grow, it will continue to be an amazing place to work.", "advice": "Keep it up!"}, {"title": "Amazing culture and true entrepreneurial feel", "text": "Pros Everyone has the opportunity to become truly specialist in their market, supported by expert recruiters at all levels Autonomous and entrepreneurial approach which allows everyone to run their desk and business in the way they feel best Senior management very visible and everything is transparent - growth is talked about every day and always willing to take new ideas and initiatives Reward and incentives are excellent and much better than any other business Cons Due to the autonomous culture, sometimes expectations aren't laid out as clearly as they could be but help is always available if you ask for it", "rating": 5, "pros": "Everyone has the opportunity to become truly specialist in their market, supported by expert recruiters at all levels", "cons": "Due to the autonomous culture, sometimes expectations aren't laid out as clearly as they could be but help is always available if you ask for it", "advice": null}, {"title": "Autonomous, entrepreneurial environment with great rewards!", "text": "Pros Having worked in the industry for over 10 years I can honestly say Investigo is a fantastic place to work. Success is celebrated, staff are rewarded very well and everyone is treated fairly. The business is forward thinking and there are no egos. The commission scheme is one of the best in the market and the business appreciates the importance of a good work life balance and have recently introduced flexible working for the entire workforce. Great company ! Cons None that come to mind Advice to Management Carry on you're doing a great job", "rating": 5, "pros": "Having worked in the industry for over 10 years I can honestly say Investigo is a fantastic place to work. Success is celebrated, staff are rewarded very well and everyone is treated fairly. The business is forward thinking and there are no egos. The commission scheme is one of the best in the market and the business appreciates the importance of a good work life balance and have recently introduced flexible working for the entire workforce. Great company !", "cons": "None that come to mind", "advice": "Carry on you're doing a great job"}, {"title": "Excellent", "text": "Pros Flexi time - independent working, very social - everyone is so friendly, professional environment. Growing company - career progression, loads of training and structure. Brilliant offices Cons Previously I would say working hours, they have now introduced flexi time which is excellent! (helps everyone and an excellent benefit", "rating": 5, "pros": "Flexi time - independent working, very social - everyone is so friendly, professional environment. Growing company - career progression, loads of training and structure. Brilliant offices", "cons": "Previously I would say working hours, they have now introduced flexi time which is excellent! (helps everyone and an excellent benefit", "advice": null}, {"title": "Senior Consultant", "text": "Pros Great culture, high performing staff and supportive management Cons lesser known brand at the moment in regions Advice to Management keep up the good work!", "rating": 5, "pros": "Great culture, high performing staff and supportive management", "cons": "lesser known brand at the moment in regions", "advice": "keep up the good work!"}, {"title": "Investigo Life", "text": "Pros Investigo is a great culture to be part of. It is open, honest and there are no egos. Decisions are made quickly and if the staff suggest sensible changes, the guys at the top listen and make it happen. Cons Nothing significant to speak of. We seem to have lost some experienced faces recently, so we need to make sure the newer talent is up to speed quickly. Advice to Management Market research on our brand may be a useful idea? Having worked elsewhere, I can confidently say we are one of the few businesses that is exactly what it says on the tin. Given the awards and accolades we have won, I am baffled by we don't have more recruiters knocking on our door.", "rating": 5, "pros": "Investigo is a great culture to be part of. It is open, honest and there are no egos. Decisions are made quickly and if the staff suggest sensible changes, the guys at the top listen and make it happen.", "cons": "Nothing significant to speak of. We seem to have lost some experienced faces recently, so we need to make sure the newer talent is up to speed quickly.", "advice": "Market research on our brand may be a useful idea? Having worked elsewhere, I can confidently say we are one of the few businesses that is exactly what it says on the tin. Given the awards and accolades we have won, I am baffled by we don't have more recruiters knocking on our door."}, {"title": "Greatest Company EVER", "text": "Pros Great brand to work with out in the market, great people, fun culture Cons Split office, dont know half the people on the other side!", "rating": 5, "pros": "Great brand to work with out in the market, great people, fun culture", "cons": "Split office, dont know half the people on the other side!", "advice": null}, {"title": "Company & CEO", "text": "Pros People, Culture, Reward, Progress & Reputation Since joining here nearly 7 years ago I have been seen the company grow from 60 to close to 200 people. Being part of that journey has been both rewarding & fun. The personalities & culture within the business haven't changed and work is still as fun as the day I walked in. It's a great place to work where the rewards for hard work are clear to see. From commission, high achievers trips & quarterly events the business ensures we are engaged in what's going on with the business and allow us plenty of time to integrate. I think the big thing for me is that it's still a joined up & rewarding environment to work in. Private Health insurance is a massive bonus as well as the various sporting events we run. Cons Working from home could be looked at in more detail. Advice to Management Continue to adapt with new trends in terms of lifestyle and the wider market. Look to continue & add to the flexible benefits on offer to suit all. The corporate golf membership was an exceptional perk.", "rating": 5, "pros": "People, Culture, Reward, Progress & Reputation", "cons": "Working from home could be looked at in more detail.", "advice": "Continue to adapt with new trends in terms of lifestyle and the wider market. Look to continue & add to the flexible benefits on offer to suit all. The corporate golf membership was an exceptional perk."}, {"title": "Inspiring, genuine and very financially rewarding place to work! Very strong leadership!", "text": "Pros Having worked at Investigo for around 4 years, I have to say that this business still amazes me. They have somehow managed to keep the small business feel, where everyone matters, at the same time as packing a powerful corporate punch, which overall makes it a great place to work. I have been genuinely inspired by my time here by some very strong leaders, including the recently promoted CEO Nick Baxter. The whole senior leadership team are very unique and there is a very autonomous culture where even junior consultants joining the business are treated with great respect by the senior managers. The business is collaborative, innovative and a genuinely fun place to work. For those who achieve, the financial rewards are second to none. The company has a great reputation in the market which has allowed me to break into a new sector and create a thriving business unit in a relatively short space of time. If you want to enjoy going to work, learn about business and develop on a daily basis and be financially rewarded for your efforts, Investigo is the company you should work for. Cons Nothing worth mentioning, generally positive all round. Advice to Management Keep inspiring and motivating more junior members of staff, they are the future of the business.", "rating": 5, "pros": "Having worked at Investigo for around 4 years, I have to say that this business still amazes me. They have somehow managed to keep the small business feel, where everyone matters, at the same time as packing a powerful corporate punch, which overall makes it a great place to work.", "cons": "Nothing worth mentioning, generally positive all round.", "advice": "Keep inspiring and motivating more junior members of staff, they are the future of the business."}, {"title": "You want to work there!", "text": "Pros Great people, fun culture. Managment styles that suit individual consultants Amazing incentives Professional Mature approach to recruitment Invest time in their staff Cons Don’t become to larger company, eg: There is a disadvantage to been a PLC. Advice to Management Keep the company personalised Continue to reward the high achievers. Don’t micro- management too much.", "rating": 5, "pros": "Great people, fun culture.", "cons": "Don’t become to larger company, eg: There is a disadvantage to been a PLC.", "advice": "Keep the company personalised Continue to reward the high achievers."}, {"title": "Continues to go from strength to strength", "text": "Pros Generally had a great experience at Investigo. Strong, engaging leadership team and a fun place to work. Strong commission scheme. Cons You need to be willing to work very hard if you want to survive", "rating": 5, "pros": "Generally had a great experience at Investigo. Strong, engaging leadership team and a fun place to work. Strong commission scheme.", "cons": "You need to be willing to work very hard if you want to survive", "advice": null}, {"title": "Been with company more the 6 years", "text": "Pros I know that I worked for a very reputable and professional company . Cons Work from Home option should be available to all staff. Advice to Management We need to open new horizon .", "rating": 5, "pros": "I know that I worked for a very reputable and professional company .", "cons": "Work from Home option should be available to all staff.", "advice": "We need to open new horizon ."}, {"title": "Great culture, management and transparency", "text": "Pros Investigo has a great culture. The senior management team are transparent and very approachable. Everyone in the company is valued individually and are made to feel that way. At Investigo people are encouraged to develop and grow. Overall a great place to work! Cons I couldn't say there are any! Advice to Management Keep it up! Open, honest and transparent is the way to go", "rating": 5, "pros": "Investigo has a great culture. The senior management team are transparent and very approachable. Everyone in the company is valued individually and are made to feel that way. At Investigo people are encouraged to develop and grow. Overall a great place to work!", "cons": "I couldn't say there are any!", "advice": "Keep it up! Open, honest and transparent is the way to go"}, {"title": "Great option!", "text": "Pros Company culture is great. Quite an autonomous environment where management will let you get on with things, provided that you can demonstrate your ability. Good feel about the business day to day, where people are genuinely happy and friendly. Excellent incentive rewards offered to everyone, every QTR. Commission structure reasonably good. Cons Promotion criteria, probably could be looked at Quite federated in terms of business units Work life balance can be looked at, but in comparison to market it's probably one of the better mid-sized agencies Advice to Management Maybe the business needs less non-billing management positions...", "rating": 5, "pros": "Company culture is great. Quite an autonomous environment where management will let you get on with things, provided that you can demonstrate your ability. Good feel about the business day to day, where people are genuinely happy and friendly. Excellent incentive rewards offered to everyone, every QTR. Commission structure reasonably good.", "cons": "Promotion criteria, probably could be looked at", "advice": "Maybe the business needs less non-billing management positions..."}, {"title": "First 5 weeks", "text": "Pros Fantastic training, very friendly environment, great team culture, and very accessible directors and CEO. Cons None have appeared at the moment Advice to Management Keep the accessibility to senior members in the business.", "rating": 5, "pros": "Fantastic training, very friendly environment, great team culture, and very accessible directors and CEO.", "cons": "None have appeared at the moment", "advice": "Keep the accessibility to senior members in the business."}, {"title": "Great place to work - lots of opportunities", "text": "Pros Highly entrepreneurial Lots of ambition Lots of fun Great training and development for staff at all levels Just because the business has grown doesn't mean it is a 'corporate' environment! Cons work-life balance could be improved", "rating": 5, "pros": "Highly entrepreneurial", "cons": "work-life balance could be improved", "advice": null}, {"title": "Great place to work - lots of opportunities", "text": "Pros Highly entrepreneurial Lots of ambition Lots of fun Great training and development for staff at all levels Just because the business has grown doesn't mean it is a 'corporate' environment! Cons work-life balance could be improved", "rating": 5, "pros": "Highly entrepreneurial", "cons": "work-life balance could be improved", "advice": null}, {"title": "Company Review", "text": "Pros The most positive thing about Investigo is the culture and the people. It sounds cliche' to say but it genuinely makes coming into work an absolute pleasure. Since my time here the support and training and has improved dramatically. There has been a real focus on making it a better environment for less experienced recruiters coming in and the thought and investment behind it has been second to none. Thirdly, the marketing team have drastically improved our brand and presence in the market. We have all learnt a lot from them and wouldn't be where we are today without their passion and commitment. Cons The only downside to Investigo is that the commission structure on the perm side is tough when coming in as a new recruiter or graduate. It is incredible once you are making money but isn't overly rewarding for those that are just starting out.", "rating": 5, "pros": "The most positive thing about Investigo is the culture and the people. It sounds cliche' to say but it genuinely makes coming into work an absolute pleasure.", "cons": "The only downside to Investigo is that the commission structure on the perm side is tough when coming in as a new recruiter or graduate. It is incredible once you are making money but isn't overly rewarding for those that are just starting out.", "advice": null}, {"title": "Fantabulous", "text": "Pros It is a tough climb but once you get there it is really worth it. There is a very rewarding commission scheme mixed with rewarding internal incentives. It seems like the organisation are genuinely concerned in their own continual development & improvement for the benefit of retaining top tier staff and that grounded sense of humility and inclusiveness very obviously resonates through the company. Cons Integration across the company is often spoken about but little is formally done to push this. I would recommend driving hot desking and to consider other initiatives to rotate seats around the company for the benefit of connecting the company better and improving cross-selling. Advice to Management Just keep looking at ways to improve things at the bottom line.", "rating": 5, "pros": "It is a tough climb but once you get there it is really worth it. There is a very rewarding commission scheme mixed with rewarding internal incentives. It seems like the organisation are genuinely concerned in their own continual development & improvement for the benefit of retaining top tier staff and that grounded sense of humility and inclusiveness very obviously resonates through the company.", "cons": "Integration across the company is often spoken about but little is formally done to push this. I would recommend driving hot desking and to consider other initiatives to rotate seats around the company for the benefit of connecting the company better and improving cross-selling.", "advice": "Just keep looking at ways to improve things at the bottom line."}, {"title": "Friendly and supportive company", "text": "Pros investigo is a company that you can build true friendship, work hard and get rewarded for your hard work. They truly invest in their people and you can be sure that your voice is always heard no matter what level you are. Cons Genuinely there aren't any - as is usual in the recruitment industry, hours are long but they actually don't feel like it here. they make it so much fun that you don't want to go home.... Advice to Management Keep doing what you are doing.", "rating": 5, "pros": "investigo is a company that you can build true friendship, work hard and get rewarded for your hard work. They truly invest in their people and you can be sure that your voice is always heard no matter what level you are.", "cons": "Genuinely there aren't any - as is usual in the recruitment industry, hours are long but they actually don't feel like it here. they make it so much fun that you don't want to go home....", "advice": "Keep doing what you are doing."}, {"title": "my past few years working at Investigo", "text": "Pros Autonomy, meritocracy, mix of talented individuals, unique culture Cons Occasional disjointed approach, the business could be better connected up at times Advice to Management Keep listening to feedback from staff and be prepared to act accordingly", "rating": 5, "pros": "Autonomy, meritocracy, mix of talented individuals, unique culture", "cons": "Occasional disjointed approach, the business could be better connected up at times", "advice": "Keep listening to feedback from staff and be prepared to act accordingly"}, {"title": "A fantastic place to work", "text": "Pros Investigo is a truly fantastic place to work. The company itself is highly ambitious and under the direction of a strong SLT has a clear strategy of how to reach their goals. Investigo is very much a meritocracy and this can clearly be seen throughout the entire business. What is expected of you as a consultant is made clear and you are given all the tools you need to get there. When I joined, I was amazed to see just how much market knowledge each consultant had and everyone across the business is always happy to lend a hand when needed - this is embodied in the \"One Investigo\" culture. Other highlights include the quarterly high flyer trips (all expenses paid at fantastic global locations), great company events in the UK (namely the annual conference) and as a business I am proud of all of Investigo's charity work. I wouldn't hesitate in recommending Investigo to anybody. Thanks for everything guys! Cons Genuinely there aren't any - as is usual in the recruitment industry, hours are long but they actually don't feel like it here! Advice to Management Keep doing what you're doing!", "rating": 5, "pros": "Investigo is a truly fantastic place to work. The company itself is highly ambitious and under the direction of a strong SLT has a clear strategy of how to reach their goals.", "cons": "Genuinely there aren't any - as is usual in the recruitment industry, hours are long but they actually don't feel like it here!", "advice": "Keep doing what you're doing!"}, {"title": "OK", "text": "Pros If you are in the top 5% you can earn good money here Cons A little cliquey, not really any progression", "rating": 3, "pros": "If you are in the top 5% you can earn good money here", "cons": "A little cliquey, not really any progression", "advice": null}, {"title": "Professional, Fun, Growing", "text": "Pros - Professional, ambitious, positive culture and working environment - Rapidly improving structure for new joiners and junior members of staff - Potential to rise through the ranks rapidly - Good commission scheme - Great company trips and events, both for high achievers and all staff Cons - Progression options although can be rapid, are limited for a lot of people Advice to Management - Commission scheme although excellent overall doesn't improve past a certain point so an average performer is compensated proportionally the same as someone in the top quartile or decile - Introduce further achievement milestones", "rating": 5, "pros": "- Professional, ambitious, positive culture and working environment", "cons": "- Progression options although can be rapid, are limited for a lot of people", "advice": "- Commission scheme although excellent overall doesn't improve past a certain point so an average performer is compensated proportionally the same as someone in the top quartile or decile"}, {"title": "Fantastic platform", "text": "Pros After 14 years in recruitment, I have finally found a platform and brand that I am proud to represent. Honest, direct talking senior management and a clear vision and understanding of own brand, investigo have created a culture of accountability and honesty. The growth strategy not only encourages internal talent but recognises the need to hire externally should a division or team need to upskill. I was fortunate to find a business and division that have welcomed an honest and hands on approach which is now seeing success thanks to the team in place and CEO/ED encouragement. The business simply wants you to do well and provides ample support for those with the right attitude. Those who don't? This isn't the place for you.... we want positivity, encourage growth and ambition. With a fantastic balance of experience versus trainees, the business has a breadth of experience and knowledge as well as a strategy for future talent. Ever increasing focus is being placed on training using external support as well as our own talent. Impressive billings for top performers and one of the very best commission structures and a fabulous list of clients to leverage..... a serious consideration for anyone who both love the job and want a platform (without setting up on your own!) to earn some serious money and work with a fabulous group of people.... love it.... reading the above?? Why on earth wouldn't you join. Cons Very few .....struggling to think Advice to Management Keep it up, continue the work and maintain the energy whilst growing the business! Continue to be transparent and having the Directors lead from the front .....", "rating": 5, "pros": "After 14 years in recruitment, I have finally found a platform and brand that I am proud to represent. Honest, direct talking senior management and a clear vision and understanding of own brand, investigo have created a culture of accountability and honesty. The growth strategy not only encourages internal talent but recognises the need to hire externally should a division or team need to upskill. I was fortunate to find a business and division that have welcomed an honest and hands on approach which is now seeing success thanks to the team in place and CEO/ED encouragement.", "cons": "Very few .....struggling to think", "advice": "Keep it up, continue the work and maintain the energy whilst growing the business! Continue to be transparent and having the Directors lead from the front ....."}, {"title": "Depends which team you are on!", "text": "Pros Good company culture / events / location Cons The management team are all best friends outside of work. Can be very unprofessional.", "rating": 3, "pros": "Good company culture / events / location", "cons": "The management team are all best friends outside of work. Can be very unprofessional.", "advice": null}, {"title": "My thoughts on the business", "text": "Pros Having been with the business for several years I have seen a great deal of change. Aside from general growth the company has never changed its core value, which is to be the best they can be but having fun doing it. I can honestly say it is the best recruitment environment I been exposed to and one that really pushes you to excel. Atmosphere is great, incentives are fantastic and the leaders care. Cons In my opinion there are no real stand out weaknesses with the business model. A few years back they lacked real training for newbies but they has been rectified. Advice to Management Keep it fun", "rating": 5, "pros": "Having been with the business for several years I have seen a great deal of change. Aside from general growth the company has never changed its core value, which is to be the best they can be but having fun doing it. I can honestly say it is the best recruitment environment I been exposed to and one that really pushes you to excel. Atmosphere is great, incentives are fantastic and the leaders care.", "cons": "In my opinion there are no real stand out weaknesses with the business model. A few years back they lacked real training for newbies but they has been rectified.", "advice": "Keep it fun"}, {"title": "Life at Investigo", "text": "Pros Good work life balance, no egos & I'm treated like an adult. Cons Not as much autonomy as is sold in interview & senior people in the business could be a lot more helpful. Advice to Management Go through what your employees want from their recruitment career, i.e. personal development plans etc. A more tailored approach is necessary - we have way too much of a \"one size fits all mentality\".", "rating": 5, "pros": "Good work life balance, no egos & I'm treated like an adult.", "cons": "Not as much autonomy as is sold in interview & senior people in the business could be a lot more helpful.", "advice": "Go through what your employees want from their recruitment career, i.e. personal development plans etc. A more tailored approach is necessary - we have way too much of a \"one size fits all mentality\"."}, {"title": "Working at Investigo", "text": "Pros This has been without a doubt, the best career move I have made to date. Working for a business who genuinely care about their employees and give them the best possible opportunity to earn good money, offer career progression and development to those who want it/ earn it. I couldn't recommend Investigo highly enough. Cons Bring back summer Ibiza Trip", "rating": 5, "pros": "This has been without a doubt, the best career move I have made to date. Working for a business who genuinely care about their employees and give them the best possible opportunity to earn good money, offer career progression and development to those who want it/ earn it. I couldn't recommend Investigo highly enough.", "cons": "Bring back summer Ibiza Trip", "advice": null}, {"title": "Refreshing", "text": "Pros Investigo really does live up to all you are told before hand. Everyone wants you to succeed and are open and transparent. All management are visible and approachable, and invest the time in you. I enjoy coming to work! Cons More integration between regional offices. Advice to Management Make sure vision/changes are cascaded down to all employees.", "rating": 5, "pros": "Investigo really does live up to all you are told before hand. Everyone wants you to succeed and are open and transparent. All management are visible and approachable, and invest the time in you. I enjoy coming to work!", "cons": "More integration between regional offices.", "advice": "Make sure vision/changes are cascaded down to all employees."}, {"title": "Manager", "text": "Pros Great Brand and good people. If your talented you can make lots of money in this business! Best agency out there! Cons Due to the growth it's losing a little of it's uniqueness and becoming more corporate, but that's to be expected and still good business! Advice to Management Don't change Investigo", "rating": 5, "pros": "Great Brand and good people.", "cons": "Due to the growth it's losing a little of it's uniqueness and becoming more corporate, but that's to be expected and still good business!", "advice": "Don't change Investigo"}, {"title": "Great place to work", "text": "Pros Investigo actually practice what they preach and fully support you in building your business, are genuinely interested in how you're progressing (right up to the CEO) and are definitely focused on differentiating themselves through the people they hire and the long term relationships they build. They expect you to work hard, be passionate about what you do and have a desire to succeed but what successful company doesn't. If you focus on what's needed to drive your business forward and are doing the right things then this is a company you can definitely have a long-term career with. Things won't necessarily happen overnight and it might take a while to establish yourself and feel like you're making headway but there is the continued support and understanding that makes Investigo feel significantly different from the majority of companies I've worked for. Not to mention it's good fun and there appears to be a 'no idiot' policy which certainly seems to be the case in the people I've met so far! Cons None so far - just make sure you're tenacious, resilient and driven if you want to be successful and fulfilled in a career in recruitment. Advice to Management Keep ensuring that senior management are visible and approachable as that flat structure and accessibility really makes a difference.", "rating": 5, "pros": "Investigo actually practice what they preach and fully support you in building your business, are genuinely interested in how you're progressing (right up to the CEO) and are definitely focused on differentiating themselves through the people they hire and the long term relationships they build. They expect you to work hard, be passionate about what you do and have a desire to succeed but what successful company doesn't.", "cons": "None so far - just make sure you're tenacious, resilient and driven if you want to be successful and fulfilled in a career in recruitment.", "advice": "Keep ensuring that senior management are visible and approachable as that flat structure and accessibility really makes a difference."}, {"title": "Fantastic environment", "text": "Pros The people at Investigo make this company one of the best places I have ever worked. Its a great balance of structure and autonomy. I have already recommended 2 friends to the business that have both been here at least 6 months and are loving it. Cons Business Communication can be improved Advice to Management Clearer process around new starters.", "rating": 5, "pros": "The people at Investigo make this company one of the best places I have ever worked.", "cons": "Business Communication can be improved", "advice": "Clearer process around new starters."}, {"title": "My first 3 months at Investigo", "text": "Pros My first 3 months at Investigo have not only been an eye opener but it has made me see recruitment in a different light. Investigo are not only a brand but they are a a family that support you well in your early days. Cons There are no cons to the business Investigo are what they say they are a recruitment company that have values which are work hard and make money if you dont make money work hard. Communication is key and as a company we just need to make sure that stays at the for front of the daily tasks. Advice to Management Keep doing what your doing as your making moves.", "rating": 5, "pros": "My first 3 months at Investigo have not only been an eye opener but it has made me see recruitment in a different light. Investigo are not only a brand but they are a a family that support you well in your early days.", "cons": "There are no cons to the business Investigo are what they say they are a recruitment company that have values which are work hard and make money if you dont make money work hard. Communication is key and as a company we just need to make sure that stays at the for front of the daily tasks.", "advice": "Keep doing what your doing as your making moves."}, {"title": "Mature growing company", "text": "Pros Mostly experienced employees, no micro management, senior management very visible and approachable. Cons A lot of conflicting personalities, company growing quite large so it is a little more challenging to \"keep everyone happy\" Advice to Management Keep the mature, enjoyable culture that we all love.", "rating": 5, "pros": "Mostly experienced employees, no micro management, senior management very visible and approachable.", "cons": "A lot of conflicting personalities, company growing quite large so it is a little more challenging to \"keep everyone happy\"", "advice": "Keep the mature, enjoyable culture that we all love."}, {"title": "Recent Investigo Experience", "text": "Pros A fantastic recruitment business. Very mature, grown-up environment - individuals are genuinely trusted to do their job without constant micro-management and pressures of KPIs. The directors and Associate Directors have been with the company for a long time and are extremely passionate about it. Incentives are good and there is a genuine hope that people make the incentive criteria - the company actually wants to pay staff bonuses which isn't always the case. Very good social element, good mixture of staff in terms of backgrounds and diversity and fantastic office and location. Cons Very little to complain about. Advice to Management None", "rating": 5, "pros": "A fantastic recruitment business. Very mature, grown-up environment - individuals are genuinely trusted to do their job without constant micro-management and pressures of KPIs. The directors and Associate Directors have been with the company for a long time and are extremely passionate about it. Incentives are good and there is a genuine hope that people make the incentive criteria - the company actually wants to pay staff bonuses which isn't always the case. Very good social element, good mixture of staff in terms of backgrounds and diversity and fantastic office and location.", "cons": "Very little to complain about.", "advice": "None"}, {"title": "Salary", "text": "Pros Strong commission scheme and mature culture Cons Lack of consistency of annual reviews", "rating": 5, "pros": "Strong commission scheme and mature culture", "cons": "Lack of consistency of annual reviews", "advice": null}, {"title": "Great place to work!", "text": "Pros As the title says, Investigo is a great place to work. Great atmosphere in the office and a great work culture. Leaving due to a change in career path. Cons Those 2 days when the AC broke, wow that was hard.. :D Advice to Management Keep up the good work.", "rating": 5, "pros": "As the title says, Investigo is a great place to work.", "cons": "Those 2 days when the AC broke, wow that was hard.. :D", "advice": "Keep up the good work."}, {"title": "Better than your average", "text": "Pros Good recruiters Fair bonus Managers also work a desk Cons Very, very high expectations A bit cheeses in the approach", "rating": 3, "pros": "Good recruiters", "cons": "Very, very high expectations", "advice": null}, {"title": "Outstanding company with fantastic growth plans!", "text": "Pros I have been working at Investigo for around 4 months and so far the experience has been extremely positive. The working environment is enjoyable and everyone is extremely helpful regardless of level and title. Senior management are as approachable as anyone in the business and are always happy to assist in things as simple as the best person to contact in a target firm. Targets are thought out and defined by the recruiter which steers completely away from the \"hire em, fire em\" type of business. I would highly recommend Investigo to anyone looking to expand on their recruitment career. Cons Sometimes the hot chocolate machine runs out and the result is devastating to all concerned.", "rating": 5, "pros": "I have been working at Investigo for around 4 months and so far the experience has been extremely positive. The working environment is enjoyable and everyone is extremely helpful regardless of level and title. Senior management are as approachable as anyone in the business and are always happy to assist in things as simple as the best person to contact in a target firm.", "cons": "Sometimes the hot chocolate machine runs out and the result is devastating to all concerned.", "advice": null}, {"title": "I look forward to coming into work", "text": "Pros Genuinely one of the best companies i have worked for. It is an autonomous environment, where everyone works hard and wants to do well. It is also a really fun place to work, if you want to socialise then there is never an opportunity too far away. They also have regular company-wide meets, which all makes for a much more enjoyable working environment. Senior Management are always visible across the office and are completely approachable. I look forward to coming into work. Cons Nothing to note. It's a long working day but that's recruitment and the days fly by so I can't complain. Advice to Management Just make sure that the company's great culture is maintained as the company grows further.", "rating": 5, "pros": "Genuinely one of the best companies i have worked for. It is an autonomous environment, where everyone works hard and wants to do well. It is also a really fun place to work, if you want to socialise then there is never an opportunity too far away. They also have regular company-wide meets, which all makes for a much more enjoyable working environment. Senior Management are always visible across the office and are completely approachable. I look forward to coming into work.", "cons": "Nothing to note. It's a long working day but that's recruitment and the days fly by so I can't complain.", "advice": "Just make sure that the company's great culture is maintained as the company grows further."}, {"title": "The best recruitment company I have worked for...", "text": "Pros My fears when starting a new role are that I have been miss-sold the role/company culture/commission structure/career progression. At Investigo this has not been the case and on starting with the company - over a year ago now, everything was exactly as it was described to me in the interview process - if anything I have found the reality to be better! The culture here is very adult and autonomous which I feel works well for ambitious self starters. You are surrounded by talented recruiters, some of the best I have ever worked along side. I was amazed to learn that the senior management are hands on recruiters and some of the companies biggest billers. They have always been accessible and supportive to me. My successes are rewarded financially and I enjoy being incentivised by the amazing quarterly trips which the company run. Career progression is transparent and meritocratic and I am looking forward to developing my career with Investigo for many more years. Cons I don't have any cons about Investigo. Advice to Management Keep up the good work!", "rating": 5, "pros": "My fears when starting a new role are that I have been miss-sold the role/company culture/commission structure/career progression.", "cons": "I don't have any cons about Investigo.", "advice": "Keep up the good work!"}, {"title": "I had a great few years at Investigo", "text": "Pros Investigo is a great business, which has stayed true to it's original values, with a business wide focus on exceptional candidate care. It is an ambitious, passionate and driven culture to work in. Senior management are very approachable for all types of day to day recruitment advice. Cons I cant really think of any. Advice to Management Make sure the autonomous and adult environment for consultants doesn't get diluted as the business grows.", "rating": 5, "pros": "Investigo is a great business, which has stayed true to it's original values, with a business wide focus on exceptional candidate care. It is an ambitious, passionate and driven culture to work in. Senior management are very approachable for all types of day to day recruitment advice.", "cons": "I cant really think of any.", "advice": "Make sure the autonomous and adult environment for consultants doesn't get diluted as the business grows."}, {"title": "A unique but fantastic organisation", "text": "Pros Without doubt, the best company I have ever worked for. You will be surrounded by very motivated people with a wealth of experience. There is a great culture cultivated by a team of excellent people. Cons NONE! NONE! NONE! NONE! NONE! Advice to Management Don't ever lose sight that the people are our greatest asset.", "rating": 5, "pros": "Without doubt, the best company I have ever worked for. You will be surrounded by very motivated people with a wealth of experience. There is a great culture cultivated by a team of excellent people.", "cons": "NONE! NONE! NONE! NONE! NONE!", "advice": "Don't ever lose sight that the people are our greatest asset."}, {"title": "Great experience", "text": "Pros Good atmosphere good management always a pleasure to come in to work can't think of any thing else to say about the matter Cons None to speak of especially if I want to carry on with my career or have any job prospects at all.", "rating": 5, "pros": "Good atmosphere good management always a pleasure to come in to work can't think of any thing else to say about the matter", "cons": "None to speak of especially if I want to carry on with my career or have any job prospects at all.", "advice": null}, {"title": "Great impression", "text": "Pros Having spent several years in a larger recruitment business, I joined Investigo having been impressed with the senior team and the sense of autonomy on offer. My impressions prior to joining were that the name was weird (I have since found out it means 'to Investigate' in Latin), that they were hiring aggressiely and therefore must a very salesy/boiler room culture. I couldn't have been more wrong! The reality is that it is an adult environment, made up of people who joined from other recruitment businesses where they were driven to hit KPIs, call times and sales targets. A good measure of the culture is the amount of people who have returned to the business, which is unusually high. I guess those returners have realised that the grass definitely isn't greener. Cons I personally think that it takes great self motivation to work here! Having worked for so long in a culture of KPIs and measures, it is a bit of a shock to be left to get on with things. I can see how some people will struggle with this change, so picking this up earlier is crucial. Advice to Management Having now experienced it, I can see that Investigo is different, but we have to work a lot harder to represent this in the market. Also, keep up the quarterly drinks, Christmas parties etc, it is all part of the fun!", "rating": 5, "pros": "Having spent several years in a larger recruitment business, I joined Investigo having been impressed with the senior team and the sense of autonomy on offer. My impressions prior to joining were that the name was weird (I have since found out it means 'to Investigate' in Latin), that they were hiring aggressiely and therefore must a very salesy/boiler room culture. I couldn't have been more wrong! The reality is that it is an adult environment, made up of people who joined from other recruitment businesses where they were driven to hit KPIs, call times and sales targets. A good measure of the culture is the amount of people who have returned to the business, which is unusually high. I guess those returners have realised that the grass definitely isn't greener.", "cons": "I personally think that it takes great self motivation to work here! Having worked for so long in a culture of KPIs and measures, it is a bit of a shock to be left to get on with things. I can see how some people will struggle with this change, so picking this up earlier is crucial.", "advice": "Having now experienced it, I can see that Investigo is different, but we have to work a lot harder to represent this in the market. Also, keep up the quarterly drinks, Christmas parties etc, it is all part of the fun!"}, {"title": "1 Year and counting", "text": "Pros A great team spirit throughout the business in London and the regional offices. People talked about the internal network being more powerful than the external when I joined and Investigo backs this up. Strong relationships across multiple disciplines and industries has enabled me to work with numerous clients that I had struggled with at my previous company. Investigo provides me a platform and the opportunity to succeed as a recruitment consultant and genuinely change my life for the better. Really amazing group of people and there's always a group to enjoy the successes with either after work or away on the company trips. Cons Too great an opportunity to miss out on doing well and therefore plenty of early mornings and late nights!! Advice to Management A review of the expenses structure to allow for a faster payment within 48 hours of submission would make it more attractive to visit clients / candidates especially during the early stages of the career.", "rating": 5, "pros": "A great team spirit throughout the business in London and the regional offices. People talked about the internal network being more powerful than the external when I joined and Investigo backs this up. Strong relationships across multiple disciplines and industries has enabled me to work with numerous clients that I had struggled with at my previous company. Investigo provides me a platform and the opportunity to succeed as a recruitment consultant and genuinely change my life for the better. Really amazing group of people and there's always a group to enjoy the successes with either after work or away on the company trips.", "cons": "Too great an opportunity to miss out on doing well and therefore plenty of early mornings and late nights!!", "advice": "A review of the expenses structure to allow for a faster payment within 48 hours of submission would make it more attractive to visit clients / candidates especially during the early stages of the career."}, {"title": "You look forward to coming into work everyday!", "text": "Pros Working with some great people who truly are industry experts and have fantastic networks. All employees know how to work hard but also know how to have fun. You're made to feel welcome from the very moment you join. The Directors lead from the front which is an excellent example to set. Cons If you're used to constantly hitting KPIs and being told what to do, it's likely you won't fit in at Investigo. Everyone here's very entrepreneurial and knows how to manage their day and make money. Advice to Management As Investigo continues to grow, try not to lose what makes it such an amazing company to work for at this point in time.", "rating": 5, "pros": "Working with some great people who truly are industry experts and have fantastic networks. All employees know how to work hard but also know how to have fun. You're made to feel welcome from the very moment you join. The Directors lead from the front which is an excellent example to set.", "cons": "If you're used to constantly hitting KPIs and being told what to do, it's likely you won't fit in at Investigo. Everyone here's very entrepreneurial and knows how to manage their day and make money.", "advice": "As Investigo continues to grow, try not to lose what makes it such an amazing company to work for at this point in time."}, {"title": "Great place to work..", "text": "Pros Investigo is a vibrant and dynamic company with entrepreneurial spirit and Management is good at making changes as required, unlike some larger corporate recruiters. The people, consultants and support, are great in their roles and create a very friendly and fun environment. Along with very generous commission structures, there are some great incentives such as quarterly high achievers trips, annual away conference, etc. It is also satisfying to be part of a company that year on year contributes to various charities, giving directly as well as through fund-raising efforts - the passionate commitment to charitable causes of especially one of the co-founders is very inspirational. Cons I don't believe there are any. Advice to Management Carry on growing the company with the same energy and commitment to all stakeholders.", "rating": 5, "pros": "Investigo is a vibrant and dynamic company with entrepreneurial spirit and Management is good at making changes as required, unlike some larger corporate recruiters. The people, consultants and support, are great in their roles and create a very friendly and fun environment. Along with very generous commission structures, there are some great incentives such as quarterly high achievers trips, annual away conference, etc. It is also satisfying to be part of a company that year on year contributes to various charities, giving directly as well as through fund-raising efforts - the passionate commitment to charitable causes of especially one of the co-founders is very inspirational.", "cons": "I don't believe there are any.", "advice": "Carry on growing the company with the same energy and commitment to all stakeholders."}, {"title": "Working Family", "text": "Pros I've worked at Investigo for a year now and have never been happier in a role. I'm based in the Guildford office and we have a great working atmosphere and certainly has a family feel to it. We're driven to make money because we want to rather than be pushed by KPI targets. The incentives are great and we regularly have social events to build relationships with the other offices. Cons I think the commission structure is great for senior consultants billing in excess of £200k a year but I don't think it's kind consultants who are relatively new and still building their network.", "rating": 5, "pros": "I've worked at Investigo for a year now and have never been happier in a role. I'm based in the Guildford office and we have a great working atmosphere and certainly has a family feel to it. We're driven to make money because we want to rather than be pushed by KPI targets. The incentives are great and we regularly have social events to build relationships with the other offices.", "cons": "I think the commission structure is great for senior consultants billing in excess of £200k a year but I don't think it's kind consultants who are relatively new and still building their network.", "advice": null}, {"title": "'Recruitment Entrepreneurship'", "text": "Pros Investigo is definitely the recruitment company to work for if you like autonomy and thrive at building your business, the best way you see fit. Given the nature of how the business expanded initially, there are plenty of high calibre Consultants and Directors to collaborate with, which helps create a high performance culture. Cons Given the above statement, the autonomy afforded can also be a downfall if you are not highly organised and disciplined! Advice to Management None at this point.", "rating": 5, "pros": "Investigo is definitely the recruitment company to work for if you like autonomy and thrive at building your business, the best way you see fit. Given the nature of how the business expanded initially, there are plenty of high calibre Consultants and Directors to collaborate with, which helps create a high performance culture.", "cons": "Given the above statement, the autonomy afforded can also be a downfall if you are not highly organised and disciplined!", "advice": "None at this point."}, {"title": "Lively, fast paced and great culture", "text": "Pros Coming into Investigo they look at both personality and cultural fit, which means your colleagues are like-minded people with the same drive to succeed. Senior Leadership is highly visible every single day, including the CEO, and encourage an open line of communication. Investigo has one of the best commission structures in the industry and there is a clear line of progression; I joined earlier this year and have already enjoyed my first promotion. While the company has grown to over 150 people in a short space of time, it has remained true to its values and culture, and it retains the feel of a small, friendly business. Cons Because the business model has previously focussed on hiring experienced, expert recruiters, when the business does hire younger graduates, or inexperienced recruiters, the lack of structure can make the learning curve quite a steep one. Advice to Management Make sure the support stays constant - you're all doing a great job!", "rating": 5, "pros": "Coming into Investigo they look at both personality and cultural fit, which means your colleagues are like-minded people with the same drive to succeed. Senior Leadership is highly visible every single day, including the CEO, and encourage an open line of communication. Investigo has one of the best commission structures in the industry and there is a clear line of progression; I joined earlier this year and have already enjoyed my first promotion. While the company has grown to over 150 people in a short space of time, it has remained true to its values and culture, and it retains the feel of a small, friendly business.", "cons": "Because the business model has previously focussed on hiring experienced, expert recruiters, when the business does hire younger graduates, or inexperienced recruiters, the lack of structure can make the learning curve quite a steep one.", "advice": "Make sure the support stays constant - you're all doing a great job!"}, {"title": "Experience at Investigo", "text": "Pros Investigo is a very well run organisation, with a strong culture and a senior management team who lead by example. Compared to its competitors, individuals are given a lot more autonomy and trust, meaning people can play to their strengths and run their own mini-businesses as they see fit. The rewards are also exceptional, from commission / bonus structure to quarterly high-achievers trips and an annual trip abroad for the entire firm. Cons This is somewhere only for people who are comfortable being held accountable. There is no hiding place, you are generally surrounded by very successful peers and are expected to deliver consistently. Advice to Management Keep leading by example, keep the bar high when hiring new people into the business and keep up the regular communication with all employees.", "rating": 5, "pros": "Investigo is a very well run organisation, with a strong culture and a senior management team who lead by example. Compared to its competitors, individuals are given a lot more autonomy and trust, meaning people can play to their strengths and run their own mini-businesses as they see fit.", "cons": "This is somewhere only for people who are comfortable being held accountable. There is no hiding place, you are generally surrounded by very successful peers and are expected to deliver consistently.", "advice": "Keep leading by example, keep the bar high when hiring new people into the business and keep up the regular communication with all employees."}, {"title": "An outstanding business to work for with great people!", "text": "Pros Every area of the business regardless of level or business area are all working towards the same goal. There are a few common traits that Investigo's people posses; being self motivated, driven and dedicated. If you shy away from hard work, Investigo isn't the place for you but guaranteed you will enjoy coming to work everyday if you share the same values! Management are right there next to you, recruiting, using the system and leading from the front - this inspires everyone in the office and it's refreshing to see them doing the same job as the consultants! Cons The systems need bringing up to speed but this is something that the business are working on. Advice to Management Don't change a thing! The management and consultants have got it spot on!", "rating": 5, "pros": "Every area of the business regardless of level or business area are all working towards the same goal. There are a few common traits that Investigo's people posses; being self motivated, driven and dedicated. If you shy away from hard work, Investigo isn't the place for you but guaranteed you will enjoy coming to work everyday if you share the same values! Management are right there next to you, recruiting, using the system and leading from the front - this inspires everyone in the office and it's refreshing to see them doing the same job as the consultants!", "cons": "The systems need bringing up to speed but this is something that the business are working on.", "advice": "Don't change a thing! The management and consultants have got it spot on!"}, {"title": "Best company I have worked for to date!", "text": "Pros I joined Investigo with no previous recruitment experience and the level of training and support I received when joining and continue to receive today is first class! The only company I have worked for that continue to develop their staff even nearly 2 years after joining. I couldn't rate anymore highly! Cons Nothing I can comment on to date", "rating": 5, "pros": "I joined Investigo with no previous recruitment experience and the level of training and support I received when joining and continue to receive today is first class! The only company I have worked for that continue to develop their staff even nearly 2 years after joining. I couldn't rate anymore highly!", "cons": "Nothing I can comment on to date", "advice": null}, {"title": "Investigo", "text": "Pros I came to Investigo as a graduate straight from Uni. After interviewing at lots of places to ensure I found the right one, Investigo have lived up to my expectations and more. The culture is great, everyone was very welcoming and made me feel comfortable straight away. The training and support given by management and the wider business has been second to none. Cons i can't really think of any!", "rating": 5, "pros": "I came to Investigo as a graduate straight from Uni. After interviewing at lots of places to ensure I found the right one, Investigo have lived up to my expectations and more. The culture is great, everyone was very welcoming and made me feel comfortable straight away. The training and support given by management and the wider business has been second to none.", "cons": "i can't really think of any!", "advice": null}, {"title": "Fantastic Graduate Job", "text": "Pros As a graduate coming into Investigo (and first job in recruitment) I have received great training and a clear progression path. I obtained promotion in about 6 months and the next step up is clear and achievable. Exposure to senior management has been far above anything that I would ever have expected; everybody sets aside time for you and I have had multiple one-on-ones with various directors and senior figures. Earning potential for graduates is second to none. You are trusted to work autonomously with a supporting management style rather than a supervisory one. Cons Not a negative in my eyes but if you need supervision and cannot work well in an autonomous environment then perhaps this would not be the right place Advice to Management Keep it up! Management has been very supportive throughout my time here and made me feel like a valued part of the business.", "rating": 5, "pros": "As a graduate coming into Investigo (and first job in recruitment) I have received great training and a clear progression path. I obtained promotion in about 6 months and the next step up is clear and achievable. Exposure to senior management has been far above anything that I would ever have expected; everybody sets aside time for you and I have had multiple one-on-ones with various directors and senior figures. Earning potential for graduates is second to none. You are trusted to work autonomously with a supporting management style rather than a supervisory one.", "cons": "Not a negative in my eyes but if you need supervision and cannot work well in an autonomous environment then perhaps this would not be the right place", "advice": "Keep it up! Management has been very supportive throughout my time here and made me feel like a valued part of the business."}, {"title": "An excellent place to work", "text": "Pros Investigo is an excellent place to work. Recruitment companies have a reputation for not always treating their staff well, but at Investigo you always feel valued. The company has an honest and friendly culture and senior management are always on hand to give advice and support. I have worked at four other recruitment businesses and this is by far the best. They have the balance between having fun and working hard, as well as rewarding their staff with a great commission scheme and regular incentives / high performer trips. I have been with the business for a year and I will not be going anywhere for years to come. Cons I really can't think of any negatives about Investigo as a place to work.", "rating": 5, "pros": "Investigo is an excellent place to work. Recruitment companies have a reputation for not always treating their staff well, but at Investigo you always feel valued. The company has an honest and friendly culture and senior management are always on hand to give advice and support.", "cons": "I really can't think of any negatives about Investigo as a place to work.", "advice": null}, {"title": "A pleasant environment of experienced professionals", "text": "Pros Majority of the company are from experienced backgrounds. There are a variety of personalities leading to an interesting and energetic dynamic. Cons As the company grows, it becomes a little trickier to maintain the close relationships that were built when the company was smaller.", "rating": 5, "pros": "Majority of the company are from experienced backgrounds. There are a variety of personalities leading to an interesting and energetic dynamic.", "cons": "As the company grows, it becomes a little trickier to maintain the close relationships that were built when the company was smaller.", "advice": null}, {"title": "My time at Investigo was full of success, opportunity, fun and enjoyment", "text": "Pros I joined Investigo over 9 years ago and have never worked for a better company. Over the 9 years I have been privileged to be part of a growing team and business giving me the opportunity to excel in my career. Investigo gives you the chance to operate your desk at a really entrepreneurial level whilst being supported and surrounded by truly talented individuals including the Co-Founders. The Directors and Managers remain hands on recruiter, leading by example. The support Investigo have shown since I joined has been unrivalled especially on returning after maternity leave and having relocated Investigo were able to offer me flexibility, work life balance and support. Investigo has evolved from 20 people to 170 people in a relatively short period of time but have successfully maintained the culture, values and autonomy but also offering more structured training, incentives and opportunities for employee’s to be part of innovative projects. My time at Investigo was full of success, opportunity, fun and enjoyment, although I was sad to leave I left with some great memories. Cons Systems use needs to be consistent across the business however this was being addressed before I left. Having to leave the business due to relocating to Bath.", "rating": 5, "pros": "I joined Investigo over 9 years ago and have never worked for a better company. Over the 9 years I have been privileged to be part of a growing team and business giving me the opportunity to excel in my career. Investigo gives you the chance to operate your desk at a really entrepreneurial level whilst being supported and surrounded by truly talented individuals including the Co-Founders. The Directors and Managers remain hands on recruiter, leading by example. The support Investigo have shown since I joined has been unrivalled especially on returning after maternity leave and having relocated Investigo were able to offer me flexibility, work life balance and support. Investigo has evolved from 20 people to 170 people in a relatively short period of time but have successfully maintained the culture, values and autonomy but also offering more structured training, incentives and opportunities for employee’s to be part of innovative projects. My time at Investigo was full of success, opportunity, fun and enjoyment, although I was sad to leave I left with some great memories.", "cons": "Systems use needs to be consistent across the business however this was being addressed before I left. Having to leave the business due to relocating to Bath.", "advice": null}, {"title": "More than just a recruitment firm", "text": "Pros Despite growing in size over the years, it is amazing how Investigo has done very well to maintain the culture within the company. If I could describe it in one word, it is like a family here. It is a non-hierarchical organisation where the amount of support is readily given. Senior management genuinely listens to the ideas of the employees here and readily lead from the front. There is a great culture of “working hard and playing hard”, and our hard work is often rewarded with great incentives. It is more than just a recruitment firm. It is a firm that encourages team work, fun and laughter, creativity and above it all, it is a firm where everyone works unitedly towards a common goal of making this company a success. Cons the employees in Investigo are all self motivated and work hard. If you are a person who doesn't fit that criteria, this may not be the place for you Advice to Management Keep up the good work!", "rating": 5, "pros": "Despite growing in size over the years, it is amazing how Investigo has done very well to maintain the culture within the company. If I could describe it in one word, it is like a family here.", "cons": "the employees in Investigo are all self motivated and work hard. If you are a person who doesn't fit that criteria, this may not be the place for you", "advice": "Keep up the good work!"}, {"title": "Sad to say Goodbye", "text": "Pros I joined Investigo over 7 years ago when there were just 30 people and I sat opposite one of the Co-Founders, who I found to be an inspiring and motivational leader. The business has since successfully grown and inevitably changed, however continues to be an exciting and rewarding place to work. It is no longer the small, growing, entrepreneurial business I joined, but is an established, successful business which continues to hold on to its entrepreneurial spirit. Through motivational leadership and understanding of my own personal goals, Investigo helped me develop my skills as a recruiter and ultimately benefit from the excellent commission and bonus structure. The business also supported me in my own personal changes and as a working mum, were able to provide the flexibility that allowed me to continue my career post children. I leave having made some excellent friends and with some brilliant memories. Investigo is a fantastic business for any strong willed individual to join – it is fun, rewards hard work and success, and has inspiring people within the business. Cons Systems use needs to be consistent across the business. Managers are targeted on their own billings as well as their teams, which is a positive in that they are leading from the front, however drive for personal billings can take away from supporting the teams billings. Advice to Management Continue to inspire.", "rating": 5, "pros": "I joined Investigo over 7 years ago when there were just 30 people and I sat opposite one of the Co-Founders, who I found to be an inspiring and motivational leader. The business has since successfully grown and inevitably changed, however continues to be an exciting and rewarding place to work. It is no longer the small, growing, entrepreneurial business I joined, but is an established, successful business which continues to hold on to its entrepreneurial spirit.", "cons": "Systems use needs to be consistent across the business.", "advice": "Continue to inspire."}, {"title": "Different from the norm", "text": "Pros A \"grown up\" company who offer excellent rewards to self-motivated, talented individuals. Having come from an environment that measures and watches everything you do, the level of autonomy and trust is not only refreshing but also incredibly empowering. Cons So far, no negatives to report Advice to Management Keep doing what you are doing!", "rating": 5, "pros": "A \"grown up\" company who offer excellent rewards to self-motivated, talented individuals. Having come from an environment that measures and watches everything you do, the level of autonomy and trust is not only refreshing but also incredibly empowering.", "cons": "So far, no negatives to report", "advice": "Keep doing what you are doing!"}, {"title": "Investigo Review", "text": "Pros -Fun and positive environment to work in. -Yearly and quarterly trips (this year alone - Dubai, Amsterdam, Lisbon and Marrakesh). -Job expectations are clear so you are always aware of what you are doing. -All staff are extremely talented at what they do and the management are consistently supportive. Cons No cons, just keep doing what they are doing. Advice to Management None!", "rating": 5, "pros": "-Fun and positive environment to work in.", "cons": "No cons, just keep doing what they are doing.", "advice": "None!"}, {"title": "Principal Consultant", "text": "Pros An exceptionally entrepreneurial environment that actively encourages people to think on their own. Offers a great platform for strong sales individuals to build and develop their particular sections. Fantastic sales benefits including quarterly high achiever trips ( Ibiza, Lisbon, Amsterdam etc ) as well as a very lucrative platinum bonus. Cons Is a fantastic environment if you have previous experience in recruitment/sales but I do not think it is the best initial platform for rookies. Systems are now in place to improve this however this will take some time. Other than this, the company is the best set up I have seen in 15 years. Advice to Management The best advise I could offer Management would be to be more visual and walk the floor more. Daily pats on the back and acknowledging key achievements in front of peers go a long way and are free.", "rating": 5, "pros": "An exceptionally entrepreneurial environment that actively encourages people to think on their own. Offers a great platform for strong sales individuals to build and develop their particular sections. Fantastic sales benefits including quarterly high achiever trips ( Ibiza, Lisbon, Amsterdam etc ) as well as a very lucrative platinum bonus.", "cons": "Is a fantastic environment if you have previous experience in recruitment/sales but I do not think it is the best initial platform for rookies. Systems are now in place to improve this however this will take some time. Other than this, the company is the best set up I have seen in 15 years.", "advice": "The best advise I could offer Management would be to be more visual and walk the floor more. Daily pats on the back and acknowledging key achievements in front of peers go a long way and are free."}, {"title": "Amazing business to work for...", "text": "Pros I have worked for the business for over 4 years, all the consultants are extremely experienced and talented. The management team are supportive and flexible. There are no solid KPI's you have to meet - you are treated like adults and if you work hard you are always rewarded. Cons There are no real negatives to the business Advice to Management None - The management team are great", "rating": 5, "pros": "I have worked for the business for over 4 years, all the consultants are extremely experienced and talented.", "cons": "There are no real negatives to the business", "advice": "None - The management team are great"}, {"title": "Amazing business to work for...", "text": "Pros I have worked for the business for over 4 years, all the consultants are extremely experienced and talented. The management team are supportive and flexible. There are no solid KPI's you have to meet - you are treated like adults and if you work hard you are always rewarded. Cons There are no real negatives to the business Advice to Management None - The management team are great", "rating": 5, "pros": "I have worked for the business for over 4 years, all the consultants are extremely experienced and talented.", "cons": "There are no real negatives to the business", "advice": "None - The management team are great"}, {"title": "Senior Consultant Milton Keynes", "text": "Pros Good work life balance. I have a child and really appreciate that I can slightly reduced hours and the business is understanding if there are any issues where I need an emergency holiday day to cover illness. Great commission scheme Cons Perhaps not best suited to raw trainees", "rating": 5, "pros": "Good work life balance. I have a child and really appreciate that I can slightly reduced hours and the business is understanding if there are any issues where I need an emergency holiday day to cover illness.", "cons": "Perhaps not best suited to raw trainees", "advice": null}, {"title": "Senior consultant", "text": "Pros Culture - grown up environment where you are given the freedom to develop your market how you see fit. Team - most teams (if not all) have developed a great team identity and have hired like-minded individuals. Management - there when you need it but not micro-managers. Support network - Investigo has been excellent at supporting people who live their values and are prepared to show their commitment to hard working employees. It isn't just about hiring people who will make a fortune for the company, it is about creating a real brand behind the business. I highly commend Investigo for sticking by those that are 'right for the business' not just those that make it profitable. Cons If you want to make money and have fun doing it, join Investigo. But if you want to move away from the coalface, you may want to look at some of the global recruitment players instead as everyone in the business is expected to bill to some level (except support staff). Beyond being paid well and high-achievers trips, the benefits are limited. Advice to Management I appreciate that this is confidential so you won't know specifically who I am talking about but my manager and director have been exceptional. They are talented, question the status quo, highly respected internally & externally and they have created a business that is market leading within the discipline they recruit.", "rating": 5, "pros": "Culture - grown up environment where you are given the freedom to develop your market how you see fit.", "cons": "If you want to make money and have fun doing it, join Investigo.", "advice": "I appreciate that this is confidential so you won't know specifically who I am talking about but my manager and director have been exceptional. They are talented, question the status quo, highly respected internally & externally and they have created a business that is market leading within the discipline they recruit."}, {"title": "A recruitment firm with real personality", "text": "Pros - Staff are intelligent, passionate, driven, genuinely friendly and a great laugh - Management are progressive and welcome ideas for change and improvement - The flat org structure means management are accessible and involved in the day-to-day. They realistically understand their staff - Great remuneration and great perks (annual trip abroad for everyone, quarterly high achievers trips, team drinks, sporting teams etc) - Great office location at Liverpool St and nice office full of atmosphere - A business with integrity that empowers employees to achieve their potential Cons - Perhaps not the right place for people who take themselves too seriously (in my view this is a pro too) - A little behind the curve in terms of keeping up with some industry trends but it's good that they take the time to review things carefully from many perspectives before surging ahead - Support staff may benefit from more involvement in the culture the consultants enjoy and more career development opportunities Advice to Management - Maintain your open minds and willingness to change (and avoid becoming too conservative). It's one of the best things about working here - Consider establishing a dedicated internal HR function as the business could benefit from this in many ways", "rating": 5, "pros": "- Staff are intelligent, passionate, driven, genuinely friendly and a great laugh", "cons": "- Perhaps not the right place for people who take themselves too seriously (in my view this is a pro too)", "advice": "- Maintain your open minds and willingness to change (and avoid becoming too conservative). It's one of the best things about working here"}, {"title": "Experiences at Investigo.....", "text": "Pros I have worked here for coming up to 8 years, joining after university and having a diverse experience in my early career before being given the support and guidance to specialise in a market that suited me. I have now been given the responsibility of managing and growing different teams and building my career in recruitment. Cons Keeping up - there are very strong recruiters here, with strong backgrounds who are very capable. If you aren't prepared to put in the effort, you won't get the results you might expect. If you do put in the effort then you can exceed and be supported to achieve everything you might want. Advice to Management Management have provided external training classes, off site development, on site support - the business has developed a lot recently in providing extra support.", "rating": 5, "pros": "I have worked here for coming up to 8 years, joining after university and having a diverse experience in my early career before being given the support and guidance to specialise in a market that suited me. I have now been given the responsibility of managing and growing different teams and building my career in recruitment.", "cons": "Keeping up - there are very strong recruiters here, with strong backgrounds who are very capable. If you aren't prepared to put in the effort, you won't get the results you might expect. If you do put in the effort then you can exceed and be supported to achieve everything you might want.", "advice": "Management have provided external training classes, off site development, on site support - the business has developed a lot recently in providing extra support."}, {"title": "Investigo - A refreshing approach to recruitment", "text": "Pros Investigo is the first company I joined straight from University and it has been a fantastic place to work for the last three years. The exposure to experienced recruiters and senior management is great mainly as everyone here from Resourcer to Director is very hands-on in their approach to recruitment and always happy to help. Investigo is not heavily KPI focussed, you are trusted to work autonomously with the right support in place and there is a strong focus on career development and progression. The culture is very much a \"work hard, play hard\" one and consultants are made to feel recognised and rewarded by the social offering the company has, such as the annual Investigo conference abroad. Cons Salary packages could be better as there are no real benefits in place, poor pension scheme, no healthcare or car allowances. However the commission scheme is an appealing one. Advice to Management More structured training courses for resourcers, consultants and senior consultants would be an area of improvement.", "rating": 5, "pros": "Investigo is the first company I joined straight from University and it has been a fantastic place to work for the last three years. The exposure to experienced recruiters and senior management is great mainly as everyone here from Resourcer to Director is very hands-on in their approach to recruitment and always happy to help. Investigo is not heavily KPI focussed, you are trusted to work autonomously with the right support in place and there is a strong focus on career development and progression. The culture is very much a \"work hard, play hard\" one and consultants are made to feel recognised and rewarded by the social offering the company has, such as the annual Investigo conference abroad.", "cons": "Salary packages could be better as there are no real benefits in place, poor pension scheme, no healthcare or car allowances. However the commission scheme is an appealing one.", "advice": "More structured training courses for resourcers, consultants and senior consultants would be an area of improvement."}, {"title": "The Best Recruitment business I've ever worked for....", "text": "Pros A Recruitment company that holds true to it's values, driven down from the top by a leadership team who are still hands on in the business and an integral part of the team; it makes a huge difference to be treated like an adult in a recruitment agency, not driven by kpi's and terrible leadership (previous experience), Investigo have been like a breath of fresh air and three years later, I still enjoy going to work. Strong management capability, plenty of career progression and development for those that want it, lots of fun things to look forward to - company trips, incentives, charity events, networking events, socials.... or you can just do your job and go home. Cons There aren't any challenges other than having the right work ethic and a good sense of humour - one thing that I've seen within all of the offices is the drive to do the job well and be good at what we do. The only caveat I'd put in place would be for someone coming in who thinks this is like any other recruitment business, you're not told what to do and when to do it, you're not managed by the length of time you're on the phone or how many CV's you sent out or even by how many new business calls you've made - you're supported to do your job, your way. If you're looking for somewhere to hide or coast, this isn't the business for you, there's a lot of seriously successful recruiters at Investigo and the teams support one another. In respect of a work-life balance, it's a brilliant place to work, do your job, earn trust and bob's your uncle - flexible working based on mutual respect.... Advice to Management My advice to Management? Don't change....", "rating": 5, "pros": "A Recruitment company that holds true to it's values, driven down from the top by a leadership team who are still hands on in the business and an integral part of the team; it makes a huge difference to be treated like an adult in a recruitment agency, not driven by kpi's and terrible leadership (previous experience), Investigo have been like a breath of fresh air and three years later, I still enjoy going to work.", "cons": "There aren't any challenges other than having the right work ethic and a good sense of humour - one thing that I've seen within all of the offices is the drive to do the job well and be good at what we do. The only caveat I'd put in place would be for someone coming in who thinks this is like any other recruitment business, you're not told what to do and when to do it, you're not managed by the length of time you're on the phone or how many CV's you sent out or even by how many new business calls you've made - you're supported to do your job, your way. If you're looking for somewhere to hide or coast, this isn't the business for you, there's a lot of seriously successful recruiters at Investigo and the teams support one another. In respect of a work-life balance, it's a brilliant place to work, do your job, earn trust and bob's your uncle - flexible working based on mutual respect....", "advice": "My advice to Management? Don't change...."}, {"title": "First Class Business", "text": "Pros I have never worked for a better company - The way they run the business, the culture, work ethic and management are all first class. Investigo really are a unique business. The support Investigo have shown since I joined has been unrivalled. The senior leadership team are very impressive and really are one of a kind - Both directors and managers lead by example and play a hands on billing role. The whole company is filled with seriously talented recruiters. You want to do well when you work here, not just for yourself but for the company/management and your peers. The business give you the confidence and freedom to make your own decisions and work to the best of your ability. This environment does breed success and this is why staff retention is so high. This business will continue to go far. Cons This is not the place for you if you want to do the bear minimum to get by, or be constantly pushed to work. Every member of this business is talented and successful. Advice to Management I have no advice here. The management style is second to none.", "rating": 5, "pros": "I have never worked for a better company - The way they run the business, the culture, work ethic and management are all first class. Investigo really are a unique business. The support Investigo have shown since I joined has been unrivalled. The senior leadership team are very impressive and really are one of a kind - Both directors and managers lead by example and play a hands on billing role. The whole company is filled with seriously talented recruiters. You want to do well when you work here, not just for yourself but for the company/management and your peers. The business give you the confidence and freedom to make your own decisions and work to the best of your ability. This environment does breed success and this is why staff retention is so high. This business will continue to go far.", "cons": "This is not the place for you if you want to do the bear minimum to get by, or be constantly pushed to work. Every member of this business is talented and successful.", "advice": "I have no advice here. The management style is second to none."}, {"title": "Fantastic experience", "text": "Pros If you work hard you will be rewarded well. Good teams and some great recruiters Cons Suited to more experienced recruiters", "rating": 5, "pros": "If you work hard you will be rewarded well. Good teams and some great recruiters", "cons": "Suited to more experienced recruiters", "advice": null}, {"title": "Successful recruiters at the heart of this highly successful business", "text": "Pros Having worked with Investigo for over 5 years I have seen the business evolve from a 40 person business to approximately 170 people. With this type of growth in a relatively short period of time (through a recession) it can prove difficult to maintain the culture, values and attractiveness of a small business, though this is something which Investigo did with great ease. Investigo provides excellent levels of autonomy and entrepreneurialism. The Directors and Managers remain hands on recruiters, leading by example and in many cases are the largest billers in the firm. I believe that anyone looking to begin or further their career in recruitment should look no further than Investigo. Cons A difficult question to answer as there are very few cons which come to mind. I believe it's essential to give Consultants a fair amount of time to be successful, something which Investigo are very generous with however there are a handful of consultants who take advantage of this, don't put in the minimum levels of effort and decisions on these people need to be made more quickly. Advice to Management Investigo is a unique business, never lose sight of this. People enjoy coming to work and employees have a perfect blend of work hard/play hard mentality. I wish you every success moving forward!", "rating": 5, "pros": "Having worked with Investigo for over 5 years I have seen the business evolve from a 40 person business to approximately 170 people. With this type of growth in a relatively short period of time (through a recession) it can prove difficult to maintain the culture, values and attractiveness of a small business, though this is something which Investigo did with great ease.", "cons": "A difficult question to answer as there are very few cons which come to mind. I believe it's essential to give Consultants a fair amount of time to be successful, something which Investigo are very generous with however there are a handful of consultants who take advantage of this, don't put in the minimum levels of effort and decisions on these people need to be made more quickly.", "advice": "Investigo is a unique business, never lose sight of this. People enjoy coming to work and employees have a perfect blend of work hard/play hard mentality. I wish you every success moving forward!"}, {"title": "Enjoyed my time but........", "text": "Pros There were some seriously talented recruiters in the company and I always enjoyed the social events organised by the senior management, especially Ibiza! Cons There has been a shift in management style and having worked at larger firms before joining Investigo I feel the USP has disappeared and they are beginning to work and look like a Michael Page. Now sitting in-house I also feel they are very aggressive and market about their recent MBO and profit margins, when really they should concentrate more on delivering high candidate and client service, which I'm afraid hasn't been the case recently... Advice to Management Take stock of you market position, unfortunately you are not seen as the specialist recruitment firm you once were.", "rating": 3, "pros": "There were some seriously talented recruiters in the company and I always enjoyed the social events organised by the senior management, especially Ibiza!", "cons": "There has been a shift in management style and having worked at larger firms before joining Investigo I feel the USP has disappeared and they are beginning to work and look like a Michael Page. Now sitting in-house I also feel they are very aggressive and market about their recent MBO and profit margins, when really they should concentrate more on delivering high candidate and client service, which I'm afraid hasn't been the case recently...", "advice": "Take stock of you market position, unfortunately you are not seen as the specialist recruitment firm you once were."}, {"title": "All the below feedback is faked my senior management", "text": "Pros Heavily KPI driven culture with poor management and questionable leadership. Senior team are heavy drivers and users of recreational drugs Cons Don't join this firm, especially not now. It showed sign's of promise in 2010.", "rating": 1, "pros": "Heavily KPI driven culture with poor management and questionable leadership. Senior team are heavy drivers and users of recreational drugs", "cons": "Don't join this firm, especially not now. It showed sign's of promise in 2010.", "advice": null}, {"title": "Great company with bright future", "text": "Pros Throughout the company the people at all levels in all roles are passionate, enthusiastic, hard working and a great group of people to work with Cons Non really but if I had to comment - Lack of women in senior roles but I know as a business they are encouraging cultural shift Advice to Management Keep hands on with recruitment and the market and keep having fun whilst delivering great results", "rating": 5, "pros": "Throughout the company the people at all levels in all roles are passionate, enthusiastic, hard working and a great group of people to work with", "cons": "Non really but if I had to comment - Lack of women in senior roles but I know as a business they are encouraging cultural shift", "advice": "Keep hands on with recruitment and the market and keep having fun whilst delivering great results"}, {"title": "Great place to work", "text": "Pros Investigo have grown substantially over the four years I have worked here whilst maintaining a meritocratic culture which rewards consultative behaviors and honesty. The executive team and directors are genuinely interested in my career, how I develop and enable me to be more successful. I can honestly say I enjoy coming to work everyday. Cons I have no concerns as I enjoy coming to work everyday. The environment enables me to be sucessful. Advice to Management Keep doing what you are doing", "rating": 5, "pros": "Investigo have grown substantially over the four years I have worked here whilst maintaining a meritocratic culture which rewards consultative behaviors and honesty. The executive team and directors are genuinely interested in my career, how I develop and enable me to be more successful. I can honestly say I enjoy coming to work everyday.", "cons": "I have no concerns as I enjoy coming to work everyday. The environment enables me to be sucessful.", "advice": "Keep doing what you are doing"}, {"title": "Highly recommended firm!", "text": "Pros This environment simply breeds success. I've never met a more impressive senior leadership team, which inspires confidence throughout the business. Gives you the freedom to make your own decisions while offering support if needed. Investigo is surely going places. Cons Would suit a more experienced recruiter with the confidence to go out and create business/reputation. Shrinking violets will struggle in this environment - a draw card for the personalities they hire. Advice to Management Simply to continue on the same path. I was impressed by the quality of consultant throughout the business.", "rating": 5, "pros": "This environment simply breeds success. I've never met a more impressive senior leadership team, which inspires confidence throughout the business. Gives you the freedom to make your own decisions while offering support if needed. Investigo is surely going places.", "cons": "Would suit a more experienced recruiter with the confidence to go out and create business/reputation. Shrinking violets will struggle in this environment - a draw card for the personalities they hire.", "advice": "Simply to continue on the same path. I was impressed by the quality of consultant throughout the business."}, {"title": "One of a kind recruitment company", "text": "Pros The people, culture, and overall healthy environment to work in. Recruitment is a difficult industry, and can be volatile, but they will always support individuals who want to be a success. In an industry where the norm is to reward only the high achievers, Investigo pay for the whole company to go away to Ibiza (or whichever destination wins the company wide poll). Cons Nothing comes to mind. If I had to say something I'd say there are a few employees who have seen the growth and think the culture has shifted slightly, but this is inevitable when you get to the size of Investigo now. Advice to Management Stay true to your original vision for Investigo", "rating": 5, "pros": "The people, culture, and overall healthy environment to work in.", "cons": "Nothing comes to mind. If I had to say something I'd say there are a few employees who have seen the growth and think the culture has shifted slightly, but this is inevitable when you get to the size of Investigo now.", "advice": "Stay true to your original vision for Investigo"}, {"title": "Best Contingency Recruitment Firm in London", "text": "Pros Excellent levels of autonomy, entrepreneurialism and support to grow a business. Directors remain hands on recruiters, leading by example is evident from Director level down. Cons My only negative was the cultural change from going from a 10 man business to a 200 man+. However Investigo ensured that the entrepreneurial essence was not overly diluted. Advice to Management Keep doing what you're doing!", "rating": 5, "pros": "Excellent levels of autonomy, entrepreneurialism and support to grow a business. Directors remain hands on recruiters, leading by example is evident from Director level down.", "cons": "My only negative was the cultural change from going from a 10 man business to a 200 man+. However Investigo ensured that the entrepreneurial essence was not overly diluted.", "advice": "Keep doing what you're doing!"}, {"title": "If they hadn't supported me in starting my own company I would still be with them.", "text": "Pros A place of honesty where hard work was rewarded. All personality types flourished provided they were bright and able to take responsibility for achieving results. I learned a lot from my experiences, most of which came from being given the freedom and autonomy to run my own business/desk. Cons Like any growing business they hired the occasional free loader who judged a business on what PSLs were already established. Advice to Management Keep going and best wishes for your goals in the future.", "rating": 5, "pros": "A place of honesty where hard work was rewarded. All personality types flourished provided they were bright and able to take responsibility for achieving results. I learned a lot from my experiences, most of which came from being given the freedom and autonomy to run my own business/desk.", "cons": "Like any growing business they hired the occasional free loader who judged a business on what PSLs were already established.", "advice": "Keep going and best wishes for your goals in the future."}, {"title": "A great place to learn and be successful", "text": "Pros I worked at Investigo for 7 years. Over this time I learnt a lot from some seriously talented people, made some great friends and worked with some excellent clients and candidates. Investigo is a KPI free environment, fun to work at and the commission structure is rewarding. Management are inclusive and supportive, so much so they helped me to start my own recruitment firm, which is now flourishing with standards and work ethic learnt at Investigo. Cons Not really a con, but Investigo has very high standards in terms of the methods they use and the work ethic they expect from employees. Don't apply here if you want to coast through anonymously.", "rating": 5, "pros": "I worked at Investigo for 7 years. Over this time I learnt a lot from some seriously talented people, made some great friends and worked with some excellent clients and candidates. Investigo is a KPI free environment, fun to work at and the commission structure is rewarding. Management are inclusive and supportive, so much so they helped me to start my own recruitment firm, which is now flourishing with standards and work ethic learnt at Investigo.", "cons": "Not really a con, but Investigo has very high standards in terms of the methods they use and the work ethic they expect from employees. Don't apply here if you want to coast through anonymously.", "advice": null}, {"title": "If only all recruitment firms could be like Investigo!", "text": "Pros A fantastic recruitment firm that many other recruitment firms could learn from. The company owners have created a highly entrepreneurial & successful work culture right across the business. High achievers are extremely well rewarded and although there is a lot of hard work / long hours, the culture has always remained fun! Cons Much like all recruitment firms, the hours can be long. Advice to Management Keep up the good work! I have fantastic memories of working for Investigo and learnt a great deal.", "rating": 5, "pros": "A fantastic recruitment firm that many other recruitment firms could learn from.", "cons": "Much like all recruitment firms, the hours can be long.", "advice": "Keep up the good work! I have fantastic memories of working for Investigo and learnt a great deal."}, {"title": "If only all recruitment firms could be like Investigo!", "text": "Pros A fantastic recruitment firm that many other recruitment firms could learn from. The company owners have created a highly entrepreneurial & successful work culture right across the business. High achievers are extremely well rewarded and although there is a lot of hard work / long hours, the culture has always remained fun! Cons Much like all recruitment firms, the hours can be long. Advice to Management Keep up the good work! I have fantastic memories of working for Investigo and learnt a great deal.", "rating": 5, "pros": "A fantastic recruitment firm that many other recruitment firms could learn from.", "cons": "Much like all recruitment firms, the hours can be long.", "advice": "Keep up the good work! I have fantastic memories of working for Investigo and learnt a great deal."}, {"title": "Poor management and overley aggresive culture - downfall of recruitment firms", "text": "Pros Some good PSL clients in FS Cons KPI driven, bad management and commission structure not as good as they think", "rating": 1, "pros": "Some good PSL clients in FS", "cons": "KPI driven, bad management and commission structure not as good as they think", "advice": null}]