[{"title": "Amazing experience in a dynamic start-up", "text": "Pros - International team - Free fruits, food, coffee all the time - Possibility to learn a lot of different things and to acquire a lot of skills, even if it's not what you are here for - Young team (average age 26y.o) - Team events very often - Good atmosphere with lot of transparency - Amazing team Cons The only inconvenient is that the IT team is in a different office than the business one, which can make things complicated. But it's also an advantage as you learn a lot", "rating": 5, "pros": "- International team", "cons": "The only inconvenient is that the IT team is in a different office than the business one, which can make things complicated. But it's also an advantage as you learn a lot", "advice": null}, {"title": "Great team and leadership. Lot's of responsibility", "text": "Pros - Great development possibilities. Ownership from day 1 - Guidance provided if required - Frequent feedback loops - Teamspirit Cons - Highly competitive market - Tactics can be changed frequently. High intensity.", "rating": 5, "pros": "- Great development possibilities. Ownership from day 1", "cons": "- Highly competitive market", "advice": null}, {"title": "Interesting startup", "text": "Pros - young, international team - challenging tasks - a lot of responisbilities - regular team events Cons - not much, I actually like working here a lot", "rating": 5, "pros": "- young, international team", "cons": "- not much, I actually like working here a lot", "advice": null}, {"title": "UK Country Manager", "text": "Pros Exciting future, Steep learning curve, lots of responsibility, very entrepreneurial environment Cons A largely autonomous job, requires a significant amount of self-drive and personal focus", "rating": 5, "pros": "Exciting future, Steep learning curve, lots of responsibility, very entrepreneurial environment", "cons": "A largely autonomous job, requires a significant amount of self-drive and personal focus", "advice": null}, {"title": "Challenging job and great atmosphere", "text": "Pros Joblift has a young and ambitious team. People are motivated to work and at the same time the environment is really good. The tasks are diverse Cons I do not have any", "rating": 5, "pros": "Joblift has a young and ambitious team. People are motivated to work and at the same time the environment is really good. The tasks are diverse", "cons": "I do not have any", "advice": null}, {"title": "Super team", "text": "Pros Cool team of professionals, interesting technical challenges, opportunity to use different technology Cons Theme priority can change rapidly", "rating": 5, "pros": "Cool team of professionals, interesting technical challenges, opportunity to use different technology", "cons": "Theme priority can change rapidly", "advice": null}, {"title": "Challenging tasks for driven people", "text": "Pros - varied tasks - positive environment with passionate colleagues - small team - possibility to bring in your own ideas - regular feedback talks - office in Berlin Mitte - young and smart team Cons no contras so far, it's a great organisation to work for Advice to Management Keep up the motivated and progress driven culture", "rating": 5, "pros": "- varied tasks", "cons": "no contras so far, it's a great organisation to work for", "advice": "Keep up the motivated and progress driven culture"}]