[{"title": "Great mission, even better people", "text": "Pros You will work with talented people who are dedicated to their work and the company's mission. Great culture. Agile. Communicative across all departments. We have weekly one-on-ones with our founders, daily stand ups, and biweekly engineering fireside chats. Cons Its a startup, so things move fast and we are expected to keep up and move numbers. Everyone has the responsibility of moving the company forward. If you are looking for a cushy laid back 9-5, this isn't the place for you. Advice to Management Keep hiring the best and the brightest!", "rating": 5, "pros": "You will work with talented people who are dedicated to their work and the company's mission. Great culture. Agile. Communicative across all departments.", "cons": "Its a startup, so things move fast and we are expected to keep up and move numbers. Everyone has the responsibility of moving the company forward. If you are looking for a cushy laid back 9-5, this isn't the place for you.", "advice": "Keep hiring the best and the brightest!"}, {"title": "Love this company", "text": "Pros This is the best company I've worked at by far. It's a Y Combinator company and it shows in their pace and how things are run. This is the place to go to learn how to build a great company. There are stars on the team who operate at a different level. The bar is set very high. Cons There is high pressure and expectations to perform. The company is transparent and goals are public. Under performers are quickly moved out. Advice to Management Keep it up.", "rating": 5, "pros": "This is the best company I've worked at by far. It's a Y Combinator company and it shows in their pace and how things are run. This is the place to go to learn how to build a great company. There are stars on the team who operate at a different level. The bar is set very high.", "cons": "There is high pressure and expectations to perform. The company is transparent and goals are public. Under performers are quickly moved out.", "advice": "Keep it up."}, {"title": "Great place--growing fast!!!", "text": "Pros Very collaborative team environment Rockstar team in place--hired great people who have very relevant experience The team is fun, young, hardworking, and vibrant Cons None as of yet! Hope the team and company continues to grow and own the market space! Advice to Management Keep up the good work! Watching KidPass expand to new markets will be very exciting!", "rating": 5, "pros": "Very collaborative team environment", "cons": "None as of yet! Hope the team and company continues to grow and own the market space!", "advice": "Keep up the good work! Watching KidPass expand to new markets will be very exciting!"}, {"title": "Awesome team, great product, fantastic place to work", "text": "Pros The team is incredible, filled with smart and hard working people who you can learn a lot from. The company is growing fast and is at an exciting inflection point. A great place to work if you want to see how great companies get built. Cons Like all companies that are early, you have to wear a lot of different hats, and it doesn't have all the tools and infrastructure in place that you find working at a bigger company. Advice to Management Keep up the great work!", "rating": 5, "pros": "The team is incredible, filled with smart and hard working people who you can learn a lot from. The company is growing fast and is at an exciting inflection point. A great place to work if you want to see how great companies get built.", "cons": "Like all companies that are early, you have to wear a lot of different hats, and it doesn't have all the tools and infrastructure in place that you find working at a bigger company.", "advice": "Keep up the great work!"}, {"title": "Awesome growing company", "text": "Pros The team is growing quickly! Everyone is young and fun, but still experienced and hardworking. It's a great balance. The team gets along well, and I love that I know what's happening in every department (not just my own). Also, your work will have an immediate impact on a growing business. Cons I don't have any cons to name! I think that the growing startup vibe could be a con for some people, but it's not for me. I love that everything is changing and that my work can immediately positively impact the company. Advice to Management N/A", "rating": 5, "pros": "The team is growing quickly! Everyone is young and fun, but still experienced and hardworking. It's a great balance. The team gets along well, and I love that I know what's happening in every department (not just my own). Also, your work will have an immediate impact on a growing business.", "cons": "I don't have any cons to name! I think that the growing startup vibe could be a con for some people, but it's not for me. I love that everything is changing and that my work can immediately positively impact the company.", "advice": "N/A"}, {"title": "Dynamic company, rockstar team, fast paced culture, dream job", "text": "Pros Awesome people & culture. KidPass recruits top talent, and people who are high performers, self-driven, collaborative, hard working, intelligent, and passionate about the company. Everyone cares and employees are encouraged to come up with new ideas and own their work. The company is very transparent, entrepreneurial, and tight-knit. Has amazing investors. Company is also growing fast and is the industry leader. Cons Typical startup stuff - growing fast, so lots of processes and company standards are still getting built along the way. If you're not ready for a fast paced, hard working startup environment, then you should probably look elsewhere. Advice to Management Keep hiring great people while keeping a tight knit culture. Continue to be a mission driven company through rapid growth.", "rating": 5, "pros": "Awesome people & culture. KidPass recruits top talent, and people who are high performers, self-driven, collaborative, hard working, intelligent, and passionate about the company. Everyone cares and employees are encouraged to come up with new ideas and own their work. The company is very transparent, entrepreneurial, and tight-knit. Has amazing investors. Company is also growing fast and is the industry leader.", "cons": "Typical startup stuff - growing fast, so lots of processes and company standards are still getting built along the way. If you're not ready for a fast paced, hard working startup environment, then you should probably look elsewhere.", "advice": "Keep hiring great people while keeping a tight knit culture. Continue to be a mission driven company through rapid growth."}]