[{"title": "A phenomenal product driven by really smart people", "text": "Pros - The product is changing the way companies look at real estate - An extremely collaborative, smart culture top down, that pushes the best out of everyone - A lot of autonomy, allowing employees to effectively run their own business - While challenging, the job promises to reward hard work with frequent company gatherings and events - Feedback is given and encouraged often Cons - Things don't always run smoothly, which is to be expected at a company with this type of growth. For those looking to come aboard and coast in the background, this likely isn't the company for you Advice to Management - Continue to keep open lines of communication", "rating": 5, "pros": "- The product is changing the way companies look at real estate", "cons": "- Things don't always run smoothly, which is to be expected at a company with this type of growth. For those looking to come aboard and coast in the background, this likely isn't the company for you", "advice": "- Continue to keep open lines of communication"}, {"title": "Narcissism at it's finest", "text": "Pros They found a model that truly changes office space in large cities. Cons Everything else. The CEO is driven by ego, won't hold up to his word, and refuses to apologize. Doesnt know who his staff his. Hits on any one present at company parties. And worst of all, does not follow the law. Compensation? What he says it's reasonable (offensively low) The executive team pays themselves an obscene amount while starting operations salary is 40k to run a location alone. Advice to Management Follow the law and you're employees will be happier. Start with NY FLSA laws.", "rating": 1, "pros": "They found a model that truly changes office space in large cities.", "cons": "Everything else.", "advice": "Follow the law and you're employees will be happier. Start with NY FLSA laws."}, {"title": "Best Real Estate Tech opportunity out there", "text": "Pros - Amazing culture - Smart people - Own your work / creative ideas are encouraged and you get to run with them - Not bureaucratic - Management is very accessible - Team spirit - Lots of cool spaces and events - work with the hottest startups in NYC - very international and diverse team - Insane growth - Good funding, solid potential - experienced CEO and top management who know what they are doing (with a few exceptions) Cons - Compensation could be better - Lack of structure due to insane growth, but that's normal - constantly understaffed Advice to Management - if you manage to retain the culture where top level management is accessible to rank-and-file employees, that would be amazing - more transparency about decisions made at the top – perhaps a weekly company overview email or something would be helpful - pay people better", "rating": 5, "pros": "- Amazing culture", "cons": "- Compensation could be better", "advice": "- if you manage to retain the culture where top level management is accessible to rank-and-file employees, that would be amazing"}, {"title": "I love working here. Granted I'm the CEO, but the people I work with are amazing.", "text": "Pros Wonderful people come to work here alongside me. We get to work with amazing founders building great organizations. We have space to play with. Cons Buildings can be frustrating sometimes. Advice to Management (Hey current and former staff -- drown out my \"Of course the CEO would say that!\" review with your own views...looking forward to hearing more from everyone.)", "rating": 5, "pros": "Wonderful people come to work here alongside me.", "cons": "Buildings can be frustrating sometimes.", "advice": "(Hey current and former staff -- drown out my \"Of course the CEO would say that!\" review with your own views...looking forward to hearing more from everyone.)"}, {"title": "Workin' at Knotel", "text": "Pros - Culture is casual, friendly, but focused. - A lot of growth, with tons of opportunities for ownership, learning, etc. - You get to own your work. - Your work can affect more and more Knotel locations full of many successful companies and people. - You get to know every level of management, and they listen to your ideas! - Not at all bureaucratic. - Leadership is progressive and cares about social impact in practice and not just as an HR gimmick. - Writing this before going to a Knotel kickball game. - Seltzer. Cons - Growing pains! As with any startup, fast growth can sometimes mean lack of clarity or structure.", "rating": 5, "pros": "- Culture is casual, friendly, but focused.", "cons": "- Growing pains! As with any startup, fast growth can sometimes mean lack of clarity or structure.", "advice": null}, {"title": "Great opportunity at a rising company", "text": "Pros - Lots of responsibility and autonomy - Interesting and challenging work - Unique and disruptive business model - Strong leadership - Great culture Cons None so far. Be prepared to work hard and fast. Responsibilities and assignments can shift on a moments notice, but that's expected when you join a fast growing startup.", "rating": 5, "pros": "- Lots of responsibility and autonomy", "cons": "None so far. Be prepared to work hard and fast. Responsibilities and assignments can shift on a moments notice, but that's expected when you join a fast growing startup.", "advice": null}]