[{"title": "Nice people. Mind-numbing work.", "text": "Pros - If you like sport then you pretty much have constant access to it throughout your working day. - The people are a laugh, down to earth for the most part. Cons - No room to be creative or progress - Male dominated. Very laddy/macho and there seems to be no desire to change that - Very cliquey middle management whose only job seems to be feeding back upper managements ideas or suggestions (being creatively constrained themselves). - Upper management so far removed from the digital department I don't think they've ever walked around that part of the office. - Work is repetitive and dull. You could genuinely train a monkey to do it. - The only job I've ever had which hasn't taught me any new or valuable skills in my area of work. - You'll have to do shifts and work weekends which are absolutely horrendous after a while. Advice to Management Have some faith in your employees and give them a chance to do more than data entry", "rating": 3, "pros": "- If you like sport then you pretty much have constant access to it throughout your working day.", "cons": "- No room to be creative or progress", "advice": "Have some faith in your employees and give them a chance to do more than data entry"}, {"title": "Good Company - Difficult Hours", "text": "Pros Sociable employees and mostly nice customers. Good opportunity for progression and great start on the job ladder Cons Some more difficult and occasionally abusive customers High turnover of young staff so often short staffed Potentially dangerous job as responsible for large amounts of cash with little protection for staff (Not all shops have bandit screens) Advice to Management Arrange regular get-togethers with staff to increase staff retention and recognise hard work, not just sales targets and financial rewards will keep staff.", "rating": 5, "pros": "Sociable employees and mostly nice customers.", "cons": "Some more difficult and occasionally abusive customers", "advice": "Arrange regular get-togethers with staff to increase staff retention and recognise hard work, not just sales targets and financial rewards will keep staff."}, {"title": "Meh", "text": "Pros good calm place to work Cons very political with colleges and so on", "rating": 3, "pros": "good calm place to work", "cons": "very political with colleges and so on", "advice": null}, {"title": "Poor Pay, Long commute", "text": "Pros Easy job, but very monotonous Cons Not a very nice environment, management doesn't listen to new ideas", "rating": 3, "pros": "Easy job, but very monotonous", "cons": "Not a very nice environment, management doesn't listen to new ideas", "advice": null}, {"title": "Under appreciated and unsociable hours", "text": "Pros Sometimes flexible shifts, easy to swop around, 6 weeks holidays after 5 year service (although think this may have changed due to restructure) Cons 13 hour shifts, lone working, understaffed, never recognised for any achievements, poorly structured, not much room for progression once moved up from adviser to manager. Advice to Management Need to address why there is such a high staff turnover... it’s not down to people leaving for better jobs it’s because staff morale has hit an all time low!", "rating": 3, "pros": "Sometimes flexible shifts, easy to swop around, 6 weeks holidays after 5 year service (although think this may have changed due to restructure)", "cons": "13 hour shifts, lone working, understaffed, never recognised for any achievements, poorly structured, not much room for progression once moved up from adviser to manager.", "advice": "Need to address why there is such a high staff turnover... it’s not down to people leaving for better jobs it’s because staff morale has hit an all time low!"}, {"title": "Amazing potential", "text": "Pros Prove your worth and promotions are easily available Pay is good I like working different shifts each week instead of your typical mon-fri 9-5 Meeting so many new people up and down the country Cons Every job has its ups and downs, but there’s nothing extreme that stands out to me", "rating": 5, "pros": "Prove your worth and promotions are easily available", "cons": "Every job has its ups and downs, but there’s nothing extreme that stands out to me", "advice": null}, {"title": "Great job", "text": "Pros Most of the staff are young/students We was all like a big family Great atmosphere Nice pay Cons Wouldn't want to work full time as hours are all day, long and draining Working till 10pm", "rating": 5, "pros": "Most of the staff are young/students", "cons": "Wouldn't want to work full time as hours are all day, long and draining", "advice": null}, {"title": "Great", "text": "Pros I love working here, its a great place to work Cons There isnt anything bad i can say about the company Advice to Management Keep it up", "rating": 5, "pros": "I love working here, its a great place to work", "cons": "There isnt anything bad i can say about the company", "advice": "Keep it up"}, {"title": "Great culture, good perks, fast paced company", "text": "Pros Friday lunches (pizzas, nandos, etc and Friday drinks) are put on for all employees and over Spring Carnival, the company put on lunches and breakfasts most days. There is a pretty good social/sports club, where you can play mixed soccer or touch rugby Its a pretty chilled out office and generally very little overtime. You work hard, but when the job is done management reward employees with team lunches, employee of the month, random voucher cards etc. The coffee machine is A1! The hierarchy is pretty flat so management are quite hands on. CEO is very approachable Cons Apparently industry competitors in Melbourne and Sydney have over double the staff of Ladbrokes (who has about 300 employees) so don't expect to come in and not pull you weight. The location (Lutwyche) isn't the best, but it is quite close to the bus station. There's heaps of free parking around the office if you have a car. Over the last 12 months there has been a fair bit of reshuffle when the old CEO and COO finished up. Quite a few IT employees went with them, but the department has stabilized since Advice to Management There are high performers and poor performers. Weed out the poor-performers because it isn't fair that they get a free ride.", "rating": 5, "pros": "Friday lunches (pizzas, nandos, etc and Friday drinks) are put on for all employees and over Spring Carnival, the company put on lunches and breakfasts most days. There is a pretty good social/sports club, where you can play mixed soccer or touch rugby", "cons": "Apparently industry competitors in Melbourne and Sydney have over double the staff of Ladbrokes (who has about 300 employees) so don't expect to come in and not pull you weight.", "advice": "There are high performers and poor performers. Weed out the poor-performers because it isn't fair that they get a free ride."}, {"title": "Don't do it", "text": "Pros Majority of staff are Great team members and work hard Cons Lone working is rife Company don't care about staff welfare Too much pressure from the top to keep shops open Not the same company I started with No work/ life balance Advice to Management Care about those on the front line as without those hardworking people your company will go under", "rating": 1, "pros": "Majority of staff are Great team members and work hard", "cons": "Lone working is rife", "advice": "Care about those on the front line as without those hardworking people your company will go under"}, {"title": "Trading Support Operative", "text": "Pros Large company with plenty of career opportunities. Cons Competing against lots of applicants for positions.", "rating": 5, "pros": "Large company with plenty of career opportunities.", "cons": "Competing against lots of applicants for positions.", "advice": null}, {"title": "Very poor company to work for", "text": "Pros A lesson in what not to do Cons Poor work culture throughout company", "rating": 3, "pros": "A lesson in what not to do", "cons": "Poor work culture throughout company", "advice": null}, {"title": "Sometimes amazing job, sometimes horrible", "text": "Pros Engaging job for anyone interested in sport, and the variety and demands of the job make it much more enjoyable than other standard retail jobs. When I first started there was great flexibility with shifts (that's all changed since the merger with Coral) and it's a job which really lets you be yourself. There are also excellent opportunities to progress within the company at a very swift rate, although the training can be quite tedious. Cons There is a real disconnect between the staff on the floor and the bosses at the top. There are some frankly amoral targets to get customers hooked on gaming machines and this ultimately comes at the expense of customers being able to put their lines on as easily as before as you're constantly treating them like potential marks. Single manning in shops like this given the notorious clientele that hang around these shops (I must stress that the majority of customers make the job so much more enjoyable and let you build great relationships and develop skills in customer service) shows a real neglect for safety. Even though 9 times out of 10 you're shift will be free from any unpleasant situations, it only has to get nasty once. The shift patterns have changed now to restrict managers and cashiers to certain hours of the day, paradoxically trying to maximize the company's profits by cutting back the number of people who can actually work for it. My specific marketplace had some serious in fighting over the lack of a work/life balance and given that I'm a student this starts to really mount up to the point where it is not worth holding on to it as a part time job. Advice to Management The bookmaking industry really needs an overhaul as a whole. Trying to cut corners to maximize profits might work in conventional retail but I feel it's ultimately going to lead to unsafe working environments and frankly horrendous shift patterns. The customer ultimately suffers. The unmanageable sales and profit quotas simply don't translate into this industry and simply damage the customer's experience in the actual shop.", "rating": 3, "pros": "Engaging job for anyone interested in sport, and the variety and demands of the job make it much more enjoyable than other standard retail jobs. When I first started there was great flexibility with shifts (that's all changed since the merger with Coral) and it's a job which really lets you be yourself. There are also excellent opportunities to progress within the company at a very swift rate, although the training can be quite tedious.", "cons": "There is a real disconnect between the staff on the floor and the bosses at the top. There are some frankly amoral targets to get customers hooked on gaming machines and this ultimately comes at the expense of customers being able to put their lines on as easily as before as you're constantly treating them like potential marks. Single manning in shops like this given the notorious clientele that hang around these shops (I must stress that the majority of customers make the job so much more enjoyable and let you build great relationships and develop skills in customer service) shows a real neglect for safety. Even though 9 times out of 10 you're shift will be free from any unpleasant situations, it only has to get nasty once. The shift patterns have changed now to restrict managers and cashiers to certain hours of the day, paradoxically trying to maximize the company's profits by cutting back the number of people who can actually work for it. My specific marketplace had some serious in fighting over the lack of a work/life balance and given that I'm a student this starts to really mount up to the point where it is not worth holding on to it as a part time job.", "advice": "The bookmaking industry really needs an overhaul as a whole. Trying to cut corners to maximize profits might work in conventional retail but I feel it's ultimately going to lead to unsafe working environments and frankly horrendous shift patterns. The customer ultimately suffers. The unmanageable sales and profit quotas simply don't translate into this industry and simply damage the customer's experience in the actual shop."}, {"title": "The worst company I have ever worked for", "text": "Pros The staff were friendly and some of the customers were nice to talk to. If you wanted more hours there were always plenty. A great way to get \"management\" experience which looks good on your CV. Cons The management treat staff like numbered cattle, putting them at risk and barking ridiculous orders. I can remember one rule being \"the papers need to be 1 inch apart and not sharing a magnet\", this would indeed be brought up by management if your papers were slightly too close, I laugh to this day with my new colleagues and management, it was micro-management at its finest. Often members of staff would call in sick leaving you managing a shop for 14 hours, if no one was available to give you a break then tough luck. You wouldn't only get stick from management if you gave yourself a break, the customers would kick off as well. That's the most important issue with Ladbrokes, your safety is a non issue to them, there were rapes, even a murder committed and still they refused to put up bandit screens and allowed single manning. Every store I worked in had a violent story to tell, it's complete madness by a greedy few, as long as you're lining their pockets they couldn't care less. If you are considering a job, please also be aware that the customers aren't like \"normal\" customers, they use the floor as a toilet, shout at members of staff for not making their free drink the way they like it while spending their benefits money on 20p bets. Advice to Management There's no point - they've asked for advice in the past and chose to ignore it, a shocking amount of staff replied negatively to the survey they created. Please also note the surveys were \"anonymous\" but it asked for your age, sex, contracted hours, shop area, which basically meant it wasn't anonymous at all.", "rating": 1, "pros": "The staff were friendly and some of the customers were nice to talk to. If you wanted more hours there were always plenty. A great way to get \"management\" experience which looks good on your CV.", "cons": "The management treat staff like numbered cattle, putting them at risk and barking ridiculous orders. I can remember one rule being \"the papers need to be 1 inch apart and not sharing a magnet\", this would indeed be brought up by management if your papers were slightly too close, I laugh to this day with my new colleagues and management, it was micro-management at its finest.", "advice": "There's no point - they've asked for advice in the past and chose to ignore it, a shocking amount of staff replied negatively to the survey they created. Please also note the surveys were \"anonymous\" but it asked for your age, sex, contracted hours, shop area, which basically meant it wasn't anonymous at all."}, {"title": "Deputy HR Manager", "text": "Pros Great reward and benefits package Cons Limited flexible working options Advice to Management Offer more flexibility for working parents.", "rating": 3, "pros": "Great reward and benefits package", "cons": "Limited flexible working options", "advice": "Offer more flexibility for working parents."}, {"title": "Great Place to Work", "text": "Pros Great place to work, felt like a family environment looked after its staff with development and ensure opportunity for growth for individuals that wanted it. Cons I very relaxed working environment Advice to Management Transparency to its team", "rating": 5, "pros": "Great place to work, felt like a family environment looked after its staff with development and ensure opportunity for growth for individuals that wanted it.", "cons": "I very relaxed working environment", "advice": "Transparency to its team"}, {"title": "Do not consider Ladbrokes Australia unless desperate", "text": "Pros A few managers & staff are okay, sometimes even fun. Cons Poor culture, good managers shackled by the clueless or have left, high performance is rarely rewarded or even recognised, bad office location, staff are encouraged to prey on the most vulnerable gamblers, abuse when people find out where you work. Surprisingly for a digital company, the executives have no idea about IT. If you are a woman, gay or from a minority group, you especially do not want to work here. Advice to Management Do more to keep your good staff. Lost many of the best you had this year. Cut out the bookmaker boys club and drag yourselves into the 21st century. The number of politically incorrect slurs I have heard from the very top of 'management' is astounding.", "rating": 3, "pros": "A few managers & staff are okay, sometimes even fun.", "cons": "Poor culture, good managers shackled by the clueless or have left, high performance is rarely rewarded or even recognised, bad office location, staff are encouraged to prey on the most vulnerable gamblers, abuse when people find out where you work. Surprisingly for a digital company, the executives have no idea about IT. If you are a woman, gay or from a minority group, you especially do not want to work here.", "advice": "Do more to keep your good staff. Lost many of the best you had this year. Cut out the bookmaker boys club and drag yourselves into the 21st century. The number of politically incorrect slurs I have heard from the very top of 'management' is astounding."}, {"title": "No christmas stocking.", "text": "Pros Great staff. Pleasant, friendly and hard working. Cons Not getting paid on time, correctly or at all as in my case! Advice to Management Sort your wages dept out especially at christmas.", "rating": 1, "pros": "Great staff. Pleasant, friendly and hard working.", "cons": "Not getting paid on time, correctly or at all as in my case!", "advice": "Sort your wages dept out especially at christmas."}, {"title": "Ladbrokes - Customer Service Advisor", "text": "Pros Great working environment, laid back, flexible hours, long lasting customer relations Cons Company seems lacking consistency/direction at times, set new rules & parameters which are often forgotten about in a few months. No real Bonus scheme to speak of Longer and longer working days, even Grand National is a 10pm close now days", "rating": 3, "pros": "Great working environment, laid back, flexible hours, long lasting customer relations", "cons": "Company seems lacking consistency/direction at times, set new rules & parameters which are often forgotten about in a few months.", "advice": null}, {"title": "Ladbrokes", "text": "Pros Relaxed atmosphere, free sports telly Cons IT has some way to go. Too much dependencies on suppliers, in house knowledge is almost non existent. Advice to Management none", "rating": 3, "pros": "Relaxed atmosphere, free sports telly", "cons": "IT has some way to go. Too much dependencies on suppliers, in house knowledge is almost non existent.", "advice": "none"}, {"title": "CSM", "text": "Pros colleagues friendly, easy job, staff nice everywhere Cons bad management, if your mates with managers get everything otherwise nothing, long hours, security risk. Advice to Management need to act as management, an have a clue what they are doing and be nice to employment", "rating": 1, "pros": "colleagues friendly, easy job, staff nice everywhere", "cons": "bad management, if your mates with managers get everything otherwise nothing, long hours, security risk.", "advice": "need to act as management, an have a clue what they are doing and be nice to employment"}, {"title": "Ladbrokes", "text": "Pros The people and staff Cons Some of the customer and working alone", "rating": 3, "pros": "The people and staff", "cons": "Some of the customer and working alone", "advice": null}, {"title": "Excellent for development and progression in management", "text": "Pros Fast paced training and development if you are proactive Accommodating for personal life Great people to work with Great support office Responsibility from the beginning Cons Often unsociable hours - difficult to have a routine", "rating": 5, "pros": "Fast paced training and development if you are proactive", "cons": "Often unsociable hours - difficult to have a routine", "advice": null}, {"title": "One of the easier jobs", "text": "Pros Not that physically demanding a job Pay is aright compared to other jobs in that sector If you're lucky you can watch the sports games while working Easy to progress Cons A bit all over the place due to recent merger Sometimes can have some idiots in higher up positions.", "rating": 5, "pros": "Not that physically demanding a job", "cons": "A bit all over the place due to recent merger", "advice": null}, {"title": "Horrible after coral merge", "text": "Pros The pay is good and sometimes you work with nice people who make the job easy Cons Horrible place to work after a year. After the viral merge it’s been s nightmare. Advice to Management Remove yourself from coral.", "rating": 3, "pros": "The pay is good and sometimes you work with nice people who make the job easy", "cons": "Horrible place to work after a year. After the viral merge it’s been s nightmare.", "advice": "Remove yourself from coral."}, {"title": "Avoid", "text": "Pros Good shop staff & customers. Great for any sports lover. Cons Staff safety with lone working especially after the merger with Coral eg, my former shop single mans until 2.30pm!!! No respect for equal opportunities or disabilities. Prior to merger I was on flexible working to work around my disability but this was then taken away. No support by upper management or HR. Supposed to protect vulnerable gamblers but then are made to target these people to get them on an account. If you do not prebook your holiday it is allocated. Everything is suited for THE CORPORATION not the worker. Advice to Management There are policy posters in every shop but when an employee needs to implement these guidelines they are not used by the company in the correct way. I raised a grievance regarding my disability and it was completed shrugged off by the management and HR. There is no protection for vulnerable employees so ALL persons from top to bottom need to brush up on their rights to protect & support their workers.", "rating": 1, "pros": "Good shop staff & customers.", "cons": "Staff safety with lone working especially after the merger with Coral eg, my former shop single mans until 2.30pm!!! No respect for equal opportunities or disabilities. Prior to merger I was on flexible working to work around my disability but this was then taken away. No support by upper management or HR. Supposed to protect vulnerable gamblers but then are made to target these people to get them on an account. If you do not prebook your holiday it is allocated. Everything is suited for THE CORPORATION not the worker.", "advice": "There are policy posters in every shop but when an employee needs to implement these guidelines they are not used by the company in the correct way. I raised a grievance regarding my disability and it was completed shrugged off by the management and HR. There is no protection for vulnerable employees so ALL persons from top to bottom need to brush up on their rights to protect & support their workers."}, {"title": "Ladbrokes", "text": "Pros Flexible Hours of the Shifts Friendly staff Cons Low salary Security could be improved", "rating": 5, "pros": "Flexible Hours of the Shifts", "cons": "Low salary", "advice": null}, {"title": "Not a great working environment", "text": "Pros .Easy job .Pay is alright for what you do .Good for people interested in sports Cons .Current government review will create job losses but the company haven't outlined any plan if this does happen. .Act like sales people trying get accounts for customers. . To much staff turnover going on, company in a mess when to recruiting new starters. .Training for new trainee CSM's is inadequate. .Abuse and ignorance from customers. .No real career progression. .Only get bonuses for selling accounts. .No work life balance .Staff morale is at an all time low Advice to Management Need to get back to basics with shop teams. Start being more organised to how people are trained.", "rating": 1, "pros": ".Easy job", "cons": ".Current government review will create job losses but the company haven't outlined any plan if this does happen.", "advice": "Need to get back to basics with shop teams. Start being more organised to how people are trained."}, {"title": "working at ladbrokes", "text": "Pros shares scheme is a good thing Cons mergeing with coral was a bad idea.", "rating": 3, "pros": "shares scheme is a good thing", "cons": "mergeing with coral was a bad idea.", "advice": null}, {"title": "good employer", "text": "Pros easy job that allows for career progression Cons Management are not good at all Advice to Management Employ new middle managers as they are subpar", "rating": 3, "pros": "easy job that allows for career progression", "cons": "Management are not good at all", "advice": "Employ new middle managers as they are subpar"}, {"title": "Cashier", "text": "Pros Nice co-workers, the hours are flexible Cons Major safety concerns at times, Advice to Management n/a", "rating": 3, "pros": "Nice co-workers, the hours are flexible", "cons": "Major safety concerns at times,", "advice": "n/a"}, {"title": "Customer service", "text": "Pros Learnt alot about cash handling Cons Long hours and alot of weekends Advice to Management Treat staff fair", "rating": 3, "pros": "Learnt alot about cash handling", "cons": "Long hours and alot of weekends", "advice": "Treat staff fair"}, {"title": "Very good Retail PLC but Poor Training and Management", "text": "Pros Very good company to work benefit to growth and lots of opportunities. For retail, it's one of the best Pay Rate higher than any other retail I know Cons Poor Training and Poor Management", "rating": 3, "pros": "Very good company to work benefit to growth and lots of opportunities. For retail, it's one of the best Pay Rate higher than any other retail I know", "cons": "Poor Training and Poor Management", "advice": null}, {"title": "CSA", "text": "Pros Good company to work for Cons Cope with customers that are angry", "rating": 3, "pros": "Good company to work for", "cons": "Cope with customers that are angry", "advice": null}, {"title": "Treats younger team members badly", "text": "Pros Training for job and uniform given. Cons Younger members of the team treated unfairly. Constant weekend working, no enhancements for weekends, later or bank holidays. Staff, unprofessional and rude to both colleagues and customers. Denied holidays requested despite fair notice of request. Holidays booked for you regardless of whether you want or need them. Management unfair and discriminatory. If you are under 25 AVOID! If your face fits you might be ok. Advice to Management Feedback is the same the managers feel that the younger members of the team are fair game and can be treated as they wish. The Equality Act definitely does not apply to Ladbrokes and their processes.", "rating": 3, "pros": "Training for job and uniform given.", "cons": "Younger members of the team treated unfairly. Constant weekend working, no enhancements for weekends, later or bank holidays. Staff, unprofessional and rude to both colleagues and customers. Denied holidays requested despite fair notice of request. Holidays booked for you regardless of whether you want or need them. Management unfair and discriminatory. If you are under 25 AVOID! If your face fits you might be ok.", "advice": "Feedback is the same the managers feel that the younger members of the team are fair game and can be treated as they wish. The Equality Act definitely does not apply to Ladbrokes and their processes."}, {"title": "Poorly managed", "text": "Pros If the changes happen in the way they should, the company could be good Cons Chronically mismanaged, especially at senior levels. Don't listen to lower levels, especially in stores where it's all about targets and getting every penny out of the customers, not about providing good service. Only get a promotion if your face fits or you suck up. Advice to Management Listen to your teams, they have good ideas. Focus on the customer, not just say the words but actually do it!", "rating": 1, "pros": "If the changes happen in the way they should, the company could be good", "cons": "Chronically mismanaged, especially at senior levels. Don't listen to lower levels, especially in stores where it's all about targets and getting every penny out of the customers, not about providing good service. Only get a promotion if your face fits or you suck up.", "advice": "Listen to your teams, they have good ideas. Focus on the customer, not just say the words but actually do it!"}, {"title": "Ladbrokes Plc", "text": "Pros Good Working Practice, Favourable progression Cons Too much focus on sales, horrible work life balance Advice to Management n/a", "rating": 3, "pros": "Good Working Practice, Favourable progression", "cons": "Too much focus on sales, horrible work life balance", "advice": "n/a"}, {"title": "Awful", "text": "Pros Meeting new people most of customers are good fun Cons No life outside of work. They bring in policies that make your life hell and dont stick to unless it suits them. Work life balance dont think so.......", "rating": 3, "pros": "Meeting new people most of customers are good fun", "cons": "No life outside of work. They bring in policies that make your life hell and dont stick to unless it suits them. Work life balance dont think so.......", "advice": null}, {"title": "Customer Service Manager", "text": "Pros The money was good and the management were fair. Cons It is hard to get promoted to Customer Service Manager from Cashier, as many of the CSM's stay with the company for many years due to the good pay. There is a lack of consistency regarding travel expenses. One staff member can get €30 for a trip, while another staff member will receive €10 for the same trip Advice to Management Give consistent and fair travel expenses to staff who travel to other shops as a favour, as paying staff for just the cost of petrol is not enough, as these employees are also giving their time to travel to other shops.", "rating": 5, "pros": "The money was good and the management were fair.", "cons": "It is hard to get promoted to Customer Service Manager from Cashier, as many of the CSM's stay with the company for many years due to the good pay.", "advice": "Give consistent and fair travel expenses to staff who travel to other shops as a favour, as paying staff for just the cost of petrol is not enough, as these employees are also giving their time to travel to other shops."}, {"title": "Worked 8 years at Labrokes", "text": "Pros Flexible hours, everyday is different. Good for sports lovers and customer facing job. Cons Ineffective HR. Too much control to staffing manager. Feel like you work for staffing manager and not the co. Employee is just a number. Advice to Management Communicate more with staffs at tills. Need to appreciate hardworking staffs. Didn't acknowledge my 8 yrs. Didn't get even a bye for best wishes when I left.", "rating": 3, "pros": "Flexible hours, everyday is different. Good for sports lovers and customer facing job.", "cons": "Ineffective HR. Too much control to staffing manager. Feel like you work for staffing manager and not the co. Employee is just a number.", "advice": "Communicate more with staffs at tills. Need to appreciate hardworking staffs. Didn't acknowledge my 8 yrs. Didn't get even a bye for best wishes when I left."}, {"title": "CSM", "text": "Pros Great if you are into sports, easy to keep up to date with all the goings on in various sports worldwide. Cons Not much support, poor training. Too much lone working. Advice to Management More interactive 1-1 training for new starters needed at set locations with set tutors.", "rating": 3, "pros": "Great if you are into sports, easy to keep up to date with all the goings on in various sports worldwide.", "cons": "Not much support, poor training. Too much lone working.", "advice": "More interactive 1-1 training for new starters needed at set locations with set tutors."}, {"title": "Deputy manager", "text": "Pros Enjoyable job, good fun with the punters and staff, grand national day was always a blast Cons Long nights and single manning where a pain, sitting in the shop until 10pm was a killer Advice to Management None", "rating": 5, "pros": "Enjoyable job, good fun with the punters and staff, grand national day was always a blast", "cons": "Long nights and single manning where a pain, sitting in the shop until 10pm was a killer", "advice": "None"}, {"title": "A good laugh but no good if you want to make money", "text": "Pros -reasonably easy/ stress-free job -good banter with colleagues and customers -amazing management at shop level Cons -struggled to get decent hours -terrible pay -SO MANY sales targets to meet; in one breath they'd be trying to get you to promote responsible gambling, and in the next they'd be forcing you to hit ridiculous sales targets and encourage gambling.", "rating": 3, "pros": "-reasonably easy/ stress-free job", "cons": "-struggled to get decent hours", "advice": null}, {"title": "decent company to work for", "text": "Pros sit down at chair all day Cons work long hours and pay Advice to Management look after your colleagues better", "rating": 3, "pros": "sit down at chair all day", "cons": "work long hours and pay", "advice": "look after your colleagues better"}, {"title": "Horrific", "text": "Pros Pays the bills If you can talk the talk you might get promoted Sometimes it can be a laugh with customers and staff Cons Some mpms seem to get away with bullying tactics even when complaints are made. If you are good at being a suck up to your immediate manager you can treat the ones below you as awful as you like. Also since being taken over by coral, ladbrokes has become unprofessional and is no longer a leader but a submissive joke to the blue company. But I suppose that's what happens when you put unqualified idiots in charge of an already clueless company. The hours are a joke and the overselling of products has literally chased the customers away. Single scheduling is ridiculous and I would love to see our top people single man in a city centre shop or any shop for that matter. All they care about now is penny pinching after wrecking our customer base with their rubbish ideas and overselling of products. It's probably one of the worst jobs out there at the moment. Advice to Management Listen to your staff. The people in the shops know a whole lot more than you give them credit for. And half of the area managers and mpms are useless and are quickly helping run the company into the ground. Close shops at a reasonable time and make gambling a novelty again rather than a depressing place. And for God's sake give the staff grand national night off again!! This simple act would boost morale so much more than you could even imagine", "rating": 1, "pros": "Pays the bills", "cons": "Some mpms seem to get away with bullying tactics even when complaints are made. If you are good at being a suck up to your immediate manager you can treat the ones below you as awful as you like. Also since being taken over by coral, ladbrokes has become unprofessional and is no longer a leader but a submissive joke to the blue company. But I suppose that's what happens when you put unqualified idiots in charge of an already clueless company. The hours are a joke and the overselling of products has literally chased the customers away. Single scheduling is ridiculous and I would love to see our top people single man in a city centre shop or any shop for that matter. All they care about now is penny pinching after wrecking our customer base with their rubbish ideas and overselling of products. It's probably one of the worst jobs out there at the moment.", "advice": "Listen to your staff. The people in the shops know a whole lot more than you give them credit for. And half of the area managers and mpms are useless and are quickly helping run the company into the ground. Close shops at a reasonable time and make gambling a novelty again rather than a depressing place. And for God's sake give the staff grand national night off again!! This simple act would boost morale so much more than you could even imagine"}, {"title": "Reconciliation analyst", "text": "Pros Was ok for work experience Cons No career progression unless you know someone. It not what you know but who you know policy.", "rating": 3, "pros": "Was ok for work experience", "cons": "No career progression unless you know someone. It not what you know but who you know policy.", "advice": null}, {"title": "cashier", "text": "Pros If you enjoy watching sports Cons unruly and rude customers,not all but enough to dampen the day", "rating": 3, "pros": "If you enjoy watching sports", "cons": "unruly and rude customers,not all but enough to dampen the day", "advice": null}, {"title": "Not great", "text": "Pros It was a job, I liked some customers. Cons The management is very poor, you have no training except to sit and fill out a book with no support. I met my manager 4 months into the role. Min wage and for all the money you take And stick from customers, it really should be much higher, it's the lowest paying bookies. The chairs are horrendous and never get upgraded which resulted in me suffering with bad back problems. Advice to Management Train your staff!", "rating": 3, "pros": "It was a job, I liked some customers.", "cons": "The management is very poor, you have no training except to sit and fill out a book with no support. I met my manager 4 months into the role. Min wage and for all the money you take And stick from customers, it really should be much higher, it's the lowest paying bookies. The chairs are horrendous and never get upgraded which resulted in me suffering with bad back problems.", "advice": "Train your staff!"}, {"title": "Customer Service Manager - Not as glamorous as it sounds", "text": "Pros Some people may like a job where they're working alone for a lot of it. Cons Working alone makes it hard to eat and got to the toilet if you need to, 12 hour shifts were a drag, weekends they are still open early til late, didn't get breaks sometimes , a lot of responsibility, didn't get any recognition, rotas not done very far in advance and changed often up until the week before - not great when you've got children! Advice to Management Don't overwhelm shop staff with responsibilities when there's enough to do just running the shop as it is. It worked much better when I started in 2005 and there were cashier's, deputy managers and managers for each shop. The managers cared about how their shop was run, it's impossible to continue that level of service with the roles you now have. Also, rotas done in advance so people know where they are.", "rating": 3, "pros": "Some people may like a job where they're working alone for a lot of it.", "cons": "Working alone makes it hard to eat and got to the toilet if you need to, 12 hour shifts were a drag, weekends they are still open early til late, didn't get breaks sometimes , a lot of responsibility, didn't get any recognition, rotas not done very far in advance and changed often up until the week before - not great when you've got children!", "advice": "Don't overwhelm shop staff with responsibilities when there's enough to do just running the shop as it is. It worked much better when I started in 2005 and there were cashier's, deputy managers and managers for each shop. The managers cared about how their shop was run, it's impossible to continue that level of service with the roles you now have. Also, rotas done in advance so people know where they are."}, {"title": "Manager for over 20 years", "text": "Pros Currently none. Most shop staff are pleasant but go beyond shop manager and you are greeted by Machiavellian bullies and outright liars. Cons A culture of bullying that extends from top to bottom. This used to be a good place to work but the belief that you can control your staff through intimidation and humiliation has destroyed a once pleasant environment. Despite paying lip service to responsible gambling initiatives staff are instructed to sell accounts to vulnerable and unsuitable customers. Middle management is a total disgrace. Advice to Management Value your staff. This is a job where you expect staff to work anti social hours with anti social people. They should be rewarded with more than abuse.", "rating": 1, "pros": "Currently none. Most shop staff are pleasant but go beyond shop manager and you are greeted by Machiavellian bullies and outright liars.", "cons": "A culture of bullying that extends from top to bottom. This used to be a good place to work but the belief that you can control your staff through intimidation and humiliation has destroyed a once pleasant environment. Despite paying lip service to responsible gambling initiatives staff are instructed to sell accounts to vulnerable and unsuitable customers. Middle management is a total disgrace.", "advice": "Value your staff. This is a job where you expect staff to work anti social hours with anti social people. They should be rewarded with more than abuse."}, {"title": "Horrid", "text": "Pros I honestly don’t have any Cons It’s the worst, you work alone as much as they can manage even though they are a common target for armed robbery. The customers constantly accuse you of robbing them but if they saw your pay they’d know ladbrokes were robbing you. They squeeze everything out of you and as soon as you ask for help you’re humiliated. Avoid at all costs Advice to Management Treat people like actual human beings for a change", "rating": 1, "pros": "I honestly don’t have any", "cons": "It’s the worst, you work alone as much as they can manage even though they are a common target for armed robbery. The customers constantly accuse you of robbing them but if they saw your pay they’d know ladbrokes were robbing you. They squeeze everything out of you and as soon as you ask for help you’re humiliated. Avoid at all costs", "advice": "Treat people like actual human beings for a change"}, {"title": "Manager", "text": "Pros Able to work at football grounds, meet new people everyday, Cons Un-sociable hours, limited flexibility hours Advice to Management Take staff's health and safety more professionally", "rating": 3, "pros": "Able to work at football grounds, meet new people everyday,", "cons": "Un-sociable hours, limited flexibility hours", "advice": "Take staff's health and safety more professionally"}, {"title": "Wouldn't go back there ever", "text": "Pros The only good thing about working here is if your Base shop is within the London travel and zones, you get an annual all zones travel card as a company benefit. Cons Working alone most of the time, pay is average, stressful, rude customers, supervisors always on your case thinking they know your shop/customers better than you when they really don't. Punished for when things go wrong (even when it's not your fault) never praised for when you're doing good. Bonus scheme is a load of crappy. I worked there 4 years and only one year I got a bonus- £100, insulting. Advice to Management Treat your staff with more respect. No single manning.", "rating": 3, "pros": "The only good thing about working here is if your Base shop is within the London travel and zones, you get an annual all zones travel card as a company benefit.", "cons": "Working alone most of the time, pay is average, stressful, rude customers, supervisors always on your case thinking they know your shop/customers better than you when they really don't. Punished for when things go wrong (even when it's not your fault) never praised for when you're doing good. Bonus scheme is a load of crappy. I worked there 4 years and only one year I got a bonus- £100, insulting.", "advice": "Treat your staff with more respect. No single manning."}, {"title": "Fun but low pay", "text": "Pros Sports orientated, meet some good people, high pace Cons Low hourly wage, sometimes long hours", "rating": 5, "pros": "Sports orientated, meet some good people, high pace", "cons": "Low hourly wage, sometimes long hours", "advice": null}, {"title": "Ladbrokes Life", "text": "Pros Good People, Relaxed and flexible Cons Some poor policies and systems in place", "rating": 5, "pros": "Good People, Relaxed and flexible", "cons": "Some poor policies and systems in place", "advice": null}, {"title": "Campaign Analyst", "text": "Pros Fast pace environment, lots of talents to work with. Cons Lots of over time. Advice to Management NA.", "rating": 3, "pros": "Fast pace environment, lots of talents to work with.", "cons": "Lots of over time.", "advice": "NA."}, {"title": "Ladbrokes Customer Assistant", "text": "Pros Flexible hours Tips from some customers Some fun staff Cons Horrible customers who openly try to scam new employees (was told to watch out for it by manager), or who are just generally rude Advice to Management Better staff balancing between shops. Sometimes busy shops would be understaffed and then in another shop 4 employees would be standing around in front of no customers.", "rating": 3, "pros": "Flexible hours", "cons": "Horrible customers who openly try to scam new employees (was told to watch out for it by manager), or who are just generally rude", "advice": "Better staff balancing between shops. Sometimes busy shops would be understaffed and then in another shop 4 employees would be standing around in front of no customers."}, {"title": "Do not care about staff", "text": "Pros Going home on a night ! The job used to be half decent until they merged with Coral's. Cons Company does not care about staff Minimum wage Expected to work through break, single man, do over time and 13 hour shifts that change from week to week.", "rating": 1, "pros": "Going home on a night ! The job used to be half decent until they merged with Coral's.", "cons": "Company does not care about staff", "advice": null}, {"title": "Was fun!", "text": "Pros Nice people, enjoyed working there Cons none that i can think of", "rating": 5, "pros": "Nice people, enjoyed working there", "cons": "none that i can think of", "advice": null}, {"title": "Poor Staffing", "text": "Pros I had a lenient boss who would let me pick and choose my days off as long as i did not take the mick. Cons Staffing was terrible. The turnover off staff was alarmingly fast but replacements would take ages to finally be hired leaving multiple shops understaffed. Advice to Management Employ more staff to facilitate some staff leaving so morale will not diminish.", "rating": 3, "pros": "I had a lenient boss who would let me pick and choose my days off as long as i did not take the mick.", "cons": "Staffing was terrible. The turnover off staff was alarmingly fast but replacements would take ages to finally be hired leaving multiple shops understaffed.", "advice": "Employ more staff to facilitate some staff leaving so morale will not diminish."}, {"title": "Ladbrokes", "text": "Pros Regular customers, dealing with sports etc. Cons Strange shift patterns, single manning, long shifts, low pay, few benefits. Advice to Management Stop single manning, provide normal shift patterns, pay increases or added benefits for loyal staff.", "rating": 1, "pros": "Regular customers, dealing with sports etc.", "cons": "Strange shift patterns, single manning, long shifts, low pay, few benefits.", "advice": "Stop single manning, provide normal shift patterns, pay increases or added benefits for loyal staff."}, {"title": "Great Development", "text": "Pros fast recruitment process great training great holiday good starting pay Cons cant think of any cons", "rating": 5, "pros": "fast recruitment process", "cons": "cant think of any cons", "advice": null}, {"title": "Easy Job", "text": "Pros Easy jobs Flexible as they are open from 9 am until 10 pm Only work with 1 other person most of the time Cons Have to finish at 10pm most of the the if your csm customers are aggressive Do not ever feel valued by the company", "rating": 3, "pros": "Easy jobs", "cons": "Have to finish at 10pm most of the the if your csm", "advice": null}, {"title": "Ideally part time", "text": "Pros Progression into management, is the only pass Cons For a business which generates billions a year, very little given back to shop floor workforce. Advice to Management Reason for high staff turnover is that workers dont feel apart of the business", "rating": 3, "pros": "Progression into management, is the only pass", "cons": "For a business which generates billions a year, very little given back to shop floor workforce.", "advice": "Reason for high staff turnover is that workers dont feel apart of the business"}, {"title": "Stuck at the bottom", "text": "Pros Flexible working hours so easy to work around other commitments. The day to day tasks are simple. Cons All my Pro comments are likely to disappear in a few months due to the merger with Coral. The simplicity of the job makes it boring. Advice to Management Stop hiring fast track and apprentice managers and look to promote people you already have who know the job and have shown an interest in progressing with the company. 90% of the fast track/apprentice end up leaving because they either hate the job, or make silly mistakes because they don't have the basic knowledge of the job before being thrown into management shifts.", "rating": 3, "pros": "Flexible working hours so easy to work around other commitments. The day to day tasks are simple.", "cons": "All my Pro comments are likely to disappear in a few months due to the merger with Coral. The simplicity of the job makes it boring.", "advice": "Stop hiring fast track and apprentice managers and look to promote people you already have who know the job and have shown an interest in progressing with the company. 90% of the fast track/apprentice end up leaving because they either hate the job, or make silly mistakes because they don't have the basic knowledge of the job before being thrown into management shifts."}, {"title": "Good people but disorganised", "text": "Pros Great lovely people who work there and passionate about the work Cons Can be bureaucratic Outsources a lot to external vendors Head office is in zone 5 Advice to Management Bring all technology back on shore.", "rating": 3, "pros": "Great lovely people who work there and passionate about the work", "cons": "Can be bureaucratic", "advice": "Bring all technology back on shore."}, {"title": "Affected by merger", "text": "Pros Friendly staff, although many now leaving due to merger Cons Macho culture, resistant to change", "rating": 3, "pros": "Friendly staff, although many now leaving due to merger", "cons": "Macho culture, resistant to change", "advice": null}, {"title": "Operations", "text": "Pros Worked for and with a great team Cons Merger with Coral caused (unavoidable) redundancies Advice to Management Do the best by your colleagues", "rating": 5, "pros": "Worked for and with a great team", "cons": "Merger with Coral caused (unavoidable) redundancies", "advice": "Do the best by your colleagues"}, {"title": "ladbrokes csa", "text": "Pros relaxed chilled friendly easy comfortable Cons long shifts long hours short lunches", "rating": 3, "pros": "relaxed chilled friendly easy comfortable", "cons": "long shifts long hours short lunches", "advice": null}, {"title": "Great place to work, good training", "text": "Pros its a good stop-gap, or if youre looking for a career in the company there is a lot of room for progression following the coral merger. I am still in training for a cashier, but have been told if I am still with the company I could potentially be a manager within 4 months, it can only go from there i suppose. Cons a lot of staff not convinced with the get set training book, however i can agree with some of it as I believe training should be on the job and more in an ad hoc fashion solving problems as they appear than working through a very lengthy book; which takes you away from learning the actual role whilst doing it. Advice to Management maybe re-write the training book as its out dated, maximum bets & BAC figures are wrong in there and on the CBT's.", "rating": 5, "pros": "its a good stop-gap, or if youre looking for a career in the company there is a lot of room for progression following the coral merger. I am still in training for a cashier, but have been told if I am still with the company I could potentially be a manager within 4 months, it can only go from there i suppose.", "cons": "a lot of staff not convinced with the get set training book, however i can agree with some of it as I believe training should be on the job and more in an ad hoc fashion solving problems as they appear than working through a very lengthy book; which takes you away from learning the actual role whilst doing it.", "advice": "maybe re-write the training book as its out dated, maximum bets & BAC figures are wrong in there and on the CBT's."}, {"title": "Control room operator in their head office in North London", "text": "Pros Very decent colleagues and not a bad job Cons Senior control room operator and the manager are a pair of Neanderthals Advice to Management Try not to be cavemen", "rating": 3, "pros": "Very decent colleagues and not a bad job", "cons": "Senior control room operator and the manager are a pair of Neanderthals", "advice": "Try not to be cavemen"}, {"title": "Decent enough - prior to merger", "text": "Pros Industry sector / nature of business - fun environment to be in, surrounded by sports and sports betting Relaxed culture - very relaxed working culture, with a decent amount of entertainment events Cons Stuck in old systems & beliefs in approach to market Merger & re-structure very poorly handled from top-down - didn't give much hope for success moving forward Advice to Management Back yourself to be better organised and diligent when the next organisational re-structure comes around.", "rating": 3, "pros": "Industry sector / nature of business - fun environment to be in, surrounded by sports and sports betting", "cons": "Stuck in old systems & beliefs in approach to market", "advice": "Back yourself to be better organised and diligent when the next organisational re-structure comes around."}, {"title": "Okay", "text": "Pros Laid back not too strenuous Cons Always changing, been there 6 months and the way there operate theirs shifts has changed 3 times since. Advice to Management Listen to the staff more", "rating": 3, "pros": "Laid back not too strenuous", "cons": "Always changing, been there 6 months and the way there operate theirs shifts has changed 3 times since.", "advice": "Listen to the staff more"}, {"title": "Ladbrokes", "text": "Pros Shop Staff & Shop Customers. Cheltenham , Aintree, Galway Races Buzz. Cons Area Managers Long Hours Underpaid Self Manning 12 hours No Security Advice to Management Listen to your shop staff.", "rating": 1, "pros": "Shop Staff & Shop Customers.", "cons": "Area Managers", "advice": "Listen to your shop staff."}, {"title": "Rapidly deteriorating work environment", "text": "Pros Some smart people and interesting problems to solve. Some teams have very good culture. A new CTO has started in Australia who hopefully can turn things around. Cons highly disorganised management, revolving door of management and staff, promotion rarely seems based on performance Advice to Management Stem the flow of employees and address some of the toxic work culture practises.", "rating": 1, "pros": "Some smart people and interesting problems to solve. Some teams have very good culture. A new CTO has started in Australia who hopefully can turn things around.", "cons": "highly disorganised management, revolving door of management and staff, promotion rarely seems based on performance", "advice": "Stem the flow of employees and address some of the toxic work culture practises."}, {"title": "Telebetting agent", "text": "Pros they leave you to get on with it, helpful in providing support in terms of job Cons 6 month contract, so don't mind if lose you or not due to recent merger with Coral, also not a regular shift pattern.", "rating": 3, "pros": "they leave you to get on with it, helpful in providing support in terms of job", "cons": "6 month contract, so don't mind if lose you or not due to recent merger with Coral, also not a regular shift pattern.", "advice": null}, {"title": "Not the worst!", "text": "Pros Easy enough job Occasional tip from customers Decent amount of hours Good work colleagues Not very strict compared to other retail jobs Cons Overtime without even asking for it(Can be annoying if a student and don't want too many hours) Very long hours roughly 13 a day Extremely boring at night in some shops as you can go hours without even serving a customer Start your shift in one shop and have to move to another in the evening Poor training Advice to Management Although not a difficult job after getting used to it, make sure that each new colleague is trained by a manger that cares and will help them as some are useless and don't have the ability to teach someone new", "rating": 3, "pros": "Easy enough job", "cons": "Overtime without even asking for it(Can be annoying if a student and don't want too many hours)", "advice": "Although not a difficult job after getting used to it, make sure that each new colleague is trained by a manger that cares and will help them as some are useless and don't have the ability to teach someone new"}, {"title": "Customer Service Manager", "text": "Pros You actually do incredibly little with very few challenges for the amount you're paid. Used to be able to rack up a few hours overtime as and when you needed it. Cons Ladbrokes and Coral merge has ruined the company. No more overtime whatsoever. I was doing on average 45 hours per week before the changes the merge made. However I was on a 30 hour contract. Now doing 30 hours dead on the spot. Have asked to up my contract but cuts cuts cuts to everything. Going down the pan. Advice to Management Stop trying to cut everything. Its going to force customers away and the good staff to go elsewhere.", "rating": 3, "pros": "You actually do incredibly little with very few challenges for the amount you're paid. Used to be able to rack up a few hours overtime as and when you needed it.", "cons": "Ladbrokes and Coral merge has ruined the company. No more overtime whatsoever. I was doing on average 45 hours per week before the changes the merge made. However I was on a 30 hour contract. Now doing 30 hours dead on the spot. Have asked to up my contract but cuts cuts cuts to everything. Going down the pan.", "advice": "Stop trying to cut everything. Its going to force customers away and the good staff to go elsewhere."}, {"title": "assistant manager", "text": "Pros Good staff and some pleasant customers Cons Most customers and long over worked hours Advice to Management More time hiring people to work at particular shops", "rating": 3, "pros": "Good staff and some pleasant customers", "cons": "Most customers and long over worked hours", "advice": "More time hiring people to work at particular shops"}, {"title": "CSM", "text": "Pros Good Pay, Nothing to do, good if you like working and being on you're phone Cons boring, customers, time consuming Advice to Management remodule brand", "rating": 3, "pros": "Good Pay, Nothing to do, good if you like working and being on you're phone", "cons": "boring, customers, time consuming", "advice": "remodule brand"}, {"title": "Merger Impacted Business", "text": "Pros Some great people still exist post merger but new combined company has lost identity and some great leaders... Good rewards package and benefits and up until recently good head office job security. Cons Ladbrokes previously had some great people who have been lost to the merger. The new business needs to develop its own identity and culture rather than fall back on previously flawed ones within the 2 businesses. The employment there as with many large businesses depends on what function and who the leader is. Some very good and some not very good currently in place Advice to Management Dont lose any more great Ladbrokes Senior/Middle management", "rating": 3, "pros": "Some great people still exist post merger but new combined company has lost identity and some great leaders...", "cons": "Ladbrokes previously had some great people who have been lost to the merger. The new business needs to develop its own identity and culture rather than fall back on previously flawed ones within the 2 businesses. The employment there as with many large businesses depends on what function and who the leader is. Some very good and some not very good currently in place", "advice": "Dont lose any more great Ladbrokes Senior/Middle management"}, {"title": "Average", "text": "Pros Most colleagues can turn into great friends, Pay Cons Management, Hours, lone working, no social life", "rating": 3, "pros": "Most colleagues can turn into great friends, Pay", "cons": "Management, Hours, lone working, no social life", "advice": null}, {"title": "Test Analyst", "text": "Pros Working with high volume website. Collaborative team work. Cons Attrition rate. Lot of dependency on 3rd party vendors.", "rating": 5, "pros": "Working with high volume website. Collaborative team work.", "cons": "Attrition rate. Lot of dependency on 3rd party vendors.", "advice": null}, {"title": "LADBROKES", "text": "Pros Good range of large company benefits Cons Going through a major restructure", "rating": 3, "pros": "Good range of large company benefits", "cons": "Going through a major restructure", "advice": null}, {"title": "CSM Can be frustrating.", "text": "Pros The best bits are unless your unfortunate with the managers you have you are pretty much left to your own devices. You do get to meet and work with some interesting people. Flexible working (see below)! As long as you have thick skin you'll be ok. (If your young and pretty, extreme confidence in your appearance!) Cons Can be unlucky in managers who don't know how to do Rota correctly and limited time for a life. If you request a day off you'll be put in to work and don't expect to be able to book a holiday in 6 months time you won't be able to get it unless you grovel like you've never done before. LadbrokesCoral don't care about any abuse directed at you just so long as machines aren't physically damaged. They want you to push online betting but then moan when no customers in shop! Ladbrokes have good working conditions in principal but it doesn't transfer down the management ladder. If you get more than one weekend off a month full time staff get jealous. If you part time the staff don't like you saying there are certain days you can't work. The shop your based in is not necessarily the shop you work in. No chance for career up the ladder. CSM is as far as you'll go. Ladbrokes and Corals are two different entities don't judge one by the other. I would not encourage family or friends to apply. Advice to Management Transfer down your beliefs and encourage staff not badger them to get signups. When recruiting staff think have they got the right attitude not not how quick you can leave them on their own. Bring back the fun for staff and customers. Miserable staff = miserable customers. And put sky sports in EVERY shop. How can you talk about betting opportunities when you can't watch the thing!", "rating": 3, "pros": "The best bits are unless your unfortunate with the managers you have you are pretty much left to your own devices. You do get to meet and work with some interesting people. Flexible working (see below)! As long as you have thick skin you'll be ok. (If your young and pretty, extreme confidence in your appearance!)", "cons": "Can be unlucky in managers who don't know how to do Rota correctly and limited time for a life. If you request a day off you'll be put in to work and don't expect to be able to book a holiday in 6 months time you won't be able to get it unless you grovel like you've never done before. LadbrokesCoral don't care about any abuse directed at you just so long as machines aren't physically damaged. They want you to push online betting but then moan when no customers in shop! Ladbrokes have good working conditions in principal but it doesn't transfer down the management ladder. If you get more than one weekend off a month full time staff get jealous. If you part time the staff don't like you saying there are certain days you can't work. The shop your based in is not necessarily the shop you work in. No chance for career up the ladder. CSM is as far as you'll go. Ladbrokes and Corals are two different entities don't judge one by the other. I would not encourage family or friends to apply.", "advice": "Transfer down your beliefs and encourage staff not badger them to get signups. When recruiting staff think have they got the right attitude not not how quick you can leave them on their own. Bring back the fun for staff and customers. Miserable staff = miserable customers. And put sky sports in EVERY shop. How can you talk about betting opportunities when you can't watch the thing!"}, {"title": "Ok", "text": "Pros Pays well, work with some nice people Cons long hours and very strict on you", "rating": 3, "pros": "Pays well, work with some nice people", "cons": "long hours and very strict on you", "advice": null}, {"title": "good part time work", "text": "Pros easy job, get to watch sport, pay is ok considering how easy it is Cons single manning for management is appalling. deal with some horrible people Advice to Management more interactive training, no single manning, better promo of responsible gambling", "rating": 5, "pros": "easy job, get to watch sport, pay is ok considering how easy it is", "cons": "single manning for management is appalling. deal with some horrible people", "advice": "more interactive training, no single manning, better promo of responsible gambling"}, {"title": "MoBile Developer", "text": "Pros Young, fun, nice conditions, great location Cons Work is not challenging enough Advice to Management Move more departments to Israel, we are better quality workers", "rating": 5, "pros": "Young, fun, nice conditions, great location", "cons": "Work is not challenging enough", "advice": "Move more departments to Israel, we are better quality workers"}, {"title": "Customer service manager​ Bedford area", "text": "Pros The salary is better than other retailers in the same industry Cons No help towards fares in the rural areas especially when needing taxis. The merge with corals also opening hours in the rural areas Advice to Management Look into individual cases and help where necessary and bring back shop managers look at helping increase staff morale as i have never known it worse", "rating": 3, "pros": "The salary is better than other retailers in the same industry", "cons": "No help towards fares in the rural areas especially when needing taxis. The merge with corals also opening hours in the rural areas", "advice": "Look into individual cases and help where necessary and bring back shop managers look at helping increase staff morale as i have never known it worse"}, {"title": "Avoid Avoid Avoid!", "text": "Pros Flexible hours reasonable pay for low skilled work (though not enough to deal with the horrible customers) some fellow staff are nice Cons Aggressive and rude customers daily Rude management who do not appreciate you Always overtime - even if you do not ask for it. you'll do 50+ hours with no thanks. No room to progress very far. Don't be fooled into thinking being upgraded to manager is a promotion. They just want as many people able to open and close the shops as possible. Lots of gossip from staff and management which is not very professional. Single manning - nobody should work alone with such large amounts of money in the shop. you are a sitting target. Get robbed? First thing they ask? How much money did you lose! Complain about poor management style? Then they are ALL out to get you. Advice to Management End single manning full stop! Treat staff like human beings not something you stood in!", "rating": 1, "pros": "Flexible hours", "cons": "Aggressive and rude customers daily", "advice": "End single manning full stop! Treat staff like human beings not something you stood in!"}, {"title": "Put AA and the suicide hotline on speed dial", "text": "Pros shop staff are fantastic, getting to know your regulars is always a laugh and a weird bond can be formed. Cons upper and middle management are ham fisted morons only out to further there ow career. Advice to Management Stop hiring students and trust your staff for once.", "rating": 1, "pros": "shop staff are fantastic, getting to know your regulars is always a laugh and a weird bond can be formed.", "cons": "upper and middle management are ham fisted morons only out to further there ow career.", "advice": "Stop hiring students and trust your staff for once."}, {"title": "Money pinching", "text": "Pros Wages above average. Holiday pay Good colleagues. You can manage to get to eat. Shifts can be changed easily if needed. Cons Single manning a lot. Company has no loyalty to staff. If robberies happen no support for the colleague. You can end up on a 12 hours shift and loose 1.5 hrs deducted for breaks you can not take. Advice to Management Support the colleagues when things happen. Stop single manning and keep your staff in a safe enviroment. Make sure your staff can take the breaks you deduct them for.", "rating": 3, "pros": "Wages above average. Holiday pay", "cons": "Single manning a lot. Company has no loyalty to staff. If robberies happen no support for the colleague. You can end up on a 12 hours shift and loose 1.5 hrs deducted for breaks you can not take.", "advice": "Support the colleagues when things happen. Stop single manning and keep your staff in a safe enviroment. Make sure your staff can take the breaks you deduct them for."}, {"title": "Psshhh ..", "text": "Pros Good pay Chill job at times & funny customers I actually liked the job before the whole merge with coral Meet some great people Cons Awful shifts - 3hrs 5 days a week lolll Heartless management - if you call sick they'll go on about how they haven't gone sick in 4 years? lol ok I'm human I'm not immune to sickness. Don't bother attend your shift if you feel ill the only way you'll get out is in an ambulance They think you're a machine and not a human being - mistakes happen ! Had to take stress leave due to this place Advice to Management Actually care for your staffs wellbeing not whether or not your shops going to be open. Understand we are human beings", "rating": 3, "pros": "Good pay", "cons": "Awful shifts - 3hrs 5 days a week lolll", "advice": "Actually care for your staffs wellbeing not whether or not your shops going to be open. Understand we are human beings"}, {"title": "Ok", "text": "Pros Good working atmosphere. Watch sports Cons Very unorganised. Not enough staff Advice to Management Be more organised", "rating": 5, "pros": "Good working atmosphere. Watch sports", "cons": "Very unorganised. Not enough staff", "advice": "Be more organised"}, {"title": "CSM", "text": "Pros Some colleagues nice to work with Cons Long boring unsafe hours, undertrained, if its not a business problem it will take months to sort out. Advice to Management employees happy will make everything run smoother people dont want to help out when they get mucked around so much.", "rating": 3, "pros": "Some colleagues nice to work with", "cons": "Long boring unsafe hours, undertrained, if its not a business problem it will take months to sort out.", "advice": "employees happy will make everything run smoother people dont want to help out when they get mucked around so much."}, {"title": "Ladbrokes Australia: 5 years old, still startup style and fast pace", "text": "Pros The company is really moving at a fast pace. The new features never stop coming to development teams. As a developer, one is exposed to many different stack of techniques, being languages, frameworks, storages, patterns, services, etc. The company uses bleeding edge technologies which require everyone a fast learning capability. The management is also fast and responsive. One can talk to CTO or CEO directly jumping 3 or 4 levels of hierarchy, and get issues addressed. CTO or CEO, on the other hand, might directly talk to a developer randomly one day for something he needs from you. Cons To pursue the fast pace of delivering new features, developers (sometimes forced by management) often compromise on coding standard. The code base is quite messy and company does not allow time/money to tidy it up. The company is a betting company, not a technology company. So development teams do not have much to say on decision making and purely work for marketing or operations teams. Often, a wrong decision will cost development team 1 month time or more wasted. Advice to Management Change the company from a betting e-commerce to an IT tech powerhouse.", "rating": 5, "pros": "The company is really moving at a fast pace. The new features never stop coming to development teams. As a developer, one is exposed to many different stack of techniques, being languages, frameworks, storages, patterns, services, etc. The company uses bleeding edge technologies which require everyone a fast learning capability.", "cons": "To pursue the fast pace of delivering new features, developers (sometimes forced by management) often compromise on coding standard. The code base is quite messy and company does not allow time/money to tidy it up.", "advice": "Change the company from a betting e-commerce to an IT tech powerhouse."}, {"title": "Stay Away", "text": "Pros Tips from customers Having a lunch break (because you didn't always get them because there would be nobody to take over your shift and area managers or MPMs never answered their phones) Cons Be prepared to be treated like an employee number and not an actual human being. They company does not care about the staff on any level and try to sack you over every little thing. People hardly ever show up for their shift so you are constantly being moved from shop to shop (up to 4 times in one shift). I have worked in over 10 stores and more than half of them had rodent issues so if you're ok with that then by all means apply to work here. Advice to Management Treat staff better and reward them for the hard work", "rating": 3, "pros": "Tips from customers", "cons": "Be prepared to be treated like an employee number and not an actual human being. They company does not care about the staff on any level and try to sack you over every little thing. People hardly ever show up for their shift so you are constantly being moved from shop to shop (up to 4 times in one shift). I have worked in over 10 stores and more than half of them had rodent issues so if you're ok with that then by all means apply to work here.", "advice": "Treat staff better and reward them for the hard work"}, {"title": "Doesn't care for safety of employees", "text": "Pros Opportunity to train as a manager Good rapport with customers Good training programme Cons Not enough safety measures put in, in the event of robbery Extremely long 14 hour shifts lone working Terrible marketplace manager who would talk badly about employees to colleagues and favour certain people Bullying behaviour from managers Never enough staff Regular breaks a rarity No employee discount or benefits Advice to Management Value the safety of your employees more, stop lone working and train your market place managers better!", "rating": 1, "pros": "Opportunity to train as a manager", "cons": "Not enough safety measures put in, in the event of robbery", "advice": "Value the safety of your employees more, stop lone working and train your market place managers better!"}, {"title": "Zero progression", "text": "Pros Flexible working hours Good people to work with (sometimes) Overall easy job Cons Rude, annoying and childish customers on a daily basis. Market place managers and area managers are virtually non-existent until you do something wrong. Silly little tests every couple weeks. 14+ hour shifts with the same amount of break time as somebody working 6 hours. Advice to Management Get more involved! We are not robots.", "rating": 3, "pros": "Flexible working hours", "cons": "Rude, annoying and childish customers on a daily basis.", "advice": "Get more involved! We are not robots."}, {"title": "Good for a stop gap", "text": "Pros Flexible shifts Staff Guaranteed hours Pays better than most other retailers Cons Trade until 10pm in most shops Baffling Sunday trading hours Literally no chance of progression Advice to Management Bring back shop managers to give people something to work towards.", "rating": 3, "pros": "Flexible shifts", "cons": "Trade until 10pm in most shops", "advice": "Bring back shop managers to give people something to work towards."}, {"title": "Retail Associate", "text": "Pros Lively atmosphere to work in, especially around Cheltenham time. Interaction with customers part of the job I enjoyed. Cons Feel the in-shop employees aren't appreciated by the people further up the ladder. Working hours very unsociable- Weekends and Evening work the norm.", "rating": 3, "pros": "Lively atmosphere to work in, especially around Cheltenham time. Interaction with customers part of the job I enjoyed.", "cons": "Feel the in-shop employees aren't appreciated by the people further up the ladder. Working hours very unsociable- Weekends and Evening work the norm.", "advice": null}, {"title": "Horrendous", "text": "Pros It's a job of sorts Cons Wages always wrong Stinking shops Stinking customers Upper staff care not a jot Advice to Management Rethink management for staff retention", "rating": 1, "pros": "It's a job of sorts", "cons": "Wages always wrong", "advice": "Rethink management for staff retention"}, {"title": "Great place to work", "text": "Pros Brilliant people and very supportive management Cons Customers can be very difficult and at times aggressive Advice to Management Formulate a new bonus scheme", "rating": 5, "pros": "Brilliant people and very supportive management", "cons": "Customers can be very difficult and at times aggressive", "advice": "Formulate a new bonus scheme"}, {"title": "Don't work here", "text": "Pros The customers that are regulars brighten up a dull day Cons Hours unsociable, no breaks, no rewards and constant pushing add on sales Advice to Management Don't think about staff all about profit", "rating": 1, "pros": "The customers that are regulars brighten up a dull day", "cons": "Hours unsociable, no breaks, no rewards and constant pushing add on sales", "advice": "Don't think about staff all about profit"}, {"title": "Customer Service Manager", "text": "Pros Get to watch sport, staff share the same sporting interest Cons Horrific working hours, customers are terrible, management don't care. Advice to Management Spend more time worrying about your staff than your profits", "rating": 3, "pros": "Get to watch sport, staff share the same sporting interest", "cons": "Horrific working hours, customers are terrible, management don't care.", "advice": "Spend more time worrying about your staff than your profits"}, {"title": "Best Management", "text": "Pros Very helpful training and friendly staff Cons Long hours and sometimes rude customers Advice to Management Nothing really keep ot up", "rating": 5, "pros": "Very helpful training and friendly staff", "cons": "Long hours and sometimes rude customers", "advice": "Nothing really keep ot up"}, {"title": "Mpm", "text": "Pros Freedom to work by yourself when you desire . Good wages. Cons Always covering sick colleagues shifts . Long hours. Advice to Management We are not robots. The job description gas many hats. A human cannot do everything on the list all the time. It's like being a manager, a worker, HR, a teacher, a disciplinarian, and an administrator. Lighten the load.", "rating": 3, "pros": "Freedom to work by yourself when you desire . Good wages.", "cons": "Always covering sick colleagues shifts . Long hours.", "advice": "We are not robots. The job description gas many hats. A human cannot do everything on the list all the time. It's like being a manager, a worker, HR, a teacher, a disciplinarian, and an administrator. Lighten the load."}, {"title": "An awful company that keeps getting worse....", "text": "Pros Shift work ( if you like it) Free uniform Cons Middle Management brought in from 'retail' so have no idea how a bookies should be run. Mullins and Co are quite possibly the most inept and incompetent group of individuals to be found in any boardroom in the UK. Ladbrokes are no longer a proper bookmakers just a high street amusement arcade that does betting as a sideline. Gaming machines are all they care about, traditional 'punters' that have kept the business afloat for years are now treated like dirt due to the fact that if they won't sign up for an account card or waste their lives and hard earned cash on the gaming machines then the company just see them as a hindrance. From May there will now be 9 UK racecourses that Ladbrokes have lost the rights to show pictures or broadcast commentary on, plus ALL the Horse Racing from South Africa , which is pretty popular. Yet despite this staff still keep getting pressured to sign people, up for accounts, but why would anyone want to sign up for an account with a bookmakers that doesn't show half the racing? This question seems to have bypassed the fools that are running the company in to the ground. Any glowing reviews on here are either from people that haven't been with this pathetic shower of a firm for long, or have been posted by the company themselves to counteract all the negative reviews on here. This firm is dying on it's feet due to mixture of greed, incompetence and mismanagement.. Experienced shop staff like myself are either dropping down to part-time or leaving altogether. My advice is don't work for this lot unless you're really,really, desperate for work. At the very best it's just about OK as a stop-gap part time job until something better comes along Advice to Management Your most experienced staff are leaving by the bus load and those of us that are left and still trying to get out just don't care anymore. Ladbrokes reputation with most punters now stinks worse than a month old dead Greyhound.", "rating": 1, "pros": "Shift work ( if you like it)", "cons": "Middle Management brought in from 'retail' so have no idea how a bookies should be run.", "advice": "Your most experienced staff are leaving by the bus load and those of us that are left and still trying to get out just don't care anymore."}, {"title": "not such a bad job, but better out there", "text": "Pros other team members and tips Cons difficult working hours and late closing Advice to Management pay more", "rating": 3, "pros": "other team members and tips", "cons": "difficult working hours and late closing", "advice": "pay more"}, {"title": "Good company with great benefits", "text": "Pros they take care well of the employees Cons a bit strikt with rules", "rating": 5, "pros": "they take care well of the employees", "cons": "a bit strikt with rules", "advice": null}, {"title": "Good company with great benefits", "text": "Pros they take care well of the employees Cons a bit strikt with rules", "rating": 5, "pros": "they take care well of the employees", "cons": "a bit strikt with rules", "advice": null}, {"title": "Unprofessional Management", "text": "Pros Few staff members were very supportive. Cons Management doesn't have a clue how to deal with employees, Terrible experience working there and whatever was promised during interview the job was completely opposite. Advice to Management Please train your mangers with people management skills and may be some manners would do too.", "rating": 1, "pros": "Few staff members were very supportive.", "cons": "Management doesn't have a clue how to deal with employees, Terrible experience working there and whatever was promised during interview the job was completely opposite.", "advice": "Please train your mangers with people management skills and may be some manners would do too."}, {"title": "Shadow of its former self", "text": "Pros Was a great environment with opportunity to push yourself. Cons Corporate culture and identity lost a number of years ago.", "rating": 3, "pros": "Was a great environment with opportunity to push yourself.", "cons": "Corporate culture and identity lost a number of years ago.", "advice": null}, {"title": "ladbrokes", "text": "Pros have started adding incentive schemes for employees Cons high up managers tend not to listen to shop staff, long hours, Advice to Management pay attention to the information shop staff try to tell you", "rating": 3, "pros": "have started adding incentive schemes for employees", "cons": "high up managers tend not to listen to shop staff, long hours,", "advice": "pay attention to the information shop staff try to tell you"}, {"title": "Customer Service Advisor", "text": "Pros The rate of pay was good considering the job. Flexible hours when you're in college with good opportunities to progress. Cons Long shift hours, often given the worst shifts when you're a part time employee and can sometimes be working alone for long periods of time. Advice to Management Increase safety for staff and ensure each member gets a lunch break.", "rating": 3, "pros": "The rate of pay was good considering the job. Flexible hours when you're in college with good opportunities to progress.", "cons": "Long shift hours, often given the worst shifts when you're a part time employee and can sometimes be working alone for long periods of time.", "advice": "Increase safety for staff and ensure each member gets a lunch break."}, {"title": "Csm", "text": "Pros Good money Great bonus Great reward Easy relaxed atmosphere Cons Have to work long hours. Force you to do overtime when dont want to do Advice to Management Should have better operating managment. Hard to get your oppinions heard", "rating": 5, "pros": "Good money", "cons": "Have to work long hours. Force you to do overtime when dont want to do", "advice": "Should have better operating managment. Hard to get your oppinions heard"}, {"title": "Assistant Shop Manager", "text": "Pros Time flew , there was always something to do Cons Extra long hours, Had to run around the district covering for management absentees,Had to put up with untidiness in other manager's shops, abuse from customers, homophobia from customers, racist customers Advice to Management Management cannot do much because of the nature of the business", "rating": 3, "pros": "Time flew , there was always something to do", "cons": "Extra long hours, Had to run around the district covering for management absentees,Had to put up with untidiness in other manager's shops, abuse from customers, homophobia from customers, racist customers", "advice": "Management cannot do much because of the nature of the business"}, {"title": "Ok", "text": "Pros Flexible can work around education or other responsibilities Cons Disrespectful Customers, last minute staff changing", "rating": 3, "pros": "Flexible can work around education or other responsibilities", "cons": "Disrespectful Customers, last minute staff changing", "advice": null}, {"title": "Be warned.There is no chance of management progression after csm.", "text": "Pros Some nice customers. Pay is competitive for industry Cons Mpms are virtually non existent unless there's a problem in the shop. Management structure is all wrong and desperately needs changing as the next step to mpm is virtually impossible. Disgruntled csms leaving in their droves.Iv seen at least 10 good csms leave through lack of incentives. Some good csm been in the job over 10 years have just been flogged ,used,given false incentives to progress that were never there in the first place. Shops need a proper shop manager in their shops regularly to function properly. Rude and threatening behaviour from some customers. Unrealistic grid account targets. In fact it's got to the point where it doesn't matter what you do in your shop,how busy you've been or how hard your team have worked,if you don't get an account then you get so much pressure put on you from upper management it's no wonder staff end up leaving. Advice to Management Scrap the mpms. Get regular shop managers and deputy's in your shops. Give staff and lower management a dangling carrot to strive for . You want your shops to perform better then staff morale is the key. If this doesn't happen then I'm afraid you will just see a conveyor belt of very low skilled bad csms in and out of your shops.And if you do get a few good ones they will realise how hard work and commitment to the company does not benefit them and will leave as well.", "rating": 3, "pros": "Some nice customers.", "cons": "Mpms are virtually non existent unless there's a problem in the shop.", "advice": "Scrap the mpms."}, {"title": "Joke", "text": "Pros Good banter with the customers. Get to sit on your bum all day. Cons Staff are all out for themselves, constantly trying to get you into trouble and snitching. Gossiping is like nothing I have seen before all on the phone to each other with goss. Non-structure in management. Will discipline you for just about anything, no wonder there turnover is so high. Staff who have been there for a long time basically get to do what they want while everyone is treated like scum. Area manager is not nice and doesn't listen thinks it's ok to phone you 2 days before your probationary meeting to tell you what the outcome is probably going to be. Seriously do not work here it is a joke. You are used if you have a car to go to every shop. I have seen myself in 4 shops in one day and they aren't all that close. Constantly getting phone calls to cover shifts but the minute you need a favour they are not willing to help. Massive joke of a company. Advice to Management Get a grip", "rating": 1, "pros": "Good banter with the customers.", "cons": "Staff are all out for themselves, constantly trying to get you into trouble and snitching. Gossiping is like nothing I have seen before all on the phone to each other with goss. Non-structure in management. Will discipline you for just about anything, no wonder there turnover is so high. Staff who have been there for a long time basically get to do what they want while everyone is treated like scum. Area manager is not nice and doesn't listen thinks it's ok to phone you 2 days before your probationary meeting to tell you what the outcome is probably going to be. Seriously do not work here it is a joke. You are used if you have a car to go to every shop. I have seen myself in 4 shops in one day and they aren't all that close. Constantly getting phone calls to cover shifts but the minute you need a favour they are not willing to help. Massive joke of a company.", "advice": "Get a grip"}, {"title": "Old heads and jobsworth", "text": "Pros Lots of sport to watch and most shops have sky. Good job for a student. Cons Away pay. Very, very little opportunity for progression and not a nice business on the whole. Advice to Management How about giving a toss about staff safety and stop pretending to care about staff and customer welfare.", "rating": 3, "pros": "Lots of sport to watch and most shops have sky. Good job for a student.", "cons": "Away pay. Very, very little opportunity for progression and not a nice business on the whole.", "advice": "How about giving a toss about staff safety and stop pretending to care about staff and customer welfare."}, {"title": "Good Duty Manager", "text": "Pros Nice people to work with, great managers who are very friendly Cons have to wait for 1 year for any progression, shift working so you will definitely work on weekend", "rating": 3, "pros": "Nice people to work with, great managers who are very friendly", "cons": "have to wait for 1 year for any progression, shift working so you will definitely work on weekend", "advice": null}, {"title": "Ladbroke duty manager", "text": "Pros Good if you are interested in horse racing as you can watch it on to whilst working, that's about all though Cons Management are always out to get you, abusive customers, unreliable staff, not much flexibility if you have children at home and long shifts expected from you Advice to Management Be nicer to staff and they will be more willing to help you, a review of the wage system may help to find you more reliable staff", "rating": 3, "pros": "Good if you are interested in horse racing as you can watch it on to whilst working, that's about all though", "cons": "Management are always out to get you, abusive customers, unreliable staff, not much flexibility if you have children at home and long shifts expected from you", "advice": "Be nicer to staff and they will be more willing to help you, a review of the wage system may help to find you more reliable staff"}, {"title": "Poor salary for London, not much opportunity for serious progression", "text": "Pros If you're a sports/racing fan, it's a fun environment to work in. Everyone gets on with work but you're constantly aware of all the sporting action with many screens dotted around the office. Cons Despite being very ambitious, I found it difficult to get where I wanted in the business. My salary was pretty low for London and thus I had to leave my post. Not much support for career progression, and a very male dominated working environment. Advice to Management With the cost of rent in London at the moment for young people, you could risk losing some talented people if salaries aren't increased.", "rating": 3, "pros": "If you're a sports/racing fan, it's a fun environment to work in. Everyone gets on with work but you're constantly aware of all the sporting action with many screens dotted around the office.", "cons": "Despite being very ambitious, I found it difficult to get where I wanted in the business. My salary was pretty low for London and thus I had to leave my post. Not much support for career progression, and a very male dominated working environment.", "advice": "With the cost of rent in London at the moment for young people, you could risk losing some talented people if salaries aren't increased."}, {"title": "...eh", "text": "Pros Tips from customers were great, as was the social side if you got on with employees/customers. Cons Watching people lose their money was draining, as was seeing how much people put into the machines. Long unsociable hours.", "rating": 3, "pros": "Tips from customers were great, as was the social side if you got on with employees/customers.", "cons": "Watching people lose their money was draining, as was seeing how much people put into the machines. Long unsociable hours.", "advice": null}, {"title": "Difficult", "text": "Pros Other staff members, tips from customers watching sport all day if you like sports Cons No support from management, staff don't feel safe, no real opportunity for progression 12 hour shift but no shift bonus single manning in shops in evening Advice to Management Help develop a development programme for employees to keep them interested in working there. Improve engagement and morale", "rating": 1, "pros": "Other staff members, tips from customers watching sport all day if you like sports", "cons": "No support from management, staff don't feel safe, no real opportunity for progression 12 hour shift but no shift bonus single manning in shops in evening", "advice": "Help develop a development programme for employees to keep them interested in working there. Improve engagement and morale"}, {"title": "Regional Operations Manager", "text": "Pros Fantastic innovative company, looking to always improve both the business and colleagues, daily seeking ways to improve and encouraging others to follow. Cons Going through merger, so will take 3-6 months to settle.", "rating": 5, "pros": "Fantastic innovative company, looking to always improve both the business and colleagues, daily seeking ways to improve and encouraging others to follow.", "cons": "Going through merger, so will take 3-6 months to settle.", "advice": null}, {"title": "The worst company I have ever worked for", "text": "Pros None what so ever as the company has lost the plot and the some of MPM's which is most of them play with your hours and you don't get the right money in your account. Working at Ladbrokes is equivalent to modern slavery Cons Absolutely nothing as there is nothing to share about Ladbrokes. Please I have worked there and nothing is what they say. Simply pathetic Advice to Management Just simply close as you can't even afford to show live racing and the management keeps on going about loyalty cards, simply pathetic as all the the senior management is just in for brownie points.", "rating": 1, "pros": "None what so ever as the company has lost the plot and the some of MPM's which is most of them play with your hours and you don't get the right money in your account. Working at Ladbrokes is equivalent to modern slavery", "cons": "Absolutely nothing as there is nothing to share about Ladbrokes. Please I have worked there and nothing is what they say. Simply pathetic", "advice": "Just simply close as you can't even afford to show live racing and the management keeps on going about loyalty cards, simply pathetic as all the the senior management is just in for brownie points."}, {"title": "Customer Service Advisor", "text": "Pros Great craic, mentally stimulating, amazing staff & great work culture, working with lots of money and learning new things everyday. Cons Working nights, long hours, not very active role and can be a bit monotonous but its still good Advice to Management Management are great! Very understanding and willing to listen and work with you. Makes the job a pleasure and makes you feel like a valued team member", "rating": 5, "pros": "Great craic, mentally stimulating, amazing staff & great work culture, working with lots of money and learning new things everyday.", "cons": "Working nights, long hours, not very active role and can be a bit monotonous but its still good", "advice": "Management are great! Very understanding and willing to listen and work with you. Makes the job a pleasure and makes you feel like a valued team member"}, {"title": "Staff worked into the ground", "text": "Pros If you love sport then this is a good place to start Cons No benefits, unsociable hours, irate customers Advice to Management Treat the staff as if they were going to be there for ever, too much demand on too few quality members of staff", "rating": 3, "pros": "If you love sport then this is a good place to start", "cons": "No benefits, unsociable hours, irate customers", "advice": "Treat the staff as if they were going to be there for ever, too much demand on too few quality members of staff"}, {"title": "Staff worked into the ground", "text": "Pros If you love sport then this is a good place to start Cons No benefits, unsociable hours, irate customers Advice to Management Treat the staff as if they were going to be there for ever, too much demand on too few quality members of staff", "rating": 3, "pros": "If you love sport then this is a good place to start", "cons": "No benefits, unsociable hours, irate customers", "advice": "Treat the staff as if they were going to be there for ever, too much demand on too few quality members of staff"}, {"title": "Customer Service Manager", "text": "Pros Shop team are really nice people to work with. Hours are good and overtime is usually given if asked. Some customers are nice and will be more like friends. Days off when requested in advance are usually given. Career progression is there for those willing to work hard. Staff benefit scheme is rewarding with money off vouchers to places. Commission based sales involved. Cons Weekend work is ever present. Will barely get anytime off. Rude and occasional aggravated customers. Higher management are often a bit too distant and only appear when it suits. Although there is a reward scheme it is flawed and doesn't always reward the hardest working. Advice to Management Be more active in the shops. If you are an MPM make sure you spend equal time in shops. Are and Regional managers could have more frequent visits.", "rating": 3, "pros": "Shop team are really nice people to work with.", "cons": "Weekend work is ever present. Will barely get anytime off.", "advice": "Be more active in the shops. If you are an MPM make sure you spend equal time in shops. Are and Regional managers could have more frequent visits."}, {"title": "Can be very interesting", "text": "Pros - Meet new people - Customer facing - Opportunity to progress although not much after multi site management - Tips - Get paid to watch Sport - very rarely do you get a full day Cons - Can get a bit repetitive and tedious - upper management doesn't really care - not enough progression room - not enough support for progression Advice to Management Have a day in shop. Experience what we experience. Some of you have been in office too long to remember what it feels like to be in a shop! Review reward structure ( for a company that makes tens of millions in profit [with a large portion of that coming by way of your front line employees] you don't give back enough. Reward with time and a half overtime double or time and a half pay on weekends or some extra incentive for those of us who work wherever and whenever you ask.", "rating": 3, "pros": "- Meet new people", "cons": "- Can get a bit repetitive and tedious", "advice": "Have a day in shop. Experience what we experience. Some of you have been in office too long to remember what it feels like to be in a shop!"}, {"title": "Good staff and customers but company need to be look at!!", "text": "Pros As with title great staff and lovely customers in which shop I work in, have to say depends on mpm but they will do anything to help with days off etc. Cons Long days you finish between 9/10pm depends on what shop your in, they only open for the machines in the evenings that's the only reason and some shops do not have customers after certain times, shops are not as busy as they use to be but up above don't seem to see that all they think about is money, to justify shops opening late is beyond me, open 9-9.30/10 Monday-Sunday! Company had now merge with corals (ladbrokescoralplc) some present and some past who recently has left felt nervous as they do like to go through phases on picking on the silliest things and the road ends up being with a formal meeting under you, they feel like you gonna lose your job and they were pushing out staff way before the merger was completed. Advice to Management Stop thinking about company profits and think about the staff! Oh I would like to mention just don't offer 5th place on national online and not in shops, the shops suffered last year in result.", "rating": 3, "pros": "As with title great staff and lovely customers in which shop I work in, have to say depends on mpm but they will do anything to help with days off etc.", "cons": "Long days you finish between 9/10pm depends on what shop your in, they only open for the machines in the evenings that's the only reason and some shops do not have customers after certain times, shops are not as busy as they use to be but up above don't seem to see that all they think about is money, to justify shops opening late is beyond me, open 9-9.30/10 Monday-Sunday! Company had now merge with corals (ladbrokescoralplc) some present and some past who recently has left felt nervous as they do like to go through phases on picking on the silliest things and the road ends up being with a formal meeting under you, they feel like you gonna lose your job and they were pushing out staff way before the merger was completed.", "advice": "Stop thinking about company profits and think about the staff! Oh I would like to mention just don't offer 5th place on national online and not in shops, the shops suffered last year in result."}, {"title": "Stressful and risky job", "text": "Pros You get to know the customers and staff really well, made some good friends. You learn how to handle money quickly and effectively. The job is fun to a certain extent if you enjoy watching sport. Cons One word - management. I have worked in a fair few jobs previously and never have I felt so at risk of losing my job over the smallest thing. It's almost as if more and more hurdles are added to try and make you trip up. An example of this was we received a document stating how we should display the shop, you had to have 4 magnets on each sheet of card/form and the sheets needed to be 1 inch apart, if you missed this and a manager came in then expect all hell to break loose. Certain customers were also allowed late bets which was decided by my MPM which made serving customers very stressful. We were told in security meetings to not do this but management would override this, making you feel you wouldn't have a leg to stand on if security got involved. You would spend the majority of the day on your own, this made toilet breaks very difficult especially during the evening. You are also only paid around 5 minutes at the end of your shift which is to cover you closing the shop, sometimes I would still be closing the shop 30/40mins later than I was paid for. If your cashier doesn't turn up then look forward to a 14 hour shift on your own with no break, no attempt is made by management to rectify this and you aren't encouraged to close the shop for an hour to allow time for your break, yet more hours unpaid. There is snobbery in upper management and they aren't afraid to show it to your face when they see you. It's also worth mentioning that several times staff members have been encouraged to take part in \"engagement surveys\" that are \"anonymous\", however you need to say where you work, how old you are and what shifts you do before entering any feedback. Doesn't seem very anonymous to me. Advice to Management Stop treating staff as if we are just numbers, we are human beings with families to feed. If someone is doing a good job let them know. Ask for REAL anonymous feedback instead of pretending and then not doing anything about it.", "rating": 1, "pros": "You get to know the customers and staff really well, made some good friends.", "cons": "One word - management. I have worked in a fair few jobs previously and never have I felt so at risk of losing my job over the smallest thing. It's almost as if more and more hurdles are added to try and make you trip up. An example of this was we received a document stating how we should display the shop, you had to have 4 magnets on each sheet of card/form and the sheets needed to be 1 inch apart, if you missed this and a manager came in then expect all hell to break loose.", "advice": "Stop treating staff as if we are just numbers, we are human beings with families to feed. If someone is doing a good job let them know. Ask for REAL anonymous feedback instead of pretending and then not doing anything about it."}, {"title": "Join if you want no prospects", "text": "Pros Aside from the few good staff you may be lucky enough to work with (for a short period of your 15 1/2 hour day) absolutely nothing Cons No recognition of service and ability, no job prospects, zero promotion from within. No understanding of problems frontline staff actually face, more and more arbitrary rules that are essentially geared towards them being able to hold something over you. A management structure so poorly planned that most senior management seem to make work for everyone else simply so they look busy themselves and can justify their existence to their bosses. Terrible training for new employees, consequently overloading more experienced staff. All in all a thoroughly poor place to work Advice to Management Yes it's harder to train the frontline staff and perhaps inspire them but unfortunately simply bringing in a new manager every 5 minutes as they always leave when they realise the mess won't to solve the problems.", "rating": 1, "pros": "Aside from the few good staff you may be lucky enough to work with (for a short period of your 15 1/2 hour day) absolutely nothing", "cons": "No recognition of service and ability, no job prospects, zero promotion from within. No understanding of problems frontline staff actually face, more and more arbitrary rules that are essentially geared towards them being able to hold something over you. A management structure so poorly planned that most senior management seem to make work for everyone else simply so they look busy themselves and can justify their existence to their bosses. Terrible training for new employees, consequently overloading more experienced staff. All in all a thoroughly poor place to work", "advice": "Yes it's harder to train the frontline staff and perhaps inspire them but unfortunately simply bringing in a new manager every 5 minutes as they always leave when they realise the mess won't to solve the problems."}, {"title": "My Review", "text": "Pros Great community to work in. Cons Maybe more opportunity to advance within the company. Advice to Management N/A", "rating": 3, "pros": "Great community to work in.", "cons": "Maybe more opportunity to advance within the company.", "advice": "N/A"}, {"title": "Got sold", "text": "Pros Lots of overtime so if you need money, they give you lots of shifts. Cons All types of customers Some MPMs don't know what they're doing Your life is basically at danger, people get robbed Your efforts aren't seen by the region at all My shop is being sold to another bookmaker due to Ladbrokes and Coral merging so I'm resigning. I was never given the option to transfer to a different shop as it \"wasn't allowed\". What a lie. After they recruit new people all the time. Advice to Management Care about your staff please.", "rating": 3, "pros": "Lots of overtime so if you need money, they give you lots of shifts.", "cons": "All types of customers", "advice": "Care about your staff please."}, {"title": "An ok stepping stone.", "text": "Pros Easy to get to customer service manager which looks good on a CV. Can have good colleagues. Cons Long hours. (14 and a half hour shifts) Low pay for what you deal with. Abusive customers who blame you for everything. Single manning which leaves you feeling vulnerable. Just babysitting machines. Expected to know everything. No advancement above CSM. Have to find your own cover if you're unable to do a shift which you've requested off. Management don't listen. Never shown appreciation. Always have to double check pay as they often underpay staff. No extras for working Sundays or bank holidays. Advice to Management Stop with the cluster managers and show your staff you appreciate them.", "rating": 3, "pros": "Easy to get to customer service manager which looks good on a CV.", "cons": "Long hours. (14 and a half hour shifts)", "advice": "Stop with the cluster managers and show your staff you appreciate them."}, {"title": "If you need money, it's a job, I suppose....", "text": "Pros * Banter with customers * Can be pretty low stress, depending on location, colleagues and customers * 5-6 weeks holiday per year, depending on time served Cons * Occasional adveseriality from customers * Long days * Lone working for CSMs * No double time for Sundays, bank holidays etc any more * Bit of a glass ceiling with the effective removal of the Shop Manager role. Advice to Management Listen to your front line staff more.", "rating": 3, "pros": "* Banter with customers", "cons": "* Occasional adveseriality from customers", "advice": "Listen to your front line staff more."}, {"title": "Ladbrokes", "text": "Pros The Staff are good but that is about it to be honest but even then they are sometimes a con Cons Everything else in the business is terrible so out of touch with the industry and its staff Advice to Management Don't", "rating": 3, "pros": "The Staff are good but that is about it to be honest but even then they are sometimes a con", "cons": "Everything else in the business is terrible so out of touch with the industry and its staff", "advice": "Don't"}, {"title": "Mentally stimulating", "text": "Pros Interesting good colleagues nice customers Cons Long hours poorly paid for amount your expected to know learn and do. Advice to Management Encourage and reward staff", "rating": 3, "pros": "Interesting good colleagues nice customers", "cons": "Long hours poorly paid for amount your expected to know learn and do.", "advice": "Encourage and reward staff"}, {"title": "HR Service Team", "text": "Pros A few select people that i really got on with and the HRD who was great Cons The manager of the service team was HORRIFIC! Awful management skills, rude made me feel small. I left the business because i was fed up of being upset because of the way the staff were treated! It really was an awful place to work. The offices were dingy, salary was not fair or even, we were lied to regularly. Advice to Management Get a whole new management team in place - give them training and make sure the higher levels of management watch the lower levels closely so they can see what its like for the bulk of the team!", "rating": 1, "pros": "A few select people that i really got on with and the HRD who was great", "cons": "The manager of the service team was HORRIFIC! Awful management skills, rude made me feel small. I left the business because i was fed up of being upset because of the way the staff were treated! It really was an awful place to work. The offices were dingy, salary was not fair or even, we were lied to regularly.", "advice": "Get a whole new management team in place - give them training and make sure the higher levels of management watch the lower levels closely so they can see what its like for the bulk of the team!"}, {"title": "Terrible Place", "text": "Pros Good as a stepping stone as it's very easy to become a customer service manager as you'll be trained over a few months. Cons Staff are not well looked after, Under appreciated, Overworked, and everyone is pushed around given silly shifts without warning. Advice to Management Take care of your staff properly, show appreciation to staff, have an actual structure of work and stop over working people", "rating": 1, "pros": "Good as a stepping stone as it's very easy to become a customer service manager as you'll be trained over a few months.", "cons": "Staff are not well looked after, Under appreciated, Overworked, and everyone is pushed around given silly shifts without warning.", "advice": "Take care of your staff properly, show appreciation to staff, have an actual structure of work and stop over working people"}, {"title": "Do not work here", "text": "Pros The only pro to working here was the buzz around the shop during the festival times like the grand national ect. Cons Long hours, middle management not very understanding of actual staff needs. Staff working hard are treated the same as staff just coasting by despite the fact that work rate/load can be tracked on computer system. No reward system of genuine hard work. Unsafe working conditions, women often left to work alone at night time - when I worked there I was threatened many times and couldn't leave work until a Guard showed up to escort me to my car. Advice to Management Listen to your staff, reward the hard workers and sort out those not pulling their weight. Have more than 1 member of staff working at a time.", "rating": 1, "pros": "The only pro to working here was the buzz around the shop during the festival times like the grand national ect.", "cons": "Long hours, middle management not very understanding of actual staff needs. Staff working hard are treated the same as staff just coasting by despite the fact that work rate/load can be tracked on computer system. No reward system of genuine hard work. Unsafe working conditions, women often left to work alone at night time - when I worked there I was threatened many times and couldn't leave work until a Guard showed up to escort me to my car.", "advice": "Listen to your staff, reward the hard workers and sort out those not pulling their weight. Have more than 1 member of staff working at a time."}, {"title": "good company", "text": "Pros sports banter customers tipsters locations Cons nothing really to be honest", "rating": 5, "pros": "sports banter customers tipsters locations", "cons": "nothing really to be honest", "advice": null}, {"title": "Ladbrokes ireland", "text": "Pros Great staff friends for life Pay Cons Under appreciated by management No communication between staff and management", "rating": 3, "pros": "Great staff friends for life", "cons": "Under appreciated by management", "advice": null}, {"title": "Not a bad place to become an empty, cold husk of a human being.", "text": "Pros - If you aren't an aggressive jobsworth with the sole intention of being confrontational then you can get to a stage where the regulars aren't looking at you in the same way you would look at a pile of human excrement. - Able to watch endless hours of Top Gear repeats and Jeremy Kyle if you are that way inclined. - You meet a lot of hardened criminals (if you need some work done). Cons A Customer Service Manager at Ladbrokes holds about the same level of authority as the old folks you see writing down number plates of cars who are driving above 10mph down their hideous country lanes. Don't be fooled into thinking your promotion from a cashier means anything at all. Other employers are not in the slightest bit interested, and rightfully so. It is a dead end job which many of the employees, including myself have been tricked in to doing. You are not a manager, you are a glorified cashier who is paid an extra £1 to do the risky stuff and work 14 hour shifts. If somehow you end up working for Ladbrokes then under no circumstances should you do what I did during my first few months there, which is to work hard, do favours and try and excel. Doing these kind of things will lead to you being asked to do a host of truly ridiculous, thankless favours at a moments notice. You will not any form of incentive, there is no such thing as premium pay, staff whose contracts said so were forced to sign an amendment saying they would happily work for basic pay, and those who outright refused to sign it were banned from overtime. And i'm afraid to say that if you think \"well maybe one day I will be chosen to receive a promotion\", then think again. They will go out of their way to ensure they hire someone who is under-qualified and massively under-experienced for the job. What the senior management do not seem to be able to fathom is that betting shops are not supermarkets or coffee shops. They are a place where the criminals and the down and outs go because there is seating and occasionally a working air-conditioning system. Ladbrokes insisted on trying to implement a service plan whereby the staff would become baristas, councillors, American sales people and a betting shop guru for what is essentially minimum wage. Especially for those non city folk. The concept of offering every customer a free refreshment does not attract the wealthy Chinese business man or the drug dealer looking to launder some money. It attracts the sort of chap who spends his day sitting on a park bench drinking a can of super strong cider who occasionally shouts nonsense at passers by. I don't have anything against these sort of people, but they aren't really going to fill the vast hole in the company's balance sheet. Furthermore the concept of a regular customer is something I find really quite troublesome, especially when the company claims to be responsible and ethical. Someone who comes in to a betting shop regularly is either a pensioner, a laundering criminal or someone who has a gambling problem. The organisation of Ladbrokes from top to bottom is perhaps one of the most ridiculous things I have ever come across. As an example I am still waiting for my P45 having left the company a good few weeks ago. It is genuinely possible that HR has my unopened resignation letter on a desk for a coaster. It gets worse however, a few days ago (baring in mind I left the company several weeks ago) I received a letter from Ladbrokes explaining that further to our disucssion on the 1st August they would be transferring me to a different shop. This sort of thing is standard practice for Ladbrokes, however on the 1st of August I was half way across the world on holiday and therefore couldn't possibly have had a discussion about changing shops. Ladbrokes will openly expect you to breach the working time directive when it suits them. And your right to opt-out of Sundays? Forget about it. Ladbrokes claim that without attending a meeting in the other side of London where you will be pressurised and threatened with cut hours that government guidelines and law are simply meaningless. Finally may I add that as a Customer Service Manager you are expected to clean the shop during the day Advice to Management Come on down from them ivory towers of yours, how in god's name did you get up there? Go out and visit some shops. Not the preposterous concept shops in the West End but actual shops. Do it for the purpose of trying to understand how your business actually operates, not examining shelving for dust. Perhaps do a 14 hour shift on a Saturday, and try and gain a grasp of what actually happens in betting shops. Why not ask armed drug dealers to show you some proof of age? You could spend some time offering cups of sickly brown water to the man who has sold everything including his mother to the local Cash Converter in a bid to reclaim the £20,000 he has lost this week to virtual roulette. Try grinning through the abuse and dodging the spit another satisfied customer directs at you. Do all that day in day out and go back to your offices and think about whether an extra zero in the companies profits really matter when the drones that you employ are miserable, empty husks of human beings waiting for the next ridiculous marketing campaign or GREAT OFFER FROM LADBROKES!!", "rating": 1, "pros": "- If you aren't an aggressive jobsworth with the sole intention of being confrontational then you can get to a stage where the regulars aren't looking at you in the same way you would look at a pile of human excrement.", "cons": "A Customer Service Manager at Ladbrokes holds about the same level of authority as the old folks you see writing down number plates of cars who are driving above 10mph down their hideous country lanes. Don't be fooled into thinking your promotion from a cashier means anything at all. Other employers are not in the slightest bit interested, and rightfully so. It is a dead end job which many of the employees, including myself have been tricked in to doing. You are not a manager, you are a glorified cashier who is paid an extra £1 to do the risky stuff and work 14 hour shifts.", "advice": "Come on down from them ivory towers of yours, how in god's name did you get up there? Go out and visit some shops. Not the preposterous concept shops in the West End but actual shops. Do it for the purpose of trying to understand how your business actually operates, not examining shelving for dust. Perhaps do a 14 hour shift on a Saturday, and try and gain a grasp of what actually happens in betting shops. Why not ask armed drug dealers to show you some proof of age? You could spend some time offering cups of sickly brown water to the man who has sold everything including his mother to the local Cash Converter in a bid to reclaim the £20,000 he has lost this week to virtual roulette. Try grinning through the abuse and dodging the spit another satisfied customer directs at you. Do all that day in day out and go back to your offices and think about whether an extra zero in the companies profits really matter when the drones that you employ are miserable, empty husks of human beings waiting for the next ridiculous marketing campaign or GREAT OFFER FROM LADBROKES!!"}, {"title": "OK place to work.", "text": "Pros Good skilled people who got the job done. Fun atmosphere especially around horse festivals i.e. Grand National Good opportunity to move around in jobs if you work hard enough. Cons Paid mulitple contractors really high wages and most of them were useless. Advice to Management Invest in the people that have worked their way up rather then using 'pay limitation' excuses and you will pay new people a much fairer wage.", "rating": 3, "pros": "Good skilled people who got the job done.", "cons": "Paid mulitple contractors really high wages and most of them were useless.", "advice": "Invest in the people that have worked their way up rather then using 'pay limitation' excuses and you will pay new people a much fairer wage."}, {"title": "Expect too much", "text": "Pros Almost certain of being able to have holidays, and most of requested days off, agreed. Receiving sick pay when ill. Cons Different rules for staff in different parts of the country, some not allowed overtime, some being begged to do 50-60 hours Advice to Management Listen to your employees instead of ignoring then losing them. That way you may have the numbers to actually staff the shops...", "rating": 3, "pros": "Almost certain of being able to have holidays, and most of requested days off, agreed.", "cons": "Different rules for staff in different parts of the country, some not allowed overtime, some being begged to do 50-60 hours", "advice": "Listen to your employees instead of ignoring then losing them. That way you may have the numbers to actually staff the shops..."}, {"title": "Work", "text": "Pros flexibility in the role and training Cons Hours and their senior management capability", "rating": 3, "pros": "flexibility in the role and training", "cons": "Hours and their senior management capability", "advice": null}, {"title": "Overall Ladbrokes a good company to work for.", "text": "Pros Pay and benefits good Most staff and managers very good Cons Hours can be long Staff not always listened to Advice to Management Some managers at head office treat staff badly Staff demotivated", "rating": 5, "pros": "Pay and benefits good", "cons": "Hours can be long", "advice": "Some managers at head office treat staff badly"}, {"title": "Customer service Manager", "text": "Pros the company has good Flexibility Overtime is available Cons No support from above senior staff do not know what their doing difficult to progress staff are not trained correctly Advice to Management train staff properly", "rating": 3, "pros": "the company has good Flexibility", "cons": "No support from above", "advice": "train staff properly"}, {"title": "Fun Place To Work", "text": "Pros Everyone who works there are fun to work with Most of the work mates get on Great pay for under 18's (especially if this was your first job) Bosses actually banter with you! Cons The shift can seem to drag and never end, but everyone feels the same... No breaks once the shift has started", "rating": 5, "pros": "Everyone who works there are fun to work with", "cons": "The shift can seem to drag and never end, but everyone feels the same...", "advice": null}, {"title": "need to listen to employees", "text": "Pros Travel card, good and friendly colleagues Cons bad management, no fixed strategy Advice to Management need to listen to people that work for the company", "rating": 3, "pros": "Travel card, good and friendly colleagues", "cons": "bad management, no fixed strategy", "advice": "need to listen to people that work for the company"}, {"title": "A mess of a company when working at the bottom", "text": "Pros SOME staff are nice...........always overtime! Cons everything, the people the customers, the hours! the job is easy and theres alway overtime. only pros! Advice to Management csm act like shreholders and mpm and area managers are nowhere to be seen", "rating": 1, "pros": "SOME staff are nice...........always overtime!", "cons": "everything, the people the customers, the hours! the job is easy and theres alway overtime. only pros!", "advice": "csm act like shreholders and mpm and area managers are nowhere to be seen"}, {"title": "Marketplace Manager", "text": "Pros Fast paced. Always something new. Cons Anti social hours. Zero time off at Christmas.", "rating": 1, "pros": "Fast paced. Always something new.", "cons": "Anti social hours. Zero time off at Christmas.", "advice": null}, {"title": "Treat staff as disposable", "text": "Pros Flexible(ish) hours Staff in shops generally friendly Cons Single-manning - entirely dangerous Constantly badger staff to cover shifts even if they can't Bonus 'program' is atrocious now No over-time rate for anything. Advice to Management Clue up and stop running the company like shareholders are everything, stop screwing staff over.", "rating": 3, "pros": "Flexible(ish) hours", "cons": "Single-manning - entirely dangerous", "advice": "Clue up and stop running the company like shareholders are everything, stop screwing staff over."}, {"title": "Customer service", "text": "Pros Good co-workers nice uniforms to wear Cons managers didnt take care of employees Advice to Management Listen to employees more", "rating": 3, "pros": "Good co-workers nice uniforms to wear", "cons": "managers didnt take care of employees", "advice": "Listen to employees more"}, {"title": "Horrendous - No similarity to the job description.", "text": "Pros A 35 hour week which actually was 35 hours. I was paired with a great partner to show me the ropes. Cons The role was purely a mechanism in delegation. There is absolutely no strategy. Tasks involved a high volume of shop visits and completing an associated report, checking over scheduling (for 200 employees) as the responsible people were inept and taking sick calls. These are not tasks one would usually expect to find an Area Manager completing. Additionally, the direct reports had no authority and hence all formal meetings were completed by Area Managers - and there were a lot. Ladbrokes dismiss an awful lot of their staff and Area Managers are at the forefront of this activity which is wildly unpleasant. Area Managers receive no London Allowance although all junior grades do. As such, Area Managers outside London were de facto paid more. Assigned tasks made it impossible to reach probation dependent objectives. Direct reports were given unrealistic objectives and Area Managers were made to enforce them. Lone working is dangerous. Advice to Management Common responses such as \"That's the way we do things\" or \"You should see what other bookmakers do\" lead me to believe you would pay no attention to this anyway.", "rating": 1, "pros": "A 35 hour week which actually was 35 hours. I was paired with a great partner to show me the ropes.", "cons": "The role was purely a mechanism in delegation. There is absolutely no strategy. Tasks involved a high volume of shop visits and completing an associated report, checking over scheduling (for 200 employees) as the responsible people were inept and taking sick calls. These are not tasks one would usually expect to find an Area Manager completing. Additionally, the direct reports had no authority and hence all formal meetings were completed by Area Managers - and there were a lot. Ladbrokes dismiss an awful lot of their staff and Area Managers are at the forefront of this activity which is wildly unpleasant. Area Managers receive no London Allowance although all junior grades do. As such, Area Managers outside London were de facto paid more. Assigned tasks made it impossible to reach probation dependent objectives. Direct reports were given unrealistic objectives and Area Managers were made to enforce them. Lone working is dangerous.", "advice": "Common responses such as \"That's the way we do things\" or \"You should see what other bookmakers do\" lead me to believe you would pay no attention to this anyway."}, {"title": "Horrendous - No similarity to the job description.", "text": "Pros A 35 hour week which actually was 35 hours. I was paired with a great partner to show me the ropes. Cons The role was purely a mechanism in delegation. There is absolutely no strategy. Tasks involved a high volume of shop visits and completing an associated report, checking over scheduling (for 200 employees) as the responsible people were inept and taking sick calls. These are not tasks one would usually expect to find an Area Manager completing. Additionally, the direct reports had no authority and hence all formal meetings were completed by Area Managers - and there were a lot. Ladbrokes dismiss an awful lot of their staff and Area Managers are at the forefront of this activity which is wildly unpleasant. Area Managers receive no London Allowance although all junior grades do. As such, Area Managers outside London were de facto paid more. Assigned tasks made it impossible to reach probation dependent objectives. Direct reports were given unrealistic objectives and Area Managers were made to enforce them. Lone working is dangerous. Advice to Management Common responses such as \"That's the way we do things\" or \"You should see what other bookmakers do\" lead me to believe you would pay no attention to this anyway.", "rating": 1, "pros": "A 35 hour week which actually was 35 hours. I was paired with a great partner to show me the ropes.", "cons": "The role was purely a mechanism in delegation. There is absolutely no strategy. Tasks involved a high volume of shop visits and completing an associated report, checking over scheduling (for 200 employees) as the responsible people were inept and taking sick calls. These are not tasks one would usually expect to find an Area Manager completing. Additionally, the direct reports had no authority and hence all formal meetings were completed by Area Managers - and there were a lot. Ladbrokes dismiss an awful lot of their staff and Area Managers are at the forefront of this activity which is wildly unpleasant. Area Managers receive no London Allowance although all junior grades do. As such, Area Managers outside London were de facto paid more. Assigned tasks made it impossible to reach probation dependent objectives. Direct reports were given unrealistic objectives and Area Managers were made to enforce them. Lone working is dangerous.", "advice": "Common responses such as \"That's the way we do things\" or \"You should see what other bookmakers do\" lead me to believe you would pay no attention to this anyway."}, {"title": "Marketplace Manager", "text": "Pros 6 weeks holiday, fantastic colleagues Cons Your on your own a lot of the time, objectives and KPIS aren't always \"Smart\". Advice to Management Go back to basics and make objectives and tasks realistic.", "rating": 5, "pros": "6 weeks holiday, fantastic colleagues", "cons": "Your on your own a lot of the time, objectives and KPIS aren't always \"Smart\".", "advice": "Go back to basics and make objectives and tasks realistic."}, {"title": "Great lower-level staff, disconnected senior management", "text": "Pros Staff on the shop floor are great Cons Very little consultation with staff over major changes Lone working leaves staff vulnerable Company puts profits before staff morale Advice to Management Consult those on the shop floors over changes Focus on keeping the workforce happy will ensure long term results and low staff turnover Value experience", "rating": 1, "pros": "Staff on the shop floor are great", "cons": "Very little consultation with staff over major changes", "advice": "Consult those on the shop floors over changes"}, {"title": "Customer Service Assistant", "text": "Pros Work with a good team of colleagues Cons if you just want a job to get paid and seek nothing else in life, then Ladbrokes is the place to work. Advice to Management Focus on employee incentives and not so much on customers in an environment that pretty much stays the same regardless of change.", "rating": 3, "pros": "Work with a good team of colleagues", "cons": "if you just want a job to get paid and seek nothing else in life, then Ladbrokes is the place to work.", "advice": "Focus on employee incentives and not so much on customers in an environment that pretty much stays the same regardless of change."}, {"title": "Where hope goes to die!!!", "text": "Pros Not many, if your lucky you might meet some decent people the job itself sucks!!! Cons watching people destroy themselves everyday is soul destroying Advice to Management have some decency and quit, management generally have a slave owner mentality", "rating": 1, "pros": "Not many, if your lucky you might meet some decent people the job itself sucks!!!", "cons": "watching people destroy themselves everyday is soul destroying", "advice": "have some decency and quit, management generally have a slave owner mentality"}, {"title": "VIP Executive", "text": "Pros Interesting place to work for at the beginning of your career. Cons Very set up in the old ways. Slow to accept new ideas and move forward quickly. Big hierarchy with senior management, always never will see them in difference with other companies. Favorism Advice to Management Be closer to your employers and hear their ideas.", "rating": 3, "pros": "Interesting place to work for at the beginning of your career.", "cons": "Very set up in the old ways. Slow to accept new ideas and move forward quickly. Big hierarchy with senior management, always never will see them in difference with other companies. Favorism", "advice": "Be closer to your employers and hear their ideas."}, {"title": "just dont", "text": "Pros two days off a week Cons everything else is so so terrible Advice to Management listen to staff and customers", "rating": 1, "pros": "two days off a week", "cons": "everything else is so so terrible", "advice": "listen to staff and customers"}, {"title": "HR", "text": "Pros The betting industry Tv on with 24H sports at every working stations Every business events is about sports Career opportunities Cons Location Management is very conservative Learning by trying is not an option (low uncertainty risk tollerance)", "rating": 3, "pros": "The betting industry", "cons": "Location", "advice": null}, {"title": "Good", "text": "Pros Good overall working environment Opportunity to progress to CSM Cons Get to deal with abusive customers, company is not doing enough to prevent this", "rating": 5, "pros": "Good overall working environment", "cons": "Get to deal with abusive customers, company is not doing enough to prevent this", "advice": null}, {"title": "Cuts cuts and more cuts.", "text": "Pros Once you have control of a shop rota you can be selfish. That's about it, because the rest is poor and will stay that way. Cons You will work alone more than you work with anyone else. Security is poor across the board. You will have to work unpaid after specific times. If you try and do your work before that time you'll be \"compromising security\" and be hauled in on disciplinary. Advice to Management Sell off the high street and focus online, when the oldies die off you (and your dwindling profit margin) is in trouble.", "rating": 1, "pros": "Once you have control of a shop rota you can be selfish. That's about it, because the rest is poor and will stay that way.", "cons": "You will work alone more than you work with anyone else. Security is poor across the board. You will have to work unpaid after specific times. If you try and do your work before that time you'll be \"compromising security\" and be hauled in on disciplinary.", "advice": "Sell off the high street and focus online, when the oldies die off you (and your dwindling profit margin) is in trouble."}, {"title": "Ladbrokes", "text": "Pros Good banter, great if you love sport or horse racing Cons awful hours, bad shifts, little/no management", "rating": 3, "pros": "Good banter, great if you love sport or horse racing", "cons": "awful hours, bad shifts, little/no management", "advice": null}, {"title": "Ladbrokes", "text": "Pros Good pay, good team with a relaxed atmosphere Cons Weekend working and some long hours", "rating": 5, "pros": "Good pay, good team with a relaxed atmosphere", "cons": "Weekend working and some long hours", "advice": null}, {"title": "it is ok", "text": "Pros lots of overtime available there Cons really boring and had to stay after my working hours without being paid", "rating": 3, "pros": "lots of overtime available there", "cons": "really boring and had to stay after my working hours without being paid", "advice": null}, {"title": "Business Revenue Analyst", "text": "Pros Great people and atmosphere. Prefect place to work if you are into sport. Easy to learn off others and get involved with other teams Cons Too much read tape everywhere, hard to progress. Too much dillydallying from higher management, rather than focusing on main issues and utilising peoples skills.", "rating": 5, "pros": "Great people and atmosphere. Prefect place to work if you are into sport. Easy to learn off others and get involved with other teams", "cons": "Too much read tape everywhere, hard to progress. Too much dillydallying from higher management, rather than focusing on main issues and utilising peoples skills.", "advice": null}, {"title": "Internet Operator", "text": "Pros Worked in the head office, exciting and fast paced atmosphere. Annual bonus and summer party for the whole head office, benefits such as an subsidised oyster card loan Cons My role involved unsociable hours, like weekends and evenings until 9pm. My perception of the environment was that it was very hierarchical.", "rating": 5, "pros": "Worked in the head office, exciting and fast paced atmosphere. Annual bonus and summer party for the whole head office, benefits such as an subsidised oyster card loan", "cons": "My role involved unsociable hours, like weekends and evenings until 9pm. My perception of the environment was that it was very hierarchical.", "advice": null}, {"title": "Marketing Manager", "text": "Pros Fast career opportunities, great compensation. Cons Very short term focus. Not clear strategy and vision, impacting negatively on the departments structure.", "rating": 3, "pros": "Fast career opportunities, great compensation.", "cons": "Very short term focus. Not clear strategy and vision, impacting negatively on the departments structure.", "advice": null}, {"title": "Clueless", "text": "Pros Free partial uniform . No premuim pay rates for Sundays and bank holidays...a cheap shyster operation Cons Lots,unsocial hours ,inept middle management, no stability,petty minded staff. Advice to Management Resign....could not organise the proverbial brewery trip!!!!!Ever since Mullen has been appointed the company has gone from bad to worse...totally clueless and lacking in any kind of professenialism. Cann see this name being on the high st much longer.", "rating": 1, "pros": "Free partial uniform . No premuim pay rates for Sundays and bank holidays...a cheap shyster operation", "cons": "Lots,unsocial hours ,inept middle management, no stability,petty minded staff.", "advice": "Resign....could not organise the proverbial brewery trip!!!!!Ever since Mullen has been appointed the company has gone from bad to worse...totally clueless and lacking in any kind of professenialism. Cann see this name being on the high st much longer."}, {"title": "Work work work work work", "text": "Pros The customers are a laugh and more often than not you get to work with some lovely people. Pay isn't terrible for retail. Cons Too many abusive customers, lone working isn't safe, often left to work 11.5 hour days all on your own with only an hours cover for lunch break due to poor management. Advice to Management Stop making managers work 7 hours + in a row alone!", "rating": 3, "pros": "The customers are a laugh and more often than not you get to work with some lovely people. Pay isn't terrible for retail.", "cons": "Too many abusive customers, lone working isn't safe, often left to work 11.5 hour days all on your own with only an hours cover for lunch break due to poor management.", "advice": "Stop making managers work 7 hours + in a row alone!"}, {"title": "Customer Service Manager", "text": "Pros Great opportunities for advancement and promotion. Competitive wage. Generally friendly staff. Can be an exciting working environment during major sporting events. Value high standards of customer service. Great job for people interested in sports, especially horse-racing. Cons Security- Retail staff are left working alone (single-manning) a lot. This is not conducive to a betting office environment. There is a tendency to feel very unsafe at work which is unreasonable. In addition, despite not being paid for your lunch hour, it is very difficult to actually get one when you are working alone. You, yourself, have to organise to have someone come from another branch to cover you while you take break. This can be impossible at times and disruptive to other shops. Management- Some members of senior management (not all) do not possess the interpersonal and leadership skills required to lead teams. Some can have an unacceptable lack of respect for front line retail staff. This negatively impacts the productivity in retail shops by draining the motivation and commitment of good staff to the job. Work/life balance- The hours can be very unsociable; including 12 hour shifts, weekends, bank holidays, etc. The days you work are never consistent, they usually change every week. Some people like this but it makes it impossible to make plans. Advice to Management Abolish lengthy consecutive hours of single-manning. It is very dangerous and disruptive. Additionally, customers always complain about not being served quickly enough as they are missing out on bets because there is only one staff member on, even at peak business hours. More specifically, we lost many key profitable customers who enjoy the virtual betting products. I find single-manning counter intuitive to improving turnover and services in shops. Show respect and encouragement to retail staff. They are the bloodline of the company and are the only people who can really improve the profitability of retail shops. Training for some senior managers may be required to improve their leadership and interpersonal skills. If no improvement is made, I would advise a change in management. True leaders that encourage, motivate and lead by example are needed. Demoralizing staff will not get results.", "rating": 3, "pros": "Great opportunities for advancement and promotion.", "cons": "Security- Retail staff are left working alone (single-manning) a lot. This is not conducive to a betting office environment. There is a tendency to feel very unsafe at work which is unreasonable. In addition, despite not being paid for your lunch hour, it is very difficult to actually get one when you are working alone. You, yourself, have to organise to have someone come from another branch to cover you while you take break. This can be impossible at times and disruptive to other shops.", "advice": "Abolish lengthy consecutive hours of single-manning. It is very dangerous and disruptive. Additionally, customers always complain about not being served quickly enough as they are missing out on bets because there is only one staff member on, even at peak business hours. More specifically, we lost many key profitable customers who enjoy the virtual betting products. I find single-manning counter intuitive to improving turnover and services in shops."}, {"title": "Worst Management planning ever !!", "text": "Pros Loved working in a medium busy shop in Essex - great fun customers and shop staff. Cons Long hours on your own - limited support and understanding when you have a problem. Plenty of promises of improvements but never happens. Advice to Management Get out to the shop floor and work in a busy shop for at least a week .Try to Single man for 6 hours, then think about the impact of some of your demands.Talk to staff personally not just by focus groups. Remember your staff are your life blood and have families, and are not just numbers. Action your promises. Remind Area Managers we are people not just a way to get their personal targets.", "rating": 1, "pros": "Loved working in a medium busy shop in Essex - great fun customers and shop staff.", "cons": "Long hours on your own - limited support and understanding when you have a problem. Plenty of promises of improvements but never happens.", "advice": "Get out to the shop floor and work in a busy shop for at least a week .Try to Single man for 6 hours, then think about the impact of some of your demands.Talk to staff personally not just by focus groups. Remember your staff are your life blood and have families, and are not just numbers. Action your promises. Remind Area Managers we are people not just a way to get their personal targets."}, {"title": "Worst Management planning ever !!", "text": "Pros Loved working in a medium busy shop in Essex - great fun customers and shop staff. Cons Long hours on your own - limited support and understanding when you have a problem. Plenty of promises of improvements but never happens. Advice to Management Get out to the shop floor and work in a busy shop for at least a week .Try to Single man for 6 hours, then think about the impact of some of your demands.Talk to staff personally not just by focus groups. Remember your staff are your life blood and have families, and are not just numbers. Action your promises. Remind Area Managers we are people not just a way to get their personal targets.", "rating": 1, "pros": "Loved working in a medium busy shop in Essex - great fun customers and shop staff.", "cons": "Long hours on your own - limited support and understanding when you have a problem. Plenty of promises of improvements but never happens.", "advice": "Get out to the shop floor and work in a busy shop for at least a week .Try to Single man for 6 hours, then think about the impact of some of your demands.Talk to staff personally not just by focus groups. Remember your staff are your life blood and have families, and are not just numbers. Action your promises. Remind Area Managers we are people not just a way to get their personal targets."}, {"title": "worst place to work", "text": "Pros you get paid, you get tips, you meet interesting people, lovely customers, you get to watch football matches and other sports Cons You work on your own very regularly, poor training, minimal support from management, you have to deal with drunk,violent and abusive customers", "rating": 3, "pros": "you get paid, you get tips, you meet interesting people, lovely customers, you get to watch football matches and other sports", "cons": "You work on your own very regularly, poor training, minimal support from management, you have to deal with drunk,violent and abusive customers", "advice": null}, {"title": "Receptionist/ Admin", "text": "Pros Down to earth management structure Cons mis communication due multi level managment Advice to Management more structure needed", "rating": 5, "pros": "Down to earth management structure", "cons": "mis communication due multi level managment", "advice": "more structure needed"}, {"title": "Customer Service Adviosr", "text": "Pros Great staff working there. Everyone is on the same page and can be an exciting work environment. Cons The management level have no real understanding of day to day difficulty of job. Nepotism is evident throughout management structure with no room to move the career ladder unless your a favourite. The overall company do not value workforce Advice to Management Provide better advancement for career and appreciate your employees", "rating": 1, "pros": "Great staff working there. Everyone is on the same page and can be an exciting work environment.", "cons": "The management level have no real understanding of day to day difficulty of job. Nepotism is evident throughout management structure with no room to move the career ladder unless your a favourite. The overall company do not value workforce", "advice": "Provide better advancement for career and appreciate your employees"}, {"title": "Where did a good job go.", "text": "Pros Work for them for 28 years most of it was when it was a good company to work for.Same day off every week for 20 years.Started as a full time cashier and went on to become a manager dropped down to a DM when I changed areas in the last year that I worked lost a lot of time due to ill health the company was helpful. Cons Long hours for some single manning for some but not me working on good Friday not for me very unsocial not family friendly now very bad payed and treated like fools. Advice to Management Keep up to date with technology but remember it the shop front that counts Ladbrokes staff was always wanted and we were the best trained staff. Go back to the right way of training.", "rating": 3, "pros": "Work for them for 28 years most of it was when it was a good company to work for.Same day off every week for 20 years.Started as a full time cashier and went on to become a manager dropped down to a DM when I changed areas in the last year that I worked lost a lot of time due to ill health the company was helpful.", "cons": "Long hours for some single manning for some but not me working on good Friday not for me very unsocial not family friendly now very bad payed and treated like fools.", "advice": "Keep up to date with technology but remember it the shop front that counts Ladbrokes staff was always wanted and we were the best trained staff. Go back to the right way of training."}, {"title": "Store manager", "text": "Pros Loads of hours as a store manager. Cons Single manning a shop for the majority of the day as have a cashier for only 5 hours a day.", "rating": 3, "pros": "Loads of hours as a store manager.", "cons": "Single manning a shop for the majority of the day as have a cashier for only 5 hours a day.", "advice": null}, {"title": "Job is great. Management sucks.", "text": "Pros Really good community. Friendly enjoyable job to have. You are well treated by customers and colleagues. Access to watch any sport. Relaxed environment for you and customers. Almost like a babysitting job Cons From area managers upwards the company fails. Staff are treated like criminals, customers treated like scum. Rules continue to be enforced which reduce the friendly atmosphere to a robotic one More interested in targets than service. Don't realise that targets are reached by GOOD SERVICE Advice to Management Stop changing rules and being so strict. It's you that chases the customers away. Your staff are competent and know what your customers want. Limiting their free tea and hounding them when they walk in the shop is not how customers want to be treated.", "rating": 3, "pros": "Really good community.", "cons": "From area managers upwards the company fails.", "advice": "Stop changing rules and being so strict. It's you that chases the customers away. Your staff are competent and know what your customers want. Limiting their free tea and hounding them when they walk in the shop is not how customers want to be treated."}, {"title": "Poor management", "text": "Pros Supply of uniform I guess. Also having a say on when you can work your hours. Not many pros of working here. Cons Poor management, having to deal with managers problems when only paid as an apprenticeship, unsafe environment to work and very poor organisation. Advice to Management Sort the safety of shops out and get better management who can be bothered to do at least one shift a week.", "rating": 1, "pros": "Supply of uniform I guess. Also having a say on when you can work your hours. Not many pros of working here.", "cons": "Poor management, having to deal with managers problems when only paid as an apprenticeship, unsafe environment to work and very poor organisation.", "advice": "Sort the safety of shops out and get better management who can be bothered to do at least one shift a week."}, {"title": "CSM", "text": "Pros Flexible working hours, rotas are usually done in advance and you can request certain days off or shifts, these can usually be accommodated but you will need to work evenings and weekends. Cons working on your own a lot, as a csm you are expected to open and close the shop on your own, this can be as early as 7.30am to as late as 10pm Advice to Management get rid of single manning, the biggest reason people leave is because they feel the company cares about profit more than the safety of staff!", "rating": 3, "pros": "Flexible working hours, rotas are usually done in advance and you can request certain days off or shifts, these can usually be accommodated but you will need to work evenings and weekends.", "cons": "working on your own a lot, as a csm you are expected to open and close the shop on your own, this can be as early as 7.30am to as late as 10pm", "advice": "get rid of single manning, the biggest reason people leave is because they feel the company cares about profit more than the safety of staff!"}, {"title": "A managerial mess", "text": "Pros Customers are hilarious and keep you on your feet Cons Some of the worst management i have ever come across Advice to Management none", "rating": 3, "pros": "Customers are hilarious and keep you on your feet", "cons": "Some of the worst management i have ever come across", "advice": "none"}, {"title": "Ok if you like being treated like dirt", "text": "Pros Absolutey terrible job, management are full of lies and false promises! 15 hour days, no breaks, stinky customers who would sell their granny for a £10 note!! 2 faced back stabbing staff. The risk of robbery is very real and people are left for 5 hours at night to cash up alone.. You WILL work for at least 9 hours alone every single day! If you need the loo then it's a quick dash in between races as you might miss a customers bet then God help you!! Cons Everything!! You are nothing to this joke company.. As long as there is a butt on a seat to take the cash then they are happy. To be honest if they could train chimps to take the bets then they would! They do not care about taking cash from disabled or mentally challenged people.. I have witnessed this 1st hand! Staff are nothing and upper management even ask staff not to ring police when there is an issue as they don't care about their safety! Advice to Management Grow a conscience and realise the damage you cause to people's lives with your lies!! Some people have no choice but to work for Ladbrokes as they need to feed their children and you use that to the fullest of your own advantage!! You manipulate, lie and exploit vulnerable people!", "rating": 1, "pros": "Absolutey terrible job, management are full of lies and false promises! 15 hour days, no breaks, stinky customers who would sell their granny for a £10 note!! 2 faced back stabbing staff. The risk of robbery is very real and people are left for 5 hours at night to cash up alone.. You WILL work for at least 9 hours alone every single day! If you need the loo then it's a quick dash in between races as you might miss a customers bet then God help you!!", "cons": "Everything!! You are nothing to this joke company.. As long as there is a butt on a seat to take the cash then they are happy. To be honest if they could train chimps to take the bets then they would! They do not care about taking cash from disabled or mentally challenged people.. I have witnessed this 1st hand! Staff are nothing and upper management even ask staff not to ring police when there is an issue as they don't care about their safety!", "advice": "Grow a conscience and realise the damage you cause to people's lives with your lies!! Some people have no choice but to work for Ladbrokes as they need to feed their children and you use that to the fullest of your own advantage!! You manipulate, lie and exploit vulnerable people!"}, {"title": "rubbish company to work for", "text": "Pros lovely staff members sometimes uniform is paid for Cons verbal and physical abuse from customers forced to be on shop floor when sometimes you don't feel very comfortable because of the abuse you get from customers not allowed to wear jumpers in summer like that makes a difference to how much money they bring it, no work moral, people are unhappy and ladbrokes don;t care get stage 2s for silly petty reasons forced to work alone from 9am - 1pm which is ridiculous because from 10-12 we have best odds ans its such a busy period always get peoples pays wrong no reward for hard work worst job i have ever had", "rating": 1, "pros": "lovely staff members sometimes", "cons": "verbal and physical abuse from customers", "advice": null}, {"title": "Dangerous disinterest in staff welfare", "text": "Pros Fairly flexible. Can do a lot of hours in a few days. The people you work with are usually very nice - the best part of the job. Cons At least eight hours alone every day at manager level, most of those at night. No chance to go to the toilet. Daily constant abuse from drug addicts and gambling addicts. Company have no concern for staff safety. Sometimes thirteen hour days completely alone. Forced to plug offers that often have catches about which staff are not told but are expected to deal with when the proverbial hits the fan. Advice to Management Think about the lives, safety and mental health of your staff and stop single manning. It is simply unconscionable greed.", "rating": 3, "pros": "Fairly flexible. Can do a lot of hours in a few days. The people you work with are usually very nice - the best part of the job.", "cons": "At least eight hours alone every day at manager level, most of those at night. No chance to go to the toilet. Daily constant abuse from drug addicts and gambling addicts. Company have no concern for staff safety. Sometimes thirteen hour days completely alone. Forced to plug offers that often have catches about which staff are not told but are expected to deal with when the proverbial hits the fan.", "advice": "Think about the lives, safety and mental health of your staff and stop single manning. It is simply unconscionable greed."}, {"title": "Easy job made difficult", "text": "Pros Midweek days off to organise daily life like paying bills, dr appointments and the such. The shop based staff for the most part are some of the most selfless individuals one could meet if you need assistance in personal matters. Upper & lower management excepting and understanding of some mental illness such as depression & anxiety disorders. Will offer assistance and support both on a personal level and return to work if time off is required. Works best if open and honest about such things. There is also a free to access support system in place called life works which offers help and support in a wide range of issues. Very good training for new starters, plenty of in shop & off site support. Perfect for students or people perhaps not in long term relationships and/or with out young children. Difficult for 'family' life. Cons Long and unsociable hours. In the form of 14hr days, evenings & most weekends. Time off not due to depression and/or anxiety frowned upon. Single scheduled hours morning & night. Which is a security risk both business wise and personal safety. Although I believe this is in the process of being phased out. Although wages not necessarily as competitive to the level of responsibility they are the highest in the betting industry. Poor chance of career progression after CSM level. There are schemes in place, however the chance of getting position after in house training poor. Bonus scheme in place however is poor Not always representing level of effort or work actually done. Days off at CSM level spent chasing keys to different premises or being hassled into coming in to cover illness or holidays. Customers for the most part are rude and abusive. Not like any other industry, no respect to staff. There are a few good ones, but they're few and far between. Advice to Management Better bonus scheme that's not necessarily 'level' specific. A lot of your CSA's are doing the jobs of your CSM's and far more CSM's doing the jobs of your MPM's. Not in all cases but a lot more than realised. End single scheduled hours full stop. Bring back a shop manager level, often the above is caused by to many chief's not enough Indians (no better way of putting it) All staff to have set hours, the difference week to week in shifts is what creates a lot of the confusion and 'illness'. Individual shops to have more control over 'offers' what works in one shop won't work in another due to the mix in clientele from area to area. The targets for offers are not always appreciate shop to shop.", "rating": 1, "pros": "Midweek days off to organise daily life like paying bills, dr appointments and the such.", "cons": "Long and unsociable hours. In the form of 14hr days, evenings & most weekends.", "advice": "Better bonus scheme that's not necessarily 'level' specific. A lot of your CSA's are doing the jobs of your CSM's and far more CSM's doing the jobs of your MPM's. Not in all cases but a lot more than realised."}, {"title": "say no to Ladbrokes", "text": "Pros The team I was working with. Benefits, but only if you're on a certain grade, bus to harrow every Friday. Challenging environment. Get to watch sports as you work. Cons Where do I start....by far the worst company I've ever worked for. Poor infrastructure. Amateur outfit. Would give it 0.5 stars if I could. Lets just say there's a reason why Ladbrokes are pretty much on their knees and going into a nonsensical merger with another retail heavy competitor who carry heavy levels of debt. Considering they fell asleep during the digital betting growth, you'd think they'd merge with a competitor whose digital arm is lucrative. Shops have a limited shelf life. Dermot Desmond was right, it’s a one way merger. What else? Senior management: - are morally bankrupt, inconsiderate, rude, ungrateful, lack basic manners and are self-serving. The word \"thank you\" simply does not exist in their vocabulary. They play favourites and discriminate against other members of staff who they dislike - Lack any respect for their colleagues - Although it's a challenge, you'll get no appreciation for your work. I've never come across anything like it. Zero gratitude. Makes you have no motivation. - To call the communication levels as abysmal would be a gross understatement. Senior management will alter your work, not tell you, resulting in you passing off old versions around the business. Worst of all, when confronted, not even seem apologetic. Simply displaying an arrogant attitude of \"I did it, don't question me, go away\". - No concept of \"we're all one team\". - Mentality of senior management definitely suffers from local culture. - Professional standards of some the senior management levels leave a lot to be desired. The professional qualifications count for nothing. It's a case of \"do it the Ladbrokes way\". Pay - pay scale is so skewed it's unreal. Some are paid way below market rate; others are paid so far above market rate you're left wondering who sets the boundaries and the justification for these salaries. Do these people not have any moral compass??? Stationary - This I found hilarious, on my first day, the stationary cupboard was bare. Got hand me down pads and pens. These are the basics... Systems - uh oh, could be here a while... - This is a FTSE250 company. After day 1, you'll be wondering how they've got that far. The controls are poor! I have no idea how they pass their internal audits. I've seen start ups with better controls and systems. - The lack of investment in the systems has resulted in a situation where you're having to spend hours doing work that a system should have already done for you. - The systems themselves are painfully slow. There's a high staff turnover, but HR don't seem to want to investigate why. Not a meritocratic or rewarding environment. In summary, this is an appalling company to work for. Senior management look out for themselves and do not care about their employees. Do not be attracted to the fact it's a big company. It's like Liverpool FC, a dormant giant who will never make it back to the top and living on past glories. Years of neglect have forced it into the doldrums. Pay is poor, redundancies are coming, and future is not bright. At this point current/ex employees have got a neckache from constantly nodding in agreement whilst reading this Advice to Management Encourage 360 degrees feedback so that employees can tell senior management that they're incompetent at certain aspects of their job. An element of their salary is to MANAGE individuals and the team. Stop lying to your employees. Redundancies are coming, it's insulting that you completely lie to them suggesting it'll only be a small amount. Considering the point of a merger is for synergies and staff costs represent a significant proportion of operating costs.", "rating": 1, "pros": "The team I was working with. Benefits, but only if you're on a certain grade, bus to harrow every Friday. Challenging environment. Get to watch sports as you work.", "cons": "Where do I start....by far the worst company I've ever worked for. Poor infrastructure. Amateur outfit. Would give it 0.5 stars if I could.", "advice": "Encourage 360 degrees feedback so that employees can tell senior management that they're incompetent at certain aspects of their job. An element of their salary is to MANAGE individuals and the team."}, {"title": "poor experience", "text": "Pros no pros sadly its hard job with no reward. wish could say something positive about company but hard to be able do Cons left along at busy times. no clear management or training. customer service managers are worked long hours Advice to Management bring back proper managers for stores and work staff less. everyone is nice but over worked", "rating": 1, "pros": "no pros sadly its hard job with no reward. wish could say something positive about company but hard to be able do", "cons": "left along at busy times. no clear management or training. customer service managers are worked long hours", "advice": "bring back proper managers for stores and work staff less. everyone is nice but over worked"}, {"title": "Ladbrokes", "text": "Pros Good progression, good working environment, friendly Cons Bad management, horrid pay, working hours bad", "rating": 5, "pros": "Good progression, good working environment, friendly", "cons": "Bad management, horrid pay, working hours bad", "advice": null}, {"title": "Easy comfy job if you just want a job pays not brill but it pays bills", "text": "Pros It's easy can move up ladder if want .it's not hard to do . Half a uni form provide jacket and shirts Cons It's slightly flexible to work certain days. sick pay after you've work a year holidays 5 weeks when you've served 5 years you get extra 5 days Advice to Management Remember it staff that make a shop good and nobody like shopping in a shop when there hardly any staff they think your struggling business and you won't payout if they win !", "rating": 3, "pros": "It's easy can move up ladder if want .it's not hard to do . Half a uni form provide jacket and shirts", "cons": "It's slightly flexible to work certain days. sick pay after you've work a year holidays 5 weeks when you've served 5 years you get extra 5 days", "advice": "Remember it staff that make a shop good and nobody like shopping in a shop when there hardly any staff they think your struggling business and you won't payout if they win !"}, {"title": "Avoid unless absolutely necessary.", "text": "Pros Very easy to get employed as the staff turnover is very high. The members of staff/store level management are usually really down to earth and easy going people. Payroll/HR departments are fairly reliable. Cons Where to start? If you go for a shop level position then they will most likely offer you 15 or so hours a week as a cashier with the \"possibility\" of more, the level of pay is every so slightly above minimum wage so your monthly income will be pittance. As a Cashier you'll mercifully get mainly daytime shifts, however you will have to work most Saturdays as well. Training is mainly on the job and the quality of this is completely down to the manager, you will also have to complete a tedious training book. Once you start the job you'll find out that it is mostly boredom with brief busy moments of activity. During the day you will mainly get a mix of old boys putting on dozens of tiny bets and roulette machine regulars/addicts. Some of these customers are absolutely fine, however there is a significant percentage who will be rude and/or aggressive; get used to people staring at you suspiciously behind the counter (they think you have a little button that makes them lose). Every once in a while one of these will stand up and punch the machine screen in, then they'll either walk out or decide your face is the next target for a punching. If you stay in the job for more than a week, the chances are they will want you to become a Customer Service Manager for a tiny pay rise, which basically translates to Cashier with shop keys. This is where the fun really starts! You will then be asked to work evenings (until 9:30 -10pm) managing the shop, and this will probably be on your own. You will have to deal with an eclectic mix of drunks and problem gamblers, many of whom will decide you are personally responsible for their losses. You will also be responsible for the £1000s on the premises which is an incredibly tempting target for any armed robbers in the area. Some shops have had 3 or 4 armed robberies (although their health and safety reports still read like Disneyland's) and I don't know many people who have been in the industry for more than a couple of years who have not been robbed at gunpoint or knifepoint. The biggest problem is that you are just a very expendable asset to the company, and so they treat you as such. The gambling industry also loves to downplay the negative things that happen on its premises, there is a VERY strong culture of non-reporting of incidents as the companies don't want their premises linked with crime. I have seen staff members physically threatened by customers and it not even be reported to the company let alone Police. This all makes betting shops magnets for crime and criminals, in the last few years there has been one staff member murdered and one raped in Ladbrokes premises, the latter receiving basically no media coverage. However, each shop is different and everyone's experience is different, for example, I know people that love the job, make up your own mind! Advice to Management Treat staff with dignity and respect. They should be viewed as a commodity not an expense. Be proactive in making positive changes to your shops for both staff and customers instead of just staying in line with the latest regulation.", "rating": 1, "pros": "Very easy to get employed as the staff turnover is very high. The members of staff/store level management are usually really down to earth and easy going people. Payroll/HR departments are fairly reliable.", "cons": "Where to start? If you go for a shop level position then they will most likely offer you 15 or so hours a week as a cashier with the \"possibility\" of more, the level of pay is every so slightly above minimum wage so your monthly income will be pittance. As a Cashier you'll mercifully get mainly daytime shifts, however you will have to work most Saturdays as well. Training is mainly on the job and the quality of this is completely down to the manager, you will also have to complete a tedious training book.", "advice": "Treat staff with dignity and respect. They should be viewed as a commodity not an expense. Be proactive in making positive changes to your shops for both staff and customers instead of just staying in line with the latest regulation."}, {"title": "marketplace manager", "text": "Pros Good team work/collegues. Regular customers make the shops. Flexible hours, get to watch and enjoy sports in work Cons The small percentage of customers who cant control their gambling. HR system not working. Head office out of touch with shop staff. Advice to Management Stop bombarding shops with multiple focus and instead do two/three things really well. Get the pay right and communicate with staff over changes that affect them.", "rating": 5, "pros": "Good team work/collegues. Regular customers make the shops. Flexible hours, get to watch and enjoy sports in work", "cons": "The small percentage of customers who cant control their gambling. HR system not working. Head office out of touch with shop staff.", "advice": "Stop bombarding shops with multiple focus and instead do two/three things really well. Get the pay right and communicate with staff over changes that affect them."}, {"title": "marketplace manager", "text": "Pros Good team work/collegues. Regular customers make the shops. Flexible hours, get to watch and enjoy sports in work Cons The small percentage of customers who cant control their gambling. HR system not working. Head office out of touch with shop staff. Advice to Management Stop bombarding shops with multiple focus and instead do two/three things really well. Get the pay right and communicate with staff over changes that affect them.", "rating": 5, "pros": "Good team work/collegues. Regular customers make the shops. Flexible hours, get to watch and enjoy sports in work", "cons": "The small percentage of customers who cant control their gambling. HR system not working. Head office out of touch with shop staff.", "advice": "Stop bombarding shops with multiple focus and instead do two/three things really well. Get the pay right and communicate with staff over changes that affect them."}, {"title": "Don't become a Manager", "text": "Pros The nice customers and getting involved in big race events or football matches etc Cons No proper training, extremely long hours sometimes with no breaks, no cashiers for cover, low pay, abusive customers spitting and swearing at you, smashing the shop up, running around on your day off trying to drop off keys, MPM's calling you constantly to help cover on days off, not allowed a life, no proper help from Management, staff have to try and help each other. Expect lone working, opening through to closing, no regard for staff safety. Stay as a cashier do your minimum few hours and get out of there. Advice to Management Ladbrokes is a cesspit of one ridiculousness after another, I feel so sorry for the staff there and I'm very happy I don't work there anymore. I was offered a job by William Hill and I have heard they are better to the staff and even give you a travel card, but after Ladbrokes I couldn't stomach it. Working for Ladbrokes should come with a health warning.", "rating": 1, "pros": "The nice customers and getting involved in big race events or football matches etc", "cons": "No proper training, extremely long hours sometimes with no breaks, no cashiers for cover, low pay, abusive customers spitting and swearing at you, smashing the shop up, running around on your day off trying to drop off keys, MPM's calling you constantly to help cover on days off, not allowed a life, no proper help from Management, staff have to try and help each other. Expect lone working, opening through to closing, no regard for staff safety. Stay as a cashier do your minimum few hours and get out of there.", "advice": "Ladbrokes is a cesspit of one ridiculousness after another, I feel so sorry for the staff there and I'm very happy I don't work there anymore. I was offered a job by William Hill and I have heard they are better to the staff and even give you a travel card, but after Ladbrokes I couldn't stomach it. Working for Ladbrokes should come with a health warning."}, {"title": "Awful", "text": "Pros The staff and manager I worked with were amazing. I was lucky to work directly with friendly people. That was all. Cons The company itself is awful staff are not cared for or looked after just a number. Times at risk and no one cares. Advice to Management Actually care for staff and listen to them.", "rating": 1, "pros": "The staff and manager I worked with were amazing. I was lucky to work directly with friendly people. That was all.", "cons": "The company itself is awful staff are not cared for or looked after just a number. Times at risk and no one cares.", "advice": "Actually care for staff and listen to them."}, {"title": "Headoffice - Finance management - Rayners Lane", "text": "Pros There were some nice people working in head office. My direct team were great people. Also, the location was 15-20 minute’s drive from home. Aside from these 3 points, there is nothing else. Cons Where can I start? The following 2 words are totally lost within the finance department – Accountability and responsibility. Very “pass the buck” environment. If it can be passed on to another department, then that will be done with no logic behind the allocation of work. No welcome lunch for new starters in my team. I was simply told by senior finance that I can spend the funds myself if I wish to but can’t claim back on expenses? Not a single process had been updated in the last 5-7 years. Anyone with my experience could see this. Working until 7-11 every other day with no thanks or overtime allocated. Nothing to make you feel as if you had made a difference. No HR department at all. There is no one for an employee to turn to. There were so many issues and I haven’t got the time to list all of them. It may look good having a FTSE 100 company on your CV but the reality could not be further from the truth. I have had agencies say that they wold not promote Ladbrokes too much from my CV as they have heard may bad things from other employees. To put further insult to injury, I am still waiting for my P45 3.5 months after handing in my notice. I am currently losing out on over a third of my salary as HMRC have said that Ladbrokes have not submitted my P45 and therefore do not have information about my earnings from that company. I have chased them twice now, both times waiting for a “manager” to call back from payroll. I am still waiting. Anyone whom is reading this, please do not make the mistake of joining this company. They do not have a clue on how to treat employees and how to run a business, hence why they have to merge just to stay in the market. Advice to Management Listen to the people doing the actual work……not just your direct report. There are other floors in the building aside from the 4th floor where you may notice other members of the firm.", "rating": 1, "pros": "There were some nice people working in head office.", "cons": "Where can I start? The following 2 words are totally lost within the finance department – Accountability and responsibility.", "advice": "Listen to the people doing the actual work……not just your direct report."}, {"title": "Worst job ever", "text": "Pros Sometimes flexible on days you can and can not work Cons Violent and abusive environment, company doesn't care about staff, no social life outside of work, poor training Advice to Management Humans are working for you not animals", "rating": 1, "pros": "Sometimes flexible on days you can and can not work", "cons": "Violent and abusive environment, company doesn't care about staff, no social life outside of work, poor training", "advice": "Humans are working for you not animals"}, {"title": "Ladbrokes invest in yourself because they wont invest in you!", "text": "Pros Great People to work with and nice environment if you have good managers and area managers, who are organised. Depending on your shop location as well. Cons Downsides for working for Ladbrokes are sometimes unorganized shops need staff which can have you travelling from your usual place to somewhere miles away although the shops are meant to reimburse your travel fair, this is hard to get back. Also the customers are abusive, rude and not very nice that;s the main downside which you will most likely get used to. Advice to Management Look after your main members of staff, i used to take shifts all the time and hardly said no too working extra shifts in different shops although when i had a family emergency and asked for my shift to be covered i was left trying to find my own replacement when i had been so helpful over the months.", "rating": 3, "pros": "Great People to work with and nice environment if you have good managers and area managers, who are organised. Depending on your shop location as well.", "cons": "Downsides for working for Ladbrokes are sometimes unorganized shops need staff which can have you travelling from your usual place to somewhere miles away although the shops are meant to reimburse your travel fair, this is hard to get back. Also the customers are abusive, rude and not very nice that;s the main downside which you will most likely get used to.", "advice": "Look after your main members of staff, i used to take shifts all the time and hardly said no too working extra shifts in different shops although when i had a family emergency and asked for my shift to be covered i was left trying to find my own replacement when i had been so helpful over the months."}, {"title": "There is no HR!", "text": "Pros On a personal note always happy to be around sports, good banter with the customers. Cons Management is very poor as things are dealt with at Head Office therefore people take the biscuit like crazy. A person calling in sick everyday, a lot of moving around and covering breaks. Despite pride I highly recommend u claim your travel for the amount of moving you do because Ladbrokes really don't care so you might aswell. Advice to Management Very happy with my MPM however the default mentality going around is that Ladbrokes do not give two spits about their employees. Your HR department is a scam to get money from callers. I actually don't think the department exists. What company doesn't answer their phone for OVER an HOUR, EVERYDAY! (No sarcasm there). No point saying 'sort it out', I hope most employees wake up and realise Ladbrokes is a Bad company to work for, stay there whilst looking for your dream job then just leave Ladbrokes, forget giving a notice they don't deserve it and really they don't need it because their such masterminds at covering the ill absents. Covering someone's Notice shouldn't be a problem.", "rating": 1, "pros": "On a personal note always happy to be around sports, good banter with the customers.", "cons": "Management is very poor as things are dealt with at Head Office therefore people take the biscuit like crazy. A person calling in sick everyday, a lot of moving around and covering breaks. Despite pride I highly recommend u claim your travel for the amount of moving you do because Ladbrokes really don't care so you might aswell.", "advice": "Very happy with my MPM however the default mentality going around is that Ladbrokes do not give two spits about their employees. Your HR department is a scam to get money from callers. I actually don't think the department exists. What company doesn't answer their phone for OVER an HOUR, EVERYDAY! (No sarcasm there). No point saying 'sort it out', I hope most employees wake up and realise Ladbrokes is a Bad company to work for, stay there whilst looking for your dream job then just leave Ladbrokes, forget giving a notice they don't deserve it and really they don't need it because their such masterminds at covering the ill absents. Covering someone's Notice shouldn't be a problem."}, {"title": "Not bad, I love it", "text": "Pros The pay, new people you would get to meet, making new friends. The tips you get sometimes and sometimes customers brings us free food. Conversations you have with people you are working with are fun Cons Long hours, sending you to many different location just to cover someone else's break. Some managers sometimes can be a bit of a **** and some are actually nice to work with as in the joke you share. Advice to Management Just chill out and treat everyone nicely, learn from the nice managers and your staffs would respect you.", "rating": 3, "pros": "The pay, new people you would get to meet, making new friends. The tips you get sometimes and sometimes customers brings us free food. Conversations you have with people you are working with are fun", "cons": "Long hours, sending you to many different location just to cover someone else's break. Some managers sometimes can be a bit of a **** and some are actually nice to work with as in the joke you share.", "advice": "Just chill out and treat everyone nicely, learn from the nice managers and your staffs would respect you."}, {"title": "Don't work here", "text": "Pros Quick interview, immediate start, easy application Cons Long hours, forced to do overtime and then refused to pay for over time, deleted my hours off the system and refused to pay me for hours I did and opened an investigation, they have no consideration for your safety in the shops especially when it's a high risk area with multiple assaults on staff and robbed and gun point, managers don't return calls or solve any queries and shout and lie about you, throw you into the deep end Advice to Management Pay your employees for all their hours worked. Get security and value your staff, return calls,", "rating": 1, "pros": "Quick interview, immediate start, easy application", "cons": "Long hours, forced to do overtime and then refused to pay for over time, deleted my hours off the system and refused to pay me for hours I did and opened an investigation, they have no consideration for your safety in the shops especially when it's a high risk area with multiple assaults on staff and robbed and gun point, managers don't return calls or solve any queries and shout and lie about you, throw you into the deep end", "advice": "Pay your employees for all their hours worked. Get security and value your staff, return calls,"}, {"title": "Customer Service Advisor", "text": "Pros Get to watch sports on the job, great if you have a good interest in sports betting or sports in general. Cons Everyone is petrified of middle management who don't seem to do much. Also if you have to stay an extra half hour after work you are not compensated. Upper/Middle Management mistreat there staff in general. Advice to Management Treat your staff fairly. They are the face of the company, if the customers feel you're screwing the staff over, what do you think the customers feel about betting with Ladbrokes", "rating": 3, "pros": "Get to watch sports on the job, great if you have a good interest in sports betting or sports in general.", "cons": "Everyone is petrified of middle management who don't seem to do much. Also if you have to stay an extra half hour after work you are not compensated. Upper/Middle Management mistreat there staff in general.", "advice": "Treat your staff fairly. They are the face of the company, if the customers feel you're screwing the staff over, what do you think the customers feel about betting with Ladbrokes"}, {"title": "No Appreciation for Hard Work", "text": "Pros I will say that they pay very well for an easy job (Customer Service Advisor). Cons You aren't treated with the respect you deserve considering you have to deal with angry, irate customers who don't always show you respect. Too many \"power-hungry\" managers at the company. They need new management, and a new business strategy needs to be put into place to ensure effective working conditions, and to boost team morale as this is non-existent in certain areas/regions. Advice to Management You should review the policies you have in place as these policies only benefit you and your empty wallets.", "rating": 3, "pros": "I will say that they pay very well for an easy job (Customer Service Advisor).", "cons": "You aren't treated with the respect you deserve considering you have to deal with angry, irate customers who don't always show you respect. Too many \"power-hungry\" managers at the company. They need new management, and a new business strategy needs to be put into place to ensure effective working conditions, and to boost team morale as this is non-existent in certain areas/regions.", "advice": "You should review the policies you have in place as these policies only benefit you and your empty wallets."}, {"title": "liking of job on a downhill slope!", "text": "Pros working in an adult environment and can be fun, good company benefits and discounts Cons left on your own in an empty shop for lengthy times, never getting any praise when things are going well but quick to point out when you have done something wrong, impossible to keep upto date with inshop priorities as they change their minds so often with what your priority is ie machines v OTC v compliance, MPM who have been fast-tracked into role and who have not got a clue of the job, if you keep yor mouth shut you go far but if you are outspoken you will pay the price Advice to Management put managers back into shops as MPMs are a waste of time considering some sit at home being paid large wages when they claim to be working, get senior management to try working on the shop floor once in a while", "rating": 3, "pros": "working in an adult environment and can be fun, good company benefits and discounts", "cons": "left on your own in an empty shop for lengthy times, never getting any praise when things are going well but quick to point out when you have done something wrong, impossible to keep upto date with inshop priorities as they change their minds so often with what your priority is ie machines v OTC v compliance, MPM who have been fast-tracked into role and who have not got a clue of the job, if you keep yor mouth shut you go far but if you are outspoken you will pay the price", "advice": "put managers back into shops as MPMs are a waste of time considering some sit at home being paid large wages when they claim to be working, get senior management to try working on the shop floor once in a while"}, {"title": "Do not give wage slips!!!!", "text": "Pros met some really nice colleagues here that do a great job. It's the head office and HR that are a let down for this company. Cons Company won't provide you with wage slips meaning you can't prove your income to anyone. I had to leave as I couldn't prove what I had earned. When I tried to get copy's of wage slip the HR team told me everything is done on computers now but I couldn't access them as I had left the company. I asked when I would get a p45 as it had been over 6 weeks they said they didn't know. Not helpful and don't care about individuals. Advice to Management Provide employees with wage slips so they can use these as proof of income.", "rating": 1, "pros": "met some really nice colleagues here that do a great job. It's the head office and HR that are a let down for this company.", "cons": "Company won't provide you with wage slips meaning you can't prove your income to anyone. I had to leave as I couldn't prove what I had earned. When I tried to get copy's of wage slip the HR team told me everything is done on computers now but I couldn't access them as I had left the company. I asked when I would get a p45 as it had been over 6 weeks they said they didn't know. Not helpful and don't care about individuals.", "advice": "Provide employees with wage slips so they can use these as proof of income."}, {"title": "Okay student job", "text": "Pros Nice place to work, hours are too long. Cons Salary not great, long hours. Advice to Management Don't leave staff working alone.", "rating": 3, "pros": "Nice place to work, hours are too long.", "cons": "Salary not great, long hours.", "advice": "Don't leave staff working alone."}, {"title": "Working in the bookies", "text": "Pros Some good customers, staff. Learning about sports You meet some nice customers and horrible ones as well. You can go really far if you can suck up to managers Cons Management is horrible. You work long hours and don't feel appreciated They don't care about staff. Constant insults and treats from customers and some mpms and area managers . Some managers don't even know the rules they just make things up", "rating": 1, "pros": "Some good customers, staff. Learning about sports You meet some nice customers and horrible ones as well. You can go really far if you can suck up to managers", "cons": "Management is horrible. You work long hours and don't feel appreciated They don't care about staff. Constant insults and treats from customers and some mpms and area managers . Some managers don't even know the rules they just make things up", "advice": null}, {"title": "Great experience", "text": "Pros Good development opportunities, very open to all Cons Not any to note Advice to Management Keep being open to internal promotion and development", "rating": 5, "pros": "Good development opportunities, very open to all", "cons": "Not any to note", "advice": "Keep being open to internal promotion and development"}, {"title": "Good company", "text": "Pros Gives opportunities to there staff to excel you start from a cashier then become a customer service manager. You can also then become a marketplace manager which is more responsibilities Cons It can get very busy when single manning and customers can get very abusive at times so you have to be composed. Advice to Management Learn what the industry is about", "rating": 5, "pros": "Gives opportunities to there staff to excel you start from a cashier then become a customer service manager. You can also then become a marketplace manager which is more responsibilities", "cons": "It can get very busy when single manning and customers can get very abusive at times so you have to be composed.", "advice": "Learn what the industry is about"}, {"title": "Sometimes but boring when you're on your own", "text": "Pros Colleagues were nice and got on well. Flexible hours. Customers were cool as well. Tips Cons Don't get staffing until late Friday eve for the next week. Working on your own for 12 hours a day. Not getting a break until 9 hours into your shift. Some cashiers don't help. Unsocial hours, sometimes working 50 hours because short of staff. Training could be better. Advice to Management Look after your staff and reward them. Not just a small box of chocolates at Xmas per shop. Regular feedback too to staff and acknowledgement.", "rating": 3, "pros": "Colleagues were nice and got on well. Flexible hours. Customers were cool as well. Tips", "cons": "Don't get staffing until late Friday eve for the next week. Working on your own for 12 hours a day. Not getting a break until 9 hours into your shift. Some cashiers don't help. Unsocial hours, sometimes working 50 hours because short of staff. Training could be better.", "advice": "Look after your staff and reward them. Not just a small box of chocolates at Xmas per shop. Regular feedback too to staff and acknowledgement."}, {"title": "Exciting and Very boring at the same time", "text": "Pros Flexible hours, Exciting, fast paced Cons long hours, low staff numbers, business is always changing Advice to Management Value your staff more and not what money your loosing", "rating": 3, "pros": "Flexible hours, Exciting, fast paced", "cons": "long hours, low staff numbers, business is always changing", "advice": "Value your staff more and not what money your loosing"}, {"title": "Customer Service Manager", "text": "Pros Flexible hours, Lots of banter, opportunity for lots of hours if you want it but this would be at other shops Cons Senior management are greedy, the company is very greedy as a whole, do not get paid enough to deal with customers Advice to Management Pay rise with less responsibility", "rating": 3, "pros": "Flexible hours, Lots of banter, opportunity for lots of hours if you want it but this would be at other shops", "cons": "Senior management are greedy, the company is very greedy as a whole, do not get paid enough to deal with customers", "advice": "Pay rise with less responsibility"}, {"title": "Customer Service Manager", "text": "Pros Flexible hours, Lots of banter, opportunity for lots of hours if you want it but this would be at other shops Cons Senior management are greedy, the company is very greedy as a whole, do not get paid enough to deal with customers Advice to Management Pay rise with less responsibility", "rating": 3, "pros": "Flexible hours, Lots of banter, opportunity for lots of hours if you want it but this would be at other shops", "cons": "Senior management are greedy, the company is very greedy as a whole, do not get paid enough to deal with customers", "advice": "Pay rise with less responsibility"}, {"title": "Not very good", "text": "Pros about the only thing of benefit is that it is flexible, Ive returned to college the flexibility helps but other than that I would be struggling. Cons disorganised, poorly run, no opportunities, no real benefits, no recognition and actually dangerous you will regularly have to deal with drunks and drug users. Advice to Management treat your employees as an asset to the business not just a a means to an end. To be honest Id say the same as to how the customers are treated.", "rating": 1, "pros": "about the only thing of benefit is that it is flexible, Ive returned to college the flexibility helps but other than that I would be struggling.", "cons": "disorganised, poorly run, no opportunities, no real benefits, no recognition and actually dangerous you will regularly have to deal with drunks and drug users.", "advice": "treat your employees as an asset to the business not just a a means to an end. To be honest Id say the same as to how the customers are treated."}, {"title": "My view point", "text": "Pros Was good money and very different to retail Cons to much of a controlling atmosphere. Management was poor and had poor people skills Advice to Management Make staff happy. Happy staff equal happy customers", "rating": 3, "pros": "Was good money and very different to retail", "cons": "to much of a controlling atmosphere. Management was poor and had poor people skills", "advice": "Make staff happy. Happy staff equal happy customers"}, {"title": "Don't expect much", "text": "Pros People you meet and the friends you make. Good pay for managers. Good way to start your career you pick up good customer service skills as you deal with all sorts of people. Cons The managers don't care and you are just a number. Managers bully and black mail their staff to get what they want . I used to have to drive around on my days off collecting keys to open the shop up. (I would wait till 9.30 at night to collect them as that's when the shop would close) It's no wonder 500 staff out of 550 opted for voluntary redundancy.If your looking for work short term id say yeah try it out but don't stay longer than a year. And don't let them walk all over you like I've seen them do. Advice to Management Treat staff better!!!", "rating": 1, "pros": "People you meet and the friends you make. Good pay for managers. Good way to start your career you pick up good customer service skills as you deal with all sorts of people.", "cons": "The managers don't care and you are just a number. Managers bully and black mail their staff to get what they want . I used to have to drive around on my days off collecting keys to open the shop up. (I would wait till 9.30 at night to collect them as that's when the shop would close) It's no wonder 500 staff out of 550 opted for voluntary redundancy.If your looking for work short term id say yeah try it out but don't stay longer than a year. And don't let them walk all over you like I've seen them do.", "advice": "Treat staff better!!!"}, {"title": "A former CSM's opinion", "text": "Pros Plenty of sports to see but usually far too busy to actually get to watch anything. Nice work colleagues. Occasional good banter with some of the nice punters which, unfortunately, seem to be in a small minority. Cons Management are incredibly awful. They seem to care almost nothing for shop staff and, in my experience, treat them like nameless numbers who are basically told to just get on with the job as they have been told.. Bullying, threats, ridiculous, inexplicable, repetitive, unnecessary administration time wasting tasks every day. Lack of support from almost every direction. Unfair and dangerous single-manning for hours on end, even full days. Poor pay. Difficult to get granted holidays that you want. The FOBT terminals have utterly ruined betting shops and utterly ruined many people's lives. Greed is the prevalent factor. It seems to be almost institutional. Advice to Management The only way you can ever possibly understand what customers want and what the issues are in shops are to talk to the staff who deal with these things every single working day. Stop letting ignorant morons sitting in comfy meeting rooms make ridiculous decisions based upon nothing more that ill-informed opinions. A truly dispicable employer. If there was anything like a proper union for betting shop workers I'd be surprised if even a single one would be allowed to open considering the way staff are treated.", "rating": 1, "pros": "Plenty of sports to see but usually far too busy to actually get to watch anything. Nice work colleagues. Occasional good banter with some of the nice punters which, unfortunately, seem to be in a small minority.", "cons": "Management are incredibly awful. They seem to care almost nothing for shop staff and, in my experience, treat them like nameless numbers who are basically told to just get on with the job as they have been told.. Bullying, threats, ridiculous, inexplicable, repetitive, unnecessary administration time wasting tasks every day. Lack of support from almost every direction. Unfair and dangerous single-manning for hours on end, even full days. Poor pay. Difficult to get granted holidays that you want. The FOBT terminals have utterly ruined betting shops and utterly ruined many people's lives. Greed is the prevalent factor. It seems to be almost institutional.", "advice": "The only way you can ever possibly understand what customers want and what the issues are in shops are to talk to the staff who deal with these things every single working day. Stop letting ignorant morons sitting in comfy meeting rooms make ridiculous decisions based upon nothing more that ill-informed opinions. A truly dispicable employer. If there was anything like a proper union for betting shop workers I'd be surprised if even a single one would be allowed to open considering the way staff are treated."}, {"title": "Living the Ladbrokes Life", "text": "Pros A great career for those interested in sport. You will have a lot of fun at work, and some of the relationships you build with regular customers will be enriching. Cons The hours are terrible, and your shifts will be changed on very short notice, a lot of people are rushed through their training and struggle to do the job. The company will expect you to take bets, be out on the shop floor interact with customers showing signs of problem behaviour all while you are working alone should you fail to do this you will be punished. Some customers can be aggressive. Advice to Management Stop single manning and stop changing policy and focus every six months. You do not need a customer service gimick to reverse the company's fortunes you need a strong base of knowledgeable and experienced staff. At the you will never get that as you ask more and more of your staff whilst you support them less and less. As a result staff turnover is very, very high.", "rating": 3, "pros": "A great career for those interested in sport. You will have a lot of fun at work, and some of the relationships you build with regular customers will be enriching.", "cons": "The hours are terrible, and your shifts will be changed on very short notice, a lot of people are rushed through their training and struggle to do the job. The company will expect you to take bets, be out on the shop floor interact with customers showing signs of problem behaviour all while you are working alone should you fail to do this you will be punished. Some customers can be aggressive.", "advice": "Stop single manning and stop changing policy and focus every six months. You do not need a customer service gimick to reverse the company's fortunes you need a strong base of knowledgeable and experienced staff. At the you will never get that as you ask more and more of your staff whilst you support them less and less. As a result staff turnover is very, very high."}, {"title": "CSM", "text": "Pros Great if you love sport. You get to spend a lot of time getting paid to do what you would be doing at home. Most staff are nice and friendly. Can be a nice relaxing job depending on if you are based in a quiet or busy store. Cons Working in busy shops you can be rushed off your feet. Some of the customers can be very rude and abusive so you need a think skin. Advice to Management Take more notice of your staff. Management are mostly concerned with keeping shops open as long as possible and making as much money as possible", "rating": 5, "pros": "Great if you love sport. You get to spend a lot of time getting paid to do what you would be doing at home. Most staff are nice and friendly. Can be a nice relaxing job depending on if you are based in a quiet or busy store.", "cons": "Working in busy shops you can be rushed off your feet. Some of the customers can be very rude and abusive so you need a think skin.", "advice": "Take more notice of your staff. Management are mostly concerned with keeping shops open as long as possible and making as much money as possible"}, {"title": "Do not work here", "text": "Pros Before being taken over by playtech Ladbrokes International plc was a fine place to work Cons ...unfortunately now the management are not interested in the employees nor do they recruit for the success of the business Advice to Management Change your management team and get a team of like minded value orientated managers who are working towards a common goal", "rating": 1, "pros": "Before being taken over by playtech Ladbrokes International plc was a fine place to work", "cons": "...unfortunately now the management are not interested in the employees nor do they recruit for the success of the business", "advice": "Change your management team and get a team of like minded value orientated managers who are working towards a common goal"}, {"title": "There's better...and worse.", "text": "Pros The people at shop level are great. Cons Long days can be a pain, open when no need to be, some rules that are a bit unnecessary. Lots of artificial targets too. Advice to Management Give the shop teams a little bit of credit - don't make the job insufferably difficult.", "rating": 3, "pros": "The people at shop level are great.", "cons": "Long days can be a pain, open when no need to be, some rules that are a bit unnecessary. Lots of artificial targets too.", "advice": "Give the shop teams a little bit of credit - don't make the job insufferably difficult."}, {"title": "Marketplace Manager", "text": "Pros Met some amazing people. Salt of the earth types. Pay is competitive for the industry. Company wants staff to take ownership of all their activities and you're pretty much left alone if your a team player and do what's expected. Job is pretty flexible for part-timers. Ability to progress quickly early and can really develop your people skills. Hardest workers in the industry. Probably one of the few betting companies where everyone works closely with upper management and the head office teams. Fairly open with teams. Possible to be full time over four days. Cons Restructuring has left very little in ways of progression to upper management. Sometimes a lot of needless pressure and high expectations are put on staff from upper management. Staff Rewards system needs to be reviewed. No decent incentives or internal staff recognition system besides outside retail/betting awards. Sometimes everythings a battle, you have to know your rights or be willing to speak up multiples times or head office and other teams take advantage and hope you'll give up. Long hours now the night racing is in all year round. Advice to Management Staff do a lot, with tough budgets. More than others in the same industry give positive feedback, reward them, if not monetary in some other ways. Keep staff motivated. Slow to react to staff and customer feedback. Need a better rewards/recognition structure and staff benefits.", "rating": 3, "pros": "Met some amazing people. Salt of the earth types. Pay is competitive for the industry. Company wants staff to take ownership of all their activities and you're pretty much left alone if your a team player and do what's expected. Job is pretty flexible for part-timers. Ability to progress quickly early and can really develop your people skills. Hardest workers in the industry. Probably one of the few betting companies where everyone works closely with upper management and the head office teams. Fairly open with teams. Possible to be full time over four days.", "cons": "Restructuring has left very little in ways of progression to upper management. Sometimes a lot of needless pressure and high expectations are put on staff from upper management. Staff Rewards system needs to be reviewed. No decent incentives or internal staff recognition system besides outside retail/betting awards. Sometimes everythings a battle, you have to know your rights or be willing to speak up multiples times or head office and other teams take advantage and hope you'll give up. Long hours now the night racing is in all year round.", "advice": "Staff do a lot, with tough budgets. More than others in the same industry give positive feedback, reward them, if not monetary in some other ways. Keep staff motivated. Slow to react to staff and customer feedback. Need a better rewards/recognition structure and staff benefits."}, {"title": "Pros and Cons", "text": "Pros If you are interested in any sort of sports, racing or the betting industry this job can be incredibly interesting and for someone who is young and looking for a role with more responsibility ladbrokes offers a fast track managerial program to anyone that shows competency. Anyone who is a sports enthusiast you will find you will never miss another result or live match again and where else are you encouraged to watch live sports and get paid for it! I would recommend this job especially to any current or prospective students based on the flexibility, dependent on base shop location. A plus point is also Ladbrokes competitive wage for CSM's. At a young age and on a part time basis you would be hard pressed to find better than £8.31 an hour. Cons On the most part customers can be very friendly and quite often become a friend for life but there are the exceptions who can make your life a complete misery. A lot of betting stores on the high street are closely located to pubs, customers losing a lot of money and being drunk can make for some aggressive situations especially at later hours. Which leads me to my next criticism, single manning hours at night. Although I did not personally feel unsafe during my time working late hours alone at ladbrokes I consider this an unnecessary risk and a possible accident waiting to happen. My next point would be the long working hours. Even in light of the new working hours \"5 over 7\" where colleagues would not work over 8.5 hours a day, I still found myself working full shifts from half 8 in the morning to just after 10 at night. While this doesn't seem too bad as a one off occasion, working 2 or 3 of these shifts can make for a very stressful and demoralizing environment . Advice to Management As is planned, more visibility at shop level will do a lot of good to continue sowing the ladbrokes values. Single manning will need to be revisited as a possible security and safety risk.", "rating": 3, "pros": "If you are interested in any sort of sports, racing or the betting industry this job can be incredibly interesting and for someone who is young and looking for a role with more responsibility ladbrokes offers a fast track managerial program to anyone that shows competency. Anyone who is a sports enthusiast you will find you will never miss another result or live match again and where else are you encouraged to watch live sports and get paid for it!", "cons": "On the most part customers can be very friendly and quite often become a friend for life but there are the exceptions who can make your life a complete misery. A lot of betting stores on the high street are closely located to pubs, customers losing a lot of money and being drunk can make for some aggressive situations especially at later hours. Which leads me to my next criticism, single manning hours at night. Although I did not personally feel unsafe during my time working late hours alone at ladbrokes I consider this an unnecessary risk and a possible accident waiting to happen.", "advice": "As is planned, more visibility at shop level will do a lot of good to continue sowing the ladbrokes values. Single manning will need to be revisited as a possible security and safety risk."}, {"title": "Enpower people", "text": "Pros Friendly staff, flexible working hours. Cons Low pay. Do not value employees. Advice to Management Poor management structure. Listen to the staff, they know more about customers and their needs!!", "rating": 3, "pros": "Friendly staff, flexible working hours.", "cons": "Low pay. Do not value employees.", "advice": "Poor management structure."}, {"title": "Ladbrokes Operate A Culture Of Fear and churn through people like a conveyor belt.", "text": "Pros Absolutely no pros to list. None. Cons I have been there since February with the promise of being moved from the £6.50 minimum wage after 3 months. I've been there 7 and nothing. They use constant threats of the sack if you don't do this or that, while they implement new things almost every week. If we do not know to the letter every aspect of the new product, we are threatened with the sack. In my experience people don't thrive on fear, I have to work 6 days a week to get a decent wage and rarely get a weekend day off. When I was ill I was being phoned to ask when I would be back constantly. This is a terrible company to work for that churn through people like a conveyor belt. They take what they need then cast you aside. Advice to Management Be more interested in your employees and not just profit.", "rating": 1, "pros": "Absolutely no pros to list. None.", "cons": "I have been there since February with the promise of being moved from the £6.50 minimum wage after 3 months. I've been there 7 and nothing. They use constant threats of the sack if you don't do this or that, while they implement new things almost every week. If we do not know to the letter every aspect of the new product, we are threatened with the sack. In my experience people don't thrive on fear,", "advice": "Be more interested in your employees and not just profit."}, {"title": "Reasonable place to work", "text": "Pros Flexible hours, can get more hours if your require, many friendly regular customers to get to know (depending on the shop) Cons Having to work alone at times which is hard when having to face aggresive issues with customers Advice to Management think more about employees", "rating": 3, "pros": "Flexible hours, can get more hours if your require, many friendly regular customers to get to know (depending on the shop)", "cons": "Having to work alone at times which is hard when having to face aggresive issues with customers", "advice": "think more about employees"}, {"title": "Good people poor pay", "text": "Pros Interesting work plenty of development Cons Losing out to the internet and off shore Advice to Management Fewer shops better staff", "rating": 3, "pros": "Interesting work plenty of development", "cons": "Losing out to the internet and off shore", "advice": "Fewer shops better staff"}, {"title": "Hot and cold.", "text": "Pros Reliable staff most times. Great customers. Flexible hours, always available overtime. Great promotions for customers and little treats from the company to the employee example. Taste card. Cons Constantly changing different shops. Cashiers been left alone a lot. Sometimes you feel like your in school getting disciplinarians for not having name badge on, sent home for small things that can be easily resolved. Sometimes you get the feel like your still in school. Advice to Management As employees, we need more support. Want to feel like a team than just an employee.", "rating": 3, "pros": "Reliable staff most times. Great customers. Flexible hours, always available overtime. Great promotions for customers and little treats from the company to the employee example. Taste card.", "cons": "Constantly changing different shops. Cashiers been left alone a lot. Sometimes you feel like your in school getting disciplinarians for not having name badge on, sent home for small things that can be easily resolved. Sometimes you get the feel like your still in school.", "advice": "As employees, we need more support. Want to feel like a team than just an employee."}, {"title": "Customer Service Manager", "text": "Pros Always overtime available if you want to top up your basic salary. Not too taxing a job especially if based in a not busy shop. Cons Working by yourself for long hours, can be boring. Dis organisation within management, can be last minute changes to your staffing. Pay not great and expecting to be out on the shop floor despite being by your self and all the security risks involved. Advice to Management Respect staff more. Dont expect us to be robots, if you always want us to give exemplary customer service all the time and look after the shop, there should be no single manning (yes i know im in dream world there)", "rating": 3, "pros": "Always overtime available if you want to top up your basic salary. Not too taxing a job especially if based in a not busy shop.", "cons": "Working by yourself for long hours, can be boring. Dis organisation within management, can be last minute changes to your staffing. Pay not great and expecting to be out on the shop floor despite being by your self and all the security risks involved.", "advice": "Respect staff more. Dont expect us to be robots, if you always want us to give exemplary customer service all the time and look after the shop, there should be no single manning (yes i know im in dream world there)"}, {"title": "Area Manager", "text": "Pros An interesting business with different challenges to the norm. Cons Very prescriptive in terms of job role as the cluster managers in the field are not allowed to support area managers in respect recruitment, employee relations issues etc. This means a lot of time spent doing very humdrum and routine tasks which prevent you from spending time in the shops and working on the businesses themselves. Poorly paid yet very demanding compared to similar positions elsewhere. Advice to Management Trust and empower people more!", "rating": 3, "pros": "An interesting business with different challenges to the norm.", "cons": "Very prescriptive in terms of job role as the cluster managers in the field are not allowed to support area managers in respect recruitment, employee relations issues etc. This means a lot of time spent doing very humdrum and routine tasks which prevent you from spending time in the shops and working on the businesses themselves.", "advice": "Trust and empower people more!"}, {"title": "AM Review", "text": "Pros Lots of overtime & change Cons Lots of work 7 days a week", "rating": 3, "pros": "Lots of overtime & change", "cons": "Lots of work 7 days a week", "advice": null}, {"title": "great opportunities to progress", "text": "Pros flexibility around working hours, working around sport and so many opportunities to progress Cons perception of the industry in the press Advice to Management the customer will always be what drives our business - everything should focus on the customer experience", "rating": 5, "pros": "flexibility around working hours, working around sport and so many opportunities to progress", "cons": "perception of the industry in the press", "advice": "the customer will always be what drives our business - everything should focus on the customer experience"}, {"title": "great opportunities to progress", "text": "Pros flexibility around working hours, working around sport and so many opportunities to progress Cons perception of the industry in the press Advice to Management the customer will always be what drives our business - everything should focus on the customer experience", "rating": 5, "pros": "flexibility around working hours, working around sport and so many opportunities to progress", "cons": "perception of the industry in the press", "advice": "the customer will always be what drives our business - everything should focus on the customer experience"}, {"title": "Had worse, had better.", "text": "Pros Sports, horse racing and gambling. Cons Poor HR. Wages always incorrect. Old and dated equipment which probably keeps them behind competitors. Very little opportunities to progress in current role.", "rating": 3, "pros": "Sports, horse racing and gambling.", "cons": "Poor HR. Wages always incorrect. Old and dated equipment which probably keeps them behind competitors. Very little opportunities to progress in current role.", "advice": null}, {"title": "csa", "text": "Pros Fantastic atmosphere in most shops Cons Fantastic until ur actually in the door....then all downhill Advice to Management Treat staff better,be more understanding of childcare issues", "rating": 3, "pros": "Fantastic atmosphere in most shops", "cons": "Fantastic until ur actually in the door....then all downhill", "advice": "Treat staff better,be more understanding of childcare issues"}, {"title": "Awful", "text": "Pros Not too difficult. Some customers are OK. Cons Single manning, more backstabbing than game of thrones, long hours, thankless. Made to encourage customers to get themselves into debt. Advice to Management Value your staff.", "rating": 1, "pros": "Not too difficult. Some customers are OK.", "cons": "Single manning, more backstabbing than game of thrones, long hours, thankless. Made to encourage customers to get themselves into debt.", "advice": "Value your staff."}, {"title": "No future. No prospects. Just repetition", "text": "Pros Decent hourly mate inclusive of London allowance. Very Easy job. (Depending on management) flexible shifts Cons Large amounts of single manning in shops that they claim are risk free. Early openings and late closing attracts wrong clientele. Same thing every day. Nothing will change. No prospect of progession. Ladbrokes would rather employ externally. Breach working time directives and ignore pressurise staff to not complete Sunday opt out forms. No benefits or premium pay. The company has removed any form of premium that we used to get as well as removing oyster cards and other benefits. This was done through pressurised requests to sign things out of your contract. Advice to Management Get real. The staff are very knowledgeable and very helpful but simply will not complete a host of ridiculous new tasks without you at least offering some sort of incentive or pay rise. Ever since the company stopped employing shop managers and changed to CSM etc staff are moved left right and centre and thus do not care about their shop/it's profitability. Ladbrokes is not a supermarket. The customers do not want to be and do not expect to be treated as if they are in one (despite your none existent surverys). Shop floor work makes all staff feel vulnerable and uneasy. Senior management are solely responsible for Ladbrokes decline as they have not kept up to date and competitive with competition. Having staff make the occasional cup of hot brown water for a customer will not help you reach your targets. The senior management need to climb down from their ivory towers and go and visit real shop's. Not the fancy concept shops in the west end or the conveniently very modern shops near the head office. Go and visit a real shop in an London Borough with the sole purpose of understanding the daily challenges and problems that go on day by day. Not complaining about how your old technology is not working and the store is looking aged. Put yourself in the shoes of the customer service managers who have been tricked into thinking they were valued and fast tracked and are now being forced to do ridiculous work like inspecting and cleaning toilets or talking to a customer who has just lost his last penny and explain that we are launching a fantastic slots game next week. Try tackling the abuse the threats and dodging the spit as it is launched at any form of flat surface and tell me you would happily go the extra mile for this sort of wage. For just one day stop thinking about how to add another zero to your bonuses and share holder returns and consider the depressed, overworked and undervalued staff who have allowed you to achieve this.", "rating": 1, "pros": "Decent hourly mate inclusive of London allowance.", "cons": "Large amounts of single manning in shops that they claim are risk free.", "advice": "Get real. The staff are very knowledgeable and very helpful but simply will not complete a host of ridiculous new tasks without you at least offering some sort of incentive or pay rise. Ever since the company stopped employing shop managers and changed to CSM etc staff are moved left right and centre and thus do not care about their shop/it's profitability. Ladbrokes is not a supermarket. The customers do not want to be and do not expect to be treated as if they are in one (despite your none existent surverys). Shop floor work makes all staff feel vulnerable and uneasy. Senior management are solely responsible for Ladbrokes decline as they have not kept up to date and competitive with competition. Having staff make the occasional cup of hot brown water for a customer will not help you reach your targets. The senior management need to climb down from their ivory towers and go and visit real shop's. Not the fancy concept shops in the west end or the conveniently very modern shops near the head office. Go and visit a real shop in an London Borough with the sole purpose of understanding the daily challenges and problems that go on day by day. Not complaining about how your old technology is not working and the store is looking aged. Put yourself in the shoes of the customer service managers who have been tricked into thinking they were valued and fast tracked and are now being forced to do ridiculous work like inspecting and cleaning toilets or talking to a customer who has just lost his last penny and explain that we are launching a fantastic slots game next week. Try tackling the abuse the threats and dodging the spit as it is launched at any form of flat surface and tell me you would happily go the extra mile for this sort of wage. For just one day stop thinking about how to add another zero to your bonuses and share holder returns and consider the depressed, overworked and undervalued staff who have allowed you to achieve this."}, {"title": "Ladbrokes", "text": "Pros no two days are the same Cons treat staff badly, no incentives, shops can be dangerous, senior staff have no clue on what customers want. Head office leave you to the will of lower managers with little intervention Advice to Management treat staff better. better campaigns needed that actually interest customers. two many levels for managers a lot of mpms and aoms do little work no need for them", "rating": 1, "pros": "no two days are the same", "cons": "treat staff badly, no incentives, shops can be dangerous, senior staff have no clue on what customers want. Head office leave you to the will of lower managers with little intervention", "advice": "treat staff better. better campaigns needed that actually interest customers. two many levels for managers a lot of mpms and aoms do little work no need for them"}, {"title": "Good company to work for", "text": "Pros Good wages paid at all grades. good colleagues with a good structure in place to progress and develop. Have advanced well over my time in company Cons Some customers are complete idiots. A lot put on staff at any one time. Long hours with some shops needing to be reviewed for trading hours. No customers means no business so no need to be open that early or that late Advice to Management Promotion from within. Look after the good staff", "rating": 5, "pros": "Good wages paid at all grades. good colleagues with a good structure in place to progress and develop. Have advanced well over my time in company", "cons": "Some customers are complete idiots. A lot put on staff at any one time. Long hours with some shops needing to be reviewed for trading hours. No customers means no business so no need to be open that early or that late", "advice": "Promotion from within. Look after the good staff"}, {"title": "EX MPM", "text": "Pros met a few good friends which are planning to leave as well. Cons no respect, fault finding company, don't listen, dictatorship Advice to Management The worse place anyone could got to. Company never listens to staff, handling things in dictatorship, either do or die attitude. Getting rid of older staff and replacing with all under 24's to manage shops. Will find the tiniest fault with staff and get rid of, which is despicable. Once you are in, you are steeping into hell. No one really cares for anyone or anything. Many staff are trying to find new jobs due to ill treatment and without any respect regardless of how much effort you put in or follow strict procedure. Don't go to them if you have any choices. It's already a warning here, if you still like to go, it's your choice.", "rating": 1, "pros": "met a few good friends which are planning to leave as well.", "cons": "no respect, fault finding company, don't listen, dictatorship", "advice": "The worse place anyone could got to. Company never listens to staff, handling things in dictatorship, either do or die attitude."}, {"title": "Stressful", "text": "Pros When it's not busy you can do pretty much what you like. Cons You are left alone for most of the day, with bundles of cash out the back and a high volume of customer's to serve. Advice to Management GET RID OF SINGLE MANNING", "rating": 1, "pros": "When it's not busy you can do pretty much what you like.", "cons": "You are left alone for most of the day, with bundles of cash out the back and a high volume of customer's to serve.", "advice": "GET RID OF SINGLE MANNING"}, {"title": "Overall a good experience", "text": "Pros Great place to work if you love sport, nearly football everyday and flexible work schedule, as long as you plan way in advance. Cons The hours maybe flexible but definitely long, expect 15 hours shift if you are a full time manager, the training structure may not be the best but it is slowly improving. Advice to Management I rather get pay less so we eliminate single manning, this will surely minimise damages such as cash differences, shop reputation and deter robbery and genuinely improve staff and customer satisfaction.", "rating": 3, "pros": "Great place to work if you love sport, nearly football everyday and flexible work schedule, as long as you plan way in advance.", "cons": "The hours maybe flexible but definitely long, expect 15 hours shift if you are a full time manager, the training structure may not be the best but it is slowly improving.", "advice": "I rather get pay less so we eliminate single manning, this will surely minimise damages such as cash differences, shop reputation and deter robbery and genuinely improve staff and customer satisfaction."}, {"title": "Csa", "text": "Pros fun environment to work in Cons lack of room for promotion", "rating": 3, "pros": "fun environment to work in", "cons": "lack of room for promotion", "advice": null}, {"title": "Avoid like the plague", "text": "Pros None at all. Horrible company Cons Long hours Single working all day Horrible customers Very poorly managed Never know rota until a couple of days before Unsafe environment Always wrong pay New starters expected to run shops within days of starting Advice to Management Why don't you actually come out from your Ivory tower into the shops once in a while and see what staff actually have to put up with, with no support from above.", "rating": 1, "pros": "None at all. Horrible company", "cons": "Long hours", "advice": "Why don't you actually come out from your Ivory tower into the shops once in a while and see what staff actually have to put up with, with no support from above."}, {"title": "Enjoyable ever changing work life", "text": "Pros Good opportunities to progress for hard workers, new challenges and focuses weekly, easy to build relationships with colleagues and management Cons Not for those unflexible with hours, unwilling to adapt to new tasks or people who can't come to work with a smile on their face", "rating": 5, "pros": "Good opportunities to progress for hard workers, new challenges and focuses weekly, easy to build relationships with colleagues and management", "cons": "Not for those unflexible with hours, unwilling to adapt to new tasks or people who can't come to work with a smile on their face", "advice": null}, {"title": "Ban single manning!!", "text": "Pros Lovely work colleagues and some lovely customers a good day was a good day but the bad were truly depressing!. Cons Single manning affects how well customer service is delivered its a horrible feeling when someone who normally would have got there bet on misses out when you are busy on your own and couldn't get there bets on and they end up winning!. Dreadful shift patterns mine were fine but others looked horrific but nobody dares to complain. Was once a wonderful company to work for say 5-6 years ago. Advice to Management It all falls down to the CEO a truly terrible decision to make him who he is you cannot blame anyone else really they only follow what he is ordering and the people who suffer the most are those at the bottom.", "rating": 3, "pros": "Lovely work colleagues and some lovely customers a good day was a good day but the bad were truly depressing!.", "cons": "Single manning affects how well customer service is delivered its a horrible feeling when someone who normally would have got there bet on misses out when you are busy on your own and couldn't get there bets on and they end up winning!.", "advice": "It all falls down to the CEO a truly terrible decision to make him who he is you cannot blame anyone else really they only follow what he is ordering and the people who suffer the most are those at the bottom."}, {"title": "Worst ever work experience", "text": "Pros None, there is nothing good about this company. Cons bullying, unfair company, rude, un-flexible, not friendly, the worst ever work experience you could have. Don't work here! Advice to Management respect employees, be honest, don't be unfair, listen people, more ethics, control, manage properly, organise, sustainability, governance, learn, culture, so many things for management to learn...", "rating": 1, "pros": "None, there is nothing good about this company.", "cons": "bullying, unfair company, rude, un-flexible, not friendly, the worst ever work experience you could have. Don't work here!", "advice": "respect employees, be honest, don't be unfair, listen people, more ethics, control, manage properly, organise, sustainability, governance, learn, culture, so many things for management to learn..."}, {"title": "Ladbrokes review", "text": "Pros Sit about all day and do nothing Cons bad company don't help with AYTHING Advice to Management tend to your staff more", "rating": 3, "pros": "Sit about all day and do nothing", "cons": "bad company", "advice": "tend to your staff more"}, {"title": "Went downhill very quickly", "text": "Pros If you enjoy watching sport, then great. Great in-shop team, customers become friends too. Can meet some great people. Cons Single manning is awful, as a young woman, working alone in the morning and especially until 10 at night, i feel very unsafe and often just feel like an easy target for would be robbers. They train people up to CSM as soon as possible just so they have more staff to single man, (whether you are good at the job or not). They change polices, focuses far too often, usually contradicting themselves. A very unconsistent company, very hard to keep up with procedures and offers, and if you do not do any of it correctly, then ecpect a strict telling off, or disciplinary action. Also, usually have far too many policies to follow at the same time, very unrealistic goals, would be hard to do with at least 3 members of staff, let alone just one. Also, they have no concern about OTC customers anymore, they are far too concerned with knowing all the spending habits of their machine customers. And be prepared to be sent to any shop they feel like on any given day, sometimes with less than an hour notice. Used to be a great place to work 5/6 years ago, but big bosses have gotten far too greedy with their cash cow FOBTs. Advice to Management Treat your staff with respect, come on to the shop floor and try to implement all the offers and procedures that are expected whilst working alone.", "rating": 3, "pros": "If you enjoy watching sport, then great. Great in-shop team, customers become friends too. Can meet some great people.", "cons": "Single manning is awful, as a young woman, working alone in the morning and especially until 10 at night, i feel very unsafe and often just feel like an easy target for would be robbers. They train people up to CSM as soon as possible just so they have more staff to single man, (whether you are good at the job or not). They change polices, focuses far too often, usually contradicting themselves. A very unconsistent company, very hard to keep up with procedures and offers, and if you do not do any of it correctly, then ecpect a strict telling off, or disciplinary action. Also, usually have far too many policies to follow at the same time, very unrealistic goals, would be hard to do with at least 3 members of staff, let alone just one. Also, they have no concern about OTC customers anymore, they are far too concerned with knowing all the spending habits of their machine customers. And be prepared to be sent to any shop they feel like on any given day, sometimes with less than an hour notice. Used to be a great place to work 5/6 years ago, but big bosses have gotten far too greedy with their cash cow FOBTs.", "advice": "Treat your staff with respect, come on to the shop floor and try to implement all the offers and procedures that are expected whilst working alone."}, {"title": "No care for staff", "text": "Pros Non - a good company to work for in 2006 when I joined but gradually every 'perk' to the job was pulled to increase profits Cons No care for staff welfare or safety.", "rating": 1, "pros": "Non - a good company to work for in 2006 when I joined but gradually every 'perk' to the job was pulled to increase profits", "cons": "No care for staff welfare or safety.", "advice": null}, {"title": "Good Company To Work For", "text": "Pros Fun work environment, work-life balance Cons None I can think about", "rating": 5, "pros": "Fun work environment, work-life balance", "cons": "None I can think about", "advice": null}, {"title": "Ok but not great", "text": "Pros Nice people Easy job Tips Everyday is different Can be interesting Cons Long hours Abusive customers Poor management Too many rules Poor pay Advice to Management Get out into the shops more and listen to your staff.", "rating": 3, "pros": "Nice people", "cons": "Long hours", "advice": "Get out into the shops more and listen to your staff."}, {"title": "Completely and utterly shambolic. Unbelievable.", "text": "Pros The best and only good things? Staff. Generally your co-workers will be the only good thing about your day. Some of your closest friendships can come from this experience, or relationship as you both understand and sympathise with each other and can bond, and have a laugh about it. Other good things, is after a year there are benefits as full sick pay, maternity, paternity, 5 weeks paid holiday. (Which you have to pick more than a year in advance however. The rate of pay is good on the face of it, however the expectations vs the rate of pay, it becomes abysmal. Cons What isn't a con with this company? They mentally and physically rape you. The training is substandard at best. They put you in a shop straight away and expect the person whose having to run a shop already to teach them. It's an awkward learning experience, however you'll put it past you and carry on because it's more than Minimum wage, and you feel like you're learning, a bit. They want you to run shops after a month, you'll feel like it's because they value you and that they think you're amazing at your job.so they are fast tracking you - unfortunately not. They do not have a clear message of what they want you to provide as a service, they move the goal posts so often (I'm talking weekly), you take a week off holiday and boom you're in a disciplinary by 11. The hours, 8am til 10pm, you'll be contracted for 35 hours but expected to work 45 and don't be fooled, they won't ask. You'll be based in a shop, but you can be sent anywhere within a 25mile radius, and you think ah they won't send me that far, but they will if they have to and you can't say no. On a plus side, they will pay travel, but not the added four hours you're now spending travelling. Sickness, you feel safe as there is a 3 in 6 sick rule, 3 sicknesses in 6 months, it doesn't matter about how long, a day or 6 months, it still has the same severity when it comes to punishment. It also doesn't matter if you're signed off, that doesn't come into consideration as I was told \"just because you're signed off doesn't mean you're not Unwell enough to work\", so if like me you spend two weeks in a hospital bed signed off, you are well enough to work. You will work for the company three years, and actually love it, you will make excuses for the way the treat you, and continue do of they ask. All companies have flaws, however they have no respect for your or the customers. In the last month alone 8 people have been suspended and made to feel like they need to quit, or to be fired. Over, honestly nothing. You may think of me as bitter, but I'm not it's just ridiculous. 8 people, no one stole, no one caused damage, no one argued with a customer, no one fixed a bet, or served an underage customer. It was things like Facebook statuses saying you're sad you shop was closing, but apparently it's slander. Honestly \"really sad to see my shop shut, four years on its still a place loved by me and fellow staff, but you can't fix something that is just not working\". Beware. Advice to Management Stop the man hunt. Consider adequate training, and proper retraining regularly. Think about your staff not money.", "rating": 1, "pros": "The best and only good things? Staff. Generally your co-workers will be the only good thing about your day. Some of your closest friendships can come from this experience, or relationship as you both understand and sympathise with each other and can bond, and have a laugh about it. Other good things, is after a year there are benefits as full sick pay, maternity, paternity, 5 weeks paid holiday. (Which you have to pick more than a year in advance however. The rate of pay is good on the face of it, however the expectations vs the rate of pay, it becomes abysmal.", "cons": "What isn't a con with this company? They mentally and physically rape you. The training is substandard at best. They put you in a shop straight away and expect the person whose having to run a shop already to teach them. It's an awkward learning experience, however you'll put it past you and carry on because it's more than Minimum wage, and you feel like you're learning, a bit.", "advice": "Stop the man hunt."}, {"title": "I enjoyed my time there.", "text": "Pros Good if you like sport, horse racing, dogs etc. Flexible with hours - when I was at university and work experience, they were happy to work my hours around dates/times. Cons As a customer service manager (CSM) I had to single-man the shop daily between 8.30-10am and 8-9.30pm, which as a young woman I didn't feel safe at times - especially in winter! I certainly didn't get paid enough for the amount of responsibility I had. Advice to Management Listen to the shop staff. They're the ones that deal with customers daily. Sometimes ideas that supervisors or marketplace managers have are unachievable and unrealistic, although it might look good on paper.", "rating": 3, "pros": "Good if you like sport, horse racing, dogs etc. Flexible with hours - when I was at university and work experience, they were happy to work my hours around dates/times.", "cons": "As a customer service manager (CSM) I had to single-man the shop daily between 8.30-10am and 8-9.30pm, which as a young woman I didn't feel safe at times - especially in winter! I certainly didn't get paid enough for the amount of responsibility I had.", "advice": "Listen to the shop staff. They're the ones that deal with customers daily. Sometimes ideas that supervisors or marketplace managers have are unachievable and unrealistic, although it might look good on paper."}, {"title": "Good to work for", "text": "Pros easy job, nice customers most of the time, flexible hours if you have a good shop team, good training pack Cons Lone working of a night is not safe for staff who are mostly women, not good pay", "rating": 5, "pros": "easy job, nice customers most of the time, flexible hours if you have a good shop team, good training pack", "cons": "Lone working of a night is not safe for staff who are mostly women, not good pay", "advice": null}, {"title": "It is an institution, but needs moving with the times", "text": "Pros No day is ever the same, lots of variety and interest. An ideal company if you are passionate about sports and/or casino, poker and bingo. Large churn of staff meaning there is room for movement and promotion. It's a highly recognised company in the public eye. Cons Are known for not paying high salaries. As there is a large turnover of staff, then the supervisory levels are filled with inexperienced in product knowledge. Supervisors lack the very necessary skills in employee management as well as customer management. Thus, there is too little in terms of employee feedback in term of positivity. The supervisors feel that the only method of demonstrating their own superiority is to devalue the frontline staff. Advice to Management Management are frightened of losing their jobs, they follow a strict and unofficial \"cover yourself\" policy which regrettably does not include common sense. There is little or no management of customers as the supervisors have little product knowledge and are unable to educate and resolve customer issues. Stop the easy kop out of offering \"goodwill gestures\" to make issues disappear. This only creates a bad precedent and pushes the issue onto some of your agents at a later date.", "rating": 5, "pros": "No day is ever the same, lots of variety and interest.", "cons": "Are known for not paying high salaries. As there is a large turnover of staff, then the supervisory levels are filled with inexperienced in product knowledge.", "advice": "Management are frightened of losing their jobs, they follow a strict and unofficial \"cover yourself\" policy which regrettably does not include common sense."}, {"title": "On the rebound", "text": "Pros Lots of great people to work with Cons Tough to deal with inferior technology Advice to Management invest in you staff!", "rating": 3, "pros": "Lots of great people to work with", "cons": "Tough to deal with inferior technology", "advice": "invest in you staff!"}, {"title": "Avoid this company like the plague", "text": "Pros There are none this company is the worst to work for possibly in the entire of the United Kingdom Disgusting Cons I was on the verge of suicide and was taken to a disciplinary for being late into work a few times during this period. When I told my line manager how bad I had become was told it wasn't the company's problem and he also suggested I was lying. Also expected to work alone in the evenings and mornings, paid disgustingly low wages for doing it and threatened constantly with disciplinary action for the tiniest of mistakes. Staff go sick because Ladbrokes don't listen to their views, customers who assault staff or smash machines are immune from punishment if they spend enough money and the market place managers know nothing more than I do about the game and are given powers to verbally bully their staff Advice to Management I don't think there is any advice I can give. Ladbrokes are going to be the first bookmakers to go bust simply because so much damage has been done by a clueless and greedy chief exec and by the appalling treatment of the staff that actually make them the money. However if there was some advice I would say start thinking why staff are leaving and to stop treating us like idiots but as I say I think the damage to this company is irreversible.", "rating": 5, "pros": "There are none this company is the worst to work for possibly in the entire of the United Kingdom Disgusting", "cons": "I was on the verge of suicide and was taken to a disciplinary for being late into work a few times during this period. When I told my line manager how bad I had become was told it wasn't the company's problem and he also suggested I was lying. Also expected to work alone in the evenings and mornings, paid disgustingly low wages for doing it and threatened constantly with disciplinary action for the tiniest of mistakes. Staff go sick because Ladbrokes don't listen to their views, customers who assault staff or smash machines are immune from punishment if they spend enough money and the market place managers know nothing more than I do about the game and are given powers to verbally bully their staff", "advice": "I don't think there is any advice I can give. Ladbrokes are going to be the first bookmakers to go bust simply because so much damage has been done by a clueless and greedy chief exec and by the appalling treatment of the staff that actually make them the money. However if there was some advice I would say start thinking why staff are leaving and to stop treating us like idiots but as I say I think the damage to this company is irreversible."}, {"title": "Short term corporate profit maximization to the detriment of customers and employees - welcome to UKPLC", "text": "Pros Good for those interested in sport, promotion opportunities for those who's face fits. Relatively good training. Excellent for people who don't like spending time with their families ;) Cons A nasty industry. Low pay, anti social hours and poor performance regarding other employee conditions such as contract hours, personal growth. Awful social responsibility. Advice to Management Reward staff with a living wage and meaningful bonuses, decent hours and respect. Stop thinking short term.", "rating": 3, "pros": "Good for those interested in sport, promotion opportunities for those who's face fits. Relatively good training. Excellent for people who don't like spending time with their families ;)", "cons": "A nasty industry. Low pay, anti social hours and poor performance regarding other employee conditions such as contract hours, personal growth. Awful social responsibility.", "advice": "Reward staff with a living wage and meaningful bonuses, decent hours and respect. Stop thinking short term."}, {"title": "There is still light at the end of the tunnel but it's fading....", "text": "Pros There are a lot of good people and good managers within the business. A lot of people still carry the enthusiasm to see Ladbrokes turn into a really good company. Cons Too many layers of management, inefficient structure. Lack of trust leading to micromanagement of tasks. Removal of shop managers has lead to a everyone equal no-one accountable culture in shops. Ageist employment policy (no duty managers over 24) has lead to very young immature shop teams with little life experience. I have concerns over the safety of staff single manning in an evening. Advice to Management De-layer and get the shops closer to the decision makers. Remove ageist recruitment policies. Stop single scheduling in the evenings - if a shop doesn't do enough business to cover the £33.05 for a cashier then close it. Trust your Management to manage, micromanagement is slowing progress down and adding to the cost line. Give MPM's and shops email addresses to improve communication.", "rating": 3, "pros": "There are a lot of good people and good managers within the business. A lot of people still carry the enthusiasm to see Ladbrokes turn into a really good company.", "cons": "Too many layers of management, inefficient structure. Lack of trust leading to micromanagement of tasks. Removal of shop managers has lead to a everyone equal no-one accountable culture in shops. Ageist employment policy (no duty managers over 24) has lead to very young immature shop teams with little life experience. I have concerns over the safety of staff single manning in an evening.", "advice": "De-layer and get the shops closer to the decision makers. Remove ageist recruitment policies. Stop single scheduling in the evenings - if a shop doesn't do enough business to cover the £33.05 for a cashier then close it. Trust your Management to manage, micromanagement is slowing progress down and adding to the cost line. Give MPM's and shops email addresses to improve communication."}, {"title": "Rewarding", "text": "Pros Good team spirit. Nice colleagues. Cons Asked to go above and beyond for no reward Advice to Management Unfair to promise bonuses that are not forthcoming", "rating": 3, "pros": "Good team spirit. Nice colleagues.", "cons": "Asked to go above and beyond for no reward", "advice": "Unfair to promise bonuses that are not forthcoming"}, {"title": "Awful!", "text": "Pros Nice customers Lower level staff and nice and friendly Cons Awful customers Awful area managers I was the victim of an armed robbery and received no support, after i had a gun pointed in my face my area manager expected me to return to work the next day! even though i left the police station at 2am! They expect you to work 14 hour shifts alone with no lunch break They will harass you on days off with constant calling to see if you can cover people who have gone sick Staff go sick all the time because they are fed up with being treated awfully. They would not allow me to come back after i had time off to recover from an armed robbery, the reason for this is older staff members know their rights and will complain, new staff will be paid less and less likely to kick up a fuss The rota is always changing last minute so impossible to plan things outside of work While i was pregnant i was very sick and treated awfully, infact, one manager said to me \"you are taking advantage of your pregnancy, we do not have to pay u if u are pregnant and sick\" - this is wrong and made me feel awful while pregnant i was forced to move shops because my male manager found it \"uncomfortable\" Advice to Management No point, all they care about is hitting targets, they dont care about responsible gambling, i once reported a customer who had a gambling problem and i was told to turn a blind eye because he spent lots of money!", "rating": 1, "pros": "Nice customers", "cons": "Awful customers", "advice": "No point, all they care about is hitting targets, they dont care about responsible gambling, i once reported a customer who had a gambling problem and i was told to turn a blind eye because he spent lots of money!"}, {"title": "Good pay, poor management.", "text": "Pros The pay and the team is a great pro. Although I can see why the pay is good now. Cons Management. Management think that putting an office in a marketplace where the other shops are a 'million' miles away is acceptable. They also like to try move staff around as they choose, even when A) the staff don't want to move B) would add a 'thousand' miles onto their daily commute. Very poorly run, and understandable why the company is losing money. Advice to Management Stick to teams in each shop to build up an excellent team and increase the customer service levels in each. Constantly moving staff or placing shops in new marketplaces unsettle and make staff unhappy about working for the company, therefore those customer service levels you seek won't be hit and targets will fail also.", "rating": 1, "pros": "The pay and the team is a great pro. Although I can see why the pay is good now.", "cons": "Management. Management think that putting an office in a marketplace where the other shops are a 'million' miles away is acceptable. They also like to try move staff around as they choose, even when A) the staff don't want to move B) would add a 'thousand' miles onto their daily commute.", "advice": "Stick to teams in each shop to build up an excellent team and increase the customer service levels in each. Constantly moving staff or placing shops in new marketplaces unsettle and make staff unhappy about working for the company, therefore those customer service levels you seek won't be hit and targets will fail also."}, {"title": "Worst HR policies and department ever!", "text": "Pros Some lovely shop teams and middle management that try so hard in a very difficult environment given the current climate and some very tough customers. Cons You live in fear of the big stick..and I am sure that if middle managers don't use it..they end up with an even bigger stick and so on. It's become a culture of fear for the workers..the good ones end up leaving sooner or later and it just gets worse. Advice to Management Sort out your HR policies and procedures..and do it correctly,too many errors with people management that will backfire when people start to bite back and stand up for themselves.", "rating": 1, "pros": "Some lovely shop teams and middle management that try so hard in a very difficult environment given the current climate and some very tough customers.", "cons": "You live in fear of the big stick..and I am sure that if middle managers don't use it..they end up with an even bigger stick and so on. It's become a culture of fear for the workers..the good ones end up leaving sooner or later and it just gets worse.", "advice": "Sort out your HR policies and procedures..and do it correctly,too many errors with people management that will backfire when people start to bite back and stand up for themselves."}, {"title": "Mundane, unchallenging. Automated.", "text": "Pros Some good colleagues, hours not demanding, flexible hours, laid back environment, could watch a lot of sport. Cons No career progression, endless meetings, constant technical issues, sub standard salary, bureaucratic to the extreme, pathetic bonus system, automation replacing skill. Situated in a hell hole of Rayners Lane Advice to Management Sort the the I.T issues out permanently, improve the user experience, pay better salaries, think differently don't follow the crowd via automation.", "rating": 3, "pros": "Some good colleagues, hours not demanding, flexible hours, laid back environment, could watch a lot of sport.", "cons": "No career progression, endless meetings, constant technical issues, sub standard salary, bureaucratic to the extreme, pathetic bonus system, automation replacing skill. Situated in a hell hole of Rayners Lane", "advice": "Sort the the I.T issues out permanently, improve the user experience, pay better salaries, think differently don't follow the crowd via automation."}, {"title": "Could be a good company but its spoilt by greedy ruthless management.", "text": "Pros ● You will meet some great customers with good banter. ● You can stay updated with sport while you work. ● You can sometimes have very quiet periods where you can relax. Cons ● Working alone during unsafe periods. When your in a shop until 10pm that's in a rough area and next door to a pub full of rowdy drunks this makes work unsafe, the amount of abuse and danger makes it unfair to work alone, however, the bosses do not care. ● Petty rules. You can be called into a meeting and possibly suspended over such a petty meaningless mistake. ● Different rules for different people. Many favoured staff can pick and choose their hours, the shops they will and won't work in, what they will and wont do. Where as other staff are punished for such behaviour. ● Abuse both physical and verbal from customers. The bosses do not care about the abuse you receive, they will not ban abusive customers as long as they spend money. To the bosses money is more important than your safety. ● The bosses are always coming up with stupid ideas and marketing campaigns that just don't work, they think its great but it only gets slated and laughed at by customers. ● There's not a moments rest, on my days off I am constantly harassed either to do more hours or something to do with picking up or dropping off keys, I have had to block Ladbrokes numbers from my phone but they still call on mobiles, yesterday I received more than 10 calls on my day off. ● Unprofessional market place managers who are all young and more up for a good gossip rather than doing their job professionally. ● Higher management talk to shop staff like we are peasants, they think they have the right to talk down to us like we are grunts and they are sergeants. ● No reward for working very hard, they have taken away all bonuses and replaced them with a box of chocolates to share between the shop team. ● No over time rates. ● The expectation that you can close a shop in 5 minutes. If you have had a busy day and people playing machines until 10pm its near impossible to close a shop in 5 minutes. You will not be paid for the extra time you do to close up but you will be punished if you refuse to work this extra time for free, make your choice. ● Moral is so low for staff at Ladbrokes at the moment that it causes arguments and shops to be run poorly, unhappy staff = a poorly run shop. ● Totally not understanding about personal troubles, if you have a seriously ill family member and need a day off they don't like it and make you feel wrong for having to leave. I've had 2 occasions like this personally and seen others in the same situation, they even took away a ladies bonus because she took a week off after her father died. Advice to Management ● Stop trying to run a company like its a military camp, be happy and friendly, have a good positive attitude and this will reflect on the shop team. ● You need to understand that working alone in some shops can be a problem especially at night, not only do we have to deal with a tough crowd its very hard to get 5 bets on for a race that's about to go off, having one staff member is unsafe and also customers don't like it. ● Understand that us shop team don't get paid enough to base our life around Ladbrokes, we need our days off and we do not want to be contacted at home in our free time.", "rating": 1, "pros": "● You will meet some great customers with good banter.", "cons": "● Working alone during unsafe periods. When your in a shop until 10pm that's in a rough area and next door to a pub full of rowdy drunks this makes work unsafe, the amount of abuse and danger makes it unfair to work alone, however, the bosses do not care.", "advice": "● Stop trying to run a company like its a military camp, be happy and friendly, have a good positive attitude and this will reflect on the shop team."}, {"title": "For the most part - brilliant!", "text": "Pros Values, the amount they put into personal development, training and progression opportunities, benefits, recognition Cons Recent changes resulted in complete change to atmosphere, people are no longer happy, all the things that were good have been removed Advice to Management Go back to what we were culturally 5 years ago", "rating": 1, "pros": "Values, the amount they put into personal development, training and progression opportunities, benefits, recognition", "cons": "Recent changes resulted in complete change to atmosphere, people are no longer happy, all the things that were good have been removed", "advice": "Go back to what we were culturally 5 years ago"}, {"title": "Largely great", "text": "Pros Great people. First place I've worked where the 'product' so closely aligns to employees' lifestyles. Really like staff canteen - good quality food, plenty of choice, reasonably priced. Cons Can be a bit bureaucratic. The location really is a dump. If the world was shaped like an elephant, Rayners Lane would be under the tail. Not convinced that pay is that competitive, though bonnuses are good (if paid) Advice to Management Do more about internal promotion - at the moment it feels like the default approach for every interesting/senior vacancy is to recruit externally.", "rating": 5, "pros": "Great people. First place I've worked where the 'product' so closely aligns to employees' lifestyles. Really like staff canteen - good quality food, plenty of choice, reasonably priced.", "cons": "Can be a bit bureaucratic. The location really is a dump. If the world was shaped like an elephant, Rayners Lane would be under the tail. Not convinced that pay is that competitive, though bonnuses are good (if paid)", "advice": "Do more about internal promotion - at the moment it feels like the default approach for every interesting/senior vacancy is to recruit externally."}, {"title": "Evil", "text": "Pros Simple job, you can go for ages without seeing a customer during quiet periods. Some of the regular customers become like friends, thus creating a friendly in-shop atmosphere Cons Low pay, bullying management, no career advancement, randomly set unreachable targets. I have been robbed and head- butted whilst at work. Staff meetings are just briefing sessions as the bosses are not interested in the views of shop floor staff. Company policy is to leave staff on their own during the morning and evening Advice to Management Train staff properly, treat them fairly, recognise a trade union.", "rating": 1, "pros": "Simple job, you can go for ages without seeing a customer during quiet periods. Some of the regular customers become like friends, thus creating a friendly in-shop atmosphere", "cons": "Low pay, bullying management, no career advancement, randomly set unreachable targets. I have been robbed and head- butted whilst at work. Staff meetings are just briefing sessions as the bosses are not interested in the views of shop floor staff. Company policy is to leave staff on their own during the morning and evening", "advice": "Train staff properly, treat them fairly, recognise a trade union."}, {"title": "Ladbrokes used to be a great company with great people... but everyone has left due to very poor senior management.", "text": "Pros Free tickets to Ascot if you're in with the right people. Good staff discount and cashback website via reward gateway. If you work for the right manager you are appreciated, but unfortunately almost all of the good managers have been pushed out by the new CEO. Close to the Met and Piccadilly line. Free staff coach to Harrow town centre on Friday lunch times. Cons Good employees are not rewarded for the hard work, just expected to take a larger load to make up for the downfalls of others. Constant words but no actions by senior management. Terrible HR department from an employee perspective... only interested in looking after the company. Used to have an onsite gym which was removed for more meeting room space, and then turned into a storage room! Share prices was originally over £4 when I started working for the company, now all staff options are underwater and the shorter term schemes have been removed leaving only the four year plan. Canteen is described as subsidised but it is cheaper to buy a sandwich from Wenzel's, and it will taste better plus the bread has often been mouldy. Rayners Lane is not an exciting place to work. Iceland the moons pub is pretty much the highlight of the high street.", "rating": 3, "pros": "Free tickets to Ascot if you're in with the right people.", "cons": "Good employees are not rewarded for the hard work, just expected to take a larger load to make up for the downfalls of others.", "advice": null}, {"title": "Struggling in a difficult marketplace", "text": "Pros Friendly, relaxed, interesting for sports fans Cons Poor location, aging building, few amenities", "rating": 3, "pros": "Friendly, relaxed, interesting for sports fans", "cons": "Poor location, aging building, few amenities", "advice": null}, {"title": "More to job than it seems", "text": "Pros Great team, very good line manager, good promotion opportunities, easy to move around to other branches Cons Conflicting advice with regards to responsible gambling and targets, dealing with difficult customers, unrealistic targets, difficult to implement schemes, unapproachable higher management, don't feel valued as a staff member, lot of responsibility in a relatively minor role. Advice to Management Stop trying to implement so many selling schemes, ensure your staff are as important as your customers.", "rating": 3, "pros": "Great team, very good line manager, good promotion opportunities, easy to move around to other branches", "cons": "Conflicting advice with regards to responsible gambling and targets, dealing with difficult customers, unrealistic targets, difficult to implement schemes, unapproachable higher management, don't feel valued as a staff member, lot of responsibility in a relatively minor role.", "advice": "Stop trying to implement so many selling schemes, ensure your staff are as important as your customers."}, {"title": "More to job than it seems", "text": "Pros Great team, very good line manager, good promotion opportunities, easy to move around to other branches Cons Conflicting advice with regards to responsible gambling and targets, dealing with difficult customers, unrealistic targets, difficult to implement schemes, unapproachable higher management, don't feel valued as a staff member, lot of responsibility in a relatively minor role. Advice to Management Stop trying to implement so many selling schemes, ensure your staff are as important as your customers.", "rating": 3, "pros": "Great team, very good line manager, good promotion opportunities, easy to move around to other branches", "cons": "Conflicting advice with regards to responsible gambling and targets, dealing with difficult customers, unrealistic targets, difficult to implement schemes, unapproachable higher management, don't feel valued as a staff member, lot of responsibility in a relatively minor role.", "advice": "Stop trying to implement so many selling schemes, ensure your staff are as important as your customers."}, {"title": "Used to be good, now it's AWFUL", "text": "Pros Working with some really nice people from all walks of life. Decent pay Loads of overtime if needed Cons Overworked for absolutely zero benefit. Single manning! Cannot stress this enough. Terrible idea. All these hacks working at the top have probably never even walked into a bookies, let alone worked in one and have to deal with all types of crap from customers on a daily basis. Customers can be very verbally abusive due to losing money on the FOBTs and will call you all types, especially worse when you're a woman. The senior management do NOT care about staff and have recently tried to promote floor walking even when single manning. It's complete foolery and I'm not putting myself in that type of danger when I'm working until closing time. Currently looking for another job. Advice to Management Good luck with your sinking ship of a company.", "rating": 1, "pros": "Working with some really nice people from all walks of life.", "cons": "Overworked for absolutely zero benefit.", "advice": "Good luck with your sinking ship of a company."}, {"title": "BEEN AT LADBROKES 11 YEARS - ONCE A GOOD COMPANY - NOW A TERRIBLE ONE", "text": "Pros Flexible - easy to do - suits chatty people who like to mix with all types and I mean ALL types ! Cons Single manning - terrible idea that has come in during the last few years. Constant push to sell and promote the FOBT gaming machines which is immoral. Management don't care about employees and there is no progression route - again changed in the last few years. Advice to Management Spend some time on the shop floor with your employees to see what the real world is like.", "rating": 3, "pros": "Flexible - easy to do - suits chatty people who like to mix with all types and I mean ALL types !", "cons": "Single manning - terrible idea that has come in during the last few years. Constant push to sell and promote the FOBT gaming machines which is immoral. Management don't care about employees and there is no progression route - again changed in the last few years.", "advice": "Spend some time on the shop floor with your employees to see what the real world is like."}, {"title": "Alright if you're doing it just for the money and part-time!", "text": "Pros Flexible job, can be yourself, Cons a lot of gossip, having to work in different shops all the time", "rating": 3, "pros": "Flexible job, can be yourself,", "cons": "a lot of gossip, having to work in different shops all the time", "advice": null}, {"title": "Good people, fun and challenging work.", "text": "Pros Exciting, talking to customers, flexible hours Cons Lone Working morning and evenings Advice to Management Don't bite the hand that feeds you.", "rating": 5, "pros": "Exciting, talking to customers, flexible hours", "cons": "Lone Working morning and evenings", "advice": "Don't bite the hand that feeds you."}, {"title": "good job", "text": "Pros ok pay also if your willing to learn then its a good career path also working atmosphere is fantastic great laugh with customers Cons better pay and could do with better training programme for people that have never been in a betting shop before as they tend to find it harder to pick up Advice to Management training programme would be a great idea and a payrise for all staff", "rating": 5, "pros": "ok pay also if your willing to learn then its a good career path also working atmosphere is fantastic great laugh with customers", "cons": "better pay and could do with better training programme for people that have never been in a betting shop before as they tend to find it harder to pick up", "advice": "training programme would be a great idea and a payrise for all staff"}, {"title": "Tedious", "text": "Pros Depending on location and staffing quality the job itself is relatively easy. Flexible working hours are a bonus. Can make great friends through staff and customers. Cons Poor pay, no job satisfaction, no tangible security, unrealistic targets and events set by overpaid executive management who have no experience of the front line. Single manning is too commonplace with safety of staff not priority Advice to Management Compensate your overworked and under appreciated staff better and you'll see better results", "rating": 3, "pros": "Depending on location and staffing quality the job itself is relatively easy. Flexible working hours are a bonus. Can make great friends through staff and customers.", "cons": "Poor pay, no job satisfaction, no tangible security, unrealistic targets and events set by overpaid executive management who have no experience of the front line. Single manning is too commonplace with safety of staff not priority", "advice": "Compensate your overworked and under appreciated staff better and you'll see better results"}, {"title": "Used to be a good place to work", "text": "Pros Was a good atmosphere, very positive, can do. The people make the place. If you're into sports, then there's always something happening. Cons Changed in 2010. People taken for granted. Opportunities limited.", "rating": 3, "pros": "Was a good atmosphere, very positive, can do. The people make the place. If you're into sports, then there's always something happening.", "cons": "Changed in 2010. People taken for granted. Opportunities limited.", "advice": null}, {"title": "Disorganized company", "text": "Pros Can present the right opportunities if you are in with the right crowd Cons Lack of communication across departments Advice to Management Please open communications across all", "rating": 3, "pros": "Can present the right opportunities if you are in with the right crowd", "cons": "Lack of communication across departments", "advice": "Please open communications across all"}, {"title": "Ladbrokes", "text": "Pros Allowed a certain amount of flexibility in when and how you do your hours, although this could be dependent on the area you're working in and whether your colleagues are as flexible as you. Cons Can be long days, (if you choose to do them), working alone in morning and evening might be off putting to certain individuals Advice to Management Increase pay over next 2-3 years to make up for pay freeze and loss of some payments", "rating": 5, "pros": "Allowed a certain amount of flexibility in when and how you do your hours, although this could be dependent on the area you're working in and whether your colleagues are as flexible as you.", "cons": "Can be long days, (if you choose to do them), working alone in morning and evening might be off putting to certain individuals", "advice": "Increase pay over next 2-3 years to make up for pay freeze and loss of some payments"}, {"title": "Single Manning", "text": "Pros Sometimes it could be flexible Cons Serious safety issue and abusive customers.", "rating": 3, "pros": "Sometimes it could be flexible", "cons": "Serious safety issue and abusive customers.", "advice": null}, {"title": "Ladbrokes cashier", "text": "Pros Good fun with regular customers, good pay for a young person and sociable working hours compared to a pub. Cons computers and odds can be complicated when starting out. Huge emphasis on tills not being down, little room for error, a few large cash handling errors and your in trouble Advice to Management advice???? heres a tip, theres a horse running tommorrow at 3pm hes called 'solid foundation' hes running at cheltenham. A sure thing! you could put your house on him! :P", "rating": 5, "pros": "Good fun with regular customers, good pay for a young person and sociable working hours compared to a pub.", "cons": "computers and odds can be complicated when starting out. Huge emphasis on tills not being down, little room for error, a few large cash handling errors and your in trouble", "advice": "advice???? heres a tip, theres a horse running tommorrow at 3pm hes called 'solid foundation' hes running at cheltenham. A sure thing! you could put your house on him! :P"}, {"title": "Good Company ... Very bad salary", "text": "Pros Ladbrokes is a place where you can literally jump from one department to other department very easily. Cons Reaching top and staying top is hard as there is too much politics. Advice to Management Try to keep the old fashioned flat structure and pay your employees well. Salaries at ladbrokes are peanuts compared to market rates.", "rating": 3, "pros": "Ladbrokes is a place where you can literally jump from one department to other department very easily.", "cons": "Reaching top and staying top is hard as there is too much politics.", "advice": "Try to keep the old fashioned flat structure and pay your employees well. Salaries at ladbrokes are peanuts compared to market rates."}, {"title": "Good place to work, but long hours sometimes", "text": "Pros Flexible working hours, ability to work at horse tracks. Cons Night racing. Poor security procedures in place Advice to Management Make better security procedures", "rating": 5, "pros": "Flexible working hours, ability to work at horse tracks.", "cons": "Night racing. Poor security procedures in place", "advice": "Make better security procedures"}, {"title": "Short review", "text": "Pros Indépendance stratégique, au coeur de la transformation digitale, best practice internationale, très challenging Cons Freins et réticences de l'ancienne garde, très focus produits et clients, pas assez parts de marché, belle mise à jour digitale mais manque d'enthousiasme à l'innovation différenciative Advice to Management move forward if you really want to take over the belgium leadership", "rating": 5, "pros": "Indépendance stratégique, au coeur de la transformation digitale, best practice internationale, très challenging", "cons": "Freins et réticences de l'ancienne garde, très focus produits et clients, pas assez parts de marché, belle mise à jour digitale mais manque d'enthousiasme à l'innovation différenciative", "advice": "move forward if you really want to take over the belgium leadership"}, {"title": "Ladbrokes", "text": "Pros Alles goed met ladbrokes, goeie werkgever Cons Niets negatief me deze werknemer moet ik zeggen Advice to Management Hetzeldengeldt voor deze punt, niks te zeggen", "rating": 3, "pros": "Alles goed met ladbrokes, goeie werkgever", "cons": "Niets negatief me deze werknemer moet ik zeggen", "advice": "Hetzeldengeldt voor deze punt, niks te zeggen"}]