[{"title": "Amazing culture and exciting opportunities!", "text": "Pros Company culture is transparent, friendly, and everyone is willing to help each other out. Letgo is in high-growth mode, and there's a huge opportunity to really impact the industry. Cons The interviewing process was a bit longer than the usual and you'll meet a lot of the employees - but stick with it, because it'll be worth it! Advice to Management Keep everything up - the frequent communications, and ambition to transform the secondhand marketplace.", "rating": 5, "pros": "Company culture is transparent, friendly, and everyone is willing to help each other out. Letgo is in high-growth mode, and there's a huge opportunity to really impact the industry.", "cons": "The interviewing process was a bit longer than the usual and you'll meet a lot of the employees - but stick with it, because it'll be worth it!", "advice": "Keep everything up - the frequent communications, and ambition to transform the secondhand marketplace."}, {"title": "Fantastic place to work!!", "text": "Pros The people and team are what makes this company so great. The company is growing very quickly and able to give you the right resources to do your job properly. Overall, worklife balance is great, people are awesome, and product is doing great things! - Team Lunches/Outings - The best health, dental, vision plans - Free language education - Commuter Benefits - Opportunities to travel, even out of the country Cons None that I can think of!", "rating": 5, "pros": "The people and team are what makes this company so great. The company is growing very quickly and able to give you the right resources to do your job properly. Overall, worklife balance is great, people are awesome, and product is doing great things!", "cons": "None that I can think of!", "advice": null}, {"title": "Manager", "text": "Pros Work to life balance, culture, community, Team, there are no cons to working for letgo Cons Everyone is great. There is a sense of team and family and everyone is eager to work for a common goal Advice to Management Management is great and provides excellent leadership and promotes self thinking", "rating": 5, "pros": "Work to life balance, culture, community, Team, there are no cons to working for letgo", "cons": "Everyone is great. There is a sense of team and family and everyone is eager to work for a common goal", "advice": "Management is great and provides excellent leadership and promotes self thinking"}, {"title": "Hyper growing tech startup with major potential to change the way we buy and sell locally!", "text": "Pros -Hyper growing tech startup -Very nice and welcoming team -Flexibility; \"get your work done when needed and be available\" type of work environment - Transparent upper management team - Tech startup vibe with team lunches/happy hours and awesome offices in NYC and Barcelona - Potential to travel Cons Not much of a con but as a hyper growing startup there are a lot of moving parts. Flexible hours also means having to sometimes be available outside of the typical 9-5 business hours", "rating": 5, "pros": "-Hyper growing tech startup", "cons": "Not much of a con but as a hyper growing startup there are a lot of moving parts.", "advice": null}, {"title": "Supportive team, great oppurtunity", "text": "Pros In the states the team is small and therefore it is still very personal where everyone knows each other. Managers are supportive of their employees and are very respectful of their treatment to everyone. They genuinely care about the team and their experience while they are at work. Cons It is a very small team and is a start up- you're typical growing pains of not having super built out processes are there. Personally, I prefer being a part of the conversation as everything is built from the ground up. Advice to Management Over communicate everything and try your best to emulate your values as the company grows! It is very important.", "rating": 5, "pros": "In the states the team is small and therefore it is still very personal where everyone knows each other. Managers are supportive of their employees and are very respectful of their treatment to everyone. They genuinely care about the team and their experience while they are at work.", "cons": "It is a very small team and is a start up- you're typical growing pains of not having super built out processes are there. Personally, I prefer being a part of the conversation as everything is built from the ground up.", "advice": "Over communicate everything and try your best to emulate your values as the company grows! It is very important."}, {"title": "Fast paced and dynamic place to work", "text": "Pros Good, people focused culture, great locations in NYC, Miami and Barcelona. Lots of passion, and smarts across multiple disciplines. A lot of flexibility to work from different places results in excellent work/life balance. Ability to be a part of a company that's disrupting the classifieds business and pushing a lot of the desktop behavior to mobile. High potential for growth, great compensation and benefits (although no 401K) and many additional company perks. Teams are fast and able to change direction quickly. Cons Letgo is a global company, working across multiple timezones and workplace dynamics is challenging. Speed and volume of tasks can prove challenging a times. Advice to Management Continue to communicate long term goals and provide strategic context to the broader team giving visibility and inspiring our day-to-day.", "rating": 5, "pros": "Good, people focused culture, great locations in NYC, Miami and Barcelona.", "cons": "Letgo is a global company, working across multiple timezones and workplace dynamics is challenging.", "advice": "Continue to communicate long term goals and provide strategic context to the broader team giving visibility and inspiring our day-to-day."}, {"title": "If you are looking for a challenge, this is definitely the place to be", "text": "Pros It's an ambitious project run by still a fairly small team so you have the opportunity to have a real impact on the business. Startup spirit, great coworkers, great offices, good benefits Cons If you are looking for a relaxed job this is not the case", "rating": 5, "pros": "It's an ambitious project run by still a fairly small team so you have the opportunity to have a real impact on the business. Startup spirit, great coworkers, great offices, good benefits", "cons": "If you are looking for a relaxed job this is not the case", "advice": null}, {"title": "Inspiring Vision. Great team. Tons of interesting work and opportunities.", "text": "Pros No ceiling, you develop your position as you go. Hard work but playful and enjoyable. Continous experimentation and open to explore new ideas. Cons Not your place if you want something stable, predictable and slow pace. Advice to Management Manage the growth in a way that still feels personal", "rating": 5, "pros": "No ceiling, you develop your position as you go.", "cons": "Not your place if you want something stable, predictable and slow pace.", "advice": "Manage the growth in a way that still feels personal"}, {"title": "Awesome company culture with lots of growth!", "text": "Pros Fun, awesome, growing company with an exciting mission! Cons -like any growing companies, they're are garden variety growing pains. Nothing too concerning though. Advice to Management Keep up the good work!", "rating": 5, "pros": "Fun, awesome, growing company with an exciting mission!", "cons": "-like any growing companies, they're are garden variety growing pains. Nothing too concerning though.", "advice": "Keep up the good work!"}, {"title": "Exciting Times!", "text": "Pros Incredible fast growth Great compensation and benefits Fun and smart team Very empowering, with responsibilities and accountabilities Cons Very fast pace and lots of change which comes with the territory of being a start up.", "rating": 5, "pros": "Incredible fast growth", "cons": "Very fast pace and lots of change which comes with the territory of being a start up.", "advice": null}, {"title": "Great team, supportive environment, growing quickly", "text": "Pros Really exciting place to work given how quickly the company is growing and what it's trying to accomplish. It's a supportive, fun environment filled with smart, committed people who work hard and hold themselves to high standards. Cons Not really a con but it's a startup so obviously it's not a typical 9 to 5. But if you're interested in working for any startup chances are you're not looking for a typical 9 to 5 anyway.", "rating": 5, "pros": "Really exciting place to work given how quickly the company is growing and what it's trying to accomplish. It's a supportive, fun environment filled with smart, committed people who work hard and hold themselves to high standards.", "cons": "Not really a con but it's a startup so obviously it's not a typical 9 to 5. But if you're interested in working for any startup chances are you're not looking for a typical 9 to 5 anyway.", "advice": null}, {"title": "Ability to impact growth", "text": "Pros Very interesting group of people from all over the world. Ability to impact the product and company with good ideas and hard work. People respect good work and dedication. Lots of team players. Travel (if you like it). Cons The occasional difficulty of working with people in multiple offices (time differences, efficiencies, etc.). Travel (if you don't like it).", "rating": 5, "pros": "Very interesting group of people from all over the world.", "cons": "The occasional difficulty of working with people in multiple offices (time differences, efficiencies, etc.).", "advice": null}, {"title": "Great place to work!", "text": "Pros - High growth potential - Very skilled and experienced coworkers - Nice working environment - Good benefits Cons - Is located from Spain and serves mainly the US market. The culture and the New York office help to overcome this though. Advice to Management Keep up the transparency its great to be included from the start!", "rating": 5, "pros": "- High growth potential", "cons": "- Is located from Spain and serves mainly the US market. The culture and the New York office help to overcome this though.", "advice": "Keep up the transparency its great to be included from the start!"}, {"title": "Manager that has no vision nor capability to manage.", "text": "Pros -Ok salary for Barcelona -Free health insurance -Free snacks,drinks & food. -Free Spanish lessons -Nice office at a nice spot of the city -Multicultural nice people to work with -8 to 5 job, no overtimes In general overlook it is a promising company with promising career opportunities however it is non existent to any Customer Service Agent. I do believe that letgo will be a successful company in future. Cons -One click job, repetitive and becomes boring eventually. -Zero career opportunity, no opportunity to grow with in the company. -Non existent management. -Totally unrealistic goals with high quality expectations and worst bit is that manager ignores the facts. -Hard to say if manager has any manners. Can ask personal questions or make rude comments. -Manager lets others mob you just because they 'kinda' do their job. -Double standards. If you don't ask questions or question things you are safe however; Can not say the same if you start questioning their ways. -Your feedbacks are mostly ignored unless bad publication comes. Once bad publication comes then they make changes. -Non existent quality process. -KPI's set randomly. Has no valid data but 'experience' that leads that number to be perfectly do able number. Fake smiles, giggles and gestures to managers, team leaders and you are good to go. Otherwise, you let it go! (Or they let you go!) Advice to Management Hire real managers and real team leaders, not people who has no idea what they are doing. Why don't you do a questioner to your Customer Service agents to see what they think of their Manager and team leaders? Start investing in your people rather than hiring, we are all well educated smart people who has capacity to do more than 'One click'. Allowing mobbing does not motivate people. Start listening to your employees feedbacks and suggestions. We know the culture, religion, rules and regulations, ways and many more aspects of our native country then you would. We can do more that one click, we have a brain, capacity and vision in life.", "rating": 1, "pros": "-Ok salary for Barcelona", "cons": "-One click job, repetitive and becomes boring eventually.", "advice": "Hire real managers and real team leaders, not people who has no idea what they are doing."}, {"title": "letgo - A fun and dynamic place to work", "text": "Pros There are many advantages for working at letgo, the main ones being: - The opportunity to work in a dynamic, fast-paced, challenging and constantly changing environment - Work alongside a team of highly motivated and experienced professionals with a wide range of backgrounds - A flat organizational structure based around working in small teams with a high level of autonomy and responsibility allows for an employee to grow and be constantly challenging themselves Cons As with most startups letgo still has significant room to grow and improve. However, management has an open door policy and is very receptive to new ways to develop the company.", "rating": 5, "pros": "There are many advantages for working at letgo, the main ones being:", "cons": "As with most startups letgo still has significant room to grow and improve. However, management has an open door policy and is very receptive to new ways to develop the company.", "advice": null}, {"title": "Ambitious project", "text": "Pros Letgo is trying to make a difference in innovating in the classifieds sector and the employees really did care. Collaborative environment with a great culture, extremely friendly and talented coworkers. Opportunities to grow inside the company while pushing an ambitious project. I had the opportunity to take ownership of projects within my first month. Free snacks, health insurance and therapist is a big plus. Cons Like any tech company, the work is big and complex so work/life balance can suffer from time to time. Lack of clear career plans.", "rating": 5, "pros": "Letgo is trying to make a difference in innovating in the classifieds sector and the employees really did care. Collaborative environment with a great culture, extremely friendly and talented coworkers.", "cons": "Like any tech company, the work is big and complex so work/life balance can suffer from time to time. Lack of clear career plans.", "advice": null}, {"title": "Great place to work", "text": "Pros - Flexibility - Speed - Culture - Compensation Cons - Nothing to say really", "rating": 5, "pros": "- Flexibility", "cons": "- Nothing to say really", "advice": null}, {"title": "helpful colleagues & great benefits", "text": "Pros I was looking for a start-up with interesting projects where I could learn and have fun at. When I got the job offer at letgo I did not have any doubts it would be a company I´d feel great at. In general, colleagues and managers are friendly and the communication is open. We are encouraged to give feedback to each other.I love the benefits. Cons I believe more visibility on what other teams are into might be helpful, but I can see the company is working on improving the communications.", "rating": 5, "pros": "I was looking for a start-up with interesting projects where I could learn and have fun at.", "cons": "I believe more visibility on what other teams are into might be helpful, but I can see the company is working on improving the communications.", "advice": null}, {"title": "Could be a nice place to work, but it's not", "text": "Pros Good people in general Nice environment if you're not in the product team Stunning offices in Barcelona Health insurance Good salary Cons Lots of pressure Very long hours Management team is out to date Bosses, not leaders Did I say very long hours? Lots of internal politics. House of cards style. Product team has no product managers. Advice to Management Apply this value! People will forget what you said or what you did, but they'll never forget how you made them feel.", "rating": 1, "pros": "Good people in general", "cons": "Lots of pressure", "advice": "Apply this value! People will forget what you said or what you did, but they'll never forget how you made them feel."}, {"title": "Don't go there for a product position", "text": "Pros Nice and smart people to work with. Great offices in Barceloneta. Attractive salary. Cons Very poor management team (mostly product). No sharing on strategy. You are here to excecute not to think. No delegation. Very old-school management which doesn't match with a start-up spirit Day-to-day job not matching with the expectations from job interview. Very disappointing. Advice to Management You should totally change your way of managing projects and most of all people. Start trusting and empowering your employees. You'll see, great things can happen!", "rating": 1, "pros": "Nice and smart people to work with.", "cons": "Very poor management team (mostly product).", "advice": "You should totally change your way of managing projects and most of all people. Start trusting and empowering your employees. You'll see, great things can happen!"}]