[{"title": "Great Reward For Achievers", "text": "Pros Great workplace, fun and great commission Cons can be hard for people who doesnt have the drive", "rating": 3, "pros": "Great workplace, fun and great commission", "cons": "can be hard for people who doesnt have the drive", "advice": null}, {"title": "Sales Executive", "text": "Pros • great earning potential • good but brief training • nice co-workers Cons • high KPI pressure (low job security) • cold calling", "rating": 5, "pros": "• great earning potential", "cons": "• high KPI pressure (low job security)", "advice": null}, {"title": "Account executive", "text": "Pros They will hire most people. Good opportunity if you need sales experience. Cons Difficult working conditions. Low pay. Advice to Management Pay your employees and maybe they'll stick around.", "rating": 3, "pros": "They will hire most people. Good opportunity if you need sales experience.", "cons": "Difficult working conditions. Low pay.", "advice": "Pay your employees and maybe they'll stick around."}, {"title": "Treating humans like a number is a terrible business platform", "text": "Pros The other producers, marketing and sales and summits were wonderful, and I really enjoyed getting to know them. I made some life-long friends as well as business contacts but none of that is contingent upon meG. I’d say those are more personal skills which I absolutely did not learn at marcus evans group. Cons Unattainable KPIs, bonus structures are terrible and hardly achieved when tied to production; and the other options for bonuses are completely tied to sales and sponsorship MAKING a sale which only happens on select events, culture of fear and greed, low wages for the amount of work responsible for turning over, and in the end treated like a number which never mattered. Advice to Management Perhaps if trying to save money cut dead weight, and not those who are working their tails off to make reputable events.", "rating": 1, "pros": "The other producers, marketing and sales and summits were wonderful, and I really enjoyed getting to know them.", "cons": "Unattainable KPIs, bonus structures are terrible and hardly achieved when tied to production; and the other options for bonuses are completely tied to sales and sponsorship MAKING a sale which only happens on select events, culture of fear and greed, low wages for the amount of work responsible for turning over, and in the end treated like a number which never mattered.", "advice": "Perhaps if trying to save money cut dead weight, and not those who are working their tails off to make reputable events."}, {"title": "What a Joke! What a Ripoff!", "text": "Pros Nothing, I would not even recommend this to aliens invading the planet Cons This place is the worst place I have ever had the displeasure of working at. Management is horrible, absolutely horrid to the employees. This is the movie \"Boiler Room\" personified X 50. Work here at your own risk.!!!!!! Advice to Management Stop being Jerks", "rating": 1, "pros": "Nothing, I would not even recommend this to aliens invading the planet", "cons": "This place is the worst place I have ever had the displeasure of working at.", "advice": "Stop being Jerks"}, {"title": "Cold hearted con artists", "text": "Pros They shutdown for the holidays. Cons I have 11 years of Sales Experience (3 of them were as a Sales Manager. I was offered the position and expected to give less than a days notice to my employer, I declined. The VP of Sales then extended the offer for another 3 weeks. I accepted it, in training on Day 3 we were provided a training manual with typos and a script with typos and misleading information to the prospects we were to cold call. I left my job not being informed about the unethical practices. After one week of having this script. I was provided another one this one was WORST! It outright lies to prospects and have over 7 typos and run on sentences. I mentioned these concerns to my manager (whom I happen to have 5 years more Sales experience then. Within 4 days I was terminated, he says I wasn't \"progressing\". Please pay attentio: these people have NO care or concern for other humanbeings lives. They did this to me within 2 weeks. And I wasn't even given the opportunity to speak with one single client. They didn't think twice about my life and or my holiday with going home to see my family or any thing humane. I've never been treated with such less regard and I hope this doesn't happen to anyone ELSE! Advice to Management Speak UP! This a factual review.", "rating": 1, "pros": "They shutdown for the holidays.", "cons": "I have 11 years of Sales Experience (3 of them were as a Sales Manager.", "advice": "Speak UP! This a factual review."}, {"title": "Inside Sales", "text": "Pros Great co-workers; that's about it Cons no computers at your desk, you can use work stations and print more paper than is reasonably necessary. phone based job, no headset provided. company website not consistent with premium branding.", "rating": 1, "pros": "Great co-workers; that's about it", "cons": "no computers at your desk, you can use work stations and print more paper than is reasonably necessary. phone based job, no headset provided. company website not consistent with premium branding.", "advice": null}, {"title": "Only for the last resort desperate", "text": "Pros A friendly staff to keep some sanity. Cons Terrible once a month pay Stone age slow computers Paper script phone calls Revolving door If you're desperate for a gig, a friendly staff may keep your sanity. Anyone who stays is obviously drinking the cool aid. The smart ones milked it for the little it's worth and left ASAP!", "rating": 1, "pros": "A friendly staff to keep some sanity.", "cons": "Terrible once a month pay", "advice": null}, {"title": "Crazy place to work but good experience for conference producers", "text": "Pros build good experience, given lots of responsibility, travel opportunities, office location Cons extremely low base salary, churn and burn environment, cold calling Advice to Management Could be a great entry level company especially in conference production. Treating employees better (really depends on your manager though, some are as good as they can be), giving better compensation and more opportunities for growth would go a long way to keep people around longer.", "rating": 3, "pros": "build good experience, given lots of responsibility, travel opportunities, office location", "cons": "extremely low base salary, churn and burn environment, cold calling", "advice": "Could be a great entry level company especially in conference production. Treating employees better (really depends on your manager though, some are as good as they can be), giving better compensation and more opportunities for growth would go a long way to keep people around longer."}, {"title": "Great entry level opportunity", "text": "Pros Awesome group of co-workers. Excellent experience in writing and communications. Cons Afraid to change, innovate, and align with modern business practices. Poor pay and a flawed commission structure make the company a revolving door. Management doesn't seem to care and treats the high turnover like just another day in the office. Advice to Management Not sure what positive advice I can give. If the upper echelons of the firm invested money back into the company there may be some positive changes.", "rating": 3, "pros": "Awesome group of co-workers. Excellent experience in writing and communications.", "cons": "Afraid to change, innovate, and align with modern business practices. Poor pay and a flawed commission structure make the company a revolving door. Management doesn't seem to care and treats the high turnover like just another day in the office.", "advice": "Not sure what positive advice I can give. If the upper echelons of the firm invested money back into the company there may be some positive changes."}, {"title": "THEY DO NOT CARE ABOUT THEIR EMPLOYEES", "text": "Pros The Christmas party was fun Cons Awful pay no structure No room for change/growth A Scam", "rating": 1, "pros": "The Christmas party was fun", "cons": "Awful pay", "advice": null}, {"title": "Good starting point for College Grads", "text": "Pros Great opportunity to meet new people and make friends here, fun office outings and activities such as rec sports leagues, cooking/baking contests, end of quarter celebrations, book club, involvement with charitable organizations, etc. Cons Really really hard work that may or may not pay off. Managers and directors don't really care about whether or not you succeed or if employees quit. Company has been involved in sketchy things such as selling fake tickets to the Olympics (THG side of the company), dishonest selling in some divisions, sexual harassment of employees by supervisors and HR was aware and did nothing about it.", "rating": 3, "pros": "Great opportunity to meet new people and make friends here, fun office outings and activities such as rec sports leagues, cooking/baking contests, end of quarter celebrations, book club, involvement with charitable organizations, etc.", "cons": "Really really hard work that may or may not pay off. Managers and directors don't really care about whether or not you succeed or if employees quit. Company has been involved in sketchy things such as selling fake tickets to the Olympics (THG side of the company), dishonest selling in some divisions, sexual harassment of employees by supervisors and HR was aware and did nothing about it.", "advice": null}, {"title": "Opportunities for those who take them", "text": "Pros This was my first job after graduating college and I stayed on six and a half years. Speaking from a Conferences perspective, it's not account management. Very much a new business/hunter mentality required. Fast paced, open floor concept. Three month sales cycle keeps the markets/industries you're selling into fresh. Great training/process that gives you a foundational set of skills that will translate to whatever comes next on your own path. Everyone starts at the entry level and is only promoted from within. Personally, I achieved management in about two years and had the chance to work with some of the largest organizations in the world (Marathon, Chevron, Exelon, Raytheon, Northrop Grumman, Societe Generale) across a number of different industries. Chicago leadership really invests the time to help staff succeed. Compensation and advancement very much weighted toward performance helps to make you feel like you're not just 'showing up', but have the ability to control your own success. Commission structure is lucrative at the higher brackets (up to 25% pay outs). Once proven, travel to other office locations/countries, attend events, or explore other divisions within the business are all possibilities. Cons Must be a self-starter. Don't expect to be apathetic and have your hand held. Management prioritizes helping those who help themselves first. Make sure you're managing your own expectations. This is an inside sales role. A lot is asked of management level personnel, as it should be. A managers primary function should be to maintain personal sales while training and developing our sales teams to do the same, but too much emphasis was placed on sales managers doing their own recruitment the last few years. Ultimately, this was a major contributing factor that lead me to explore other opportunities. On a more superficial note, every single computer in the Chicago office needs to be replaced. In my opinion, C-Level management needs to invest in a professional CRM tool/suite other than the MLM program our IT team developed. Advice to Management Chicago/Toronto leadership was fantastic during my tenure. However, unless you're Senior Dirctor or C-Level, chances are you've never met Marcus Evans the man. He is in Chicago fairly frequently. Marcus, why not put a face to the brand, very briefly address the office as a whole, and let staff get some messaging directly from the owner?", "rating": 5, "pros": "This was my first job after graduating college and I stayed on six and a half years. Speaking from a Conferences perspective, it's not account management. Very much a new business/hunter mentality required. Fast paced, open floor concept. Three month sales cycle keeps the markets/industries you're selling into fresh. Great training/process that gives you a foundational set of skills that will translate to whatever comes next on your own path. Everyone starts at the entry level and is only promoted from within. Personally, I achieved management in about two years and had the chance to work with some of the largest organizations in the world (Marathon, Chevron, Exelon, Raytheon, Northrop Grumman, Societe Generale) across a number of different industries. Chicago leadership really invests the time to help staff succeed. Compensation and advancement very much weighted toward performance helps to make you feel like you're not just 'showing up', but have the ability to control your own success. Commission structure is lucrative at the higher brackets (up to 25% pay outs). Once proven, travel to other office locations/countries, attend events, or explore other divisions within the business are all possibilities.", "cons": "Must be a self-starter. Don't expect to be apathetic and have your hand held. Management prioritizes helping those who help themselves first. Make sure you're managing your own expectations. This is an inside sales role. A lot is asked of management level personnel, as it should be. A managers primary function should be to maintain personal sales while training and developing our sales teams to do the same, but too much emphasis was placed on sales managers doing their own recruitment the last few years. Ultimately, this was a major contributing factor that lead me to explore other opportunities.", "advice": "Chicago/Toronto leadership was fantastic during my tenure. However, unless you're Senior Dirctor or C-Level, chances are you've never met Marcus Evans the man. He is in Chicago fairly frequently. Marcus, why not put a face to the brand, very briefly address the office as a whole, and let staff get some messaging directly from the owner?"}, {"title": "Amazing Sales Experience", "text": "Pros Better than an MBA in sales. Get the best from this Sales Team and value your experience. Never give up attitude. Cons Not for everyone. You might find it stressful.", "rating": 5, "pros": "Better than an MBA in sales. Get the best from this Sales Team and value your experience. Never give up attitude.", "cons": "Not for everyone. You might find it stressful.", "advice": null}, {"title": "Hard Work = Pay Off!", "text": "Pros Great young company, lots of travel, office activities Cons technology, management located in other countries (sometimes)", "rating": 5, "pros": "Great young company, lots of travel, office activities", "cons": "technology, management located in other countries (sometimes)", "advice": null}, {"title": "Scam", "text": "Pros Laid back interview process. People seem fun and nice. Cons Nothing like job description. No computers. You sit at a table with only a phone and have to read off a script. No microwave in break room. Awful pay Advice to Management Be transparent about the job up front. Provide a tour around the office so people know what they're getting into.", "rating": 1, "pros": "Laid back interview process. People seem fun and nice.", "cons": "Nothing like job description. No computers. You sit at a table with only a phone and have to read off a script. No microwave in break room. Awful pay", "advice": "Be transparent about the job up front. Provide a tour around the office so people know what they're getting into."}, {"title": "Sales executive", "text": "Pros Good work/life balance Good management Promotes by success Cons The base salary is insanely low", "rating": 5, "pros": "Good work/life balance", "cons": "The base salary is insanely low", "advice": null}, {"title": "good company to gain experience", "text": "Pros Marcus Evans has given the opportunity to truly hone my sales skills. They really take the time to welcome you into the company and train you step by step on mastering the sales process. What I enjoyed most about the job was the encouragement I received from upper management all the way up to the CEO, which truly showed you they cared. The work/life balance is incredible as its a very work hard play hard attitude. The company has sponsored happy hours were you get to interact with upper management at a more informal setting. One the best perks of the travel opportunities they provide to travel across North America and to HQ in London. Great for anyone looking to hone their management experience and grow within a company. Cons Technology could use some updating but beside that very little cons.", "rating": 5, "pros": "Marcus Evans has given the opportunity to truly hone my sales skills. They really take the time to welcome you into the company and train you step by step on mastering the sales process. What I enjoyed most about the job was the encouragement I received from upper management all the way up to the CEO, which truly showed you they cared. The work/life balance is incredible as its a very work hard play hard attitude. The company has sponsored happy hours were you get to interact with upper management at a more informal setting. One the best perks of the travel opportunities they provide to travel across North America and to HQ in London. Great for anyone looking to hone their management experience and grow within a company.", "cons": "Technology could use some updating but beside that very little cons.", "advice": null}, {"title": "Truth from a seasoned insider", "text": "Pros I worked at Marcus Evans for 10 years beginning in as an Entry level Sales Executive in 2006. I was encouraged by the fact that all people were hired at the same level I was being hired. For a “true” sales professional this is very important because it creates a fair and balanced playing field. It means that politics do not interfere with advancement for the individual. If you are successful at what you do you will advance. Period. Armed with this mentality I went through training and hit the sales floor. The open sales floor was one that motivated me. I could see who was working and who was pretending. This gave me the ability to easily seek out advise from the people producing as they did it in front of me daily. I was told in the interview I could make some serious money while advancing. I took this with a grain of salt as all sales companies claim this. Within 18 months I was amazed at how much money I was actually earning. I actually stopped one day and calculated my hourly pay. I was making more than they said I would make so I turned my focus towards sharpening my management skills within the group. They sent me off to London for paid management training. They also sent me on an all-expenses paid week long vacation as a reward for being the top seller in the USA my first year. By year three with the group I had held the position of Sales Executive, Senior Sales Executive, Team Leader, Assistant Sales Manager, Sales Manager, and Senior sales manager. On my three year anniversary with the group I was promoted to the highest position within summit sales. Sales Director. The interesting part about all of this is that I was given the exact road map of advancement in my very 1st interview and within three years I had lived it. I did my part. I worked very hard. They did their part. They kept their word and advanced me while paying me healthy commissions and bonuses. By year 8 I was managing multiple locations in the USA and abroad. This company defines “entrepreneurial grit” If you are looking for a salary to pay your bills please look elsewhere. This is a company that succeeds because it was built to give people who want to “own” something of their own, a place to live without worrying about all the normal overheads associated with owning your own business. The second thing that stands out is the product delivered to clients. At first I didn’t understand just how hard it was for companies to get qualified business meetings. When people walked up to me and told me how one of the meetings my summit secured for them made them hundreds of thousands I was amazed. Really? We are that good? YES, Marcus Evans is. The 1 on 1 meeting space has become a dime a dozen as everybody looks at Marcus Evans and says “oh that looks easy we can go do it on our own”. They quickly find out within a few years that it is NOT easy and they fold. To date I do not know of one Face to Face meeting company that can supply both Buyer and seller reference to deals closed. Marcus Evans is the only one who can and there are hundreds of examples to prove it. For years I watched people come on this very website and trash the company as scam. Or say that the company didn’t pay well. Or say the company couldn’t deliver. Some went as far to say as the company would force employees to write positive reviews. I quietly sat and watched the posts and chose not to respond. I didn’t want to fuel the fire and as an active employee actually running business units I was sure my post would carry little weight. Today however there is nothing in it for me. The reason I write this message is that I enjoyed my time at Marcus Evans. I made a lot of money at Marcus Evans. I had excellent sales training at Marcus Evans. I advanced at Marcus Evans. Most will ask why I left. Simple. I could afford financially to go out into the market place with a dream of mine. Without Marcus Evans I wouldn’t have the capital, experience, or freedom to do that at such a young age. Cons I do have some things that I see as areas the Marcus Evans group needs to address. I think they should screen employees better on the front end so that people who can’t sell, aren’t enthusiastic about networking with strangers, or are not truly entrepreneurial in spirit do not get hired. There is very cheap assessment software they could invest in to weed these people out. There were far too many people hired because we thought there was a “chance” they could make it but time at a place that requires 100% every day is no place for those looking to skate by. I also think the company could actually decrease the commission structure by 1% and use that to invest in better technology tools for the sales executives. 1% may not seem like much but I know what the top 20% make there. That 1% would buy millions worth of technology per year and the reps really wouldn’t feel that big of a hit. Either way if you are not investing in technology in today’s world your staff is not working at optimal levels. Advice to Management To evolve you must involve heavy investments in Tech. It is 2017", "rating": 5, "pros": "I worked at Marcus Evans for 10 years beginning in as an Entry level Sales Executive in 2006. I was encouraged by the fact that all people were hired at the same level I was being hired. For a “true” sales professional this is very important because it creates a fair and balanced playing field. It means that politics do not interfere with advancement for the individual. If you are successful at what you do you will advance. Period. Armed with this mentality I went through training and hit the sales floor. The open sales floor was one that motivated me. I could see who was working and who was pretending. This gave me the ability to easily seek out advise from the people producing as they did it in front of me daily. I was told in the interview I could make some serious money while advancing. I took this with a grain of salt as all sales companies claim this. Within 18 months I was amazed at how much money I was actually earning. I actually stopped one day and calculated my hourly pay. I was making more than they said I would make so I turned my focus towards sharpening my management skills within the group. They sent me off to London for paid management training. They also sent me on an all-expenses paid week long vacation as a reward for being the top seller in the USA my first year. By year three with the group I had held the position of Sales Executive, Senior Sales Executive, Team Leader, Assistant Sales Manager, Sales Manager, and Senior sales manager. On my three year anniversary with the group I was promoted to the highest position within summit sales. Sales Director. The interesting part about all of this is that I was given the exact road map of advancement in my very 1st interview and within three years I had lived it. I did my part. I worked very hard. They did their part. They kept their word and advanced me while paying me healthy commissions and bonuses. By year 8 I was managing multiple locations in the USA and abroad. This company defines “entrepreneurial grit” If you are looking for a salary to pay your bills please look elsewhere. This is a company that succeeds because it was built to give people who want to “own” something of their own, a place to live without worrying about all the normal overheads associated with owning your own business.", "cons": "I do have some things that I see as areas the Marcus Evans group needs to address. I think they should screen employees better on the front end so that people who can’t sell, aren’t enthusiastic about networking with strangers, or are not truly entrepreneurial in spirit do not get hired. There is very cheap assessment software they could invest in to weed these people out. There were far too many people hired because we thought there was a “chance” they could make it but time at a place that requires 100% every day is no place for those looking to skate by. I also think the company could actually decrease the commission structure by 1% and use that to invest in better technology tools for the sales executives. 1% may not seem like much but I know what the top 20% make there. That 1% would buy millions worth of technology per year and the reps really wouldn’t feel that big of a hit. Either way if you are not investing in technology in today’s world your staff is not working at optimal levels.", "advice": "To evolve you must involve heavy investments in Tech. It is 2017"}, {"title": "Great Opportunity and Sales Training", "text": "Pros - The sales training, global trainings, the real-time trainings, - The environment is very collaborative - Always promotes from within - Promotions based off performance not seniority - The product is great, it works and have 80 - 90% retention rate with clients - Incentive Trips, Bonuses, commissions Cons - Doing a lot of the same thing everyday; most jobs are like that - Base pay could be a bit more. Advice to Management Keep with the trainings,", "rating": 5, "pros": "- The sales training, global trainings, the real-time trainings,", "cons": "- Doing a lot of the same thing everyday; most jobs are like that", "advice": "Keep with the trainings,"}, {"title": "Inside Sales Rep", "text": "Pros fun company events, healthcare, 401k, and free coffee/tea, building location, Cons tedious work atmosphere, low energy, skeptical of pay structure", "rating": 3, "pros": "fun company events, healthcare, 401k, and free coffee/tea, building location,", "cons": "tedious work atmosphere, low energy, skeptical of pay structure", "advice": null}, {"title": "Conference Producer", "text": "Pros Interesting projects. Great exposure to big companies and top executives. As producer you have great control on the flow of the event, the agenda and speaker selection. It is an enriching experience. Cons Toxic company culture, low base salary. Outdated technology, equipments. The only barometer of your value will be the revenue your events generate, nothing else. Bare minimum benefits package.", "rating": 3, "pros": "Interesting projects. Great exposure to big companies and top executives. As producer you have great control on the flow of the event, the agenda and speaker selection. It is an enriching experience.", "cons": "Toxic company culture, low base salary. Outdated technology, equipments. The only barometer of your value will be the revenue your events generate, nothing else. Bare minimum benefits package.", "advice": null}, {"title": "Worst company in the world", "text": "Pros Just unbelievable how bad and ruthlessly evil Marcus Evans is. Cons The company is evil-- they create a toxic work environment in hopes you quit as soon as possible so that they can steal the leads you have generated. New hires are lead generator donkeys to be yelled at and abused in front of the entire office staff and then summarily fired so that they can steal your leads and pocket your commission. Managers know only one thing- get you to provide hundreds of leads every week and get you on the phones to warm up the leads. Then they call your lead without your knowledge and close the deal and steal your commission. At Marcus Evans the managers are thieves. Worst CEO in the world. He sits in the back office and comes out to take attendance every day and then harass and intimidate and threaten the workers who actually showed up. Calling in sick 2 or 3 times a week is the only way to stay off the CEO's radar. Otherwise he will abuse you ridicule you in front of the entire staff and pray you quit so he can hire someone else and steal their leads and commissions. Marcus Evans hires and then fires 20% of their sales force every 3 weeks. The average new hire lasts less than 2 weeks. They want you on the phones warming up the leads you spent dozens of hours a week generating so that the manager can call your warmed up lead and steal your deal. Abusive management. The company is clearly a scam and we lie to the clients all day long. We lie to them about the cost and about who will be attending the Summit business meetings. We lie about the success rate of the few clients we had in the past. I personally lied to every single CEO I got on the phone dropping names of executives that we never really worked with. We say we have worked with so and so in the past but it is a lie. The work day is 12 hours long and you are required to make 150 calls a day otherwise you are fired. In an office of 15 people 10 of them quit or were fired after just 3 months! The turnover rate is over 200% a year. The high turnover is the business model. Its a pyramid scheme. Every 3 weeks Marcus Evans in New York hires 4 new people and then fires 4. Every 3 weeks expect a new group to come in to replace you. As I said expect to be abused until you quit. The people who stay are the losers. At Marcus Evans its the winners that quit. Why would anyone want to work for a corrupt company? As a project executive the managers steal your leads then steal your deal and pocket your commission all the while while you are lying to the client and ripping them off Marcus Evans is doing the same to you. Advice to Management Dont you think the FBI is on to your scheme?", "rating": 1, "pros": "Just unbelievable how bad and ruthlessly evil Marcus Evans is.", "cons": "The company is evil-- they create a toxic work environment in hopes you quit as soon as possible so that they can steal the leads you have generated.", "advice": "Dont you think the FBI is on to your scheme?"}, {"title": "Sponsorship Sales Executive", "text": "Pros I honestly worked for 4 days only in the Miami office. The interview porcess was neutral. Once I got hired, I focus on research for leads and had very little trainning from my manager. The reason why I left so early is beacause this office showed me the worst unprofessional people I have ever seen. Just upon my arrival I saw a manager trying to make out with his coworker right before everyones' eyes. Looked normal for everybody else. Also, everybody was cursing to each other on a regular basis like it was nothing. I understand this is a sales job but you've got to show some level of respect. I didn't bother to find out if you can make money or not. Cons Low base pay. Unprofessional evironment Very little trainning No sources for research. You are on your own. I wouldn't recommend you to work here. Period. Advice to Management Be professional and respect each other.", "rating": 1, "pros": "I honestly worked for 4 days only in the Miami office. The interview porcess was neutral. Once I got hired, I focus on research for leads and had very little trainning from my manager. The reason why I left so early is beacause this office showed me the worst unprofessional people I have ever seen. Just upon my arrival I saw a manager trying to make out with his coworker right before everyones' eyes. Looked normal for everybody else. Also, everybody was cursing to each other on a regular basis like it was nothing. I understand this is a sales job but you've got to show some level of respect. I didn't bother to find out if you can make money or not.", "cons": "Low base pay.", "advice": "Be professional and respect each other."}, {"title": "yuk", "text": "Pros Unlimited opportunity for a rookie sales person Cons Trainers are not always on time, on point. Fuzzy on what \"works\" in a performance environment. Constant monitoring of sales calls with interruptions if you go off script I felt like a trained chimp Using fake names? I am not going to falsify who I am and what I represent to a client Advice to Management Step into the boiler room and check on what managers are actually doing. Results at any cost will bight you eventually", "rating": 1, "pros": "Unlimited opportunity for a rookie sales person", "cons": "Trainers are not always on time, on point. Fuzzy on what \"works\" in a performance environment. Constant monitoring of sales calls with interruptions if you go off script", "advice": "Step into the boiler room and check on what managers are actually doing."}, {"title": "Not a great experience", "text": "Pros Willing teammates, nice office, friendly employees Cons Outdated computers, Not enough computers for everyone, Will have you use your personal LinkedIn accounts to find leads", "rating": 3, "pros": "Willing teammates, nice office, friendly employees", "cons": "Outdated computers, Not enough computers for everyone, Will have you use your personal LinkedIn accounts to find leads", "advice": null}, {"title": "Junior Sales Executive", "text": "Pros -They basically hire anyone. -Every once in awhile you will get put on a good event, and make okay money. -It's basically impossible to get fired, like honestly you could probably go an entire year without making a sale, and they would just keep giving you warnings. -If you don't feel like going in to work for a month just call in the morning before, and they will welcome you with open arms whenever you feel like going back. Cons -In the interview you will be told this is a \"performance driven role\". This is code for we pay you terribly because nobody other than the managers actually make sales. -Most employees leave within a month, many within their first week. -People who run the divisions are great salesman, but leaders who know how to effectively run a department? Not so much. -When you interview they will tell you that an average performer can expect around $40k in their first year, but from my experience the top salesman won't make more than $30k. That's a fairly significant difference, average performer probably makes $25k. -Many times you are put on events that are poorly produced with little market interest, and are basically told to \"deal with it\". -Business model is essentially hire as many people as possible in hopes that someone might get lucky, and actually pull in new business. Advice to Management -Raise the base salary to actually attract decent employees. -If you can't get employees to stay for more than a couple months, maybe the issue is the leadership as opposed to \"soft\" new hires. -Stop posting fake reviews to this website to try and balance out all the negative ones. It's very obvious and honestly pathetic.", "rating": 1, "pros": "-They basically hire anyone.", "cons": "-In the interview you will be told this is a \"performance driven role\". This is code for we pay you terribly because nobody other than the managers actually make sales.", "advice": "-Raise the base salary to actually attract decent employees."}, {"title": "account representative", "text": "Pros you can make great money Cons high turnover because high stress Advice to Management be fair to all employees", "rating": 3, "pros": "you can make great money", "cons": "high turnover because high stress", "advice": "be fair to all employees"}, {"title": "Conference Producer", "text": "Pros Slow pace, Good Life-work balance, nice environment. Young people. Mid-level managers are awesome, social activities are great, if you don't have any experience and just graduated from college is a good opportunity but don't stay long time. Nice location at the NBC Tower in Chicago downtown, travel opportinities Cons the lowest salaries ever, barely growing opportunities, basic benefits package, there is any possibility to work from home, dressing code, no microwave at the office, insurance could be better", "rating": 3, "pros": "Slow pace, Good Life-work balance, nice environment. Young people. Mid-level managers are awesome, social activities are great, if you don't have any experience and just graduated from college is a good opportunity but don't stay long time. Nice location at the NBC Tower in Chicago downtown, travel opportinities", "cons": "the lowest salaries ever, barely growing opportunities, basic benefits package, there is any possibility to work from home, dressing code, no microwave at the office, insurance could be better", "advice": null}, {"title": "Codl Calling", "text": "Pros Great people, working in teams, fast pace Cons Cold Calling, commission based, can be slow Advice to Management N/A", "rating": 3, "pros": "Great people, working in teams, fast pace", "cons": "Cold Calling, commission based, can be slow", "advice": "N/A"}, {"title": "Whirlwind Experience. Not Perfect but Darn Good.", "text": "Pros IMPORTANT - Marcus Evans is extremely decentralised. The experience of an employee in one business unit is not likely to have any relation to what you might experience in another business unit. In Chicago there is a GM that encourages office socialising, but otherwise do not expect to interact with other Divisions. With that being said, these comments are specific to the Summit's Delegate Acquisition Division & Department. * Incredible opportunities to travel around the country especially places like Las Vegas, Florida, and California! * All-expense paid work trips to 5 star resorts like Ritz Carlton, Waldorf Astoria, & Four Seasons. * The best sales training an inside B2B sales rep could ask for. * Exposure to C-suite executives across various Fortune 1000 industries which is a crash course in helping you figure out what industry you might want to work in next. * I had multiple opportunities to travel abroad with the company, but those are reserved for the top 10% performers or senior management. * Exceptional, consistent brand image. * The best product I've ever sold. I genuinely and deeply believe in the quality of the Summit business model and know how much it's helped my clients. It's a great product. * Rapid growth opportunity * Ability to earn your own paychecks * Some of the most wonderful colleagues in the world. In the decade I worked at Marcus Evans I met many friends I will have for a lifetime, but 4 people in particular who my life would feel incomplete without. If this company recruits that quality of people they are doing something right! Cons * The Summits CEO in Cyprus is not a nice person and will throw a colleague under the bus without blinking an eye. It's quite sad because he overshadows the many, many spectacular people in the company. * You cannot make a top-tier wage if you are only willing to work 40 hours a week. It's just not possible if you are only putting in the bare minimum effort and, unfortunately, a lot of the managers are forced to cultivate a culture of mediocrity because lazy employees are litigious. Do not take this job if you are going to whine about having to work hard. You don't deserve it. * Only a con if you are a whimp! This is a 24-hour sales cycle. If you are afraid to ask for business over the phone on the first call, you don't have the right stuff for this role. I loved my time at ME and valued the pros and the cons as the learning experiences that prepared me for my next role. Don't believe everything you read on Glassdoor or other sites. Most of the negative reviews are from people that didn't have the work ethic, tenacity, or passion to do the role in the first place. The company is not perfect, but it's a good place to grow. Advice to Management Marcus - spend more time being the face of the company to your employees. We simply want to hear your vision, from you. Ban excessive office supplies and use that very wasteful budget to upgrade and expand the access to electronics for all employees.", "rating": 5, "pros": "IMPORTANT - Marcus Evans is extremely decentralised. The experience of an employee in one business unit is not likely to have any relation to what you might experience in another business unit. In Chicago there is a GM that encourages office socialising, but otherwise do not expect to interact with other Divisions.", "cons": "* The Summits CEO in Cyprus is not a nice person and will throw a colleague under the bus without blinking an eye. It's quite sad because he overshadows the many, many spectacular people in the company.", "advice": "Marcus - spend more time being the face of the company to your employees. We simply want to hear your vision, from you."}, {"title": "Old School Sales", "text": "Pros Nice coworkers, always looking to help when asked for. Not co-managed when doing work for the most part. Cons Very old school process when going about sales. Won't accept new ways to work towards selling to clients. Advice to Management Be open to new ways to go about selling. Cold calling CEO's and C-level executives is becoming an ancient practice.", "rating": 3, "pros": "Nice coworkers, always looking to help when asked for. Not co-managed when doing work for the most part.", "cons": "Very old school process when going about sales. Won't accept new ways to work towards selling to clients.", "advice": "Be open to new ways to go about selling. Cold calling CEO's and C-level executives is becoming an ancient practice."}, {"title": "Sales Executive", "text": "Pros The compensation package is comprised of a base salary, uncapped commissions and bonuses. We have yearly incentive trips, and true organic growth which gives us excellent earning and advancement potential. Everything is very clear and transparent about what you need to do to be successful and you are given all of the tools/ support to do this. I took this role for this reason and have been with the company for 5+ years now. As a solutions provider sales representative you develop and build your own client base utilizing proven sales techniques including research, prospecting, probing, lead generation and closing. We have the opportunity to travel to domestic and international office locations and also attend events all over the world. Opportunity being the key word- you are not just handed clients/ accounts. To be successful you need to have grit, intelligence, patience and unequivocal persistence. Cons If you are looking for an easy role where you can live off a steady base salary then this is not the job for you. You have to be prepared for failure, let it motivate you and expect nothing but the best from yourself. Failure is an inevitable part of the job, but so is success. You have to learn to control your emotions and be regimented in terms of process and mindset. Advice to Management Be more selective when hiring", "rating": 5, "pros": "The compensation package is comprised of a base salary, uncapped commissions and bonuses. We have yearly incentive trips, and true organic growth which gives us excellent earning and advancement potential. Everything is very clear and transparent about what you need to do to be successful and you are given all of the tools/ support to do this. I took this role for this reason and have been with the company for 5+ years now.", "cons": "If you are looking for an easy role where you can live off a steady base salary then this is not the job for you. You have to be prepared for failure, let it motivate you and expect nothing but the best from yourself. Failure is an inevitable part of the job, but so is success. You have to learn to control your emotions and be regimented in terms of process and mindset.", "advice": "Be more selective when hiring"}, {"title": "Great for entry level sales", "text": "Pros Management and People you work with are great Great Training Cons Low Base Pay Unorganized No CRM database Management only has a computer so wasting a lot of time when doing research", "rating": 3, "pros": "Management and People you work with are great", "cons": "Low Base Pay", "advice": null}, {"title": "Sales Manager, NYC, 2000- Last Year does NOT go back far enough...=(", "text": "Pros Fun, young energy there, enjoyed working with some of the managers; also made some GREAT connections with co-workers. Cons Too many to mention from the following: penny-wise pound foolish-seem to rather have turnover than to keep OTHERWISE TERRIFIC hires, give opportunities for growth etc. Advice to Management Really FOCUS on KEEPING those hired and DEVELOP, DEVELOP, DEVELOP them! THEY are ME's FUTURE- How can this be emphasized MORE here and in MANY places?", "rating": 3, "pros": "Fun, young energy there, enjoyed working with some of the managers; also made some GREAT connections with co-workers.", "cons": "Too many to mention from the following: penny-wise pound foolish-seem to rather have turnover than to keep OTHERWISE TERRIFIC hires, give opportunities for growth etc.", "advice": "Really FOCUS on KEEPING those hired and DEVELOP, DEVELOP, DEVELOP them! THEY are ME's FUTURE- How can this be emphasized MORE here and in MANY places?"}, {"title": "Conference Producer", "text": "Pros It was an interesting position. Cons It was a difficult position. Advice to Management Give Producers more freedom.", "rating": 3, "pros": "It was an interesting position.", "cons": "It was a difficult position.", "advice": "Give Producers more freedom."}, {"title": "Great training, great team, low base", "text": "Pros Training, Team, Office Dynamics, Competitiveness, Motivation Cons Low pay, KPI bonus (Key Performance Indicators) difficult to achieve Advice to Management Offering unattainable KPI incentives is pointless", "rating": 5, "pros": "Training, Team, Office Dynamics, Competitiveness, Motivation", "cons": "Low pay, KPI bonus (Key Performance Indicators) difficult to achieve", "advice": "Offering unattainable KPI incentives is pointless"}, {"title": "Good place", "text": "Pros You learn a lot and get much out of it's Cons When you have a bad event the day can be long. Advice to Management Make sure everyone is focused on winning!", "rating": 5, "pros": "You learn a lot and get much out of it's", "cons": "When you have a bad event the day can be long.", "advice": "Make sure everyone is focused on winning!"}, {"title": "If you are looking for a fun office experience this is NOT for you", "text": "Pros Every first Friday of the month you may dress down. Cons You only get paid once a month. In January you don't receive a pay check unless you made a sale at the end of December. Stuck at your desk for 8 hours. No easy way to meet people around the office.", "rating": 1, "pros": "Every first Friday of the month you may dress down.", "cons": "You only get paid once a month. In January you don't receive a pay check unless you made a sale at the end of December. Stuck at your desk for 8 hours. No easy way to meet people around the office.", "advice": null}, {"title": "Click", "text": "Pros Stable steady checks, good hours Cons Too little pay, too much work", "rating": 3, "pros": "Stable steady checks, good hours", "cons": "Too little pay, too much work", "advice": null}, {"title": "Senior Sales Executive", "text": "Pros Tough job and can take time to become good but once the deals start coming in you can make a lot of money! Since it's a very competitive job and a tough sell, other employers have high regard for those who have succeeded. Get to go to the events in style Cons Get paid once a month can be a bit annoying. If you want to do well then it will be longer than 9-5. Advice to Management Get paid fortnightly Employ some more Australians they are really cool ppl", "rating": 5, "pros": "Tough job and can take time to become good but once the deals start coming in you can make a lot of money!", "cons": "Get paid once a month can be a bit annoying.", "advice": "Get paid fortnightly"}, {"title": "Sales Executive", "text": "Pros I took the job because of the business model and the training. The products/services a company has to offer its clients is big with me. I have been in sales for over a decade and I have been paid good money to sell bad products to good people. No matter what the monetary incentive is, if your product isn’t effective and you cannot back up what you promise your clients, I don’t care how much base + commissions I am making, eventually I will lose conviction, feel bad and suffer. To the contrary, when you have a great product to sell and you KNOW you can seriously help people grow their business in a more time-efficient, cost-effective way, you can sell with passion and conviction. Along with this belief came the training. There is a very clear process and methodology that is trained on in perpetuity. This on-going development is critical to success and I believe the mentorship at Marcus Evans is second to none. Cons This is a fast-paced environment and the corporate culture and training can be overwhelming at times. You have to learn to be proficient in cold calling, lead research and industry knowledge related to the market you are selling into; ie. Legal, Investments, Healthcare, Aerospace & Defense… The base is low and the commissions are high, which can intimidate people who are used to getting paid to not work smart or sell. For others it can be a motivator in that it is a performance-based position so the compensation is reflective of the culture. Not for everyone, especially for slow learners or people with short-stamina-motivation. You have to fail in order to learn how to succeed. Most people who learn our business model are so gung-ho and raring to get out the gate, yet after a few days or weeks on the phone they start making excuses and eventually their “grandma gets sick”…LOL…and they either quit or get let go. The few that make it through the first 4-6 months end up making six-figures in their first year. Advice to Management Do a better job recruiting strong, talented sales people and/or strong, motivated learners. Work on your filtration process to weed out people with entitlement issues. Giving them a chance will only lead to need to frustration and online complaints.", "rating": 5, "pros": "I took the job because of the business model and the training. The products/services a company has to offer its clients is big with me. I have been in sales for over a decade and I have been paid good money to sell bad products to good people. No matter what the monetary incentive is, if your product isn’t effective and you cannot back up what you promise your clients, I don’t care how much base + commissions I am making, eventually I will lose conviction, feel bad and suffer. To the contrary, when you have a great product to sell and you KNOW you can seriously help people grow their business in a more time-efficient, cost-effective way, you can sell with passion and conviction. Along with this belief came the training. There is a very clear process and methodology that is trained on in perpetuity. This on-going development is critical to success and I believe the mentorship at Marcus Evans is second to none.", "cons": "This is a fast-paced environment and the corporate culture and training can be overwhelming at times. You have to learn to be proficient in cold calling, lead research and industry knowledge related to the market you are selling into; ie. Legal, Investments, Healthcare, Aerospace & Defense… The base is low and the commissions are high, which can intimidate people who are used to getting paid to not work smart or sell. For others it can be a motivator in that it is a performance-based position so the compensation is reflective of the culture. Not for everyone, especially for slow learners or people with short-stamina-motivation. You have to fail in order to learn how to succeed. Most people who learn our business model are so gung-ho and raring to get out the gate, yet after a few days or weeks on the phone they start making excuses and eventually their “grandma gets sick”…LOL…and they either quit or get let go. The few that make it through the first 4-6 months end up making six-figures in their first year.", "advice": "Do a better job recruiting strong, talented sales people and/or strong, motivated learners. Work on your filtration process to weed out people with entitlement issues. Giving them a chance will only lead to need to frustration and online complaints."}, {"title": "Conference Producer", "text": "Pros None. The work they will actually have you doing everyday (90% cold calling, the other 10% nonsense) is not discussed at all until you are thrust into a three day 'training' which is supposed to prepare you to be successful within the role day 1. Cons I highly advise people NOT to work here. Ridiculously high turnover rate. The company does not care about its employees and treats them like second class citizens. The pay is ridiculous horrible and the 'generous bonus structure' they speak of is all lies.", "rating": 1, "pros": "None. The work they will actually have you doing everyday (90% cold calling, the other 10% nonsense) is not discussed at all until you are thrust into a three day 'training' which is supposed to prepare you to be successful within the role day 1.", "cons": "I highly advise people NOT to work here. Ridiculously high turnover rate. The company does not care about its employees and treats them like second class citizens. The pay is ridiculous horrible and the 'generous bonus structure' they speak of is all lies.", "advice": null}, {"title": "Sales Executive", "text": "Pros This is an entrepreneurial opportunity, but you have to have a high level of drive, accountability, and understand the value of failure and success. Do not be persuaded by disgruntled employees who couldn’t make the cut, and want to blame everyone else but themselves. Yes, the base is lower than other sales jobs, but the commission based off performance is great and room for growth is based on merit. I too had hesitations after reading all the posts, but my best suggestion is to make your own assessment. Not saying its a fit, but its worth pursuing an interview and learning more The business model is fantastic, and clients absolutely love it. They invest an average $50k - $200k in a 12-18month period, which speaks for itself and creates great income opportunity. Once you find success (ave 2-4 months), your clients create reoccurring revenue, which adds to the base. Getting clients is tough, and you have to be motivated an unafraid to fail. If you believe in yourself and plan to work hard you will be successful. Cons The first 3-6 months is a battle. High learning curve. Failure is inevitable. If you’re looking for easy, then stay away. There are so many things to focus on to be successful, which can be overwhelming at times. You have to be great at research, which most sales people are not. Suggested research categories are provided, so that can be a bad and a good thing depending on who you are. I love it. The base is lower, so you have no choice but to work hard and perform. Most people do not like that, which is why they get fired or leave. Advice to Management As in life, only certain people will succeed. Be picky with who you hire to avoid weak reps posting things that drive good people away. There may be a better way to structure the income over the first few months.", "rating": 5, "pros": "This is an entrepreneurial opportunity, but you have to have a high level of drive, accountability, and understand the value of failure and success. Do not be persuaded by disgruntled employees who couldn’t make the cut, and want to blame everyone else but themselves. Yes, the base is lower than other sales jobs, but the commission based off performance is great and room for growth is based on merit.", "cons": "The first 3-6 months is a battle. High learning curve. Failure is inevitable. If you’re looking for easy, then stay away. There are so many things to focus on to be successful, which can be overwhelming at times. You have to be great at research, which most sales people are not. Suggested research categories are provided, so that can be a bad and a good thing depending on who you are. I love it. The base is lower, so you have no choice but to work hard and perform. Most people do not like that, which is why they get fired or leave.", "advice": "As in life, only certain people will succeed. Be picky with who you hire to avoid weak reps posting things that drive good people away. There may be a better way to structure the income over the first few months."}, {"title": "Almost no redeeming qualities", "text": "Pros You learn to be comfortable hammering the phone constantly, talking to strangers to try to convince them to buy a pass to your conference. If you can sell here you can sell anywhere. Cons Low base salary ($1000/month) If you get stuck on a bad conference you can't earn commission No direct deposit and minimal benefits Limited growth opportunity You are encouraged to lie cheat and steal in order to close the sale Since the culture is to do whatever it takes to close the deal, you cannot trust managers or co-workers to do anything but the most cutthroat option You must arrive at 8, you cannot take lunch except from 12-1, you have to stand making calls during \"power hour\"; in short you are treated like a child Advice to Management Ease up on the control; hire actual adults and you won't have to supervise them so closely; build better conferences so people don't have to lie to close the deal; treat employees with respect and build in more transparency with sales so managers who cheat the system don't get away with it", "rating": 1, "pros": "You learn to be comfortable hammering the phone constantly, talking to strangers to try to convince them to buy a pass to your conference. If you can sell here you can sell anywhere.", "cons": "Low base salary ($1000/month)", "advice": "Ease up on the control; hire actual adults and you won't have to supervise them so closely; build better conferences so people don't have to lie to close the deal; treat employees with respect and build in more transparency with sales so managers who cheat the system don't get away with it"}, {"title": "Project Executive", "text": "Pros -Great work environment -Managers were top notch, well educated and seasoned leaders -Interesting topics on events made it easy and fun to complete research Cons -Tough to sell if event is a bad market -Days can drag on if you do not make any sales Advice to Management -Ask project executives what they are interested in and put them in events more to their liking", "rating": 5, "pros": "-Great work environment", "cons": "-Tough to sell if event is a bad market", "advice": "-Ask project executives what they are interested in and put them in events more to their liking"}, {"title": "Believe me, you are better than this.", "text": "Pros You get to tell people you work at the NBC building. Little do they know. If you work at the Chicago branch you'll probably develop a healthy amount of hatred for the British accent. You get to change your Linkedin job title to \"Project Executive\", knowing very well you are a mere Sales Rep. Cons Pretty much everything. Don't get it twisted. This an all day cold calling gig. Try imagining that before you accept the job offer. You are tricked into thinking you are about to join a \"world class\" company with endless opportunities for growth. And to be honest, they had me fooled. The fancy building and the shiny reception area are just a deliberate facade. As soon as you get on that sales floor you realize what a horrible mess you got yourself into. They let pretty much anyone through those doors. And I mean ANYONE. As long as you can speak in full sentences and have a pulse. At first I thought that passing the interview stage was an achievement on my part. Sadly, no! It was an achievement on the side of management as they have once again tricked another poor soul into being a temporary cog in the machine. The managers seem so nice at first - only for the first few days up until they chain you to a desk and phone. From then on its extreme micromanaging and getting humiliated and demeaned in front of the entire sales floor for making honest mistakes that come with the territory. The managers, OMG the managers! Almost all of them are on a power trip and look depressingly unhappy. They pick their favorites and shun everyone else who is not lucky enough to land a sale. I worked there for several months, and after the first week they stopped responding to a courteous \"good morning\" whenever we crossed paths. THEY ACT LIKE YOU DON'T EXIST. But if you are lucky enough to make a sale their attitude towards you changes almost instantly and they come around and give you high fives. And then its back to business as usual. They don't care about people. They only care about ringing that hypnotic bell. I've seen some managers go months without a sale. And the poor sales reps (Project Executives lol) sit there and do 120+ dials a day and someone is considered very lucky if a prospect falls for their deceptive pitch and actually books a seat. People go for long dry months without a sale. Its really sad and discouraging. The managers, on the other had, at least some of them, make sales ALL THE TIME. They have been there long enough to rig the system in their favor. They rely on the leads generated by the sales reps that come and go, and they also have the freedom to email clients whenever they want. Oh, and you are NOT ALLOWED to send out an email to a potential client without a manager's approval. They actually fire people over that. That's how intense the micromanaging goes. Almost everything you do has to be approved by someone. Most of the time you will feel like your hands are tied as you lose opportunities that could have ended up in a sale. Sometimes the managers actually YELL stuff to sales reps while they are on the phone with clients: \"say this\" \"say that\"! Very distracting and annoying. You are given a desk and a phone. No computer. You are allowed to use the assigned research computers for an hour each day. The rest of the time you are \"smiling and dialing\". The computers are very outdated. Only managers have the high privilege of having a computer at their desk. This is madness! It's a one dimensional job. Very monotonous! Same grind - day in day out. The turnover rate is through the roof. The entire time I was there I didn't meet one person that actually enjoys working there. Everyone is always talking about how they want to find something else. It's a survival job. Yes, some people stick with it and inch up the ladder. But by the time they become managers, or any of the other meaningless titles like 'senior' or 'team champ', they've been turned bitter and grumpy. And thus the cycle continues. Lunch is at 12:00 for everyone, everyday. No exceptions. \"High school, is that you?\" The base salary is insulting. If you aren't making at least 3 sales a month, which is almost completely unrealistic, you walk away with a little over $1000 per month. Managers actually go around the desks on pay day and TOSS and FLING the pathetic paper cheques in the employees' faces. #respectdoesntlivehere You are disposable, that is what the managers make very clear to you as soon as you start this job. And they never miss a beat when it comes to reminding you either. The faces around you keep changing so fast at Marcus Evans it's hard to remember who's who. You'll meet very good and funny people. But they'll be gone quicker than you can pick up the phone. The reception area is always populated by oblivious applicants waiting nervously for their interview. This is almost a daily occurrence. I've never seen anything like this! Managers are obsessed with meetings. They call a meeting almost everyday just to nag the team about stats and about how \"you aren't following the process\". I'm not sure about it but I think there are some shady things happening behind the doors at Marcus Evans. The company itself keeps getting sued for fraud. Something is rotten and it reeks. You aren't even allowed to tell people on the phone that you are with Marcus Evans. You literally have to make an effort to avoid saying \"Marcus Evans\" during the call. They lie to you during training that it is because one can never be sure about how the company is perceived by people. I think the truth is the exact opposite. The company obviously has a bad reputation and they want to close the sale before the client does some digging. That's why URGENCY is such a fundamental sales tactic for them. If you like being openly disrespected, degraded, and demeaned on a daily basis then this is the perfect job for you! And yes, of course, if luck is on your side you can make money here. But it is never consistent. You can have one or two good months and then go 4 months of just punching the clock and taking home a pathetic cheque. Advice to Management Invest in your staff! It might bring down the high turnover rate. Just maybe, though. Invest in modern technology! Be transparent with staff and clients! Be respectful of your employees. Don't let worldly corporate titles get to your head. You still have to be respectful. You expect respect so give it! It'll come back to you. Be flexible about lunch times. GET A MICROWAVE FOR YOUR EMPLOYEES!!! They have to stand in line in the building next door just to warm up their food - taking 20mins of their lunch! Come on! At least pretend like you care about people. Paper cheques? Really?! Let's just go back to the barter system. Find a way back to your soul. Nurture relationships with people. Don't just use them and lose them.", "rating": 1, "pros": "You get to tell people you work at the NBC building. Little do they know.", "cons": "Pretty much everything.", "advice": "Invest in your staff! It might bring down the high turnover rate. Just maybe, though."}, {"title": "Great Sales Training", "text": "Pros Great training fun people to work with Cons long hours for the pay Advice to Management be patient with employees", "rating": 3, "pros": "Great training fun people to work with", "cons": "long hours for the pay", "advice": "be patient with employees"}, {"title": "Sales Executive", "text": "Pros If you are willing to live off $1,000/month for at least 3 months then go for it. You might get to travel but that's only if your number are good---but this isn't a vacation or a complimentary visit, you are expected to work all day long. Take it as a learning experience for what working downtown feels like and what your next job shouldn't be. Cons You won't know what you actually are going to do until the first day of training when they explain it through a series of classroom sessions. To save you some time; they sell tickets to a business summit. You get money by the number you sell. And you get those sales by making 100-150 calls a day---calls that are generated by you (using LinkedIn, Google, etc....) The training is 3 days which is thought by the managers, managers who spend 3 days with you, have lunch with you....yet once training is over, they act like they don't know you. After the initial 3 days, you are supposed to fill out an \"anonymous\" survey of what you learned thus far. But at least for me, it wasn't anonymous because there was a manager in the room as we filled it out. They think they offer this great product but no one knows what Marcus Evans is. When you actually make a call you are instructed to NOT say you are calling from Marcus Evans. Which does not make sense, since one would think people would want this product----they have been around for 30+years but do absolutely no marketing to get their name out there. You won't actually see the sales floor or get your \"desk\" until the 4th day. I say \"desk\" cause it's not really yours, you move around so much and you don't actually get a computer. Computers are only for managers. You have to share a computer when you want to do research. And all these computers, even the ones managers use, are out of the Stone Age. For a company that proclaims to be so successful, one would think they would invest in some new technology for their employees. Most have to do leads and research on paper! The sales floor is a telemarking room! All fog! They will trick you with the appearance of the NBC building and it being a \"professional\" business. But you start making a salary of 18,000--that's $1000 a month! And because you won't really know the process of how to sell, realistically you won't make any good money until \"it clicks\"----that ranges from 3-6 months. That's the worst part; the base pay. If you have some money saved or are living at your parents, this might work for you. Oh, 1 more thing: it's a paper check, they do not offer direct deposit, cause they are too cheap to pay for it. Advice to Management Change everything, from top to bottom.", "rating": 1, "pros": "If you are willing to live off $1,000/month for at least 3 months then go for it.", "cons": "You won't know what you actually are going to do until the first day of training when they explain it through a series of classroom sessions.", "advice": "Change everything, from top to bottom."}, {"title": "Conference UK", "text": "Pros they're aren't many. some international opportunity Cons pay, lack of IT, outdated process for client payment and sales cycle Advice to Management automatic online pay for clients, re evaluating pay structure and benefits", "rating": 3, "pros": "they're aren't many. some international opportunity", "cons": "pay, lack of IT, outdated process for client payment and sales cycle", "advice": "automatic online pay for clients, re evaluating pay structure and benefits"}, {"title": "Run if Marcus Evans calls you", "text": "Pros I can't think of one. Honestly it's a complete smoke show. Cons Too many to list.... They hire anyone who says yes. Most longer tenured employees(which are very few) are either stuck there or are looking elsewhere Advice to Management Management is part of the ponzie like scam they got going on. Just stay away", "rating": 1, "pros": "I can't think of one. Honestly it's a complete smoke show.", "cons": "Too many to list.... They hire anyone who says yes. Most longer tenured employees(which are very few) are either stuck there or are looking elsewhere", "advice": "Management is part of the ponzie like scam they got going on. Just stay away"}, {"title": "Indented Servent", "text": "Pros None and Nons and None and really None Cons Modern Day Feudalism, the worst micro managed company that you could imagine, tons of closed door secrets! Advice to Management retire while your ahead, only going to get worst and not better", "rating": 1, "pros": "None and Nons and None and really None", "cons": "Modern Day Feudalism, the worst micro managed company that you could imagine, tons of closed door secrets!", "advice": "retire while your ahead, only going to get worst and not better"}, {"title": "If you are desperate, this will be better than McDonald's at least", "text": "Pros There's a lot of opportunity to learn if you're fresh out of college or never worked in the corporate world. You'll get hands on experience developing and improving a variety of skill sets that are attractive to other employers. If this is your first job and you're desperate, go for it, but know that if you're college educated, hard working, and not a felon, you'll quickly outgrow this place and be suitable for much better. You'll likely make some friends at this company. But be careful because most act like high schoolers with their drama. Depending on what you do and what division you're in, you get to travel to some amazing places. But once you're there, you'll be working so hard you won't really get to enjoy it. You'll learn about a variety of different industries and meet leaders/decision makers who could potentially hire you once you're ready for a real job. Take advantage of networking with the people you meet!!!! The office GM tries really hard to make the environment fun which is cool but he could fight a little harder for real change and not just social activities and happy hours. There will be things you love about this job but they're random perks that shouldn't be reasons to love the job. And there will be moments you enjoy working there. It's very much so a roller coaster. Their Aflac rating is really good so if you purchase any Aflac plans you'll get a really fair price. Being downtown is nice. What I liked most about working there: -traveling -building relationships with some colleagues and executives I met at events -diverse role kept things interesting day to day -helped me realize what I wanted to do next in my career and prepared me for that somewhat -the office shuts down between Christmas and New Years which is nice to have that time off guaranteed -I was able to add a lot to my resume Cons You'll eventually learn it all and there's nothing more to learn after that because everything stays the same. No new ideas, no new strategies, no innovation. Actually, once you learn the organization inside and out, you'll probably know more than upper management who do not continue their own learning & development and focus almost entirely on internal affairs rather than observing what competitors are doing to improve. They don't really take feedback from their high paying clients to improve either. I found that most of what I learned during my employment at marcus evans, is how not to run a business. Don't bother suggesting ideas and strategies because there's no interest in changing any processes. There's a lot of opportunity in sales to make money if youre a combination of good and lucky. very few care about their clients, and just care about making themselves more money and reaching goals for incentives. Marcus doesn't do anything but he'll take 24% of your deal. Oh and he'll be in the office and not even acknowledge you with a polite hello or give a motivational speech to the floor. Or share his gratitude for making him one of the richest men in the UK. If he changed the culture and operations of his company, he could be a whole lot richer. They don't invest in any technology. Sales, except managers and directors, keep track of their leads on paper. Yes. Paper. The sales process is very manipulative and it doesn't have to be because the product is actually really good, but could be better. Prices for each event don't make any sense. Reps seem to make up a number sometimes which, if clients knew, is fishy and should be standard across the whole company for each event with consistent costs for up selling options. You'll spend hours and days in meetings that result in nothing accomplished. Management seems clueless most of the time. Turnover is VERRRRRRRY high and in recent years, very talented, intelligent and successful employees who have been there for years left because they couldn't take it anymore and they found better things. Chicago is a very strong market right now for great job opportunities, and this company does not compete well. The environment can be hostile. You may get harassed by the men in the office. Their finances seem like a total disaster. They don't seem to make any outgoing payments so collections and accounts receivables are constantly calling asking where their money is. yet, they'll expect client to wire transfer funds within 24 hrs usually, especially if it's the end of the month so the rep can get their bonus to pay rent, bills and groceries. Oh and don't be too successful, because if marcus pays you too much on an incentive/bonus opportunity, he may decide to not do it again. There's no guarantee you'll make as much the following year after a very successful year. And they could care less about how discouraging that is on an employee. You may even deliver the same results each year but if there's a lack of incentives or bonuses being offered, you may earn less which sucks. When you leave, you may not get all of the money you're actually owed. Honestly, the nbc tower isn't that cool of a building to be in. It's a prime location but there's only a mediocre cafe inside the building to get food, and an overpriced illy coffee place. Also, there's no microwave so don't bring anything hot for lunch. They take attendance like you're in high school. There aren't really any benefits. You can pay for healthcare and invest in a 401k through them but other than that, nothing. Not much opportunity for growth as a professional or within the company. They favor men. No female C level executives at this company. no IT security They expect you to do the same thing but deliver new results... You'll likely never see a raise. If you do, it may only be $500-1000 more each year... Advice to Management Evolve. Educate yourself on what the modern business landscape looks like. Pay attention to your competitors. Listen to your clients feedback and ACT ON IT! Be transparent with your prospects. They'll work with you if you build their trust. Your brand is soooo important and if your reputation sucks, which it does, you make it harder to be successful. I'd suggest rebranding entirely. Consumers are smarter than ever before, and they see through your manipulative processes. You offer a great product but you present it terribly and have no interest in making it better. Always strive for better. More money doesn't make it better. Set the tone for mission, vision, and values and be how you want your employees to be like. Appreciate your employees. Don't make them starve financially in one of the most expensive cities because they have a bad month or two selling. INVEST IN TECHNOLOGY AND YOUR EMPLOYEES. BE INNOVATIVE. AND ACTUALLY BE THE BEST! Don't just claim to be. Learn and understand these terms: Lead Nurturing and client relationship management. Create a company strategy and divisional/departmental strategies. What's your 5 year plan?? Communicate with your employees!", "rating": 3, "pros": "There's a lot of opportunity to learn if you're fresh out of college or never worked in the corporate world. You'll get hands on experience developing and improving a variety of skill sets that are attractive to other employers. If this is your first job and you're desperate, go for it, but know that if you're college educated, hard working, and not a felon, you'll quickly outgrow this place and be suitable for much better.", "cons": "You'll eventually learn it all and there's nothing more to learn after that because everything stays the same. No new ideas, no new strategies, no innovation. Actually, once you learn the organization inside and out, you'll probably know more than upper management who do not continue their own learning & development and focus almost entirely on internal affairs rather than observing what competitors are doing to improve.", "advice": "Evolve. Educate yourself on what the modern business landscape looks like. Pay attention to your competitors. Listen to your clients feedback and ACT ON IT! Be transparent with your prospects. They'll work with you if you build their trust. Your brand is soooo important and if your reputation sucks, which it does, you make it harder to be successful. I'd suggest rebranding entirely. Consumers are smarter than ever before, and they see through your manipulative processes. You offer a great product but you present it terribly and have no interest in making it better. Always strive for better. More money doesn't make it better. Set the tone for mission, vision, and values and be how you want your employees to be like. Appreciate your employees. Don't make them starve financially in one of the most expensive cities because they have a bad month or two selling. INVEST IN TECHNOLOGY AND YOUR EMPLOYEES. BE INNOVATIVE. AND ACTUALLY BE THE BEST! Don't just claim to be. Learn and understand these terms: Lead Nurturing and client relationship management. Create a company strategy and divisional/departmental strategies. What's your 5 year plan?? Communicate with your employees!"}, {"title": "Maybe its Not for You", "text": "Pros Great commission, Good career trajectory, okay people Cons Very low base salary, long hours", "rating": 3, "pros": "Great commission, Good career trajectory, okay people", "cons": "Very low base salary, long hours", "advice": null}, {"title": "sales executive", "text": "Pros They are patient with you in some ways and it's good to get the experience underneath your belt. Cons They have a tendency to sometimes demean you and put you under distress which makes the job not fun.", "rating": 3, "pros": "They are patient with you in some ways and it's good to get the experience underneath your belt.", "cons": "They have a tendency to sometimes demean you and put you under distress which makes the job not fun.", "advice": null}, {"title": "Marketing Manager", "text": "Pros Traveling to five star luxurious hotels, meeting colleagues from all around the world, and interacting with high level executives you would never be able to meet. Cons No growth, poor managerial support, lack of direction and communication.", "rating": 3, "pros": "Traveling to five star luxurious hotels, meeting colleagues from all around the world, and interacting with high level executives you would never be able to meet.", "cons": "No growth, poor managerial support, lack of direction and communication.", "advice": null}, {"title": "Conference Producer", "text": "Pros You get to travel to your event. If it isn't \"withdrawn from the market\"... Cons Underpaid Caged environment (can only have breaks at certain times of the day) Management purposefully misguides to prevent you reaching the 25 day production deadline Turnover rate is HIGH Little room for growth with a SLIGHT pay increase Advice to Management Take a good look at what you're doing", "rating": 1, "pros": "You get to travel to your event. If it isn't \"withdrawn from the market\"...", "cons": "Underpaid", "advice": "Take a good look at what you're doing"}, {"title": "Feel like a robot working here", "text": "Pros Worked int the NYC office. Good people and cool office. Thats about all the pros.... Cons You do 10oz curls with the phone all day and pretty much hear the word no over and over again until you want to throw the phone out the window. Advice to Management Change the sales tactics and make it somehow easier to sell products", "rating": 1, "pros": "Worked int the NYC office. Good people and cool office. Thats about all the pros....", "cons": "You do 10oz curls with the phone all day and pretty much hear the word no over and over again until you want to throw the phone out the window.", "advice": "Change the sales tactics and make it somehow easier to sell products"}, {"title": "Definitely last resort", "text": "Pros 2% of the job is fun. Being on-site at the conferences, running them, and visiting new cities is a great experience. Cons Seriously, stay away. Job pays terribly and it's a crap shoot if you'll have success. Some conferences do great, some bomb and you make no money. And it's never your fault. Advice to Management Value your employees. You treat everyone terribly and think that this is an easy job. You pay terribly and judge people when certain conferences aren't successful.", "rating": 1, "pros": "2% of the job is fun. Being on-site at the conferences, running them, and visiting new cities is a great experience.", "cons": "Seriously, stay away. Job pays terribly and it's a crap shoot if you'll have success. Some conferences do great, some bomb and you make no money. And it's never your fault.", "advice": "Value your employees. You treat everyone terribly and think that this is an easy job. You pay terribly and judge people when certain conferences aren't successful."}, {"title": "Sales Executive", "text": "Pros Cool location, amazing view, cool office. Open floor plan with everyone working with easy access to management Cons cold calling, low pay, intense micromanaging. Smoke and mirrors will get you in the door and you'll quickly realize the environment is not what you thought you were getting into. Advice to Management The entry-level positions are what they are. At least be transparent about what people are getting into so that you can attract people that want those types of roles", "rating": 1, "pros": "Cool location, amazing view, cool office. Open floor plan with everyone working with easy access to management", "cons": "cold calling, low pay, intense micromanaging. Smoke and mirrors will get you in the door and you'll quickly realize the environment is not what you thought you were getting into.", "advice": "The entry-level positions are what they are. At least be transparent about what people are getting into so that you can attract people that want those types of roles"}, {"title": "truth", "text": "Pros unlimited chance to make money if you are a Go Getter Cons high turnover and you cant choose to sell what you could probably be best at Advice to Management none- they have a great system and the boss lady is cut- throat but all for those who genuinely want to improve.", "rating": 3, "pros": "unlimited chance to make money if you are a Go Getter", "cons": "high turnover and you cant choose to sell what you could probably be best at", "advice": "none- they have a great system and the boss lady is cut- throat but all for those who genuinely want to improve."}, {"title": "Garbage", "text": "Pros Location midtown close to grand central station Cons Garbage company . Telemarketing, cold calling miserable environment. After 2 weeks I stopped giving a damn . Cheap pyker company that doesn't buy leads , or has headsets for its employees. You have to wait a month to get a garbage paycheck . They don't invest on their brand . No one knows and no one cares about marcus evans . Advice to Management Stop being a pyker company .", "rating": 1, "pros": "Location midtown close to grand central station", "cons": "Garbage company . Telemarketing, cold calling miserable environment. After 2 weeks I stopped giving a damn . Cheap pyker company that doesn't buy leads , or has headsets for its employees. You have to wait a month to get a garbage paycheck . They don't invest on their brand . No one knows and no one cares about marcus evans .", "advice": "Stop being a pyker company ."}, {"title": "Last resort", "text": "Pros I was able to add experience to my resume to get to my next job Cons phones phones phones Not flexible in schedule", "rating": 3, "pros": "I was able to add experience to my resume to get to my next job", "cons": "phones phones phones", "advice": null}, {"title": "Made some good money here", "text": "Pros Ability to make a lot of money if you are good. Good people in the office to work with. Management throws out good incentives. Company promotes from within. Will never hire a manager. Cons No good CRM product in place (i.e. salesforce). Business model is a bit archaic meaning that reps have to go to a bank of computers to print out leads instead of having a PC on a desk or a CRM system that would enable more productivity. Advice to Management More transparency. More promotions for folks who are good.", "rating": 3, "pros": "Ability to make a lot of money if you are good. Good people in the office to work with. Management throws out good incentives. Company promotes from within. Will never hire a manager.", "cons": "No good CRM product in place (i.e. salesforce). Business model is a bit archaic meaning that reps have to go to a bank of computers to print out leads instead of having a PC on a desk or a CRM system that would enable more productivity.", "advice": "More transparency. More promotions for folks who are good."}, {"title": "Sales", "text": "Pros Great co-workers willing to help. Cons Poor advancement, training and development. Advice to Management Poor leadership.", "rating": 3, "pros": "Great co-workers willing to help.", "cons": "Poor advancement, training and development.", "advice": "Poor leadership."}, {"title": "Driven and focused", "text": "Pros Colleagues are all very intelligent, driven and focussed, with products heavily dependent on high-margin B2B. Cons Capable management, good people and good products but high turnover. Advice to Management Look and give more opportunities to progress.", "rating": 5, "pros": "Colleagues are all very intelligent, driven and focussed, with products heavily dependent on high-margin B2B.", "cons": "Capable management, good people and good products but high turnover.", "advice": "Look and give more opportunities to progress."}, {"title": "Sales Executive", "text": "Pros The work is interesting. You learn a lot about different sectors, industries, roles, and internal workings of businesses and organizations. They have a rule about coming at 8 and leaving at 5, and you're not allowed to work outside that. So that's nice. Cons I did not feel comfortable making some promises to clients that I could not keep, and sometimes I felt like I had to.", "rating": 3, "pros": "The work is interesting. You learn a lot about different sectors, industries, roles, and internal workings of businesses and organizations.", "cons": "I did not feel comfortable making some promises to clients that I could not keep, and sometimes I felt like I had to.", "advice": null}, {"title": "Sales exec", "text": "Pros Location of myc office is convenient Cons Management & process is a sham Advice to Management Needs to be greater transparency", "rating": 1, "pros": "Location of myc office is convenient", "cons": "Management & process is a sham", "advice": "Needs to be greater transparency"}, {"title": "Sales executive-summit division", "text": "Pros Good structure, support, training, innovation, best in the field by bar, great incentives, opportunity galore Cons Hard work, deep initial learning curve and takes perseverance to stick out the initial probationary period", "rating": 5, "pros": "Good structure, support, training, innovation, best in the field by bar, great incentives, opportunity galore", "cons": "Hard work, deep initial learning curve and takes perseverance to stick out the initial probationary period", "advice": null}, {"title": "Sales Consultant", "text": "Pros Great global organization. Very helpful and friendly staff. Financial rewards are based on one's own work and related effort which is the way it should be. Strongly recommend. Cons The work is intense and is only for strong of mind and body. The con is in fact a pro. Advice to Management Keep up the good work.", "rating": 5, "pros": "Great global organization. Very helpful and friendly staff. Financial rewards are based on one's own work and related effort which is the way it should be. Strongly recommend.", "cons": "The work is intense and is only for strong of mind and body. The con is in fact a pro.", "advice": "Keep up the good work."}]