[{"title": "Designer", "text": "Pros Great work environment. It was my first job out of college and it set the bar very high. Cons Creative department is very small. Not a lot of room for upward mobility.", "rating": 5, "pros": "Great work environment. It was my first job out of college and it set the bar very high.", "cons": "Creative department is very small. Not a lot of room for upward mobility.", "advice": null}, {"title": "Disorganized, but good people", "text": "Pros Most of the staff is filled with intelligent and efficient women working together bringing content they know the readers would like. There is a good mix of fashion, beauty, lifestyle, politics, pop culture, and wellness content that the staff is always excited to present. The work environment is pretty light-hearted. Everyone genuinely likes working together. Cons Department heads don't communicate very well together so things often fall through the cracks. But because of the competence of others, it ends up getting taken care of. Hearst itself does not treat the print magazine staff very well. You can tell all the money and resources are moved to the digital side. Consistently cites that there is no budget to give raises unless you come back with a competing offer.", "rating": 3, "pros": "Most of the staff is filled with intelligent and efficient women working together bringing content they know the readers would like. There is a good mix of fashion, beauty, lifestyle, politics, pop culture, and wellness content that the staff is always excited to present. The work environment is pretty light-hearted. Everyone genuinely likes working together.", "cons": "Department heads don't communicate very well together so things often fall through the cracks. But because of the competence of others, it ends up getting taken care of. Hearst itself does not treat the print magazine staff very well. You can tell all the money and resources are moved to the digital side. Consistently cites that there is no budget to give raises unless you come back with a competing offer.", "advice": null}, {"title": "Intern", "text": "Pros Pretty good experience overall, learnt alot Cons Could have been given more tasks", "rating": 3, "pros": "Pretty good experience overall, learnt alot", "cons": "Could have been given more tasks", "advice": null}, {"title": "Nice jump start", "text": "Pros Working with unique brands, emerging labels, freedom to choose what to write about, going to shows Cons Time crunches, sometimes limited work (came in spurts) Advice to Management Try to get steady work, also more advanced plans", "rating": 3, "pros": "Working with unique brands, emerging labels, freedom to choose what to write about, going to shows", "cons": "Time crunches, sometimes limited work (came in spurts)", "advice": "Try to get steady work, also more advanced plans"}, {"title": "Fast-paced and tense", "text": "Pros Young and hip coworkers, interesting content Cons Poor pay, no recognition, poor morale", "rating": 3, "pros": "Young and hip coworkers, interesting content", "cons": "Poor pay, no recognition, poor morale", "advice": null}, {"title": "Fashion Assistant Intern", "text": "Pros Learned so much and loved going into work every day Cons Not that much structure, long hours", "rating": 5, "pros": "Learned so much and loved going into work every day", "cons": "Not that much structure, long hours", "advice": null}, {"title": "Simply silly", "text": "Pros The magazine produced good work, hence two stars. It was a great networking opportunity if you used it as such - you made friends and connections. It was a great was to see the culture of the magazine and test out your will in fashion. Cons MC is about as diverse as a blank sheet of paper. The unpaid internship thing should be illegal for ALL magazines. People don't remotely value your time when you don't get paid. Some of the people who worked there were gossiping and silly, or walked around thinking they were God's gift to the earth. They often had around 20 interns cramped in the fashion closet doing very little. It was easy to overcrowd the office when you don't pay people. Advice to Management Become more diverse! There were two editors of color in that office. How can you think you can cater to women if women are not all white and rich. One solid way to do that is making a paid intern position. Most young people, especially those in college, can't afford to be in a place for five days a week unpaid in New York City. You end up skewing your pool to people who are willing to live in a box on the side of the road for your magazine (pathetic) or people with daddy money which more often than not amounts to rich white women. Your magazine readers deserve a diverse set of hands putting the magazine together. Especially when you're trying to tackle diverse topics in your magazine.", "rating": 3, "pros": "The magazine produced good work, hence two stars. It was a great networking opportunity if you used it as such - you made friends and connections. It was a great was to see the culture of the magazine and test out your will in fashion.", "cons": "MC is about as diverse as a blank sheet of paper. The unpaid internship thing should be illegal for ALL magazines. People don't remotely value your time when you don't get paid. Some of the people who worked there were gossiping and silly, or walked around thinking they were God's gift to the earth. They often had around 20 interns cramped in the fashion closet doing very little. It was easy to overcrowd the office when you don't pay people.", "advice": "Become more diverse! There were two editors of color in that office. How can you think you can cater to women if women are not all white and rich. One solid way to do that is making a paid intern position. Most young people, especially those in college, can't afford to be in a place for five days a week unpaid in New York City. You end up skewing your pool to people who are willing to live in a box on the side of the road for your magazine (pathetic) or people with daddy money which more often than not amounts to rich white women. Your magazine readers deserve a diverse set of hands putting the magazine together. Especially when you're trying to tackle diverse topics in your magazine."}, {"title": "Internship", "text": "Pros Great learning experience. Hands on experience in coming up with ideas and putting to use of organizational skills. Interesting to see how to best target the selected audience. Cons Days become monotone. There isn't that much collaboration between the various teams in the office, as far as I am concerned( i.e. No team meetings)", "rating": 5, "pros": "Great learning experience. Hands on experience in coming up with ideas and putting to use of organizational skills. Interesting to see how to best target the selected audience.", "cons": "Days become monotone. There isn't that much collaboration between the various teams in the office, as far as I am concerned( i.e. No team meetings)", "advice": null}, {"title": "Assistant Editor", "text": "Pros Work life balance is good Cons Compensation could be better, no room for growth.", "rating": 5, "pros": "Work life balance is good", "cons": "Compensation could be better, no room for growth.", "advice": null}, {"title": "Fashion Assistant Intern", "text": "Pros Great experience for those interested in the magazine or print industry. All the editors and fashion assistants were very welcoming and quick to give you jobs to tackle (not just fetching coffee). Cons A big part of the internship was making runs all over the city to pick-up/drop-off garments to different brands (no matter what the weather looks like). Must wear comfortable shoes! Work hours are very unpredictable. There is no set end work time.", "rating": 5, "pros": "Great experience for those interested in the magazine or print industry. All the editors and fashion assistants were very welcoming and quick to give you jobs to tackle (not just fetching coffee).", "cons": "A big part of the internship was making runs all over the city to pick-up/drop-off garments to different brands (no matter what the weather looks like). Must wear comfortable shoes! Work hours are very unpredictable. There is no set end work time.", "advice": null}, {"title": "Fashion Closet Intern", "text": "Pros Great exposure to the industry, most employees are friendly and willing to help Cons Long work days for no pay, not much internship structure Advice to Management Create a more structured internship program, do not over-hire interns", "rating": 3, "pros": "Great exposure to the industry, most employees are friendly and willing to help", "cons": "Long work days for no pay, not much internship structure", "advice": "Create a more structured internship program, do not over-hire interns"}, {"title": "Fashion Market Intern", "text": "Pros Everyone in the office is really nice and respectful. it is a great learning environment Cons no cons except for RUNS!!!", "rating": 5, "pros": "Everyone in the office is really nice and respectful. it is a great learning environment", "cons": "no cons except for RUNS!!!", "advice": null}, {"title": "Fashion Intern", "text": "Pros met some amazing girls and saw the background of how a magazine is run Cons typical fashion magazine internship, the devil wears prada type of stuff, one of the hardest internships I've ever done but was well worth the experience. made me realize i didn't want to work in the fashion closet Advice to Management the interns shouldn't be there 12+ hrs every day.", "rating": 3, "pros": "met some amazing girls and saw the background of how a magazine is run", "cons": "typical fashion magazine internship, the devil wears prada type of stuff, one of the hardest internships I've ever done but was well worth the experience. made me realize i didn't want to work in the fashion closet", "advice": "the interns shouldn't be there 12+ hrs every day."}, {"title": "Marketing assistant", "text": "Pros Huge opportunities, learn about press area and edition Cons Press decline, compartmentalized job, low responsabilities", "rating": 5, "pros": "Huge opportunities, learn about press area and edition", "cons": "Press decline, compartmentalized job, low responsabilities", "advice": null}, {"title": "Sales Manager", "text": "Pros International brand with strong investigational journalism. Cons Local publisher are not strategic when it comes to innovation and revenue generation. They also allow certain advertisers to dictate content/adverts from other Clients. Advice to Management Some respect for all Clients and staff goes a long way.", "rating": 3, "pros": "International brand with strong investigational journalism.", "cons": "Local publisher are not strategic when it comes to innovation and revenue generation. They also allow certain advertisers to dictate content/adverts from other Clients.", "advice": "Some respect for all Clients and staff goes a long way."}, {"title": "Trés mauvaise ambiance!", "text": "Pros Etre dans un groupe de presse reconnu Cons Ambiance vraiment limite supérieur hiérarchique incompétent et à la limite du harcèlement vis à vis de certaines personnes", "rating": 3, "pros": "Etre dans un groupe de presse reconnu", "cons": "Ambiance vraiment limite supérieur hiérarchique incompétent et à la limite du harcèlement vis à vis de certaines personnes", "advice": null}]