[{"title": "Research Analyst", "text": "Pros - colleagues and management - flexibel hours - steep learning curve Cons - compensation could have been better", "rating": 5, "pros": "- colleagues and management", "cons": "- compensation could have been better", "advice": null}, {"title": "Crooked organisation", "text": "Pros New Berlin office is an upgrade, but nothing special in and of itself Make friends through common suffering Cons As other reviews mentioned, long hours, expected to stay overtime with no additional compensation, in fact inputting more than 8 hours work a day/40 hours a week is automatically blocked on MyTime, the work hour tracking system. Poor morale, they were hiring by the dozens a year ago but recently turned around and started firing. CEO had to run propaganda sessions to do damage control and \"comfort\" everyone they would not be next to be fired. Christmas party was lame and the food was horrible, made me throw up. CEO Kay takes everything very personally and is a bully, he can't stay away from anything because he has NO TRUST in the employees, the micromanagement is to the detriment of all the teams in the company. Management team leaves lots of fake reviews on Glassdoor and it's getting more obvious. The one posted January 2018 by a \"Senior Consultant, less than 1 year with the company\" there is no Senior Consultant who joined the company in the recent 2 years who is at all happy with the state of the company, much less think it produces a \"great product\". That review reeks of the language used by management. The 5 star posted December 2017 by a \"former Director\" and mentions how he/she/it likes the new office. The move happened October 2017, no Director left the company since moving to the new office. Also watch out for the fake salaries - management likes suppressing salaries and that includes dirty tactics like placing lower-than-average numbers or outright lies on review sites like Glassdoor. The recently posted \"Senior Go-To-Market Specialist: 39k-43k\" is a working example of this, there is no such position within the company! Advice to Management Change the entire management team to competent adults who can actually lead Stop posting fake reviews - it's painfully obvious and you're only making it worse", "rating": 1, "pros": "New Berlin office is an upgrade, but nothing special in and of itself", "cons": "As other reviews mentioned, long hours, expected to stay overtime with no additional compensation, in fact inputting more than 8 hours work a day/40 hours a week is automatically blocked on MyTime, the work hour tracking system. Poor morale, they were hiring by the dozens a year ago but recently turned around and started firing. CEO had to run propaganda sessions to do damage control and \"comfort\" everyone they would not be next to be fired. Christmas party was lame and the food was horrible, made me throw up. CEO Kay takes everything very personally and is a bully, he can't stay away from anything because he has NO TRUST in the employees, the micromanagement is to the detriment of all the teams in the company.", "advice": "Change the entire management team to competent adults who can actually lead"}, {"title": "Great place to work", "text": "Pros Great product, people and work life balance. It’s a fast growing start up, expect pressure, if you perform you win, if you can’t handle it, well... Cons Process process process process process Advice to Management None", "rating": 5, "pros": "Great product, people and work life balance. It’s a fast growing start up, expect pressure, if you perform you win, if you can’t handle it, well...", "cons": "Process process process process process", "advice": "None"}, {"title": "Wouldn't recommend", "text": "Pros Some really nice people to work with Good vacation days Flexible conditions Cons Product is terrible - many bugs Customer first mentality is to the detriment of the company Long days, late evenings, boring/repetitive work False sense of stress is everywhere - company makes such a big deal out of the smallest things Morale is low - many people leave, most can't wait to leave Very political Advice to Management Put your staff first Stop promising things to your clients you know you can't achieve", "rating": 3, "pros": "Some really nice people to work with", "cons": "Product is terrible - many bugs", "advice": "Put your staff first"}, {"title": "Great opportunity to help a growing company", "text": "Pros Supportive colleagues, interesting technologies, great clients and many vacation days. Cons The room situation has been improved when moving to the new office.", "rating": 5, "pros": "Supportive colleagues, interesting technologies, great clients and many vacation days.", "cons": "The room situation has been improved when moving to the new office.", "advice": null}, {"title": "Avoid the company if you can", "text": "Pros International, young, and friendly co-workers. Product has potential. Cons Disorganization, favouritism, sexism, and unprofessionalism is rampant. Management conducts shady business practices to please the board, while ignoring the needs and wellbeing of their clients and staff. Working overtime is expected and not appreciated. They are under-resourced and tend to oversell without meeting the needs of the clients. Internal politics and unprofessional personal relationships lead to unqualified people getting promoted while qualified people are overlooked. HR team is unprofessional and does not respect employee privacy. Advice to Management Change all upper management.", "rating": 1, "pros": "International, young, and friendly co-workers.", "cons": "Disorganization, favouritism, sexism, and unprofessionalism is rampant. Management conducts shady business practices to please the board, while ignoring the needs and wellbeing of their clients and staff.", "advice": "Change all upper management."}, {"title": "Horrible Experience", "text": "Pros New premises are good and that's about it. Cons Disgusting company with a terrible atmosphere and very little care for their people. I worked there as a Consultant, and I can only say that it has been one of the most horrible experiences of my career: Horrid environment with Human Resources faking a so called \"corporate culture\" of friendliness and team work, but in fact the company is an absolutely toxic place with no values on display (absolutely no training coupled with high expectations, mistreatment of employees, abusive workloads, etc.). Co-workers saying things like \"this office has a weird atmosphere\" or \"I'm only here for the money\" are everyday normalities. To disguise their disgusting environment, Human Resources posts the odd fake review here to sway the rating and mask their ignorance and lack of skills. Don't work for Market Logic, it really is a horribly toxic place! Advice to Management When will you guys learn? Happy to collect awful reviews on Glassdoor week in week out? You think you can mask things with fake reviews? You really are a bunch of deafs. With your abusive treatment of people I'm not very surprised!", "rating": 1, "pros": "New premises are good and that's about it.", "cons": "Disgusting company with a terrible atmosphere and very little care for their people. I worked there as a Consultant, and I can only say that it has been one of the most horrible experiences of my career: Horrid environment with Human Resources faking a so called \"corporate culture\" of friendliness and team work, but in fact the company is an absolutely toxic place with no values on display (absolutely no training coupled with high expectations, mistreatment of employees, abusive workloads, etc.).", "advice": "When will you guys learn? Happy to collect awful reviews on Glassdoor week in week out? You think you can mask things with fake reviews? You really are a bunch of deafs. With your abusive treatment of people I'm not very surprised!"}, {"title": "Simply awful.", "text": "Pros Free fruit - whoop whoop. Decent Xmas party Cons I worked at MLS for more than a year as an associate and it was without doubt the worst employment experience of my life. No training to speak of, terrible software, needy and demanding clients. The management would rather throw you under a bus than actually support their staff. The work is lowest common denominator stuff, soul destroying, basically: let's help a bunch of multi-millionaire/billionaire companies sell more crap to people that they don't really need. I find it amazing that they continue to receive investment considering the backend stuff is a joke. It also had a poisonous corporate atmosphere. I routinely saw employees reduced to tears from their treatment by managers. Avoid, avoid, avoid. Advice to Management There's more to life than selling a sub-par product to investors while pretending it is world changing. Furthermore, the CEO Kay, interferes all the time to the detriment of the work environment, but no one seems to call him out on it, he's a bit of a bully.", "rating": 1, "pros": "Free fruit - whoop whoop. Decent Xmas party", "cons": "I worked at MLS for more than a year as an associate and it was without doubt the worst employment experience of my life. No training to speak of, terrible software, needy and demanding clients. The management would rather throw you under a bus than actually support their staff. The work is lowest common denominator stuff, soul destroying, basically: let's help a bunch of multi-millionaire/billionaire companies sell more crap to people that they don't really need. I find it amazing that they continue to receive investment considering the backend stuff is a joke. It also had a poisonous corporate atmosphere. I routinely saw employees reduced to tears from their treatment by managers. Avoid, avoid, avoid.", "advice": "There's more to life than selling a sub-par product to investors while pretending it is world changing. Furthermore, the CEO Kay, interferes all the time to the detriment of the work environment, but no one seems to call him out on it, he's a bit of a bully."}, {"title": "Don't work here as research analyst, IT'S ALL A LIE!!!!", "text": "Pros Good salary and fruits in the kitchen everyday Cons - Boring, boring job. Copying and pasting all day and tagging words on a file is certainly as exciting as straightening chairs at a restaurant!!! - Students are isolated in a different floor and they only speak to managers by skype and outlook. People feel used and not taken care of. HR doesn't care about students at all and doesn't train them, like the don't seem to care. - There is enormous mistrust between HR and students because they monitor them everyday. They send employee satisfaction questionnaires but people feel that they actually know who answers what!!! Like another review below, HR is very corrupt!!! Advice to Management You don't care about students at all. You keep everybody isolated and you run the company by skype. Terrible!!!", "rating": 1, "pros": "Good salary and fruits in the kitchen everyday", "cons": "- Boring, boring job. Copying and pasting all day and tagging words on a file is certainly as exciting as straightening chairs at a restaurant!!!", "advice": "You don't care about students at all. You keep everybody isolated and you run the company by skype. Terrible!!!"}, {"title": "Gluttonous Vultures Hiring Minions by the Wholesale", "text": "Pros Absolutely flexible schedule and vacation. Cons In the “Kick-start your career” video on their website and in job offers, Market Logic Software advertise themselves as offering “close cooperation with experienced consultants” and “comprehensive learnings from marketing” in “an open multi-cultural environment”. What a wet load of rubbish, really. As they made it look, I was very motivated to be part of a team with whom I could grow into the job, develop solid work relationships with everyday interaction –team meetings, lots of contact with my workmates, etc.– and learn something valuable for my career. Instead, I was thrown into a big isolated room in a separate building with a herd of 30-40 students/nobodies receiving instructions exclusively via email, Skype and Power Point to rewrite and copy-paste marketing info for a state-of-the-art software, with no training whatsoever. The area is called the “Service Factory”, so you literally work in horrendous assembly-line fashion: I would check in, copy-paste and then check out without even seeing the result of my work as Market Logic Software never bothered to show it to me. Chances to grasp the job essentials and build solid work relationships were constantly escaping me, as I was just a floater across different business verticals, changing projects, teams, offices and buildings every two weeks, and thrown into the marketing intricacies of several industries–from beverages, to pharma, pet food, candles, finances, etc.– with absolutely no training in between. The result: superficial work relationships; lack of understanding of the impact of your work; little to no sense of belonging; frustration and total lack of motivation, and inconsistent performances, frustrating for both the worker and the company. In summary, this is a digital, peripheral job with very, very poor professional or emotional reward. Also, as it's been similarly documented here on Glassdoor by former employees –again, and again, and again, and again(!)– Market Logic Software has without a doubt one of the worst working atmospheres I have ever experienced in my 10-year career. The “Service Factory” is a frosty, digital environment isolated from the other areas where due to the endless rotation every two weeks –pet food, insurance, chocolates, pharmaceutics, rooms, buildings, desks, computers, projects, people, etc.– your so-called “workmates” are all mutual strangers to each other like everyday commuters on the S-Bahn. I could easily spend a whole day at Market Logic without exchanging a “hello” with anybody, and that included, obviously, those “experienced consultants” that these vultures falsely advertise in their job adds and who communicate to students exclusively via Outlook and Skype. But perhaps the most awful aspect about this kitchen is that, instead of offering a proper training program, investing in an engaging working environment with more human interaction, and devising proper communication strategies to build corporate culture, HR restrict themselves to recruiting cheap kiddos from any discipline by the wholesale, offering them very little training, stretching and exploiting them to do everything, whilst assigning and supervising them exclusively by remote control –Skype, Outlook, Excel, Power Point, and Google Drive. Revolting. The reality is that, since they trample lawyers, psychologists, sociologists, journalists, etc., into becoming marketing experts by miserably emailing them operative instructions on a Power Point, this pigsty is nowhere near interested in you to learn anything; in other words, they’re nowhere interested in YOU whatsoever. They’re just hungrily preying for Uni kiddos with English skills to use them as detachable, peripheral copy-pasters for their software whilst saving on costly training hours and skimping the firm a great deal of taxes through the reaps of the Werkstudent contract. Repulsive. Question is, why is it all like this? Well, the thing is, the HR Department is in reality not an HR Department. They are a bunch of Marketing predators who are there to exclusively stretch the company's budget through cheap, lumberjackish hiring, and to cost-efficiently and embarrassingly simulate Human Resources with just Skype, Outlook and Google Drive. This is a carefully conceived cost-efficient approach, typical within voracious, fast-growing companies at their young stage: saving costs, hiring the cheapest and maximising resources whilst excreting on their personnel. Appalling. In their gluttonous approach of acquiring “young talent” –meaning “cheap talent”– by the dozen without investing a single penny on training or a healthy working environment, these predating Marketings –disguised as “HR department”– whirl you into their already tired cannibal sequence: you are hired, castrated of your skills, then segregated, undertrained, assigned, reassigned, rotated, detached, reattached, jiggled with, tinkered with and turned inside out at their will, everything by remote control –Outlook, Excel and Google Drive. Still, in the “Kick-start your career” video on the company's website, the HR fakes sell illusions by referring to their herd of digital, peripheral floaters who don’t even speak to each other as \"the team” (!) To look attractive to the young/cheap student market, they even enact the “close cooperation” claim in the same video by posing next to one of the students, when in reality they couldn’t care less about the rotating, expendable minions that they aloofly, predatorily and cost-efficiently administer exclusively by remote control –Skype, Outlook, Google Drive. And this pigsty dares to call such dung “Human Resources”? Wow, they actually can be that cynic. On top of that, their frosty, distant \"manage by wire” approach also includes warped tactics like secretly monitoring employees, which according to the EU Employee Monitoring Law, is illegal. Anyone who has never been notified of the monitoring –as the law demands– can rightfully ask questions to these fake vultures and lawfully protect their right to privacy –just Google “EU Employee Monitoring Law”, it’s all there in every link. So, “close cooperation with experienced consultants and comprehensive learnings from marketing in an open multi-cultural environment”? Please cut the wet load of fake drivel, really. Market Logic are building a solid reputation for hiring by the wholesale English-speaking kiddos from whatever discipline, “training them” with Power Point and trampling results out of them whilst keeping them “motivated” with their appallingly mechanistic, Stasi-inspired environment coldly administered by remote control. After 2 years, I can only say that this pigpen offers absolutely no professional or emotional reward to any decent professional, and my advise to potential candidates is, ignore the fake, too-positive reviews that these warped, hungry vultures post here on Glassdoor, and just look for a way better job opportunity elsewhere. Like this is the only company in Berlin. Advice to Management None.", "rating": 1, "pros": "Absolutely flexible schedule and vacation.", "cons": "In the “Kick-start your career” video on their website and in job offers, Market Logic Software advertise themselves as offering “close cooperation with experienced consultants” and “comprehensive learnings from marketing” in “an open multi-cultural environment”. What a wet load of rubbish, really.", "advice": "None."}, {"title": "Software Engineer", "text": "Pros Great place to learn. Fun environment. Cons None that I could find", "rating": 5, "pros": "Great place to learn. Fun environment.", "cons": "None that I could find", "advice": null}, {"title": "Lots to do and lots needs to change", "text": "Pros Dynamic, changing, multi-cultural, young, growing company with plenty of potential Cons Lots of challenges - exactly as you would expect for a growing company. Advice to Management Reign in the start-up \"we can do everything\" mentality and develop scalable, deliverable & sustainable value propositions", "rating": 5, "pros": "Dynamic, changing, multi-cultural, young, growing company with plenty of potential", "cons": "Lots of challenges - exactly as you would expect for a growing company.", "advice": "Reign in the start-up \"we can do everything\" mentality and develop scalable, deliverable & sustainable value propositions"}, {"title": "Analyst Working Student", "text": "Pros international, fun and communicative environment Cons less scope of applying intellect/skills", "rating": 3, "pros": "international, fun and communicative environment", "cons": "less scope of applying intellect/skills", "advice": null}, {"title": "The slow (but gradual) transition towards an effectively scaled IT company.", "text": "Pros Most people are quite nice and friendly. Cons Very poorly organised. Inconsistent workload leading to high time constraints and top-down pressure. Lack of accountability for responsibilities. Lack of ownership of/pride in work. Lack of trust. Advice to Management Micro-managed to detrimental and obstructive effect. Teams need more autonomy with a clear understanding of their own responsibilities objectives, with less dependency on other teams.", "rating": 3, "pros": "Most people are quite nice and friendly.", "cons": "Very poorly organised. Inconsistent workload leading to high time constraints and top-down pressure. Lack of accountability for responsibilities. Lack of ownership of/pride in work. Lack of trust.", "advice": "Micro-managed to detrimental and obstructive effect."}, {"title": "Research Analyst", "text": "Pros Diverse team, flexible hours Cons Low opportunity for further career development", "rating": 3, "pros": "Diverse team, flexible hours", "cons": "Low opportunity for further career development", "advice": null}, {"title": "Consulting at Market Logic", "text": "Pros Market Logic is a fast growing startup company working for big global corporations. As a Senior Consultant I work for my clients not only for a couple of months, but stay with them long-term which I like a lot. The software is innovative and clients like it a lot. The colleagues are very international from all over the world and we have an office in Chicago, too. Cons Current Berlin office is totally overcrowded, but we will move to a new office in September. Sometimes work gets crunchy , but working hour flexibility is very high. Advice to Management Keep the spirit, make sure that Market Logic stays innovative and flexible. Don't let you being pushed by the new investors.", "rating": 5, "pros": "Market Logic is a fast growing startup company working for big global corporations. As a Senior Consultant I work for my clients not only for a couple of months, but stay with them long-term which I like a lot. The software is innovative and clients like it a lot. The colleagues are very international from all over the world and we have an office in Chicago, too.", "cons": "Current Berlin office is totally overcrowded, but we will move to a new office in September. Sometimes work gets crunchy , but working hour flexibility is very high.", "advice": "Keep the spirit, make sure that Market Logic stays innovative and flexible. Don't let you being pushed by the new investors."}, {"title": "Here to stay!", "text": "Pros Flexible working hours, great colleagues, diverse team, easy to get to office, table football and social room, above average pay. Cons Client first. This is is taken a bit to seriously in my opinion and leads to a lot of last-minute changes and therefore a lot of pressure and mistakes. Advice to Management The CEO should trust his employees a bit more and not interfere with their work. This would relax the atmosphere a lot.", "rating": 5, "pros": "Flexible working hours, great colleagues, diverse team, easy to get to office, table football and social room, above average pay.", "cons": "Client first. This is is taken a bit to seriously in my opinion and leads to a lot of last-minute changes and therefore a lot of pressure and mistakes.", "advice": "The CEO should trust his employees a bit more and not interfere with their work. This would relax the atmosphere a lot."}, {"title": "My Journey at MLS as student", "text": "Pros Diverse working environment; supportive colleagues and supervisors; flexible work schedule; Suitable career kick start for devoted and ambitious students. Highly recommended! Cons Involves lots of reading.", "rating": 5, "pros": "Diverse working environment; supportive colleagues and supervisors; flexible work schedule; Suitable career kick start for devoted and ambitious students. Highly recommended!", "cons": "Involves lots of reading.", "advice": null}, {"title": "Consultant", "text": "Pros The working envireonment is very flexible Cons No structure, no onboarding, irrealistic working hours (12 hours work/day often, no overhours counted), no training (your first day you will be given a computer and a task and told to ask around to know how to do). Your boss will be a young professional with barely or no experience in management -- expect being mishandle - no go to person if problems (culture of not facing deep running issues -> if you're unsatisfied you'll be told to go or given more money) Advice to Management Onboard experienced middle management", "rating": 1, "pros": "The working envireonment is very flexible", "cons": "No structure, no onboarding, irrealistic working hours (12 hours work/day often, no overhours counted), no training (your first day you will be given a computer and a task and told to ask around to know how to do).", "advice": "Onboard experienced middle management"}, {"title": "Research Analyst and Consultant for Software", "text": "Pros Laid back atmosphere - you can wear anything you want to work. You can come in at 9:30 am no problem. Very flat hierarchy. Cons Overtime is not paid. It is very disorganized - you have to personally pursue your boss and HR for feedback and paycheck. It is confusing when you have to ask a question, because you don't know whom you should go to. Advice to Management More structured feedback system. More realistic expectations of future career opportunities. Install a system to track working hours so there is less unpaid overtime.", "rating": 3, "pros": "Laid back atmosphere - you can wear anything you want to work. You can come in at 9:30 am no problem. Very flat hierarchy.", "cons": "Overtime is not paid. It is very disorganized - you have to personally pursue your boss and HR for feedback and paycheck. It is confusing when you have to ask a question, because you don't know whom you should go to.", "advice": "More structured feedback system. More realistic expectations of future career opportunities. Install a system to track working hours so there is less unpaid overtime."}, {"title": "Quality Assurance", "text": "Pros Very bad work culture. Too much arrogance and attitude. Cons Very racist. Only claim to be multi-cultural.", "rating": 1, "pros": "Very bad work culture. Too much arrogance and attitude.", "cons": "Very racist. Only claim to be multi-cultural.", "advice": null}, {"title": "A good company to work for", "text": "Pros The company offers a great working environment and has a very positive employee ambiance. It offers diverse positions within organization and within teams. It is easy to switch teams and get a full time position, ensuring that your work here is considered as valid and important for the company. The company has a flat hierarchy, which makes communication within teams easier. Cons Sometimes it gets overcrowded, which potentially influences the working environment. Also, even though the stress level is not particularly high, the C-level people could have a negative impact on it. Advice to Management Financial incentives always boost working morale and productivity. Maybe more resources on improving people's skills.", "rating": 5, "pros": "The company offers a great working environment and has a very positive employee ambiance. It offers diverse positions within organization and within teams. It is easy to switch teams and get a full time position, ensuring that your work here is considered as valid and important for the company. The company has a flat hierarchy, which makes communication within teams easier.", "cons": "Sometimes it gets overcrowded, which potentially influences the working environment. Also, even though the stress level is not particularly high, the C-level people could have a negative impact on it.", "advice": "Financial incentives always boost working morale and productivity. Maybe more resources on improving people's skills."}, {"title": "Ideal workplace for students", "text": "Pros This is a great place to work as a student - the company has an established programme for hiring and engaging working students and pays well. Moreover, they offer flexibility over working patterns which is really helpful for attending seminars, tutorials etc. The people I worked with were really friendly, had reasonable expectations about the role and made an effort to integrate me into the team rather than making me feel like an outsider as a student worker. Numerous full-time employees started out as working students, which I think shows the company's commitment to developing staff and providing opportunities for their progression. Cons At times there were issues over desk space, although these were always managed well and will be resolved by an imminent move to larger premises. Advice to Management I think that their approach to employing student workers is really successful and I'd encourage them to continue to develop this further in the future.", "rating": 5, "pros": "This is a great place to work as a student - the company has an established programme for hiring and engaging working students and pays well. Moreover, they offer flexibility over working patterns which is really helpful for attending seminars, tutorials etc. The people I worked with were really friendly, had reasonable expectations about the role and made an effort to integrate me into the team rather than making me feel like an outsider as a student worker. Numerous full-time employees started out as working students, which I think shows the company's commitment to developing staff and providing opportunities for their progression.", "cons": "At times there were issues over desk space, although these were always managed well and will be resolved by an imminent move to larger premises.", "advice": "I think that their approach to employing student workers is really successful and I'd encourage them to continue to develop this further in the future."}, {"title": "(Full time) OK company, superficial environment", "text": "Pros Software has potential, number of clients and growing number of employees give me confidence in job security. International workforce, flexible hours and company-wide social events once every several months. Upon university graduation, research analyst (student job) leads to promotion to a full time Associate position - that's how almost all the Associates and Consultants reached where they are now. I am working with RA, Associate and Consultants in the Services Team since some years. Company was less than 100 employees just 3 years ago, this year they are reaching 300 employees and possibly more since it is only February. People coming for interviews almost every day since a few months ago until today. Main office in Germany, sales office in Chicago, planned office in Asia. Cons I'm pretty sure HR is watching Glassdoor and tries to sway the company rating. I question the legitimacy of the 5 star reviews especially Feb 25, May 12, Nov 9 and Dec 7 with \"no cons\". If you actually work for the company and are a functioning human being, you can see many obvious things to not like in your every day job at every level. Firstly I write some truth about working student life because I was one before and there is over representation of positive student reviews on here. The turnover/dissatisfaction among working students (research analysts) is high because of the repetitive and boring job. Research analyst is a fancy name for human robots for background data entry. They never see or use the actual software sold to clients. Many stay because the good pay and prospect of having a software company on their CV. As a full time employee with MLS for some years, the company is alright if you can deal with the very very superficial environment. The company is German but employees constantly try too hard to be \"American\" with fake niceness and small talk. Many people in Services Team acting busy and important by staying late at 1800-1900 but this is because they arrive to office late at 930-1000! There is some stress to work like any job, but the overreaction about high stress and high workload is superficial and just an acting contest. As a result, there is invisible pressure for everyone to stay \"\"working\"\" past 1700. -Free fruits but every day the supply is finished by 1200. The quantity of fruits available has remained the same for over a year despite the growing number of employees -Office size was OK in 2015, but the rooms are too crowded now with so many new employees. -Moving to new office in later 2017 but the new office is in a terrible location - far from U/S-Bahn, no supermarkets or cheap eating places around -Kitchen is always dirty, smelly and noisy -30 vacation days is low for Germany -Inefficient HR. As one review below says, they get paid for using Facebook and Linkedin every day and pretending to be nice with employees to get the latest gossip, but they ignore or extremely slow to respond to improvement suggestions. Advice to Management Cut out the superficial acting and have more work-life balance. Staying longer in office does not mean more work done or better quality employee! Make employees come on time and leave on time. Spend less constantly flying sales people and the top level executives to and from the United States, and use the money to rent a good office in a good location. Pay the yearly bonus at the end of the year, not many months later in summer of the next year! Stop posting fake reviews on Glassdoor to say the company is 5 stars with no cons!", "rating": 3, "pros": "Software has potential, number of clients and growing number of employees give me confidence in job security. International workforce, flexible hours and company-wide social events once every several months.", "cons": "I'm pretty sure HR is watching Glassdoor and tries to sway the company rating. I question the legitimacy of the 5 star reviews especially Feb 25, May 12, Nov 9 and Dec 7 with \"no cons\". If you actually work for the company and are a functioning human being, you can see many obvious things to not like in your every day job at every level.", "advice": "Cut out the superficial acting and have more work-life balance. Staying longer in office does not mean more work done or better quality employee! Make employees come on time and leave on time. Spend less constantly flying sales people and the top level executives to and from the United States, and use the money to rent a good office in a good location. Pay the yearly bonus at the end of the year, not many months later in summer of the next year!"}, {"title": "Mixed feelings", "text": "Pros As a working student, you will have really flexible working hours. The pay is also higher than what many working students earn in Berlin Cons The working students almost never meet their managers, communicating only via Skype Some of them also work from a different office altogether Advice to Management Treat working students better", "rating": 3, "pros": "As a working student, you will have really flexible working hours.", "cons": "The working students almost never meet their managers, communicating only via Skype", "advice": "Treat working students better"}, {"title": "Working Student - Software Development", "text": "Pros Good job for working students with real programming tasks instead of getting only the unpopular tasks. You are a part of the team and can even get own projects that you are responsible for. Nice international team and free fruits. Cons The management could be more organized and you should hope that you have a team leader that really leads your team and protects from the management. Advice to Management Rethink your mantra. Sometimes it can be better to let the customer wait and focus more on the product, so you can deliver it in the best possible quality.", "rating": 5, "pros": "Good job for working students with real programming tasks instead of getting only the unpopular tasks. You are a part of the team and can even get own projects that you are responsible for. Nice international team and free fruits.", "cons": "The management could be more organized and you should hope that you have a team leader that really leads your team and protects from the management.", "advice": "Rethink your mantra. Sometimes it can be better to let the customer wait and focus more on the product, so you can deliver it in the best possible quality."}, {"title": "Awesome company to work for!", "text": "Pros Great team, good atmosphere. Decent salary on time. I started as a working student and now have a full-time position in an area that I like. Cons Currently, the team is divided in 4 offices so it's hard to work together with some Departments. But next year we are moving to a new place that hopefully will be better (despite the location). Advice to Management Better communication in the workflow.", "rating": 5, "pros": "Great team, good atmosphere. Decent salary on time. I started as a working student and now have a full-time position in an area that I like.", "cons": "Currently, the team is divided in 4 offices so it's hard to work together with some Departments. But next year we are moving to a new place that hopefully will be better (despite the location).", "advice": "Better communication in the workflow."}, {"title": "A great start-up", "text": "Pros Open and international team, fast growing company with a lot of possibilities for promotion, great pay for a student job Cons I can't think of any cons at the moment", "rating": 5, "pros": "Open and international team, fast growing company with a lot of possibilities for promotion, great pay for a student job", "cons": "I can't think of any cons at the moment", "advice": null}, {"title": "Do Not Work Here as a POC", "text": "Pros There are no pros to working here. Trust and believe. Cons This work environment is the most toxic place I have ever had the misfortune of working at. The German project managers and employees are fundamentally xenophobic and racist against. This company takes advantage of their working students, interns, and trainees. Be expected to work 50 hours a week at the office and at home, because the clients are demanding. God forbid, you go home at 5 pm ( like normal people) without your passive aggressive German co worker complaining that you are a 'slacker'. Also, no one really knows what they are doing because the job description for the place is vague. You do everything from Excel reporting, making useless Powerpoint slides, and constantly dealing with an awful software that they shove down clients throats, hoping they will buy it and overlook the MANY flaws with it.  The pay may be higher than most start ups, however, for the amount of work given, is not sufficient. I was subjected to incompetent project managers that did not train nor communicate with me efficiently. The human resources is disorganised and corrupt to be honest, they promote new people faster than others that have been there for three or more years. The working students are placed in another building and isolated from project team, only using Skype or email to communicate amongst each other. That is not how a market research company should be run. This company has too much money but no clue as to how to use it on anything but the slow and lagging internet. This work environment is unprofessional, what kind of work place has project managers and higher up staff lash out at employees that make mistakes, but drink beer on the job while watching a Eurocup match in the meeting room? This place is FUNDAMENTALLY CORRUPT. Advice to Management Do not claim to be a multicultural environment when you barely have any people of colour, besides the 5 or 6 you use as \"tokens\" on the website. Create actual training sessions for new staff. Actually have an HR that does something other than drink their 40cents latte and scroll Facebook all day. Also, they are dishonest about many of the work practices, regulations, and entitlements for employees. They will try to cheat your out of your sick and vacation pay if you aren't on top of German work laws. Show some appreciation for the working students, many of whom have been there for years but still get paid less than their worth. Free fruit and coffee isn't enough to pay rent. Do not pick German project managers to teach sessions on communication with clients and work employees when they are the most standoffish, cold, and worst communicators amongst the whole company.", "rating": 1, "pros": "There are no pros to working here. Trust and believe.", "cons": "This work environment is the most toxic place I have ever had the misfortune of working at. The German project managers and employees are fundamentally xenophobic and racist against. This company takes advantage of their working students, interns, and trainees. Be expected to work 50 hours a week at the office and at home, because the clients are demanding. God forbid, you go home at 5 pm ( like normal people) without your passive aggressive German co worker complaining that you are a 'slacker'. Also, no one really knows what they are doing because the job description for the place is vague. You do everything from Excel reporting, making useless Powerpoint slides, and constantly dealing with an awful software that they shove down clients throats, hoping they will buy it and overlook the MANY flaws with it.", "advice": "Do not claim to be a multicultural environment when you barely have any people of colour, besides the 5 or 6 you use as \"tokens\" on the website. Create actual training sessions for new staff. Actually have an HR that does something other than drink their 40cents latte and scroll Facebook all day. Also, they are dishonest about many of the work practices, regulations, and entitlements for employees. They will try to cheat your out of your sick and vacation pay if you aren't on top of German work laws. Show some appreciation for the working students, many of whom have been there for years but still get paid less than their worth. Free fruit and coffee isn't enough to pay rent. Do not pick German project managers to teach sessions on communication with clients and work employees when they are the most standoffish, cold, and worst communicators amongst the whole company."}, {"title": "A great student or part-time job", "text": "Pros The pay as well as content of the tasks are well above average for student/part-time jobs in Berlin at the moment. Work atmosphere is good and all employee rights are always respected. The company is growing fast, so there is opportunity for promotion and advancing fast. Cons Working as Research Analyst for more than 4 hours per day can be exhausting due to the nature of the work. Advice to Management Try to put more effort into onboarding of new hires.", "rating": 5, "pros": "The pay as well as content of the tasks are well above average for student/part-time jobs in Berlin at the moment. Work atmosphere is good and all employee rights are always respected. The company is growing fast, so there is opportunity for promotion and advancing fast.", "cons": "Working as Research Analyst for more than 4 hours per day can be exhausting due to the nature of the work.", "advice": "Try to put more effort into onboarding of new hires."}, {"title": "Great company", "text": "Pros I like the team I work with, very multicultural and young! Cons No cons at the moment", "rating": 5, "pros": "I like the team I work with, very multicultural and young!", "cons": "No cons at the moment", "advice": null}, {"title": "analyst work", "text": "Pros flexible working hours, nice atmosphere among students, OK salary for students Cons difficult to get other experience in the company", "rating": 3, "pros": "flexible working hours, nice atmosphere among students, OK salary for students", "cons": "difficult to get other experience in the company", "advice": null}, {"title": "Great Fast-Growing Company with many opportunities", "text": "Pros Market Logic has a great, very unique B2B software which is driven forward by a highly experienced management and a great, very diverse team. The team is literally from all over the world and since the company is growing so fast there are many opportunities to progress in ones own career. Cons I cannot think of any disadvantages.", "rating": 5, "pros": "Market Logic has a great, very unique B2B software which is driven forward by a highly experienced management and a great, very diverse team. The team is literally from all over the world and since the company is growing so fast there are many opportunities to progress in ones own career.", "cons": "I cannot think of any disadvantages.", "advice": null}, {"title": "Fast growing company with great work atmosphere!", "text": "Pros Market Logic has a fantastic work atmosphere that is characterised by its challenging and fast paced environment. My colleagues are great and the workforce here is really diverse. The company offers lots of opportunities to grow and take up new roles and responsibilties. Cons At the moment I see no cons.", "rating": 5, "pros": "Market Logic has a fantastic work atmosphere that is characterised by its challenging and fast paced environment. My colleagues are great and the workforce here is really diverse. The company offers lots of opportunities to grow and take up new roles and responsibilties.", "cons": "At the moment I see no cons.", "advice": null}, {"title": "Associate", "text": "Pros Start up, very open and international colleagues, chances to get a promotion after a year are very high, clients Fortune +500 Cons Quite a small company, salaries are unfortunately very similar to most salaries in Berlin, not so good...at least not for the associate level. Advice to Management Get a bigger office where you can fit in all employees.", "rating": 5, "pros": "Start up, very open and international colleagues, chances to get a promotion after a year are very high, clients Fortune +500", "cons": "Quite a small company, salaries are unfortunately very similar to most salaries in Berlin, not so good...at least not for the associate level.", "advice": "Get a bigger office where you can fit in all employees."}, {"title": "Nicht empfehlenswert", "text": "Pros Nette Kollegen und zentral gelegen Cons Keine Führung, alle wurschteln vor sich hin. Veraltet Entwicklungsprozesse und wenig Leute die schon mal was anderes gesehen haben.", "rating": 3, "pros": "Nette Kollegen und zentral gelegen", "cons": "Keine Führung, alle wurschteln vor sich hin. Veraltet Entwicklungsprozesse und wenig Leute die schon mal was anderes gesehen haben.", "advice": null}, {"title": "Guter Studentenjob", "text": "Pros Junges Team, international, interessante Menschen, viel Flexibilität bei der Arbeitseinteilung, dynamische Entwicklung, mit den Kollegen kann man gerne nach der Arbeit zusammen etwas unternehmen Cons Monotone Aufgaben, strikte Kontrolle der Leistung, genervte Teamleiter, man kann nicht einmal Mittagspause machen, manchmal kriegt man nicht genug Aufträge und muss zu Hause bleiben, ohne Kompensation des Gehaltsvorstellung zu bekommen Advice to Management Etwas entspannter sein, höhere Stunden Gehälter, Möglichkeiten auf Mini Job Basis zu arbeiten, nicht nur englische Berichte analysieren, sondern auch die Kenntnisse der Mitarbeiter in anderen Sprachen nutzen", "rating": 3, "pros": "Junges Team, international, interessante Menschen, viel Flexibilität bei der Arbeitseinteilung, dynamische Entwicklung, mit den Kollegen kann man gerne nach der Arbeit zusammen etwas unternehmen", "cons": "Monotone Aufgaben, strikte Kontrolle der Leistung, genervte Teamleiter, man kann nicht einmal Mittagspause machen, manchmal kriegt man nicht genug Aufträge und muss zu Hause bleiben, ohne Kompensation des Gehaltsvorstellung zu bekommen", "advice": "Etwas entspannter sein, höhere Stunden Gehälter, Möglichkeiten auf Mini Job Basis zu arbeiten, nicht nur englische Berichte analysieren, sondern auch die Kenntnisse der Mitarbeiter in anderen Sprachen nutzen"}]