[{"title": "Good thing that happened in my life", "text": "Pros -Really good at testing candidates -Standup meetings are brief and short -You have a lot of control -Openness to using new technologies -People know how to listen & understand -Lan parties -Lots of lunches outside including weekly team lunch Cons -No team lunches inside the office for people who cook at home -The microwave is far away", "rating": 5, "pros": "-Really good at testing candidates", "cons": "-No team lunches inside the office for people who cook at home", "advice": null}, {"title": "Software Developer", "text": "Pros + Great opportunities to grow. + Flexibility to use different technologies + Friendly people + People will listen to you Cons - Sometimes chaotic in deployments, and now the process is getting improved", "rating": 5, "pros": "+ Great opportunities to grow.", "cons": "- Sometimes chaotic in deployments, and now the process is getting improved", "advice": null}, {"title": "Super Environment", "text": "Pros - Awesome team - Nice culture - Friendly and cozy environment Cons - Sometimes due to business changes we need to change the priorities that set on Sprint", "rating": 5, "pros": "- Awesome team", "cons": "- Sometimes due to business changes we need to change the priorities that set on Sprint", "advice": null}, {"title": "Cool place for expose you expertise.", "text": "Pros Clean planing and visible goal. Full size agile environment. Clean and silent office. Fruits and Smusi. Cons nothing to describe. The is no negative experience. Advice to Management Open door for any fresh new stack and technology.", "rating": 5, "pros": "Clean planing and visible goal. Full size agile environment. Clean and silent office. Fruits and Smusi.", "cons": "nothing to describe. The is no negative experience.", "advice": "Open door for any fresh new stack and technology."}, {"title": "Right in the middle", "text": "Pros Some fruits once in a while. Opportunity to try out new technologies. Office parties. Good starting expat job, they help with visa process. Cons Management does not really understand software development. You have to work more than 8 hours per day or you get a scandal from management. Random deadlines pop up for no reason. Pressure from management is sometimes non-existing but sometimes hardcore. (stressful). I would say if you are not a very quality focused individual, not processed focused, you will be fine. Advice to Management Educate yourselves on the software development process.", "rating": 3, "pros": "Some fruits once in a while.", "cons": "Management does not really understand software development.", "advice": "Educate yourselves on the software development process."}, {"title": "Dont follow that way", "text": "Pros some of the teams are nice Cons - small payments - expected over hours - constant priority change - lots of people come and go Advice to Management set up your own priorities and then expect that from people.", "rating": 1, "pros": "some of the teams are nice", "cons": "- small payments", "advice": "set up your own priorities and then expect that from people."}, {"title": "Tolles Unternehmen", "text": "Pros Nette Kollegen, Viel Spaß, angenehme Vorgesetzte Cons Es gibt keine Kontras bei McMakler", "rating": 5, "pros": "Nette Kollegen, Viel Spaß, angenehme Vorgesetzte", "cons": "Es gibt keine Kontras bei McMakler", "advice": null}, {"title": "Arbeit bei McMakler", "text": "Pros Junges, ambitioniertes Team, sehr gutes Arbeitsklima, Teamevents und gratis Getränke, frisch gepresster Saft und Rohkost. Kurze Entscheidungswege, Verwendung von neuen Technologien, sind an persönlicher Entwicklung interessiert und diese wird gefördert. Cons Ich habe aktuell nichts zu bemängeln", "rating": 5, "pros": "Junges, ambitioniertes Team, sehr gutes Arbeitsklima, Teamevents und gratis Getränke, frisch gepresster Saft und Rohkost. Kurze Entscheidungswege, Verwendung von neuen Technologien, sind an persönlicher Entwicklung interessiert und diese wird gefördert.", "cons": "Ich habe aktuell nichts zu bemängeln", "advice": null}, {"title": "Zukunftsorientiertes Unternehmen", "text": "Pros Klare Linie Gute Stimmung Viel Potenzial Hohe Verantwortung Cons Keine Parkmöglichkeiten Teils Großraumbüro (typisch Startup) Advice to Management Weiter so! Der Kurs stimmt!", "rating": 5, "pros": "Klare Linie", "cons": "Keine Parkmöglichkeiten", "advice": "Weiter so! Der Kurs stimmt!"}, {"title": "Nicht mehr als eine schöne Erfahrung. Viel Neues wird ausprobiert und dann verworfen. Es fehlt eine klare Linie", "text": "Pros Direkte Kommunikation. Ehrlichkeit gegenüber den Mitarbeitern. Start Up Mentalität für kurze Zeit. Cons Geringes Gehalt. Es wird nicht gefordert und gefördert. Keine Feedback Gespräche, wenig Kontakt zum HQ. Advice to Management Mitarbeiter fördern", "rating": 3, "pros": "Direkte Kommunikation. Ehrlichkeit gegenüber den Mitarbeitern. Start Up Mentalität für kurze Zeit.", "cons": "Geringes Gehalt. Es wird nicht gefordert und gefördert. Keine Feedback Gespräche, wenig Kontakt zum HQ.", "advice": "Mitarbeiter fördern"}, {"title": "Viel Erfahrung in kürzester Zeit", "text": "Pros Interessante Aufgaben Eigenverantwortliches Arbeiten Guter Zusammenhalt auch zwischen den Abteilungen Cons Die Büroausstattung könnte besser sein, wird aber auch stetig verbessert", "rating": 5, "pros": "Interessante Aufgaben", "cons": "Die Büroausstattung könnte besser sein, wird aber auch stetig verbessert", "advice": null}, {"title": "Praktikum ok", "text": "Pros - Gute Mitarbeiter, viel Spaß gehalb - Obst Cons - Aufgaben waren eher langweilig - Relativ wenig gelernt", "rating": 3, "pros": "- Gute Mitarbeiter, viel Spaß gehalb", "cons": "- Aufgaben waren eher langweilig", "advice": null}, {"title": "Sehr interessant", "text": "Pros Super Team Übernahme von viel Verantwortung Cons Unterschiedliche Bezahlung Praktikanten Sehr lange Arbeitszeiten Advice to Management Gleiche Bezahlung", "rating": 5, "pros": "Super Team", "cons": "Unterschiedliche Bezahlung Praktikanten", "advice": "Gleiche Bezahlung"}]