[{"title": "850 Lb Media Gorilla", "text": "Pros Diverse team. Market leader in media management agency software. Tons of perks around the office - game room, frequent food, monthly breakfasts, flexibility in office hours, well known brand in market, very intelligent team and organization Cons Office politics, a lot of chatter, some folks are bi-lingual in that they talk out of 2 sides of their mouths, sold to Vista Equity Partners in 2015, 20% lay off followed, sometimes too many projects going on at once makes delivering on customer needs and expectations challenging Advice to Management set measurable and attainable goals with clear expectations of what defines success and ability to receive full commissions or variable compensation bonus and put those goals, expectations on paper for both parties to sign and check in on throughout the year so that there should be few surprises", "rating": 5, "pros": "Diverse team. Market leader in media management agency software. Tons of perks around the office - game room, frequent food, monthly breakfasts, flexibility in office hours, well known brand in market, very intelligent team and organization", "cons": "Office politics, a lot of chatter, some folks are bi-lingual in that they talk out of 2 sides of their mouths, sold to Vista Equity Partners in 2015, 20% lay off followed, sometimes too many projects going on at once makes delivering on customer needs and expectations challenging", "advice": "set measurable and attainable goals with clear expectations of what defines success and ability to receive full commissions or variable compensation bonus and put those goals, expectations on paper for both parties to sign and check in on throughout the year so that there should be few surprises"}, {"title": "Great workplace, Surely recommended", "text": "Pros Work life balance Pleasant environment Amazing colleagues Cons Didn't find any as of now", "rating": 5, "pros": "Work life balance", "cons": "Didn't find any as of now", "advice": null}, {"title": "Welcoming to All Skill Levels", "text": "Pros -Interview process was pretty streamlined -Surrounded by people willing to help you -Bagel Wednesday :D -Proper training to prepare your for the role -Relaxed work environment Cons -401k match could be greater -Most likely will have teammates in a separate location Basically, if you're a developer that prefers to interact with people directly around you, be ready to adjust to Internet calling and messaging as your only forms of team interaction. Nothing else to really cite as a true negative regarding the job itself. Advice to Management It's already trending upward, but a greater match for 401k would be appreciated.", "rating": 5, "pros": "-Interview process was pretty streamlined", "cons": "-401k match could be greater", "advice": "It's already trending upward, but a greater match for 401k would be appreciated."}, {"title": "Great company and workplace, highly recommended!", "text": "Pros Amazing people and work life balance, no complaints here! Leadership is fantastic as well. Cons Pay could be a little better", "rating": 5, "pros": "Amazing people and work life balance, no complaints here! Leadership is fantastic as well.", "cons": "Pay could be a little better", "advice": null}, {"title": "QA Automation Engineer", "text": "Pros Work was good; increased skill-set to be valuable in market. Cons Flexibility for work at home was lacking.", "rating": 5, "pros": "Work was good; increased skill-set to be valuable in market.", "cons": "Flexibility for work at home was lacking.", "advice": null}, {"title": "Enjoyed My Time There", "text": "Pros I worked with some great people. No complaints. Cons After the Vista Equity purchase, things went down hill. Very disappointing.", "rating": 5, "pros": "I worked with some great people. No complaints.", "cons": "After the Vista Equity purchase, things went down hill. Very disappointing.", "advice": null}, {"title": "Customer Support", "text": "Pros Interesting & challenging work, great people, strong management Cons There are no cons! Very happy with my career.", "rating": 5, "pros": "Interesting & challenging work, great people, strong management", "cons": "There are no cons! Very happy with my career.", "advice": null}, {"title": "Old Sinking Ship", "text": "Pros - Excellent work life balance - Fast paced - Solid opportunity to gain exposure to AdTech industry Cons - Very low salary, way below market rate - Raises will be cost of living, don't expect actual promotion raises even if you get new title - Highly disorganized/dysfunctional corporate culture which stems from C-Level downwards - Generally inadequate middle management without experience or ability to manage teams and individuals - Poor investments into companies that have no panned out Summary: Mediaocean is a sinking ship. They sold themselves to Vista in order to get cash to acquire some companies with products that they hoped would become \"stars\" for them. Instead those acquired companies have basically failed and haven't generated any revenue so to speak. The company survives through the continued dependence on their very old cash cow software which is ripe for disruption. Do not take a job at Mediaocean unless you have no other options what-so-ever. This is a sinking ship. You will be overworked, underpaid and watch as this company gets acquired again.", "rating": 3, "pros": "- Excellent work life balance", "cons": "- Very low salary, way below market rate", "advice": null}, {"title": "MBuy", "text": "Pros Great Benefits, Open and Honest workplace culture, Good Work-Life Balance. Cons Pay isn't horrible but could definitely be much more competitive.", "rating": 5, "pros": "Great Benefits, Open and Honest workplace culture, Good Work-Life Balance.", "cons": "Pay isn't horrible but could definitely be much more competitive.", "advice": null}, {"title": "Great people, culture, and office space", "text": "Pros There's a consensus among the employees at Mediaocean that the best thing about the company is it's people. Everyone is super friendly, the New York office space is gorgeous, and there is a great culture; during a happy hour, the CEO randomly decided to roll a bar on wheels to pour margaritas to all of his employees; truly a man of the people. Cons Unfortunately my tenure was not long. Expectations were not clear. I worked overtime every day, going above and beyond, and was getting great feedback so the termination felt very sudden and out of the blue. Advice to Management Don't shy away from negative feedback to employees so it is not a surprise when they get terminated. Also, implement a system so that potential for career advancement is clear to employees.", "rating": 5, "pros": "There's a consensus among the employees at Mediaocean that the best thing about the company is it's people. Everyone is super friendly, the New York office space is gorgeous, and there is a great culture; during a happy hour, the CEO randomly decided to roll a bar on wheels to pour margaritas to all of his employees; truly a man of the people.", "cons": "Unfortunately my tenure was not long. Expectations were not clear. I worked overtime every day, going above and beyond, and was getting great feedback so the termination felt very sudden and out of the blue.", "advice": "Don't shy away from negative feedback to employees so it is not a surprise when they get terminated. Also, implement a system so that potential for career advancement is clear to employees."}, {"title": "QA", "text": "Pros Fun place to work, lots of social events Cons Low salary increases. Low opportunity to work on other projects", "rating": 3, "pros": "Fun place to work, lots of social events", "cons": "Low salary increases. Low opportunity to work on other projects", "advice": null}, {"title": "Company/Culture has changed since VCG took over.", "text": "Pros Fast paced Challenging Unlimited PTO Talented folks Good location Cons Lack of leadership and vision for the future Boys club False promises Mismanagement Advice to Management Ensure you have the right people in leadership roles; take care of valuable employees even if they aren't the most popular choice.", "rating": 3, "pros": "Fast paced Challenging Unlimited PTO", "cons": "Lack of leadership and vision for the future", "advice": "Ensure you have the right people in leadership roles; take care of valuable employees even if they aren't the most popular choice."}, {"title": "Bad vibes from Day 1", "text": "Pros Industry leader with little competition. Great downtown Chicago location. Lots of opportunity to learn and self train. Cons Vista is constantly looking over your shoulder, has management scared and ready to cut people/costs. Advice to Management Do nothing if all you care about is the margins, but you're headed for an IT catastrophe if you don't find a way to keep talent.", "rating": 1, "pros": "Industry leader with little competition. Great downtown Chicago location. Lots of opportunity to learn and self train.", "cons": "Vista is constantly looking over your shoulder, has management scared and ready to cut people/costs.", "advice": "Do nothing if all you care about is the margins, but you're headed for an IT catastrophe if you don't find a way to keep talent."}, {"title": "Professional workplace that allows flexiblity", "text": "Pros Staff is friendly, welcoming and diverse Great work life balance with the hours you're expected to work. Cons Salaries, benefits, and perks are on the low side. I assume that the PE that acquired MO is keeping overhead as low as possible.", "rating": 5, "pros": "Staff is friendly, welcoming and diverse", "cons": "Salaries, benefits, and perks are on the low side. I assume that the PE that acquired MO is keeping overhead as low as possible.", "advice": null}, {"title": "Great Working Environment", "text": "Pros There is a big focus on training and personal development, and on ensuring you're on the career track that best suits your skills and where you want to go in life. Nice work/life balance, especially with unlimited PTO. Fun office environment and perks. Cons Somewhat meeting-heavy business environment. There are meetings to set up meetings. 401K match is pretty low. Advice to Management Always ensure you are illustrating where the company is going and how each division helps get it there.", "rating": 5, "pros": "There is a big focus on training and personal development, and on ensuring you're on the career track that best suits your skills and where you want to go in life. Nice work/life balance, especially with unlimited PTO. Fun office environment and perks.", "cons": "Somewhat meeting-heavy business environment. There are meetings to set up meetings. 401K match is pretty low.", "advice": "Always ensure you are illustrating where the company is going and how each division helps get it there."}, {"title": "Great Company To Work For", "text": "Pros Mediaocean has been everything I hoped for in a company when I began my job search. The interview process was thorough with a test, multiple phone interviews and a final face to face interview. It was clear from the beginning that they wanted to find the right person to join Mediaocean. Once you join, there is an actual on-boarding process instead of just throwing you in the deep end like most companies I’ve worked for in the past. The people are friendly and caring who want to be the best at what they do. My coworkers are always willing to help me learn and respond to any questions I have. The perks of the job are unbelievable with multiple happy hours in a month, free bagels on Wednesdays and plenty of trips to Wrigley. I could not be any happier with my decision to join the company. Cons There really aren’t many cons at the company besides general business things that you have to deal with where ever you are employed. The on-board training is three long days but is a very important necessity. You might have a meeting moved around here or there and somethings might get pushed back. My biggest complaint would be the 401k match is small but it is a YOYO economy (You’re On Your Own). Needless to say, the positives out way the negatives by a landslide. Advice to Management Keep doing what your doing. This is definitely a Theory Z workplace.", "rating": 5, "pros": "Mediaocean has been everything I hoped for in a company when I began my job search. The interview process was thorough with a test, multiple phone interviews and a final face to face interview. It was clear from the beginning that they wanted to find the right person to join Mediaocean. Once you join, there is an actual on-boarding process instead of just throwing you in the deep end like most companies I’ve worked for in the past. The people are friendly and caring who want to be the best at what they do. My coworkers are always willing to help me learn and respond to any questions I have. The perks of the job are unbelievable with multiple happy hours in a month, free bagels on Wednesdays and plenty of trips to Wrigley. I could not be any happier with my decision to join the company.", "cons": "There really aren’t many cons at the company besides general business things that you have to deal with where ever you are employed. The on-board training is three long days but is a very important necessity. You might have a meeting moved around here or there and somethings might get pushed back. My biggest complaint would be the 401k match is small but it is a YOYO economy (You’re On Your Own). Needless to say, the positives out way the negatives by a landslide.", "advice": "Keep doing what your doing. This is definitely a Theory Z workplace."}, {"title": "Growing pains", "text": "Pros Great coworkers, fun culture, and a growing organization. Cons * Focus on hiring not on retaining employees. * Pay is below industry standard. * Basically HR is non-existent Advice to Management *Take better care of your existing employees. *Offer yearly bonuses to employees who are contributing to organizational growth. * Promote on all levels , not just at the very top.", "rating": 3, "pros": "Great coworkers, fun culture, and a growing organization.", "cons": "* Focus on hiring not on retaining employees.", "advice": "*Take better care of your existing employees. *Offer yearly bonuses to employees who are contributing to organizational growth."}, {"title": "Challenging and Fun", "text": "Pros Challenging atmosphere to work in Good people all around guiding you when ever you need any help Lot to learn because of the fast paced industry Cons Sometimes disorganized as too many things are looked into at a single time", "rating": 5, "pros": "Challenging atmosphere to work in", "cons": "Sometimes disorganized as too many things are looked into at a single time", "advice": null}, {"title": "working at Mediaocean", "text": "Pros Great location and offices Fun people to work with Cons Owned by Vista Equity Partners Advice to Management None", "rating": 3, "pros": "Great location and offices", "cons": "Owned by Vista Equity Partners", "advice": "None"}, {"title": "getting worst", "text": "Pros scope to learn visibility at work great location Cons owned by Vista Equity Partners management job security Advice to Management keep your feet on ground, improve product quality and give jobs to people in US", "rating": 3, "pros": "scope to learn", "cons": "owned by Vista Equity Partners", "advice": "keep your feet on ground, improve product quality and give jobs to people in US"}, {"title": "Software dev", "text": "Pros Interesting technology and good location. Cons Low pay, poor benefits and the work envy is awful. People aren't helpful - it's every man for himself. Magement is awful no clue of who is doing what. Some unethical behavior by management related to inappropriate internet. Wierd place to work.", "rating": 1, "pros": "Interesting technology and good location.", "cons": "Low pay, poor benefits and the work envy is awful. People aren't helpful - it's every man for himself. Magement is awful no clue of who is doing what. Some unethical behavior by management related to inappropriate internet. Wierd place to work.", "advice": null}, {"title": "Support Specialist II", "text": "Pros Unlimited PTO Provides time off for volunteer opportunities Cons Company does not care about the satellite offices outside of the New York office. No career advancement opportunities outside of the New York office Advice to Management I would recommend stop giving employees false hopes on new positions, trainings, and new opportunities that do not exist.", "rating": 3, "pros": "Unlimited PTO", "cons": "Company does not care about the satellite offices outside of the New York office.", "advice": "I would recommend stop giving employees false hopes on new positions, trainings, and new opportunities that do not exist."}, {"title": "Downhill over past years", "text": "Pros Dedicated, working people who still keep this ship afloat. Cons Eroding people-oriented culture, which is getting replaced by hectic attempts by new owners to increase profits and massive outsourcing to other country. Advice to Management Restore moral, improve product quality and give jobs to people in US.", "rating": 3, "pros": "Dedicated, working people who still keep this ship afloat.", "cons": "Eroding people-oriented culture, which is getting replaced by hectic attempts by new owners to increase profits and massive outsourcing to other country.", "advice": "Restore moral, improve product quality and give jobs to people in US."}, {"title": "Was Great - Now Awful- Dont Believe The Hype", "text": "Pros Depending on the team, some really great people. NYC office is in a great location. Cons Salary - bad benefits, crappy management that will lie to your face and act like they are doing you a favor. CEO walks around acting like he's superstar. Wants to be loved by all. Will ask you questions and has an open door policy but never listen to the answers. He just starts talking about himself. Man, he loves to talk about himself. He hires his pals for all of the open C- level positions. The people he keeps closest are the ones who yes him to death and make him feel special. One of the \"leaders\" he brought in a few years ago constantly says \"when I knew Bill at Yahoo\" so often that we're all like \"yes yes we know... thanks for telling us, again\". There is no growth here. Very few people actually move up. Sometimes the wrong ones do, but that happens everywhere. For new people leaving reviews saying there's growth opportunities, that's because there has been massive layoff, many rounds. So there is room when that happens but otherwise many people have been in the exact same roles for years. 5,10,15 etc without a promotion. Mediaocean was 2 competitors that merged with 2 very different cultures. Much has been replaced or more like, the culture really met in the middle. But there are people from both sides that hate the other and REFUSE to change the way they do anything. They re-org their internal structure so often, about 3 or 4 times times a year. Re-assigning teams and roles. They have a few team leaders who everyone HATES, the clients, and the MO personnel working for them. But for some reason keep those lazy, no good, do nothing, pass everything off, client ignoring account directors or SADs in place. They also blame EVERYTHING on Vista (the equity company that purchased them). You want to work from home? No you can't, Vista - a few months later, it was stated it really just depends on your manager. Vista is always their first response for motivation. Then after a change doesn't go over well the story changes. Advice to Management None, as they don't want hear it. They got MASSIVE payouts from the Vista buyout and are only there until their contracts are up. Then they will jump ship, once they can do so.", "rating": 1, "pros": "Depending on the team, some really great people.", "cons": "Salary - bad benefits, crappy management that will lie to your face and act like they are doing you a favor.", "advice": "None, as they don't want hear it. They got MASSIVE payouts from the Vista buyout and are only there until their contracts are up. Then they will jump ship, once they can do so."}, {"title": "Great environment", "text": "Pros Everyone at the company is very friendly and it is a great environment. Lots of opportunities to grow and develop with the company as it continues to grow. Cons It may bother some employees that they have an open layout in the office, no one including the CEO have their desk behind a closed door.", "rating": 5, "pros": "Everyone at the company is very friendly and it is a great environment. Lots of opportunities to grow and develop with the company as it continues to grow.", "cons": "It may bother some employees that they have an open layout in the office, no one including the CEO have their desk behind a closed door.", "advice": null}, {"title": "Tense Environment - Job security a concern", "text": "Pros industry leading company; Adopts current technology; Stays abreast with the latest trends in the media industry Cons Upper management decisions are controlled by the venture capitalist firm (Vista); job performance is secondary to profit; jobs increasingly awarded overseas and to H1-B visa holders (not their fault of course)", "rating": 3, "pros": "industry leading company; Adopts current technology; Stays abreast with the latest trends in the media industry", "cons": "Upper management decisions are controlled by the venture capitalist firm (Vista); job performance is secondary to profit; jobs increasingly awarded overseas and to H1-B visa holders (not their fault of course)", "advice": null}, {"title": "Acquisition? You may not be there long", "text": "Pros It may be ok if you weren't part of an acquisition Cons 401K match is a joke", "rating": 3, "pros": "It may be ok if you weren't part of an acquisition", "cons": "401K match is a joke", "advice": null}, {"title": "Best software company I've ever worked at over 15+ year career", "text": "Pros Culture is great. No politics. People are professional and willing to help. Leadership genuinely tries to balance doing what is right for the company, clients and the employees. Healthy technology stack and processes: java, spring, spring boot, maven, mongo, oracle, docker, git, jenkins, knockout, bootstrap, grunt, require js, bower. People who don't perform or who have attitude problem will be given chances to improve but will be let go if they don't change. This sounds cold but those kind of people can be cancerous to others. The company is well positioned to grow. It has a stronghold on the traditional media world. However, with the changes in the way media is consumed, there is a lot of change and potential for growth. Cons - No bonuses - 401k matching is soft - Development teams are spread across multiple teams. This is both bad and good.", "rating": 5, "pros": "Culture is great. No politics. People are professional and willing to help. Leadership genuinely tries to balance doing what is right for the company, clients and the employees.", "cons": "- No bonuses", "advice": null}, {"title": "Slow pace of growth", "text": "Pros Good balance of work and life. I work in the IT sector. Not many new opportunities, but to work on existing set of technology stack Cons Slow pace of growth, and no attractive perks. Advice to Management Need more vibrant force in the senior management who can make changes in the short term to fuel the growth", "rating": 3, "pros": "Good balance of work and life. I work in the IT sector. Not many new opportunities, but to work on existing set of technology stack", "cons": "Slow pace of growth, and no attractive perks.", "advice": "Need more vibrant force in the senior management who can make changes in the short term to fuel the growth"}, {"title": "Corrupt", "text": "Pros Good work-life balance, cool perks, offices in great neighborhoods Cons Salary is extremely low. The company exploits recent graduates desperate for jobs and offer them salaries that are laughable. This makes it close to impossible to live in city while paying student loans. Men and women paid differently for doing the same job. Make a lot of empty promises about career/employee development while never delivering. Upper management rakes in all of the money, junior level employees make laughable salaries and struggle to pay off loans. Advice to Management Treat your employees like humans with expenses.", "rating": 1, "pros": "Good work-life balance, cool perks, offices in great neighborhoods", "cons": "Salary is extremely low. The company exploits recent graduates desperate for jobs and offer them salaries that are laughable. This makes it close to impossible to live in city while paying student loans. Men and women paid differently for doing the same job. Make a lot of empty promises about career/employee development while never delivering. Upper management rakes in all of the money, junior level employees make laughable salaries and struggle to pay off loans.", "advice": "Treat your employees like humans with expenses."}, {"title": "Gone downhill", "text": "Pros -Most people are genuine. -Great area to work in (Chelsea). Cons -Management, or lack there of -A once great company has turned into a cold place where everyone is just a number Advice to Management Appreciate the people that are keeping that place afloat.", "rating": 1, "pros": "-Most people are genuine.", "cons": "-Management, or lack there of", "advice": "Appreciate the people that are keeping that place afloat."}, {"title": "Great New Job", "text": "Pros Welcoming, friendly environment. Lots of people available to reach out to. Great office location for commuting via train. Cons Lots of growth, so a lot of other people are new to their jobs as well.", "rating": 5, "pros": "Welcoming, friendly environment. Lots of people available to reach out to. Great office location for commuting via train.", "cons": "Lots of growth, so a lot of other people are new to their jobs as well.", "advice": null}, {"title": "So far so good!", "text": "Pros PTO time is fantastic, great environment, everyone is really nice and the work is challenging. Great location, supervisors are awesome. No one micromanaged what you do and you are allowed to work on your own to get everything done. No one breathing down your neck making sure you show up at an exact time or leave at an exact time. Cons Insurance could be better, 401k match is laughable.", "rating": 5, "pros": "PTO time is fantastic, great environment, everyone is really nice and the work is challenging. Great location, supervisors are awesome. No one micromanaged what you do and you are allowed to work on your own to get everything done. No one breathing down your neck making sure you show up at an exact time or leave at an exact time.", "cons": "Insurance could be better, 401k match is laughable.", "advice": null}, {"title": "avoid", "text": "Pros good sales and customer service Cons not agile not competitive too slow", "rating": 1, "pros": "good sales and customer service", "cons": "not agile not competitive too slow", "advice": null}, {"title": "Overall very positive, but there are growing pains", "text": "Pros The company has a great culture and environment. The leadership team does a great job engaging with employees and creating an open, transparent culture. There are also lots of perks for employees that have come to be expected from software/tech companies: happy hours, catered breakfasts, yoga, video games, etc. The media/ad industry is fast paced as it is, and the technology in the sector is constantly evolving. It's a great place to be for personal career development and growth. Cons Like any growing company, there are pains. The product suite, employee base, and target markets have grown considerably in a short period of time. Along with that comes uncertainty and change as the organization adjusts to it's new model and structure. It can often feel like ambiguity or a lack of direction to some, but that doesn't mean the change is not in the best interest of the company. If you're looking for a run of the mill 9 to 5 to accomplish the same 5 tasks every day with no variety or growth in your role, this is probably not the place for you. Advice to Management Keep doing what you're doing. There are lots of good, smart people in this company. It can feel political at times on some of the decision making and employees can sense it.", "rating": 5, "pros": "The company has a great culture and environment. The leadership team does a great job engaging with employees and creating an open, transparent culture. There are also lots of perks for employees that have come to be expected from software/tech companies: happy hours, catered breakfasts, yoga, video games, etc.", "cons": "Like any growing company, there are pains. The product suite, employee base, and target markets have grown considerably in a short period of time. Along with that comes uncertainty and change as the organization adjusts to it's new model and structure. It can often feel like ambiguity or a lack of direction to some, but that doesn't mean the change is not in the best interest of the company.", "advice": "Keep doing what you're doing. There are lots of good, smart people in this company. It can feel political at times on some of the decision making and employees can sense it."}, {"title": "Great Place to Work", "text": "Pros Great people Rapidly growing Encourages a solid work-life balance Open and collaborative culture Cons Because of the rapid growth of the firm there are definitely growing pains -- changes to team structure, moving from a mid-sized firm to a larger firm. I think these items are managed well by the management team with Quarterly All-Hands to keep all employees informed, etc., but change can sometimes be difficult for those who are not expecting it. Advice to Management Continue to keep a strong culture among the team as MO grows further.", "rating": 5, "pros": "Great people", "cons": "Because of the rapid growth of the firm there are definitely growing pains -- changes to team structure, moving from a mid-sized firm to a larger firm. I think these items are managed well by the management team with Quarterly All-Hands to keep all employees informed, etc., but change can sometimes be difficult for those who are not expecting it.", "advice": "Continue to keep a strong culture among the team as MO grows further."}, {"title": "OK place to work", "text": "Pros They have Innovative technology, and many good people Cons Teams do not talk to each other. Advice to Management Needs a better overall plan for company", "rating": 3, "pros": "They have Innovative technology, and many good people", "cons": "Teams do not talk to each other.", "advice": "Needs a better overall plan for company"}, {"title": "Good company to work for", "text": "Pros Good company to work for Offers flexibility Open to ideas Cons Offering 401k would be good", "rating": 5, "pros": "Good company to work for", "cons": "Offering 401k would be good", "advice": null}, {"title": "Mediaocean in Chicago", "text": "Pros Well known organization within its industry space. Largest company of its type worldwide. Cons Tendency to \"build the plane while flying it\". Over promise to the client and then figure out how it's going to be developed. Advice to Management Cut the cliques. Invest in process & product development. Deliver and over deliver on client commitments.", "rating": 3, "pros": "Well known organization within its industry space. Largest company of its type worldwide.", "cons": "Tendency to \"build the plane while flying it\". Over promise to the client and then figure out how it's going to be developed.", "advice": "Cut the cliques. Invest in process & product development. Deliver and over deliver on client commitments."}, {"title": "Mediaocean", "text": "Pros There is some folks who have been there a long time and they are a good group of people. There is a good amount of comraderie within some of the teams. Cons There isn't always clear direction given and not a lot of support given from upper management. It no longer feels like the company cares about the individuals. It began to feel like we were just a body.", "rating": 3, "pros": "There is some folks who have been there a long time and they are a good group of people. There is a good amount of comraderie within some of the teams.", "cons": "There isn't always clear direction given and not a lot of support given from upper management. It no longer feels like the company cares about the individuals. It began to feel like we were just a body.", "advice": null}, {"title": "Work place for passionate and innovative people", "text": "Pros Open culture and strong leadership team. Good perks/ benefits for employees. A great opportunity to work and learn with the teams across the globe. Cons None to mention.No cons as such.", "rating": 5, "pros": "Open culture and strong leadership team. Good perks/ benefits for employees. A great opportunity to work and learn with the teams across the globe.", "cons": "None to mention.No cons as such.", "advice": null}, {"title": "Intern", "text": "Pros It was a pleasure working there. There were multiple times that I was offered different learning opportunities and the great culture within and between all departments. As an intern I thought I would be going on coffee runs and making copies, I never did those things and was very hands on. I loved that I was involved in and helped with things that were benefitting the company as a whole. Cons No cons for this company", "rating": 5, "pros": "It was a pleasure working there. There were multiple times that I was offered different learning opportunities and the great culture within and between all departments. As an intern I thought I would be going on coffee runs and making copies, I never did those things and was very hands on. I loved that I was involved in and helped with things that were benefitting the company as a whole.", "cons": "No cons for this company", "advice": null}, {"title": "Room for improvement", "text": "Pros Great people, good experience, some employee perks (e.g. yoga, weekly manicure services on site) Cons No work life balance, overworked", "rating": 3, "pros": "Great people, good experience, some employee perks (e.g. yoga, weekly manicure services on site)", "cons": "No work life balance, overworked", "advice": null}, {"title": "Working environment", "text": "Pros Good environment, great team bonding, can choose for long term if no politics involved. Cons Lack of appreciation even for doing good work, more politics Advice to Management Take genuine feedback from a employee who is leaving organization after a long term to see the issue and you will come to know reality.", "rating": 5, "pros": "Good environment, great team bonding, can choose for long term if no politics involved.", "cons": "Lack of appreciation even for doing good work, more politics", "advice": "Take genuine feedback from a employee who is leaving organization after a long term to see the issue and you will come to know reality."}, {"title": "Executive", "text": "Pros A fast moving company with a huge amount of potential and actively disrupting the status quo of adtech by creating one platform that allows functionality for all media types and all transaction activities. If you like building technology that matters, and creating solutions to historical problems that need to be solved, this is for you. Cons If you are not willing to be flexible and willing to adapt to a fast-moving landscape, you probably will not fit in. Some people insisted on being told what to do, rather than figuring out how to best help make things happen, and those people were not happy in an environment as fast-paced as MO. Advice to Management Focus on helping people understand the value of being flexible.", "rating": 5, "pros": "A fast moving company with a huge amount of potential and actively disrupting the status quo of adtech by creating one platform that allows functionality for all media types and all transaction activities. If you like building technology that matters, and creating solutions to historical problems that need to be solved, this is for you.", "cons": "If you are not willing to be flexible and willing to adapt to a fast-moving landscape, you probably will not fit in. Some people insisted on being told what to do, rather than figuring out how to best help make things happen, and those people were not happy in an environment as fast-paced as MO.", "advice": "Focus on helping people understand the value of being flexible."}, {"title": "Great place to work", "text": "Pros Love it here - fast growing Cons None really, lovely place to work Advice to Management None", "rating": 5, "pros": "Love it here - fast growing", "cons": "None really, lovely place to work", "advice": "None"}, {"title": "New Year", "text": "Pros Good people and a great culture. Definitely going somewhere and soon! Moving offices to the West Loop location, which helps commuters. Cons I do not have any complaints at this time. Good company, good people! Need to make moves!", "rating": 5, "pros": "Good people and a great culture. Definitely going somewhere and soon! Moving offices to the West Loop location, which helps commuters.", "cons": "I do not have any complaints at this time. Good company, good people! Need to make moves!", "advice": null}, {"title": "Sr. QA Automation Engineer", "text": "Pros Great company. The Senior team is very dynamic and forward thinker. Great work-life balanced Cons There were too many products. Advice to Management Some products need to be consolidated.", "rating": 5, "pros": "Great company. The Senior team is very dynamic and forward thinker. Great work-life balanced", "cons": "There were too many products.", "advice": "Some products need to be consolidated."}, {"title": "Times Have Changed", "text": "Pros Amazing co-workers, nice perks/benefits. Company had a family feel for years, but that is quickly fading. So many smart and dedicated people working there. They deserve better. Cons Corporate greed has taken over the family feel. Sign of the times. No one seems to care about the clients anymore and after they were purchased last year, the new owners decimated the core of the company with a huge layoff....first of several I am sure. Morale is at an all time low and at this point probably cannot recover. CEO is awesome, but no one expects him to to stick around much longer. Advice to Management mostly corporate puppets at this point, but I say listen to your clients before they decide to abandon ship. The company is better than this.", "rating": 5, "pros": "Amazing co-workers, nice perks/benefits. Company had a family feel for years, but that is quickly fading. So many smart and dedicated people working there. They deserve better.", "cons": "Corporate greed has taken over the family feel. Sign of the times. No one seems to care about the clients anymore and after they were purchased last year, the new owners decimated the core of the company with a huge layoff....first of several I am sure. Morale is at an all time low and at this point probably cannot recover. CEO is awesome, but no one expects him to to stick around much longer.", "advice": "mostly corporate puppets at this point, but I say listen to your clients before they decide to abandon ship. The company is better than this."}, {"title": "Change is a good thing", "text": "Pros The people and culture and everyone is hard working. Cons uncertainty can be scary but the growth and potential is well worth it. Advice to Management Keep doing what you doing. It might be hard but change always is but its for the better.", "rating": 5, "pros": "The people and culture and everyone is hard working.", "cons": "uncertainty can be scary but the growth and potential is well worth it.", "advice": "Keep doing what you doing. It might be hard but change always is but its for the better."}, {"title": "Great Chalenges", "text": "Pros Multi-platform systems to learn and support Cons Access to New York office", "rating": 5, "pros": "Multi-platform systems to learn and support", "cons": "Access to New York office", "advice": null}, {"title": "Promising start to a positive future", "text": "Pros Mediaocean encourages an open-door, collaborative environment that boosts morale. I enjoy the casual dress and weekly happy hours. I feel appreciated as an employee. There is an interesting dynamic being owned by an equity firm because there is room to grow inside the company as well as within the equity's portfolio. I have been at Mediaocean for a few months now and I feel as though this is a promising start for my career. Cons No matching 401k for current employees", "rating": 5, "pros": "Mediaocean encourages an open-door, collaborative environment that boosts morale. I enjoy the casual dress and weekly happy hours. I feel appreciated as an employee. There is an interesting dynamic being owned by an equity firm because there is room to grow inside the company as well as within the equity's portfolio. I have been at Mediaocean for a few months now and I feel as though this is a promising start for my career.", "cons": "No matching 401k for current employees", "advice": null}, {"title": "QA Analyst", "text": "Pros Mediaocean is a great place to work, there are a lot of opportunities and interesting projects to work on. There is a softball team for anybody who likes to play sport, and tons of opportunities for women in tech, a wonderful program Mediaocean leands in NYC. Cons The company is located in an area with too many stores in a walking distance. There are too many shopping options for a lunch break", "rating": 5, "pros": "Mediaocean is a great place to work, there are a lot of opportunities and interesting projects to work on. There is a softball team for anybody who likes to play sport, and tons of opportunities for women in tech, a wonderful program Mediaocean leands in NYC.", "cons": "The company is located in an area with too many stores in a walking distance. There are too many shopping options for a lunch break", "advice": null}, {"title": "Not worth the time or effort", "text": "Pros Company elaborate events every year Cons The entire upper management team", "rating": 3, "pros": "Company elaborate events every year", "cons": "The entire upper management team", "advice": null}, {"title": "The whole truth and nothing but the truth", "text": "Pros Compared to every area of Mediaocean, Support is by far the most structured and accountable department. I can't speak for the other areas of the company, but they should take note of it. Regarding people, every job has a good handful of jerks, but the majority of the Mediaocean population are non-jerks. I'll take it! Hopefully the culture that has been built over the past several years continues. Depending on the direction of the new ownership, this can become a con. Cons Legacy structure still has an impact today. Some people are incapable of change and it impacts the work of those invested in being successful. Just because some process you do everyday worked for you in 1983 does not mean this is a good idea now. Another negative is the uncertainty at this time. Since the acquisition there is a lot of confusion on who does what and a lot of procedural changes. This should work itself out over time. This isn't the first major change this company has gone through since we are still only a few years removed from the merge. The Pune office is a big con. I'm not sure if they undergo the same training as the rest of the company but they routinely seem out of the loop and unsure of how our products are actually being used. This is a big gap and not one I think will be fixed. Advice to Management Take a serious look at what works and what doesn't. Every year support hits their goals and makes the rest of the company look good. Other departments should follow that lead. It's possible to hit your personal bottom line and push the company forward in a satisfying and productive way, but it is not possible without strong leadership. If you don't have the guts to live up to your title, you don't deserve it. Everyone is depending on their leaders to get them through this time of change and uncertainty and achieve success. Make it happen, management.", "rating": 5, "pros": "Compared to every area of Mediaocean, Support is by far the most structured and accountable department. I can't speak for the other areas of the company, but they should take note of it.", "cons": "Legacy structure still has an impact today. Some people are incapable of change and it impacts the work of those invested in being successful. Just because some process you do everyday worked for you in 1983 does not mean this is a good idea now.", "advice": "Take a serious look at what works and what doesn't. Every year support hits their goals and makes the rest of the company look good. Other departments should follow that lead."}, {"title": "Lead Automation Engineer", "text": "Pros work env is good. Great team members. Cons Career growth is not that much. you stuck at current position for a long time Advice to Management Take care of the hard working people", "rating": 5, "pros": "work env is good. Great team members.", "cons": "Career growth is not that much. you stuck at current position for a long time", "advice": "Take care of the hard working people"}, {"title": "Downhill", "text": "Pros The New York location is truly great. Near all food and shopping, easy commute from NJ/Path. The long term veterans of the older companies pre-merger are good technologists and good people. For the technologist, this is an old mainframe shop-- you'll see fairly rare stuff here! The CEO is very good. Cons The original owners retired. The first set of new owners wanted nothing more than an IPO. When the revenue numbers did not support it, they bailed fast. The current owners are a full-on \"Bob and bob\" cast. They are basically going to squeeze as much as they can out of cost. I have never seen a micromanagement situation as bad as what was going on here. Advice to Management Act like the company has a future. Instruct middle management to do likewise.", "rating": 3, "pros": "The New York location is truly great. Near all food and shopping, easy commute from NJ/Path.", "cons": "The original owners retired. The first set of new owners wanted nothing more than an IPO. When the revenue numbers did not support it, they bailed fast. The current owners are a full-on \"Bob and bob\" cast. They are basically going to squeeze as much as they can out of cost.", "advice": "Act like the company has a future. Instruct middle management to do likewise."}, {"title": "Word to Wise", "text": "Pros Very innovative and fun. Folks worked hard but also knew how to have fun and not take themselves too seriously. When you have engaged, smart employees everything seems to work a bit smoother. Cons After acquisition, it became uber corporate and various teams saw changes which seem to inhibit the lifeblood of the company - the employees. Everything is under such scrutiny that no one wants to take the initiative. Advice to Management Get back to basics. Make working there fun again. You are slowly draining the energy from the organization and driving away good folks after cutting other good folks.", "rating": 5, "pros": "Very innovative and fun. Folks worked hard but also knew how to have fun and not take themselves too seriously. When you have engaged, smart employees everything seems to work a bit smoother.", "cons": "After acquisition, it became uber corporate and various teams saw changes which seem to inhibit the lifeblood of the company - the employees. Everything is under such scrutiny that no one wants to take the initiative.", "advice": "Get back to basics. Make working there fun again. You are slowly draining the energy from the organization and driving away good folks after cutting other good folks."}, {"title": "Great Company, Great People", "text": "Pros Mediaocean provides the type of culture every company should strive for, the openness from management and executives keeps employees in the know. The company is constantly looking for ways to advance and restructuring to help make it's departments the most successful they can be and Mediaocean a leader in the business. The people at Mediaocean are what really make this company great, from top down there are driven, smart hard working folks who appreciate the time and effort of the employees. As an employee benefits and perks are fantastic, Mediaocean goes out of their way to provide a fun environment and ways to thank employees for all their hard work. Cons None to mention, maybe an upgrade to the coffee", "rating": 5, "pros": "Mediaocean provides the type of culture every company should strive for, the openness from management and executives keeps employees in the know. The company is constantly looking for ways to advance and restructuring to help make it's departments the most successful they can be and Mediaocean a leader in the business. The people at Mediaocean are what really make this company great, from top down there are driven, smart hard working folks who appreciate the time and effort of the employees. As an employee benefits and perks are fantastic, Mediaocean goes out of their way to provide a fun environment and ways to thank employees for all their hard work.", "cons": "None to mention, maybe an upgrade to the coffee", "advice": null}, {"title": "Great Company", "text": "Pros 1-Great work/life balance. 2-Fun work environment. 3-Modern office. Cons New employees should be trained more efficiently. Advice to Management Focus on training new employees", "rating": 5, "pros": "1-Great work/life balance.", "cons": "New employees should be trained more efficiently.", "advice": "Focus on training new employees"}, {"title": "QA Analyst", "text": "Pros - Long stretches of time where Management was communicative and would seem to strive to create a healthy and productive work environment - The product portfolio and work is actually very interesting. You wonder where the days go at times when you are thoroughly engrossed on a project - Depending on the Team you are working for you may luck out and have great managers and a true sense of teamwork with your co-workers (like you are all in it together) Cons - Short and disturbing stretches where Management will communicate one objective but then execute another. This leaves employees wondering whether they have a solid future with this company. Also layoffs don't set a good tone when you are clearly profitable. It's certainly not the employees' fault that management can't make their targets - While the product portfolio is interesting it is extremely bug ridden (as the Client's are more than well aware of). This is a company that constantly over promises and under-delivers both in terms of product functionality, quality and speed (rush to release) - Depending on the Team you are working for, you may NOT luck out and have horrible managers who are tone deaf (and nasty). Or you may belong to a Team where everyone is simply watching their back and pointing fingers when a problem arises Advice to Management There really is not much more I can say. The pros and cons speak to the areas where management has done well and areas where they need to clean up their act..", "rating": 3, "pros": "- Long stretches of time where Management was communicative and would seem to strive to create a healthy and productive work environment", "cons": "- Short and disturbing stretches where Management will communicate one objective but then execute another. This leaves employees wondering whether they have a solid future with this company. Also layoffs don't set a good tone when you are clearly profitable. It's certainly not the employees' fault that management can't make their targets", "advice": "There really is not much more I can say. The pros and cons speak to the areas where management has done well and areas where they need to clean up their act.."}, {"title": "qa manager", "text": "Pros Company had life work balance Cons Salary and benefits are on the low range", "rating": 5, "pros": "Company had life work balance", "cons": "Salary and benefits are on the low range", "advice": null}, {"title": "Best People", "text": "Pros Highly talented employees, benefits, perks, quarterly updates from management, fun projects. Cons The company needs a 401K match", "rating": 5, "pros": "Highly talented employees, benefits, perks, quarterly updates from management, fun projects.", "cons": "The company needs a 401K match", "advice": null}, {"title": "So far, so good!", "text": "Pros Enjoy the environment here at Mediaocean, people are friendly and intelligent. The current office is nice, open and collaborative and can't wait to see the new location closer to the train, which is great for me! Good amount of holidays and PTO. Commuter plan. Happy hours some Fridays, snacks and pop for free in the kitchen. I like that the company is growing as well. Cons Currently, there is no 401k match.", "rating": 5, "pros": "Enjoy the environment here at Mediaocean, people are friendly and intelligent. The current office is nice, open and collaborative and can't wait to see the new location closer to the train, which is great for me! Good amount of holidays and PTO. Commuter plan. Happy hours some Fridays, snacks and pop for free in the kitchen. I like that the company is growing as well.", "cons": "Currently, there is no 401k match.", "advice": null}, {"title": "Senior QA Engineer", "text": "Pros I loved working there as a Senior Engineer; the company has a awesome structure like each product has its own qa, and product; nice benefits; most enjoyable environment; Cons Within the team, I couldn't see any growth in near future.", "rating": 5, "pros": "I loved working there as a Senior Engineer; the company has a awesome structure like each product has its own qa, and product; nice benefits; most enjoyable environment;", "cons": "Within the team, I couldn't see any growth in near future.", "advice": null}, {"title": "Great place to work", "text": "Pros Benefits, Salary, Culture, Team Leads, Cons People have too much fun!", "rating": 5, "pros": "Benefits, Salary, Culture, Team Leads,", "cons": "People have too much fun!", "advice": null}, {"title": "Was a great company to work for.", "text": "Pros - Very good work environment. - Everyone from different teams worked well together. No personality clashes. Cons - After company purchase, not so sure anymore. Advice to Management Good luck moving forward.", "rating": 3, "pros": "- Very good work environment.", "cons": "- After company purchase, not so sure anymore.", "advice": "Good luck moving forward."}, {"title": "Review", "text": "Pros Great office location. Ny was great, great culture. Great people. good compensation. Would recommend. Flexible work hours! Cons Not too many cons. I really liked everything about the internships, learnt a lot of new skills. Great place to work if you want to learn or be in a bug city.", "rating": 5, "pros": "Great office location. Ny was great, great culture. Great people. good compensation. Would recommend. Flexible work hours!", "cons": "Not too many cons. I really liked everything about the internships, learnt a lot of new skills. Great place to work if you want to learn or be in a bug city.", "advice": null}, {"title": "Great place to work depending what division - MBuy was a mess", "text": "Pros Bill Wise, Mediaocean CEO is an amazing guy. He is a great leader and has incredible passion. Cons I worked for MBuy which was the Demand Side Platform division of Mediaocean. Some of the Executive Leadership in MBuy was absolutely awful and management did not stand behind or support their employees properly. The MBuy technology was also bottom of the barrel in the DSP space and they eventually closed it down and now ride the coat-tails of other 3rd party buy side tech. Probably a smart move in hindsight, but many employees were negatively impacted throughout the process and fooled we were going to be closer to Mediaocean as a whole. Be real careful if you are considering MBuy within the walls of Mediaocean. Advice to Management Stand behind hard working employees and if you have challenges with your product don't put the burden on everyone downstream.", "rating": 1, "pros": "Bill Wise, Mediaocean CEO is an amazing guy. He is a great leader and has incredible passion.", "cons": "I worked for MBuy which was the Demand Side Platform division of Mediaocean. Some of the Executive Leadership in MBuy was absolutely awful and management did not stand behind or support their employees properly. The MBuy technology was also bottom of the barrel in the DSP space and they eventually closed it down and now ride the coat-tails of other 3rd party buy side tech. Probably a smart move in hindsight, but many employees were negatively impacted throughout the process and fooled we were going to be closer to Mediaocean as a whole. Be real careful if you are considering MBuy within the walls of Mediaocean.", "advice": "Stand behind hard working employees and if you have challenges with your product don't put the burden on everyone downstream."}, {"title": "Great place to work!", "text": "Pros Mediaocean is full of intelligent, passionate, and hard working employees. The company is very transparent regarding future endeavors. Great place to work Cons I have none to report", "rating": 5, "pros": "Mediaocean is full of intelligent, passionate, and hard working employees. The company is very transparent regarding future endeavors. Great place to work", "cons": "I have none to report", "advice": null}, {"title": "Not terrible", "text": "Pros New York staff was great. Cons NJ customer service individuals were hard to work with.", "rating": 3, "pros": "New York staff was great.", "cons": "NJ customer service individuals were hard to work with.", "advice": null}, {"title": "They are trying", "text": "Pros Great talented people. Good atmosphere. Great location. Lots of positive energy. The company has tons of potential and their is room for the company to grow. Cons Management dreams big but does not have the know-how to pull it off. Very amateurish on developing products and bringing them to market. Advice to Management Hire outside consultant to save you from drinking your own kool aid. Management thinks they are the \"smartest guys in the room\" but can't figure out why they are not succeeding", "rating": 3, "pros": "Great talented people. Good atmosphere. Great location. Lots of positive energy. The company has tons of potential and their is room for the company to grow.", "cons": "Management dreams big but does not have the know-how to pull it off. Very amateurish on developing products and bringing them to market.", "advice": "Hire outside consultant to save you from drinking your own kool aid. Management thinks they are the \"smartest guys in the room\" but can't figure out why they are not succeeding"}, {"title": "Nice company", "text": "Pros Remuneration is better than peers Cons No training provided on job Advice to Management nothing", "rating": 3, "pros": "Remuneration is better than peers", "cons": "No training provided on job", "advice": "nothing"}, {"title": "Awesome, chilled, cool and stylish place to work", "text": "Pros Good compensation, fantastic location in the heart of Manhattan, Free fruits, snacks and coffee. Great management, kind and friendly people, yoga and zumba classes and the main thing, FIFA on XBOX ONE! Cons None actually, just wished employer would match on the 401k as well. Advice to Management You guys really know how to keep employees happy, motivated and cheerful, and also healthy ;-)", "rating": 5, "pros": "Good compensation, fantastic location in the heart of Manhattan, Free fruits, snacks and coffee. Great management, kind and friendly people, yoga and zumba classes and the main thing, FIFA on XBOX ONE!", "cons": "None actually, just wished employer would match on the 401k as well.", "advice": "You guys really know how to keep employees happy, motivated and cheerful, and also healthy ;-)"}, {"title": "A great place to work!", "text": "Pros Mediaocean begins and ends with people - I work with people that I want to be around day in and day out. They are intelligent, driven and collaborative. It's a high energy environment and the dynamic media industry. The tone is set from at the executive level - an entrepreneurial spirit where we work hard and have fun. Goals and vision for the company are shared with all employees and notable happenings are communicated through e-mail, company wide meeting and weekly updates. There is a genuine effort to provide a positive working environment and perks to folks - a wellness series, yoga, zumba, perks program, company breakfasts and a perks program. New office space rocks! Cons I have no cons to report. Advice to Management Folks really appreciate the open line of communication on company initiatives, goals and news via all hands and updates and the management team's presence in the office. Keep it up!", "rating": 5, "pros": "Mediaocean begins and ends with people - I work with people that I want to be around day in and day out. They are intelligent, driven and collaborative. It's a high energy environment and the dynamic media industry. The tone is set from at the executive level - an entrepreneurial spirit where we work hard and have fun. Goals and vision for the company are shared with all employees and notable happenings are communicated through e-mail, company wide meeting and weekly updates.", "cons": "I have no cons to report.", "advice": "Folks really appreciate the open line of communication on company initiatives, goals and news via all hands and updates and the management team's presence in the office. Keep it up!"}, {"title": "Opportunities for growth and fun company culture", "text": "Pros This is a growing company, not only when it comes to clients and business but also opportunities for employees to advance. From a management perspective, upper level management sits in the same desks as everyone else, creating a more open forum. Cons Clients not as familiar with some aspects of digital and programmatic need more education. Advice to Management Continue to solicit feedback from lower level employees and actually take their ideas into consideration so they feel like they are having an impact from the bottom up.", "rating": 5, "pros": "This is a growing company, not only when it comes to clients and business but also opportunities for employees to advance. From a management perspective, upper level management sits in the same desks as everyone else, creating a more open forum.", "cons": "Clients not as familiar with some aspects of digital and programmatic need more education.", "advice": "Continue to solicit feedback from lower level employees and actually take their ideas into consideration so they feel like they are having an impact from the bottom up."}, {"title": "From one family to another", "text": "Pros When I first left my agency, I was worried I wouldn't find another place to work that connected with me so well. Having been with my previous employer for 6 years, they were like family and I felt like I might never find that again. From my first interview through my first week, I felt so much more comfortable than I thought possible. The person who mentored me into my position was very warm and helpful, and management set the same tone for the whole office as well. The company is very focused on keeping employees fulfilled and happy, and really respects the work/life balance, which is so important for me as a parent. There are lots of fun activities and events too! The most impressive thing to me though, is how the CEO takes to time to meet and speak with every new employee. I've been here for three months now, and I feel like I've been here for years already. The direction the company is heading now is very exciting, I feel like I arrived just at the right time. Cons The only challenge I've seen is to be expected from a fast-growing company - everyone is very busy! But even with that, if you have a question or need help, you won't go unanswered. Advice to Management Not that I foresee this as an issue, but as the company continues to grow, hold to those values that employees connect with most on an emotional level: passion, unity, diversity, giving back and having fun. Those are what drew me to the company initially.", "rating": 5, "pros": "When I first left my agency, I was worried I wouldn't find another place to work that connected with me so well. Having been with my previous employer for 6 years, they were like family and I felt like I might never find that again. From my first interview through my first week, I felt so much more comfortable than I thought possible. The person who mentored me into my position was very warm and helpful, and management set the same tone for the whole office as well. The company is very focused on keeping employees fulfilled and happy, and really respects the work/life balance, which is so important for me as a parent. There are lots of fun activities and events too! The most impressive thing to me though, is how the CEO takes to time to meet and speak with every new employee. I've been here for three months now, and I feel like I've been here for years already. The direction the company is heading now is very exciting, I feel like I arrived just at the right time.", "cons": "The only challenge I've seen is to be expected from a fast-growing company - everyone is very busy! But even with that, if you have a question or need help, you won't go unanswered.", "advice": "Not that I foresee this as an issue, but as the company continues to grow, hold to those values that employees connect with most on an emotional level: passion, unity, diversity, giving back and having fun. Those are what drew me to the company initially."}, {"title": "Amazing Opportunity", "text": "Pros Great opportunities for internal growth Cons Great internal support and teamwork. Always someone to help answer questions or train you on something you may have not known how to do prior. Advice to Management N/A", "rating": 5, "pros": "Great opportunities for internal growth", "cons": "Great internal support and teamwork. Always someone to help answer questions or train you on something you may have not known how to do prior.", "advice": "N/A"}, {"title": "Application Developer", "text": "Pros Great Leadership lots to learn Great work life balance Cons None from my experience, great place to work.", "rating": 5, "pros": "Great Leadership", "cons": "None from my experience, great place to work.", "advice": null}, {"title": "The people at the Company are very kind, the work environment is relaxed and they do a good job of mixing work and fun", "text": "Pros - First company I've worked for that REALLY makes you feel like they want you to be truly happy - Allow for a fair balance of work and fun - Provide fruit in the morning, snacks during the day and catered lunches occasionally - One of the friendliest work environments I've ever been a part of Cons - Work isn't exactly spread evenly throughout the respective teams - There is a bit of a popular crowd who has been around the company for years which creates a bit of a high school environment", "rating": 5, "pros": "- First company I've worked for that REALLY makes you feel like they want you to be truly happy", "cons": "- Work isn't exactly spread evenly throughout the respective teams", "advice": null}, {"title": "My experience in working for Mediaocean has been nothing less than great. Bad Case of Loving My Job!!!", "text": "Pros Great People, Great Work Environment, Amazing Company, Stress Level Down to a Minimum, We work Hard but also Play Hard, Lots of Smart People, Great Balance with Work/Personal Life, Great Culture and the CEO is Hands On. Cons Mediaocean as a recently merged company has a small growth potential. With time this will change Advice to Management Continue to higher great people because Mediaocean is awesome!!!", "rating": 5, "pros": "Great People, Great Work Environment, Amazing Company, Stress Level Down to a Minimum, We work Hard but also Play Hard, Lots of Smart People, Great Balance with Work/Personal Life, Great Culture and the CEO is Hands On.", "cons": "Mediaocean as a recently merged company has a small growth potential. With time this will change", "advice": "Continue to higher great people because Mediaocean is awesome!!!"}, {"title": "Wonderful place to work", "text": "Pros Company is the leader in the Advertising Agency Software Industry and they constantly upgrade to use new technology. Very family friendly, lots of activities to make it a fun place to work. CEO is down to earth, willing to listen to everyone's suggestions and is always upbeat and positive. He makes everyone want to work hard to make sure the company is as successful as possible. Cons Would like to have company match on 401K Advice to Management Keep up to company meetings, they are extremely informative to the employees.", "rating": 5, "pros": "Company is the leader in the Advertising Agency Software Industry and they constantly upgrade to use new technology. Very family friendly, lots of activities to make it a fun place to work. CEO is down to earth, willing to listen to everyone's suggestions and is always upbeat and positive. He makes everyone want to work hard to make sure the company is as successful as possible.", "cons": "Would like to have company match on 401K", "advice": "Keep up to company meetings, they are extremely informative to the employees."}, {"title": "Swimming towards Greatness!", "text": "Pros I've been working at Mediaocean for over 4 Years now and each year is better than the last! -Work with a great group of people on a daily basis. -Great work atmosphere. -Amazing New Office in a prime location. - Very effective Senior Management, especially the CEO. - Personable CEO interacts with all the Staff. Cons -Look to Promote from within. -Contribute to Employee 401K Advice to Management Keep doing what you are doing!", "rating": 5, "pros": "I've been working at Mediaocean for over 4 Years now and each year is better than the last!", "cons": "-Look to Promote from within.", "advice": "Keep doing what you are doing!"}, {"title": "Rewarding experience with Mediaocean on all levels.", "text": "Pros Aside from the variety of work assignments, the people are wonderful, and this includes management. The company is very people oriented and they follow through on that. Bill Wise has implemented a set of core values and one of those is fun. We have yoga classes, monthly lunches, and various company events throughout the year. The management listens to ideas and will make every effort to guarantee a positive and learning work environment. Cons Challenges as with most jobs is the ability to find the time to get all the work done. But on the other hand, that is good, as there is never a dull moment. Advice to Management My advice is to continue doing what you are doing. The effort to provide leadership and maintain a high level of morale has paid off.", "rating": 5, "pros": "Aside from the variety of work assignments, the people are wonderful, and this includes management. The company is very people oriented and they follow through on that. Bill Wise has implemented a set of core values and one of those is fun. We have yoga classes, monthly lunches, and various company events throughout the year. The management listens to ideas and will make every effort to guarantee a positive and learning work environment.", "cons": "Challenges as with most jobs is the ability to find the time to get all the work done. But on the other hand, that is good, as there is never a dull moment.", "advice": "My advice is to continue doing what you are doing. The effort to provide leadership and maintain a high level of morale has paid off."}, {"title": "The best company I've ever worked at!", "text": "Pros Mediaocean has the best company work life/culture I've ever worked at. I've worked at many other large companies where the upper management and even supervisors didn't care about employee well-being. That's not the case here. I feel comfortable chatting with all levels of management including CEO, Directors, SVP's and VP's. Tremendous room for growth, and encouraged between departments. Management is ALWAYS trying to improve, expand and listen to employee needs and recommendations. Perks are awesome, including on-site manicures/massages once a week, as well as weekly workout classes such as Yoga & Zumba to promote employee health! Overall, hands down the best company I've ever been a part of. Cons I have no cons to report. Advice to Management Keep doing what you're doing!", "rating": 5, "pros": "Mediaocean has the best company work life/culture I've ever worked at. I've worked at many other large companies where the upper management and even supervisors didn't care about employee well-being. That's not the case here. I feel comfortable chatting with all levels of management including CEO, Directors, SVP's and VP's. Tremendous room for growth, and encouraged between departments. Management is ALWAYS trying to improve, expand and listen to employee needs and recommendations. Perks are awesome, including on-site manicures/massages once a week, as well as weekly workout classes such as Yoga & Zumba to promote employee health! Overall, hands down the best company I've ever been a part of.", "cons": "I have no cons to report.", "advice": "Keep doing what you're doing!"}, {"title": "Awesome Company to work for!", "text": "Pros Great people, challenging work, fun environment, Awesome executive team. Cons Nothing immediately comes to mind. Advice to Management Keep the open communication flowing and continue to promote the Mediaocean culture.", "rating": 5, "pros": "Great people, challenging work, fun environment, Awesome executive team.", "cons": "Nothing immediately comes to mind.", "advice": "Keep the open communication flowing and continue to promote the Mediaocean culture."}, {"title": "My work experience has been very rewarding in every aspect.", "text": "Pros My company has set up a wonderful environment for their employees, from leadership, compensation, and time-off. They really care about the employees, and want them to have the best work experience possible from encouraging room to grow, to many incentives. Cons There are really no cons. Advice to Management NA", "rating": 5, "pros": "My company has set up a wonderful environment for their employees, from leadership, compensation, and time-off. They really care about the employees, and want them to have the best work experience possible from encouraging room to grow, to many incentives.", "cons": "There are really no cons.", "advice": "NA"}, {"title": "Great place to work!", "text": "Pros Work with lots of smart, friendly, super helpful people. Great, fun environment, and challenging work in an interesting industry. Company offers lots of perks for employees - great events/parties, happy hours, etc. Beautiful office space! Management encourages a work/life balance - almost unheard of at so many places! Cons For all the perks, a lot of benefits have also been reduced/eliminated... i.e there is no retirement benefit anymore (no 401k matching contributions, or profit sharing plan of any kind), healthcare premiums have become super expensive as it appears the company is covering a lot less of the premium. Furthermore, raises/salary increases are becoming more and more rare. If you're taking/reducing benefits, raises should help offset that for your employees. So much money seems to be spent on the office space and company perks, but a decent raise could really make employees feel valued. Advice to Management Offer raises to employees. Offer real opportunities for advancement. Keep up the good work with the better communication from management - quarterly all hands, etc.", "rating": 5, "pros": "Work with lots of smart, friendly, super helpful people. Great, fun environment, and challenging work in an interesting industry.", "cons": "For all the perks, a lot of benefits have also been reduced/eliminated... i.e there is no retirement benefit anymore (no 401k matching contributions, or profit sharing plan of any kind), healthcare premiums have become super expensive as it appears the company is covering a lot less of the premium.", "advice": "Offer raises to employees. Offer real opportunities for advancement."}, {"title": "A genuinely cool place to work!", "text": "Pros This is truly a cool place to work and you will indeed work, but you will not do it alone. Collaboration and teamwork is woven into the DNA of Mediaocean. Whether you are in a corner office or a cubicle, the exchange of knowledge flows freely between employees and customers. To that end, the company does an outstanding job recruiting and hiring talented individuals that will excel in our dynamic environment. Mediaocean isn't all work and no play though, there are many \"perks\", feeling tired or stressed take advantage of in house yoga classes, a massage, or get a mani/pedi. Other things to look forward to are company sponsored breakfasts, onsite happy hours, Foosball/Ping Pong tournaments, and an overall amazing work-space. You won't regret becoming part of Team Mediaocean. Cons No designated sick/bereavement time offered Advice to Management Overall I think that you are doing a great job, to ensure that you stay in touch with the pulse of the employee conduct more surveys or provide a way for anonymous feedback.", "rating": 5, "pros": "This is truly a cool place to work and you will indeed work, but you will not do it alone. Collaboration and teamwork is woven into the DNA of Mediaocean. Whether you are in a corner office or a cubicle, the exchange of knowledge flows freely between employees and customers. To that end, the company does an outstanding job recruiting and hiring talented individuals that will excel in our dynamic environment. Mediaocean isn't all work and no play though, there are many \"perks\", feeling tired or stressed take advantage of in house yoga classes, a massage, or get a mani/pedi. Other things to look forward to are company sponsored breakfasts, onsite happy hours, Foosball/Ping Pong tournaments, and an overall amazing work-space. You won't regret becoming part of Team Mediaocean.", "cons": "No designated sick/bereavement time offered", "advice": "Overall I think that you are doing a great job, to ensure that you stay in touch with the pulse of the employee conduct more surveys or provide a way for anonymous feedback."}, {"title": "Great leadership, collaboration, team effort and lots of great perks!", "text": "Pros A great Company to work with and I stress \"with\", we all work together, I never get the feeling I work \"for\" my boss or upper management, we all work with each other, together as a team. If you come to work here you will be part of an amazing team of people. Expect to work hard and get rewarded and recognized for your work. It's a team effort - expect others to help you grow within the company and look for amazing opportunities that give you exposure to all area's and levels within the company. Fun is also a big part of our culture, great holiday parties and happy hours. Zumba, Yoga, manicures and massages onsite, and a walking club. Health benefits are great! Great vacation policy, holiday days off and Philanthropy day to give back to your local community. Cons No company contribution to 401k", "rating": 5, "pros": "A great Company to work with and I stress \"with\", we all work together, I never get the feeling I work \"for\" my boss or upper management, we all work with each other, together as a team.", "cons": "No company contribution to 401k", "advice": null}, {"title": "Very happy in my career at Mediaocean", "text": "Pros Great culture driven by CEO, senior leadership and managers. Non-hierarchical environment - encourages teamwork and collaboration. Colleagues are like family. Challenging work, every day is different. Opportunities to stand out, take on projects, be a part of extra-curricular teams such as Women in Tech, Brand Ambassadors, etc. Always something fun to look forward to - monthly happy hours, summer and holiday events, summer Fridays, philanthropy activities, team lunches and now weekly massages and manicures at NY headquarters. CEO has set strong values in place and everything around us reinforces those values, including our reviews. Cons Candy jars in NY keep running out of candy. We need a candy barrel! Advice to Management Keep it up! Always remember your people are your best asset. Don't let the momentum slide like many companies do.", "rating": 5, "pros": "Great culture driven by CEO, senior leadership and managers. Non-hierarchical environment - encourages teamwork and collaboration. Colleagues are like family. Challenging work, every day is different. Opportunities to stand out, take on projects, be a part of extra-curricular teams such as Women in Tech, Brand Ambassadors, etc. Always something fun to look forward to - monthly happy hours, summer and holiday events, summer Fridays, philanthropy activities, team lunches and now weekly massages and manicures at NY headquarters. CEO has set strong values in place and everything around us reinforces those values, including our reviews.", "cons": "Candy jars in NY keep running out of candy. We need a candy barrel!", "advice": "Keep it up! Always remember your people are your best asset. Don't let the momentum slide like many companies do."}, {"title": "A great company to work for!", "text": "Pros Terrific co workers on site massages on site zumba, on site yoga on site manicure / pedicures stae of the art office space fantastic parites Regular updates from senior management Cons can't think of any cons at present Advice to Management n/a", "rating": 5, "pros": "Terrific co workers", "cons": "can't think of any cons at present", "advice": "n/a"}, {"title": "I love what I do, my boss, my colleagues and what our company stands for.", "text": "Pros I have so much flexibility and work. My boss is a huge family man and respects work-life balance. I have many opportunities to excel at my job and am rewarded with promotions. Cons \"It's a man's world\". Most of leadership are men and there are not as many opportunities for women to raise to the top. Advice to Management \"Practice what you preach\". Stand by your word and follow through with promises. Continue to reward/recognize employees out of the blue for their hard work - it goes a long way. Office culture has gotten so much better - continue to add to our amazing culture.", "rating": 5, "pros": "I have so much flexibility and work. My boss is a huge family man and respects work-life balance. I have many opportunities to excel at my job and am rewarded with promotions.", "cons": "\"It's a man's world\". Most of leadership are men and there are not as many opportunities for women to raise to the top.", "advice": "\"Practice what you preach\". Stand by your word and follow through with promises. Continue to reward/recognize employees out of the blue for their hard work - it goes a long way. Office culture has gotten so much better - continue to add to our amazing culture."}, {"title": "Great environment and culture at Mediaocean", "text": "Pros The advantage of working with Mediaocean is the fact that every department is committed and invested in the company's success. Also, the executive team conducts frequent company-wide meetings to discuss and review Corporate Goals. During/after these meetings, everyone is welcomed to provide suggestions and feedback on how to achieve the goals to the President/CEO and anyone in the executive team. This is creates a really nice environment and gets everyone focused on meeting goals. In addition, Mediaocean moved into a very nice looking office with excellent amenities. It often hard to go home with all that's available in the office :) Cons There are not many disadvantages of working with Mediaocean. But if I had to pick one, it would the cost medical insurance- probably more of a country-wide issue. Advice to Management I have no advice for management at the moment.", "rating": 5, "pros": "The advantage of working with Mediaocean is the fact that every department is committed and invested in the company's success. Also, the executive team conducts frequent company-wide meetings to discuss and review Corporate Goals. During/after these meetings, everyone is welcomed to provide suggestions and feedback on how to achieve the goals to the President/CEO and anyone in the executive team. This is creates a really nice environment and gets everyone focused on meeting goals.", "cons": "There are not many disadvantages of working with Mediaocean. But if I had to pick one, it would the cost medical insurance- probably more of a country-wide issue.", "advice": "I have no advice for management at the moment."}, {"title": "Great company with big vision to expand across the ad tech ecosystem. Very friendly and skilled employee base.", "text": "Pros Driven senior management who are knowledgeable about the advertising tech space and want to continue to grow and expand our business. Everyone is generally very friendly here and the cross-functional collaboration makes work very rewarding and challenging. Although Mediaocean is much bigger than a start-up, there are a lot of new products being rolled out which provides the opportunity to work in an exciting and fast paced environment that is very entrepreneurial. There's also great work-life balance and a lot of fun employee events/perks. Cons Would like to see technology implementations happen faster, but unfortunately some of our biggest clients are slow to change. There are still some legacy/antiquated technology platforms and teams that could probably be upgraded. Advice to Management Would like to see senior management speak to employees more via town halls or other communications to discuss our strategic direction in the marketplace.", "rating": 5, "pros": "Driven senior management who are knowledgeable about the advertising tech space and want to continue to grow and expand our business. Everyone is generally very friendly here and the cross-functional collaboration makes work very rewarding and challenging. Although Mediaocean is much bigger than a start-up, there are a lot of new products being rolled out which provides the opportunity to work in an exciting and fast paced environment that is very entrepreneurial. There's also great work-life balance and a lot of fun employee events/perks.", "cons": "Would like to see technology implementations happen faster, but unfortunately some of our biggest clients are slow to change. There are still some legacy/antiquated technology platforms and teams that could probably be upgraded.", "advice": "Would like to see senior management speak to employees more via town halls or other communications to discuss our strategic direction in the marketplace."}, {"title": "Fun Tech Company in NYC !!!", "text": "Pros Relaxed, yet hard working Good work life balance Awesome people to work with Cons Nothing bad to say .. love it! Advice to Management keep up good work!", "rating": 5, "pros": "Relaxed, yet hard working", "cons": "Nothing bad to say .. love it!", "advice": "keep up good work!"}, {"title": "Great company & culture!", "text": "Pros Perks, office location, Bill Wise is a dedicated and involved CEO, great people. Cons Lack of upward mobility, ok salary Advice to Management Provide more upward mobility", "rating": 5, "pros": "Perks, office location, Bill Wise is a dedicated and involved CEO, great people.", "cons": "Lack of upward mobility, ok salary", "advice": "Provide more upward mobility"}, {"title": "Complicated - I worked for MBuy", "text": "Pros Started off like a start-up, \"which hat will you wear today\" type of mentality. There were a lot of fun people who worked there and it was fun to see them every day. Bill Wise, the CEO, is awesome. Cons Some management was put in place that I feel didn't have vision or proper execution. There were very long hours but sometimes they felt ok.", "rating": 3, "pros": "Started off like a start-up, \"which hat will you wear today\" type of mentality. There were a lot of fun people who worked there and it was fun to see them every day. Bill Wise, the CEO, is awesome.", "cons": "Some management was put in place that I feel didn't have vision or proper execution. There were very long hours but sometimes they felt ok.", "advice": null}, {"title": "Great enthusiasm and passion to make the world of advertising a better place. Work hard, play hard working environment", "text": "Pros Good team, make you feel like family Leaders in what we do Established 47 years but still feels like a start-up A sense that we are going places Cons The industry we serve can be slow to adopt change Advice to Management Keep doing what you're doing", "rating": 5, "pros": "Good team, make you feel like family", "cons": "The industry we serve can be slow to adopt change", "advice": "Keep doing what you're doing"}, {"title": "Great Place to Work!!", "text": "Pros Great benefits and perks. They really value their employees and create a good work life balance. I have been with the company for 7 years and it just keeps getting and better. Cons Nothing worth writing about at the moment. Advice to Management Keep on doing what you are doing.", "rating": 5, "pros": "Great benefits and perks. They really value their employees and create a good work life balance. I have been with the company for 7 years and it just keeps getting and better.", "cons": "Nothing worth writing about at the moment.", "advice": "Keep on doing what you are doing."}, {"title": "Awesome company", "text": "Pros The people are great! Fun work atmosphere. People actually help people! Someone is always will to lend a hand, to help you understand the product. Cons more focus on other offices. Advice to Management Keep up the good work!", "rating": 5, "pros": "The people are great! Fun work atmosphere. People actually help people! Someone is always will to lend a hand, to help you understand the product.", "cons": "more focus on other offices.", "advice": "Keep up the good work!"}, {"title": "Loving our new space!!", "text": "Pros Fun atmosphere, great amenities such as shower rooms, game room equipped with Xbox, Foosball table and PacMan, really cool cafe and collaboration spaces. Although we have flexible work arrangements, I'd rather come into the new space everyday. Cons I can't think of any at this time. Advice to Management Keep up the fun culture, can't wait for our holiday party!", "rating": 5, "pros": "Fun atmosphere, great amenities such as shower rooms, game room equipped with Xbox, Foosball table and PacMan, really cool cafe and collaboration spaces. Although we have flexible work arrangements, I'd rather come into the new space everyday.", "cons": "I can't think of any at this time.", "advice": "Keep up the fun culture, can't wait for our holiday party!"}, {"title": "Really focusing on Women in Tech!", "text": "Pros A lot of great women in leadership positions. Good opportunities for growth and professional development. Speaking engagements, opportunities to attend WIT conferences, overall supportive work environment. Cons Nothing that I can think of. Advice to Management Keep up the good work, really moving in a positive direction to promote and drive change for women in technology.", "rating": 5, "pros": "A lot of great women in leadership positions. Good opportunities for growth and professional development. Speaking engagements, opportunities to attend WIT conferences, overall supportive work environment.", "cons": "Nothing that I can think of.", "advice": "Keep up the good work, really moving in a positive direction to promote and drive change for women in technology."}, {"title": "Company Cares About Health and Wellness", "text": "Pros I love the weekly yoga and Zumba classes! We also started a walking club and it has been really fun to see the city at lunch time.We even had a speaker come to the office to promote positive health and lifestyle changes. I really feel that the company cares about me. Cons Nothing to report at this time. Waiting to see how everything settles from the move. Advice to Management Keep listening to employees and taking our feedback. It definitely shows that you are listening to input and following up.", "rating": 5, "pros": "I love the weekly yoga and Zumba classes! We also started a walking club and it has been really fun to see the city at lunch time.We even had a speaker come to the office to promote positive health and lifestyle changes. I really feel that the company cares about me.", "cons": "Nothing to report at this time. Waiting to see how everything settles from the move.", "advice": "Keep listening to employees and taking our feedback. It definitely shows that you are listening to input and following up."}, {"title": "Mediaocean is a changed company!", "text": "Pros Awesome new headquarters in union square. Lots of room for advancement High energy On a corporate mission Cons Senior management is pretty set Some antiquated tech and people still around Advice to Management 1. Keep doing what you are doing 2. Make sure you reach out to everyone in the org, not just yourselves.", "rating": 5, "pros": "Awesome new headquarters in union square.", "cons": "Senior management is pretty set", "advice": "1. Keep doing what you are doing"}, {"title": "Great experience", "text": "Pros -Smart and talented team -Fun environment -Great opportunity for growth Cons None, enjoyed working at MediaOcean.", "rating": 5, "pros": "-Smart and talented team", "cons": "None, enjoyed working at MediaOcean.", "advice": null}, {"title": "Culture in the Chicago office is unbearable.", "text": "Pros Quarterly bonus opportunities are attractive. Cons I have never worked in a more unprofessional environment. Management not only lacks knowledge and expertise needed to run a company, but they do not care about the well being of their employees. Employees are put down on a daily basis, and rarely given the tools needed to succeed in regard to training or expectations. The environment is extremely negative and volatile - employees fight, bicker and treat each other poorly on a daily basis and management only adds to the immature behavior. There is never accountability for poor work, or reward for quality work. Advice to Management Nothing will change in this office until critical members of management are made accountable for the poor tone they set for the office. Additional management training is desperately needed. Unprofessional leadership needs to be removed.", "rating": 1, "pros": "Quarterly bonus opportunities are attractive.", "cons": "I have never worked in a more unprofessional environment. Management not only lacks knowledge and expertise needed to run a company, but they do not care about the well being of their employees. Employees are put down on a daily basis, and rarely given the tools needed to succeed in regard to training or expectations. The environment is extremely negative and volatile - employees fight, bicker and treat each other poorly on a daily basis and management only adds to the immature behavior. There is never accountability for poor work, or reward for quality work.", "advice": "Nothing will change in this office until critical members of management are made accountable for the poor tone they set for the office. Additional management training is desperately needed. Unprofessional leadership needs to be removed."}, {"title": "Fun place to work, but pay is a little low.", "text": "Pros Great place to start. Fun company events. Always opportunity to work on different projects, never boring. People are helpful, if they don't know an answer to your question they will try to help you find the person who does. Cons Pay is low for the volume of work expected. Not enough opportunity to move around to different teams, or promotion opportunities. Advice to Management Higher compensation for existing employees, more growth opportunities.", "rating": 5, "pros": "Great place to start. Fun company events. Always opportunity to work on different projects, never boring. People are helpful, if they don't know an answer to your question they will try to help you find the person who does.", "cons": "Pay is low for the volume of work expected. Not enough opportunity to move around to different teams, or promotion opportunities.", "advice": "Higher compensation for existing employees, more growth opportunities."}, {"title": "Great Vision. Actual Execution ... MEH.", "text": "Pros Company is positioned on the cutting edge of ad tech. Solid employee benefits, ESOP, etc. Cons For a cutting edge tech company, management is way too bureaucratic and clique-oriented. Many, many disillusioned employees by the actual product deployed into the field. Too many bugs, lack of product support or even interest. This led to many less than satisfied customers who didn't have interest in continuing relationships. All this led to a downward spiral with little nor speedy resolution from management. Advice to Management Critical need for better vision with regard to product and go to market message. If you're committing to deliver, make sure the product is actually capable of doing so. You only get so many times at bat before customers tire of problems with their campaigns' performance and the porous explanations that were provided. You cannot continuously change your market position and message just to cover product insufficiencies..", "rating": 3, "pros": "Company is positioned on the cutting edge of ad tech. Solid employee benefits, ESOP, etc.", "cons": "For a cutting edge tech company, management is way too bureaucratic and clique-oriented. Many, many disillusioned employees by the actual product deployed into the field. Too many bugs, lack of product support or even interest. This led to many less than satisfied customers who didn't have interest in continuing relationships. All this led to a downward spiral with little nor speedy resolution from management.", "advice": "Critical need for better vision with regard to product and go to market message. If you're committing to deliver, make sure the product is actually capable of doing so. You only get so many times at bat before customers tire of problems with their campaigns' performance and the porous explanations that were provided. You cannot continuously change your market position and message just to cover product insufficiencies.."}, {"title": "Don't believe the hype or fake reviews.", "text": "Pros Free breakfast, great events, good work life balance, decent products, ez commute, flex time and time off policies, cool and caring co-workers. Cons It is a ok, middle of the road company, not bad but definitely not great. There are some bad managers, old products and the work can be tedious and unappreciated. Very little WFH which sucks. Management does care about the company, but not really the people, we are along for the ride. They are trying very hard to change the reputation of the company. Some marketing people were brought in to change the image of the company and CEO. It is common knowledge around MO they have been writting fake GD reviews, as there were so many bad reviews from before. Advice to Management Stop trying to sell us and start to genuinely care about the people.", "rating": 3, "pros": "Free breakfast, great events, good work life balance, decent products, ez commute, flex time and time off policies, cool and caring co-workers.", "cons": "It is a ok, middle of the road company, not bad but definitely not great. There are some bad managers, old products and the work can be tedious and unappreciated. Very little WFH which sucks. Management does care about the company, but not really the people, we are along for the ride. They are trying very hard to change the reputation of the company. Some marketing people were brought in to change the image of the company and CEO. It is common knowledge around MO they have been writting fake GD reviews, as there were so many bad reviews from before.", "advice": "Stop trying to sell us and start to genuinely care about the people."}, {"title": "Mediaocean is a GREAT company with strategic direction", "text": "Pros People are great-- very smart, hard working, willing to help HR onboarding was excellent-- best of my career CEO is open, accessible, personable, communicates often, and shares goals Company feels like a family-- breakfast, events, all hands, happy hours. Cons CEO is great, but his 2 presidents are not as approachable and open... Company can probably move faster Some antiquated technology needs to be updated Advice to Management Bill is a leader, the rest of senior management should be leaders as well", "rating": 5, "pros": "People are great-- very smart, hard working, willing to help", "cons": "CEO is great, but his 2 presidents are not as approachable and open...", "advice": "Bill is a leader, the rest of senior management should be leaders as well"}, {"title": "A great place for your career.", "text": "Pros You get to work with very intelligent people and leaders in the industry and actually have access to the CEO. Cons it can be challenging hours when working with the international offices. Advice to Management Provide more education opportunities.", "rating": 5, "pros": "You get to work with very intelligent people and leaders in the industry and actually have access to the CEO.", "cons": "it can be challenging hours when working with the international offices.", "advice": "Provide more education opportunities."}, {"title": "Great company to grow your career!", "text": "Pros Great pay and room to growth. AWESOME company events and free breakfast. Very personable CEO who speaks with everyone in the company and has a great sense of humor. Good benefits and very inviting on-boarding process. Best of all we now get to own a piece of Mediaocean through our new equity plan. All in all I really enjoy working at Mediaocean with great people :) Cons Since we merged a year ago you can still feel the growing pains however I believe that what this company will become will make up for it.", "rating": 5, "pros": "Great pay and room to growth. AWESOME company events and free breakfast. Very personable CEO who speaks with everyone in the company and has a great sense of humor. Good benefits and very inviting on-boarding process. Best of all we now get to own a piece of Mediaocean through our new equity plan. All in all I really enjoy working at Mediaocean with great people :)", "cons": "Since we merged a year ago you can still feel the growing pains however I believe that what this company will become will make up for it.", "advice": null}, {"title": "Got potential to be a really good company", "text": "Pros The company has trimmed a lot of excess. Direction of new management appears promising, but time will tell. Company culture is better. It's no Google, but not as dull as it used to be. Good location & pay. There are actually some nice, smart and dedicated people. Cons A lot of us have to work more as a result of the re-orgs, but I suppose that's a good problem to have. A little chaotic at times as people are trying to figure out new methods. Advice to Management On the right track but stay realistic.", "rating": 5, "pros": "The company has trimmed a lot of excess.", "cons": "A lot of us have to work more as a result of the re-orgs, but I suppose that's a good problem to have.", "advice": "On the right track but stay realistic."}, {"title": "An Enjoyable Work Experience", "text": "Pros -Management is focused results, not overtime hours -Good visibility on how work efforts result in a win for the company and clients -Industry Expert/Client interviews/presentations help understand \"Voice Of Customer\" -Many stable products in production -Strong emphasis on Quality and Client feedback -Exciting new opportunities with a drive towards new technologies. -Family friendly -Great colleagues -Smart Management -Fun company events -Great to come to work every day Cons -at times, too much work to complete inside of limited time frames -some internal tools are not well designed and can be hard to use Advice to Management Just keep on course to the new vision.", "rating": 5, "pros": "-Management is focused results, not overtime hours", "cons": "-at times, too much work to complete inside of limited time frames", "advice": "Just keep on course to the new vision."}, {"title": "clash of cultures....", "text": "Pros fast paced focused on results great location cool space Cons many lazy people that spend time complaining and talking about how great it was in the \"old days\". Advice to Management get rid of the lazy dds people", "rating": 3, "pros": "fast paced", "cons": "many lazy people that spend time complaining and talking about how great it was in the \"old days\".", "advice": "get rid of the lazy dds people"}, {"title": "Management has one goal, get the most out of you and pay the least", "text": "Pros The salary is decent, but don't get fooled by it, it's not worth it. There are some good people, but this place won't enhance your skills, and keep on cutting your benefits. Cons Stress Long and boring meetings Inferior technology No appreciation for people or people skills Reduced benefits Advice to Management Bring people with real experience in all levels. Start thinking about people as assets not liabilities.", "rating": 1, "pros": "The salary is decent, but don't get fooled by it, it's not worth it. There are some good people, but this place won't enhance your skills, and keep on cutting your benefits.", "cons": "Stress", "advice": "Bring people with real experience in all levels. Start thinking about people as assets not liabilities."}, {"title": "Unfortunate turn of events", "text": "Pros Knowledgeable and friendly colleagues Great location (NYC office) Good work/life balance Focus on up-and-coming technologies Health benefits Cons Painfully low morale following merger Layoffs, layoffs, layoffs, particularly of key or well-respected personnel Compensation Complicated office politics (\"old order\" being marginalized) Feeling that people are just numbers Advice to Management Make a genuine effort to boost morale. Given all of the staffing reductions (both voluntary and involuntary), many of my former colleagues are exceedingly suspicious and need genuine reassurance. So many feel like they aren't being told the truth.", "rating": 1, "pros": "Knowledgeable and friendly colleagues", "cons": "Painfully low morale following merger", "advice": "Make a genuine effort to boost morale. Given all of the staffing reductions (both voluntary and involuntary), many of my former colleagues are exceedingly suspicious and need genuine reassurance. So many feel like they aren't being told the truth."}, {"title": "Ride the wave but you are headed to shark infested waters", "text": "Pros Good pay Great coworkers Lax office environment Cons Management is a joke! Devaluing employees is common practice. Clients are treated the same but of course not to their faces. All they are concerned with is keeping the status quo. Clients are promised the world on a silver platter. They receive spam on a dirty dish . Look for the Mediaban reviews these are the people running Mediaocean. Advice to Management Resign", "rating": 1, "pros": "Good pay", "cons": "Management is a joke! Devaluing employees is common practice. Clients are treated the same but of course not to their faces. All they are concerned with is keeping the status quo. Clients are promised the world on a silver platter. They receive spam on a dirty dish .", "advice": "Resign"}, {"title": "Mediaocean Client Support Specialist Position - Don't take the gig.", "text": "Pros Decent Pay, Always busy, tons to learn, great co-workers, great networking job, lax office environment (Chicago). Cons Sub Par Management. Little to no training. Over promise on everything imaginable. Product always breaks, there is no stability with the software. Clients are always pissed and that makes your job so much worse than it already is. Pressure and stress are unbearable 90% of the time. Management doesn't help unless you are in the same office. If you are a remote employee you will have a real tough time getting the help you need to succeed at this position. Advice to Management Get into a management training program. Keep promises to employees. Offer more training when it is requested. Learn how to help out the people below you. Answer emails and phone calls. Give complete and concise explanations.", "rating": 1, "pros": "Decent Pay, Always busy, tons to learn, great co-workers, great networking job, lax office environment (Chicago).", "cons": "Sub Par Management. Little to no training. Over promise on everything imaginable. Product always breaks, there is no stability with the software. Clients are always pissed and that makes your job so much worse than it already is. Pressure and stress are unbearable 90% of the time. Management doesn't help unless you are in the same office. If you are a remote employee you will have a real tough time getting the help you need to succeed at this position.", "advice": "Get into a management training program. Keep promises to employees. Offer more training when it is requested. Learn how to help out the people below you. Answer emails and phone calls. Give complete and concise explanations."}, {"title": "Advanced QA Analyst", "text": "Pros Process,Project, People everything is progressive. All 4P's Cons As of now nothing to share.", "rating": 5, "pros": "Process,Project, People everything is progressive. All 4P's", "cons": "As of now nothing to share.", "advice": null}, {"title": "Excellent product development company", "text": "Pros Good learning, Product development Company, Great work life balance Cons All good .. not nuch to mention", "rating": 5, "pros": "Good learning, Product development Company, Great work life balance", "cons": "All good .. not nuch to mention", "advice": null}, {"title": "Software Developer", "text": "Pros Work Life Balance Great Work Environment Worlds Largest Ad-Tech provider. Great employee perks Numerous employee retreats and parties Work From Home Everybody is approachable Cons Flat hierarchy (Could be a pro for some) Advice to Management Given that you're hiring aggressively please get your own office", "rating": 5, "pros": "Work Life Balance", "cons": "Flat hierarchy (Could be a pro for some)", "advice": "Given that you're hiring aggressively please get your own office"}, {"title": "Good place to work.", "text": "Pros Good working environment and proper leaves management. Cons Training on technologies and tools for employees out of their job profile should also be entertained.", "rating": 3, "pros": "Good working environment and proper leaves management.", "cons": "Training on technologies and tools for employees out of their job profile should also be entertained.", "advice": null}, {"title": "HR Business Partner", "text": "Pros Good company to work with. Employee friendly. Cons There is nothing negative that I can say about. Advice to Management Please keep up the good work.", "rating": 5, "pros": "Good company to work with. Employee friendly.", "cons": "There is nothing negative that I can say about.", "advice": "Please keep up the good work."}, {"title": "Working with mediaocean", "text": "Pros Good company, good people, a lot of thought into making employee feel comfortable to work. Cons none that i know of Advice to Management keep up the good work", "rating": 5, "pros": "Good company, good people, a lot of thought into making employee feel comfortable to work.", "cons": "none that i know of", "advice": "keep up the good work"}, {"title": "Good product based company growing rapidly", "text": "Pros Work life balance.......... Flexi timings........ Good compensation..... Cons Cant think of any at the moment Advice to Management Keep up the good work", "rating": 5, "pros": "Work life balance..........", "cons": "Cant think of any at the moment", "advice": "Keep up the good work"}, {"title": "By 2020, MediaOcean is going to have 5 CEOs, 20 CTOs, 50 VPs and 100 Directors", "text": "Pros MediaOcean is growing really fast.. really fast. Cons And so some folks do (dearest to the management). Every year, some senior folks in US and India management get promoted to the next role by default (VP, Sr VP, Sr Sr VP, Director, Sr Director, Sr Sr Director… etc). Not sure how there roles and responsibilities are changed.. but it happens every year. Newly promoted leaders are so confused on the floor as if they are not sure how they are promoted to the next/director level. Next year, MediaOcean is going to have two new posts - Sr CTO and Jr CTO. You walk around the floor, you will either see developers/testers or directors. There is no mid-level in between So if you are a new joiner or current employee, don’t get confused if you the magnitude 5 CEOs, 20 CTOs, 50 VPs and 100 Directors by 2020. Advice to Management All the best!", "rating": 1, "pros": "MediaOcean is growing really fast.. really fast.", "cons": "And so some folks do (dearest to the management). Every year, some senior folks in US and India management get promoted to the next role by default (VP, Sr VP, Sr Sr VP, Director, Sr Director, Sr Sr Director… etc). Not sure how there roles and responsibilities are changed.. but it happens every year. Newly promoted leaders are so confused on the floor as if they are not sure how they are promoted to the next/director level.", "advice": "All the best!"}, {"title": "Java Developer", "text": "Pros No pro only cons with lot of politics. Cons Disturbed management. Worst team Distribution. No appraisal. Advice to Management Hire smart people. Give appraisals.", "rating": 1, "pros": "No pro only cons with lot of politics.", "cons": "Disturbed management.", "advice": "Hire smart people."}, {"title": "A good organisation to work and grow your career with", "text": "Pros - Good work environment and culture - Learn new technologies - Work - Life balance - Flexible Work timings - Work from home - Competitive pay scale Cons - New Pune office needs more food options in canteen", "rating": 5, "pros": "- Good work environment and culture", "cons": "- New Pune office needs more food options in canteen", "advice": null}, {"title": "Brilliant place to work", "text": "Pros Great managers and very flexible with an hour. Cons opportunities are not offered or training.", "rating": 3, "pros": "Great managers and very flexible with an hour.", "cons": "opportunities are not offered or training.", "advice": null}, {"title": "Good environment and work culture", "text": "Pros I have joined MediaOcean this year and seems like a great place to work. 1. Management is great 2. Work - life balance 2. Very professional treatment 3. Good policies for employees as compared to other service based companies 4. Good to learn new technologies Great place to work and grow. Cons Not found any yet. Flexible in terms of office timings to an extent.", "rating": 5, "pros": "I have joined MediaOcean this year and seems like a great place to work.", "cons": "Not found any yet.", "advice": null}, {"title": "Excellent Work Life Balance", "text": "Pros - You get to work with cutting edge technologies. - Managers and upper management always encourage you to innovate and back you. - People are very professional. - Healthy work environment. Cons I have not found any cons yet. You get a lot of time to work on yourself and improve your skill set.", "rating": 5, "pros": "- You get to work with cutting edge technologies.", "cons": "I have not found any cons yet. You get a lot of time to work on yourself and improve your skill set.", "advice": null}, {"title": "Great Place to work", "text": "Pros If you want a great work life balance then this is the company for you. Cons Need more learning opportunities technically when come to Functional Team.", "rating": 5, "pros": "If you want a great work life balance then this is the company for you.", "cons": "Need more learning opportunities technically when come to Functional Team.", "advice": null}, {"title": "Excellent company to work with", "text": "Pros * Established player with a sticky business model * On a growth track * Excellent people * Professional (as well as healthy) environment Cons * Work pressure is higher, compared to the other places I have worked Advice to Management * While communication within the individual teams is great, organization level communication definitely needs improvement", "rating": 5, "pros": "* Established player with a sticky business model", "cons": "* Work pressure is higher, compared to the other places I have worked", "advice": "* While communication within the individual teams is great, organization level communication definitely needs improvement"}, {"title": "Best place to start your career with", "text": "Pros A place where there is no hierarchy. Everyone is approachable be it the head, managers or colleagues. The trainings over here are great. Cons Haven't found any yet. I don't think there'll be any cons as the management is proactive. There is just a space crunch currently but the management has figured out a new workplace.", "rating": 5, "pros": "A place where there is no hierarchy.", "cons": "Haven't found any yet.", "advice": null}, {"title": "Great place to work", "text": "Pros Approachable seniors, frendly colleagues, good management, open door policy, great for freshers Cons No flaws as yet since i'm fairly new to the profession Advice to Management Keep up the good work", "rating": 5, "pros": "Approachable seniors, frendly colleagues, good management, open door policy, great for freshers", "cons": "No flaws as yet since i'm fairly new to the profession", "advice": "Keep up the good work"}, {"title": "Not bad, but limited growth and dated tech.", "text": "Pros Great offices, free breakfast, friendly atmosphere. Cons Since being acquired by Vista Equity Partners, there is a hiring freeze in London and New York as they look to hire on the cheap in Pune(India) and graduates in Chicago. Salary given and the bumps during the year are low. Two huge redundancy layoff's in the space of 4 years. Tech stack isnt great and the code is even worse.", "rating": 3, "pros": "Great offices, free breakfast, friendly atmosphere.", "cons": "Since being acquired by Vista Equity Partners, there is a hiring freeze in London and New York as they look to hire on the cheap in Pune(India) and graduates in Chicago. Salary given and the bumps during the year are low. Two huge redundancy layoff's in the space of 4 years. Tech stack isnt great and the code is even worse.", "advice": null}, {"title": "Review", "text": "Pros Good Company Can join Try to focus Cons Bad management Should reward individuals Politics is there Advice to Management Reward individuals", "rating": 3, "pros": "Good Company", "cons": "Bad management", "advice": "Reward individuals"}, {"title": "What a Waste of Time......I mean Really........", "text": "Pros After working for 2 years Full time i cant believe that i need to think this hard to write about the Positives or PROS............Still no answer.....nothing come to my mind........... Cons MediaOcean as a company is really well placed to provide a Fair and Good work environment to its employees because of its limited size and manageable customer base, But thats not how things really are on the contrary its the opposite the work environment is BAD and its so unethical that it drives you CRAZY, moving on if you feel like doing some good work there is no support or any encouragement to do so........ Q:-This leads to the BIG QUESTION- \"Why Do you Want to Work for this Company ???\" Ans:- You should not, if you still are better get out much better options outside..... Complete Lack of technical leadership and drive from Pune, Lack of process discipline at multiple levels. Another note worthy thing is the Finance team at MediaOcean- They mess up big time on there day to day tasks and this has lead to a lot of issues personally for me, i mean how can they be so careless and outright idiots MOREOVER they behave as if they are doing a BIG favor if you try to call them or talk to them for the mess they created. BOLLYWOOD CALLING......[THIS IS THE APPROPRIATE NAME OF THE OFFICE IN PUNE] I dont know how many of the previous Employees in Pune have noticed but i felt strongly- There is a little too much of Women Empowerment going on.......looks like Congress party is the Decision maker here. IN SHORT ITS A DHOBI GHATT.......... Advice to Management MOVE ON LET SOMEONE ELSE BE THE SHEEP HERDER.......", "rating": 1, "pros": "After working for 2 years Full time i cant believe that i need to think this hard to write about the Positives or PROS............Still no answer.....nothing come to my mind...........", "cons": "MediaOcean as a company is really well placed to provide a Fair and Good work environment to its employees because of its limited size and manageable customer base, But thats not how things really are on the contrary its the opposite the work environment is BAD and its so unethical that it drives you CRAZY, moving on if you feel like doing some good work there is no support or any encouragement to do so........", "advice": "MOVE ON LET SOMEONE ELSE BE THE SHEEP HERDER......."}, {"title": "Best place to work", "text": "Pros Work culture is good. Management is easily approachable. Salary provided is best in the market. Cons I do not have any Cons for Mediaocean. Advice to Management No advice to management.", "rating": 5, "pros": "Work culture is good.", "cons": "I do not have any Cons for Mediaocean.", "advice": "No advice to management."}, {"title": "Bad , very BAD work environment, only politics", "text": "Pros You are a slave today working under fear of losing job anytime. You have nobody to approach . if you speak up , you are sure to get fired ! Company has been sold , no future for employees . one day they give you awards and after few days you will be shown the door . shocking Cons Today in mediaocean only politics is the focus , work has taken back seat .im really frustrated with the attitude of the managers you cannot trust anybody , your colleagues are your enemies , beware. Everyday you reach office fearing what might happen , whether its your turn today ? Better to save yourself and leave , leave. Get out of this mess soon, sooner the better. Recruiters will tell you good things at the time of hiring , but its all fake i realise it in 3 months .Recruiter will write good reviews here to mislead candidates. They will hire you on basis of some aptitude test .. all questions are known in the markets , consultants will tell you , ask them. Its a scary place to be in ,spoil your career and waste your time. Advice to Management people are frustrated , see the ground realities .", "rating": 1, "pros": "You are a slave today working under fear of losing job anytime. You have nobody to approach . if you speak up , you are sure to get fired !", "cons": "Today in mediaocean only politics is the focus , work has taken back seat .im really frustrated with the attitude of the managers you cannot trust anybody , your colleagues are your enemies , beware.", "advice": "people are frustrated , see the ground realities ."}, {"title": "Everything looks good about the organisation!!", "text": "Pros 1. Excellent work environment. 2. Clear communication from management. 3. Salary above market standard. Cons 1. Structure is pretty much flat anyone who wants to get into leadership and management roles might want to look anywhere else. Advice to Management You guys are doing great work !!", "rating": 5, "pros": "1. Excellent work environment.", "cons": "1. Structure is pretty much flat anyone who wants to get into leadership and management roles might want to look anywhere else.", "advice": "You guys are doing great work !!"}, {"title": "Don't waste your career try something other", "text": "Pros No Pros, no certification, no learning, no career growth full politics Cons One of the worst organization I have ever seen in my experience, it was my mistake that I have joined such a fake organization where they never met with their commitments. When they want candidate on board they will offer all false commitments and when you have opted their offer they will ruin your career. Managers are not at all technical they just have done some PMP, CSM certifications and got hired in higher salaries now they think that employees are labors treat them as what they want. Meetings all the time but never met with customer expectations I have seen first organization where developers and testers have separate scrums in same project no body in sync up, you have to roam desk to desk for a piece of information. No documentation all verbal communication, they will make your life hell. US Managers will whatsapp you in India time to solve their own problems and take the credit as well, no professionalism. Advice to Management Change the management of Asia office and add some professionalism and documentations in work culture, train employees as well.", "rating": 1, "pros": "No Pros, no certification, no learning, no career growth full politics", "cons": "One of the worst organization I have ever seen in my experience, it was my mistake that I have joined such a fake organization where they never met with their commitments. When they want candidate on board they will offer all false commitments and when you have opted their offer they will ruin your career. Managers are not at all technical they just have done some PMP, CSM certifications and got hired in higher salaries now they think that employees are labors treat them as what they want.", "advice": "Change the management of Asia office and add some professionalism and documentations in work culture, train employees as well."}, {"title": "Bad time , its suffocating to work here", "text": "Pros till 6 months back it was an Organization where your voice was heard . and there was some autonomy to work . todays its only bad politics . Top management is not concerned . Cons after the recent changes and new people getting added in the headquarter the relation between US and India employees is like that of a master and servant . Bad time for the company , leading to exits of good people from the organization. Only POLITICS & POLITICS going on . you are expected to do LATE night calls , if don't then your subordinate will be given your place Advice to Management see what is happening with people , don't leave them to mercy of young incapable people hired in some positions . Trust has gone away", "rating": 1, "pros": "till 6 months back it was an Organization where your voice was heard . and there was some autonomy to work . todays its only bad politics . Top management is not concerned .", "cons": "after the recent changes and new people getting added in the headquarter the relation between US and India employees is like that of a master and servant . Bad time for the company , leading to exits of good people from the organization. Only POLITICS & POLITICS going on .", "advice": "see what is happening with people , don't leave them to mercy of young incapable people hired in some positions . Trust has gone away"}, {"title": "Spoiled life and career of many people", "text": "Pros Location and flexi timing was good but flexi means you have to work more than 10 hrs from home . Scrum calls, daily meetings really spoil personal life. One day you will get an award and next month you will be fired because of poor performance. They don't discuss what exactly happened. No plan, no career growth, no stability nothing. Only few senior resources get promoted and shining and rest are just their slaves. They spoiled many people's life. Lot of people left also, now mostly are recruited via campus interview so majority public are freshers. Cons No growth, no decent increments, mid level experience guys are mostly frustrated. They are in comfort zone but not happy so just continuing without any passion. Advice to Management Please don't play with people's life, you will be crushed by their curses. You guys spoiled so many lives, one day just sit and think.", "rating": 1, "pros": "Location and flexi timing was good but flexi means you have to work more than 10 hrs from home . Scrum calls, daily meetings really spoil personal life. One day you will get an award and next month you will be fired because of poor performance. They don't discuss what exactly happened. No plan, no career growth, no stability nothing. Only few senior resources get promoted and shining and rest are just their slaves. They spoiled many people's life. Lot of people left also, now mostly are recruited via campus interview so majority public are freshers.", "cons": "No growth, no decent increments, mid level experience guys are mostly frustrated. They are in comfort zone but not happy so just continuing without any passion.", "advice": "Please don't play with people's life, you will be crushed by their curses. You guys spoiled so many lives, one day just sit and think."}, {"title": "Private company gone through merger, and now aquisition", "text": "Pros Good social environment - felt very well connected with most colleagues, even if I didn't come across them through work. Everyone is very approachable (even devs!) right up to CEO. Good pay Good bonuses, though replaced with equity release scheme, now completed, which turned out better - I never dreamt it would pay out. Cons No structured training or development Appraisals felt like box ticking exercises Difficult to get new methodologies and thinking considered or accepted Not truly global, far too US centric, which goes against their ambition of breaking into new markets. For the time I was employed at DDS, now Mediaocean, I've seen a great number of changes. DDS needed a shakeup, which came in the form of a merger with MediaBank. Having settled into a good, exciting company to work for, they've now been acquired by Vista Equity Partners. What that will bring only time will tell. Advice to Management Still some old, old thinking going - people deciding tech with outdated ideas, not a real global attitude - on which needs to be jettisoned for the company to be able to get any lift.", "rating": 5, "pros": "Good social environment - felt very well connected with most colleagues, even if I didn't come across them through work. Everyone is very approachable (even devs!) right up to CEO.", "cons": "No structured training or development", "advice": "Still some old, old thinking going - people deciding tech with outdated ideas, not a real global attitude - on which needs to be jettisoned for the company to be able to get any lift."}, {"title": "Good place to work", "text": "Pros Great place, friendly and easy going Cons Bit cliquey, should ope up to all employees Advice to Management Talk to employees about direction more", "rating": 5, "pros": "Great place, friendly and easy going", "cons": "Bit cliquey, should ope up to all employees", "advice": "Talk to employees about direction more"}, {"title": "Nice place to work", "text": "Pros Free breakfast, good hours, overall good and supportive attitude that seems to be ingrained into the company and not just slapped on top. There is some pressure, but usually well managed, and management tend to be supportive and helpful, although do expect results. So far I've learnt a lot here and only expect to learn more and become better at what I do. Cons sometimes a project can become far more complex than first thought, so there is a rush to fix in time, but that can happen anywhere. Advice to Management keep having \"Fun\" as a core value!", "rating": 5, "pros": "Free breakfast, good hours, overall good and supportive attitude that seems to be ingrained into the company and not just slapped on top.", "cons": "sometimes a project can become far more complex than first thought, so there is a rush to fix in time, but that can happen anywhere.", "advice": "keep having \"Fun\" as a core value!"}, {"title": "Senior Product Analyst", "text": "Pros Small office and team so very hands on and the job provides diverse responsibilities. Flexible work options like work from home on agreed upon days with manager approval. Interesting projects, lots of cross team collaboration within the employees. Opportunities to wear many 'hats' within your role. Respectful work environment. Cons Smaller Canadian market so limited development resources and backing. No company pension contribution (cut in DDS/Mediabank merger) or RRSP matching program. Employee office space is very dated. Have to use my own personal computer if they work from home (e.g. no company issued laptop provided).", "rating": 5, "pros": "Small office and team so very hands on and the job provides diverse responsibilities.", "cons": "Smaller Canadian market so limited development resources and backing.", "advice": null}, {"title": "Good company to work for women employees", "text": "Pros Mediaocean is a great place to work for women employees . The work schedule is managed in a way that you are able to strike a balance between your personal and professional commitments . Work environment is very healthy and congenial , you have very friendly colleagues and understanding managers to work with . You feel like a part of the organization . you get all the opportunity to climb up the career ladder , there is no gender bias . In fact the gender ratio is like 60:40 unlike any other IT company .You can look forward to good work , healthy work environment and good people to work with . Cons compared to all the past organisations that I have worked with ,Mediaocean has all the favourable factors to make it a great place to work Advice to Management Keep up the good culture . Women managers are part of the Management team in Mediaocean.", "rating": 5, "pros": "Mediaocean is a great place to work for women employees . The work schedule is managed in a way that you are able to strike a balance between your personal and professional commitments . Work environment is very healthy and congenial , you have very friendly colleagues and understanding managers to work with . You feel like a part of the organization .", "cons": "compared to all the past organisations that I have worked with ,Mediaocean has all the favourable factors to make it a great place to work", "advice": "Keep up the good culture . Women managers are part of the Management team in Mediaocean."}, {"title": "Excellent workplace!", "text": "Pros Mediaocean is one of the best product companies to work for! If you are looking for great work, latest technologies and good work ethics, then this is the place to be. Having headquarters in NY, we get lot of exposure to new product development and working across various teams globally. We also have a great work-life balance in our Pune office, which helps one focus on work as well as give quality time to family. Projects are often managed in such a way that team members do not have to attend scrums daily and usually have a local product owner/team leads to help with queries and technical issues. The company also offers flexibility to employees so that one can attend meetings from home, which is great for women who can then attend to family chores as well. Management is also very supportive of employees career development and provides lot of opportunities to grow in ones career. Cons Should hire people who are equally passionate and dedicated! Advice to Management Very people focused management! Excellent leadership!", "rating": 5, "pros": "Mediaocean is one of the best product companies to work for! If you are looking for great work, latest technologies and good work ethics, then this is the place to be. Having headquarters in NY, we get lot of exposure to new product development and working across various teams globally.", "cons": "Should hire people who are equally passionate and dedicated!", "advice": "Very people focused management! Excellent leadership!"}, {"title": "Collaborative and highly challenging environment - great place to work", "text": "Pros My first surprise was the sensitivity shown towards me being a working mom and the company's views about ensuring the right environment for working mothers. While I went through several interviews in the same period and had almost decided to join another MNC, the transparency in the interviews and the overall employee centric approach of this organization changed my decision in favour of MediaOcean. Between a conducive onboarding process and ensuring clear work objectives to providing the right environment(tools, treatment towards each other, respect for individual's views and a constant push to increase one's potential) , MediaOcean as an organization did stand out from all my previous/ex employers. Inspite of being a relatively smaller organization (employee strength), there is a constant focus on improving employee engagement to mutually benefit the organization's growth and the employee's development. As against other MNC's and Indian MNC's, various functions like HR, finance, admin, managers constantly reach out to employees to collect regular feedback on concerns and work on improvements. For working women (especially working mothers), there is a constant encouragement to ask for support on improving delivery while ensuring a good Work life balance. Based on all of the above, my earlier views on the need to work for large organizations as a means of work security has been squashed. While all of the above points encourage employees to be motivated, in my view, the organization is focused to encourage high performing employees and take appropriate actions (rewards and recognitions) for such employees. As against one of my previous employers where i was one in thousands, my individual contribution used to hardly get any visibility - This was a constant demotivation to me.Based on all of the above, I would recommend MediaOcean to all Software engineers who are passionate about their career and want to work in a conducive environment Cons Need more parking slots as sometimes it becomes difficult when we come in late. Advice to Management Keep up the good work! Please do not dilute the interview process. Best minds at work = Best products. Also its a great feeling to work with the cream crowd/passionate co-workers.", "rating": 5, "pros": "My first surprise was the sensitivity shown towards me being a working mom and the company's views about ensuring the right environment for working mothers. While I went through several interviews in the same period and had almost decided to join another MNC, the transparency in the interviews and the overall employee centric approach of this organization changed my decision in favour of MediaOcean. Between a conducive onboarding process and ensuring clear work objectives to providing the right environment(tools, treatment towards each other, respect for individual's views and a constant push to increase one's potential) , MediaOcean as an organization did stand out from all my previous/ex employers. Inspite of being a relatively smaller organization (employee strength), there is a constant focus on improving employee engagement to mutually benefit the organization's growth and the employee's development. As against other MNC's and Indian MNC's, various functions like HR, finance, admin, managers constantly reach out to employees to collect regular feedback on concerns and work on improvements. For working women (especially working mothers), there is a constant encouragement to ask for support on improving delivery while ensuring a good Work life balance. Based on all of the above, my earlier views on the need to work for large organizations as a means of work security has been squashed. While all of the above points encourage employees to be motivated, in my view, the organization is focused to encourage high performing employees and take appropriate actions (rewards and recognitions) for such employees.", "cons": "Need more parking slots as sometimes it becomes difficult when we come in late.", "advice": "Keep up the good work! Please do not dilute the interview process. Best minds at work = Best products. Also its a great feeling to work with the cream crowd/passionate co-workers."}, {"title": "Perfect work/life balance for women..very intelligent & experienced brains at work", "text": "Pros I have been associated with Media Ocean for an year now, & I feel I have been very lucky that I am part of this organization. I am very proud of my company as it provides extremely healthy & contended work environment for working mothers. Very friendly & people oriented environment where we work with absolute fun and great energy. Cons Never met any incidence that may into this category", "rating": 5, "pros": "I have been associated with Media Ocean for an year now, & I feel I have been very lucky that I am part of this organization. I am very proud of my company as it provides extremely healthy & contended work environment for working mothers. Very friendly & people oriented environment where we work with absolute fun and great energy.", "cons": "Never met any incidence that may into this category", "advice": null}, {"title": "QA Manager", "text": "Pros Workplace is like an extended family for any individual and at MO one will find exactly this. Team, peers, colleagues are so wonderful people, strong technically and pure at heart so does the case with the management & exec team. All are approachable and very open in communication. As we know the road map well, each individual puts her/ his best efforts to strive for the common objective. For the matter of fact women at MO are pretty influential in decision making and this percolates from top to bottom. Feels really proud to be a part of MO family! Cons Even after thorough thinking, not finding any:) Advice to Management Please keep the same exciting work culture!", "rating": 5, "pros": "Workplace is like an extended family for any individual and at MO one will find exactly this. Team, peers, colleagues are so wonderful people, strong technically and pure at heart so does the case with the management & exec team. All are approachable and very open in communication. As we know the road map well, each individual puts her/ his best efforts to strive for the common objective. For the matter of fact women at MO are pretty influential in decision making and this percolates from top to bottom. Feels really proud to be a part of MO family!", "cons": "Even after thorough thinking, not finding any:)", "advice": "Please keep the same exciting work culture!"}, {"title": "Women are treated with dignity and respect. Understanding management.", "text": "Pros Working with Media ocean from last couple of years as a senior QA engineer. Want to highlight few positive points as a women employee: 1. Flexible working hours whenever asked for 2. Supporting and considerate management team 3. All women employees are treated with dignity and respect Cons That's true that we have to attend scrum calls(not more than half an hour) however we have option for attending the same from home. All facilities are provided to attend calls from home.", "rating": 5, "pros": "Working with Media ocean from last couple of years as a senior QA engineer. Want to highlight few positive points as a women employee:", "cons": "That's true that we have to attend scrum calls(not more than half an hour) however we have option for attending the same from home. All facilities are provided to attend calls from home.", "advice": null}, {"title": "It is a good place to work", "text": "Pros Mediaocean is a good place to work. following are the pros 1. Women are not supposed to wait post 7 pm in the company 2. Women employees have a flexibility to go home and take calls 3. Understanding management, if asked for WFH, they normally permit you to do so (Depending on the frequency of asking for WFH. Like any other company, you can't WFH daily) 4. Scrums are necessary evil, however they don't extend more than half an hour. they also can be taken from home. 5. We can skip meetings on Friday's or days when we have our personal priorities. 6. On-site opportunities Cons 1. There should be a proper facility for transportation, since the location is Wakad. Advice to Management None.", "rating": 3, "pros": "Mediaocean is a good place to work. following are the pros", "cons": "1. There should be a proper facility for transportation, since the location is Wakad.", "advice": "None."}, {"title": "Managers don't respect women . Worst company & management for women employees", "text": "Pros If you work like a donkey they will keep you . The moment you want some leave or free time for you , you hear a lot of bad words from manager. No proper planning. Doesn't consider issues Cons Manager doesn't respect woman and dont consider their issues. They have lot of policies on paper. But no use. Even after working so much they will not give you any time to relax. So much work pressure you have to carry all the load at homely. You have to work from morning 7 am till 10:00 and attend all sccrums. Even then they are not satisfied . They will always keep you at gunpoint. After one on ones you feel so harrased that you dont like to see managers face also, But what to do you have to work like that only. Simply feel tensed everyday when manger is around. Advice to Management Any use ? I think you should have a woman managers", "rating": 1, "pros": "If you work like a donkey they will keep you . The moment you want some leave or free time for you , you hear a lot of bad words from manager. No proper planning. Doesn't consider issues", "cons": "Manager doesn't respect woman and dont consider their issues. They have lot of policies on paper. But no use. Even after working so much they will not give you any time to relax. So much work pressure you have to carry all the load at homely. You have to work from morning 7 am till 10:00 and attend all sccrums. Even then they are not satisfied . They will always keep you at gunpoint. After one on ones you feel so harrased that you dont like to see managers face also, But what to do you have to work like that only. Simply feel tensed everyday when manger is around.", "advice": "Any use ? I think you should have a woman managers"}, {"title": "Mediaocean is a great company to work for", "text": "Pros Following are my motivation to work in Mediaocean 1. They have defined their work values very clearly and help, train, encourage, support their employees to follow those values. This creates a great working environment in the company. 2. Politics free environment. If you have innovative ideas in alignment of the company business then you'll be encouraged and will be given all the support. 3. Growth is based on meritocracy. 4. Very capable team of employees, which helps and pushes you to grow. 5. Lots of fun events to create a perfect work life balance. Cons A lot depends on us also how do we take environment around us and what events happen with us. I have found no cons yet in the company. Things have been great for me here. Advice to Management Currently we are a medium size company in terms of employee strength but with time we'll definitely grow and my advice is that retaining the same culture will be a challenge in the long run so keep working on this and don't compromise on values.", "rating": 5, "pros": "Following are my motivation to work in Mediaocean", "cons": "A lot depends on us also how do we take environment around us and what events happen with us. I have found no cons yet in the company. Things have been great for me here.", "advice": "Currently we are a medium size company in terms of employee strength but with time we'll definitely grow and my advice is that retaining the same culture will be a challenge in the long run so keep working on this and don't compromise on values."}, {"title": "Fantastic, fun atmosphere, helpful staff just an all-round lovely environment to work in.", "text": "Pros Great Benefits, great working environment and staff retention generally very high. Cons As yet, I cannot come up with any significant cons, might need to update at a later date, well hopefully not .", "rating": 5, "pros": "Great Benefits, great working environment and staff retention generally very high.", "cons": "As yet, I cannot come up with any significant cons, might need to update at a later date, well hopefully not .", "advice": null}, {"title": "Great company, interesting domain and challenging technology!", "text": "Pros Great company to work for. Open work culture, open door policy, encourage new learning, challenging technical work, interesting domain. People are asset here. Senior technology leads always looking for the latest and the greatest of the open source solution for making the product secure, reliable and scalable. Cons Can't think of any at the moment. Most of the cons are now fixed!", "rating": 5, "pros": "Great company to work for. Open work culture, open door policy, encourage new learning, challenging technical work, interesting domain. People are asset here. Senior technology leads always looking for the latest and the greatest of the open source solution for making the product secure, reliable and scalable.", "cons": "Can't think of any at the moment. Most of the cons are now fixed!", "advice": null}, {"title": "Perfect place to work and explore your knowledge.", "text": "Pros It is indeed a great experience to work with MediaOcean. I would like to say that this is a bunch of quality people and everyone is trying to sharp his/her knowledge by taking different exciting tasks. Support from Management is always a key aspect to grow which is always being there. We are not only getting a freedom to work but share your thoughts and choices. Company has spread in different locations with different time zones, however their enthusiasm and positive working environment are awesome. This is prefect place where you observe the Work-Life-Balance. Apart from daily routine, CSR and BW (Beyond Work) teams are always kept employees focus and enthusiastic. Cons Lots of noble things so hard to pinpoint any Cons… None Advice to Management Nothing… as they are specialist in their areas.", "rating": 5, "pros": "It is indeed a great experience to work with MediaOcean. I would like to say that this is a bunch of quality people and everyone is trying to sharp his/her knowledge by taking different exciting tasks. Support from Management is always a key aspect to grow which is always being there. We are not only getting a freedom to work but share your thoughts and choices.", "cons": "Lots of noble things so hard to pinpoint any Cons… None", "advice": "Nothing… as they are specialist in their areas."}, {"title": "Never join Media ocean. The management is very partial and corrupt.", "text": "Pros Only good thing about this company is its location. Cons They will hire you saying we are going public in 2 years. And those 2 years always go ++. The manager will recruit his nears and dears only and do lobyying. No processes . Too much politics, manager will micromanage you. At times stare at your screen and stand at back to see what you are doing. Advice to Management No hope for company. So advice it waste.", "rating": 1, "pros": "Only good thing about this company is its location.", "cons": "They will hire you saying we are going public in 2 years. And those 2 years always go ++. The manager will recruit his nears and dears only and do lobyying. No processes . Too much politics, manager will micromanage you. At times stare at your screen and stand at back to see what you are doing.", "advice": "No hope for company. So advice it waste."}, {"title": "Excellent workplace. Great atmosphere. Fun loving & friendly management. Good compensation and benefits", "text": "Pros Excellent workplace. Great atmosphere. Fun loving & friendly management. Good compensation and benefits Cons Excellent workplace. Great atmosphere. Fun loving & friendly management. Good compensation and benefits", "rating": 5, "pros": "Excellent workplace. Great atmosphere. Fun loving & friendly management. Good compensation and benefits", "cons": "Excellent workplace. Great atmosphere. Fun loving & friendly management. Good compensation and benefits", "advice": null}, {"title": "Top No. 1 firing company of all the time", "text": "Pros Top No. 1 firing company of all the time Cons You never know when you get fire from this employer", "rating": 1, "pros": "Top No. 1 firing company of all the time", "cons": "You never know when you get fire from this employer", "advice": null}, {"title": "Life At Mediaocean", "text": "Pros Good management team. Happy and healthy environment. Open culture is followed with i like the most. Work with Fun life i have enjoyed here. Growth rate is too good. Cons No cons found yet but would be happy if mediaocean have their own separate building. Advice to Management Doing good. Keep it up. :) Looking forward", "rating": 5, "pros": "Good management team. Happy and healthy environment. Open culture is followed with i like the most. Work with Fun life i have enjoyed here. Growth rate is too good.", "cons": "No cons found yet but would be happy if mediaocean have their own separate building.", "advice": "Doing good. Keep it up. :)"}, {"title": "Mediaocean - The best place to work", "text": "Pros 1. Friendly environment 2. Different and interesting product domain 3. Better growth perpective 4. Work gets identified immediately Cons 1. Need to learn the things quickly and implement it. Thus opportunity to prove ourselves 2. Leadership, how to work in tight deadlines with better quality Advice to Management 1. It would be good if the mgmt will restrict them in multilayer working process in some extent and not so open minded to all employees. (This is aplicable wherever required)", "rating": 5, "pros": "1. Friendly environment", "cons": "1. Need to learn the things quickly and implement it. Thus opportunity to prove ourselves", "advice": "1. It would be good if the mgmt will restrict them in multilayer working process in some extent and not so open minded to all employees. (This is aplicable wherever required)"}, {"title": "Excellent place to work in, great work environment . benefits are OK and improving , like the work ,technology stack ,", "text": "Pros like the work and the opportunity for growth along with the stability and job security . Niche domain   lot of support from Managers for learning / training , can look at Mediaocean for a long stint , overall good experience , work life balance is there . handson job Cons nothing as of now, nothing so glaring , everything is ok , nothing to complain Advice to Management like the open culture and support provided , have been with the organization for sometime and like the overall culture and work environment", "rating": 5, "pros": "like the work and the opportunity for growth along with the stability and job security . Niche domain", "cons": "nothing as of now, nothing so glaring , everything is ok , nothing to complain", "advice": "like the open culture and support provided , have been with the organization for sometime and like the overall culture and work environment"}, {"title": "Mostly v. good colleagues & I learned a lot. Sadly one or two skills gaps not identified/understood until too late", "text": "Pros Lively, sociable environment. Line- and dept. management make all efforts to avoid a \"them and us\" culture. Consistently good on unit tests, code reviews & other code-quality practices. Cons (As of Aug 2013) Technical leadership was too thinly spread. A lot of developer time spent on slow or error-prone tasks, and a culture that tended to try and combat predictable human error via diligence rather than remove the threat via programming. Advice to Management Any budget you can find for for automating manual tasks or checks for foreseeable human error will pay for itself over and over again and improve morale into the bargain, especially if it saves overtime. Sorry for the rather one-track review, but this is the one problem I saw there that wastes your money at a regular, measurable rate until it's fixed.", "rating": 3, "pros": "Lively, sociable environment. Line- and dept. management make all efforts to avoid a \"them and us\" culture. Consistently good on unit tests, code reviews & other code-quality practices.", "cons": "(As of Aug 2013) Technical leadership was too thinly spread. A lot of developer time spent on slow or error-prone tasks, and a culture that tended to try and combat predictable human error via diligence rather than remove the threat via programming.", "advice": "Any budget you can find for for automating manual tasks or checks for foreseeable human error will pay for itself over and over again and improve morale into the bargain, especially if it saves overtime."}, {"title": "Recruiter", "text": "Pros Really Decent organisation to work Cons The only Cons about this organisation is that it is outside the city", "rating": 5, "pros": "Really Decent organisation to work", "cons": "The only Cons about this organisation is that it is outside the city", "advice": null}, {"title": "Excellent place to work", "text": "Pros Good working culture, innovative, good salary, helping management, good growth prospects, free snacks :) Cons few of employee policies aren't upto industry standard. Advice to Management Marketing/Advertising required to establish a brand name.", "rating": 5, "pros": "Good working culture, innovative, good salary, helping management, good growth prospects, free snacks :)", "cons": "few of employee policies aren't upto industry standard.", "advice": "Marketing/Advertising required to establish a brand name."}, {"title": "most energetic", "text": "Pros Friendly environment which keeps your mind fresh. Cons you have to sum up your work on time and go back home. Advice to Management Should consider the one who is working for the company not by the company.", "rating": 5, "pros": "Friendly environment which keeps your mind fresh.", "cons": "you have to sum up your work on time and go back home.", "advice": "Should consider the one who is working for the company not by the company."}]