[{"title": "Healthy Startup", "text": "Pros I started working at MEDIGO few weeks ago and from the first day on, I felt confortable and part of the team! The communication between us is easy : we are all listening and interact with each other because in a start up there is no bad ideas! As an international team, we have different experiences, cultures, backgrounds which make exchanges better! The working environment is enjoyable and well located to appreciate lunches outside :) Cons There is not much I can say about negatives aspects : So far so good! Advice to Management Keep simple and easy", "rating": 5, "pros": "I started working at MEDIGO few weeks ago and from the first day on, I felt confortable and part of the team!", "cons": "There is not much I can say about negatives aspects : So far so good!", "advice": "Keep simple and easy"}, {"title": "Great atmosphere and colleagues", "text": "Pros MEDIGO is a very good start up company to work for with all of the advantages of a start up, great atmosphere and colleagues and a very international environment. I really enjoy the fact that it doesn't matter what is your position, you can easily request meetings with the upper management, and everyone is very accessible. I find it to be a company where people care about you as an employee. A lot is organised by the company or the employees outside of the work environment such as sport, nights out... As well, even though I just started working here, I was invited to join the company trip to Barcelona! I did not expect a start up to organise a trip first of, but also such a great one! Cons There is no real point on which I am unsatisfied. Maybe the only thing will be receiving more feedback and getting to know more on what is being achieved in the different departments. Advice to Management Keep it up!", "rating": 5, "pros": "MEDIGO is a very good start up company to work for with all of the advantages of a start up, great atmosphere and colleagues and a very international environment. I really enjoy the fact that it doesn't matter what is your position, you can easily request meetings with the upper management, and everyone is very accessible.", "cons": "There is no real point on which I am unsatisfied. Maybe the only thing will be receiving more feedback and getting to know more on what is being achieved in the different departments.", "advice": "Keep it up!"}, {"title": "Great people, great space", "text": "Pros Although it's not been very long, my experience so far has been overwhelmingly good. Hiring an international (non-European) can be quite a daunting task, but the team was sympathetic to the challenges of being on a different continent. The process was smooth and transparent, with amazing HR support throughout. The team is great, led by exceptionally encouraging management. Cons The space crunch makes conversations between colleagues - casual and professional - difficult. And until we get the terrace back, it's going to be tough for everyone who needs a bit of fresh air once in a while.", "rating": 5, "pros": "Although it's not been very long, my experience so far has been overwhelmingly good.", "cons": "The space crunch makes conversations between colleagues - casual and professional - difficult. And until we get the terrace back, it's going to be tough for everyone who needs a bit of fresh air once in a while.", "advice": null}, {"title": "Unique", "text": "Pros MEDIGO is the best company I've ever worked for. First of all; I would say it is quite reductive to define it as a start-up. Not only has MEDIGO managed to distance itself from all the other Berlin start-ups thanks to the nature of its mission, which is loaded with social value and has a real, world-wide scope to change the very face of the planet for the better. The results achieved by the company have made it a reality in the healthcare world. These reflections alone represent a guarantee for me. In addition, flexibility and good mood are a rule during the working times and recreating events. The team is excellent because everyone, truly, is judged here by the content of her or his character. And some of my colleagues are now some of my best friends in Berlin. Cons In a first phase, the limited space made it quite difficult to operate properly and work with efficiency. But now the office has found a good rearrangement. Advice to Management The Management team is friendly and down to earth, real enough to be approached by everyone and above all always ready to meet the team's request - within reason. Nobody would work for a bad management of course - and the success of the company speaks for the good conduct of its directors as well.", "rating": 5, "pros": "MEDIGO is the best company I've ever worked for. First of all; I would say it is quite reductive to define it as a start-up. Not only has MEDIGO managed to distance itself from all the other Berlin start-ups thanks to the nature of its mission, which is loaded with social value and has a real, world-wide scope to change the very face of the planet for the better. The results achieved by the company have made it a reality in the healthcare world. These reflections alone represent a guarantee for me. In addition, flexibility and good mood are a rule during the working times and recreating events. The team is excellent because everyone, truly, is judged here by the content of her or his character. And some of my colleagues are now some of my best friends in Berlin.", "cons": "In a first phase, the limited space made it quite difficult to operate properly and work with efficiency. But now the office has found a good rearrangement.", "advice": "The Management team is friendly and down to earth, real enough to be approached by everyone and above all always ready to meet the team's request - within reason. Nobody would work for a bad management of course - and the success of the company speaks for the good conduct of its directors as well."}, {"title": "So far so good!", "text": "Pros - Talented and driven team - Transparent management - Openness between colleagues - Awesome company atmosphere - Nice range of outside of work activities (Friday bay / badminton / German lessons) Cons - Quite a low salary (but you don't move to Berlin for high salaries) - Stay away if you're allergic to dogs Advice to Management I've had a great first impression, so keep up the good work. I really enjoy the Monday morning company-wide meeting - It gives a good insight into all the cogs in the MEDIGO machine :)", "rating": 5, "pros": "- Talented and driven team", "cons": "- Quite a low salary (but you don't move to Berlin for high salaries)", "advice": "I've had a great first impression, so keep up the good work. I really enjoy the Monday morning company-wide meeting - It gives a good insight into all the cogs in the MEDIGO machine :)"}, {"title": "Patient Case Manager", "text": "Pros I joined MEDIGO because I believe the healthcare industry is fascinating and I enjoy the dynamic start-up mindset. I strongly believe in MEDIGO's concept, it is a very promising product. Not to forget, MEDIGO is based in the buzzing city of Berlin, which makes it even more attractive. Cons Working in a start-up can seem intense for some people in terms of Work/Life Balance. I personally see it as an opportunity to learn and grow as an individual and it works perfectly fine with me. However, if you seek countless employees benefits, a high salary, or set working hours, a start-up is certainly not for you.", "rating": 5, "pros": "I joined MEDIGO because I believe the healthcare industry is fascinating and I enjoy the dynamic start-up mindset. I strongly believe in MEDIGO's concept, it is a very promising product. Not to forget, MEDIGO is based in the buzzing city of Berlin, which makes it even more attractive.", "cons": "Working in a start-up can seem intense for some people in terms of Work/Life Balance. I personally see it as an opportunity to learn and grow as an individual and it works perfectly fine with me. However, if you seek countless employees benefits, a high salary, or set working hours, a start-up is certainly not for you.", "advice": null}, {"title": "Great company with great future!", "text": "Pros Great founders, experienced management, show great results and know how to make magic happen. Great atmosphere, great team, cool people, very friendly and supporting environment. International young ambitious professionals, that come to Berlin and want to change the world (of medical travel) Cons No contras if you are passionate to success and clever enough to add value Advice to Management Go, go, go, don't stop!", "rating": 5, "pros": "Great founders, experienced management, show great results and know how to make magic happen. Great atmosphere, great team, cool people, very friendly and supporting environment. International young ambitious professionals, that come to Berlin and want to change the world (of medical travel)", "cons": "No contras if you are passionate to success and clever enough to add value", "advice": "Go, go, go, don't stop!"}, {"title": "Amazing atmosphero - Low salary", "text": "Pros Young international people Beautiful office and great atmosphere Interesting business Cons Very low salaries even for people who have been working there for a long time, unless you are Head of Department", "rating": 3, "pros": "Young international people", "cons": "Very low salaries even for people who have been working there for a long time, unless you are Head of Department", "advice": null}, {"title": "Fun and passionate work environment", "text": "Pros The team as a whole is a huge asset of this company. Everyone is going in the same direction to make Medigo go forward. The diversity in profiles, backgrounds, skills and cultures really brings a lot to the overall performance and to the quality of work environment. Also the transparency is really taken seriously. The management is very accessible, the important decisions are shared with everybody and are opened to inputs from anyone, really! Cons No downsides so far. Obviously no company is perfect but it feels like any problem could be honestly pointed out and solved together. Advice to Management Keep doing this way by staying close to the core company values", "rating": 5, "pros": "The team as a whole is a huge asset of this company. Everyone is going in the same direction to make Medigo go forward. The diversity in profiles, backgrounds, skills and cultures really brings a lot to the overall performance and to the quality of work environment.", "cons": "No downsides so far. Obviously no company is perfect but it feels like any problem could be honestly pointed out and solved together.", "advice": "Keep doing this way by staying close to the core company values"}, {"title": "Love my start at Medigo", "text": "Pros + The team is great, you can feel the real startup spirit here, the team is very international with diverse background + The overall idea of health tourism looks very important and challenging to me, glad to work on it now + Like the IT team, the process, technologies, people's skills Cons I would love the team would focus more on the automation tasks, but probably the company is still on the path to that direction Advice to Management Don't get any so far", "rating": 5, "pros": "+ The team is great, you can feel the real startup spirit here, the team is very international with diverse background", "cons": "I would love the team would focus more on the automation tasks, but probably the company is still on the path to that direction", "advice": "Don't get any so far"}, {"title": "Fast growing, multinational company", "text": "Pros Great culture, bosses opened for input and feedback, nice team - pleasant working atmosphere all in all Also, great location Cons none so far. growing fast, office is quite full at times", "rating": 5, "pros": "Great culture, bosses opened for input and feedback, nice team - pleasant working atmosphere all in all", "cons": "none so far. growing fast, office is quite full at times", "advice": null}, {"title": "Great coworkers, management needs help", "text": "Pros There is a great company culture and a great atmosphere to work in. Upper management is very accessible and there is always something interesting going on. Working here is never boring. There are many opportunities to learn new skills and try new things. Ugur, Pawel, Ieva, and Christoph are especially excellent to work with. Cons Sometimes the fun gets in the way of work. When you have significantly more work than other people you are often put in the position of either letting them distract you from getting things done or being a downer. There are major pay gaps in the company, which management never seemed interested in addressing seriously. Middle management was very difficult to deal with and had a very clique-ish attitude. Advice to Management Address pay gaps if you want to retain talent. Middle management needs to understand how to manage people better. An evaluation process that effectively produces results is crucial.", "rating": 5, "pros": "There is a great company culture and a great atmosphere to work in. Upper management is very accessible and there is always something interesting going on. Working here is never boring. There are many opportunities to learn new skills and try new things. Ugur, Pawel, Ieva, and Christoph are especially excellent to work with.", "cons": "Sometimes the fun gets in the way of work. When you have significantly more work than other people you are often put in the position of either letting them distract you from getting things done or being a downer. There are major pay gaps in the company, which management never seemed interested in addressing seriously. Middle management was very difficult to deal with and had a very clique-ish attitude.", "advice": "Address pay gaps if you want to retain talent. Middle management needs to understand how to manage people better. An evaluation process that effectively produces results is crucial."}, {"title": "Nice culture, friendly and hardworking coworkers, good balance of hard work and fun!", "text": "Pros - independence - ideas are heard - opportunities to move up in the company - young, approachable, fun founders - nice office space - opportunities to travel Cons - culture of long working hours, but this is usually a choice and you will usually get a friendly \"GO HOME!!\" from a colleague, and they will usually ask you what work is bogging you down, and see how it can be eg. shared out better! Advice to Management Don't let things change too much : D", "rating": 5, "pros": "- independence", "cons": "- culture of long working hours, but this is usually a choice and you will usually get a friendly \"GO HOME!!\" from a colleague, and they will usually ask you what work is bogging you down, and see how it can be eg. shared out better!", "advice": "Don't let things change too much : D"}, {"title": "Best company I have ever worked for :)", "text": "Pros + Professional, ambitious employees who all work hard for MEDIGO's success + 30 nationalities within a team of currently 50 people; it's very rewarding to work in a global team building a global product with lots of purpose + Awesome work spirit, every single person adds up to an energetic, respectful and motivating team atmosphere + Lots of fun events, free German classes and knowledge sharing workshops + Founders are very easy to approach, transparency is taken seriously, trust and responsibilities are given generously which is very motivating Cons + MEDIGO develops fast which brings the usual challenges for a growing startup. Exciting times to be a part of it! Advice to Management Keep doing what you are doing :)", "rating": 5, "pros": "+ Professional, ambitious employees who all work hard for MEDIGO's success", "cons": "+ MEDIGO develops fast which brings the usual challenges for a growing startup. Exciting times to be a part of it!", "advice": "Keep doing what you are doing :)"}, {"title": "A young company with a great professional working atmosphere.", "text": "Pros The chance for personal growth and development as well having an impact on the success of the company. Good company culture with regular team events, lunches, drinks etc. Professional but relaxed atmosphere. Cons A rapidly expanding team means there are not enough spaces in the small, temporary office! The lack of space also makes it hard to carry out consecutive meetings or maintain a good level of privacy.", "rating": 5, "pros": "The chance for personal growth and development as well having an impact on the success of the company. Good company culture with regular team events, lunches, drinks etc. Professional but relaxed atmosphere.", "cons": "A rapidly expanding team means there are not enough spaces in the small, temporary office! The lack of space also makes it hard to carry out consecutive meetings or maintain a good level of privacy.", "advice": null}, {"title": "I would not do it again: used to be great.", "text": "Pros Medigo is a great brand in the medical tourism field. It is appreciated by the customer and looks very professional. As an employer, it provides quite a great amount of employees benefits and the communication between teams is excellent. Friday beers are always highly appreciated and it is easy to make good friends there. The company and the people are pretty young and very multi-cultural. Also, there is (still) very talented people working in the company and this is a great ressource to learn a lot from their experience and skills. This is a very challenging environment which makes the tasks interesting and permits to gather a maximum of various experiences while being creative. The IT team is working with the last and trendy tech and always has room for experiences that can improve the user experience or the life of the employees. The Care Team (Customer Care) is very appreciated and it can be seen through the reviews provided on the website and the Brand Ambassador program. Digital Marketing looks challenging and probably requires even more creativity and so does Brand & PR. Cons Since March 2016, the work-life climate strongly degraded itself for all employees and working there is not a pleasure anymore for quite a bunch of people. This is partially why I have seen many of my colleagues and ex-colleagues leave the company and so did I. Also, it is easy to find startups in Berlin that provides similar advantages, but where employee satisfaction is viewed as one of the main goal (it is useless to only measure it...) and taken seriously into account by the management (and not only HR). Also, salary can be pretty lower than other similar startups in Berlin and the environment is not rewarding or not rewarding enough to compensate these problems.", "rating": 1, "pros": "Medigo is a great brand in the medical tourism field. It is appreciated by the customer and looks very professional.", "cons": "Since March 2016, the work-life climate strongly degraded itself for all employees and working there is not a pleasure anymore for quite a bunch of people. This is partially why I have seen many of my colleagues and ex-colleagues leave the company and so did I.", "advice": null}, {"title": "Great place to work at", "text": "Pros Great concept with huge potential that aims to help people in-need! Strong investors. Very international, professional and motivated team. Afterwork fun!!! Cons Would be cool to have a ping pong table in the office :P", "rating": 5, "pros": "Great concept with huge potential that aims to help people in-need! Strong investors. Very international, professional and motivated team. Afterwork fun!!!", "cons": "Would be cool to have a ping pong table in the office :P", "advice": null}]