[{"title": "Pensions", "text": "Pros Reliable Long Term Employment and many of the managers are great. Cons There are unrealistic expectations at times", "rating": 5, "pros": "Reliable Long Term Employment and many of the managers are great.", "cons": "There are unrealistic expectations at times", "advice": null}, {"title": "A Great Company", "text": "Pros They really value their employee capital. There are lots of areas to improve yourself (and I dont mean advancement) and they always have new initiatives so you can stay involved. Medical insurance benefits are very good. Cons Do not plan to progress much without a degree. This is a company that highly values degrees and you will not get very far without one. There are a lot of dead end jobs there like any other company. Advice to Management Just because a person with 15+ years of experience does not have a degree does not mean they are not worthy of advancement. A degree should help you get the job you want but at a certain point they are no longer meaningful. Stop holding people back or respecting them less because they do not have one.", "rating": 5, "pros": "They really value their employee capital. There are lots of areas to improve yourself (and I dont mean advancement) and they always have new initiatives so you can stay involved. Medical insurance benefits are very good.", "cons": "Do not plan to progress much without a degree. This is a company that highly values degrees and you will not get very far without one. There are a lot of dead end jobs there like any other company.", "advice": "Just because a person with 15+ years of experience does not have a degree does not mean they are not worthy of advancement. A degree should help you get the job you want but at a certain point they are no longer meaningful. Stop holding people back or respecting them less because they do not have one."}, {"title": "Producer", "text": "Pros Great people to work with Cons Big companies have big problems but nothing out of the ordinary", "rating": 5, "pros": "Great people to work with", "cons": "Big companies have big problems but nothing out of the ordinary", "advice": null}, {"title": "Tampa Office Review", "text": "Pros Good people to work with. Cons Should have a better career development program", "rating": 5, "pros": "Good people to work with.", "cons": "Should have a better career development program", "advice": null}, {"title": "Sales Trainee", "text": "Pros Great opportunities for growth as recent graduate: As a student fresh out of college you have the opportunity to achieve more success in 2 years than most people in your graduating class would in 5 years. Cons Unpredictability of your future position at the company: The role of a Sales Trainee only ensures that you'll be in one location for a approximately a year. Anything beyond that year is can not be insured until an unknown unspecified date that varies from trainee to trainee. Advice to Management Create transparency when hiring Sales Trainees. When hiring they should inform the candidates that they will have to take 4 tests. Two state and two FINRA licensing tests. Additionally they should emphasize the fact that your future position is not guaranteed nor will it likely be where you want it to be.", "rating": 5, "pros": "Great opportunities for growth as recent graduate:", "cons": "Unpredictability of your future position at the company:", "advice": "Create transparency when hiring Sales Trainees. When hiring they should inform the candidates that they will have to take 4 tests. Two state and two FINRA licensing tests. Additionally they should emphasize the fact that your future position is not guaranteed nor will it likely be where you want it to be."}, {"title": "Great experience", "text": "Pros great environment and some of the managers are respectful Cons some managers were bias but that is just corporate america Advice to Management keep us the great work", "rating": 5, "pros": "great environment and some of the managers are respectful", "cons": "some managers were bias but that is just corporate america", "advice": "keep us the great work"}, {"title": "Great company", "text": "Pros Great managemnt, room for growth, very happy overall Cons Moved away to South Carolina Advice to Management Keep the current offices!", "rating": 5, "pros": "Great managemnt, room for growth, very happy overall", "cons": "Moved away to South Carolina", "advice": "Keep the current offices!"}, {"title": "MetLife is good", "text": "Pros MetLife is a global company Cons There is no Cons in MetLife", "rating": 5, "pros": "MetLife is a global company", "cons": "There is no Cons in MetLife", "advice": null}, {"title": "Good place to work overall", "text": "Pros Good life/work balance, good pay, decent raises, great bonus, really good insurance, they match 4 percent if you put 5 percent of your salary into a 401K. Cons Becoming more strict about not working from home, lack of direction for your personal career from managers, easy to get frustrated with bureaucracy. Advice to Management Be more transparent and help steer your key people into higher positions/promotions.", "rating": 5, "pros": "Good life/work balance, good pay, decent raises, great bonus, really good insurance, they match 4 percent if you put 5 percent of your salary into a 401K.", "cons": "Becoming more strict about not working from home, lack of direction for your personal career from managers, easy to get frustrated with bureaucracy.", "advice": "Be more transparent and help steer your key people into higher positions/promotions."}, {"title": "Great Benefits", "text": "Pros The benefits that ML offers are fantastic Cons If you take a job in the call center you have to bid for a first shift position. This is horrible. Advice to Management The bidding for one's shift should be brought up at the phone screen phase.", "rating": 5, "pros": "The benefits that ML offers are fantastic", "cons": "If you take a job in the call center you have to bid for a first shift position. This is horrible.", "advice": "The bidding for one's shift should be brought up at the phone screen phase."}, {"title": "Financial Analyst", "text": "Pros Good team environment. Nice benefits Cons There is slow growth opportunity.", "rating": 5, "pros": "Good team environment. Nice benefits", "cons": "There is slow growth opportunity.", "advice": null}, {"title": "Metlife; the good, the bad, the ugly.", "text": "Pros Great benefits, great colleagues. Huge company. Good technology. Great high level goals. Cons Co-workers and managers can be abrasive and no one manages them. Managers can be focused on non-performance related aspects of workplace environment like telecommuting to the detriment of their reports well being. No comp time when you telecommute on weekends or nights. Do they even wonder why they are losing good people? No exit interviews. I think that makes the point. I would have stayed if they had kept their promises - I wanted to stay - I was pushed out - I felt they gave me no alternative but to leave. Advice to Management Distant senior management needs better management skills - they tend to over control silly stuff like whether you are on site or not, as they build more buildings because they are running out of room in existing buildings. If they knew what they were doing they would stand up for their employees based on the work accomplished and stop sniping about who is where when they are working.", "rating": 3, "pros": "Great benefits, great colleagues. Huge company. Good technology. Great high level goals.", "cons": "Co-workers and managers can be abrasive and no one manages them. Managers can be focused on non-performance related aspects of workplace environment like telecommuting to the detriment of their reports well being. No comp time when you telecommute on weekends or nights. Do they even wonder why they are losing good people? No exit interviews. I think that makes the point. I would have stayed if they had kept their promises - I wanted to stay - I was pushed out - I felt they gave me no alternative but to leave.", "advice": "Distant senior management needs better management skills - they tend to over control silly stuff like whether you are on site or not, as they build more buildings because they are running out of room in existing buildings. If they knew what they were doing they would stand up for their employees based on the work accomplished and stop sniping about who is where when they are working."}, {"title": "IT Manager", "text": "Pros Good Benefits, lots of room to grow Cons Lots of work to do to get to a world class IT department.", "rating": 5, "pros": "Good Benefits, lots of room to grow", "cons": "Lots of work to do to get to a world class IT department.", "advice": null}, {"title": "Global Claims", "text": "Pros Flex hours, availability of occasional work from home. Company pension is a plus. Generous time off, decent pay for the area. Cons Substandard training, emphasis on numbers instead of work quality. Time spent on one new confusing corporate initiative after another instead of just training employees well and allowing people to do their job. Poor selection of medical benefits. Distrust management due to clique mentality and lack of professionalism. Career advancement dictated by who you know. Advice to Management Put more effort into training and clean up middle management.", "rating": 3, "pros": "Flex hours, availability of occasional work from home. Company pension is a plus. Generous time off, decent pay for the area.", "cons": "Substandard training, emphasis on numbers instead of work quality. Time spent on one new confusing corporate initiative after another instead of just training employees well and allowing people to do their job. Poor selection of medical benefits. Distrust management due to clique mentality and lack of professionalism. Career advancement dictated by who you know.", "advice": "Put more effort into training and clean up middle management."}, {"title": "Sales", "text": "Pros Compensation was great but changes every year Cons Work/Life balance was always a problem Advice to Management Listen to your employees", "rating": 3, "pros": "Compensation was great but changes every year", "cons": "Work/Life balance was always a problem", "advice": "Listen to your employees"}, {"title": "Stable Job, No Job growth, decent befits,", "text": "Pros The Pay scales and benefits are decent compared to other IT organizations in large insurance companies Less stressful, projects are funded and performed a decent pace, you are not expected to work on the weekends or late nights Work culture is great as long as you an network and get into so called inner circles Senior management values talented employees Flexible hours are available as long as your management agrees Cons No Job Growth at all. Look at MetLife's layoff cycle in 2013 and 2014, and in another 10 Years this will happen to the new hires as well. Pay scales can improve on the IT organization.", "rating": 3, "pros": "The Pay scales and benefits are decent compared to other IT organizations in large insurance companies", "cons": "No Job Growth at all. Look at MetLife's layoff cycle in 2013 and 2014, and in another 10 Years this will happen to the new hires as well.", "advice": null}, {"title": "Client Acquisition Consultant", "text": "Pros Coworkers are amazing, Flexibility in work schedule Cons Leadership, turnover, systems, workload balance, lack of career paths Advice to Management Managers need leadership training and not just from their managers. There should be a required course that they take. A career path needs to be developed.", "rating": 3, "pros": "Coworkers are amazing, Flexibility in work schedule", "cons": "Leadership, turnover, systems, workload balance, lack of career paths", "advice": "Managers need leadership training and not just from their managers. There should be a required course that they take. A career path needs to be developed."}, {"title": "It's ok if you friend the right people", "text": "Pros Good benefits, good pay, good people for the most part Cons Watch who you talk to and do not go above your supervisors head or you will find the door", "rating": 5, "pros": "Good benefits, good pay, good people for the most part", "cons": "Watch who you talk to and do not go above your supervisors head or you will find the door", "advice": null}, {"title": "Review", "text": "Pros I had a great 10 years with Metlife Cons Management expectations were unrealistic", "rating": 5, "pros": "I had a great 10 years with Metlife", "cons": "Management expectations were unrealistic", "advice": null}, {"title": "Financial Services Rep", "text": "Pros Flexibility, lots of financial potential Cons Market and channels of sales for financial products in a state of change", "rating": 3, "pros": "Flexibility, lots of financial potential", "cons": "Market and channels of sales for financial products in a state of change", "advice": null}, {"title": "Insurance sales", "text": "Pros Learned more hear than ever other insurance company very diverse and sales are high. Management communicates effectively. HR is very attentive! Cons Training could be better. Take the time to explain things so that new employees can adjust better when it is time for sales. Advice to Management Nothing", "rating": 3, "pros": "Learned more hear than ever other insurance company very diverse and sales are high. Management communicates effectively. HR is very attentive!", "cons": "Training could be better. Take the time to explain things so that new employees can adjust better when it is time for sales.", "advice": "Nothing"}, {"title": "Administrative Marketing Assistant Part-time", "text": "Pros Hours were great for part-time work. Pay was good as well. Cons Had to be paid thru an out sourced service with no benefits. No opportunity for advancement as the company was laying off people.", "rating": 5, "pros": "Hours were great for part-time work. Pay was good as well.", "cons": "Had to be paid thru an out sourced service with no benefits. No opportunity for advancement as the company was laying off people.", "advice": null}, {"title": "Good place for a career", "text": "Pros Co-workers were great-teamwork, mentoring, & social. Had numerous opportunities to take on special projects & assignments. The work was always interesting. My divisional management team, from senior level & downward, listened to the associates & encouraged open communication. Cons MetLife is a global corporation, sometimes it was overwhelming & many decisions were made that may have been good for business (profit) but not the associates. It resulted in many layoffs over the years. Advice to Management Bigger isn’t always better. Some of the “MetLife Family” feeling has been lost.", "rating": 5, "pros": "Co-workers were great-teamwork, mentoring, & social. Had numerous opportunities to take on special projects & assignments. The work was always interesting. My divisional management team, from senior level & downward, listened to the associates & encouraged open communication.", "cons": "MetLife is a global corporation, sometimes it was overwhelming & many decisions were made that may have been good for business (profit) but not the associates. It resulted in many layoffs over the years.", "advice": "Bigger isn’t always better. Some of the “MetLife Family” feeling has been lost."}, {"title": "Lots of Managers, few who demonstrate good leadership. HR cannot be trusted.", "text": "Pros Bonus annually, pretty campus, friendly coworkers at Director levels and below. Tremendous and exciting transformation initiatives across geographies and divisions. Cons HR has not emphasized importance to get talent or commitment to being an advocate for employees.. Attracting, developing and retaining talent is a third or fourth level concern amongst many executive managers when maintaining competitive advantage over competitors. Advice to Management Include emphasis on workforce talent - attracting, developing, and mentoring amongst performance goals for executive level managers. If HR says the company has commitments to confidentially and non-retaliation, make good on it.", "rating": 3, "pros": "Bonus annually, pretty campus, friendly coworkers at Director levels and below. Tremendous and exciting transformation initiatives across geographies and divisions.", "cons": "HR has not emphasized importance to get talent or commitment to being an advocate for employees..", "advice": "Include emphasis on workforce talent - attracting, developing, and mentoring amongst performance goals for executive level managers. If HR says the company has commitments to confidentially and non-retaliation, make good on it."}, {"title": "Metlife", "text": "Pros The work life balance is great. Cons MetLife has a high turnover rate because of the pay. Advice to Management Higher pay.", "rating": 3, "pros": "The work life balance is great.", "cons": "MetLife has a high turnover rate because of the pay.", "advice": "Higher pay."}, {"title": "Innovative and Forward Thinking Company", "text": "Pros Compensation, customer focus, investment in technology Cons Very large company. Shareholder return is key driving factor in business decisions. Advice to Management Keep investing in technology and people and the company will continue to thrive in an uncertain environment.", "rating": 5, "pros": "Compensation, customer focus, investment in technology", "cons": "Very large company. Shareholder return is key driving factor in business decisions.", "advice": "Keep investing in technology and people and the company will continue to thrive in an uncertain environment."}, {"title": "Fresh new building doesn't change stale culture.", "text": "Pros It's a reliable place to work and they don't play games with your money. They're trying to change the culture, and the success of that hinges on the direct leadership you end up working for. Cons The IT teams lives and dies by the budget the business has to spend: if you don't have a budgeted project to pay for your time, you and your manager have to find busy work and cook the books to make it look like you're fully funded. It's probably better after the Brighthouse split, since that put a lot of budgets on hold. In the new NC hub, they put XBox rooms on every floor, but managers frown upon using them. This probably sounds petty, but to have a highly visible, fun room with a game console right by the elevators ends up highlighting that nobody's comfortable playing games there. Advice to Management You've tried to make some changes, but haven't committed to them. Get leaders to go along with changes", "rating": 3, "pros": "It's a reliable place to work and they don't play games with your money. They're trying to change the culture, and the success of that hinges on the direct leadership you end up working for.", "cons": "The IT teams lives and dies by the budget the business has to spend: if you don't have a budgeted project to pay for your time, you and your manager have to find busy work and cook the books to make it look like you're fully funded. It's probably better after the Brighthouse split, since that put a lot of budgets on hold.", "advice": "You've tried to make some changes, but haven't committed to them. Get leaders to go along with changes"}, {"title": "Senior Sales Executive", "text": "Pros Great Benefits , Great opportunities and great opportunities in sales, great to be with a Market Leader Cons No cons at this time", "rating": 5, "pros": "Great Benefits , Great opportunities and great opportunities in sales, great to be with a Market Leader", "cons": "No cons at this time", "advice": null}, {"title": "Oppertunities", "text": "Pros Good Healthy environment. Great team to Work. Infrastructure Cons Work load balancing. More of a political culture.", "rating": 5, "pros": "Good Healthy environment.", "cons": "Work load balancing. More of a political culture.", "advice": null}, {"title": "Good people, everything else not so much", "text": "Pros Co-Workers were great to work with. Pay was ok, benefits were good. Cons Management was sub-standard. Systems were old and there were too many of them that didn’t talk to each other. There was a lot of talk about investing in technology to upgrade, but it was all talk. Advice to Management Stop with the micro management, completing sheets with daily tasks listed is a complete waste of time. Get some people in management with fresh ideas, hire from outside the company instead of the same people that don’t belong in management.", "rating": 3, "pros": "Co-Workers were great to work with. Pay was ok, benefits were good.", "cons": "Management was sub-standard.", "advice": "Stop with the micro management, completing sheets with daily tasks listed is a complete waste of time. Get some people in management with fresh ideas, hire from outside the company instead of the same people that don’t belong in management."}, {"title": "Sr Business Processor", "text": "Pros Great Benefits, flexible , work from home Cons None. Excellent place to work Advice to Management Be more transparent during transition", "rating": 5, "pros": "Great Benefits, flexible , work from home", "cons": "None. Excellent place to work", "advice": "Be more transparent during transition"}, {"title": "AVP", "text": "Pros They have good pencils and the coffee is pretty good sometimes. Usually best on Friday and Monday. That is about it for now. Cons The pens aren’t as good as the pencils but the paper is pretty good so that kind of makes up for it.", "rating": 3, "pros": "They have good pencils and the coffee is pretty good sometimes. Usually best on Friday and Monday. That is about it for now.", "cons": "The pens aren’t as good as the pencils but the paper is pretty good so that kind of makes up for it.", "advice": null}, {"title": "MetLife Review", "text": "Pros Benefits, Flex-time, Management, Yearly bonus Cons Salary for workload, opportunity for growth with pay", "rating": 5, "pros": "Benefits, Flex-time, Management, Yearly bonus", "cons": "Salary for workload, opportunity for growth with pay", "advice": null}, {"title": "Clinician", "text": "Pros Great co-workers, leadership is transparent, good vision Cons Technology systems need to be upgraded", "rating": 5, "pros": "Great co-workers, leadership is transparent, good vision", "cons": "Technology systems need to be upgraded", "advice": null}, {"title": "Honest", "text": "Pros The pay is above industry average. Cons In return for the higher pay, you're treated like the property of the company and expected to be availible to well before and after any reasonable work hours. Managers and co-workers are vindictive, and back stabbing. Very mentally unhealthy work place.", "rating": 3, "pros": "The pay is above industry average.", "cons": "In return for the higher pay, you're treated like the property of the company and expected to be availible to well before and after any reasonable work hours. Managers and co-workers are vindictive, and back stabbing. Very mentally unhealthy work place.", "advice": null}, {"title": "Meh", "text": "Pros 1) Great benefits package 2) Schedule flexibility/ability to telecommute when necessary 3) Generous PTO allotment 4) (Typically) knowledgeable, down-to-earth, competent upper management Cons 1) Archaic technology - For example, we didn't migrate to Windows 7 until the summer of 2015. 2) In service, we rely a lot on a team of back-end people in India who are very difficult to communicate with and are known for being unable to do their jobs correctly. 3) Inability to get out of our own way when it comes to screwing up service issues on the back end 4) Terrible/useless onboarding process for anyone who's not a Sales Trainee - If you're lucky to get any formal training at all, it won't be even close to thorough enough. 5) For new hires, good luck getting your computer and email running in the first three weeks. 6) Sales employees are treated relatively well. Service employees are treated as disposable. 5) No financial incentives for anyone who works in service, beyond the normal annual bonus that everyone gets. (Some other carriers and GA's give service employees bonuses for client retention/renewals. MetLife does not and probably never will.) Advice to Management Invest in better technology. Please.", "rating": 3, "pros": "1) Great benefits package", "cons": "1) Archaic technology - For example, we didn't migrate to Windows 7 until the summer of 2015.", "advice": "Invest in better technology. Please."}, {"title": "Meh", "text": "Pros Pay is OK Work life balance is good. Cons Boring as hell. Job moves and layoffs scare the hell out of everyone turning them into zombies. Advice to Management Figure out what you want to do and do it. Stop with the waves and waves of location moves and layoffs. Get it done and move on.", "rating": 3, "pros": "Pay is OK", "cons": "Boring as hell.", "advice": "Figure out what you want to do and do it. Stop with the waves and waves of location moves and layoffs. Get it done and move on."}, {"title": "Great experience", "text": "Pros MetLife overall has a great culture where you will find people are easy to work with. If you are looking for career progression, opportunities are there if you seek them out. Hours are generally pretty good and there is generally good worklife balance. This is a place where you can grow professionally. Cons As with any large company, your experience will vary based on which team you are on and who your manager is. Junior or early career employees tend to be underpaid and there are many instances of people leaving to get a salary bump and later coming back. The company is quite large and has a great legacy, which means it isn't always the most nimble or open to taking strategic risks.", "rating": 5, "pros": "MetLife overall has a great culture where you will find people are easy to work with. If you are looking for career progression, opportunities are there if you seek them out. Hours are generally pretty good and there is generally good worklife balance. This is a place where you can grow professionally.", "cons": "As with any large company, your experience will vary based on which team you are on and who your manager is. Junior or early career employees tend to be underpaid and there are many instances of people leaving to get a salary bump and later coming back. The company is quite large and has a great legacy, which means it isn't always the most nimble or open to taking strategic risks.", "advice": null}, {"title": "Great company potential. Leadership needs help with structure and optimizing work flow", "text": "Pros Great benefits, nice building, sense of teams that want to work together, Cons Cafeteria food average at best, takes ten mins to walk from parking lot to your work area, training classes are a joke, team leadership is more concerned about numbers than fixing issues to facilitate issues Advice to Management Listen to your productive employees on how to be more efficient, not just the complainers who are always behind", "rating": 3, "pros": "Great benefits, nice building, sense of teams that want to work together,", "cons": "Cafeteria food average at best, takes ten mins to walk from parking lot to your work area, training classes are a joke, team leadership is more concerned about numbers than fixing issues to facilitate issues", "advice": "Listen to your productive employees on how to be more efficient, not just the complainers who are always behind"}, {"title": "Best company so far", "text": "Pros This company is family oriented, great environment, great bosses.. colleagues will help you if needed. There’s a lot to offer even if your beginner. Cons Infrastructure is not that smooth compared to my previous company, but it’s going there. Of course some employee and bosses are not the same.", "rating": 5, "pros": "This company is family oriented, great environment, great bosses.. colleagues will help you if needed. There’s a lot to offer even if your beginner.", "cons": "Infrastructure is not that smooth compared to my previous company, but it’s going there. Of course some employee and bosses are not the same.", "advice": null}, {"title": "Financial Advisor", "text": "Pros The health insurance benefits were very good. Cons The field force was managed at the local level, supervision was inconsistent and not transparent. Not a good environment for woman. Compensation scheduled changed frequently. Advice to Management It was probably a good thing to sell to Mass Mutual, no commitment to sales force", "rating": 3, "pros": "The health insurance benefits were very good.", "cons": "The field force was managed at the local level, supervision was inconsistent and not transparent. Not a good environment for woman. Compensation scheduled changed frequently.", "advice": "It was probably a good thing to sell to Mass Mutual, no commitment to sales force"}, {"title": "seles rep", "text": "Pros great work environment to work in. Cons to little work to work in", "rating": 5, "pros": "great work environment to work in.", "cons": "to little work to work in", "advice": null}, {"title": "Talked a good game, but little follow through", "text": "Pros * Lots of energetic employees * Good health benefits * Decent PTO and retirement benefits * Rapidly expanding base in Raleigh-Durham Cons * Erratic recruiting practices: I saw a BA with 20 years' experience hired in an entry-level position, and a junior BA who I worked with previously (and functioned at the junior level) hired as a team lead * Middle management is relatively unskilled * Poor communication to \"transitioned\" employees: one NY employee on my team was preparing to relocate to Raleigh for the job, but his replacement had already started and no one communicated this to him * Change is preached, but inside, it's all silos and no one is open to transformation", "rating": 3, "pros": "* Lots of energetic employees", "cons": "* Erratic recruiting practices: I saw a BA with 20 years' experience hired in an entry-level position, and a junior BA who I worked with previously (and functioned at the junior level) hired as a team lead", "advice": null}, {"title": "Do not apply unless you believe in modern day slavery!", "text": "Pros Unlimited overtime which is perfect because the amount of work you get can only be done with constant overtime Cons No woek life balance Unnecessarily metrics Management that’s only concerned with numbers Ridiculous amount of work with unrealistic expectations on completing it Advice to Management Learn the job yourself before you force unrealistic metrics on your staff! Stop hiring your friends in management positions and hire someone with experience and couth", "rating": 3, "pros": "Unlimited overtime which is perfect because the amount of work you get can only be done with constant overtime", "cons": "No woek life balance", "advice": "Learn the job yourself before you force unrealistic metrics on your staff!"}, {"title": "Great company.", "text": "Pros Amazing people to work with, good work culture, flexible hours and compensates well, promotions or lateral changes are easy to obtain. Cons company disorganization at times can lead to confusion when joining the company", "rating": 5, "pros": "Amazing people to work with, good work culture, flexible hours and compensates well, promotions or lateral changes are easy to obtain.", "cons": "company disorganization at times can lead to confusion when joining the company", "advice": null}, {"title": "Program Manager", "text": "Pros excellent work culture; IT opportunities are plenty for growth Cons dynamic and lot of change in progress", "rating": 5, "pros": "excellent work culture; IT opportunities are plenty for growth", "cons": "dynamic and lot of change in progress", "advice": null}, {"title": "Claims Manager", "text": "Pros Having a clear vision and strategy, market leader. Cons Work load is relatively high", "rating": 5, "pros": "Having a clear vision and strategy, market leader.", "cons": "Work load is relatively high", "advice": null}, {"title": "Great place to work!", "text": "Pros Strong higher level leadership and great flexibility (work from home options and family friendly). Healthcare and 401K benefits were great as well. Cons New global marketing efforts were not good - the new global marketing management executive was brought in right before I left and she changed everything. Not sure why MetLife allowed this considering the marketing efforts she implemented at her previous organization caused their sales to go down significantly during her tenure there - then went back up once she left! Lower level management needs a lot of improvement. Some bad apples with no management or leadership skills. Advice to Management Give your employees more opportunities to grow and achieve bonuses more than once a year.", "rating": 5, "pros": "Strong higher level leadership and great flexibility (work from home options and family friendly). Healthcare and 401K benefits were great as well.", "cons": "New global marketing efforts were not good - the new global marketing management executive was brought in right before I left and she changed everything. Not sure why MetLife allowed this considering the marketing efforts she implemented at her previous organization caused their sales to go down significantly during her tenure there - then went back up once she left!", "advice": "Give your employees more opportunities to grow and achieve bonuses more than once a year."}, {"title": "It is true about layoffs", "text": "Pros Overtime and there are always jobs open in Tampa. The campus is also lovely and you get to work from home Cons The gym is not free, managers can come off as rude, they lied to employees. The elevators are scary to ride in. The employee committee is awful and no one partakes in any activities Advice to Management Don’t lie to your applicants. Give everyone a fair chance and make new managers have a mentor and take management classes.", "rating": 3, "pros": "Overtime and there are always jobs open in Tampa. The campus is also lovely and you get to work from home", "cons": "The gym is not free, managers can come off as rude, they lied to employees. The elevators are scary to ride in. The employee committee is awful and no one partakes in any activities", "advice": "Don’t lie to your applicants. Give everyone a fair chance and make new managers have a mentor and take management classes."}, {"title": "Analyst", "text": "Pros Good benefits, time off, flexible work arrangements. Cons Too frequent reorganizations. Several job reductions.", "rating": 3, "pros": "Good benefits, time off, flexible work arrangements.", "cons": "Too frequent reorganizations. Several job reductions.", "advice": null}, {"title": "Sales", "text": "Pros No pros for anyone seeking a career. Maybe some downtime between calls Cons Management is horrible, they did not fulfill any of the promises made at hire", "rating": 1, "pros": "No pros for anyone seeking a career. Maybe some downtime between calls", "cons": "Management is horrible, they did not fulfill any of the promises made at hire", "advice": null}, {"title": "23 year vet.", "text": "Pros Lots of work from home flexibility. Wide array of job opportunities in different businesses and disciplines. Corporate culture improving. Very competitive pay. Competitive benefits. Huge geographic spread. Cons Highly matrixed work environment with centers of excellence for service, IT , Claims. Can create unclear if not competing accountabilities and priorities. Recent heavy emphasis on bringing in outside talent, especially from the consulting space.", "rating": 5, "pros": "Lots of work from home flexibility. Wide array of job opportunities in different businesses and disciplines. Corporate culture improving. Very competitive pay. Competitive benefits. Huge geographic spread.", "cons": "Highly matrixed work environment with centers of excellence for service, IT , Claims. Can create unclear if not competing accountabilities and priorities. Recent heavy emphasis on bringing in outside talent, especially from the consulting space.", "advice": null}, {"title": "Review", "text": "Pros Smart people with various backgrounds. Innovative changes globally. Overall, respectful colleagues. Cons With so much change and innovation, leadership and strategic direction could be improved greatly - leads to inefficiencies, lack of collaboration, and miscommunication and painfully slow delivery of initiatives.", "rating": 3, "pros": "Smart people with various backgrounds. Innovative changes globally. Overall, respectful colleagues.", "cons": "With so much change and innovation, leadership and strategic direction could be improved greatly - leads to inefficiencies, lack of collaboration, and miscommunication and painfully slow delivery of initiatives.", "advice": null}, {"title": "Investments", "text": "Pros A great experience and culture Cons typical issues associated with large bureaucracy", "rating": 5, "pros": "A great experience and culture", "cons": "typical issues associated with large bureaucracy", "advice": null}, {"title": "Worst work environment available", "text": "Pros You can work as much overtime as you want. Work is never ending. You also spend more time at work than anywhere else so you will only be spending money on delivery if you need to eat! Also, if you are good at your job & happy, they’ll force you to train others on it who can’t grasp the process and who refuse to help or be trained properly. Cons Many of the managers push for drama & a hostile work environment. Good employees are bullied mercilessly while lesser employees are promoted. Sexism, racism and homophobia are rampant here so unless your a lazy, hetero white male- you will not succeed here. The pay is mediocre and the stress is not worth ever applying here. Advice to Management Fire the managers/ directors who lost most of their full timers this past year, there’s a reason so many of us left.", "rating": 1, "pros": "You can work as much overtime as you want. Work is never ending. You also spend more time at work than anywhere else so you will only be spending money on delivery if you need to eat! Also, if you are good at your job & happy, they’ll force you to train others on it who can’t grasp the process and who refuse to help or be trained properly.", "cons": "Many of the managers push for drama & a hostile work environment. Good employees are bullied mercilessly while lesser employees are promoted. Sexism, racism and homophobia are rampant here so unless your a lazy, hetero white male- you will not succeed here. The pay is mediocre and the stress is not worth ever applying here.", "advice": "Fire the managers/ directors who lost most of their full timers this past year, there’s a reason so many of us left."}, {"title": "New business analyst", "text": "Pros The hours are good for family Cons No advancement opportunities in the area", "rating": 3, "pros": "The hours are good for family", "cons": "No advancement opportunities in the area", "advice": null}, {"title": "It used to be great", "text": "Pros Great benefits. Pay is ok. Cons Way to much change, way to much top down management. We are now filling out a spreadsheet of everything that we do all day long so that it can be tracked. Clicking a start/stop button for every task. Advice to Management Stop changing organizational direction every 12-18 months. Finish one change before you start a new one. Stop over managing every aspect of the operation. Not much upward movement if you are outside of main hubs.", "rating": 3, "pros": "Great benefits. Pay is ok.", "cons": "Way to much change, way to much top down management. We are now filling out a spreadsheet of everything that we do all day long so that it can be tracked. Clicking a start/stop button for every task.", "advice": "Stop changing organizational direction every 12-18 months. Finish one change before you start a new one. Stop over managing every aspect of the operation. Not much upward movement if you are outside of main hubs."}, {"title": "Average", "text": "Pros Good benefits and work life balance Cons Old school mentality, heavily influenced by public accounting, very bureaucratic", "rating": 3, "pros": "Good benefits and work life balance", "cons": "Old school mentality, heavily influenced by public accounting, very bureaucratic", "advice": null}, {"title": "Case specialist", "text": "Pros Benefits and work from home Cons No work life balance, management treats people poorly . Lack of communication. Advice to Management Treat people better, learn to communicate. Be honest with employees", "rating": 1, "pros": "Benefits and work from home", "cons": "No work life balance, management treats people poorly . Lack of communication.", "advice": "Treat people better, learn to communicate. Be honest with employees"}, {"title": "Decent, not great", "text": "Pros Flexible schedules. Benefits are solid Cons Low pay. Company organization is lacking. Advice to Management Get a better business model.", "rating": 5, "pros": "Flexible schedules. Benefits are solid", "cons": "Low pay. Company organization is lacking.", "advice": "Get a better business model."}, {"title": "ADJUSTER SERVICE TEAM", "text": "Pros Good benefits and PTO Cons The management shows favoritism and unless your a \"favorite\" you will not get as much opportunity. They also give you more work then you can manage in 40 hours a week, so be prepared to work a lot of OT. Advice to Management Don't have such favoritism. And don't pretend to invest in an employee and tell them you want to mentor and guide them when in reality you want dirt on other employees.", "rating": 3, "pros": "Good benefits and PTO", "cons": "The management shows favoritism and unless your a \"favorite\" you will not get as much opportunity. They also give you more work then you can manage in 40 hours a week, so be prepared to work a lot of OT.", "advice": "Don't have such favoritism. And don't pretend to invest in an employee and tell them you want to mentor and guide them when in reality you want dirt on other employees."}, {"title": "Desperately Needs Leadership", "text": "Pros Undergoing a lot of change for the future, so at least there is some hope Cons No real opportunity for development or advancement. Positions are inflated but the work does not exist. Could set your career back - don't wprk here! Advice to Management Get rid of the dead weight once and for all and allow fresh, progressive ideas to flourish. Your old ways will continue to hold you back in your competitive landscape.", "rating": 3, "pros": "Undergoing a lot of change for the future, so at least there is some hope", "cons": "No real opportunity for development or advancement. Positions are inflated but the work does not exist. Could set your career back - don't wprk here!", "advice": "Get rid of the dead weight once and for all and allow fresh, progressive ideas to flourish. Your old ways will continue to hold you back in your competitive landscape."}, {"title": "Financial Services Rep.", "text": "Pros Flexibility, Lots of room for growth, Positive environment, Decent benefits. Cons I just did not enjoy the sales aspect of the job. Lots of cold calling.", "rating": 3, "pros": "Flexibility, Lots of room for growth, Positive environment, Decent benefits.", "cons": "I just did not enjoy the sales aspect of the job. Lots of cold calling.", "advice": null}, {"title": "Great Place to Work", "text": "Pros 1. Competitive salary 2. Great Benefits Package 3. Great co-workers Cons Due to the size of the company, it takes a bit of time for decisions to be made. Advice to Management Continue to streamline decision making", "rating": 5, "pros": "1. Competitive salary", "cons": "Due to the size of the company, it takes a bit of time for decisions to be made.", "advice": "Continue to streamline decision making"}, {"title": "Client Service Consultant", "text": "Pros Great benefits and decent pay Cons Zero structure. In order to do your job, you would've had to be there for years to understand the company structure. Extremely unorganized.", "rating": 1, "pros": "Great benefits and decent pay", "cons": "Zero structure. In order to do your job, you would've had to be there for years to understand the company structure. Extremely unorganized.", "advice": null}, {"title": "MetLife is changing", "text": "Pros Flex time, cafeteria, vacation, benefits, gym Cons Outsourcing, cost cutting, some managers don’t manage", "rating": 5, "pros": "Flex time, cafeteria, vacation, benefits, gym", "cons": "Outsourcing, cost cutting, some managers don’t manage", "advice": null}, {"title": "Sr. LTD Claims Specialist", "text": "Pros Very little pros to speak of. They pay well and that's about it. You decide if it's worth selling your soul. Cons No talent development No understanding from management on really understanding the day-to-day requirements of the job. Work-life balance is a joke. Advice to Management Stop looking for ways to push hard working employees out the door. Start working with them to understand the day-to-day struggles that go along with the job. Give your claims specials REASONABLE case loads. Staff appropriately. Develope talent.", "rating": 3, "pros": "Very little pros to speak of. They pay well and that's about it. You decide if it's worth selling your soul.", "cons": "No talent development", "advice": "Stop looking for ways to push hard working employees out the door. Start working with them to understand the day-to-day struggles that go along with the job. Give your claims specials REASONABLE case loads. Staff appropriately. Develope talent."}, {"title": "Executive Administrative Assistant", "text": "Pros A more diverse workplace. More opportunity for advancement. Better pay and benefits. Cons More people working on each project. Advice to Management Open minded.", "rating": 3, "pros": "A more diverse workplace. More opportunity for advancement. Better pay and benefits.", "cons": "More people working on each project.", "advice": "Open minded."}, {"title": "Great company learned a lot.", "text": "Pros The people here are very friendly and helpful. Benefits are great and good work life balance. Enjoyed the opportunity to learn new things. Cons Constant changes and unorganized at times. Daily huddled did not always bring value. The company still has a ways to go to be able to meet the needs of the digital consumer. Advice to Management You need to create a better environment of openness and not just have yes men.", "rating": 5, "pros": "The people here are very friendly and helpful. Benefits are great and good work life balance. Enjoyed the opportunity to learn new things.", "cons": "Constant changes and unorganized at times. Daily huddled did not always bring value. The company still has a ways to go to be able to meet the needs of the digital consumer.", "advice": "You need to create a better environment of openness and not just have yes men."}, {"title": "Disability team leader x 20 years.", "text": "Pros Initially was a great place to work and employees were empowered. ome may work at home partial days after a while. Cons Poor training since many who had experience either left due to the negative micromanaging environment, and hiring of management that have no experience other then how to be bossy. Unable to assist their team with general or detailed technical questions. Constant changes. Advice to Management Retain talent. Make sure new case managers have better training and resources. Don't hire upper management with no experience other than being a relative. If new processes don't work look to tweek the process rather than the case managers that haven't been trained well on it. Be transparent about layoffs. Have more skip level meetings. When telling employees they are considered professionals , part of the leadership team, and salaried-then don't micromanage them and treat them like children.", "rating": 1, "pros": "Initially was a great place to work and employees were empowered. ome may work at home partial days after a while.", "cons": "Poor training since many who had experience either left due to the negative micromanaging environment, and hiring of management that have no experience other then how to be bossy. Unable to assist their team with general or detailed technical questions. Constant changes.", "advice": "Retain talent. Make sure new case managers have better training and resources. Don't hire upper management with no experience other than being a relative. If new processes don't work look to tweek the process rather than the case managers that haven't been trained well on it. Be transparent about layoffs. Have more skip level meetings. When telling employees they are considered professionals , part of the leadership team, and salaried-then don't micromanage them and treat them like children."}, {"title": "Senior Support assistant", "text": "Pros Benefits, spacing, flexible hours, friendly environment. Cons Adapting to many changes in company structure.", "rating": 5, "pros": "Benefits, spacing, flexible hours, friendly environment.", "cons": "Adapting to many changes in company structure.", "advice": null}, {"title": "Sales Supervisor", "text": "Pros clean atmosphere, want to do well Cons you'll work a free 20hrs per week extra", "rating": 3, "pros": "clean atmosphere, want to do well", "cons": "you'll work a free 20hrs per week extra", "advice": null}, {"title": "Disability", "text": "Pros Pay was fair. Facilities are nice. Cons No work process documents. Discretion and independent thinking are discouraged. Frequent changes in process, chasing the next best [managerial] thing. Advice to Management Stop trying to mimic your competitors. Trust and care for your employees.", "rating": 3, "pros": "Pay was fair.", "cons": "No work process documents.", "advice": "Stop trying to mimic your competitors. Trust and care for your employees."}, {"title": "Sr. Administrative Consultant", "text": "Pros Great team, talent development, incentives are amazing. People are their best asset! Cons Adjusters long hours that may conflict with work/life balance but that is being addressed. Performance reviews and compensation need improvement especially for non-adjusters. Advice to Management Keep listening to the employees and customers. Improve IT assistance so as to positively impact employee production and morale. Don't forget the support side because these associates work impacts results to other departments.", "rating": 5, "pros": "Great team, talent development, incentives are amazing. People are their best asset!", "cons": "Adjusters long hours that may conflict with work/life balance but that is being addressed.", "advice": "Keep listening to the employees and customers. Improve IT assistance so as to positively impact employee production and morale."}, {"title": "fantasitic work place", "text": "Pros amazing and effecting work envirement Cons I found no downside to working at MetLife", "rating": 5, "pros": "amazing and effecting work envirement", "cons": "I found no downside to working at MetLife", "advice": null}, {"title": "sr analyst", "text": "Pros Stable company, very large company so potential (theoretically) to move and gain different experiences. Cons Very slow progress. Too much favoritism on promotions. Very siloed organizations. Extremely boring and repetitive tasks", "rating": 3, "pros": "Stable company, very large company so potential (theoretically) to move and gain different experiences.", "cons": "Very slow progress. Too much favoritism on promotions. Very siloed organizations. Extremely boring and repetitive tasks", "advice": null}, {"title": "Head of Sales EB", "text": "Pros Results Oriented, Dynamic, Diverse. Reputable. Strong Financials. Global Presence. Cons Size causes some issues internally at local levels", "rating": 5, "pros": "Results Oriented, Dynamic, Diverse. Reputable. Strong Financials. Global Presence.", "cons": "Size causes some issues internally at local levels", "advice": null}, {"title": "What a waste of Life at this Company !!!", "text": "Pros Got to write a review Cons Highly Bureaucratic environment Paper pushers - always some policy is enforced..looks like a prison Lame PTO policy. You literally cannot afford to fall sick (you earn 1 hr for a week). Office environment is highly noisy (I recorded decibels on a average day and it was around 65-68 db) - so imagine constantly monitored Weekly recurring one on one's, which is used for statuses on top of the status meetings - LMAO Unhappy environment - generally people are not willing to talk to each other and be friendly they are always seem to be lost and feel irritated Management wanted a modern open office (so that they can look over shoulders - ha ahaha) and they say it is strategy to maximizing sqft . They are literally scamming NC govt, they said they are creating jobs, but they moved people from other branches and asked them to reapply by creating positions (which NC residents can be entitled to but they are denied , so incase you were wondering why they did not respond to your application ) - just to account for number count for the NC govt - LMAO Zero work life balance, if you are going to be sick ..please plan on a PTO and let your manager know - ROFTL & LMAO Another lame policy - If you are going to have a dr appointment , please schedule after work hours or get a PTO Now you decide is this the place you want to work for rest of your life ? I pitty those people who don't have a choice. Advice to Management I don't care to write a review..but this I have taken to heart and wanted to bring this up so others will benefit. Management don't care so no Advice to them.", "rating": 1, "pros": "Got to write a review", "cons": "Highly Bureaucratic environment", "advice": "I don't care to write a review..but this I have taken to heart and wanted to bring this up so others will benefit. Management don't care so no Advice to them."}, {"title": "Sales", "text": "Pros Good benefits, work at home Cons Bad schedules, bonus is very difficult to make", "rating": 3, "pros": "Good benefits, work at home", "cons": "Bad schedules, bonus is very difficult to make", "advice": null}, {"title": "Changing company. Cost cutting before quality", "text": "Pros Broad variety of group insurance employer paid (core) and worksite insurance products. Generally has represented more employment opportunity then many insurers over the years. Large employer for medium to large account services work Cons Not as good for a long term career as it once was. Shifting many operational and project management positions to lower cost locales. Seen many talented and committed employees be pushed out for cost cutting, short term bottom line thinking to please Wall St. analysts. Advice to Management Remember the business is about trust and integrity, two words that MetLife has built itself on.", "rating": 3, "pros": "Broad variety of group insurance employer paid (core) and worksite insurance products. Generally has represented more employment opportunity then many insurers over the years. Large employer for medium to large account services work", "cons": "Not as good for a long term career as it once was. Shifting many operational and project management positions to lower cost locales. Seen many talented and committed employees be pushed out for cost cutting, short term bottom line thinking to please Wall St. analysts.", "advice": "Remember the business is about trust and integrity, two words that MetLife has built itself on."}, {"title": "Field service consultant", "text": "Pros A Good benefits package with multiple offerings Cons No work/life balance. Constantly multitasking and not being able to be proactive in your work", "rating": 3, "pros": "A Good benefits package with multiple offerings", "cons": "No work/life balance. Constantly multitasking and not being able to be proactive in your work", "advice": null}, {"title": "Business Systems Analyst", "text": "Pros I do not currently have any pros to add for MetLife Cons Poor work life balance. Management is indecisive in what direction they are heading. No loyalty to employees and expect employees to be loyal. Excessive amount of contractors vs fte. Culture is bad since selling off the retail business. Advice to Management Select managers that have previous experience managing", "rating": 1, "pros": "I do not currently have any pros to add for MetLife", "cons": "Poor work life balance. Management is indecisive in what direction they are heading. No loyalty to employees and expect employees to be loyal. Excessive amount of contractors vs fte. Culture is bad since selling off the retail business.", "advice": "Select managers that have previous experience managing"}, {"title": "Not worth it", "text": "Pros Breaks and flex time, able to take PTO whenever you need too Cons Mismanaged, unorganized, constantly working and my boss was rude and always pushing us but not helping. Making things more difficult than they had to be Advice to Management Get rid of the UL's that constantly have complains about them", "rating": 3, "pros": "Breaks and flex time, able to take PTO whenever you need too", "cons": "Mismanaged, unorganized, constantly working and my boss was rude and always pushing us but not helping. Making things more difficult than they had to be", "advice": "Get rid of the UL's that constantly have complains about them"}, {"title": "Field Support Specialist", "text": "Pros Steady, secure employment with good benefits Cons Not much room for Advancement", "rating": 5, "pros": "Steady, secure employment with good benefits", "cons": "Not much room for Advancement", "advice": null}, {"title": "Disappointed", "text": "Pros MetLife has good benefits and good pay Cons Not a professional atmosphere, low moral, lots of negativity and cursing in the office, leaders have never been in leadership training or development because it's not available to them, there is not much training unless you get lucky to get to go through the entire 6 week program but if a sudden project comes up they will pull you out of training early and \"throw you to the wolves\" and expect you to be just as good as those who went through complete training. Advice to Management Add more training that is mandatory to complete and also leadership development program, be more encouraging instead of discouraging to employees, and when senior management or CEO comes, introduce them to teams.", "rating": 1, "pros": "MetLife has good benefits and good pay", "cons": "Not a professional atmosphere, low moral, lots of negativity and cursing in the office, leaders have never been in leadership training or development because it's not available to them, there is not much training unless you get lucky to get to go through the entire 6 week program but if a sudden project comes up they will pull you out of training early and \"throw you to the wolves\" and expect you to be just as good as those who went through complete training.", "advice": "Add more training that is mandatory to complete and also leadership development program, be more encouraging instead of discouraging to employees, and when senior management or CEO comes, introduce them to teams."}, {"title": "Financial Advisor", "text": "Pros They were good at Insurance and didn't force proprietary sales. Cons Poor service on investment clients", "rating": 3, "pros": "They were good at Insurance and didn't force proprietary sales.", "cons": "Poor service on investment clients", "advice": null}, {"title": "No Ethical bones please", "text": "Pros great place to work for white collar criminals Cons If you are a Compliance Officer or have worked in the capacity of an auditor, accountant or served in any role that involves having Ethics, this is NOT the place for you. They turn a blind eye towards rules and regulations including upper level management. Advice to Management please report yourself to the nearest police station for fraud, including you guys sitting in Atlanta", "rating": 1, "pros": "great place to work for white collar criminals", "cons": "If you are a Compliance Officer or have worked in the capacity of an auditor, accountant or served in any role that involves having Ethics, this is NOT the place for you. They turn a blind eye towards rules and regulations including upper level management.", "advice": "please report yourself to the nearest police station for fraud, including you guys sitting in Atlanta"}, {"title": "Great Place to Work", "text": "Pros A great place to work with excellent benefits and work/life balance. Cons Some people are a little too comfortable in their positions.", "rating": 5, "pros": "A great place to work with excellent benefits and work/life balance.", "cons": "Some people are a little too comfortable in their positions.", "advice": null}, {"title": "Great place to work", "text": "Pros fantastic campus, lots of activities, good food service. Enjoy the open atmosphere and friendly people Cons you need to know how to navigate in a big company. Advice to Management spend more time with your employees", "rating": 5, "pros": "fantastic campus, lots of activities, good food service. Enjoy the open atmosphere and friendly people", "cons": "you need to know how to navigate in a big company.", "advice": "spend more time with your employees"}, {"title": "Good Company to Work For", "text": "Pros Flexible schedule, great benefits, and relaxed atmosphere. Cons Work load can be difficult to manage at times.", "rating": 5, "pros": "Flexible schedule, great benefits, and relaxed atmosphere.", "cons": "Work load can be difficult to manage at times.", "advice": null}, {"title": "Evolving", "text": "Pros Good Work life balance . Cons Recent split up of retail business unit causing confusion & worry.", "rating": 3, "pros": "Good Work life balance .", "cons": "Recent split up of retail business unit causing confusion & worry.", "advice": null}, {"title": "Liability Adjuster", "text": "Pros It's a job but don't expect much else Cons Where do I start! Managers do not care about the employees unless you are a butt kisser. They are not as diverse as they pretend to be and for those minorities that do come on board, they don't stay very long. They treat employees like children. Their systems are outdated. They are not innovative at all. Not open to new and better ways of doing things even when the VP recognizes outstanding performance and skills. In fact, it's frowned upon because they did not think about it first. Many managers are retirement age but hold on to those jobs for power and to have a life and are set in the old ways of doing things which is very unproductive. You will work long hours because the network is slow and many of the computers are old and freeze a lot. There are a lot of meetings also that take u away from your claims. Advice to Management Support your staff Be open to new ideas Stop showing favoritism Treat adults like adults.", "rating": 1, "pros": "It's a job but don't expect much else", "cons": "Where do I start! Managers do not care about the employees unless you are a butt kisser. They are not as diverse as they pretend to be and for those minorities that do come on board, they don't stay very long. They treat employees like children. Their systems are outdated. They are not innovative at all. Not open to new and better ways of doing things even when the VP recognizes outstanding performance and skills. In fact, it's frowned upon because they did not think about it first. Many managers are retirement age but hold on to those jobs for power and to have a life and are set in the old ways of doing things which is very unproductive. You will work long hours because the network is slow and many of the computers are old and freeze a lot.", "advice": "Support your staff"}, {"title": "Micromanaging at it's best", "text": "Pros Benefits were great and pay was ok Cons Extremely Micromanaging and short staffed. They kept letting people go and dispersing the work among the employees and just never replaced anyone. Advice to Management Stop treating employees like they are in a kindergarten class", "rating": 1, "pros": "Benefits were great and pay was ok", "cons": "Extremely Micromanaging and short staffed. They kept letting people go and dispersing the work among the employees and just never replaced anyone.", "advice": "Stop treating employees like they are in a kindergarten class"}, {"title": "CSR", "text": "Pros Bonuses and raises. Benefits. New office building Cons Poor work life balance and lack of availabilty for time off.", "rating": 1, "pros": "Bonuses and raises. Benefits. New office building", "cons": "Poor work life balance and lack of availabilty for time off.", "advice": null}, {"title": "Run! Hold out for something better, so you don't have to butt-kiss to get ahead", "text": "Pros Some people are nice, others just need to retire for lack of computer skills, or get fired for bad reputation, but somehow keep their job Cons Management based on tenure, instead of actual skill. No career mobility/help developing career (even though the website may make it appear so)", "rating": 3, "pros": "Some people are nice, others just need to retire for lack of computer skills, or get fired for bad reputation, but somehow keep their job", "cons": "Management based on tenure, instead of actual skill. No career mobility/help developing career (even though the website may make it appear so)", "advice": null}, {"title": "Great place to work", "text": "Pros Smart, dedicated colleagues. Beautiful workspace. Healthy overall environment. Come here to learn how to solve problems. Cons It's a huge company, so it has its fair share of red tape.", "rating": 5, "pros": "Smart, dedicated colleagues. Beautiful workspace. Healthy overall environment. Come here to learn how to solve problems.", "cons": "It's a huge company, so it has its fair share of red tape.", "advice": null}, {"title": "Bureaucratic", "text": "Pros Hard to get fired and benefits are pretty good. Some of the people are good to work with. I wouldn't call it a discriminatory, sexist, or racist place to work though it is still somewhat homogenous (that is the tech industry though) Cons The top downside that I see at MetLife is that it is extremely difficult to make an impact. For a lot of applications the tech currency has reached a point where it is kind of silly to try to an improve it rather than replace it. As a software developer that is kind of demoralizing. I blame that on the heavy reliance on vendors, the inability to maintain FTEs that plan on staying long enough to have ownership in what they are building, and the way that projects are funded. Employees are also decentivized by the fact that a lot of processes that are built to help them are extremely inefficient and unknown to them. It feels like too much of the time, the solution to a problem is sending an email to a person that you have worked with in the past and calling in a favor. From a career advancement standpoint the most talented people might advance, but their seems to be a barrier in how far they can make it without switching companies. The norm if you are an entry level employee is that you join the company, advance 1 promotion in around 3-5 years, and then leave the company. Some of the other posts mention that employees early in their career are basically stuck, but that is true for more experienced as well. The HR policies regarding nonexempt workers and how they are enforced is kind of ridiculous. While most people work a 9-5 schedule, and qualifying for overtime is a non-issue, a significant number of managers are unaware or pretend to be unaware of the policy. My impression is that applying for overtime is a promotion killer (even though advancement isn't particularly common) and it looks bad on a manager's metrics. While it is also true that a lot of employees work less than the eight hours, if MetLife doesn't plan on following their employee contracts they should change the terms. Advice to Management The tech at MetLife will never be bleeding edge, cutting edge, or even up to date in comparison to the tech industry as a whole. That might not be the goal or even beneficial for an insurance company, but it would be beneficial if it went a little more in that direction. If you want happy software developers though 1. Make the internal processes easier 2. Give opportunity to work on something new and career building and force new and old employees to do it (I know that a lot of the upper management say that their is plenty of opportunity if people ask for it, but a lot of people don't ask for it and just leave the company. ) 3. Change the way projects are funded and examine why they are over budget or under budget for certain applications 4. Change the way that promotions and raises are handled. Instead of thinking about it terms of a bell curve, think about it in terms of how much you want to keep a certain employee. It seems like no low level employees understand how they are evaluated. 5. When you use vendors always consider the incentive for them to make a difficult to maintain solution.", "rating": 1, "pros": "Hard to get fired and benefits are pretty good. Some of the people are good to work with. I wouldn't call it a discriminatory, sexist, or racist place to work though it is still somewhat homogenous (that is the tech industry though)", "cons": "The top downside that I see at MetLife is that it is extremely difficult to make an impact. For a lot of applications the tech currency has reached a point where it is kind of silly to try to an improve it rather than replace it. As a software developer that is kind of demoralizing. I blame that on the heavy reliance on vendors, the inability to maintain FTEs that plan on staying long enough to have ownership in what they are building, and the way that projects are funded. Employees are also decentivized by the fact that a lot of processes that are built to help them are extremely inefficient and unknown to them. It feels like too much of the time, the solution to a problem is sending an email to a person that you have worked with in the past and calling in a favor.", "advice": "The tech at MetLife will never be bleeding edge, cutting edge, or even up to date in comparison to the tech industry as a whole. That might not be the goal or even beneficial for an insurance company, but it would be beneficial if it went a little more in that direction."}, {"title": "Turbulent", "text": "Pros The pay was great. Benefits were great. The hours were awesome too. Cons Kinda hostile environment. People were promoted according to who they were friends with. Alot of family working with/for family. Advice to Management Get new management", "rating": 3, "pros": "The pay was great. Benefits were great. The hours were awesome too.", "cons": "Kinda hostile environment. People were promoted according to who they were friends with. Alot of family working with/for family.", "advice": "Get new management"}, {"title": "Prepare for no work/life balance", "text": "Pros Great co-workers, nice campus with amenities, good pay but not competitive. Cons The main con was the oppressive workload and you never got to unplug from work - Management sent emails/texts night and day, weekends, and even when on PTO (aka Pretend Time Off here) with responses/actions expected right away. With few exceptions, the 'worker bee' workload is suffocating and unreasonable. Advice to Management Recognize the fact that employees need a life outside of MetLife. Pay attention when your staff comes to you with work/life balance challenges. Then fight for them when needed to address the issues before they have to leave the company just to survive. Management apparently has no idea how many people are burnt out and want to leave this company. I've never before worked somewhere that has so many people choosing to leave voluntarily for this reason. They may not voice that fact in their exit interviews but that is certainly the reasons talked about in the break rooms.", "rating": 3, "pros": "Great co-workers, nice campus with amenities, good pay but not competitive.", "cons": "The main con was the oppressive workload and you never got to unplug from work - Management sent emails/texts night and day, weekends, and even when on PTO (aka Pretend Time Off here) with responses/actions expected right away. With few exceptions, the 'worker bee' workload is suffocating and unreasonable.", "advice": "Recognize the fact that employees need a life outside of MetLife. Pay attention when your staff comes to you with work/life balance challenges. Then fight for them when needed to address the issues before they have to leave the company just to survive. Management apparently has no idea how many people are burnt out and want to leave this company. I've never before worked somewhere that has so many people choosing to leave voluntarily for this reason. They may not voice that fact in their exit interviews but that is certainly the reasons talked about in the break rooms."}, {"title": "Not Recommended", "text": "Pros Apparently, Metlife is a great place to work, as long as you're not in the GTO in Cary. Coworkers are great. Cons Too many to name, but here are a few for starters: Bait and switch upon hire Management that does not support you Culture of blame Not enough communication about your job - you learn as you go to your detriment Management does not listen, although there is a great pretense at doing so with surveys that don't reflect real concerns FTEs all but disappeared. Great for contractors and visa holders, however If you're not strictly Tech, (marketing, analyst, PM) look somewhere else because you will not be valued Advice to Management Learn what loyalty means - it swings both ways. Look out for your people and learn how to fight for them. Stop knocking people down at every opportunity because you don't want to take responsibility for your bad management.", "rating": 1, "pros": "Apparently, Metlife is a great place to work, as long as you're not in the GTO in Cary. Coworkers are great.", "cons": "Too many to name, but here are a few for starters:", "advice": "Learn what loyalty means - it swings both ways. Look out for your people and learn how to fight for them. Stop knocking people down at every opportunity because you don't want to take responsibility for your bad management."}, {"title": "Human Resources Professional", "text": "Pros Great Benefits which allowed me to provide for my family. Cons Leadership turnover created some fear of stability.", "rating": 5, "pros": "Great Benefits which allowed me to provide for my family.", "cons": "Leadership turnover created some fear of stability.", "advice": null}, {"title": "Operations Manager", "text": "Pros Great culture and atmosphere. Considerate of work, life balance. Cons Lack of concrete direction over the past two years, ultiamtely affected a large number of employees. Advice to Management Better employee development through coaching from upper management.", "rating": 3, "pros": "Great culture and atmosphere. Considerate of work, life balance.", "cons": "Lack of concrete direction over the past two years, ultiamtely affected a large number of employees.", "advice": "Better employee development through coaching from upper management."}, {"title": "Fp", "text": "Pros Good benefits. Advancement obtainable Cons Retail sales is gone department is gone Advice to Management Always look for addl trainings", "rating": 3, "pros": "Good benefits. Advancement obtainable", "cons": "Retail sales is gone department is gone", "advice": "Always look for addl trainings"}, {"title": "Production Management Senior Lead", "text": "Pros A courteous working atmosphere. Great work/life balance. Cons An unfortunate burning desire to save money on corporate real estate with total disregard for losing talent.", "rating": 5, "pros": "A courteous working atmosphere. Great work/life balance.", "cons": "An unfortunate burning desire to save money on corporate real estate with total disregard for losing talent.", "advice": null}, {"title": "Director", "text": "Pros Collaborative environment, flexible work schedule when needed, plenty of managers who care about people and career growth, lots of learning opportunities, advancement Cons Constant strategy changes, unclear goals, reporting structure changes often, too many leader/VP roles who don't roll up their sleeves and not enough worker bees to get the job done. Advice to Management Reduce some ineffective or negative leaders in the VP roles; keep the great people leaders and process managers and give teams the resources and support needed to implement change and reach specific goals.", "rating": 5, "pros": "Collaborative environment, flexible work schedule when needed, plenty of managers who care about people and career growth, lots of learning opportunities, advancement", "cons": "Constant strategy changes, unclear goals, reporting structure changes often, too many leader/VP roles who don't roll up their sleeves and not enough worker bees to get the job done.", "advice": "Reduce some ineffective or negative leaders in the VP roles; keep the great people leaders and process managers and give teams the resources and support needed to implement change and reach specific goals."}, {"title": "Tech Liaison", "text": "Pros Great Benefits, very friendly and helpful co-workers. The team environment was probably the best part about the job. Generous amount of PTO Cons Mandatory overtime, low wages, management not really connected with upper level executives so they were unable to request additional employees when the department was in need of it Advice to Management Develop a better relationship with executives. Realize that the workload is too much for the current employees to handle. Hire additional employees", "rating": 5, "pros": "Great Benefits, very friendly and helpful co-workers. The team environment was probably the best part about the job. Generous amount of PTO", "cons": "Mandatory overtime, low wages, management not really connected with upper level executives so they were unable to request additional employees when the department was in need of it", "advice": "Develop a better relationship with executives. Realize that the workload is too much for the current employees to handle. Hire additional employees"}, {"title": "TAM Coordinator", "text": "Pros Newer work stations and easy commute. Cons Poor management, lack of career opportunities.", "rating": 3, "pros": "Newer work stations and easy commute.", "cons": "Poor management, lack of career opportunities.", "advice": null}, {"title": "Collector III", "text": "Pros The company was family oriented and cared for the employees Cons Better strategies from management", "rating": 5, "pros": "The company was family oriented and cared for the employees", "cons": "Better strategies from management", "advice": null}, {"title": "Great company with good intentions, but at times lacks an external perspective.", "text": "Pros Very supportive employer for today's diverse workforce. Cons A very big company and sometimes that can be a disadvantage. Advice to Management Look to seek more external talent to provide different and new perspectives and bring new ideas that can make us better.", "rating": 5, "pros": "Very supportive employer for today's diverse workforce.", "cons": "A very big company and sometimes that can be a disadvantage.", "advice": "Look to seek more external talent to provide different and new perspectives and bring new ideas that can make us better."}, {"title": "Work", "text": "Pros Very friendly and supportive environment. Cons There are no Cons here. Advice to Management keep up the good work", "rating": 5, "pros": "Very friendly and supportive environment.", "cons": "There are no Cons here.", "advice": "keep up the good work"}, {"title": "Inbound Call Center Sales-MetLife Auto & Home", "text": "Pros Work hard/play hard. Great benefits and compensation when you can obtain their metrics. Best co-workers ever. Immediate managers very easy to work for/get along with. Phone is ringing all day and night with leads. Cons 1.\"Continuous improvement\" culture leads to unrealistic expectations from even the top sales employees. 2.Our current compensation model penalizes salespeople if too many others quit in the prior month(in the form of increased quota). 3.Incentive system needs to be refocused. Managers push premium goals.. but even if you excel at your premium goal, they only pay you based on number of new accounts. (aka, $1million in sales pays you nothing if you don't bring in the required number of vehicles insured) Advice to Management Employees understand the industry is changing... but don't forget we are still people, not machines.", "rating": 5, "pros": "Work hard/play hard. Great benefits and compensation when you can obtain their metrics. Best co-workers ever. Immediate managers very easy to work for/get along with. Phone is ringing all day and night with leads.", "cons": "1.\"Continuous improvement\" culture leads to unrealistic expectations from even the top sales employees.", "advice": "Employees understand the industry is changing... but don't forget we are still people, not machines."}, {"title": "Teacher", "text": "Pros Pay is amongst highest in nation Cons Officials can not get out of their own way", "rating": 3, "pros": "Pay is amongst highest in nation", "cons": "Officials can not get out of their own way", "advice": null}, {"title": "FML Claims Processor - Total Absence Management (TAM)", "text": "Pros Great wages and yearly bonus if you meet your metrics Cons working with older systems needs an upgrade in order to keep up with work requirements. Work caseloads are way unrealistic in order to give the excellence in customer service. Advice to Management Management needs communications and clear path to stay on budget in order to prevent further job loss", "rating": 5, "pros": "Great wages and yearly bonus if you meet your metrics", "cons": "working with older systems needs an upgrade in order to keep up with work requirements. Work caseloads are way unrealistic in order to give the excellence in customer service.", "advice": "Management needs communications and clear path to stay on budget in order to prevent further job loss"}, {"title": "Sales Director", "text": "Pros I spent 24 years there Cons Politics were rampant and there were some fairly tyrannical people in leadership Advice to Management There used to be high standards for leadership but the last 7-8 years it is like you don't care.", "rating": 1, "pros": "I spent 24 years there", "cons": "Politics were rampant and there were some fairly tyrannical people in leadership", "advice": "There used to be high standards for leadership but the last 7-8 years it is like you don't care."}, {"title": "Support Assistant", "text": "Pros Good benefits, 401k, possibility of yearly bonuses. Flexible with schedule and days off as well. Cons So much work that its often hard for management to connect with the team.", "rating": 5, "pros": "Good benefits, 401k, possibility of yearly bonuses. Flexible with schedule and days off as well.", "cons": "So much work that its often hard for management to connect with the team.", "advice": null}, {"title": "Solid company that allows some flexible work arrangements.", "text": "Pros Flextime, good benefits, and some telecommuting allowed. Most colleagues work as a team. There is a wide bandwidth for lateral moves to experience different roles. Cons Employee capacity issues, at times feel unsupported and unappreciated. Pay does not stay in line with industry and bonus is depended on Sales which is a different department.", "rating": 3, "pros": "Flextime, good benefits, and some telecommuting allowed. Most colleagues work as a team. There is a wide bandwidth for lateral moves to experience different roles.", "cons": "Employee capacity issues, at times feel unsupported and unappreciated. Pay does not stay in line with industry and bonus is depended on Sales which is a different department.", "advice": null}, {"title": "Starting my career here", "text": "Pros As someone who came to Met right of school and falls into the millennial demo - Met has been a great place to work. My management team, my director all the up through my AVP and VP are fantastic. Very responsive to questions and concerns. The benefits are really good - 15 PTO days a year and a good 401k match. I have the ability to work from home when ever I want to. I feel like I make a difference to our customers. Cons Work can get really busy and a lot of late hours are common. We have projects that come up and it's a matter of drop everything and spend what seems like forever working on it and it delays other work. Advice to Management Be open to ideas from younger people. We know what we want to do.", "rating": 5, "pros": "As someone who came to Met right of school and falls into the millennial demo - Met has been a great place to work.", "cons": "Work can get really busy and a lot of late hours are common.", "advice": "Be open to ideas from younger people. We know what we want to do."}, {"title": "Nurse Clinician", "text": "Pros Work from home availability helps home life. Cons As a nurse the salary is not really competitive.", "rating": 3, "pros": "Work from home availability helps home life.", "cons": "As a nurse the salary is not really competitive.", "advice": null}, {"title": "Good Company", "text": "Pros Overall, this is a solid company with a good strategy Cons Extremely political environment. It's who you know that matters.", "rating": 5, "pros": "Overall, this is a solid company with a good strategy", "cons": "Extremely political environment. It's who you know that matters.", "advice": null}, {"title": "Sr Process Improvement Consultant", "text": "Pros Great work environment, good hours, and decent benefits Cons Company is going through constant internal restructuring which leads to relocation and downsizing. Not much career growth.", "rating": 3, "pros": "Great work environment, good hours, and decent benefits", "cons": "Company is going through constant internal restructuring which leads to relocation and downsizing. Not much career growth.", "advice": null}, {"title": "Good, solid company.", "text": "Pros Solid benefits, solid company that has a long standing history Cons Work life balance can be challenging sometimes due to workloads", "rating": 3, "pros": "Solid benefits, solid company that has a long standing history", "cons": "Work life balance can be challenging sometimes due to workloads", "advice": null}, {"title": "Reliable employer for long-term employment", "text": "Pros The company is a giant in the insurance industry and is extremely secure as long as your job isn't off shored to India. They have supportive teams that are friendly and easy to work with. Each department has their own fun events to foster team work. They also supported my continuing education through tuition reimbursement. I am forever grateful for that opportunity and the opportunity to learn new systems and programs. Work Life balance was decent and flexible, at least in my department. The people were always nice. I still miss many of the people. Very low drama and relaxed compared to other places. Cons Once I was done with my degree, I couldn't get promoted or transfer to another department for more pay because it wasn't financed based. It didn't matter that I knew the systems and processes. The internal recruitment team looks for keywords and specific degrees instead of considering the talent and capability to learn. So, in order to make more money, I had to leave. It was very disappointing that I could not find a higher position within the company. The career path is difficult at MetLife. Some people stay in their role for 20 to 30 years. Compensation is on the low side, but the benefits do help offset it. When I asked for a raise once, I was told I was at the 105 percentile of my position range. I call BS. Management can be stingy on helping you out, so take advantage of thing like tuition reimbursement if your manager approves it. Advice to Management Try to keep your talented learners regardless of their major. I'm now making almost three times my old salary am pursuing my MBA. Get rid of the rating system and the forced curve. I love the new logo and re-brand. This was overdue, and I'm glad to see it has happened.", "rating": 5, "pros": "The company is a giant in the insurance industry and is extremely secure as long as your job isn't off shored to India. They have supportive teams that are friendly and easy to work with. Each department has their own fun events to foster team work. They also supported my continuing education through tuition reimbursement. I am forever grateful for that opportunity and the opportunity to learn new systems and programs. Work Life balance was decent and flexible, at least in my department. The people were always nice. I still miss many of the people. Very low drama and relaxed compared to other places.", "cons": "Once I was done with my degree, I couldn't get promoted or transfer to another department for more pay because it wasn't financed based. It didn't matter that I knew the systems and processes. The internal recruitment team looks for keywords and specific degrees instead of considering the talent and capability to learn. So, in order to make more money, I had to leave. It was very disappointing that I could not find a higher position within the company. The career path is difficult at MetLife. Some people stay in their role for 20 to 30 years. Compensation is on the low side, but the benefits do help offset it. When I asked for a raise once, I was told I was at the 105 percentile of my position range. I call BS. Management can be stingy on helping you out, so take advantage of thing like tuition reimbursement if your manager approves it.", "advice": "Try to keep your talented learners regardless of their major. I'm now making almost three times my old salary am pursuing my MBA."}, {"title": "Discouraged", "text": "Pros Able to work remotely. Vacation days and sick days combined as PTO days, which is a plus. Business casual, more on the casual side. Most co-workers friendly. Cons Management doesn't care. Some employees work hard. Some barely work but everyone is treated the same way. No possibility of promotion. Salary way below standard of living. Advice to Management Pay attention to your employees and reward those who work hard and get rid of those who come to work and snore at their desk", "rating": 3, "pros": "Able to work remotely. Vacation days and sick days combined as PTO days, which is a plus. Business casual, more on the casual side. Most co-workers friendly.", "cons": "Management doesn't care. Some employees work hard. Some barely work but everyone is treated the same way. No possibility of promotion. Salary way below standard of living.", "advice": "Pay attention to your employees and reward those who work hard and get rid of those who come to work and snore at their desk"}, {"title": "Sales Specialist", "text": "Pros Great location, great benefits and PTO time. Cons New department so not a lot of job security. Difficult to move up within company.", "rating": 5, "pros": "Great location, great benefits and PTO time.", "cons": "New department so not a lot of job security. Difficult to move up within company.", "advice": null}, {"title": "Dispatcher", "text": "Pros Remote working Generous PTO Good Benefits Cons Working full time as a remote employee, recognition on work was hard to come by. Promotions were nearly impossible as well.", "rating": 3, "pros": "Remote working", "cons": "Working full time as a remote employee, recognition on work was hard to come by. Promotions were nearly impossible as well.", "advice": null}, {"title": "Senior Bankruptcy Specialist", "text": "Pros great company to work for really cares about their employees. Cons When the market took a hit they got out of the mortgage industry . They are known for insurance company you can trust. Advice to Management I wish managment would've put the same effort in making a mortgage company that people would trust with their life.", "rating": 5, "pros": "great company to work for really cares about their employees.", "cons": "When the market took a hit they got out of the mortgage industry . They are known for insurance company you can trust.", "advice": "I wish managment would've put the same effort in making a mortgage company that people would trust with their life."}, {"title": "Analyst", "text": "Pros Challenging job, opportunity to learn new skills if placed in the right position. Cons Constantly changing, feels a little unstable at times. Not knowing whats going to happen from one year to the next.", "rating": 3, "pros": "Challenging job, opportunity to learn new skills if placed in the right position.", "cons": "Constantly changing, feels a little unstable at times. Not knowing whats going to happen from one year to the next.", "advice": null}, {"title": "Metlife has the worst systems and poor help desk service.", "text": "Pros The TC program is decent and flexible schedule is good incentive. Cons There are many systems to navigate and it's difficult to navigate in these systems. Changes are made to these systems but the systems are never user friendly. Management put high demands on employees and work-life balance is extremely unbalanced. Employees are stressed out and management does not seem to care. There are never enough employees in specific departments in order to have efficiency. Advice to Management Management should alleviate some of the demands of employees by hiring a realistic number of employees in each department. Add more incentives to retain employees. Offer more competitive salary.", "rating": 3, "pros": "The TC program is decent and flexible schedule is good incentive.", "cons": "There are many systems to navigate and it's difficult to navigate in these systems. Changes are made to these systems but the systems are never user friendly. Management put high demands on employees and work-life balance is extremely unbalanced. Employees are stressed out and management does not seem to care. There are never enough employees in specific departments in order to have efficiency.", "advice": "Management should alleviate some of the demands of employees by hiring a realistic number of employees in each department. Add more incentives to retain employees. Offer more competitive salary."}, {"title": "Manager - Strategy & Planning", "text": "Pros MetLife has unlimited opportunities to learn new products, processes and work in different location (even international). MetLife is a financially strong and very large company that offers very competitive salaries and great benefits. Cons MetLife is a large company and there is a lot of red tape and office politics once you get to the Director level.", "rating": 3, "pros": "MetLife has unlimited opportunities to learn new products, processes and work in different location (even international). MetLife is a financially strong and very large company that offers very competitive salaries and great benefits.", "cons": "MetLife is a large company and there is a lot of red tape and office politics once you get to the Director level.", "advice": null}, {"title": "Love MetLife", "text": "Pros Awesome company to work for a great benefits Cons Can't say a bad thing about MetLife Advice to Management Continue paying well to keep your emoliyees", "rating": 5, "pros": "Awesome company to work for a great benefits", "cons": "Can't say a bad thing about MetLife", "advice": "Continue paying well to keep your emoliyees"}, {"title": "Look elsewhere for a real career", "text": "Pros Salary, 9-5, nice co-workers, location, new facilities, very low expectations (ideal for the unambitious). Cons Open work space, limited PTO days which includes both sick and vacation, ridiculous handcuffed vesting for 401k and pension, unfair and political ranking system on performance reviews, very low merit increases and always an excuse for why you didn't get the full bonus you rightfully earned, absolutely no career growth, rampant favortism and politics, \"refreshed strategy\" brainwashing with blue and green colors and catchy buzzwords that most still don't quite understand. Advice to Management Give your own employees all of the \"benefits\" and \"perks\" you constantly promote on social media....tale of two cities.", "rating": 3, "pros": "Salary, 9-5, nice co-workers, location, new facilities, very low expectations (ideal for the unambitious).", "cons": "Open work space, limited PTO days which includes both sick and vacation, ridiculous handcuffed vesting for 401k and pension, unfair and political ranking system on performance reviews, very low merit increases and always an excuse for why you didn't get the full bonus you rightfully earned, absolutely no career growth, rampant favortism and politics, \"refreshed strategy\" brainwashing with blue and green colors and catchy buzzwords that most still don't quite understand.", "advice": "Give your own employees all of the \"benefits\" and \"perks\" you constantly promote on social media....tale of two cities."}, {"title": "Audit Manager", "text": "Pros Great people, solid compensation considering the hours and low stress level, very flexible work environment, amazing work-life balance. Cons Can run into bureaocratic roadblocks due to the size and structure of the company. Advice to Management Allow directors and managers more freedom in handling their teams.", "rating": 5, "pros": "Great people, solid compensation considering the hours and low stress level, very flexible work environment, amazing work-life balance.", "cons": "Can run into bureaocratic roadblocks due to the size and structure of the company.", "advice": "Allow directors and managers more freedom in handling their teams."}, {"title": "Innovated", "text": "Pros Growth, talent development, diversified, and global Cons Shrunk in size and no longer has the competitive edge", "rating": 3, "pros": "Growth, talent development, diversified, and global", "cons": "Shrunk in size and no longer has the competitive edge", "advice": null}, {"title": "Continuous cost cutting", "text": "Pros Nice campus. Modest benefits package Cons Cost cutting pressures. Non-competitive salaries. Loss of legacy knowledge of applications, systems, and processes with massive layoffs in the northeastern US. Unequal application of company policies (e.g., telecommuting, training availability, etc.) throughout organization. Advice to Management Show respect for employees and listen to those with experience who you hire for their expertise. Increase revenues to reduce pressures on continuous cost cutting.", "rating": 3, "pros": "Nice campus. Modest benefits package", "cons": "Cost cutting pressures. Non-competitive salaries. Loss of legacy knowledge of applications, systems, and processes with massive layoffs in the northeastern US. Unequal application of company policies (e.g., telecommuting, training availability, etc.) throughout organization.", "advice": "Show respect for employees and listen to those with experience who you hire for their expertise. Increase revenues to reduce pressures on continuous cost cutting."}, {"title": "Analyst", "text": "Pros Incredible group of co workers Cons Can not think of downside off the top of my head", "rating": 5, "pros": "Incredible group of co workers", "cons": "Can not think of downside off the top of my head", "advice": null}, {"title": "Good benefits, bad everything else", "text": "Pros Able to work from home if necessary, good benefits and PTO, reasonable training, room for lateral moves Cons Overworked, employees are asked to meet impossible goals, they don't hire enough employees, they drag claims out for months and years that should be closed in days or weeks, to tremendous financial detriment, no room for true advancement. Advice to Management Hire more people, decrease pendings, stop dragging stupid claims out- let people settle for a couple hundred so they go away, and so pendings decrease.", "rating": 3, "pros": "Able to work from home if necessary, good benefits and PTO, reasonable training, room for lateral moves", "cons": "Overworked, employees are asked to meet impossible goals, they don't hire enough employees, they drag claims out for months and years that should be closed in days or weeks, to tremendous financial detriment, no room for true advancement.", "advice": "Hire more people, decrease pendings, stop dragging stupid claims out- let people settle for a couple hundred so they go away, and so pendings decrease."}, {"title": "Controls Manager", "text": "Pros They embrace work from home philosophy Cons None until retail division was sold to Mass Mutual and many people were laid off. Advice to Management none", "rating": 5, "pros": "They embrace work from home philosophy", "cons": "None until retail division was sold to Mass Mutual and many people were laid off.", "advice": "none"}, {"title": "Amazing Benefits!", "text": "Pros Very impressive salary compensation Cons I had no bad experiences working there Advice to Management I wish office there were more spacious.", "rating": 5, "pros": "Very impressive salary compensation", "cons": "I had no bad experiences working there", "advice": "I wish office there were more spacious."}, {"title": "No complaints", "text": "Pros Coworker proficiency, excellent benefits, plenty of room to move up (depending on the department) Cons It can be a bit political at times. Long hours. Very different management styles within groups Advice to Management Need to promote within.", "rating": 5, "pros": "Coworker proficiency, excellent benefits, plenty of room to move up (depending on the department)", "cons": "It can be a bit political at times. Long hours. Very different management styles within groups", "advice": "Need to promote within."}, {"title": "Great company if you are at work to collect a pay check", "text": "Pros You work for a company that is well known. Pay seems to be average perhaps even slightly above average depending on the role. MetLife pretends to care about their employees. It's nice to feel valued. Having said that, feeling like you're valued and actually being valued are different things. Once you realize actuality there aren't many pros to mention. Cons MetLife is in a \"transitioning\" state. What I mean by that is, they don't know where they are at or where they are heading. They want to be a tech company, they want to be an insurance company, they want to be an investment company, there are too many cultures to count within one organization. Executives are incompetent, they got to where they are through the \"Good Ole' Boy\" program. Their sentences are full of buzz words, and the people next to you are only concerned about self-preservation. Accountability is not something that is required, so you can simply get paid to not do a thing (and that's who stays at MetLife for years). If you are hoping to advance yourself, don't expect your work to get you far. Politics, politics, politics. Just another large company where most people are small fish is an incredibly large pond. Advice to Management Let's start hiring people that are able to do their jobs. Let's work on a culture that forces people to be accountable. Let's stop paying lip service to buzzwords and start acting on your own strategies. Oh, and stop pretending you're better than everyone within the confines of MetLife offices. On the streets you are the same as entry level associates.", "rating": 3, "pros": "You work for a company that is well known. Pay seems to be average perhaps even slightly above average depending on the role. MetLife pretends to care about their employees. It's nice to feel valued. Having said that, feeling like you're valued and actually being valued are different things. Once you realize actuality there aren't many pros to mention.", "cons": "MetLife is in a \"transitioning\" state. What I mean by that is, they don't know where they are at or where they are heading. They want to be a tech company, they want to be an insurance company, they want to be an investment company, there are too many cultures to count within one organization. Executives are incompetent, they got to where they are through the \"Good Ole' Boy\" program. Their sentences are full of buzz words, and the people next to you are only concerned about self-preservation. Accountability is not something that is required, so you can simply get paid to not do a thing (and that's who stays at MetLife for years). If you are hoping to advance yourself, don't expect your work to get you far. Politics, politics, politics. Just another large company where most people are small fish is an incredibly large pond.", "advice": "Let's start hiring people that are able to do their jobs. Let's work on a culture that forces people to be accountable. Let's stop paying lip service to buzzwords and start acting on your own strategies. Oh, and stop pretending you're better than everyone within the confines of MetLife offices. On the streets you are the same as entry level associates."}, {"title": "Enginnering", "text": "Pros People are nice and nice office space Cons Management style is outdated, too many paperwork for engineering", "rating": 3, "pros": "People are nice and nice office space", "cons": "Management style is outdated, too many paperwork for engineering", "advice": null}, {"title": "Metlife great place to work when you figure it out", "text": "Pros Great Work Life Balance Very smart people Cons Management can be more hands on with training", "rating": 5, "pros": "Great Work Life Balance", "cons": "Management can be more hands on with training", "advice": null}, {"title": "Ok, but no job security", "text": "Pros Good work life balance and health benefits are exceptional compared to other companies. Cons Nothing but politics and favoritism. Never any job security as lay-offs come more frequent than promotions.", "rating": 3, "pros": "Good work life balance and health benefits are exceptional compared to other companies.", "cons": "Nothing but politics and favoritism. Never any job security as lay-offs come more frequent than promotions.", "advice": null}, {"title": "Claims Adjuster", "text": "Pros Advancement Opportunities. Bonuses. Compensation and Benefits. They value their employees. Cons They should have a team lead. Advice to Management N/A", "rating": 5, "pros": "Advancement Opportunities. Bonuses. Compensation and Benefits. They value their employees.", "cons": "They should have a team lead.", "advice": "N/A"}, {"title": "Anonymous", "text": "Pros PTO, Work Life Balance, Benefits Culture is evolving Cons Below Average Pay, ancient systems Advice to Management Proactively Hire Personnel", "rating": 5, "pros": "PTO, Work Life Balance, Benefits", "cons": "Below Average Pay, ancient systems", "advice": "Proactively Hire Personnel"}, {"title": "DIRECT mess.", "text": "Pros Great work space and great talent that lasts for a year or so Cons Seniors leaders are ego maniacs who want yes men and women ONLY. Advice to Management What a mess. remaining leaders aside from one, maybe two, are useless. The good ones all opted for severance or are waiting for theirs. There's no focus, no direction, just a whole lotta spin. The office hours are 9-4 most days with Fridays seeming to be optional, so that's a perk. Nobody likes it or each other. There is no trust between colleagues and the lack of strategic direction for 2 years is disappointing. They've churned some brilliant people because they spin their wheels with the lack of empowerment and leadership from the top.", "rating": 1, "pros": "Great work space and great talent that lasts for a year or so", "cons": "Seniors leaders are ego maniacs who want yes men and women ONLY.", "advice": "What a mess. remaining leaders aside from one, maybe two, are useless. The good ones all opted for severance or are waiting for theirs. There's no focus, no direction, just a whole lotta spin. The office hours are 9-4 most days with Fridays seeming to be optional, so that's a perk. Nobody likes it or each other. There is no trust between colleagues and the lack of strategic direction for 2 years is disappointing. They've churned some brilliant people because they spin their wheels with the lack of empowerment and leadership from the top."}, {"title": "Met", "text": "Pros Flex hours are a plus Cons Lots of very busy periods followed by Lulls", "rating": 5, "pros": "Flex hours are a plus", "cons": "Lots of very busy periods followed by Lulls", "advice": null}, {"title": "Exciting company to work for", "text": "Pros global, lots of change happening, lots of opportunities Cons big and bureaucratic and hierarchical", "rating": 5, "pros": "global, lots of change happening, lots of opportunities", "cons": "big and bureaucratic and hierarchical", "advice": null}, {"title": "Compensation, worklife-balance good", "text": "Pros Friendly work life balance programs available but are based on department/manager discretion. Cons Lots of jobs moving to NC so less opportunities for advancement. Senior Leadership (CEO) is more wall street motivated and cares little for employees. Going through another round of budget cuts due to his strategic direction.", "rating": 5, "pros": "Friendly work life balance programs available but are based on department/manager discretion.", "cons": "Lots of jobs moving to NC so less opportunities for advancement. Senior Leadership (CEO) is more wall street motivated and cares little for employees. Going through another round of budget cuts due to his strategic direction.", "advice": null}, {"title": "Management don't know what they are doing", "text": "Pros Cannot think of any. Cons Massive re-org for the past 5 years but NO stock growth. See people quit for better companies constantly", "rating": 1, "pros": "Cannot think of any.", "cons": "Massive re-org for the past 5 years but NO stock growth. See people quit for better companies constantly", "advice": null}, {"title": "Unrealistic expectations of employees", "text": "Pros Decent pay, good vetting of employees personality-wise Cons The workload is ridiculous. It's hard to explain, but you will ALWAYS be behind. Advice to Management Learn how to not overload the hell out of your employees. How can we be expected to provide good customer service when we can barely get to the hundreds of claims we are working on at once?", "rating": 3, "pros": "Decent pay, good vetting of employees personality-wise", "cons": "The workload is ridiculous. It's hard to explain, but you will ALWAYS be behind.", "advice": "Learn how to not overload the hell out of your employees. How can we be expected to provide good customer service when we can barely get to the hundreds of claims we are working on at once?"}, {"title": "Constant Change, conflicting priority", "text": "Pros exciting time to be there with major technology enhancements. Good opportunity if you're in the right area. very flexible, good vacation, great overall culture Cons Long time employees are slow to embrace changing times, some areas can be very political, especially leadership. They are concerned about themselves regardless of saying they're concerned about the customer. Advice to Management Do what's best for the business, sometimes you need authority leadership to assist in change management.", "rating": 3, "pros": "exciting time to be there with major technology enhancements. Good opportunity if you're in the right area. very flexible, good vacation, great overall culture", "cons": "Long time employees are slow to embrace changing times, some areas can be very political, especially leadership. They are concerned about themselves regardless of saying they're concerned about the customer.", "advice": "Do what's best for the business, sometimes you need authority leadership to assist in change management."}, {"title": "OK for now but who knows", "text": "Pros New location and building in NC are pretty nice Potential to get better Getting on good team is luck of the draw, there are still some out there, but not many.. Cons Been there for 10+ years, more and more outsourcing every year New management focuses on what makes them look best for raises Priorities need to get re aligned Benefits getting reduced for those who are not upper management Advice to Management Focus on projects and people that are genuine, not climbing he ladder... Look at our vendors and processes, both going down hill, some shady stuff going on here.", "rating": 3, "pros": "New location and building in NC are pretty nice", "cons": "Been there for 10+ years, more and more outsourcing every year", "advice": "Focus on projects and people that are genuine, not climbing he ladder..."}, {"title": "Grateful for long tenure at Met, but glad to leave as company goes through transition", "text": "Pros Ability to gain diverse job experience by moving internally to various parts of large organization. Ability to work remotely was fantastic! Cons Limited opportunities for promotion. Broad offering in benefits package, but mainly at employee's expense.", "rating": 5, "pros": "Ability to gain diverse job experience by moving internally to various parts of large organization. Ability to work remotely was fantastic!", "cons": "Limited opportunities for promotion. Broad offering in benefits package, but mainly at employee's expense.", "advice": null}, {"title": "Director Risk Mgmt", "text": "Pros The benefits are very good Cons Not a lot of opportunity of movement or growth", "rating": 5, "pros": "The benefits are very good", "cons": "Not a lot of opportunity of movement or growth", "advice": null}, {"title": "AVP", "text": "Pros Generally good people to work with. Cons It is very difficult to get things done there. Politics and re-structuring / down-sizing is a constant headwind to getting things done.", "rating": 3, "pros": "Generally good people to work with.", "cons": "It is very difficult to get things done there. Politics and re-structuring / down-sizing is a constant headwind to getting things done.", "advice": null}, {"title": "Finance Manager", "text": "Pros Reasonably nice offices--for some locations. Can only recommend working there if you are desperate for a job. Cons In finance group minimal concern for employees who are not officers. Lots of benefits (flex time, work at home, etc) are only available to select few, even though being on location not needed to get job done. Many officers encourage confrontational work environment. Minimal opportunity to get promoted from within. Relocate & restructure jobs every few years to shake a few more employees out. Advice to Management Worked in several finance areas during my 15+ years. Many of your staff are dedicated, smart & often go beyond expectations. You claim your employees are your most valuable asset, yet your policies (minimal internal promotion opportunities, forced performance rankings, frequent relocations, etc.) penalize staff employees from staying more than a few years. Take more of a long-term view on your staffing policies--in practice not just on paper.", "rating": 1, "pros": "Reasonably nice offices--for some locations.", "cons": "In finance group minimal concern for employees who are not officers.", "advice": "Worked in several finance areas during my 15+ years."}, {"title": "not bad", "text": "Pros work life balance, starting salary Cons micromanagement, unrealistic expectations, lack of training Advice to Management Think about the big picture", "rating": 3, "pros": "work life balance, starting salary", "cons": "micromanagement, unrealistic expectations, lack of training", "advice": "Think about the big picture"}, {"title": "It's a great environment but upper management doesn't lead well", "text": "Pros Most of the people are great. The environment is nice and they treat you well for the most part. Not a bad place. Cons Some people just don't care about doing a good job. The company itself just split into BHF and they don't have an identity anymore. Advice to Management Fire yourself", "rating": 5, "pros": "Most of the people are great. The environment is nice and they treat you well for the most part. Not a bad place.", "cons": "Some people just don't care about doing a good job. The company itself just split into BHF and they don't have an identity anymore.", "advice": "Fire yourself"}, {"title": "Need seasoned leadership", "text": "Pros Great pay, benefits, work life balance. Cons management was inexperience and did not make calculated decisions. Advice to Management get leaders who know and understand the business.", "rating": 3, "pros": "Great pay, benefits, work life balance.", "cons": "management was inexperience and did not make calculated decisions.", "advice": "get leaders who know and understand the business."}]