[{"title": "Good Company, Great Benefits", "text": "Pros You are a part of something bigger, great PTO and Insurance benefits, office transfer opportunities across the globe. Cons Not good at listening to employee concerns, high employee churn rate.", "rating": 5, "pros": "You are a part of something bigger, great PTO and Insurance benefits, office transfer opportunities across the globe.", "cons": "Not good at listening to employee concerns, high employee churn rate.", "advice": null}, {"title": "Pros and Conts", "text": "Pros - Provides great flexibility and opportunity to work across various disciplines - Invests in employees education and growth - Agile work schedule - Holiday schedule and vacation days are generous Cons Increased compensation is not provided frequently to employees There can be silo between accounts There have not been many new account wins in the past year, while the company has been losing business.", "rating": 5, "pros": "- Provides great flexibility and opportunity to work across various disciplines", "cons": "Increased compensation is not provided frequently to employees", "advice": null}, {"title": "Love it here", "text": "Pros Really great people, they help you along the way and they become your friends. Cons Not a lot of room for growth, low pay at first.", "rating": 5, "pros": "Really great people, they help you along the way and they become your friends.", "cons": "Not a lot of room for growth, low pay at first.", "advice": null}, {"title": "hard to leave", "text": "Pros The people who work here are some of the brightest, grittiest minds in the business, and they create a culture of hard work that's infectious. Cons Internal and GroupM barriers seem to make it hard for Mindshare to provide competitive compensation. It's a tough time in a competitive industry, but talent is often forced to look outside of the company for any significant improvement to their salary.", "rating": 5, "pros": "The people who work here are some of the brightest, grittiest minds in the business, and they create a culture of hard work that's infectious.", "cons": "Internal and GroupM barriers seem to make it hard for Mindshare to provide competitive compensation. It's a tough time in a competitive industry, but talent is often forced to look outside of the company for any significant improvement to their salary.", "advice": null}, {"title": "Senior Associate, Planning and Strategy", "text": "Pros Great people to work with Great culture - some WFH benefits (dependent upon team) Growth opportunities Cons Company needs to hold upper management more accountable", "rating": 3, "pros": "Great people to work with", "cons": "Company needs to hold upper management more accountable", "advice": null}, {"title": "Good company", "text": "Pros Visibility to leadership is pretty high Cons work life balance isn't the greatest", "rating": 5, "pros": "Visibility to leadership is pretty high", "cons": "work life balance isn't the greatest", "advice": null}, {"title": "Too big and no focus", "text": "Pros Mindshare brand is perceived as strong and they are part of a strong network. Small pockets of greatness. Fully depends on the team you work on. Cons Overly hostile individuals in senior roles. There are many sub-brands within Mindshare that are constantly in pitch mode but do no real work. The teams that do have client work are under-staffed and over-worked. Mindshare is unable to be agile and there is no formal training or process which is odd given the size. Advice to Management Do not reward or allow a bully leadership style. Have formal training for every level of employee. Operate with a small shop mentality vs. \"too big to fail\" approach. Promote a work/life balance for your employees Get rid of people who work on nothing and just self-promote through politics. Do away with the sub-groups and have one team", "rating": 3, "pros": "Mindshare brand is perceived as strong and they are part of a strong network.", "cons": "Overly hostile individuals in senior roles.", "advice": "Do not reward or allow a bully leadership style."}, {"title": "Pay Us More", "text": "Pros Vacation Time Young Culture Cons Long Hours Boring Low Pay Advice to Management Value your employees!!!", "rating": 3, "pros": "Vacation Time", "cons": "Long Hours", "advice": "Value your employees!!!"}, {"title": "Associate", "text": "Pros It was nice to have many outings, vendors would often bring food to us, and there is a friendly environment between the staff. Cons Very long working hours, there is no proper on-boarding, and there was a poor communication between teams. Advice to Management Invest more in your employees.", "rating": 3, "pros": "It was nice to have many outings, vendors would often bring food to us, and there is a friendly environment between the staff.", "cons": "Very long working hours, there is no proper on-boarding, and there was a poor communication between teams.", "advice": "Invest more in your employees."}, {"title": "Manager, Marketing Sciences", "text": "Pros Mindhsare invests a lot in employee professional growth, by providing training and mentor programs. Recognizes employee successes and contributions, and is open to promotion discussions. Cons Very low pay, the pay is definitely well below industry average.", "rating": 5, "pros": "Mindhsare invests a lot in employee professional growth, by providing training and mentor programs. Recognizes employee successes and contributions, and is open to promotion discussions.", "cons": "Very low pay, the pay is definitely well below industry average.", "advice": null}]