[{"title": "Salary", "text": "Pros None, Great company. please to be around Cons pay can be more. More interaction with lower level staf Advice to Management none", "rating": 5, "pros": "None, Great company. please to be around", "cons": "pay can be more. More interaction with lower level staf", "advice": "none"}, {"title": "Stay away from this company", "text": "Pros I cannot think of any reasons to work at this company Cons You cannot trust management in anything they tell you. Advice to Management Learn how to earn your employees' loyalty.", "rating": 1, "pros": "I cannot think of any reasons to work at this company", "cons": "You cannot trust management in anything they tell you.", "advice": "Learn how to earn your employees' loyalty."}, {"title": "HR Generalist", "text": "Pros Great people, great culture, good salaries. Cons Acquisition, culture change, leadership change, initiatives lost.", "rating": 5, "pros": "Great people, great culture, good salaries.", "cons": "Acquisition, culture change, leadership change, initiatives lost.", "advice": null}, {"title": "Great environment, solving interesting problems, legacy code is becoming a pain point.", "text": "Pros Team leads are helpful, knowledgeable, and listen to their team. Lots of open discussions and collaboration - your voice is heard throughout the entire development lifecycle. Depending on the team, you may get to build new features, work with modern tech, and help guide the direction of the product. Dev, QA, Product, and Sales all work very well with each other. Management trusts their engineers and stays out of their hair. Very little micro-management. Good work/life balance, plenty of PTO, flexible hours. Solid benefits. Good location, really nice new office. Cons Legacy codebase, lots of time spent on maintenance and not as much focus on new development. Not enough focus on modernization or clearing tech debt. Custom, in-house framework means developers have very little support or online help. Often, your questions can only be answered by a handful of people (the transition to Angular is helping with this, however). QA is undermanned, so developers often end up taking on that role to a degree (not always a bad thing, but it's extra stress that you aren't compensated for). Not much upward mobility, only a few promotion slots between each level. Advice to Management Cleaning up tech debt should be a higher priority. Deprecating the custom framework will pay off down the road, and more resources should be put on that project. QA needs more resources.", "rating": 5, "pros": "Team leads are helpful, knowledgeable, and listen to their team. Lots of open discussions and collaboration - your voice is heard throughout the entire development lifecycle.", "cons": "Legacy codebase, lots of time spent on maintenance and not as much focus on new development.", "advice": "Cleaning up tech debt should be a higher priority. Deprecating the custom framework will pay off down the road, and more resources should be put on that project."}, {"title": "Good growing company", "text": "Pros Strong focus on culture, investment in talent and growth. Cons If you have an allergy to change and hard work, this will be a tough place to work.", "rating": 5, "pros": "Strong focus on culture, investment in talent and growth.", "cons": "If you have an allergy to change and hard work, this will be a tough place to work.", "advice": null}, {"title": "Culture", "text": "Pros Opportunity for growth, advancement was great prior to private equity buyout. Cons Too much off-shoring, lack of interest in customer relationships", "rating": 1, "pros": "Opportunity for growth, advancement was great prior to private equity buyout.", "cons": "Too much off-shoring, lack of interest in customer relationships", "advice": null}, {"title": "Solid software firm dragged down by weak management and overly focused on short term results", "text": "Pros Excellent client base and potential for future growth with them Broad portfolio of products across the industry with some leading packages Visionary and top rate chairman Cons Far too focused on short term revenue targets at exclusion of strategic vision or long term profitability Some of the senior management have been overly promoted and simply do not understand the industry they serve Very difficult for outsiders to thrive as there are strong cliques and heavy political undertones For a global firm very London focused management and hard for regions to have a any say or clear understanding of decisions made before they are announced Advice to Management Structure of firm stifles the ability of industry leads to exert any influence. Has to be the only software firm that does not have overall industry leads with power to actually manage that vertical", "rating": 3, "pros": "Excellent client base and potential for future growth with them", "cons": "Far too focused on short term revenue targets at exclusion of strategic vision or long term profitability", "advice": "Structure of firm stifles the ability of industry leads to exert any influence. Has to be the only software firm that does not have overall industry leads with power to actually manage that vertical"}, {"title": "Not a good place for sales people - high turnover, not a good culture", "text": "Pros Great CMO. OK place for junior sales people to gain experience with large existing Fin Serv clients. Several support and services staff from original companies (before acquisition) are incredible, but only a few left. Cons In US, about 95% turnover in 3 years - about 24 Sales left company, some let go. MD tries to motivate with stick - most time spent reporting up to measure and monitoring staff, middle managers. Clients frustrated with Private Equity model, constant turnover. Advice to Management Invest less in sales and marketing, more on support and development - take a long term view, as if you were the founders.", "rating": 1, "pros": "Great CMO. OK place for junior sales people to gain experience with large existing Fin Serv clients. Several support and services staff from original companies (before acquisition) are incredible, but only a few left.", "cons": "In US, about 95% turnover in 3 years - about 24 Sales left company, some let go. MD tries to motivate with stick - most time spent reporting up to measure and monitoring staff, middle managers. Clients frustrated with Private Equity model, constant turnover.", "advice": "Invest less in sales and marketing, more on support and development - take a long term view, as if you were the founders."}, {"title": "Resume", "text": "Pros Great company, leader in banking software! Cons Software is limited on Real estate Advice to Management Your time is valuable and you are over worked. Keep up the good work!", "rating": 5, "pros": "Great company, leader in banking software!", "cons": "Software is limited on Real estate", "advice": "Your time is valuable and you are over worked. Keep up the good work!"}, {"title": "Product Manager", "text": "Pros Genuine appetite for innovation. Amazing client base and reputation. Great office spaces. Great people and culture. Unique offering. Cons Ridiculous medical deductible (US). Few bad apples both in middle management and products. Advice to Management Stick to your guns. You have the good strategy.", "rating": 5, "pros": "Genuine appetite for innovation. Amazing client base and reputation. Great office spaces. Great people and culture. Unique offering.", "cons": "Ridiculous medical deductible (US). Few bad apples both in middle management and products.", "advice": "Stick to your guns. You have the good strategy."}]