[{"title": "AMAZING", "text": "Pros Such a strong and inspirational team culture Cons I dont work in the office so have to pay for my own coffee and snacks Advice to Management Keep doing what you are doing!", "rating": 5, "pros": "Such a strong and inspirational team culture", "cons": "I dont work in the office so have to pay for my own coffee and snacks", "advice": "Keep doing what you are doing!"}, {"title": "Excellent company", "text": "Pros rewarding work, great benefits, culture, intelligent colleagues Cons salary could maybe be better", "rating": 5, "pros": "rewarding work, great benefits, culture, intelligent colleagues", "cons": "salary could maybe be better", "advice": null}, {"title": "Best place I've ever worked", "text": "Pros Such an amazing bunch of people to work with! There is a real buzz about building the best bank possible, and everyone is very committed to this. They show lots of empathy for you as a person, and give you great benefits. Cons Honestly...I can't think of a single con! I love working there! Advice to Management Keep up the good work!", "rating": 5, "pros": "Such an amazing bunch of people to work with! There is a real buzz about building the best bank possible, and everyone is very committed to this. They show lots of empathy for you as a person, and give you great benefits.", "cons": "Honestly...I can't think of a single con! I love working there!", "advice": "Keep up the good work!"}, {"title": "Best place I've ever worked", "text": "Pros Amazing team, healthy feedback culture and fair environment for growth Cons We all drink the Kool-Aid so sometimes it's easy to lose perspective", "rating": 5, "pros": "Amazing team, healthy feedback culture and fair environment for growth", "cons": "We all drink the Kool-Aid so sometimes it's easy to lose perspective", "advice": null}, {"title": "Great atmosphere", "text": "Pros Stock options, flexible working is possible Cons Remote working is a bit detached from day-to-day operations Advice to Management IPO IPO", "rating": 5, "pros": "Stock options, flexible working is possible", "cons": "Remote working is a bit detached from day-to-day operations", "advice": "IPO IPO"}, {"title": "The best place I've ever worked, by far", "text": "Pros Working on a product I believe in. Positive, enthusiastic and driven culture. Intelligent and interesting colleagues. Fast moving nature of work. Cons Intensity can be hard at times - difficult to switch off.", "rating": 5, "pros": "Working on a product I believe in.", "cons": "Intensity can be hard at times - difficult to switch off.", "advice": null}, {"title": "Expect the unexpected", "text": "Pros I've never worked in a place where everyone seems to be so in sync, but not in a cliquey way. From the day you start everyone from the CEO to the person next to you makes it clear that your time is just as valuable as theirs and that if you have any concerns, or just want a chat that they are available (although you may need to schedule it around their other commitments)! Cons The pace can sometimes be rapid, but that's expected in a start up! Procedures can also be changed week on week as the team grows as what works for 50 people doesn't necessarily work for 100 and there have been up to around 20 people joining in a week on occasion! Advice to Management Keep doing what you're doing", "rating": 5, "pros": "I've never worked in a place where everyone seems to be so in sync, but not in a cliquey way. From the day you start everyone from the CEO to the person next to you makes it clear that your time is just as valuable as theirs and that if you have any concerns, or just want a chat that they are available (although you may need to schedule it around their other commitments)!", "cons": "The pace can sometimes be rapid, but that's expected in a start up! Procedures can also be changed week on week as the team grows as what works for 50 people doesn't necessarily work for 100 and there have been up to around 20 people joining in a week on occasion!", "advice": "Keep doing what you're doing"}, {"title": "COps", "text": "Pros Opportunity to work with a great team and work on a product that actually helps people. Great wages, perks, benefits and opportunities. Cons It can be hard when things change on a daily or even hourly basis, but that's what you buy into when joining a start up 🙈 Advice to Management Keep doing what you're doing, and continue to keep things less corporate and more friendly as it is ☺", "rating": 5, "pros": "Opportunity to work with a great team and work on a product that actually helps people. Great wages, perks, benefits and opportunities.", "cons": "It can be hard when things change on a daily or even hourly basis, but that's what you buy into when joining a start up 🙈", "advice": "Keep doing what you're doing, and continue to keep things less corporate and more friendly as it is ☺"}, {"title": "Software Engineer", "text": "Pros You get to work on a product that hundreds of thousands (millions soon) use every day to make their life better. Everything you do matters Incredibly talented/skilled team, lots of opportunities to share knowledge and grow/learn Cons There are no cons 😀", "rating": 5, "pros": "You get to work on a product that hundreds of thousands (millions soon) use every day to make their life better.", "cons": "There are no cons 😀", "advice": null}, {"title": "Building the rocketship while trying to fly it at the same time", "text": "Pros Exciting and demanding work where you are expected to be great at what you do. There's a real sense of achievement and purpose within the team. The company as a whole is very directed and focused on building the bank. There's a strong internal culture and community and it's easy to make friends. The remuneration package comes with lots of stock option and everyone in the company gets options. Flexible hours and relaxed in office policy. Hyper growth is super exciting. Cons They go hand in hand with the pros - it's a startup that is still on its launchpad - achieving profitability is the big sword of Damoclese above and that is a constant driver. Its very busy and sometimes it is difficult to carve out time to ask questions or to get training. You need to be quite self sufficient to work in some teams. Pay is below market rate (you get stock). Hyper growth is painful sometimes. Advice to Management As we grow we need to continually worry about the culture at Monzo. Other than that I think you are doing the most important thing which is to be continually *present* and available to lead.", "rating": 5, "pros": "Exciting and demanding work where you are expected to be great at what you do. There's a real sense of achievement and purpose within the team. The company as a whole is very directed and focused on building the bank. There's a strong internal culture and community and it's easy to make friends. The remuneration package comes with lots of stock option and everyone in the company gets options.", "cons": "They go hand in hand with the pros - it's a startup that is still on its launchpad - achieving profitability is the big sword of Damoclese above and that is a constant driver. Its very busy and sometimes it is difficult to carve out time to ask questions or to get training. You need to be quite self sufficient to work in some teams. Pay is below market rate (you get stock).", "advice": "As we grow we need to continually worry about the culture at Monzo. Other than that I think you are doing the most important thing which is to be continually *present* and available to lead."}, {"title": "It's the best place I've ever worked", "text": "Pros Lots of freedom for you to grow and make an impact, a lot of trust in employees. Lot's of opportunity to make a difference. Great work/life balance. Super smart team mates. Decent compensation. Cons Growing fast, bit chaotic, maybe hard for people that need reliable structure", "rating": 5, "pros": "Lots of freedom for you to grow and make an impact, a lot of trust in employees. Lot's of opportunity to make a difference. Great work/life balance. Super smart team mates. Decent compensation.", "cons": "Growing fast, bit chaotic, maybe hard for people that need reliable structure", "advice": null}, {"title": "Challenging and interesting work combined with great colleagues", "text": "Pros Transparency - You know what's going on, and how and why decisions are made. People - Wonderful, thoughtful, clever people who work hard and respect the work of others. Day to day - Great atmosphere where I feel valued and where I feel like my work makes a difference. Cons People are so passionate about the product, our customers, culture at Monzo that it can be hard to switch off at times.", "rating": 5, "pros": "Transparency - You know what's going on, and how and why decisions are made.", "cons": "People are so passionate about the product, our customers, culture at Monzo that it can be hard to switch off at times.", "advice": null}, {"title": "COps Fincrime Specialist", "text": "Pros The culture is absolutely amazing, the vision is clear and everyone is very helpful. There are loads of great benefits, social events to keep staff motivated and updated to keep staff well informed. Monzo offer flexible working to accommodate around lifestyle with remote working as an option also. Cons There are honestly no cons 😄 Advice to Management Keep on just as you are !", "rating": 5, "pros": "The culture is absolutely amazing, the vision is clear and everyone is very helpful. There are loads of great benefits, social events to keep staff motivated and updated to keep staff well informed.", "cons": "There are honestly no cons 😄", "advice": "Keep on just as you are !"}, {"title": "Great place to work!", "text": "Pros Great vision, great colleagues, great company culture. Cons I'll let you know when I think of some.", "rating": 5, "pros": "Great vision, great colleagues, great company culture.", "cons": "I'll let you know when I think of some.", "advice": null}, {"title": "Hard work, but such a great project.", "text": "Pros Super high morale, everything everyone is working on is critical to the success of the project. Hard work but never unfair, founders regularly talk about not burning out, people are encouraged to take their full holidays and up to a month unpaid leave to do cool things. The company is really transparent, anyone can read just about any email sent in the company (except HR/renumeration type things, or some confidential investment things.) Cons There's no corners to hide in, there's no cushy jobs, and people frequently leave before the end of their probation. Pay is skewed towards options rather than cash so it appeals to people who are willing to take a chance.", "rating": 5, "pros": "Super high morale, everything everyone is working on is critical to the success of the project. Hard work but never unfair, founders regularly talk about not burning out, people are encouraged to take their full holidays and up to a month unpaid leave to do cool things.", "cons": "There's no corners to hide in, there's no cushy jobs, and people frequently leave before the end of their probation.", "advice": null}, {"title": "Amazing, caring and intelligent people", "text": "Pros Its an amazing place to work! The people are clever, the product is great and it feels like we're developing something that might really change people's lives. The fact that we're growing really strongly also helps! Cons This isn't always a comfortable environment (although the team do seem to really care), things move and change a lot, and things break a lot of the time. I think this makes it fun to work here, but it won't be for everyone...", "rating": 5, "pros": "Its an amazing place to work! The people are clever, the product is great and it feels like we're developing something that might really change people's lives. The fact that we're growing really strongly also helps!", "cons": "This isn't always a comfortable environment (although the team do seem to really care), things move and change a lot, and things break a lot of the time. I think this makes it fun to work here, but it won't be for everyone...", "advice": null}, {"title": "Fair, exciting and enjoyable", "text": "Pros Monzo has a wonderful community feel - everyone is super friendly and helpful towards one another. I've never had any issues with any other employees, and I feel adequately trained to do my job. You are also encouraged to widen the span of your responsibilities, with excellent self development programs. Cons There are literally none that I have noticed so far, and I have worked for Monzo for a considerable amount of time. Advice to Management Keep doing what you're doing, and also make sure to be 100% transparent about decision making at all times, to reduce the management / subordinates divide.", "rating": 5, "pros": "Monzo has a wonderful community feel - everyone is super friendly and helpful towards one another. I've never had any issues with any other employees, and I feel adequately trained to do my job. You are also encouraged to widen the span of your responsibilities, with excellent self development programs.", "cons": "There are literally none that I have noticed so far, and I have worked for Monzo for a considerable amount of time.", "advice": "Keep doing what you're doing, and also make sure to be 100% transparent about decision making at all times, to reduce the management / subordinates divide."}, {"title": "Super company to work for", "text": "Pros Innovative and forward-thinking - both in terms of the products they are building and also the way they are structuring how the business is run. Unlike anywhere else I have ever worked, the morale, camaraderie and the genuine willingness to help people is second to none. Cons Nothing yet! I don't think I've ever said this about any other employer before... Advice to Management Please don't change!", "rating": 5, "pros": "Innovative and forward-thinking - both in terms of the products they are building and also the way they are structuring how the business is run. Unlike anywhere else I have ever worked, the morale, camaraderie and the genuine willingness to help people is second to none.", "cons": "Nothing yet! I don't think I've ever said this about any other employer before...", "advice": "Please don't change!"}, {"title": "Operations team", "text": "Pros The open-mentality present in the work environment Cons Nothing to report. In fact I can say that there are no cons.", "rating": 5, "pros": "The open-mentality present in the work environment", "cons": "Nothing to report. In fact I can say that there are no cons.", "advice": null}, {"title": "Intelligent team with exciting prospects", "text": "Pros The people at Monzo are fantastic, everyone is fun, friendly and open. The team spirit is strong and the frequent socials really help this. The genuine care for our users is heartwarming to see and the management style is for-the-most-part relaxed and very transparent. Cons Whilst there is a lot of time and thought put into inter-personal development, personal growth/development is an area which has not had so much noticeable attention. This can (and has personally) affected morale. Advice to Management Keep being transparent, keep the culture strong but work towards improving individual development plans/future prospects.", "rating": 5, "pros": "The people at Monzo are fantastic, everyone is fun, friendly and open. The team spirit is strong and the frequent socials really help this. The genuine care for our users is heartwarming to see and the management style is for-the-most-part relaxed and very transparent.", "cons": "Whilst there is a lot of time and thought put into inter-personal development, personal growth/development is an area which has not had so much noticeable attention. This can (and has personally) affected morale.", "advice": "Keep being transparent, keep the culture strong but work towards improving individual development plans/future prospects."}, {"title": "Brilliantly Smart, Talented, Caring Team", "text": "Pros Monzo truly embraces the qualities it claims to care about: transparency and openness are fundamental to the way everyone approaches problems. There is a genuine, pervasive belief in fairness and a desire to build a company that truly cares for employees and customers. It's easily the smartest, most caring company I have ever worked for. Cons Scaling startups at speed is always a challenge, and Monzo has far outgrown it's current, very rough office. On the plus side, we move to a huge new one next month (April 2017) which everyone is getting involved in making awesome. Advice to Management Keep it up: the company culture, focus and drive to make something amazing is incredible.", "rating": 5, "pros": "Monzo truly embraces the qualities it claims to care about: transparency and openness are fundamental to the way everyone approaches problems. There is a genuine, pervasive belief in fairness and a desire to build a company that truly cares for employees and customers. It's easily the smartest, most caring company I have ever worked for.", "cons": "Scaling startups at speed is always a challenge, and Monzo has far outgrown it's current, very rough office. On the plus side, we move to a huge new one next month (April 2017) which everyone is getting involved in making awesome.", "advice": "Keep it up: the company culture, focus and drive to make something amazing is incredible."}]