[{"title": "Review", "text": "Pros Excellent Support for all staff Open door policy for staff The business makes each individual feel important Cons None to report so far! Advice to Management -", "rating": 5, "pros": "Excellent Support for all staff", "cons": "None to report so far!", "advice": "-"}, {"title": "Strange Place to Work", "text": "Pros Have met lots of good people. Get to leave at 5! Cons Clueless MD, feels like a sinking ship, lots of mediocre performers getting away with it. Advice to Management Don’t tolerate mediocrity. Be honest with staff and on here. Most reviews on here written by Marketing Department.", "rating": 1, "pros": "Have met lots of good people. Get to leave at 5!", "cons": "Clueless MD, feels like a sinking ship, lots of mediocre performers getting away with it.", "advice": "Don’t tolerate mediocrity. Be honest with staff and on here. Most reviews on here written by Marketing Department."}, {"title": "Manager", "text": "Pros Respected name in the market with great progression. Understanding board of directors that provide you with support to be successful (special mentions to Chris & Frazier). Great teamwork always putting a team first, ahead of personal success. A professional and respectful organisation from front to back office that values and encourages its employees. There are always company wide events, MD addresses, seasonal parties, weekly in house competitions and a real feel for teamwork and fun! Cons Honestly there are none, this could change but all good at the moment. Advice to Management keep doing what you are doing and working towards Morgan Hunts Vision and values.", "rating": 5, "pros": "Respected name in the market with great progression. Understanding board of directors that provide you with support to be successful (special mentions to Chris & Frazier).", "cons": "Honestly there are none, this could change but all good at the moment.", "advice": "keep doing what you are doing and working towards Morgan Hunts Vision and values."}, {"title": "People are not numbers.", "text": "Pros Easy placement. Large agency. There are many departments to suit the needs f applicants. Cons Account Managers rarely return calls. Workers are severely underpaid. Your concerns will go unheeded. Account Managers are only solicitous when it benefits them.", "rating": 3, "pros": "Easy placement. Large agency. There are many departments to suit the needs f applicants.", "cons": "Account Managers rarely return calls. Workers are severely underpaid. Your concerns will go unheeded. Account Managers are only solicitous when it benefits them.", "advice": null}, {"title": "Great to work for", "text": "Pros Morgan Hunt are a very good company to work for. They have supported me with development within the company and furthered my skills. Senior members of staff have been approachable and easy to talk to should I have had any problems, there is a very welcoming environment within the office. Cons Keeping managers well informed of the training of new employees and what it entails, to allow them to guide and offer support should the employee need it. Advice to Management Promote staff within the company, giving them opportunities they may be unaware of. maintaining a general catch up with employees to manage work load and expectations.", "rating": 5, "pros": "Morgan Hunt are a very good company to work for.", "cons": "Keeping managers well informed of the training of new employees and what it entails, to allow them to guide and offer support should the employee need it.", "advice": "Promote staff within the company, giving them opportunities they may be unaware of. maintaining a general catch up with employees to manage work load and expectations."}, {"title": "Wonderful Company", "text": "Pros I have benefited from the fantastic opportunities the company has given me over the years. I am one of several staff who has done 10 years plus service and I have truly loved the journey the company has taken me on. They have shown belief in me, supported me with a training/development programme and they have rewarded my performance whether that be remuneration, bonus or promotion. They recognise potential and they like to promote within, the management team, senior management team and leadership team are testament to this. It is a fun place to work, quarterly team nights out, company social events, awards ceremonies and lavish Christmas parties to note. Work life balance is great the hours are good, the company has done a lot to address this to ensure they are not burning out their staff with unsociable hours. In summary, it’s a unique place that has something special. If you are dedicated and have the ability, you will prosper at Morgan Hunt. Cons Top biller's do not always make the best managers, not all cases but in some cases, they can leave something to be desired when it comes leadership and management. More support on desk for their staff is required to better support company wide training and development programme delivered by the talent team. Advice to Management Promoting within is great but I also think some of the best senior recruits in recent years have come with external experience. So, it is about having a better balance between external experience that gives a different perspective and the long serving staff that have climbed the ladder.", "rating": 5, "pros": "I have benefited from the fantastic opportunities the company has given me over the years. I am one of several staff who has done 10 years plus service and I have truly loved the journey the company has taken me on. They have shown belief in me, supported me with a training/development programme and they have rewarded my performance whether that be remuneration, bonus or promotion. They recognise potential and they like to promote within, the management team, senior management team and leadership team are testament to this. It is a fun place to work, quarterly team nights out, company social events, awards ceremonies and lavish Christmas parties to note. Work life balance is great the hours are good, the company has done a lot to address this to ensure they are not burning out their staff with unsociable hours. In summary, it’s a unique place that has something special. If you are dedicated and have the ability, you will prosper at Morgan Hunt.", "cons": "Top biller's do not always make the best managers, not all cases but in some cases, they can leave something to be desired when it comes leadership and management. More support on desk for their staff is required to better support company wide training and development programme delivered by the talent team.", "advice": "Promoting within is great but I also think some of the best senior recruits in recent years have come with external experience. So, it is about having a better balance between external experience that gives a different perspective and the long serving staff that have climbed the ladder."}, {"title": "Leaving review", "text": "Pros Great culture Working hours Work life balance Cons Kitchen Wider business communication", "rating": 5, "pros": "Great culture", "cons": "Kitchen", "advice": null}, {"title": "Professional and fun", "text": "Pros Imagine you find yourself in a job you enjoy, with people you like, doing the work you want to do. Imagine that you have the feeling that your ideas will be listened to and you have the chance to make a real difference. If you’re really lucky, imagine a senior management team who are actively trying to improve the business in not only profitability but conditions for staff and like to reward effort and innovation. I don’t have to use my imagination for that; I just turn up at the office. Good, eh? Cons Pros sound too good to be true? OK, no job is perfect and I have my share of frustrations and boring stuff. It's not nirvana and it's not always easy. I also agree with some other reviewers that the company has gone through some not-so-good times in the year I've been here. My main issue is location; I have a long commute and that grinds me down (this would be true of any job in London, though). Advice to Management The last few months have seen some good initiatives; I think it's really important we don't let the momentum drop.", "rating": 5, "pros": "Imagine you find yourself in a job you enjoy, with people you like, doing the work you want to do.", "cons": "Pros sound too good to be true? OK, no job is perfect and I have my share of frustrations and boring stuff. It's not nirvana and it's not always easy.", "advice": "The last few months have seen some good initiatives; I think it's really important we don't let the momentum drop."}, {"title": "Business Manager", "text": "Pros Great team environment, Fun and serious when we need to be. Management are supportive and see your vision on where to take the business, full support along the journey. Cons More PSL accounts would really drive us to the next level", "rating": 5, "pros": "Great team environment, Fun and serious when we need to be. Management are supportive and see your vision on where to take the business, full support along the journey.", "cons": "More PSL accounts would really drive us to the next level", "advice": null}, {"title": "Morgan Hunt Review", "text": "Pros - Career Progression - Friendly and professional environment - A strong and fair SLT who recognise hard work - Employee benefits Cons - Lack of communication between divisions", "rating": 5, "pros": "- Career Progression", "cons": "- Lack of communication between divisions", "advice": null}]