[{"title": "Excellent culture, brilliant colleagues", "text": "Pros Everyone is genuinely nice, without much politics. There is a lot to learn but colleagues are sincerely interested in helping new employees learn and succeed. Good benefits, and lots of opportunities to grow your career. Employees truly follow the company mantra of Lead Exceed Thrive! Cons None . Please don't change the amazing culture! Advice to Management Please keep up the good work. It might be a good idea to improve more local branding about satellite offices like Philadelphia, as they can sometimes be overshadowed by the New York Wall Street association.", "rating": 5, "pros": "Everyone is genuinely nice, without much politics. There is a lot to learn but colleagues are sincerely interested in helping new employees learn and succeed.", "cons": "None . Please don't change the amazing culture!", "advice": "Please keep up the good work."}, {"title": "Good company, but not focused on core business of trading", "text": "Pros There are some very intelligent individuals working here, though some lack know how and experience in the company... The technology is better than most other national exchanges. Cons Too many acquisitions have occurred in the past few years resulting in a very fragmented operating environment. Trading team is very lean and vulnerable to operating errors. Also, resources are not adequately allocated to making system improvements and there is a \"if it ain't broke, don't fix it\"mentality. Advice to Management Focus on making improvements to core trading business. Value the experience and knowledge base of your employees.", "rating": 5, "pros": "There are some very intelligent individuals working here, though some lack know how and experience in the company...", "cons": "Too many acquisitions have occurred in the past few years resulting in a very fragmented operating environment. Trading team is very lean and vulnerable to operating errors. Also, resources are not adequately allocated to making system improvements and there is a \"if it ain't broke, don't fix it\"mentality.", "advice": "Focus on making improvements to core trading business."}, {"title": "Fast paced work environment. Heavy focus on revenue growth for company.", "text": "Pros Fast-paced. Employees gain a lot of experience quickly. Management listens to middle managers. Decent and benefits and compensation offered to employees. Cons Company often adopts policies that are not client focused. Huge focus on increasing revenue and yearly revenue goals are set vert high.", "rating": 3, "pros": "Fast-paced. Employees gain a lot of experience quickly. Management listens to middle managers. Decent and benefits and compensation offered to employees.", "cons": "Company often adopts policies that are not client focused. Huge focus on increasing revenue and yearly revenue goals are set vert high.", "advice": null}, {"title": "HR- high turnover and lack of good leadership", "text": "Pros -Fantastic brand, benefits and 401K match sets the company apart -Fast paced with constant upgrades to technology and increase in individual responsibilities -Smart and hard working people throughout the company Cons -Staggering HR turnover so masterly disguised -Extremely low morale due to disrespectful and unethical behavior internally in HR that continues to go unaddressed due to the fact that HR is untouchable compared to other departments within the organization -You’ll only receive a promotion (or pretend \"recognition\") if you resign/threaten to resign but are needed for a specific project or during an understaffed time of year -You won’t be able to find one ex/current HR employee that would recommend joining the toxic HR team", "rating": 1, "pros": "-Fantastic brand, benefits and 401K match sets the company apart", "cons": "-Staggering HR turnover so masterly disguised", "advice": null}, {"title": "You work for me attitude", "text": "Pros -Work life balance when needed. -Great group of people will be your neighbors. -I don’t want to say they are evolving, but things are always being rearranged... kinda like rebuilding a transmission.... this produces a fast paced work environment with interesting work. Cons -Very little room for growth, but you can gain responsibilities. -A healthy portion of finger pointing and lack of accountability. -Some managers don’t share bonus pool fairly. -A few managers that work for themselves and not the company as a whole. Advice to Management -Foster the growth of leaders, not bosses. Weed out or rehabilitate those toxic managers in NY, they’re not worth it. -Establish cross-team oversight to minimize finger pointing.", "rating": 3, "pros": "-Work life balance when needed.", "cons": "-Very little room for growth, but you can gain responsibilities.", "advice": "-Foster the growth of leaders, not bosses. Weed out or rehabilitate those toxic managers in NY, they’re not worth it."}, {"title": "Product manager", "text": "Pros Some pros include: 1) Great work culture that encourages creativity in problem solving, 2) Flexibility with work scheduling and work life balance I.e work from home opportunities 3) Great employee benefits including paid sick days, vacation days, health insurance Cons Some cons include: 1) Salary not commensurate to work functions 2) Lots of turn over in some departments mostly due to attrition but sometimes sure to resignations", "rating": 5, "pros": "Some pros include:", "cons": "Some cons include:", "advice": null}, {"title": "Facilities", "text": "Pros Some truly great and talented people to work with. Expectations are often unrealistic but it keeps you on top of your game! Cons Change in culture, in the last year or so there's been multiple layoffs of many long time and talented work staff. The one common thread were all of them were over fifty years old or more. Seems to be sweeps throughout the business units of anyone approaching senior years and all are given the same tagline, \"Your job has become redundant\". Advice to Management Continue to continue with staffing all levels with workers based on age and lack of experience will eventually catch up with the corporation with a negative and irreversible impact.", "rating": 3, "pros": "Some truly great and talented people to work with. Expectations are often unrealistic but it keeps you on top of your game!", "cons": "Change in culture, in the last year or so there's been multiple layoffs of many long time and talented work staff. The one common thread were all of them were over fifty years old or more. Seems to be sweeps throughout the business units of anyone approaching senior years and all are given the same tagline, \"Your job has become redundant\".", "advice": "Continue to continue with staffing all levels with workers based on age and lack of experience will eventually catch up with the corporation with a negative and irreversible impact."}, {"title": "Challenging but rewarding designing from within", "text": "Pros Smart colleagues, great team, and challenging work. A buttoned-down company but group dynamic is loose to help balance outside stresses. Relaxed group approach keeps things from getting too heavy when outside pressures build. A focus on growing team members. Giving people a chance to add new skills, attend events, and coaching for speaking. Chances to experiment when the moments are right. Your work gets seen by customers who love it. Cons As with most internal design groups, communication with product is a never-ending adventure. Some days you have to be an educator as much as a designer. Advice to Management Continue to hire and develop design-savvy product owners who can get the most from the team.", "rating": 5, "pros": "Smart colleagues, great team, and challenging work.", "cons": "As with most internal design groups, communication with product is a never-ending adventure. Some days you have to be an educator as much as a designer.", "advice": "Continue to hire and develop design-savvy product owners who can get the most from the team."}, {"title": "Good people, would liked to have worked with others more", "text": "Pros Great co-workers, very nice and helpful Cons Often worked alone, would have liked to work with others more often Advice to Management Provide more opportunities for interns to work together", "rating": 5, "pros": "Great co-workers, very nice and helpful", "cons": "Often worked alone, would have liked to work with others more often", "advice": "Provide more opportunities for interns to work together"}, {"title": "Nasdaq Internship", "text": "Pros Developing internship program, real work experience Cons Quality of management depends on the team", "rating": 5, "pros": "Developing internship program, real work experience", "cons": "Quality of management depends on the team", "advice": null}, {"title": "Benefits some of the people", "text": "Pros Benefits I like my manager and the people I worked with Cons Some management treat people very mean. Some need management skills to learn how to talk to people Advice to Management None understand you employee feeling treat people the way you want to be treated", "rating": 5, "pros": "Benefits I like my manager and the people I worked with", "cons": "Some management treat people very mean. Some need management skills to learn how to talk to people", "advice": "None understand you employee feeling treat people the way you want to be treated"}, {"title": "Bureaucracy & office politics ruins the culture", "text": "Pros - Great work/life balance - Salary and benefits were pretty good - Gained some valuable experience Cons - Colleagues that were part of the \"drinking circle\" with the bosses got preferential treatment - Office politics plays a major role in getting things done, which is very frustrating - Some managers hire women & POC to brag about being diverse but don't give any support when they are hired Advice to Management It time to change the culture and how people communicate with each others. The office politics is having a negative effect between different departments, which makes it twice as hard to create great products.", "rating": 1, "pros": "- Great work/life balance", "cons": "- Colleagues that were part of the \"drinking circle\" with the bosses got preferential treatment", "advice": "It time to change the culture and how people communicate with each others. The office politics is having a negative effect between different departments, which makes it twice as hard to create great products."}, {"title": "Web Developer, Senior Specialist", "text": "Pros Great benefits and Work/life balance Cons Long term vision seems a little vague Advice to Management Not really", "rating": 5, "pros": "Great benefits and Work/life balance", "cons": "Long term vision seems a little vague", "advice": "Not really"}, {"title": "Work environment", "text": "Pros Good work life balance. No pressure to sit late. Cons Too many roadblocks to innovation. No one makes quick decisions. Chain of command too long for any decision making. Not a startup culture at all. Engineers are at the bottom of food chain. Product and PM rule. Advice to Management Focus more on engineering and innovation.", "rating": 3, "pros": "Good work life balance. No pressure to sit late.", "cons": "Too many roadblocks to innovation. No one makes quick decisions. Chain of command too long for any decision making. Not a startup culture at all. Engineers are at the bottom of food chain. Product and PM rule.", "advice": "Focus more on engineering and innovation."}, {"title": "Very Helpful HR", "text": "Pros HR is very good at responding to intern's questions and concerns Cons Nothing to complain, everything was good to me", "rating": 5, "pros": "HR is very good at responding to intern's questions and concerns", "cons": "Nothing to complain, everything was good to me", "advice": null}, {"title": "Sales", "text": "Pros Great place for college grad. Travel and great learning environment for someone with very little experience. Incredible vista from office floor and fresh fruit every day! Cons Relentless hours, tedious time consuming manual requests and little recognition for hard work. Micromanaging to the hilt and beyond! If you hit quota one month then Miss by 5% look out! Advice to Management Figure out what works and make commission fair to all", "rating": 3, "pros": "Great place for college grad. Travel and great learning environment for someone with very little experience. Incredible vista from office floor and fresh fruit every day!", "cons": "Relentless hours, tedious time consuming manual requests and little recognition for hard work. Micromanaging to the hilt and beyond! If you hit quota one month then Miss by 5% look out!", "advice": "Figure out what works and make commission fair to all"}, {"title": "Incredible Firm and Culture", "text": "Pros - Incredible people and collaborative environment Cons - A structured mentorship program could be helpful", "rating": 5, "pros": "- Incredible people and collaborative environment", "cons": "- A structured mentorship program could be helpful", "advice": null}, {"title": "Employee Review", "text": "Pros Great Benefits Open and Constructive environment Office politics very minimal Improvement oriented environment All professional contributions are appreciated Good work is recognized Cons No clear career advancement Sink or Swim learning and development culture Lack of direction and communication from leadership Limited organized process/workflow cadence Internal systems used for day-to-day operations outdated or capabilities are not fully taken advantage of Advice to Management More clear direction Manage to a Plan More trust in delegation Better hiring vetting process with clear employment objectives and qualified candidates.", "rating": 5, "pros": "Great Benefits", "cons": "No clear career advancement", "advice": "More clear direction"}, {"title": "System administrator", "text": "Pros Free Coffee and nothing else Cons None, none and none and more none", "rating": 1, "pros": "Free Coffee and nothing else", "cons": "None, none and none and more none", "advice": null}, {"title": "Ok company", "text": "Pros Good benefits and work-life balance Cons Micro management and average pay Advice to Management Provide more growth opportunities and cross-functional learning", "rating": 3, "pros": "Good benefits and work-life balance", "cons": "Micro management and average pay", "advice": "Provide more growth opportunities and cross-functional learning"}, {"title": "Software Developer at Nasdaq", "text": "Pros Competitive yet great culture. Great leadership at the top and various levels of the organization. The technologies used/learned are excellent. Great benefits. Great compensation. Cons People tend to work lot more. Advice to Management Keep up the good work.", "rating": 5, "pros": "Competitive yet great culture.", "cons": "People tend to work lot more.", "advice": "Keep up the good work."}, {"title": "Tough place to succeed", "text": "Pros Smart people and good benefits Cons Narrow minded, micromanagement and want you to do their way despite them saying they want change. Advice to Management Get real. Come down from the Ivy tower.", "rating": 3, "pros": "Smart people and good benefits", "cons": "Narrow minded, micromanagement and want you to do their way despite them saying they want change.", "advice": "Get real. Come down from the Ivy tower."}, {"title": "Human Resources", "text": "Pros Thriving culture, innovative products and technology, recognized as a global leader Cons Fast paced- not for everyone, lacks career paths & succession planning Advice to Management Pay attention to resources you have", "rating": 5, "pros": "Thriving culture, innovative products and technology, recognized as a global leader", "cons": "Fast paced- not for everyone, lacks career paths & succession planning", "advice": "Pay attention to resources you have"}, {"title": "Account Executive", "text": "Pros Great Benefits and the name will make any sale easier Cons disconnect between upper management and sales org", "rating": 3, "pros": "Great Benefits and the name will make any sale easier", "cons": "disconnect between upper management and sales org", "advice": null}, {"title": "Austin Office lacks leadership", "text": "Pros -Big brand name to get doors open -Work with C-Level Execs at Fortune 500 companies is awesome! Loved that experience. -Great benefits and retirement package. They have a great 401k match and ESPP program. Cons The world has changed and NASDAQ is slowing trying to catch up. They just implemented Salesforce and got rid of Oracle Siebel. -Sales Managers in Austin were a joke. One got fired and the other one doesn't know how millennials work. -Sales team is expected to do all lead gen. Terrible marketing support that Sales Manager. -The NASDAQ brand only goes so far. You need more proof on why clients work with you and marketing support. Advice to Management -Ask current sales teams how they like working for their Sales Managers. -Implement 2017 sales tools. -Culture, culture, culture. Cut internal red tape, make it easier to close deals not harder. It's harder to close a deal internally than it is externally. -Allow redlines on contracts where acceptable.", "rating": 3, "pros": "-Big brand name to get doors open", "cons": "The world has changed and NASDAQ is slowing trying to catch up. They just implemented Salesforce and got rid of Oracle Siebel.", "advice": "-Ask current sales teams how they like working for their Sales Managers."}, {"title": "Product Manager", "text": "Pros Good team, nice people, good benefits Cons No work-life balance. Some managers don't have managerial skills.", "rating": 3, "pros": "Good team, nice people, good benefits", "cons": "No work-life balance. Some managers don't have managerial skills.", "advice": null}, {"title": "Sales Specialist", "text": "Pros Technology company with the best product in the market Cons Corporate sales structure was always changing Advice to Management Better alignment with sales operations and support", "rating": 3, "pros": "Technology company with the best product in the market", "cons": "Corporate sales structure was always changing", "advice": "Better alignment with sales operations and support"}, {"title": "1 Year at Nasdaq", "text": "Pros Community driven, and Catered meetings Cons Micro-management, no benefits for contractors", "rating": 3, "pros": "Community driven, and Catered meetings", "cons": "Micro-management, no benefits for contractors", "advice": null}, {"title": "Principal", "text": "Pros Provides a fair compensation package Cons Is a highly cost focused company Advice to Management Know your employees", "rating": 1, "pros": "Provides a fair compensation package", "cons": "Is a highly cost focused company", "advice": "Know your employees"}, {"title": "Analyst", "text": "Pros Very limited training, almost none, including initial when just hired. It seems like management is not very much interested in investing in their employees to help them achieve growth and bring more value to the company. I hope it will change with the new CEO. Also, some managers are are lacking leadership skills making it work environment unproductive and unpleasant. Little or bad communication between different teams within the company (which is basically connected with bad management). Cons Lots of very nice smart people working there. Unfortunately, a lot of them leave because they do not grow professionally over time. Great Nasdaq stock purchase plan option. Advice to Management Train your employees, invest in their grow and they will return more to the company, train managers to be leaders but not just check collectors.", "rating": 3, "pros": "Very limited training, almost none, including initial when just hired. It seems like management is not very much interested in investing in their employees to help them achieve growth and bring more value to the company. I hope it will change with the new CEO. Also, some managers are are lacking leadership skills making it work environment unproductive and unpleasant. Little or bad communication between different teams within the company (which is basically connected with bad management).", "cons": "Lots of very nice smart people working there. Unfortunately, a lot of them leave because they do not grow professionally over time. Great Nasdaq stock purchase plan option.", "advice": "Train your employees, invest in their grow and they will return more to the company, train managers to be leaders but not just check collectors."}, {"title": "Corporate Solutions", "text": "Pros Nasdaq has great benefits. Amazing work life balance. Cons Women get away with murder at this company. it is basically reverse sexism. Management is not smart and team leaders shouldn't be team leaders. Not a lot of opportunities to move within company. Advice to Management Maybe look down the ladder a little bit you will find people 10X smarter than the people in charge.", "rating": 3, "pros": "Nasdaq has great benefits. Amazing work life balance.", "cons": "Women get away with murder at this company. it is basically reverse sexism. Management is not smart and team leaders shouldn't be team leaders. Not a lot of opportunities to move within company.", "advice": "Maybe look down the ladder a little bit you will find people 10X smarter than the people in charge."}, {"title": "NA", "text": "Pros Overall great team and great organization to work. Cons Staffing changes can happen very quickly and frequently.", "rating": 3, "pros": "Overall great team and great organization to work.", "cons": "Staffing changes can happen very quickly and frequently.", "advice": null}, {"title": "great company", "text": "Pros leader in technology as a global company Cons There are no cons for this company", "rating": 5, "pros": "leader in technology as a global company", "cons": "There are no cons for this company", "advice": null}, {"title": "Stay away from their HR area", "text": "Pros you can make some good friends with colleagues because it's an \"us against them\" environment. Decent benefits and vesting if you can make it that long Cons Middle to upper management in for themselves only, will use you until you become any kind of threat to them. 90% of employees from 2015 are gone now, almost no one makes it more than three years there, very high pressure and expectations. Advice to Management Clean house with mid to upper management so the actual workers can do a good job instead of CYA and worrying about being replaced", "rating": 3, "pros": "you can make some good friends with colleagues because it's an \"us against them\" environment. Decent benefits and vesting if you can make it that long", "cons": "Middle to upper management in for themselves only, will use you until you become any kind of threat to them. 90% of employees from 2015 are gone now, almost no one makes it more than three years there, very high pressure and expectations.", "advice": "Clean house with mid to upper management so the actual workers can do a good job instead of CYA and worrying about being replaced"}, {"title": "Enterprise Account Manager", "text": "Pros Great people who work at Nasdaq, forward thinking, good communication from management, recognize and award success. Cons Very bureaucratic environment and disparate systems. Lack of accountability.", "rating": 5, "pros": "Great people who work at Nasdaq, forward thinking, good communication from management, recognize and award success.", "cons": "Very bureaucratic environment and disparate systems. Lack of accountability.", "advice": null}, {"title": "Great place but high stress levels", "text": "Pros Interesting projects in finance industry Many skilled employees Cons High stress levels Unclear requirements for job promotions", "rating": 5, "pros": "Interesting projects in finance industry", "cons": "High stress levels", "advice": null}, {"title": "Project Management Intern", "text": "Pros Great people - great profile - Great work to be done Cons Not a good place to work for work-life balance; since I didn't care about that - it was awesome!", "rating": 5, "pros": "Great people - great profile - Great work to be done", "cons": "Not a good place to work for work-life balance; since I didn't care about that - it was awesome!", "advice": null}, {"title": "Good but could be great", "text": "Pros Strong brand to help open doors for new business discussions Great value prop around innovation, integration and intelligence Knowledgeable leadership and supportive management Good pay, good benefits Cons Challenge to navigate internally with such a large company Multiple sales people contacting the same buyers can cause confusion/frustration Disconnected internal platforms cause inefficiencies with day-to-day work Hybrid role of hunter/farmer takes people away from what they do best Advice to Management Help us be more efficient and focused so we are better positioned to succeed.", "rating": 5, "pros": "Strong brand to help open doors for new business discussions", "cons": "Challenge to navigate internally with such a large company", "advice": "Help us be more efficient and focused so we are better positioned to succeed."}, {"title": "Good Company to work", "text": "Pros 401K, Medical, work from home (flexible), lot of opportunities to learn Cons No Appreciation from Upper Level Management Advice to Management Appreciate all employees and award them according to their work and achievements.", "rating": 3, "pros": "401K, Medical, work from home (flexible), lot of opportunities to learn", "cons": "No Appreciation from Upper Level Management", "advice": "Appreciate all employees and award them according to their work and achievements."}, {"title": "Corporate Solutions division - nepotism and unprofessional management", "text": "Pros Good benefits. Recognizable brand name. Some divisions have good salaries Cons Specific to corporate solutions, the best people are not rewarded. Managers don't all have management training, so if you are such with a bad one your life is miserable. There is no oversight. No 360 review of them. There was a culture, start from the top, of making fun of people who are different (probably why the lack of diversity in the workforce). Bob G, when he was there, in a company wide town hall made fun of books people had written as a segment of the town hall.", "rating": 3, "pros": "Good benefits. Recognizable brand name. Some divisions have good salaries", "cons": "Specific to corporate solutions, the best people are not rewarded. Managers don't all have management training, so if you are such with a bad one your life is miserable. There is no oversight. No 360 review of them. There was a culture, start from the top, of making fun of people who are different (probably why the lack of diversity in the workforce). Bob G, when he was there, in a company wide town hall made fun of books people had written as a segment of the town hall.", "advice": null}, {"title": "Intense and rewarding", "text": "Pros Leaderships honors and encourages entrepreneurialism, both within and outside your specific role. Strong sense of mission and significant efforts made to communicate across the company's locations and business units. Strong leadership in place with a genuine interest in employee retention. Cons Limited work/life balance, very intense place to work. Highly siloed and hierarchical structure which can lead to inefficiencies and frustration. Budgets are always tight, need to fight for funding which while frustrating leads to very purposeful spending. Advice to Management Difficult to save your way to growth, success in projects and initiatives is limited by resources/funding which can lead to unrealized potential. Keep focus on employee communication, has been effective in improving the internal culture.", "rating": 5, "pros": "Leaderships honors and encourages entrepreneurialism, both within and outside your specific role. Strong sense of mission and significant efforts made to communicate across the company's locations and business units. Strong leadership in place with a genuine interest in employee retention.", "cons": "Limited work/life balance, very intense place to work. Highly siloed and hierarchical structure which can lead to inefficiencies and frustration. Budgets are always tight, need to fight for funding which while frustrating leads to very purposeful spending.", "advice": "Difficult to save your way to growth, success in projects and initiatives is limited by resources/funding which can lead to unrealized potential. Keep focus on employee communication, has been effective in improving the internal culture."}, {"title": "I worked in Corporate Solutions", "text": "Pros Great compensation and high quality devices, equipment and software. Generous annual bonus. Good people and solid teamwork environment. Cons Management was a mess. Many of the higher ups left or were asked to leave after an acquisition. I think I had 4 different managers in less than a year because of restructuring and team changes. I had one manager who had no idea what I did or how I did it. The best people to work with got smart and found other jobs, including me. Long work hours expected. No clear career path options. Lots of office politics. Advice to Management Figure it out and get some stability", "rating": 3, "pros": "Great compensation and high quality devices, equipment and software. Generous annual bonus. Good people and solid teamwork environment.", "cons": "Management was a mess. Many of the higher ups left or were asked to leave after an acquisition. I think I had 4 different managers in less than a year because of restructuring and team changes. I had one manager who had no idea what I did or how I did it. The best people to work with got smart and found other jobs, including me. Long work hours expected. No clear career path options. Lots of office politics.", "advice": "Figure it out and get some stability"}, {"title": "Some good, some bad", "text": "Pros They have great benefits I was give a lot of flexibility Cons Failure to learn from mistakes Management short-sighted Advice to Management Move from ready-fire-aim to more of a ready-aim-fire mentality. Aiming (planning, looking at the long term) is important but seemingly lacking.", "rating": 3, "pros": "They have great benefits", "cons": "Failure to learn from mistakes", "advice": "Move from ready-fire-aim to more of a ready-aim-fire mentality. Aiming (planning, looking at the long term) is important but seemingly lacking."}, {"title": "Sales", "text": "Pros Incredible technology and vision for future for growth Cons Lack of career advancement", "rating": 5, "pros": "Incredible technology and vision for future for growth", "cons": "Lack of career advancement", "advice": null}, {"title": "Balance between traditional finance and FinTech", "text": "Pros - global opportunities and willingness to support location changes - success with market technology products for other exchanges - improving support for career advancement and internal movement Cons - work life balance with support for global clients Advice to Management - Articulate long term mission and purpose to employees. Build on original charter - one of the first electronic exchanges - invest efforts for the long term. - Stay away from M&A deals that don't fit the strategy", "rating": 5, "pros": "- global opportunities and willingness to support location changes", "cons": "- work life balance with support for global clients", "advice": "- Articulate long term mission and purpose to employees."}, {"title": "Not For Seasoned, Professional Sales People", "text": "Pros Very comprehensive healthcare plan and other benefits. Cons Cold-calling culture. CRM is awful, as are most company systems. Lots of time-wasting processes. Almost zero tolerance for clients to make contract language edits.", "rating": 1, "pros": "Very comprehensive healthcare plan and other benefits.", "cons": "Cold-calling culture.", "advice": null}, {"title": "Senior financial analyst", "text": "Pros Very good work life balance Cons Low salary, few growth opportunities Advice to Management More opportunities for career growth", "rating": 3, "pros": "Very good work life balance", "cons": "Low salary, few growth opportunities", "advice": "More opportunities for career growth"}, {"title": "Coordinator", "text": "Pros benefits, fun place to work, co workers, laughter, eating, drinking, dancing, high salary! managment listen to you Cons no cons this place is awesome to work at you will not be dissappointed theyre everything a person could want to be for employer Advice to Management keep up the good work! I wish all companies were like you", "rating": 5, "pros": "benefits, fun place to work, co workers, laughter, eating, drinking, dancing, high salary! managment listen to you", "cons": "no cons this place is awesome to work at you will not be dissappointed theyre everything a person could want to be for employer", "advice": "keep up the good work! I wish all companies were like you"}, {"title": "Not All Departments Are Created Equally.", "text": "Pros 6% 1:1 401k. 10% Salary ESPP @ 15% discount. Cons Regardless of the fact that many technology departments work together and are required to have overlapping skill sets, Nasdaq would rather retain only individuals they deem necessary to their bottom line or have big mouths. Junior/entry level hires are better off looking elsewhere for similar compensation while actually being allowed to have a life outside of work. Management expects you to work to meet deadlines without any initial input from employees about the fairness or even possibility of attaining such a deadline. Advice to Management Retaining employees should not revolve around their title. The learning curve for many technology departments is steep regardless of title/position and when a single individual leaves management is slow to replace them. This leads to a greatly skewed work-life balance that is unfair to entry level/junior team members who are not compensated like senior members but expected to pick up a portion of the slack anyway. The result is a constant churn of entry/junior level positions every 2-3 years where a department needs to finally reach critically low levels of resources before management sees it as a problem.", "rating": 1, "pros": "6% 1:1 401k. 10% Salary ESPP @ 15% discount.", "cons": "Regardless of the fact that many technology departments work together and are required to have overlapping skill sets, Nasdaq would rather retain only individuals they deem necessary to their bottom line or have big mouths. Junior/entry level hires are better off looking elsewhere for similar compensation while actually being allowed to have a life outside of work. Management expects you to work to meet deadlines without any initial input from employees about the fairness or even possibility of attaining such a deadline.", "advice": "Retaining employees should not revolve around their title. The learning curve for many technology departments is steep regardless of title/position and when a single individual leaves management is slow to replace them. This leads to a greatly skewed work-life balance that is unfair to entry level/junior team members who are not compensated like senior members but expected to pick up a portion of the slack anyway. The result is a constant churn of entry/junior level positions every 2-3 years where a department needs to finally reach critically low levels of resources before management sees it as a problem."}, {"title": "Good company", "text": "Pros Good company with clear guidelines Cons Very US centric could be sometime difficult to deal with", "rating": 5, "pros": "Good company with clear guidelines", "cons": "Very US centric could be sometime difficult to deal with", "advice": null}, {"title": "Great Team Environment", "text": "Pros Great team(s). Rewarding work. Great benefits. Cons Often overworked. Hard to earn a promotion. Advice to Management Try to tap into individual skill sets and spread responsibility. Compensate those who are willing to take on more responsibility.", "rating": 5, "pros": "Great team(s). Rewarding work. Great benefits.", "cons": "Often overworked. Hard to earn a promotion.", "advice": "Try to tap into individual skill sets and spread responsibility. Compensate those who are willing to take on more responsibility."}, {"title": "Analyst", "text": "Pros Growing company with a lot of opportunity Cons Company has been purchased by NASDAQ", "rating": 5, "pros": "Growing company with a lot of opportunity", "cons": "Company has been purchased by NASDAQ", "advice": null}, {"title": "Need to move into the 21st Century", "text": "Pros Successful company with smart Senior Leadership. Lots of potential (if you are given the chance) pay is decent and great health benefits. Hire good people. Solid successful company. Spends money wisely if not a bit too frugally. Cons Doesn't have the infrastructure in place to support their continued growth. Working on it but not there yet. Doggy dog \"old school hierarchical culture \". Highly competitive-don't encourage team work there is a lot of \"I\" and not enough \"we\". Most of the. VP group ( EVP, AVP, SVP AND VP) always looking to point out each other's deficiencies or their departments perceived errors or mistakes. Runs too lean and proud of it. Everything in writing to cover themselves. Too much paperwork and back and forth to get things done. Advice to Management Come down from the ivory tower and get real. Put aside your competitiveness between departments. Allow the talented people you hire to do their jobs. Stop spinning our wheels. Also, have a less impersonal onboardimg process. Streamline processes for your shared services team., stop offshoring jobs, hire your contractors as employees. Give more time off.", "rating": 3, "pros": "Successful company with smart Senior Leadership. Lots of potential (if you are given the chance) pay is decent and great health benefits. Hire good people. Solid successful company. Spends money wisely if not a bit too frugally.", "cons": "Doesn't have the infrastructure in place to support their continued growth. Working on it but not there yet. Doggy dog \"old school hierarchical culture \". Highly competitive-don't encourage team work there is a lot of \"I\" and not enough \"we\". Most of the. VP group ( EVP, AVP, SVP AND VP) always looking to point out each other's deficiencies or their departments perceived errors or mistakes. Runs too lean and proud of it. Everything in writing to cover themselves. Too much paperwork and back and forth to get things done.", "advice": "Come down from the ivory tower and get real. Put aside your competitiveness between departments. Allow the talented people you hire to do their jobs. Stop spinning our wheels. Also, have a less impersonal onboardimg process. Streamline processes for your shared services team., stop offshoring jobs, hire your contractors as employees. Give more time off."}, {"title": "Great place to work but...", "text": "Pros Great benefits, competitive salaries, good corporate atmosphere Cons difficult to move within the company if you aren't upper management already. Advice to Management help push for promotions at lower levels of the corporate ladder for deserving employees", "rating": 5, "pros": "Great benefits, competitive salaries, good corporate atmosphere", "cons": "difficult to move within the company if you aren't upper management already.", "advice": "help push for promotions at lower levels of the corporate ladder for deserving employees"}, {"title": "Experience depends on team", "text": "Pros Great teams and good benefits Cons Cross functional collaboration is difficult to see Advice to Management Need to be forward thinking", "rating": 3, "pros": "Great teams and good benefits", "cons": "Cross functional collaboration is difficult to see", "advice": "Need to be forward thinking"}, {"title": "Acquisition Phase", "text": "Pros The benefits are sufficient and well rounded; there is also a tenure system, diversity of job roles is generally good as it is a diverse exchange/tech company, stock price is managed very well and employees get equity share Cons There is a systemic lack of growth as Nasdaq is still in the acquisition phase so there are a glut of mid-upper management and not enough workers so the trend is to decrease promotions rather than increase. There are also no real internal growth intentions except NFX (futures) which is highly underfunded and not yet profitable. Advice to Management Not sure. I think you just have to wait out this season and look for more internal growth abilities. Probably make better decisions in the M&A department (e.g. eSpeed).", "rating": 3, "pros": "The benefits are sufficient and well rounded; there is also a tenure system, diversity of job roles is generally good as it is a diverse exchange/tech company, stock price is managed very well and employees get equity share", "cons": "There is a systemic lack of growth as Nasdaq is still in the acquisition phase so there are a glut of mid-upper management and not enough workers so the trend is to decrease promotions rather than increase. There are also no real internal growth intentions except NFX (futures) which is highly underfunded and not yet profitable.", "advice": "Not sure. I think you just have to wait out this season and look for more internal growth abilities. Probably make better decisions in the M&A department (e.g. eSpeed)."}, {"title": "Intern", "text": "Pros Creative projects, given a lot of responsibility, great company culture and many interns to socialize and spend time with, given over-time, want you to enjoy summer and appreciate work-life balance. Opportunities to interact with C-level employees Cons No housing stipend provided, no automatic job offer at the end of program for most departments", "rating": 5, "pros": "Creative projects, given a lot of responsibility, great company culture and many interns to socialize and spend time with, given over-time, want you to enjoy summer and appreciate work-life balance. Opportunities to interact with C-level employees", "cons": "No housing stipend provided, no automatic job offer at the end of program for most departments", "advice": null}, {"title": "Overall great place to work", "text": "Pros The company offers a great dynamic and global environment with a great opportunity to grow. Good overall compensation and benefits package. Cons At times projects are very slow and it takes a lot of effort to get things done.", "rating": 5, "pros": "The company offers a great dynamic and global environment with a great opportunity to grow. Good overall compensation and benefits package.", "cons": "At times projects are very slow and it takes a lot of effort to get things done.", "advice": null}, {"title": "FP&A Specialist", "text": "Pros Great work hours, work from home is an option. Cons Overall i have had positive experience. Some of the managers and HR people can be difficult to work with , but thats in every company", "rating": 5, "pros": "Great work hours, work from home is an option.", "cons": "Overall i have had positive experience. Some of the managers and HR people can be difficult to work with , but thats in every company", "advice": null}, {"title": "Nasdaq", "text": "Pros International Company with a lot of talented employees Cons Offices in Major Cities in the United States Only", "rating": 5, "pros": "International Company with a lot of talented employees", "cons": "Offices in Major Cities in the United States Only", "advice": null}, {"title": "Lean Lean Lean", "text": "Pros Flat organizational structure with lots of responsibility. If you're an entrepreneur there are plenty of opportunities to take the bull by the horns and make of it what you will. Anyone expecting opportunities on a silver platter however need not apply. Cons Compensation is misaligned. There are rather severe dislocations in salary across the division as well as with subordinates making more than some managers despite less experience, track record, or responsibility. Sad. Advice to Management Correct the inequities between talent. There was a recent claim from the CEO that progression and promotion is based on merit. Maybe that is the case going forward, but that does not fix the existing dislocations.", "rating": 5, "pros": "Flat organizational structure with lots of responsibility. If you're an entrepreneur there are plenty of opportunities to take the bull by the horns and make of it what you will. Anyone expecting opportunities on a silver platter however need not apply.", "cons": "Compensation is misaligned. There are rather severe dislocations in salary across the division as well as with subordinates making more than some managers despite less experience, track record, or responsibility. Sad.", "advice": "Correct the inequities between talent. There was a recent claim from the CEO that progression and promotion is based on merit. Maybe that is the case going forward, but that does not fix the existing dislocations."}, {"title": "Pros and Cons ...", "text": "Pros Decent pay, great benefits, culture is decent-to-not-so-great. Really depends on which department/division you are in, as well as your reporting line. Cons Shifting priorities at division senior management level. Manipulation of bonus goals during the year. Few professional growth or development opportunities if you are not in a major hub office. Advice to Management Provide more tactical clarity to middle management and line employees. Once the bonus goals are set, keep them locked for the duration of the year OR communicate the changes immediately to all affected employees. Have a plan for growth for key team members.", "rating": 3, "pros": "Decent pay, great benefits, culture is decent-to-not-so-great. Really depends on which department/division you are in, as well as your reporting line.", "cons": "Shifting priorities at division senior management level. Manipulation of bonus goals during the year. Few professional growth or development opportunities if you are not in a major hub office.", "advice": "Provide more tactical clarity to middle management and line employees. Once the bonus goals are set, keep them locked for the duration of the year OR communicate the changes immediately to all affected employees. Have a plan for growth for key team members."}, {"title": "Product Specialist", "text": "Pros The people I worked with were excellent. Some very intelligent people with tremendous skill. Cons Management was self serving and lacked focus. They did not trust their staff. Advice to Management Respect people", "rating": 3, "pros": "The people I worked with were excellent. Some very intelligent people with tremendous skill.", "cons": "Management was self serving and lacked focus. They did not trust their staff.", "advice": "Respect people"}, {"title": "Getting there", "text": "Pros The management in the Chicago office works so hard to support their teams through a very difficult acquisition. People in the office are what make the organization. They are hardworking and friendly. Cons Everyone is spread too thin. Their processes are not streamlined and it takes the focus away from selling. Industry is dying and the market is oversaturated. They need to understand what their competitors are doing and get ahead of the game. Marketing, marketing, marketing. The upper management is very out of touch with the day to day problems. Advice to Management Understand the day to day issues and fix it. It should be the number priority. This will shift the focus back to selling!", "rating": 3, "pros": "The management in the Chicago office works so hard to support their teams through a very difficult acquisition. People in the office are what make the organization. They are hardworking and friendly.", "cons": "Everyone is spread too thin. Their processes are not streamlined and it takes the focus away from selling. Industry is dying and the market is oversaturated. They need to understand what their competitors are doing and get ahead of the game. Marketing, marketing, marketing. The upper management is very out of touch with the day to day problems.", "advice": "Understand the day to day issues and fix it. It should be the number priority. This will shift the focus back to selling!"}, {"title": "General Review", "text": "Pros Company is very good work enviornment. and help full management. Cons I am not seeing any Cons till now. and i think everything is perfect for a good work enviornment.", "rating": 5, "pros": "Company is very good work enviornment. and help full management.", "cons": "I am not seeing any Cons till now. and i think everything is perfect for a good work enviornment.", "advice": null}, {"title": "Now Thomson", "text": "Pros NASDAQ has good employee benefits including stock and option grants although those are heavily tilted to senior management. Cons NASDAQ acquired Thomson's IR unit in 2013. NASDAQ pretty much turned over its entire corporate solutions group and culture to the Thomson people, and gave and continues to give opportunities and advancement to the Thomson alum. Meanwhile the core IR unit has consistently seen revenues and product quality decline - this is masked in earnings reports by NASDAQ's acquisition of other companies in the space and allocation of those revenue to the market technology/corporate solutions unit. Advice to Management Good luck with that.", "rating": 3, "pros": "NASDAQ has good employee benefits including stock and option grants although those are heavily tilted to senior management.", "cons": "NASDAQ acquired Thomson's IR unit in 2013. NASDAQ pretty much turned over its entire corporate solutions group and culture to the Thomson people, and gave and continues to give opportunities and advancement to the Thomson alum. Meanwhile the core IR unit has consistently seen revenues and product quality decline - this is masked in earnings reports by NASDAQ's acquisition of other companies in the space and allocation of those revenue to the market technology/corporate solutions unit.", "advice": "Good luck with that."}, {"title": "Great Company", "text": "Pros Collaborative environment that offers opportunities to grow in the company. As a financial intermediary, you frequently gain exposure to customers that interact with Nasdaq. Leadership relies on everyone to deliver results and listens when you have value-add intelligence/ideas. Cons Many of the business lines are in the mature stage of development and are no longer growing. Organic growth is difficult and as a result you are seeing consolidation within the exchange space. Advice to Management Hire talented people that can help grow the business via new ideas and efficiency. Get rid of the employees who are not driven that drag the organization down.", "rating": 5, "pros": "Collaborative environment that offers opportunities to grow in the company. As a financial intermediary, you frequently gain exposure to customers that interact with Nasdaq. Leadership relies on everyone to deliver results and listens when you have value-add intelligence/ideas.", "cons": "Many of the business lines are in the mature stage of development and are no longer growing. Organic growth is difficult and as a result you are seeing consolidation within the exchange space.", "advice": "Hire talented people that can help grow the business via new ideas and efficiency. Get rid of the employees who are not driven that drag the organization down."}, {"title": "Nasdaq", "text": "Pros Friendly people, interesting work and a decent salary Cons The systems used are archaic and painful", "rating": 5, "pros": "Friendly people, interesting work and a decent salary", "cons": "The systems used are archaic and painful", "advice": null}, {"title": "Great Place to Work", "text": "Pros Strong leadership, high quality team, great benefits, flexible. Cons Opportunities for advancement can be limited for certain roles", "rating": 5, "pros": "Strong leadership, high quality team, great benefits, flexible.", "cons": "Opportunities for advancement can be limited for certain roles", "advice": null}, {"title": "Webcast/ Multimedia Producer", "text": "Pros Decent benefits, good people to work with Cons Middle management is fairly weak. I cannot speak speak for all departments but primarily in the multimedia/webcast departments, management really had no clue how to oversee people. Their technical skills may have been solid but leading people not a strength.", "rating": 3, "pros": "Decent benefits, good people to work with", "cons": "Middle management is fairly weak. I cannot speak speak for all departments but primarily in the multimedia/webcast departments, management really had no clue how to oversee people. Their technical skills may have been solid but leading people not a strength.", "advice": null}, {"title": "Accounts Manager", "text": "Pros exposure to high tech operational systems Cons Overtime without pay was not acceptable, but expected at this Company under Senior Management in Accounting Department. Advice to Management Allow employees to grow in the position they have been hired to perform. Trust what you saw when interviewed them and their skillset once work ethics have been established.", "rating": 5, "pros": "exposure to high tech operational systems", "cons": "Overtime without pay was not acceptable, but expected at this Company under Senior Management in Accounting Department.", "advice": "Allow employees to grow in the position they have been hired to perform. Trust what you saw when interviewed them and their skillset once work ethics have been established."}, {"title": "Information Security Specialist", "text": "Pros The company pays well and hires the best. Cons Unfortunately their was a political take over of the Information Security group by the head of audit and over half the employees either left or were laid off. They will screw you out of your stock options before vesting so watch out. Advice to Management Try and follow some sort of standard. The program was ad hoc. Don't alienate good people by making the place so political.", "rating": 3, "pros": "The company pays well and hires the best.", "cons": "Unfortunately their was a political take over of the Information Security group by the head of audit and over half the employees either left or were laid off. They will screw you out of your stock options before vesting so watch out.", "advice": "Try and follow some sort of standard. The program was ad hoc. Don't alienate good people by making the place so political."}, {"title": "Product Management", "text": "Pros Most people work hard to achieve the goals. Cons Not so good work life balance", "rating": 3, "pros": "Most people work hard to achieve the goals.", "cons": "Not so good work life balance", "advice": null}, {"title": "Shockingly bad", "text": "Pros Brand name, good bonuses. Able to take 6am calls from home. Cons No culture. Old technology. Terrible senior/middle management. Terrible products. Shaky acquisitions. Zero innovation. Offshoring everything to India. Little concept of product development, basic budgeting, or rudimentary technology concepts. Entire company is inundated with endless amounts of red tape and paperwork after their Facebook debacle. (all while supposedly switching to Agile Development?) It was like being sent back in-time to 1990. Their new \"next gen\" product IR Insight is a complete disaster thanks to the leadership on the project. They spent 3 years and millions of dollars to have a legacy team, build a legacy product, with legacy technology. Nobody is held accountable because the former Reuters employees cover for each other. This is a stock-exchange, pretending to be a regular company, pretending to be a technology company. Advice to Management \"Know thyself\"", "rating": 1, "pros": "Brand name, good bonuses. Able to take 6am calls from home.", "cons": "No culture. Old technology. Terrible senior/middle management. Terrible products. Shaky acquisitions. Zero innovation. Offshoring everything to India. Little concept of product development, basic budgeting, or rudimentary technology concepts.", "advice": "\"Know thyself\""}, {"title": "Talent Management Specialist", "text": "Pros Global Exposure, Growth Opportunity, Diversity, Cross Functional team collaboration. Cons None that I can think of at present", "rating": 5, "pros": "Global Exposure, Growth Opportunity, Diversity, Cross Functional team collaboration.", "cons": "None that I can think of at present", "advice": null}, {"title": "Horrible company morale and limited career growth", "text": "Pros If you can stay there more than 4 years, you get some really good stock benefits. Also, they match 6% 401k which is really good. Cons - Nasdaq is a place for people in leadership roles (VP, SVP, CEO etc). \"Regular\" employees are replaceable... and you know it. - Not a lot of investment into the employee (day-to-day perks vs. long term retirement perks) - People work at Nasdaq to build their resume and get a better job somewhere else. Company morale is low because of this. No one actually likes being there (unless you are VP, SVP or higher) but the stock perks are good after 4 years so most people stay for convenience - Workflow process changes quarterly - Company direction and goals seem to change quarterly Advice to Management \"Because that's the way Nasdaq has always done it\" is never the right answer. Be open to change, you're falling behind.", "rating": 1, "pros": "If you can stay there more than 4 years, you get some really good stock benefits. Also, they match 6% 401k which is really good.", "cons": "- Nasdaq is a place for people in leadership roles (VP, SVP, CEO etc). \"Regular\" employees are replaceable... and you know it.", "advice": "\"Because that's the way Nasdaq has always done it\" is never the right answer. Be open to change, you're falling behind."}, {"title": "Nice Place", "text": "Pros Great people to work with Great location Cons Not much parking although close to public transi", "rating": 5, "pros": "Great people to work with", "cons": "Not much parking although close to public transi", "advice": null}, {"title": "Stay away", "text": "Pros The CEO is great and holds things together. But when he leaves.... Cons The legal department -- the GC/CRO but especially his main group leader VPs -- are beyond terrible. Unethical lawyers, epically bad managers, and even worse people. Some of the most un-selfaware, tone deaf, clueless individuals you will ever meet. It really is an embarrassment.The President and COO, about to take over for the CEO, will run the company into the ground. Everything is personal, completely unprofessional. EVP for Information Services has zero clue what he is doing. Terrible hire. Get out or stay away! Advice to Management Form over substance is no way to run a company. The legal department is a cesspool. Some of he worst people you will ever meet.", "rating": 1, "pros": "The CEO is great and holds things together. But when he leaves....", "cons": "The legal department -- the GC/CRO but especially his main group leader VPs -- are beyond terrible. Unethical lawyers, epically bad managers, and even worse people. Some of the most un-selfaware, tone deaf, clueless individuals you will ever meet. It really is an embarrassment.The President and COO, about to take over for the CEO, will run the company into the ground. Everything is personal, completely unprofessional. EVP for Information Services has zero clue what he is doing. Terrible hire. Get out or stay away!", "advice": "Form over substance is no way to run a company. The legal department is a cesspool. Some of he worst people you will ever meet."}, {"title": "Decent company", "text": "Pros Centrally located. Brand recognition in financial markets. Cons Not a green company; saw no indication of concern for environment. Few people of other ethnic persuasions.", "rating": 5, "pros": "Centrally located.", "cons": "Not a green company; saw no indication of concern for environment.", "advice": null}, {"title": "Index Administration Analyst", "text": "Pros Great benefits, one of the better 401(k) plans I have seen. Plenty of vacation and personal time every year. very friendly people, understanding management Cons Not a lot of opportunity for growth. Many positions have recently been outsourced overseas. Thin coverage in some departments leads to overworked employees at busy times during the year. Advice to Management Overall, I would say they are doing a good job in general. I would like to see jobs staying in the United states, but I understand the reasons of sending some positions to India and other countries.", "rating": 5, "pros": "Great benefits, one of the better 401(k) plans I have seen. Plenty of vacation and personal time every year. very friendly people, understanding management", "cons": "Not a lot of opportunity for growth. Many positions have recently been outsourced overseas. Thin coverage in some departments leads to overworked employees at busy times during the year.", "advice": "Overall, I would say they are doing a good job in general. I would like to see jobs staying in the United states, but I understand the reasons of sending some positions to India and other countries."}, {"title": "Great company", "text": "Pros Friendly work environment Friendly coworkers Panels with executives Accessible higher management Good compensation Cons Corporate work culture could be boring Tasks not too challenging Not enough intern bonding activities that's about it Advice to Management Interns should be assigned more challenging tasks", "rating": 5, "pros": "Friendly work environment", "cons": "Corporate work culture could be boring", "advice": "Interns should be assigned more challenging tasks"}, {"title": "Terrible management ruins great Company", "text": "Pros 1) Good Benefits 2) Brand Awareness/Global Company Cons 1) No career growth/advancement - Extremely difficult to move up within the company 2) Senior Management in Legal Group only looks up and does not care about employees below - Many employees are overworked, micro-managed, and work in fear/intimidation 3) Mid-Level Management has no authority and looks to Senior Management for approval on almost everything 4) HR is powerless - When issues are escalated, actions are rarely taken to address them properly and effectively. HR appears to have one of the highest turn-over rate (evidence that HR reps are not happy either) Advice to Management 1) Implement manager review process - create an outlet where employees can identify bad managers, provide incentive/feedback to improve management/leadership in order to retain talent and create positive firm culture 2) Create more opportunities for employees to grow/get promoted within the firm. 3) Create more effective and transparent escalation process by HR and management in order to address/resolve issues that impact firm culture/morale", "rating": 1, "pros": "1) Good Benefits", "cons": "1) No career growth/advancement - Extremely difficult to move up within the company", "advice": "1) Implement manager review process - create an outlet where employees can identify bad managers, provide incentive/feedback to improve management/leadership in order to retain talent and create positive firm culture"}, {"title": "great company", "text": "Pros big famous company, not hard work Cons salary a little bit low, hope could be better", "rating": 5, "pros": "big famous company, not hard work", "cons": "salary a little bit low, hope could be better", "advice": null}, {"title": "Sr. System Consultant", "text": "Pros Opportunity to work with very talented people in their respective fields as well as learning/working with new technologies. Cons None in my working area", "rating": 5, "pros": "Opportunity to work with very talented people in their respective fields as well as learning/working with new technologies.", "cons": "None in my working area", "advice": null}, {"title": "Great Place to Work", "text": "Pros Always learning, fast-paced, challenging, smart people and meritocracy Cons Not everyone can keep up, but if you can, it's a great place", "rating": 5, "pros": "Always learning, fast-paced, challenging, smart people and meritocracy", "cons": "Not everyone can keep up, but if you can, it's a great place", "advice": null}, {"title": "CEO", "text": "Pros Awesome place to work everyday and night Cons No good for peanuts and applause Advice to Management Quit", "rating": 5, "pros": "Awesome place to work everyday and night", "cons": "No good for peanuts and applause", "advice": "Quit"}, {"title": "Awful, Terrible Place", "text": "Pros Decent location with good bars to forget that you actually work there. Cons Honestly, the absolute worst place I ever worked. They act like you should just be grateful to work there simply because of the company name. Employees are disposable, not respected and are not trusted to do what they were hired to do. HR is managed by a puppet master who manipulates senior executives. Advice to Management Get rid of management altogether and start over. There are some great employees who are brilliant people and \"work horses,\" but too many incompetent senior leaders who use them as pawns.", "rating": 1, "pros": "Decent location with good bars to forget that you actually work there.", "cons": "Honestly, the absolute worst place I ever worked. They act like you should just be grateful to work there simply because of the company name. Employees are disposable, not respected and are not trusted to do what they were hired to do. HR is managed by a puppet master who manipulates senior executives.", "advice": "Get rid of management altogether and start over. There are some great employees who are brilliant people and \"work horses,\" but too many incompetent senior leaders who use them as pawns."}, {"title": "A decent place to work", "text": "Pros Great company, great people, great vision, great mission. Cons Not a lot of room for opportunity to grow. Advice to Management Create room for non-management employees to grow, and expand. Bell-curve performance evaluation needs to be removed from company.", "rating": 3, "pros": "Great company, great people, great vision, great mission.", "cons": "Not a lot of room for opportunity to grow.", "advice": "Create room for non-management employees to grow, and expand. Bell-curve performance evaluation needs to be removed from company."}, {"title": "Nasdaq MarketSite & Corp Client Group (CCG)", "text": "Pros Bonus is directly tied to business goals. During a good year, bonus can be over-achieved. Cons This particular business unit and location within Nasdaq is extremely disorganized and contentious. Everyone is out for themselves. Not a team environment. Management ignores formal complaints of employees and shows little respect or gratitude for staff. Low morale. understaffed, overwhelming workload. The physical environment of MarketSite is horrible - no windows, no privacy. Generally, the staff show a lack of respect and lack of professionalism shown to colleagues. Advice to Management Address the concerns of the staff. In my position, I work cross-functionally with other business groups within Nasdaq. I can say that other businesses are not so difficult to work with and people are much more collaborative and respectful of one another. Even other offices within CCG are much better to work with. The people in the San Francisco, Stockholm and London offices are a pleasure to work with.", "rating": 1, "pros": "Bonus is directly tied to business goals. During a good year, bonus can be over-achieved.", "cons": "This particular business unit and location within Nasdaq is extremely disorganized and contentious. Everyone is out for themselves. Not a team environment. Management ignores formal complaints of employees and shows little respect or gratitude for staff. Low morale. understaffed, overwhelming workload.", "advice": "Address the concerns of the staff. In my position, I work cross-functionally with other business groups within Nasdaq. I can say that other businesses are not so difficult to work with and people are much more collaborative and respectful of one another. Even other offices within CCG are much better to work with. The people in the San Francisco, Stockholm and London offices are a pleasure to work with."}, {"title": "Summer Intern", "text": "Pros Nice people, interesting projects, management is always willing to help Cons internship program relatively new, not very organized", "rating": 3, "pros": "Nice people, interesting projects, management is always willing to help", "cons": "internship program relatively new, not very organized", "advice": null}, {"title": "Senior Management Consultant", "text": "Pros Corporate pride. Compensation. Fast-paced environment. The technology is leading edge. Saying you work for Nasdaq typically is impressive to friends, colleagues and prospective employers. If you enjoy technology and working under pressure for high rewards, Nasdaq is a good place for you. Cons Depending on the unit, a lot of micro management takes place. Not much empowerment. Current management has surrounded themselves with mostly \"Yes\" men and women. You are told all ideas are welcome and people are free to speak up, but saying something negative can put you in the penalty box for a long time. Advice to Management You pay middle management and senior managers a lot of money. They have a lot of knowledge and expertise. You should listen to them.", "rating": 5, "pros": "Corporate pride. Compensation. Fast-paced environment. The technology is leading edge. Saying you work for Nasdaq typically is impressive to friends, colleagues and prospective employers. If you enjoy technology and working under pressure for high rewards, Nasdaq is a good place for you.", "cons": "Depending on the unit, a lot of micro management takes place. Not much empowerment. Current management has surrounded themselves with mostly \"Yes\" men and women. You are told all ideas are welcome and people are free to speak up, but saying something negative can put you in the penalty box for a long time.", "advice": "You pay middle management and senior managers a lot of money. They have a lot of knowledge and expertise. You should listen to them."}, {"title": "Moves at a breakneck pace", "text": "Pros Great fast moving, innovative financial services company. Opportunities to learn and grow. Cons has a short attention span and priorities shift regularly. Need to be flexible to work here. Advice to Management put in place a structured portfolio management process that spans the organization.", "rating": 5, "pros": "Great fast moving, innovative financial services company. Opportunities to learn and grow.", "cons": "has a short attention span and priorities shift regularly. Need to be flexible to work here.", "advice": "put in place a structured portfolio management process that spans the organization."}, {"title": "so so", "text": "Pros you will make good money Cons zero job satisfaction and long hours.", "rating": 1, "pros": "you will make good money", "cons": "zero job satisfaction and long hours.", "advice": null}, {"title": "Lead", "text": "Pros Takes care of you overall Cons Doesn't comp well for what you bring in", "rating": 5, "pros": "Takes care of you overall", "cons": "Doesn't comp well for what you bring in", "advice": null}, {"title": "Entry Level", "text": "Pros Good Benefits and Various locations Cons Management does not care for the well being of their employees Advice to Management Take time to look who your managers are.", "rating": 3, "pros": "Good Benefits and Various locations", "cons": "Management does not care for the well being of their employees", "advice": "Take time to look who your managers are."}, {"title": "Abysmal experience, terrible for people of color", "text": "Pros The pay and healthcare was solid. Cons Horrible environment. Debaucherous happy hour lovers who would rather spend their time insulting coworkers than creating a happy place to work. Devoid of any semblance of a positive culture. Advice to Management Change EVERYTHING about the company.", "rating": 1, "pros": "The pay and healthcare was solid.", "cons": "Horrible environment. Debaucherous happy hour lovers who would rather spend their time insulting coworkers than creating a happy place to work. Devoid of any semblance of a positive culture.", "advice": "Change EVERYTHING about the company."}, {"title": "A case study for how not to manage a company", "text": "Pros Has a good 401K match. Has a nice ESPP. The benefits are pretty good. The work is not that hard and since there is no incentive to outperform, there is no reason to stay late at night or work the weekends. The associates and non management workers tend to be intelligent and hard working, but they leave after 2-3 years. Cons The opposite of an entrepreneurial firm. Management is deathly afraid of making a wrong decision, so every baby step forward has to go through committees and analysis. The company is also keen on diversity in senior management. So if you are incompetent but check a diversity box, this could be the perfect place for you. Advice to Management Change the culture and compensation so that management does not have a vested interest in keeping everything status quo. It might also help by replacing a lot of the dead wood masquerading as management.", "rating": 3, "pros": "Has a good 401K match. Has a nice ESPP. The benefits are pretty good. The work is not that hard and since there is no incentive to outperform, there is no reason to stay late at night or work the weekends. The associates and non management workers tend to be intelligent and hard working, but they leave after 2-3 years.", "cons": "The opposite of an entrepreneurial firm. Management is deathly afraid of making a wrong decision, so every baby step forward has to go through committees and analysis. The company is also keen on diversity in senior management. So if you are incompetent but check a diversity box, this could be the perfect place for you.", "advice": "Change the culture and compensation so that management does not have a vested interest in keeping everything status quo."}, {"title": "Confused Management", "text": "Pros Great work/life balance and pay is OK. There are some opportunities for career growth depending on the group you are in. Cons Management continues to react rather than lead/innovate. This causes misdirection and many changes in short/long term vision. Also, impacts employee moral. Advice to Management Talk to employees and involve them in your thought process.", "rating": 3, "pros": "Great work/life balance and pay is OK. There are some opportunities for career growth depending on the group you are in.", "cons": "Management continues to react rather than lead/innovate. This causes misdirection and many changes in short/long term vision. Also, impacts employee moral.", "advice": "Talk to employees and involve them in your thought process."}, {"title": "All Politics. Talented People Often Overlooked", "text": "Pros Good benefits and interesting work. Cons The most political and non diverse culture. It's like a club where the only people that get ahead are those that play politics, know someone, or that the CEO personally likes (mainly men or women that act like men). A lot of dead weight and untalented people. Many unprofessional people. Advice to Management Shake things up. Get rid of deadweight. Recognize people for their talent and hardwork. Stop protecting and promoting people that don't add value or that should have been goon a long time ago.", "rating": 3, "pros": "Good benefits and interesting work.", "cons": "The most political and non diverse culture. It's like a club where the only people that get ahead are those that play politics, know someone, or that the CEO personally likes (mainly men or women that act like men). A lot of dead weight and untalented people. Many unprofessional people.", "advice": "Shake things up. Get rid of deadweight. Recognize people for their talent and hardwork. Stop protecting and promoting people that don't add value or that should have been goon a long time ago."}, {"title": "Great Company", "text": "Pros Employee focused with extremely good benefits. Cons Under constant pressure to perform Advice to Management Keep doing more of the same", "rating": 5, "pros": "Employee focused with extremely good benefits.", "cons": "Under constant pressure to perform", "advice": "Keep doing more of the same"}, {"title": "Director", "text": "Pros High profile, high visibility Cons Little internal communication and lack of direction from leadership", "rating": 3, "pros": "High profile, high visibility", "cons": "Little internal communication and lack of direction from leadership", "advice": null}, {"title": "Former employee", "text": "Pros Great company. Solid workers. A lot of potential opportunities to work through the company. Co-workers are very nice. I enjoyed working there. Cons The office was small. The team did not do a lot of things together outside of work which led to some slight awkwardness and did not bring the team together. Advice to Management Bring the teams together more. Create a better relationship between the workers on the team to better satisfy your employees.", "rating": 5, "pros": "Great company. Solid workers. A lot of potential opportunities to work through the company. Co-workers are very nice. I enjoyed working there.", "cons": "The office was small. The team did not do a lot of things together outside of work which led to some slight awkwardness and did not bring the team together.", "advice": "Bring the teams together more. Create a better relationship between the workers on the team to better satisfy your employees."}, {"title": "Analyst", "text": "Pros Great benefits and great work/life balance Cons lack of growth need more mobility to move up in the firm Advice to Management N/A", "rating": 5, "pros": "Great benefits and great work/life balance", "cons": "lack of growth need more mobility to move up in the firm", "advice": "N/A"}, {"title": "Associate Vice President", "text": "Pros Career growth, exciting business opportunities and the company is growing. Cons Work-life balance can be a challenge.", "rating": 5, "pros": "Career growth, exciting business opportunities and the company is growing.", "cons": "Work-life balance can be a challenge.", "advice": null}, {"title": "Nasdaq", "text": "Pros Nasdaq is an ever changing organization that provides growth and development opportunities daily. A fast paced and demanding working environment that pushes the organization to achieve greater results. Cons Narrow org structure that means talented employees have to seek progressive opportunities elsewhere.", "rating": 5, "pros": "Nasdaq is an ever changing organization that provides growth and development opportunities daily. A fast paced and demanding working environment that pushes the organization to achieve greater results.", "cons": "Narrow org structure that means talented employees have to seek progressive opportunities elsewhere.", "advice": null}, {"title": "Senior Web Developer", "text": "Pros Nice work environment Can easily reach out to senior management Cons Restructuring happens almost in a yearly basis", "rating": 3, "pros": "Nice work environment", "cons": "Restructuring happens almost in a yearly basis", "advice": null}, {"title": "Operations Manager", "text": "Pros opportunities to work with lots of great people, exposure to multiple lines of business, excellent benefits Cons career advancement is extremely difficult, lean operations can create some pretty hectic days, especially when something breaks. DAQ prefers to look outward for management replacements. Advice to Management Develop and grow your teams! Promote within.", "rating": 3, "pros": "opportunities to work with lots of great people, exposure to multiple lines of business, excellent benefits", "cons": "career advancement is extremely difficult, lean operations can create some pretty hectic days, especially when something breaks. DAQ prefers to look outward for management replacements.", "advice": "Develop and grow your teams! Promote within."}, {"title": "Senior Management is a mess", "text": "Pros You work with passionate and smart individuals. Cons Senior management constantly makes impulsive decisions and manages by fear. Adena Friedman is suppose to take over as CEO but she is no different than Bog Greifeld. There is constant changes of direction and failed initiatives are hidden to investors. You are getting compensated fairly but it comes with the cost of working extensive hours and being constantly threatened of losing your job even if you are a high performer. Advice to Management Fire Bob G and Adena and maybe there is a chance.", "rating": 1, "pros": "You work with passionate and smart individuals.", "cons": "Senior management constantly makes impulsive decisions and manages by fear. Adena Friedman is suppose to take over as CEO but she is no different than Bog Greifeld. There is constant changes of direction and failed initiatives are hidden to investors. You are getting compensated fairly but it comes with the cost of working extensive hours and being constantly threatened of losing your job even if you are a high performer.", "advice": "Fire Bob G and Adena and maybe there is a chance."}, {"title": "Didn't value employees", "text": "Pros really good people who work very hard for little pay. Cons Salary and culture. Some members of the senior management are horrible. Advice to Management value your employees", "rating": 3, "pros": "really good people who work very hard for little pay.", "cons": "Salary and culture. Some members of the senior management are horrible.", "advice": "value your employees"}, {"title": "AD aka Specialist", "text": "Pros Great work life balance, great benefits. Cons Limited upward mobility. Low pay", "rating": 5, "pros": "Great work life balance, great benefits.", "cons": "Limited upward mobility. Low pay", "advice": null}, {"title": "past job", "text": "Pros nice people to work with Cons this is a stock exchange and they know nothing about selling software, and do not invest money into their own products.", "rating": 1, "pros": "nice people to work with", "cons": "this is a stock exchange and they know nothing about selling software, and do not invest money into their own products.", "advice": null}, {"title": "Senior Director, Advisory Services", "text": "Pros People, benefits, culture, pay, work life balance, career path, senior management, capital markets, global, brand name, innovative, passionate, integrity, transparent Cons I really do not have many cons about my experience at the company. No job is perfect and we all have frustrating moments but none of which I would characterize as a con. Advice to Management To continue to look at ways to be innovative and disruptive and to prudently invest in talent and the business.", "rating": 5, "pros": "People, benefits, culture, pay, work life balance, career path, senior management, capital markets, global, brand name, innovative, passionate, integrity, transparent", "cons": "I really do not have many cons about my experience at the company. No job is perfect and we all have frustrating moments but none of which I would characterize as a con.", "advice": "To continue to look at ways to be innovative and disruptive and to prudently invest in talent and the business."}, {"title": "Their review system based on \"Culture\" is an exercise in wasting employee time", "text": "Pros Steady company, good facility, friendly/bright co-workers. Very good immediate developer management. Bonuses are good enough for good work, don't expect more for excellent work. Cons The review process is hopeless/hapless. The constant emphasis on \"Culture\" in this and many other areas shows a lack of interest in results over form. The opposite of what they supposedly espouse. The best that can be hoped is that they received no truthful feedback on their chosen \"theme.\" Advice to Management Upper management: Drop the time spinning employee programs / company mottos. Spend it finding ways to actually motivate/empower employees if retention is the goal.", "rating": 3, "pros": "Steady company, good facility, friendly/bright co-workers. Very good immediate developer management. Bonuses are good enough for good work, don't expect more for excellent work.", "cons": "The review process is hopeless/hapless. The constant emphasis on \"Culture\" in this and many other areas shows a lack of interest in results over form. The opposite of what they supposedly espouse. The best that can be hoped is that they received no truthful feedback on their chosen \"theme.\"", "advice": "Upper management: Drop the time spinning employee programs / company mottos. Spend it finding ways to actually motivate/empower employees if retention is the goal."}, {"title": "Senior Market Services Index Analyst", "text": "Pros Great benefits, compensation and learning experiences. Cons Difficult to move up in the company.", "rating": 3, "pros": "Great benefits, compensation and learning experiences.", "cons": "Difficult to move up in the company.", "advice": null}, {"title": "Great Place To Work", "text": "Pros Lots of great perks and benefits. Lots of great people. Lots of great fun. Cons Lots of bureaucracy can get in the way. Advice to Management Re org. Re org. Re org. Reporting chains need to be streamlined to allow for feedback across silos. The way it is now there's a lot of incentive to increase the bureaucracy and little incentive to provide service.", "rating": 5, "pros": "Lots of great perks and benefits. Lots of great people. Lots of great fun.", "cons": "Lots of bureaucracy can get in the way.", "advice": "Re org. Re org. Re org. Reporting chains need to be streamlined to allow for feedback across silos. The way it is now there's a lot of incentive to increase the bureaucracy and little incentive to provide service."}, {"title": "Enterprise Account Manager", "text": "Pros Pay and benefits are excellent. Cons Very political organization. Many, many layoffs as their is an extreme focus on cost cutting.", "rating": 3, "pros": "Pay and benefits are excellent.", "cons": "Very political organization. Many, many layoffs as their is an extreme focus on cost cutting.", "advice": null}, {"title": "Software Engineer", "text": "Pros Smart people and great culture. Cons Doesn't pay much and hard to advance.", "rating": 3, "pros": "Smart people and great culture.", "cons": "Doesn't pay much and hard to advance.", "advice": null}, {"title": "Collections", "text": "Pros Friendly co-workers, nice facility, great parking, solid work flow Cons finance department management very unprofessional, cliquish and short tempered Advice to Management Be careful of negative personalities in power positions.", "rating": 1, "pros": "Friendly co-workers, nice facility, great parking, solid work flow", "cons": "finance department management very unprofessional, cliquish and short tempered", "advice": "Be careful of negative personalities in power positions."}, {"title": "Write software which is used by exchanges all over the world.", "text": "Pros Nasdaq is a great place to work, they really challenge you and your have the opportunity to write software which is at the heart of the financial markets. Also I've had a great opportunity to travel to other exchanges all over the world. Cons Resources are tight. We are a little slow to innovate since we are so risk adverse. Culture is a little boring, but it depends on the group.", "rating": 5, "pros": "Nasdaq is a great place to work, they really challenge you and your have the opportunity to write software which is at the heart of the financial markets. Also I've had a great opportunity to travel to other exchanges all over the world.", "cons": "Resources are tight. We are a little slow to innovate since we are so risk adverse. Culture is a little boring, but it depends on the group.", "advice": null}, {"title": "Internship", "text": "Pros Smart people, great culture, senior management is approachable Cons Internship needs more years of experience Advice to Management None", "rating": 5, "pros": "Smart people, great culture, senior management is approachable", "cons": "Internship needs more years of experience", "advice": "None"}, {"title": "Nasdaq OMX Group review", "text": "Pros Pretty good company, work-life balance is really good. Good benefit. Cons Work environment is not that good, the working process is relatively slow.", "rating": 5, "pros": "Pretty good company, work-life balance is really good. Good benefit.", "cons": "Work environment is not that good, the working process is relatively slow.", "advice": null}, {"title": "Great brand, other problems need to work on though", "text": "Pros The company has a great brand, and has many great technologies. Coworkers were generally nice to work with. Cons Should pay more attention to their junior members. In certain areas of technologies they are understaffed. Developers are overloaded with work. Advice to Management Should start to care about employees concerns instead of ignoring them.", "rating": 3, "pros": "The company has a great brand, and has many great technologies. Coworkers were generally nice to work with.", "cons": "Should pay more attention to their junior members. In certain areas of technologies they are understaffed. Developers are overloaded with work.", "advice": "Should start to care about employees concerns instead of ignoring them."}, {"title": "Sinking Ship", "text": "Pros Exemplary cost cutting skills have allowed NDAQ to hide terrible results for years and still produce EPS gains. Cons Leadership is completely out of touch yet mandates strategy and is surprised by poor results. C Suite is running out of people to fire and will soon be the only ones left to blame. Company is spread wide and thin with dated and poor technology across the board. Valid HR complaints from accomplished women are swept away as performance trumps all at NDAQ.", "rating": 1, "pros": "Exemplary cost cutting skills have allowed NDAQ to hide terrible results for years and still produce EPS gains.", "cons": "Leadership is completely out of touch yet mandates strategy and is surprised by poor results. C Suite is running out of people to fire and will soon be the only ones left to blame. Company is spread wide and thin with dated and poor technology across the board. Valid HR complaints from accomplished women are swept away as performance trumps all at NDAQ.", "advice": null}, {"title": "Senior Software Engineer/Architect", "text": "Pros Pros are you get to work in finance without the stress of other financial employers like hedge funds and banks. Cons Pay isn't that high but good benefits.", "rating": 5, "pros": "Pros are you get to work in finance without the stress of other financial employers like hedge funds and banks.", "cons": "Pay isn't that high but good benefits.", "advice": null}, {"title": "Survival of the Entrenched", "text": "Pros Decent health insurance Most coworkers are collegial and cooperative Cons New manager with questionable ethics and poor communication skills Entrenched employees make it difficult for others Long-distance upper management meant poor communication No clear direction regarding projects Technical teams not cooperating Advice to Management Upper management should be in touch with employees in other locations. Communication should not occur only up and down the management chain. New managers are not ethical just because they took the online training or signed a piece of paper. Keep a close eye on what they are doing in locations with no upper management or HR presence.", "rating": 3, "pros": "Decent health insurance", "cons": "New manager with questionable ethics and poor communication skills", "advice": "Upper management should be in touch with employees in other locations. Communication should not occur only up and down the management chain. New managers are not ethical just because they took the online training or signed a piece of paper. Keep a close eye on what they are doing in locations with no upper management or HR presence."}, {"title": "Board Portal ISR", "text": "Pros Good name behind product but might be too big for some markets Cons Huge market competition and entry level sales Advice to Management none", "rating": 3, "pros": "Good name behind product but might be too big for some markets", "cons": "Huge market competition and entry level sales", "advice": "none"}, {"title": "Service Account Manager", "text": "Pros Great compensation and bonus. Average benefits and decent vacation time. Cons Poor management, more work than you can ever do, terrible work/life balance structure, miserable employees. Advice to Management Lean organizations breed overworked employees who will not tolerate it.", "rating": 1, "pros": "Great compensation and bonus. Average benefits and decent vacation time.", "cons": "Poor management, more work than you can ever do, terrible work/life balance structure, miserable employees.", "advice": "Lean organizations breed overworked employees who will not tolerate it."}, {"title": "Worst management ever", "text": "Pros No pros. Not even salary. You are constantly overworked and underpaid, Cons They shift your focus and internal departments every couple months, this helps move money around so quarterly reports look better. They know all the loopholes with mandates and how to treat employees. It's sickening. Offices are cramped and cheap too. Advice to Management If you don't want feedback at least try not treating your employees like they're disposable.", "rating": 1, "pros": "No pros. Not even salary. You are constantly overworked and underpaid,", "cons": "They shift your focus and internal departments every couple months, this helps move money around so quarterly reports look better. They know all the loopholes with mandates and how to treat employees. It's sickening. Offices are cramped and cheap too.", "advice": "If you don't want feedback at least try not treating your employees like they're disposable."}, {"title": "Bad culture", "text": "Pros Smart people, interesting work, great brand Cons Culture of blame and fear. Top management self protective and self-interested.", "rating": 1, "pros": "Smart people, interesting work, great brand", "cons": "Culture of blame and fear. Top management self protective and self-interested.", "advice": null}, {"title": "Nasdaq", "text": "Pros Very smart staff. Several business units give lower level employees the opportunity to move to new positions and roles Cons Some of the businesses can be silo-like. While staff is pretty motivated, morale at times can be low due to press and market events Advice to Management continue to promote from within. the review process needs to be improved to better match modern companies. provide more opportunities to move locations within organization", "rating": 5, "pros": "Very smart staff. Several business units give lower level employees the opportunity to move to new positions and roles", "cons": "Some of the businesses can be silo-like. While staff is pretty motivated, morale at times can be low due to press and market events", "advice": "continue to promote from within. the review process needs to be improved to better match modern companies. provide more opportunities to move locations within organization"}, {"title": "Support", "text": "Pros Great Benefits and work environment Cons some employees you just scratch your head.", "rating": 5, "pros": "Great Benefits and work environment", "cons": "some employees you just scratch your head.", "advice": null}, {"title": "Sales Executive", "text": "Pros There is direct exposure to executive management. A company that promotes from within and allows hungry employees to grow and thrive quickly. Great work life balance. Cons Not all employees are top quality and there are often bottlenecks with individuals who are unresponsive due to lack of interest. Advice to Management Continue to support and promote hungry talented employees.", "rating": 5, "pros": "There is direct exposure to executive management. A company that promotes from within and allows hungry employees to grow and thrive quickly. Great work life balance.", "cons": "Not all employees are top quality and there are often bottlenecks with individuals who are unresponsive due to lack of interest.", "advice": "Continue to support and promote hungry talented employees."}, {"title": "Terrible corporate culture; awful place to work", "text": "Pros The health benefits are as to be expected for a company as large as this. The name Nasdaq on your resume. Reading THIS review and realizing you can get better experience elsewhere. Nothing else. Cons Where to begin? NEPOTISM reigns supreme in a place with the worst cut throat corporate atmosphere I've ever experienced. It's all about who you know, they could care less about what you know. You can expect 6 month contract consultants to get better treatment and some sort of cross training, you can also expect them to get the benefit of human decency and be told months in advance when they will be let go. As a full time employee you can expect incompetent managers who backdoor their personal friends in through shipping and internships to be promoted directly to lead positions with zero experience, you can also expect these people to train the new contractors, only to have these contractors held accountable for their lack of proper training. You can expect directors who could care less about their responsibilities, only to focus on what matters to them. You can expect an extreme cut throat team experience, to the point where there are Matchbox buses with the Nasdaq name on them because \"throwing someone under the bus\" is a daily occurrence (This is true, it is celebrated so much at this company these toy buses do exist). You can expect to show up for work on a Monday, to be instantly let go for weak reasons that don't pan out, that's what happens though when you've just hired your best friends brother (whom you've also hired and made a lead position), and need to make room for another \"lead.\" Advice to Management Gut the management, get people who are managers, not opportunistic pipsqueaks who have managed to get by by how brown their noses are. Being good at paperwork doesn't make you a boss.", "rating": 1, "pros": "The health benefits are as to be expected for a company as large as this.", "cons": "Where to begin? NEPOTISM reigns supreme in a place with the worst cut throat corporate atmosphere I've ever experienced. It's all about who you know, they could care less about what you know.", "advice": "Gut the management, get people who are managers, not opportunistic pipsqueaks who have managed to get by by how brown their noses are. Being good at paperwork doesn't make you a boss."}, {"title": "Product owner", "text": "Pros compensation compensation compensation compensation, compensation medical benefits, stocks, flexbility based on mood, flexibility based on mood office with bad infrastructure, Cons Long work hours Management with out any direction Products sucks Confusion on what business want Advice to Management Attend basic school of mgmt", "rating": 1, "pros": "compensation compensation compensation compensation, compensation", "cons": "Long work hours", "advice": "Attend basic school of mgmt"}, {"title": "Very Corporate and Cheap", "text": "Pros Job Security, Name Recognition, Good hours (at least in my role), Good Bonuses and Benefits Cons Upper Management make changes often without ever looking at efficiency of their employees. Little to no raises, poor management in general, no boost to employee morale. Work-horse mentality. Little to no job growth opportunities. Advice to Management Spend a little money on making your employees happy. Take us out, give us more freedom, maybe a big raise here and there. Treat us the way the people who bring you revenue should be treated.", "rating": 3, "pros": "Job Security, Name Recognition, Good hours (at least in my role), Good Bonuses and Benefits", "cons": "Upper Management make changes often without ever looking at efficiency of their employees. Little to no raises, poor management in general, no boost to employee morale. Work-horse mentality. Little to no job growth opportunities.", "advice": "Spend a little money on making your employees happy. Take us out, give us more freedom, maybe a big raise here and there. Treat us the way the people who bring you revenue should be treated."}, {"title": "Overall good company", "text": "Pros Great work environment and constant desire to expand into new products. Cons Separating departments on the same platform creates competition instead of collaboration. Advice to Management Employees are spread too thin with expectations set too high.", "rating": 5, "pros": "Great work environment and constant desire to expand into new products.", "cons": "Separating departments on the same platform creates competition instead of collaboration.", "advice": "Employees are spread too thin with expectations set too high."}, {"title": "Great place to work", "text": "Pros - life/work balance - exceptional benefits - diverse career opportunities - dedication to the employees - career advancement through training / library - great locations - well known and trusted, high-profile brand - forward-thinking management - ability to work from home (depending on your position, of course) Cons - the on-boarding process can be a little cumbersome - only getting market holidays means losing out on some state holidays - there are a lot of amazing benefits, but navigating the setup and management of them is confusing and needs a bit of HR hand-holding Advice to Management - streamline on-boarding process - improve HR turnaround - more than one week's worth of sick time is essential for people who have families - have more dedication to streamlining and keeping updated all documentation on benefits and various systems you need to interact with on a regular basis (time-tracking, payroll, expenses, etc.) - have a single place to login to to track work hours and leave time", "rating": 5, "pros": "- life/work balance", "cons": "- the on-boarding process can be a little cumbersome", "advice": "- streamline on-boarding process"}, {"title": "A great place for someone looking to make an impact", "text": "Pros Opportunities to pursue interesting technologies/ideas Great benefits Very interesting work with the capacity to specialise in any particular area that interests you Always more to learn, you should never get bored Cons Work day is 9 hours and isn't terribly convenient for me, so I don't get to spend as much time at home as I'd like. Weekend Work/On Call Rotation, but you find this everywhere and On Call isn't so bad. Long list of responsibilities for better or worse Advice to Management It would be nice to earn work from home days maybe one every other week. Working at the office is generally a formality and not a necessity.", "rating": 5, "pros": "Opportunities to pursue interesting technologies/ideas", "cons": "Work day is 9 hours and isn't terribly convenient for me, so I don't get to spend as much time at home as I'd like.", "advice": "It would be nice to earn work from home days maybe one every other week. Working at the office is generally a formality and not a necessity."}, {"title": "Every year getting better", "text": "Pros Been working at Nasdaq for 6 years. The experience varies a lot across offices, but employees in general are convivial, like working together and have a positive outlook on life. Executive Management used to be apparently indifferent to the needs of employees, but the level of respect and helpfulness has steadily grown. I feel proud to work for Nasdaq. The company uses macs and PCs, and use both iphones and adroids for mobile. It doesn't ever feel like we're working in the stone age. Cons The vast majority of business lines require responsible stewards, not inventors or disruptors. However there are pockets of innovation here and there that a lucky few get to enjoy. That innovation, unfortunately, is often stifled by red tape and endless appraisals of \"profitability\", even for nascent products that have not come to market. It is the downside of a very conservative company, although this also means that the stock price does pretty well. Advice to Management Invest more in new projects and research, and less in lawyers and corporate finance.", "rating": 5, "pros": "Been working at Nasdaq for 6 years. The experience varies a lot across offices, but employees in general are convivial, like working together and have a positive outlook on life. Executive Management used to be apparently indifferent to the needs of employees, but the level of respect and helpfulness has steadily grown. I feel proud to work for Nasdaq. The company uses macs and PCs, and use both iphones and adroids for mobile. It doesn't ever feel like we're working in the stone age.", "cons": "The vast majority of business lines require responsible stewards, not inventors or disruptors. However there are pockets of innovation here and there that a lucky few get to enjoy. That innovation, unfortunately, is often stifled by red tape and endless appraisals of \"profitability\", even for nascent products that have not come to market. It is the downside of a very conservative company, although this also means that the stock price does pretty well.", "advice": "Invest more in new projects and research, and less in lawyers and corporate finance."}, {"title": "Good and some bad", "text": "Pros The team in Lakewood is excellent, high-calibre folks for the most part. Very good engineers, great atmosphere. Cons The management in NY kinda sucks. Teams aren't grouped according to a task they are grouped according to specialty, which cause problems trying to get things done across the different teams. Advice to Management Empower the lakewood office as much as you can, and continue to move more things there.", "rating": 5, "pros": "The team in Lakewood is excellent, high-calibre folks for the most part. Very good engineers, great atmosphere.", "cons": "The management in NY kinda sucks. Teams aren't grouped according to a task they are grouped according to specialty, which cause problems trying to get things done across the different teams.", "advice": "Empower the lakewood office as much as you can, and continue to move more things there."}, {"title": "Bigger is not always better", "text": "Pros Large, global company with many departments and divisions. Located in major cities. Large spectrum of jobs, from tech, non-tech, and financial, to administrative. Well-known brand. Cons Large company, slow to change. My department is poorly managed. We lack the big picture and strategy. It's not very collaborative, and there is a lot of politics between teams in my division. Advice to Management Minimize micro-managing. We know what we are doing, and we should be trusted for that. Use your time to better provide the big picture or strategy to push the business forward.", "rating": 3, "pros": "Large, global company with many departments and divisions. Located in major cities. Large spectrum of jobs, from tech, non-tech, and financial, to administrative. Well-known brand.", "cons": "Large company, slow to change. My department is poorly managed. We lack the big picture and strategy. It's not very collaborative, and there is a lot of politics between teams in my division.", "advice": "Minimize micro-managing. We know what we are doing, and we should be trusted for that. Use your time to better provide the big picture or strategy to push the business forward."}, {"title": "Good people; Murky Career Progression Plans", "text": "Pros I work in the Corporate Solutions division and overall the people from a mid-management level on down are decent, hard-working people who do their jobs well and help each other out. Not a ton of pass the buck here--everyone works hard and exhibits professionalism. Salary is decent and the products are interesting, especially the ones the company is investing in. Nasdaq is an interesting company that embraces innovation in its products. Cons Any talk of helping employees at the professional level to progress and move up within the company seems to be more lip service than something really put into practice. The employees sometime seem like an afterthought to profit margins rather than an asset that helps drive the company's success with clients. There is also a constant reshuffling of role definitions that results in a lot of confusion about who does what now and leads to client (and employee) frustration. Advice to Management Pull the trigger and clarify roles rather than keeping folks in limbo. Invest more in the people you have--increase the mentor program and make workshops (online, perhaps) available to more than just the managment/leadership track employees. Invest in hiring new people to help us grow as the client base and workload increase.", "rating": 3, "pros": "I work in the Corporate Solutions division and overall the people from a mid-management level on down are decent, hard-working people who do their jobs well and help each other out. Not a ton of pass the buck here--everyone works hard and exhibits professionalism. Salary is decent and the products are interesting, especially the ones the company is investing in. Nasdaq is an interesting company that embraces innovation in its products.", "cons": "Any talk of helping employees at the professional level to progress and move up within the company seems to be more lip service than something really put into practice. The employees sometime seem like an afterthought to profit margins rather than an asset that helps drive the company's success with clients. There is also a constant reshuffling of role definitions that results in a lot of confusion about who does what now and leads to client (and employee) frustration.", "advice": "Pull the trigger and clarify roles rather than keeping folks in limbo. Invest more in the people you have--increase the mentor program and make workshops (online, perhaps) available to more than just the managment/leadership track employees. Invest in hiring new people to help us grow as the client base and workload increase."}, {"title": "Technical Analyst/Director - Capital Markets Group", "text": "Pros Great CFO who supports women in the financial industry Cons No support as an employee by upper management. Negative ROI on organic growth. Too many mergers.", "rating": 3, "pros": "Great CFO who supports women in the financial industry", "cons": "No support as an employee by upper management. Negative ROI on organic growth. Too many mergers.", "advice": null}, {"title": "Nice people, nowhere to go", "text": "Pros Nice people, many long tenures and generous with telecommuting and work schedule flexibility. Good benefits and salary is probably on par. Cons Very little chance for advancement especially for mid-level employees. This is due, in part, to the ever changing employee level goals and targets. When it seems in reach, it get farther away. Hard to get things done across business lines. Advice to Management Give clear direction to employees on paths to advancement. Encourage business lines to work together to support corporate goals.", "rating": 3, "pros": "Nice people, many long tenures and generous with telecommuting and work schedule flexibility. Good benefits and salary is probably on par.", "cons": "Very little chance for advancement especially for mid-level employees. This is due, in part, to the ever changing employee level goals and targets. When it seems in reach, it get farther away. Hard to get things done across business lines.", "advice": "Give clear direction to employees on paths to advancement. Encourage business lines to work together to support corporate goals."}, {"title": "Software Developer Intern", "text": "Pros Brand, Exposure, Knowledge, Stock Exchange, nice people and good Returns Cons Nothing to share as of now", "rating": 5, "pros": "Brand, Exposure, Knowledge, Stock Exchange, nice people and good Returns", "cons": "Nothing to share as of now", "advice": null}, {"title": "Exciting Place to Work", "text": "Pros Every day is a new day. It is dynamic and energetic place to work. Employees have the opportunity to take on a lot of responsibility and be rewarded well for it. Being part of a transformation is exciting. Cons Micromanagement at times. You need to take your punches and move on. Advice to Management Be transparent and continue collaborating.", "rating": 5, "pros": "Every day is a new day. It is dynamic and energetic place to work. Employees have the opportunity to take on a lot of responsibility and be rewarded well for it. Being part of a transformation is exciting.", "cons": "Micromanagement at times. You need to take your punches and move on.", "advice": "Be transparent and continue collaborating."}, {"title": "Low morale", "text": "Pros -pay is OK (50-80K), not great but better than some places -benefits are good, Cigna is just OK not great -bonus of about 5% yearly -restricted stock awards, if you can hang in there for at least 3 yrs Cons -no chance for advancement, the department is minuscule. -the control room is basically a closet, approx 100 square feet for 4-8 people to operate -the place is a fire hazard with outlet strips plugged into outlet strips plugged into more outlet strips -the heat does not work when the outside temps fall into the teens and below(see pictures) -they pile so much work on you that the chance for mistakes in a complex environment is very high. -mistakes are not tolerated and you will be terminated -intimidation/threats from management to be terminated (rule by fear) -mgmt aren't broadcasting pros and don't understand the limitations/capabilities of a broadcast studio -\"make it happen or we will find someone who can\" -nepotism -higher paid employees can be singled out for termination as an excuse to save money Advice to Management Get over yourselves and lighten up, maybe you should point the finger at the yourselves - those who botched the Facebook IPO and missed out on Alibaba.", "rating": 1, "pros": "-pay is OK (50-80K), not great but better than some places", "cons": "-no chance for advancement, the department is minuscule.", "advice": "Get over yourselves and lighten up, maybe you should point the finger at the yourselves - those who botched the Facebook IPO and missed out on Alibaba."}, {"title": "BWise GRC", "text": "Pros GRC subject matter compelling, friendly co-workers. Good sized opportunities Cons Long sales cycles, saturated market.", "rating": 3, "pros": "GRC subject matter compelling, friendly co-workers. Good sized opportunities", "cons": "Long sales cycles, saturated market.", "advice": null}, {"title": "Pockets of Great People and You", "text": "Pros There are some really good people here and it's a great brand in the industry Cons I was stuck working under someone who lacked vision, saw every challenge as confrontation to be avoided, and overlayed simple decisions with unnecessary bureaucracy. Advice to Management Be wary of the power of some of the institutionalized employees to stifle change.", "rating": 3, "pros": "There are some really good people here and it's a great brand in the industry", "cons": "I was stuck working under someone who lacked vision, saw every challenge as confrontation to be avoided, and overlayed simple decisions with unnecessary bureaucracy.", "advice": "Be wary of the power of some of the institutionalized employees to stifle change."}, {"title": "Mixed", "text": "Pros At the center of a really interesting industry Cons Very entrenched players in this industry", "rating": 3, "pros": "At the center of a really interesting industry", "cons": "Very entrenched players in this industry", "advice": null}, {"title": "The typical corp-machine that has the resources to be great but sub-par middle management that keeps them mediocre.", "text": "Pros Strong positioning in many spaces of market-sectors they encompass. Respectable resources and asset base for improvements both internal and external Cons Short-sighted vision of dreadful middle management and a propensity to under utilize individuals talent or provide strongly defined career paths for people to grow. Very easy to remain stagnant in a career there.", "rating": 3, "pros": "Strong positioning in many spaces of market-sectors they encompass. Respectable resources and asset base for improvements both internal and external", "cons": "Short-sighted vision of dreadful middle management and a propensity to under utilize individuals talent or provide strongly defined career paths for people to grow. Very easy to remain stagnant in a career there.", "advice": null}, {"title": "NASDAQ is a great place for opportunity and growth.", "text": "Pros The team environment allows for individuals to learn from experienced colleagues and to share knowledge. Compensation and perks are also a plus! Cons Sometimes there are long hours depending on the team you work on.", "rating": 5, "pros": "The team environment allows for individuals to learn from experienced colleagues and to share knowledge. Compensation and perks are also a plus!", "cons": "Sometimes there are long hours depending on the team you work on.", "advice": null}, {"title": "Company in search of a new profitable core business......", "text": "Pros The company has a recognizable name. I had many dedicated and smart colleagues. The benefits, pay and vacation are adequate. Cons This is a company in search of a new core business, the basic exchange is not a profitable enterprise anymore. They keep buying new companies trying to build a solid revenue stream and have IMO made a number of mistakes. This has created a constantly shifting landscape with many rounds of scaling back. It can be a nerve wracking environment where lines of loyalty change. Change can be good but here it seems desperate. Advice to Management The culture of constant mergers, overlaps, and cutbacks needs to decrease. When you purchase companies there needs to be more consideration of the personal that come with those purchases.", "rating": 1, "pros": "The company has a recognizable name.", "cons": "This is a company in search of a new core business, the basic exchange is not a profitable enterprise anymore. They keep buying new companies trying to build a solid revenue stream and have IMO made a number of mistakes. This has created a constantly shifting landscape with many rounds of scaling back.", "advice": "The culture of constant mergers, overlaps, and cutbacks needs to decrease."}, {"title": "Positive", "text": "Pros Good Pay to Start, Good Benefits Cons No upward mobility, Poor Marketing for Certain Products Advice to Management Develop People Internally and Educate Them On All Products and Services", "rating": 3, "pros": "Good Pay to Start, Good Benefits", "cons": "No upward mobility, Poor Marketing for Certain Products", "advice": "Develop People Internally and Educate Them On All Products and Services"}, {"title": "Good company.", "text": "Pros Good salary and benefits with the firm. Cons Long, brutal hours but not unusual for the industry. Advice to Management Increase staff.", "rating": 5, "pros": "Good salary and benefits with the firm.", "cons": "Long, brutal hours but not unusual for the industry.", "advice": "Increase staff."}, {"title": "The name is very well-known but this was the worst career choice I've ever made.", "text": "Pros The company is very well-known and is easily recognizable. There were a lot of benefits that came with the job (because of the connections to major public companies, we also received discounts and perks at these places). I loved my coworkers and I liked my manager on a personal level. They have locations across the world and you can try to transfer to other countries as part of a 'work abroad' program. Cons I was promised many things (advancement opportunities, job expectations, total salary, lowest commission possible, etc) in the interview process and none of it turned out to be true. (This also happened with many other people I worked with- we all ended up leaving MUCH better paying jobs based on these false expectations) We were taught all these 'amazing' things about the products I sold but, after talking with real users in the market place, seeing competitors' products, and trying to demo our products, I realized they are some of the worst and are in no way competitive (in quality or price). I personally came in with a lot of experience but they offer no support or real training. Because of this, I saw many colleagues who came in with less experience struggle and fail miserably as they tried to figure things out on their own. The overall morals that are held and encouraged by management are atrocious. You are fully expected to try to pull the wool over clients' eyes to make any sell and are supported if you get caught stealing deals from colleagues. The two things I heard most often were \"Ask for forgiveness, not for permission,\" and \"I don't have morals when it comes to business.\" I see no strength in the company itself- they constantly just buy up-and-coming start-ups, sell said start-ups products without improving or growing said start-up's products, until these products are no longer competitive and eventually die. They believe they will be successful completely based on the notion of \"It will sell because we're NASDAQ,\" albeit my previous statement and the fact that NASDAQ is only really known in the listings market. Advice to Management Create a better internal culture. Hold people accountable for not just numbers but for the rules set forth by the company. Organize on-boarding training that is job or department specific. Increase your dev department so that you can improve and grow your technology (you do call yourself a \"global technology\" company after all) not just support issues that arise with the existing systems you have acquired.", "rating": 1, "pros": "The company is very well-known and is easily recognizable.", "cons": "I was promised many things (advancement opportunities, job expectations, total salary, lowest commission possible, etc) in the interview process and none of it turned out to be true. (This also happened with many other people I worked with- we all ended up leaving MUCH better paying jobs based on these false expectations)", "advice": "Create a better internal culture."}, {"title": "Good company", "text": "Pros They have invested a lot of money in next gen service offerings, waiting to see how it all turns out. They pay well, no quota, opportunities for bonuses, cool people. Cons Very chaotic place to work. Many internal requirements in order to keep reports accurate. Advice to Management Rome wasn't built in a day.", "rating": 5, "pros": "They have invested a lot of money in next gen service offerings, waiting to see how it all turns out. They pay well, no quota, opportunities for bonuses, cool people.", "cons": "Very chaotic place to work. Many internal requirements in order to keep reports accurate.", "advice": "Rome wasn't built in a day."}, {"title": "Great experience.", "text": "Pros Wonderful people, great work atmosphere. Cons Late work hours are stressful.", "rating": 5, "pros": "Wonderful people, great work atmosphere.", "cons": "Late work hours are stressful.", "advice": null}, {"title": "Many great opportunities if in the right areas", "text": "Pros Very focused on maintaining profit. You will always be busy and working on important projects. Will get great experience in the technology organization Cons Environment does not foster innovation or risk taking. Very limited training opportunities. Technology area is focused on implementing big company waterfall processes.", "rating": 5, "pros": "Very focused on maintaining profit. You will always be busy and working on important projects. Will get great experience in the technology organization", "cons": "Environment does not foster innovation or risk taking. Very limited training opportunities. Technology area is focused on implementing big company waterfall processes.", "advice": null}, {"title": "A leaderless hodgepodge of soulless technologists.", "text": "Pros Good benefits. Free coffee. If you prefer to spend your workday in complete silence without interacting with another human being this is the place for you. Cons Your coworkers are unethical hackers. There is no upward mobility because there is nothing to move up to. This is a hands off executive team that purchases small tech companies. The companies either use and abuse the brand to grow, or end up in the waste bin. This is where careers go to die. Advice to Management Keep searching the globe for countries who are dumb enough to buy your software. That's your niche. If you were any good at technology, you'd be in Silicon Valley, and if you were any good at finance you'd have more than a small data processing service. Your listing business should dry up quickly once customers figure out the scam. So keep selling to the dumb countries, there's tons of money there for people with low moral standards like you to feast on.", "rating": 1, "pros": "Good benefits. Free coffee. If you prefer to spend your workday in complete silence without interacting with another human being this is the place for you.", "cons": "Your coworkers are unethical hackers. There is no upward mobility because there is nothing to move up to. This is a hands off executive team that purchases small tech companies. The companies either use and abuse the brand to grow, or end up in the waste bin. This is where careers go to die.", "advice": "Keep searching the globe for countries who are dumb enough to buy your software. That's your niche. If you were any good at technology, you'd be in Silicon Valley, and if you were any good at finance you'd have more than a small data processing service. Your listing business should dry up quickly once customers figure out the scam. So keep selling to the dumb countries, there's tons of money there for people with low moral standards like you to feast on."}, {"title": "Constant Flux", "text": "Pros Competitive pay and benefits. Known name brand. Opportunities to work with intelligent people around the globe. Technology focused CEO. Cons Insane politics. Top down management. Poor upper management. Sink or swim at the management level. Non-existant HR department. Difficult to attract talent. Advice to Management Too much time is spent on leaning out the budget. Cut your losses. Stop supporting failure products. Use that overhead to invest in new endeavors. stop changing out middle management. Change out the sr. management.", "rating": 3, "pros": "Competitive pay and benefits. Known name brand. Opportunities to work with intelligent people around the globe. Technology focused CEO.", "cons": "Insane politics. Top down management. Poor upper management. Sink or swim at the management level. Non-existant HR department. Difficult to attract talent.", "advice": "Too much time is spent on leaning out the budget. Cut your losses. Stop supporting failure products. Use that overhead to invest in new endeavors. stop changing out middle management. Change out the sr. management."}, {"title": "Sr. Web Developer", "text": "Pros Benefits were great, profit sharing, bonuses and decent pay, 3 weeks vacation to start. Colleagues were great... flexible environment. Cons No room for advancement, They rather hire contractors for lower development jobs then within. Still working on old code base ColdFusion, buying products they knowing nothing about or how it was developed. Trying to build an in house product with no clear direction. Soon as you start to get some, they purchase another company and everything stops and changes. There is are to much upper management that is just bloat. There is far to much red tape to do anything here. Advice to Management Management needs to know what real development is. Configuring a website is not real code development. Hire more from within and not just throwing contractors at it. Hire some Managers with Real Software product experience and things could change drastically...", "rating": 3, "pros": "Benefits were great, profit sharing, bonuses and decent pay, 3 weeks vacation to start. Colleagues were great... flexible environment.", "cons": "No room for advancement, They rather hire contractors for lower development jobs then within. Still working on old code base ColdFusion, buying products they knowing nothing about or how it was developed. Trying to build an in house product with no clear direction. Soon as you start to get some, they purchase another company and everything stops and changes. There is are to much upper management that is just bloat. There is far to much red tape to do anything here.", "advice": "Management needs to know what real development is. Configuring a website is not real code development. Hire more from within and not just throwing contractors at it. Hire some Managers with Real Software product experience and things could change drastically..."}, {"title": "This company is not for everyone.", "text": "Pros NASDAQ is a well known brand, but when you peel back the onion there are some major dysfunctions at the management level. Cons Very lean organization. Work/life balance is better in some departments vs others Advice to Management Be transparent, communicate more with staff, and put more emphasis on valuing all employees and not just senior management. Without out the people who make the vision happen, the company is nothing...", "rating": 3, "pros": "NASDAQ is a well known brand, but when you peel back the onion there are some major dysfunctions at the management level.", "cons": "Very lean organization. Work/life balance is better in some departments vs others", "advice": "Be transparent, communicate more with staff, and put more emphasis on valuing all employees and not just senior management. Without out the people who make the vision happen, the company is nothing..."}, {"title": "GREAT experience", "text": "Pros I joined as an Intern. They have started a great internship program of 10 weeks. I got good exposure to the company, leadership and its different businesses. There was brown bag sessions of how the stock market works and all. As I was in technology, it was really helpful for me to learn about different verticals. Cons Sometimes you find yourself passing time as an intern. Everyone is too busy. You really need to approach different people and ask for work. If you have the guts to go and ask people to give you work, your experience might just be great. but it differs from person to person. Advice to Management There should be more documentation so that when a new guy joins, you don't have to spend hours with him.", "rating": 5, "pros": "I joined as an Intern. They have started a great internship program of 10 weeks. I got good exposure to the company, leadership and its different businesses. There was brown bag sessions of how the stock market works and all. As I was in technology, it was really helpful for me to learn about different verticals.", "cons": "Sometimes you find yourself passing time as an intern. Everyone is too busy. You really need to approach different people and ask for work. If you have the guts to go and ask people to give you work, your experience might just be great. but it differs from person to person.", "advice": "There should be more documentation so that when a new guy joins, you don't have to spend hours with him."}, {"title": "Underpaid, overworked, back stabbed, then left for dead", "text": "Pros Good Medical Benefits. Sometimes they'll waste a ton of money on fancy dinners for you. Cons They fire quality staff members to make room for inexperienced college students and teams in India. This is because the company is so poorly run, they are constantly losing money at rapid rates and doing this is the only way to help their quarterly reports look decent. They fail at all their mergers. (Glide, Thomson Reuters) and their staff has become a revolving door. They are all about Quantity over Quality making for a poor office environment. Everyone is hostile, on edge, and will lie to you about being your friend for a year just to use you to get ahead. Pathetic. Advice to Management Listen to those on the frontlines, quit hiring people with no skills just because they'll take a lower paycheck.", "rating": 1, "pros": "Good Medical Benefits.", "cons": "They fire quality staff members to make room for inexperienced college students and teams in India. This is because the company is so poorly run, they are constantly losing money at rapid rates and doing this is the only way to help their quarterly reports look decent. They fail at all their mergers. (Glide, Thomson Reuters) and their staff has become a revolving door. They are all about Quantity over Quality making for a poor office environment. Everyone is hostile, on edge, and will lie to you about being your friend for a year just to use you to get ahead. Pathetic.", "advice": "Listen to those on the frontlines, quit hiring people with no skills just because they'll take a lower paycheck."}, {"title": "Lots of new development", "text": "Pros Company is investing heavily in growth Friendly colleagues Cons Becoming more corporate Hard to navigate through the layers sometimes", "rating": 5, "pros": "Company is investing heavily in growth", "cons": "Becoming more corporate", "advice": null}, {"title": "Great company for a hardworker", "text": "Pros Good benefits and pay. Bonus w/ stock vested. Best in it's industry, stable company. Cons All about numbers and revenue. Not a lot of morale boost. Small budgets for every team means no fun. Just work hard and look good and their happy. Maybe you'll get a thank you email. Advice to Management Boost company morale. Simplify positions and not add extra work onto roles. Allow more money making opportunities for everyone, not just sales and big wigs. Share the wealth.", "rating": 3, "pros": "Good benefits and pay. Bonus w/ stock vested. Best in it's industry, stable company.", "cons": "All about numbers and revenue. Not a lot of morale boost. Small budgets for every team means no fun. Just work hard and look good and their happy. Maybe you'll get a thank you email.", "advice": "Boost company morale. Simplify positions and not add extra work onto roles. Allow more money making opportunities for everyone, not just sales and big wigs. Share the wealth."}, {"title": "Excellent people, team culture", "text": "Pros Nasdaq has some fantastic dedicated people working hard and sincerely. It's a very team oriented culture and people tend to pull their weight. Yes, there is plenty of politics, but that is corporate life. Still, it's a great company working prominently on the world stage. Cons Under-market compensation and slow forward career path. The company is also too lean and certain groups are stretched too thin.", "rating": 5, "pros": "Nasdaq has some fantastic dedicated people working hard and sincerely. It's a very team oriented culture and people tend to pull their weight. Yes, there is plenty of politics, but that is corporate life. Still, it's a great company working prominently on the world stage.", "cons": "Under-market compensation and slow forward career path. The company is also too lean and certain groups are stretched too thin.", "advice": null}, {"title": "Down-Hill", "text": "Pros Friendly people when they're not trying to stab you in the back. Cons Once the Reuters acquisition took place, everything went down hill quite rapidly. It was a complete reverse merger, so TR basically took over everything...major/minor decisions, comp, etc., leaving everyone angry and non motivated. The division is ran completely backwards and the majority of the management is clueless, not to mention a complete lack of accountability. Think about it...nasdaq bought the reuters business unit for about $400 million. Why do you think that is? Its because the old reuters was not doing well, nasdaq took a shot at them, and in my (and everyone else's) opinion, they failed miserably. Advice to Management Listen to sales...listen to the people who are on the frontline of getting YOU paid. Also, it would help to actually learn the business unit/sector that you run.", "rating": 1, "pros": "Friendly people when they're not trying to stab you in the back.", "cons": "Once the Reuters acquisition took place, everything went down hill quite rapidly. It was a complete reverse merger, so TR basically took over everything...major/minor decisions, comp, etc., leaving everyone angry and non motivated. The division is ran completely backwards and the majority of the management is clueless, not to mention a complete lack of accountability. Think about it...nasdaq bought the reuters business unit for about $400 million. Why do you think that is? Its because the old reuters was not doing well, nasdaq took a shot at them, and in my (and everyone else's) opinion, they failed miserably.", "advice": "Listen to sales...listen to the people who are on the frontline of getting YOU paid. Also, it would help to actually learn the business unit/sector that you run."}, {"title": "Nasdaq OMX was an innovating, exciting place to work for", "text": "Pros Easy company to work for, always had opportunities to grow within the organization. Always able to get training if it was necessary Good bonus structure Cons Very difficult to keep work-life balance as it was run very lean. Sometimes struggled with members in different offices and inter-communication.", "rating": 5, "pros": "Easy company to work for, always had opportunities to grow within the organization.", "cons": "Very difficult to keep work-life balance as it was run very lean.", "advice": null}, {"title": "A Great Place to Work, but Don't Get Too Attached!", "text": "Pros My colleagues were undoubtedly the best in the industry....dedicated to the company, especially those who had survived acquisitions. Team work, low stress environment among the neighboring colleagues. Everyone collaborated and enjoyed their job, and were dedicated to the clients. Direct supervisors encouraged everyone and your input matters. Benefits and pay were great. Cons Senior management only seem to care about the bottom line, and seemed to love to let go of people who were in dedicated long-time service to the company. People who were creative, thought out of the box, and worked for their clients day and night were let go and replaced with people just out of college or other colleagues who were not with the company for very long. Clearly this was to save money. Don't get too comfortable, your days will be numbered! Outsourcing is also a favorite hobby of theirs....having cut out whole teams to outsource in other countries. Advice to Management More appreciation for people with longevity would appreciated. They were there for a long time for a reason. Outsourcing should be a last resort. People were put down or terminated for being dedicated to their clients and always available, but its our dedication that sets us apart. Work on being a great company again..... newsflash, that includes KEEPING your talent, not replacing it.", "rating": 3, "pros": "My colleagues were undoubtedly the best in the industry....dedicated to the company, especially those who had survived acquisitions. Team work, low stress environment among the neighboring colleagues. Everyone collaborated and enjoyed their job, and were dedicated to the clients. Direct supervisors encouraged everyone and your input matters. Benefits and pay were great.", "cons": "Senior management only seem to care about the bottom line, and seemed to love to let go of people who were in dedicated long-time service to the company. People who were creative, thought out of the box, and worked for their clients day and night were let go and replaced with people just out of college or other colleagues who were not with the company for very long. Clearly this was to save money. Don't get too comfortable, your days will be numbered! Outsourcing is also a favorite hobby of theirs....having cut out whole teams to outsource in other countries.", "advice": "More appreciation for people with longevity would appreciated. They were there for a long time for a reason. Outsourcing should be a last resort. People were put down or terminated for being dedicated to their clients and always available, but its our dedication that sets us apart. Work on being a great company again..... newsflash, that includes KEEPING your talent, not replacing it."}, {"title": "Great place to work", "text": "Pros People and salary vs. workload Cons Market conditions can add stress", "rating": 5, "pros": "People and salary vs. workload", "cons": "Market conditions can add stress", "advice": null}, {"title": "Decent Job", "text": "Pros Good benefits package (health and dental insurance) Cons Lack of continuity between departments", "rating": 3, "pros": "Good benefits package (health and dental insurance)", "cons": "Lack of continuity between departments", "advice": null}, {"title": "It was a great experience working with fine professionals.", "text": "Pros The work environment is such a wonderful one where it's really easy to blend in the culture. You run and come across people from all over the wold. Cons The cut throats nature of business in today highly competitive global work force Advice to Management I do not have any comment.", "rating": 5, "pros": "The work environment is such a wonderful one where it's really easy to blend in the culture. You run and come across people from all over the wold.", "cons": "The cut throats nature of business in today highly competitive global work force", "advice": "I do not have any comment."}, {"title": "Great place to work", "text": "Pros Great people to work with, focused and open leadership team, good compensation and benefit plans, geographically dispersed, diverse Cons Career path not very clearly defined (but is changing), flexibility to experiment is low, failure is often not an option", "rating": 5, "pros": "Great people to work with, focused and open leadership team, good compensation and benefit plans, geographically dispersed, diverse", "cons": "Career path not very clearly defined (but is changing), flexibility to experiment is low, failure is often not an option", "advice": null}, {"title": "Enjoyed the work there.", "text": "Pros Very dynamic environment. Busy work schedule. Enjoyed the work there. Cons Busy work schedule. Financial outlook remains questionable. Advice to Management Please stay on track.", "rating": 5, "pros": "Very dynamic environment. Busy work schedule. Enjoyed the work there.", "cons": "Busy work schedule. Financial outlook remains questionable.", "advice": "Please stay on track."}, {"title": "Not what it used to be, but a good group of people (or what's left)", "text": "Pros NASDAQ has some decent internal time off policies and overall benefits Cons Last two years has seen a lot of good people move on to other roles Advice to Management Management needs to do a better job retaining talent", "rating": 3, "pros": "NASDAQ has some decent internal time off policies and overall benefits", "cons": "Last two years has seen a lot of good people move on to other roles", "advice": "Management needs to do a better job retaining talent"}, {"title": "Intern", "text": "Pros Nice people and great offices. Cons Most are happy with just being here, and have a \"just get by\" attitude.", "rating": 3, "pros": "Nice people and great offices.", "cons": "Most are happy with just being here, and have a \"just get by\" attitude.", "advice": null}, {"title": "Lean Business Model", "text": "Pros The compensation and bonus is generous. Cons Management has a very poor \"lean\" business model in place for their workforce. Employees feel overworked, pressured, stressed and resentful. I don't have much faith in upper management and their decision-making or goals for future growth. Cost savings on workforce will end up costing the business in other ways in the long run. Advice to Management Try back-filling positions when people leave the company, instead of dumping the extra work onto the people who stick around. A company is not just desks and computers- it's people. The best talent won't stick around if this pattern continues.", "rating": 1, "pros": "The compensation and bonus is generous.", "cons": "Management has a very poor \"lean\" business model in place for their workforce. Employees feel overworked, pressured, stressed and resentful. I don't have much faith in upper management and their decision-making or goals for future growth. Cost savings on workforce will end up costing the business in other ways in the long run.", "advice": "Try back-filling positions when people leave the company, instead of dumping the extra work onto the people who stick around. A company is not just desks and computers- it's people. The best talent won't stick around if this pattern continues."}, {"title": "So far, so good. Definitely beats the last place.", "text": "Pros Significantly better and more transparent bonus scheme than prior employer Cons Leadership has been lacking at the middle and lower levels, but I expect that to change soon.", "rating": 5, "pros": "Significantly better and more transparent bonus scheme than prior employer", "cons": "Leadership has been lacking at the middle and lower levels, but I expect that to change soon.", "advice": null}, {"title": "good work life balance", "text": "Pros Good place to work with good people Cons senior management has no direction", "rating": 3, "pros": "Good place to work with good people", "cons": "senior management has no direction", "advice": null}, {"title": "Director, Relationship Management", "text": "Pros Great colleagues, learn a lot, good salary Cons Some of senior management are not that bright; others are excellent. It really depends on your manager, who can make your life hell while there. CEO has cut back so much that it is affecting trading platform. Advice to Management Stop with the cutbacks; treat your employees better. Do not rule by fear.", "rating": 5, "pros": "Great colleagues, learn a lot, good salary", "cons": "Some of senior management are not that bright; others are excellent. It really depends on your manager, who can make your life hell while there.", "advice": "Stop with the cutbacks; treat your employees better. Do not rule by fear."}, {"title": "Very happy to work here. Work is challenging. Tough hours but rewards are also great.", "text": "Pros Good total rewards and pay for performance package. Good team members. Cons Career growth could be limited. But things will hopefully move in the right direction. Sometimes long stressful hours. Less vacation. Advice to Management Senior management does not understand how lower level works really hard. They should plan things well.", "rating": 5, "pros": "Good total rewards and pay for performance package. Good team members.", "cons": "Career growth could be limited. But things will hopefully move in the right direction. Sometimes long stressful hours. Less vacation.", "advice": "Senior management does not understand how lower level works really hard. They should plan things well."}, {"title": "Cold corporate culture with limited resources", "text": "Pros Tasks keep you busy daily. Client-facing opportunities. Good mix of financial services and technology platform. Corporate environment. Cons Very limited workspace, such as desks, conference rooms, kitchen, restroom. Advice to Management Pay more attention to your shining stars from the ground up. Some middle managers are not fully qualified for their roles - keeps saying \"I don't know\" when you ask technical questions rather than mobilize resources to get answers.", "rating": 3, "pros": "Tasks keep you busy daily. Client-facing opportunities. Good mix of financial services and technology platform. Corporate environment.", "cons": "Very limited workspace, such as desks, conference rooms, kitchen, restroom.", "advice": "Pay more attention to your shining stars from the ground up. Some middle managers are not fully qualified for their roles - keeps saying \"I don't know\" when you ask technical questions rather than mobilize resources to get answers."}, {"title": "Great place to learn and be prepared for a fast-paced environment", "text": "Pros It's a great place to learn about the U.S. securities exchanges and financial services industry. You will always be learning something new each day. Cons Depending on the department, opportunities for attending formal training may not always be available.", "rating": 3, "pros": "It's a great place to learn about the U.S. securities exchanges and financial services industry. You will always be learning something new each day.", "cons": "Depending on the department, opportunities for attending formal training may not always be available.", "advice": null}, {"title": "Competitive work environment", "text": "Pros Excellent place to build your resume and gain experience Cons A bit political and you need to be out of NYC for major advancement opportunities", "rating": 5, "pros": "Excellent place to build your resume and gain experience", "cons": "A bit political and you need to be out of NYC for major advancement opportunities", "advice": null}, {"title": "Was very satisfied with my position at NASDAQ OMX", "text": "Pros The work environment was very pleasant, the work load was always very steadily busy, location of office was a great commute for me, management team was very nice to work with, it was great work experience for me Cons budget cuts cost me my job or I would still be there, I would work for NASDAQ at any given moment, it was great work experience for me", "rating": 5, "pros": "The work environment was very pleasant, the work load was always very steadily busy, location of office was a great commute for me, management team was very nice to work with, it was great work experience for me", "cons": "budget cuts cost me my job or I would still be there, I would work for NASDAQ at any given moment, it was great work experience for me", "advice": null}, {"title": "Anonymous", "text": "Pros Had a wonderful experience working wih peers and management. it was a great experience learning about the working of the stock market and its rules. Cons None that i could think of. Advice to Management None.", "rating": 5, "pros": "Had a wonderful experience working wih peers and management. it was a great experience learning about the working of the stock market and its rules.", "cons": "None that i could think of.", "advice": "None."}, {"title": "Terrible management. CEO needs to step-down", "text": "Pros ESPP plan, Brand name, view from the building Cons This company does not believe in investing in its people. Their entire attitude towards their employees is to get the most out of them while giving them the least amount of training, growth opportunity, comp, respect or appreciation. CEO micromanages everything, down to the hiring of analyst level positions. Surrounded by yes men/women who can do nothing to help the staff. Constant fire drills and chaos in the work. Everything has to be done now, at the whim of senior management. Bottom line is everything, people mean nothing. Advice to Management In order to grow, you need to invest in your people and infrastructure. Constant cost cutting is not the the way to improve your product and ultimately your bottom line.", "rating": 3, "pros": "ESPP plan, Brand name, view from the building", "cons": "This company does not believe in investing in its people. Their entire attitude towards their employees is to get the most out of them while giving them the least amount of training, growth opportunity, comp, respect or appreciation. CEO micromanages everything, down to the hiring of analyst level positions. Surrounded by yes men/women who can do nothing to help the staff. Constant fire drills and chaos in the work. Everything has to be done now, at the whim of senior management. Bottom line is everything, people mean nothing.", "advice": "In order to grow, you need to invest in your people and infrastructure. Constant cost cutting is not the the way to improve your product and ultimately your bottom line."}, {"title": "Was great for a while then went downhill very rapidly after large acquisition that happened in June '13.", "text": "Pros Very good benefits, base pay, high quality coworkers. Some legacy products are top notch. Good company name to have on your resume. Cons Management in place now with the Thomson acquisition that has absolutely no clue what they are doing. Misstep after misstep from product roll-outs to Facebook IPO, to exchange outage in August '13. CEO will not accept any responsibility (buck does not stop with him), but will quickly place blame on internal technology issues or blame outside factors. Constantly in fear of losing your job regardless of your loyalty/tenure or how well you are doing. Employees looking to leave like rats off a sinking ship. Meetings that are typically a complete and utter waste of time. Mandate from CEO is to constantly cut costs and increase margins (like a broken record), but eventually there is no more meat left on the bone to cut. CEO is surrounded by \"yes\" men/women and if you're liked by executive management you'll have a job forever at Nasdaq. VP level on up is too concerned with ladder climbing.Too many fiefdom's that don't communicate well and are all selling into the same accounts which creates confusion for the prospects/clients. Advice to Management Invest in your people vs giving yourselves raises...training benefits everyone and adds to your bottom line via increased sales. Also, learn to treat your employees with respect vs. treating them like cattle. Remove yourself from your ivory towers and get out with your divisions to better understand their challenges. Last but not least, please stop the old school 'rule by fear' method...it doesn't work to motivate people.", "rating": 3, "pros": "Very good benefits, base pay, high quality coworkers. Some legacy products are top notch. Good company name to have on your resume.", "cons": "Management in place now with the Thomson acquisition that has absolutely no clue what they are doing. Misstep after misstep from product roll-outs to Facebook IPO, to exchange outage in August '13. CEO will not accept any responsibility (buck does not stop with him), but will quickly place blame on internal technology issues or blame outside factors.", "advice": "Invest in your people vs giving yourselves raises...training benefits everyone and adds to your bottom line via increased sales. Also, learn to treat your employees with respect vs. treating them like cattle. Remove yourself from your ivory towers and get out with your divisions to better understand their challenges. Last but not least, please stop the old school 'rule by fear' method...it doesn't work to motivate people."}, {"title": "Well, what can I say. Really quite bad.", "text": "Pros Good benefits including 6% 401(k) match, but no public transportation stipend. Decent hours, but they are inflexible. Office is in the Financial District and the commute is easy. Cons Base salary is too low for San Francisco. The Thomson Reuters acquisition process was a complete disaster...trying to integrate a larger team into a smaller one in the way they tried just didn't work. Trying to integrate the legacy TR and NASDAQ products together isn't working either. Clients are very unhappy and are canceling left and right to go to competitors. Five sales people have left in the past month alone to get off of the sinking ship. Communication between sales and service is so disjointed that management thinks using Excel spreadsheets is the way to go. There are processes in place just for the sake of having a process. This company is probably great for you if you are looking to plod along in the same position for 5+ years. Other employees aren't driven and are content with 'stability' over growth. Do not come here if you prefer working in a start-up environment because, contrary to what NASDAQ might tell you, they are not an 'aspiring technology company' and cannot possibly compete with smaller, more nimble competitors. Advice to Management Treat your employees better. Stop cutting costs at literally every corner and start treating us like it's your employees that make the company. And stop making life for clients difficult just because you can.", "rating": 1, "pros": "Good benefits including 6% 401(k) match, but no public transportation stipend. Decent hours, but they are inflexible. Office is in the Financial District and the commute is easy.", "cons": "Base salary is too low for San Francisco. The Thomson Reuters acquisition process was a complete disaster...trying to integrate a larger team into a smaller one in the way they tried just didn't work. Trying to integrate the legacy TR and NASDAQ products together isn't working either. Clients are very unhappy and are canceling left and right to go to competitors. Five sales people have left in the past month alone to get off of the sinking ship. Communication between sales and service is so disjointed that management thinks using Excel spreadsheets is the way to go. There are processes in place just for the sake of having a process.", "advice": "Treat your employees better. Stop cutting costs at literally every corner and start treating us like it's your employees that make the company. And stop making life for clients difficult just because you can."}, {"title": "Interesting.", "text": "Pros Talented people, good salary & benefits, interesting work Cons Understaffed to the point of always putting out fires; difficult to catch up. Lack of transparency particularly in HR matters. Little to no investment in employee development. Micro-management by CEO and executive team. Management structure very hierarchical. Focused on the numbers and the money with little regard for anything else. Advice to Management Leave the executive area and get to know your employees. Hold all businesses to the same standards.", "rating": 3, "pros": "Talented people, good salary & benefits, interesting work", "cons": "Understaffed to the point of always putting out fires; difficult to catch up. Lack of transparency particularly in HR matters. Little to no investment in employee development. Micro-management by CEO and executive team. Management structure very hierarchical. Focused on the numbers and the money with little regard for anything else.", "advice": "Leave the executive area and get to know your employees. Hold all businesses to the same standards."}, {"title": "Not all that fancy", "text": "Pros Good pay. Good location (Rockville, MD) Cons Not clear direction. Micro-managed. Tons of meaningless meetings. No clear career path. Unfair treatment.", "rating": 3, "pros": "Good pay. Good location (Rockville, MD)", "cons": "Not clear direction. Micro-managed. Tons of meaningless meetings. No clear career path. Unfair treatment.", "advice": null}, {"title": "Old school", "text": "Pros Great salary & benefits. Stable, with great long term opportunities. Cons Inability to execute - think Facebook IPO. Micromanagement from the very top.", "rating": 3, "pros": "Great salary & benefits.", "cons": "Inability to execute - think Facebook IPO.", "advice": null}, {"title": "Not a great place to work", "text": "Pros Great coworkers, nice travel perks Cons Not staffed sufficiently, overworked. Not managed well Advice to Management Fix the broad operational issues", "rating": 1, "pros": "Great coworkers, nice travel perks", "cons": "Not staffed sufficiently, overworked. Not managed well", "advice": "Fix the broad operational issues"}, {"title": "A Horrible Place to Work", "text": "Pros They do offer free coffee. Cons What can I say? Who wants to work in a place with no training budget and managers who speak to employees in a condescending and insulting manner. On top of that the office environment in Rockville is terrible and allows for very little privacy while working. In the long run, you are much better off seeking experience elsewhere and many other organizations in the Washington metro region offer better retirement packages. Advice to Management Consider investing in your employees and treating them with professional respect and courtesy rather than tearing them down in front of others.", "rating": 1, "pros": "They do offer free coffee.", "cons": "What can I say? Who wants to work in a place with no training budget and managers who speak to employees in a condescending and insulting manner. On top of that the office environment in Rockville is terrible and allows for very little privacy while working. In the long run, you are much better off seeking experience elsewhere and many other organizations in the Washington metro region offer better retirement packages.", "advice": "Consider investing in your employees and treating them with professional respect and courtesy rather than tearing them down in front of others."}, {"title": "From great to I'm not sure", "text": "Pros Great group of people who are very talented and smart work at NASDAQ. Cons No clear direction and very thin staff makes for difficulty in keeping things running up to par with how things should be. Advice to Management Put money into more development and talent. It will pay off", "rating": 3, "pros": "Great group of people who are very talented and smart work at NASDAQ.", "cons": "No clear direction and very thin staff makes for difficulty in keeping things running up to par with how things should be.", "advice": "Put money into more development and talent. It will pay off"}, {"title": "Nasdaq OMX", "text": "Pros There is a lot of change within the organization - through acquisitions and internal growth, so it's always interesting Cons The constant change can wear you down at times and like most companies now, there is constant pressure to keep headcount low. Advice to Management For proper growth, sometimes it's good to invest in infrastructure", "rating": 5, "pros": "There is a lot of change within the organization - through acquisitions and internal growth, so it's always interesting", "cons": "The constant change can wear you down at times and like most companies now, there is constant pressure to keep headcount low.", "advice": "For proper growth, sometimes it's good to invest in infrastructure"}, {"title": "Part of the company is in the politics fight", "text": "Pros nice view in the building Cons strange working culture in the firm", "rating": 3, "pros": "nice view in the building", "cons": "strange working culture in the firm", "advice": null}, {"title": "Poor leadership that has no strategy for generating revenue going forward", "text": "Pros - New office space - Low expectations (easy to coast) - Good junior level people Cons - Terrible leadership - Lots of turnover - Multiple layoffs in the past two years (more likely) - No longer growing revenue - No future direction Advice to Management Hire smarter Treat junior people better", "rating": 3, "pros": "- New office space", "cons": "- Terrible leadership", "advice": "Hire smarter"}, {"title": "Nasdaq OMX in New York", "text": "Pros Very intelligent coworkers, always exciting. if you want responsibility, they will give it to you Cons things change so fast. it can be hard to keep up with all that is happening.", "rating": 5, "pros": "Very intelligent coworkers, always exciting. if you want responsibility, they will give it to you", "cons": "things change so fast. it can be hard to keep up with all that is happening.", "advice": null}, {"title": "Could be worse but...", "text": "Pros Great co workers try to make it a fun place to work. The pay is pretty decent. Relatively flexible hours when needed. Cons Systems used are outdated. Went backwards with ticketing systems which are managed in Sweden. Because of this outdated system, simple tasks are made monstrous which is counterproductive. Sometimes isn't worth the pay. Advice to Management Listen to your people. Don't do all the talking nor assume you know what's going on. Slow down and listen. PLEASE.", "rating": 3, "pros": "Great co workers try to make it a fun place to work. The pay is pretty decent. Relatively flexible hours when needed.", "cons": "Systems used are outdated. Went backwards with ticketing systems which are managed in Sweden. Because of this outdated system, simple tasks are made monstrous which is counterproductive. Sometimes isn't worth the pay.", "advice": "Listen to your people. Don't do all the talking nor assume you know what's going on. Slow down and listen. PLEASE."}, {"title": "Do you like chaos?", "text": "Pros Pay is fair. If you like being paid the same salary forever. Cons No structure. No strategy. Completely reactive. Political. Backstabbing. Nepotism (a whole LOT of nepotism). No investment in brand. No money to spend on anything. No career advancement. I myself have literally not had a manager for 3 years. Advice to Management Business is more than the stock price. Invest in people and quality products and your numbers will match, eventually.", "rating": 3, "pros": "Pay is fair. If you like being paid the same salary forever.", "cons": "No structure. No strategy. Completely reactive. Political. Backstabbing. Nepotism (a whole LOT of nepotism). No investment in brand. No money to spend on anything. No career advancement. I myself have literally not had a manager for 3 years.", "advice": "Business is more than the stock price. Invest in people and quality products and your numbers will match, eventually."}, {"title": "Got a little ahead of itself, now paying the price", "text": "Pros -Very sharp group of people from top to bottom -Not a bank or a startup...somewhere in the middle -Allow career growth for exceptional employees -Work in assets that are new and interesting -Lot of exposure to different business models and technologies Cons -Company is no longer a cash cow -Very slow to develop the online tools -Management isn't experienced in running a mid-sized company -A lot of the best folks left when the company began to decline -Skill set isn't easily transferable within the finance community -Comp isn't what it used to be -Lack of overall direction confuses employees Advice to Management I think they'll figure something out eventually but they need to nail down a direction for the company. Are you a broker or a software developer?", "rating": 5, "pros": "-Very sharp group of people from top to bottom", "cons": "-Company is no longer a cash cow", "advice": "I think they'll figure something out eventually but they need to nail down a direction for the company. Are you a broker or a software developer?"}, {"title": "Better than Best", "text": "Pros Good Company, Good managerial staff, Good Working condition Cons No negative thougths about NASDAQ Stock Market Advice to Management No advise needed to give to managerial staff", "rating": 5, "pros": "Good Company, Good managerial staff, Good Working condition", "cons": "No negative thougths about NASDAQ Stock Market", "advice": "No advise needed to give to managerial staff"}, {"title": "Fast-paced exciting work with Global Brand, CEO drives everything though", "text": "Pros Fast paced, sharp colleagues. Mission-critical work and visibility in the industry. Worldwide leader and great strategic charter from CEO. Cons Politics, fear of CEO from most managers. IT group did not face suitable and justified accountability after the Facebook fiasco. Advice to Management Examine if the sr managers you hire can take a very top-down organization. If not, don't hire them, because this is one company the CEO runs the show and his word/fingerprints are on everything.", "rating": 5, "pros": "Fast paced, sharp colleagues. Mission-critical work and visibility in the industry. Worldwide leader and great strategic charter from CEO.", "cons": "Politics, fear of CEO from most managers. IT group did not face suitable and justified accountability after the Facebook fiasco.", "advice": "Examine if the sr managers you hire can take a very top-down organization. If not, don't hire them, because this is one company the CEO runs the show and his word/fingerprints are on everything."}, {"title": "Opportunities within the framework of defendable decisions", "text": "Pros Opportunities to contribute to interesting projects. Peers, teams & coworkers that range from average to excellent in skill & personality. Compensation - Consists of a base salary with a 5,10,15,20,40% yearly bonus depending on one's position (e.g. associate, professional, senior, director, vp, etc) - ESPP is available in 6 month intervals at a 15% discount - Healthcare kicks in immediately rather than after some period (90 day) - RSUs are granted yearly and vest after 4 years. - 4% 401k match w/ Vanguard Cons As with any large organization, it suffers similar challenges. - Plenty of turnover and organizational restructuring. Each year titles are renamed, groups are volleyed back and forth between senior managers in the name of \"growth\" \"efficiency\" \"synergy\" This leads to an unfortunate loss of direction each time a reorganization/management shift occurs in the technology organization. Despite these shifts, the groups and the organizational process/workflow/structure have remained relatively unchanged. The same groups talk to each other to get the same work accomplished. Rather than the Greens talking to the Yellows, it simply shifts to the Oranges talking to the Browns in title only. It is very similar to the observation that mergers fail due to organizational processes not meshing together. - A technology company severely incapacitated by the recent corporate culture of defendable decisions since the technology issues of the largest IPO. e.g. \"No one ever got fired for hiring IBM.\" This has mainly led to the culture comprised of skilled, agile teams, capable of building solutions, to incapable teams that have lost their top talent to turnover. The policies put forth make for a severely demoralizing & demotivating a workforce that's otherwise tremendously capable. This makes for a fairly oppressive work environment and a structure that engenders mistrust. A small bit of sanity comes from the small alliances that are forged amongst the Romeos & Juliets of groups at odds with each other. - Senior management is severely disconnected from the ground floor workers as they are incapable of dog-fooding the products & policies they put forth. As many know, an idea does not sell itself, but the hard work and attention to detail make the difference. By pushing policies in the name of leaving a legacy, resume bullet point, or being a yes-man, relationships & respect are broken. - ADHD inducing distractions. Being an open setup, there's a tremendous lack of ability to focus on a task at hand. Advice to Management Bob G asks at group lunches, \"What can we do to improve our company?\" When most of the employees are speechless, it's not that there aren't any improvements to make, it's that they are paralyzed from speaking as they don't know where to begin. - Our salaries reflect that we are a knowledge workforce rather than a labor workforce. The most important competitive advantage of a knowledge workforce is the cultivation and management of that knowledge & critical thinking base. Top talented engineers make great team leads, however are very unlikely to be good managers. - Stop reorganizing the company. History has shown that war has not been a struggle over territory as much as the battle for a shift in power. As different heads continue to battle for territory, it's a reflection of individuals shifting their priorities from EXCELLENCE to SELF-PRESERVATION. As management's focus shifts to self-preservation, competitive edge is lost as top talent decides that their sanity is more important than the compensation package. - Focus on building & forging employee relationships rather than relying on top-down edicts of how employees should work. Build a collaborative environment where minds can mesh. Google about the design of the Bell Labs Hallway. When it comes to fixing problems, there are 2 types of consultants. Ones that are looking to bill you for putting on a show, and ones that understand that the individuals best suited to fixing an organization are the individuals within it. The latter consultant merely facilitates the process of finding the individuals capable of a finding a fix and facilitating that fix. - Invest in infrastructure and building environments capable of being tested during work hours rather than during the weekends. A burned out employee is incapable of contributing to the knowledge base of the organization as a whole.", "rating": 3, "pros": "Opportunities to contribute to interesting projects.", "cons": "As with any large organization, it suffers similar challenges.", "advice": "Bob G asks at group lunches, \"What can we do to improve our company?\""}, {"title": "Great company to work for.", "text": "Pros Ability to make a lot of money. Cons Lots of turnover in the employee base as well as constant change.", "rating": 5, "pros": "Ability to make a lot of money.", "cons": "Lots of turnover in the employee base as well as constant change.", "advice": null}, {"title": "Pretty Cool", "text": "Pros Our team is really making a difference. Cons Sometimes there's weird office politics. Advice to Management There are too many people is one office. Get more space!", "rating": 5, "pros": "Our team is really making a difference.", "cons": "Sometimes there's weird office politics.", "advice": "There are too many people is one office. Get more space!"}, {"title": "Does it get any worse?", "text": "Pros My colleagues were great to work with. Cons Unfortunately NASDAQ was the worst company I have ever worked for. It starts at the top and ends with the local sales management (specifically in Chicago). They say you're only as strong as your weakest link and it's quite imperative that the sales managers are destroying what could be a great place to work for. Advice to Management Just because you're NASDAQ doesn't mean your solutions are ready for the market place. If you want to be competitive, invest in product development and the appropriate resources to support those products. Also, it's 2013 and scare tactics to your employees don't work in this day and age. It only isolates you and make people not want to work for your organization.", "rating": 1, "pros": "My colleagues were great to work with.", "cons": "Unfortunately NASDAQ was the worst company I have ever worked for. It starts at the top and ends with the local sales management (specifically in Chicago). They say you're only as strong as your weakest link and it's quite imperative that the sales managers are destroying what could be a great place to work for.", "advice": "Just because you're NASDAQ doesn't mean your solutions are ready for the market place. If you want to be competitive, invest in product development and the appropriate resources to support those products. Also, it's 2013 and scare tactics to your employees don't work in this day and age. It only isolates you and make people not want to work for your organization."}, {"title": "Good co-workers bad managers", "text": "Pros Good co-workers who will help you in a pinch. Cons Most managers clueless and should not have their jobs, just look at what happened with the Facebook IPO. Most of what you learn is by yourself or from a co-worker. No help from Management. Low pay, long hours and micromanagement. Advice to Management Listen to rank and file employees", "rating": 3, "pros": "Good co-workers who will help you in a pinch.", "cons": "Most managers clueless and should not have their jobs, just look at what happened with the Facebook IPO. Most of what you learn is by yourself or from a co-worker. No help from Management. Low pay, long hours and micromanagement.", "advice": "Listen to rank and file employees"}, {"title": "Challenges facing the stock market", "text": "Pros Good benefits, laid back work environment Cons Current management is not equipped to handle the challenges facing the market and technology group Advice to Management Step aside and let the younger folks start running the company", "rating": 3, "pros": "Good benefits, laid back work environment", "cons": "Current management is not equipped to handle the challenges facing the market and technology group", "advice": "Step aside and let the younger folks start running the company"}, {"title": "Their idea of motivation is to use scare tactics", "text": "Pros Decent salary, easy commute, opportunity to experience different roles Cons Scare tactics used by management, not a lot of motivation or training provided, seen many people fired on the spot even after reaching their targets, acquire companies, but dont know how to integrate them successfully", "rating": 3, "pros": "Decent salary, easy commute, opportunity to experience different roles", "cons": "Scare tactics used by management, not a lot of motivation or training provided, seen many people fired on the spot even after reaching their targets, acquire companies, but dont know how to integrate them successfully", "advice": null}, {"title": "Bipolar", "text": "Pros IT vs Finance - If you come in with a few years of experience the salaries are fair but banks and other institiutions are better. Cons If you're in IT and want to learn about finance, forget itt, and if you have no or little experiance they will exploit you. Advice to Management Hire experienced people with good mentoring skills and let people do their jobs, don't make it feel like a dead end right off the bat. and please let creative people create. People in upper management have lost sight of fun, fast and friendly.", "rating": 3, "pros": "IT vs Finance - If you come in with a few years of experience the salaries are fair but banks and other institiutions are better.", "cons": "If you're in IT and want to learn about finance, forget itt, and if you have no or little experiance they will exploit you.", "advice": "Hire experienced people with good mentoring skills and let people do their jobs, don't make it feel like a dead end right off the bat. and please let creative people create. People in upper management have lost sight of fun, fast and friendly."}, {"title": "Great learning experience, gave me many skills for future employment opportunities, great people to work with", "text": "Pros Care about employees, Great employee benefits, Great office environment Cons Long hours, Management turnover, Career advancement", "rating": 5, "pros": "Care about employees, Great employee benefits, Great office environment", "cons": "Long hours, Management turnover, Career advancement", "advice": null}, {"title": "It was a pleasure to work for NASDAQ OMX, my time there was well utilized", "text": "Pros the office atmosphere was very comfortable, the co-workers were great, work was always flowing, no stress Cons budget cuts came and hit all departments, so unfortunately that was the only downside because i was one of the cuts Advice to Management take me back is all i can say, i was very happy there", "rating": 5, "pros": "the office atmosphere was very comfortable, the co-workers were great, work was always flowing, no stress", "cons": "budget cuts came and hit all departments, so unfortunately that was the only downside because i was one of the cuts", "advice": "take me back is all i can say, i was very happy there"}, {"title": "Down to the earth working environment", "text": "Pros It depends on which floor or department you're with, you can wear jeans and sneakers to work. Cons Your boss may not know what you're doing so you may not be appreciated. Advice to Management Some jobs need to be done by more than two persons for controlling purpose. Having only one person works on certain things may help to save cost but will risk running into errors.", "rating": 3, "pros": "It depends on which floor or department you're with, you can wear jeans and sneakers to work.", "cons": "Your boss may not know what you're doing so you may not be appreciated.", "advice": "Some jobs need to be done by more than two persons for controlling purpose. Having only one person works on certain things may help to save cost but will risk running into errors."}, {"title": "Great Colleagues, but be expected to be worked to the bone", "text": "Pros The workforce is relatively diverse, including a fair number of women in relatively high positions and are generally smart and fun to work with. Employees generally work well with other departments. Nasdaq permits many employees to work from home either part or full time. Cons The amount of work that is expected and the amount of pressure put on emplyees to complete that work can result to some very crazy working hours, often with no compensation provided. Their is an expectation that everything should be done perfectly, but management is not will to pay for the time it takes to achieve that goal. Employee turnover is relatively high because of the mismatch of expecations. Nasdaq expects their employees to be on call and on-line more or less 24/7. Advice to Management Managment should be more realistic with their employees and the amount of work they are expected to do and compensate them appropriately. While the bottom line is always the focus of any corporation, treating employees unfairlly is not a cost effective strategy. The high turnover alone and avoidable crisis due to lack of staff could be easily balanced by running the firm in not quite so lean and mean business model.", "rating": 3, "pros": "The workforce is relatively diverse, including a fair number of women in relatively high positions and are generally smart and fun to work with. Employees generally work well with other departments. Nasdaq permits many employees to work from home either part or full time.", "cons": "The amount of work that is expected and the amount of pressure put on emplyees to complete that work can result to some very crazy working hours, often with no compensation provided. Their is an expectation that everything should be done perfectly, but management is not will to pay for the time it takes to achieve that goal. Employee turnover is relatively high because of the mismatch of expecations. Nasdaq expects their employees to be on call and on-line more or less 24/7.", "advice": "Managment should be more realistic with their employees and the amount of work they are expected to do and compensate them appropriately. While the bottom line is always the focus of any corporation, treating employees unfairlly is not a cost effective strategy. The high turnover alone and avoidable crisis due to lack of staff could be easily balanced by running the firm in not quite so lean and mean business model."}, {"title": "Enjoyed sw development, 24*365, lousy physical environment, lots of pressure, interesting problems.", "text": "Pros The NYC office is doing interesting development in Linux, pay and options can be pretty good if you happen to be one of the favored folks. Cons Many developers are on call 24*365 even when on vacation, long days, weekend presence often mandatory. The open plan offices in NYC and CT are noisy and non-developers are often on the phone, meetings take place all over. Tough place to concentrate, but many can work from home. Regular \"downsizing\".", "rating": 3, "pros": "The NYC office is doing interesting development in Linux, pay and options can be pretty good if you happen to be one of the favored folks.", "cons": "Many developers are on call 24*365 even when on vacation, long days, weekend presence often mandatory. The open plan offices in NYC and CT are noisy and non-developers are often on the phone, meetings take place all over. Tough place to concentrate, but many can work from home.", "advice": null}, {"title": "Unfufilling", "text": "Pros Excellent industy networking opportunities are at your fingertips. Cons If they could run the company with 10 people they would. Automation over relationships is the mantra. Advice to Management People matter. In the end it is they that are responsible for growth. Automation does not bring in business on its own.", "rating": 3, "pros": "Excellent industy networking opportunities are at your fingertips.", "cons": "If they could run the company with 10 people they would. Automation over relationships is the mantra.", "advice": "People matter. In the end it is they that are responsible for growth. Automation does not bring in business on its own."}, {"title": "Very satisfying - good opportunity for growth and substantial reward when growth is achieved", "text": "Pros Commitment to growth; global brand and locations; opportunties to relocate for international experience; very strong benefits package; caliber of co-workers Cons budget consciousness even as push for growth exists; to much attention to smaller details by senior management; need to leverage and strengthen brand Advice to Management Invest in growth areas and stregthen the brand", "rating": 5, "pros": "Commitment to growth; global brand and locations; opportunties to relocate for international experience; very strong benefits package; caliber of co-workers", "cons": "budget consciousness even as push for growth exists; to much attention to smaller details by senior management; need to leverage and strengthen brand", "advice": "Invest in growth areas and stregthen the brand"}, {"title": "Overwhelming", "text": "Pros Competitive compensation Good Vacation accrual ESPP High amount of flexibility in choosing what to work on Work with intelligent, thoughtful coworkers Solve interesting problems Cons Poor Management Not much opportunity for advancement Every man for himself type of organization Advice to Management Listen to the feedback of your employees and use that information to effectuate change within the organization, make each group more efficient and streamlined and you boost profits for everyone.", "rating": 3, "pros": "Competitive compensation", "cons": "Poor Management", "advice": "Listen to the feedback of your employees and use that information to effectuate change within the organization, make each group more efficient and streamlined and you boost profits for everyone."}, {"title": "Poor Management, Information sharing etc", "text": "Pros Good brand to have on a resume, good benefits, colleagues are nice, decent pay depending on which department you work in. Cons No guidance from upper management, lack of information sharing, rewards and promotions aren't given fairly, lack of internal mobility, lack of resources. NASDAQ OMX likes to spread themselves too thin in order to reduce expenses, no training programs at all. NASDAQ OMX rewards people based on how much money they bring to the company regardless of their effort, and they overlook the people that actually do all the work behind the scenes. Advice to Management look at the resources you have and don't take on too many projects at once, more recognition for the employees that work hard.", "rating": 3, "pros": "Good brand to have on a resume, good benefits, colleagues are nice, decent pay depending on which department you work in.", "cons": "No guidance from upper management, lack of information sharing, rewards and promotions aren't given fairly, lack of internal mobility, lack of resources. NASDAQ OMX likes to spread themselves too thin in order to reduce expenses, no training programs at all. NASDAQ OMX rewards people based on how much money they bring to the company regardless of their effort, and they overlook the people that actually do all the work behind the scenes.", "advice": "look at the resources you have and don't take on too many projects at once, more recognition for the employees that work hard."}, {"title": "What would you like: Job security or Growth- Nasdaq is 1st one.", "text": "Pros The Brand name is good Cons No growth opportunities for employees.", "rating": 3, "pros": "The Brand name is good", "cons": "No growth opportunities for employees.", "advice": null}, {"title": "A very satisfying experience in an environment that definitely respects individuals.", "text": "Pros If you like a fast paced, flexible and exciting environment you will enjoy working here. Working at Nasdaq is certainly a different and rewarding experience. Cons You need to be tuned into every group and need to know what is going on as the information sharing is difficult to come by. Not much training to keep your technical skills alive. Advice to Management Focus on building stronger teams, be more proactive in providing training and abilities for employees to enhance their skills. Employees are the most important assets this company has!", "rating": 5, "pros": "If you like a fast paced, flexible and exciting environment you will enjoy working here. Working at Nasdaq is certainly a different and rewarding experience.", "cons": "You need to be tuned into every group and need to know what is going on as the information sharing is difficult to come by. Not much training to keep your technical skills alive.", "advice": "Focus on building stronger teams, be more proactive in providing training and abilities for employees to enhance their skills. Employees are the most important assets this company has!"}, {"title": "It's nice to say you work for NASDAQ OMX", "text": "Pros The name carries a lot of weight in the financial industry. NASDAQ is the largest and most advanced electronic trading system in the entire world. Mostly everything is written in Java. Cons Its in the cutthroat financial industry. The hours are horrible, and you are pretty much always at work and on call for every position. You have a home office, soho, and blackberry that are required to be accessible. Advice to Management Management needs to do a better job of helping the workers mesh with each other. There needs to be some serious team building exercises.", "rating": 3, "pros": "The name carries a lot of weight in the financial industry. NASDAQ is the largest and most advanced electronic trading system in the entire world. Mostly everything is written in Java.", "cons": "Its in the cutthroat financial industry. The hours are horrible, and you are pretty much always at work and on call for every position. You have a home office, soho, and blackberry that are required to be accessible.", "advice": "Management needs to do a better job of helping the workers mesh with each other. There needs to be some serious team building exercises."}, {"title": "For a subsidiary of Nasdaq", "text": "Pros The organization is relatively flat. Management can give a lot of freedom to employees. Cons Staff experience tends to be low and there are lots of infrastructure problems because people aren't clear on what they are trying to achieve. Competent people will probably find themselves over worked, but in the Nasdaq team these people also might have an advantage to rise quickly. Advice to Management Invest in quality and reward quality work.", "rating": 3, "pros": "The organization is relatively flat. Management can give a lot of freedom to employees.", "cons": "Staff experience tends to be low and there are lots of infrastructure problems because people aren't clear on what they are trying to achieve. Competent people will probably find themselves over worked, but in the Nasdaq team these people also might have an advantage to rise quickly.", "advice": "Invest in quality and reward quality work."}, {"title": "Colleagues were great; senior management was the pits!", "text": "Pros Excellent group of colleagues to work with. As a Relationship Manager I had the ability to network with Senior Leadership at the companies I supported. Very satisfying from that standpoint. Cons Senior management in the Corporate Client Group is dysfunctional at best. A lot of back-stabbing and half-truths. Up was down and down was up. You get the picture. Advice to Management Promote the good people else all you'll end up with are the rats. Your assets (or some of them, anyway) walk out of the building every day. Treat them better or they'll continue to leave.", "rating": 3, "pros": "Excellent group of colleagues to work with. As a Relationship Manager I had the ability to network with Senior Leadership at the companies I supported. Very satisfying from that standpoint.", "cons": "Senior management in the Corporate Client Group is dysfunctional at best. A lot of back-stabbing and half-truths. Up was down and down was up. You get the picture.", "advice": "Promote the good people else all you'll end up with are the rats. Your assets (or some of them, anyway) walk out of the building every day. Treat them better or they'll continue to leave."}, {"title": "Director (in a business line)", "text": "Pros It's a great learning environment and dedicated people. Excellent exposure to high profile individuals and issues confronting Wall Street. It is an outstanding brand and it is great to be tackling issues fundamental to the the economy. Good equity participation opportunities. Cons Competitive forces created many rounds of layoff/reduction-in-force. It can lead to depressed morale and a lot of work for those left over. Nature of the business lends itself to a lot of competition from ECNs. Lots of pressure and long hours. There are high expectations and sometimes not as high appreciation for delivery. Advice to Management Clearer expectations about how to make a difference to the bottom line. While communication of overall strategy was good, it would have been better to know how to make a difference to those solve problems in the 'ivory tower'.", "rating": 5, "pros": "It's a great learning environment and dedicated people. Excellent exposure to high profile individuals and issues confronting Wall Street. It is an outstanding brand and it is great to be tackling issues fundamental to the the economy. Good equity participation opportunities.", "cons": "Competitive forces created many rounds of layoff/reduction-in-force. It can lead to depressed morale and a lot of work for those left over. Nature of the business lends itself to a lot of competition from ECNs. Lots of pressure and long hours. There are high expectations and sometimes not as high appreciation for delivery.", "advice": "Clearer expectations about how to make a difference to the bottom line. While communication of overall strategy was good, it would have been better to know how to make a difference to those solve problems in the 'ivory tower'."}, {"title": "Politics and legacy over performance and ability", "text": "Pros Fair compensation and a global environment. Forward-looking senior management always keeps the company moving ahead and there are always many positive opportunities in the pipeline. Cons Fierce internal competition for little reason General lack of well deserved recognition Senior management is too busy to be engaged with those doing the work to understand the inner workings of their teams Extremely scarce resources are often poorly directed Many long tenured staff in middle management create an artificial glass ceiling for the next generation achievers and as a result they often leave because their superior contributions go unrecognized Advice to Management Take a good look at who is actually producing for you and take a chance on those people. Perpetuating legacy will not take the company to the next level. Sometimes the real leaders of a team are the ones being \"managed.\" You should have the insight and courage to bring them up to the roles they deserve, regardless of how long their boss has been there or any other factors. You need to own your claim of having a performance culture.", "rating": 3, "pros": "Fair compensation and a global environment. Forward-looking senior management always keeps the company moving ahead and there are always many positive opportunities in the pipeline.", "cons": "Fierce internal competition for little reason", "advice": "Take a good look at who is actually producing for you and take a chance on those people. Perpetuating legacy will not take the company to the next level. Sometimes the real leaders of a team are the ones being \"managed.\" You should have the insight and courage to bring them up to the roles they deserve, regardless of how long their boss has been there or any other factors. You need to own your claim of having a performance culture."}, {"title": "NASDAQ is a good place to work.", "text": "Pros In general, I'd consider nasdaq omx to be a good place to work. I felt that emnployees were treated well and compensated very fairly based on their contribution. It is a company that is constantly looking for new ways to generate revenue, and it provides far more services to its clients than you would normall associate with a stock market. Because of this, I feel that there is opportunity to make an impact by helping create new business. Cons At the time I was working there, NASDAQ seemed to be overly concerned with acquisitions, which seemed to distract the company from its core mission. Advice to Management None.", "rating": 5, "pros": "In general, I'd consider nasdaq omx to be a good place to work. I felt that emnployees were treated well and compensated very fairly based on their contribution. It is a company that is constantly looking for new ways to generate revenue, and it provides far more services to its clients than you would normall associate with a stock market. Because of this, I feel that there is opportunity to make an impact by helping create new business.", "cons": "At the time I was working there, NASDAQ seemed to be overly concerned with acquisitions, which seemed to distract the company from its core mission.", "advice": "None."}, {"title": "Nasdaq: Captalisms shining beacon of ho-hum", "text": "Pros There are few if any in this country who have a similar skill set who get to do what I do and get a decent salary with nice benefits and get a bonus on top o that. Cons Senior management are overall pretty human, but the select C-level have the attention span of rabbits when it comes to the common employee gripes. And it always seems like you are one mistake away from unemployment, eben when things are goin well for the overall company. Never a word of positive feednack, but loud criticism for the most minute of mistakes. Definitely micro-managing and reactionary managment. Advice to Management You set the agenda, but your employees are the fuel that fires the engine. Do more to ensure that morale stays high, Press your managers to be honest about who really deserves some recognition and stop allowing them to keep rewarding their flunkies.", "rating": 3, "pros": "There are few if any in this country who have a similar skill set who get to do what I do and get a decent salary with nice benefits and get a bonus on top o that.", "cons": "Senior management are overall pretty human, but the select C-level have the attention span of rabbits when it comes to the common employee gripes. And it always seems like you are one mistake away from unemployment, eben when things are goin well for the overall company. Never a word of positive feednack, but loud criticism for the most minute of mistakes. Definitely micro-managing and reactionary managment.", "advice": "You set the agenda, but your employees are the fuel that fires the engine. Do more to ensure that morale stays high, Press your managers to be honest about who really deserves some recognition and stop allowing them to keep rewarding their flunkies."}, {"title": "Choose the right department and you could be successful", "text": "Pros Interesting and challenging work in a competitive environment and field. If you work in the \"right\" department, your potential for learning, development and advancement is limitless. Skills and competencies are easily transferable to other financial services firms, particularly those on Wall Street. Flexible schedules are available, and, in some cases, encouraged. There is a diversity of opportunities given the structure of the company so there is something for everyone. Cons Huge disparities in employee treatment across departments. Some managers promote and reward performance for even mediocre employees; while other managers do little to reward stellar workers. The pay does not keep pace with industry standards. Advice to Management Ensure that there is more parity in development, advancement and compensation throughout the organization.", "rating": 1, "pros": "Interesting and challenging work in a competitive environment and field. If you work in the \"right\" department, your potential for learning, development and advancement is limitless. Skills and competencies are easily transferable to other financial services firms, particularly those on Wall Street. Flexible schedules are available, and, in some cases, encouraged. There is a diversity of opportunities given the structure of the company so there is something for everyone.", "cons": "Huge disparities in employee treatment across departments. Some managers promote and reward performance for even mediocre employees; while other managers do little to reward stellar workers. The pay does not keep pace with industry standards.", "advice": "Ensure that there is more parity in development, advancement and compensation throughout the organization."}, {"title": "Some bugs to work out, but not all bad.", "text": "Pros They spent a lot of money on brand awareness, that could work in your favor when looking for a new job. Seriously though, it's a good place to start out and definitley a place where change can happen. The company is very dynamic and open to cultural change, you just need to have the fire in you to go and initiate change. Cons Long hours for one. Two is that sometimes you'll finish a project on time, and it works well, but the sales side can't figure out how to sell it and it will die on the vine. I also wouldn't classify the company as Entreprenurial. The technical support staff leaves a lot to be desired as well. I was alsways dumbfounded at the lack of familiarity the support staff has with the product lines that customers are calling in for. In one case someone actually anwsered the phone with the greeting, \"INET NASDAQ how can I help you?\" Is that the standard greeting for tech support for market makers? Does that guy even know what company he works for? Is there any standardization at all going on with call scripts? Advice to Management I would try and untangle the data products business line from the market data side. They, by design of the organization, have been placed directly at odds with each other. As a result, there is fierce competition between the two groups to the point of duplicated efforts, poached sales lists, and anti-productivity. I've even gotten the notion on some calls that one line will intentionally not release a product even if it's a good idea and has a solid business case just because they don't want to deal with the other. In my opinion, one solution to this problem would be to merge the groups. The marketing group also may need to be decentralized but controlled by a small group to ensure that the efforts from each product line adhere to branding starndards and a unified marketing message. What's going on now is that it's so locked down and centralized that it's almost impossible to get a both accurate and creative market message out regarding a new product. The marketing area should also be responsible for the analysis of the statistical data generated from the marketing vehicles that are being used. There is pretty much no standardization of the way market collects this data across the marketing vehicles to judge things like response rates to certain types of advertising, visits and user data from the various websites (and there are many). Again, this is only my opinion, but there doesn't seem to be a solid handle on all of the market data points coming into the company from all of the marketing venues. This is severely hindering the cross sellability of all exisiting gproducts as well as the impact of getting new customers roped in. There is also a lot of money being spent by the marketing team to outsource the creation of a lot of the verious ad materials and not enough time spent talking to the customers/business lines/technology side to get a handle on what the product actually sells to the customer so an effective marketing piece can be created. This area needs to be revamped. Technology is also a little dicey, but not nearly as bad as it could be. It's biggest threat is (and probably always will be) that there is a culture of \"my way is the right way\" and it centers around job security. If there was a reward system in place for rewarding innovation rather than empire building, that may help. Also, there is a clear tactic that seems to have gotten a lot of traction (right before I left anyway) which was used by some senior managers on the technology side This tactic would be to create a crisis and then solve it in order to remain visible. It seems that visibility is where the pot of gold lies for the management and staff. This leads to stress on the empployees (which could account for the low morale in some way and wasted money in the form of hours spent solving problems that are blown out of proportion. In my opinion, this type of crisis management can never lead to a smoothly running operation where innovation and actual capitalism can allow the business to grow.", "rating": 3, "pros": "They spent a lot of money on brand awareness, that could work in your favor when looking for a new job. Seriously though, it's a good place to start out and definitley a place where change can happen. The company is very dynamic and open to cultural change, you just need to have the fire in you to go and initiate change.", "cons": "Long hours for one. Two is that sometimes you'll finish a project on time, and it works well, but the sales side can't figure out how to sell it and it will die on the vine. I also wouldn't classify the company as Entreprenurial. The technical support staff leaves a lot to be desired as well. I was alsways dumbfounded at the lack of familiarity the support staff has with the product lines that customers are calling in for. In one case someone actually anwsered the phone with the greeting, \"INET NASDAQ how can I help you?\" Is that the standard greeting for tech support for market makers? Does that guy even know what company he works for? Is there any standardization at all going on with call scripts?", "advice": "I would try and untangle the data products business line from the market data side. They, by design of the organization, have been placed directly at odds with each other. As a result, there is fierce competition between the two groups to the point of duplicated efforts, poached sales lists, and anti-productivity. I've even gotten the notion on some calls that one line will intentionally not release a product even if it's a good idea and has a solid business case just because they don't want to deal with the other. In my opinion, one solution to this problem would be to merge the groups."}, {"title": "NASDAQ: morally bankrupt", "text": "Pros potential for stock option appreciation from ruthless and greedy management Cons No corporate culture, low morale, poor senior management, no respect for individuals Advice to Management People are an asset; value and develop them", "rating": 1, "pros": "potential for stock option appreciation from ruthless and greedy management", "cons": "No corporate culture, low morale, poor senior management, no respect for individuals", "advice": "People are an asset; value and develop them"}, {"title": "Senior Software Developer", "text": "Pros Beautiful office. Steady and secure job once it is permanent. Gathering with delicious cakes. Cons It is hard to upgrade knowledge. Employees are frequently changing. People are organised in small groups. Relatively flat hierarchy. Advice to Management Motivation is very important and every employee is worth fighting for.", "rating": 3, "pros": "Beautiful office. Steady and secure job once it is permanent. Gathering with delicious cakes.", "cons": "It is hard to upgrade knowledge. Employees are frequently changing. People are organised in small groups. Relatively flat hierarchy.", "advice": "Motivation is very important and every employee is worth fighting for."}, {"title": "Summer Internship", "text": "Pros Great colleagues Good brand name Great team of interns Cons Career opportunities at some departments seem limited after a certain time", "rating": 5, "pros": "Great colleagues", "cons": "Career opportunities at some departments seem limited after a certain time", "advice": null}, {"title": "Good workplace with nice colleagues", "text": "Pros - Many vacation days - Rather high salaries - Open environment and nice colleagues who helps out Cons - Sometimes high stress level - Poor introduction program to understand the whole business (but they are looking into that now)", "rating": 5, "pros": "- Many vacation days", "cons": "- Sometimes high stress level", "advice": null}, {"title": "Nice place to work", "text": "Pros Getting opportunity to learn new technology, tools Professional management No micromanagement, flexible timing Good leave policy..parental leaves upto 2 weeks, death leaves..Leave carry forward and can get cash in case exceeds 30. . Work from home option Free snacks and fruits Very good health insurance plan for your parents and family members..upto 5 lakh..free annual health checkups Accidental and Life insurance New smart office Good hike and pay Cons No transport for male employee. Lack of trainings Advice to Management Not yet", "rating": 5, "pros": "Getting opportunity to learn new technology, tools", "cons": "No transport for male employee.", "advice": "Not yet"}, {"title": "Review", "text": "Pros Overall is good company. working environment is very good. Cons I did not found any Cons.", "rating": 3, "pros": "Overall is good company. working environment is very good.", "cons": "I did not found any Cons.", "advice": null}, {"title": "Nice culture", "text": "Pros people are willing to help you Cons in general there is no cons at all!", "rating": 5, "pros": "people are willing to help you", "cons": "in general there is no cons at all!", "advice": null}, {"title": "Amazing place to work", "text": "Pros Work life balance, Employee engagement, cultural activities Good pay and salary hike Good opportunity for innovation career growth Cons No onsite opportunity Nothing else", "rating": 5, "pros": "Work life balance,", "cons": "No onsite opportunity", "advice": null}, {"title": "Great people to work with and the work can be challenging at times", "text": "Pros Love the people I worked with Work can be challenging at times since you are dealing with critical information Great local management back when I was working there Great benefits and bonuses Cons The technology for the website service has a lot of room to improve Not much room to get promoted", "rating": 5, "pros": "Love the people I worked with", "cons": "The technology for the website service has a lot of room to improve", "advice": null}, {"title": "Nice company to work for", "text": "Pros Inspiring environment, nice colleagues, flexible hours Cons Would be nice with more women", "rating": 5, "pros": "Inspiring environment, nice colleagues, flexible hours", "cons": "Would be nice with more women", "advice": null}, {"title": "Not really a great place to hang on", "text": "Pros Got to build a complex product from scratch. Okay work life balance. Cons Not a very healthy work env Bad pay master Advice to Management Be more open minded and accept diversity", "rating": 3, "pros": "Got to build a complex product from scratch.", "cons": "Not a very healthy work env", "advice": "Be more open minded and accept diversity"}, {"title": "Fast paced and high performing teams", "text": "Pros Great training and advancement opportunities. Well known brand. Cons Very fast paced and changes seem to come to quickly. Could pay better commissions. Sometimes can feel like you are just a number. Advice to Management Get a better understanding of each country and the culture. It doesn't always match with the Nasdaq culture.", "rating": 5, "pros": "Great training and advancement opportunities. Well known brand.", "cons": "Very fast paced and changes seem to come to quickly. Could pay better commissions. Sometimes can feel like you are just a number.", "advice": "Get a better understanding of each country and the culture. It doesn't always match with the Nasdaq culture."}, {"title": "Dynamic, sometimes too dynamic company", "text": "Pros Very dynamic company, great will to innovate products, very known and good brand, people on the ground knowledgable, and great teams. Cons Top to bottom communication must be improved. salary is said to be over average salary of comparable jobs, however this can be doubted. Also, at Nasdaq you have a great job, however in smaller offices no career. Advice to Management Improve communication, avoid actions and business decisions that are too short strategy.", "rating": 5, "pros": "Very dynamic company, great will to innovate products, very known and good brand, people on the ground knowledgable, and great teams.", "cons": "Top to bottom communication must be improved. salary is said to be over average salary of comparable jobs, however this can be doubted. Also, at Nasdaq you have a great job, however in smaller offices no career.", "advice": "Improve communication, avoid actions and business decisions that are too short strategy."}, {"title": "My Second Home", "text": "Pros - My team's a beast! All are subject matter experts and performs beyond expectations. Can't ask for more :-) - Updated with the latest technology - I can work from home especially when there are typhoons. - Travel and training opportunities globally - Annual performance bonus - Transportation allowance and Office Shuttle - Support Phone for emergencies Cons For those who are morning persons, this is not recommended for you due to my team's working on an AMERS shift. No issues for me! But for others it may have an issue.", "rating": 5, "pros": "- My team's a beast! All are subject matter experts and performs beyond expectations. Can't ask for more :-)", "cons": "For those who are morning persons, this is not recommended for you due to my team's working on an AMERS shift. No issues for me! But for others it may have an issue.", "advice": null}, {"title": "Excellent company", "text": "Pros Excellent job environment and lots of scope for learning Cons No cobs, nothing to say now.", "rating": 5, "pros": "Excellent job environment and lots of scope for learning", "cons": "No cobs, nothing to say now.", "advice": null}, {"title": "Ok Corporate company", "text": "Pros Competitive salary, good health care, basic perks such as mobile, monthly drinks. Possible work from home Cons Too political, middle management to push goals. Career progression limited Advice to Management Be more entrepreneur and encourage individual goals", "rating": 5, "pros": "Competitive salary, good health care, basic perks such as mobile, monthly drinks. Possible work from home", "cons": "Too political, middle management to push goals. Career progression limited", "advice": "Be more entrepreneur and encourage individual goals"}, {"title": "Good Place to be", "text": "Pros Clarity of vision from Top Management Employee Benefits, they do try to help employees in critical times Cons Approval time to implement new schemes takes lot of time", "rating": 5, "pros": "Clarity of vision from Top Management", "cons": "Approval time to implement new schemes takes lot of time", "advice": null}, {"title": "Your typical bureaucratic financial company", "text": "Pros Great local team to work with Cons Company is only interested in financials and loses the human aspect in the process. Advice to Management Invest more in employee engagement and satisfaction", "rating": 3, "pros": "Great local team to work with", "cons": "Company is only interested in financials and loses the human aspect in the process.", "advice": "Invest more in employee engagement and satisfaction"}, {"title": "high expectation", "text": "Pros seniors are very easily availabe. many things to learn.. Good resources spent on employees. Cons hectic schedule, high expectation , less time", "rating": 5, "pros": "seniors are very easily availabe. many things to learn.. Good resources spent on employees.", "cons": "hectic schedule, high expectation , less time", "advice": null}, {"title": "Nasdaq Market Tech", "text": "Pros Great intelligent people who are probably best in the field Cons Managers are squeezed by executive mgt so many employees have a bad work balance Advice to Management Take care of your workers, salary is not everything. Better to have at least some slack in the organization, than being on minus.", "rating": 5, "pros": "Great intelligent people who are probably best in the field", "cons": "Managers are squeezed by executive mgt so many employees have a bad work balance", "advice": "Take care of your workers, salary is not everything. Better to have at least some slack in the organization, than being on minus."}, {"title": "Many changes in strategy stifles innovation", "text": "Pros Independence, location, annual bonus, training, talented people, travel, ability to coach team, flexi-working, company phone, Cons Limited promotion opportunity, lack of recognition, power base in US and not relinquished across other continents, aggressive management Advice to Management Recognise and reward true talent . Anticipate barriers to success before announcing change of strategies", "rating": 3, "pros": "Independence, location, annual bonus, training, talented people, travel, ability to coach team, flexi-working, company phone,", "cons": "Limited promotion opportunity, lack of recognition, power base in US and not relinquished across other continents, aggressive management", "advice": "Recognise and reward true talent . Anticipate barriers to success before announcing change of strategies"}, {"title": "Relationship Manager", "text": "Pros friendly environment, great work hours Cons constant change, most coworkers work from home.", "rating": 5, "pros": "friendly environment, great work hours", "cons": "constant change, most coworkers work from home.", "advice": null}, {"title": "A perfect home to drift in your bubble.", "text": "Pros Nasdaq is the ideal workplace to park yourself if you've hit your mid-40s and are tired of it all, and want to work at your own pace. Your managers will not push you because they are in the same mode - drifting towards their own sunset. Nobody will try to rock the boat or push the envelope as everyone tries to secure their next (last) 10 years. It's a mostly harmonious and laissez-faire environment for the ones that seek it. The benefits are very good - why else would you join a country club? Cons If you are used to picking up the ball, and running as fast as you can; then, this is not the workplace for you. The pace of execution is excruciatingly slow. Upward mobility is extremely static as managers hold on to their jobs with iron grips. Rarely are people promoted, demoted, or fired. The average age in the company qualifies it for a old-age home. Through my tenure, I couldn't help but think that I was always working with the B-team. As they say, if you pay peanuts, you will get monkeys.", "rating": 3, "pros": "Nasdaq is the ideal workplace to park yourself if you've hit your mid-40s and are tired of it all, and want to work at your own pace. Your managers will not push you because they are in the same mode - drifting towards their own sunset. Nobody will try to rock the boat or push the envelope as everyone tries to secure their next (last) 10 years.", "cons": "If you are used to picking up the ball, and running as fast as you can; then, this is not the workplace for you. The pace of execution is excruciatingly slow.", "advice": null}, {"title": "Great Place to work", "text": "Pros New Office just Launched, One of the best offices within NASDAQ locations. Cons Yet to find. Need to work on the brand building in Bangalore and start participating in all tech forums. Advice to Management Keep the focus on Bangalore and looking forward for innovation and growth opportunities.", "rating": 5, "pros": "New Office just Launched, One of the best offices within NASDAQ locations.", "cons": "Yet to find. Need to work on the brand building in Bangalore and start participating in all tech forums.", "advice": "Keep the focus on Bangalore and looking forward for innovation and growth opportunities."}, {"title": "IT management", "text": "Pros Proactive management, good location, professional attitude Cons No significant issues, the company allows growth Advice to Management Enhance the training budget", "rating": 5, "pros": "Proactive management, good location, professional attitude", "cons": "No significant issues, the company allows growth", "advice": "Enhance the training budget"}, {"title": "QA specialist", "text": "Pros Good place to work and wirth working Cons Low salary and more technical job but worth investing yiur time. I would recommend if you are experienced and have good technicak skills", "rating": 5, "pros": "Good place to work and wirth working", "cons": "Low salary and more technical job but worth investing yiur time. I would recommend if you are experienced and have good technicak skills", "advice": null}, {"title": "Avoid working for it", "text": "Pros free fruit, good coffee machine, broken frequently though good location, Cons Old technologies. Bad HR with no responding to your email and even instance message bullies from senior staff low IT efficient. Advice to Management Take care your staff", "rating": 1, "pros": "free fruit,", "cons": "Old technologies.", "advice": "Take care your staff"}, {"title": "Not what'd you'd expect from a big company", "text": "Pros Flat hierarchy, relatively small teams, flexible working hours, great mentoring program for interns, organised training for interns, great location (The Rocks), great working culture, PT positions offered to some interns Cons Some teams don't appear to have good opportunities for career progression Advice to Management Keep up the intern program, but try run it centrally from Sydney rather than spread across Sydney, Manila and the US", "rating": 5, "pros": "Flat hierarchy, relatively small teams, flexible working hours, great mentoring program for interns, organised training for interns, great location (The Rocks), great working culture, PT positions offered to some interns", "cons": "Some teams don't appear to have good opportunities for career progression", "advice": "Keep up the intern program, but try run it centrally from Sydney rather than spread across Sydney, Manila and the US"}, {"title": "Website service manager for Investor relations", "text": "Pros Well known company, stylish, respectful Cons lots of bureaucracy, hard to get promoted", "rating": 5, "pros": "Well known company, stylish, respectful", "cons": "lots of bureaucracy, hard to get promoted", "advice": null}, {"title": "TAM", "text": "Pros Leader within the FinTech Industry Cons All system are mission critical", "rating": 5, "pros": "Leader within the FinTech Industry", "cons": "All system are mission critical", "advice": null}, {"title": "Great people but management problem at Corp Services", "text": "Pros Great talented people, great office location Cons Bad internal communication, numerous stuff changes, management does not seem to have long term strategy for core IR products Advice to Management Bring in more new people to Corp Services management", "rating": 3, "pros": "Great talented people, great office location", "cons": "Bad internal communication, numerous stuff changes, management does not seem to have long term strategy for core IR products", "advice": "Bring in more new people to Corp Services management"}, {"title": "Good Company", "text": "Pros Work Life Balance is Good Cons Nothing much to add here", "rating": 5, "pros": "Work Life Balance is Good", "cons": "Nothing much to add here", "advice": null}, {"title": "not as good as the name sounds", "text": "Pros flexible working hours, provide family package for private health fund. most of the people are friendly and polite. Cons #1 NASDAQ don't like to support or encourage employees to take any external training programs. I have never got any technical training from the company after more than 5 years service. the only training you will get here is how the current products work and how they are built. #2 They have yearly salary review but nothing is really being reviewed. You take more and more responsibilities along the years, but every year you will only get the standard pay rise which buys you 1 coffee per month. Well it does depend on your position and how important you are to the company. For the Sydney office, some important people(mostly management people) get paid pretty well including all middle level management team. but for normal engineers who probably do the most dev work, the salary is much lower than the market. #3 It is very hard to get any budget/resource for improving developers' productivities. For example, it is hard to get approved to get tools we need to improve CI/CD, version control, building tools etc. as long as it is not directly linked to company's yearly GOALs, it is very hard to get approved. #4 Some early 90s technologies are still the main stream in NASDAQ SYD. management are not motivated to refresh it since that probably doesn't improve the bonus and it always comes with risk of losing their jobs. #5 Different teams will point fingers at each other when things go wrong. Sometimes some people can go very aggressive. #6 As engineers, you won't be trusted unless you showcased you are absolutely a genius to the management or you are being good friend to management. Advice to Management I hear a lot from the HR that NASDAQ management team and HR have been working hard to hear the feedback from employees to improve the process and everything. However during the years, I could not feel anything changed. I will be very surprised if any of above \"cons\" is not a known fact to anyone of the SYDNEY management team. Therefore, do something to change that. Maybe start with hiring some manager who really consider employees are valuable assets to the business", "rating": 3, "pros": "flexible working hours, provide family package for private health fund.", "cons": "#1 NASDAQ don't like to support or encourage employees to take any external training programs. I have never got any technical training from the company after more than 5 years service. the only training you will get here is how the current products work and how they are built.", "advice": "I hear a lot from the HR that NASDAQ management team and HR have been working hard to hear the feedback from employees to improve the process and everything. However during the years, I could not feel anything changed. I will be very surprised if any of above \"cons\" is not a known fact to anyone of the SYDNEY management team. Therefore, do something to change that. Maybe start with hiring some manager who really consider employees are valuable assets to the business"}, {"title": "Processes", "text": "Pros Flexible work hours and free fruit Cons Too much bureaucracy and takes a long time to get things done Advice to Management plrase don't micro manage", "rating": 1, "pros": "Flexible work hours and free fruit", "cons": "Too much bureaucracy and takes a long time to get things done", "advice": "plrase don't micro manage"}, {"title": "Media Monitoring", "text": "Pros Supports rigorous market regulation that ensures the protection of investors.Provide market-leading technology solutions and intelligence to help businesses and investors succeed in today's global capital markets. Cons No sufficient leave availability even though huge leave balance", "rating": 5, "pros": "Supports rigorous market regulation that ensures the protection of investors.Provide market-leading technology solutions and intelligence to help businesses and investors succeed in today's global capital markets.", "cons": "No sufficient leave availability even though huge leave balance", "advice": null}, {"title": "Just don't even go there", "text": "Pros Big company so called international Salary is average Cons You are a number and there is no growth within the company. No communication, they hide information from the employees. Just a terrible place to work. Too US centered Advice to Management Value your employees and make them feel valued. Be less US centered.", "rating": 1, "pros": "Big company", "cons": "You are a number and there is no growth within the company.", "advice": "Value your employees and make them feel valued. Be less US centered."}, {"title": "Senior Software Developer", "text": "Pros excellent company to work with, lot to learn and many benefits Cons nthg as such, easy going, flexible timings", "rating": 5, "pros": "excellent company to work with, lot to learn and many benefits", "cons": "nthg as such, easy going, flexible timings", "advice": null}, {"title": "Solid company but lacks management skills", "text": "Pros - Rewarding - Great Benefits - Energetic work force Cons - Pay - Lack of focus - Managment micro manages Advice to Management Give your employees room to breathe!", "rating": 3, "pros": "- Rewarding", "cons": "- Pay", "advice": "Give your employees room to breathe!"}, {"title": "Pretty darn good", "text": "Pros Great mentor program Interesting projects Friendly colleagues Cons Training seems to be restricted to Nasdaq-selected courses. Advice to Management Please open up training to everything.", "rating": 5, "pros": "Great mentor program", "cons": "Training seems to be restricted to Nasdaq-selected courses.", "advice": "Please open up training to everything."}, {"title": "Securities Operations Analyst", "text": "Pros Work close to many markets. Cons The work culture is very American.", "rating": 3, "pros": "Work close to many markets.", "cons": "The work culture is very American.", "advice": null}, {"title": "Test Automation", "text": "Pros Smart people, cool projects, challenging problems Cons Nothing bad here, really, it's a nice company Advice to Management keep doing what you are doing now", "rating": 5, "pros": "Smart people, cool projects, challenging problems", "cons": "Nothing bad here, really, it's a nice company", "advice": "keep doing what you are doing now"}, {"title": "Nice company", "text": "Pros Many opportunities to grow and learn new skills. Hard work required but also helpful colleagues that are always open to help. Cons Work and life balance could be better.", "rating": 5, "pros": "Many opportunities to grow and learn new skills. Hard work required but also helpful colleagues that are always open to help.", "cons": "Work and life balance could be better.", "advice": null}, {"title": "So glad to be out of there!", "text": "Pros Good benefits such as HCF Health Insurance top family cover, extra superannuation, bonus plan & equity, plus discounted purchasing of shares. Regular social events. Great location by Sydney Harbour. Some nice & competent staff. Cons I got really bad pay for the amount of experience that I had, my skills and my qualifications, and the responsibility that I had. I worked in the Corporate Solutions part of the business. A lot of management are on huge salaries, even the sales team get huge commissions and salaries. Totally hamstrung by a lack of resources and no budget. A lot of talentless overpaid clueless lazy people in senior management roles. Some dishonest and incompetent staff. A lot of backstabbing and greasing up to senior management by certain people to get promoted, and greasing to secure their own roles in the company at the expense of others. Staff drinking too much at work functions or at lunch and acting inappropriately. A lot of people doing the bare minimum in their role. A lot hoping for redundancy. A lot of useless people brought across from Thomson Reuters. One guy who was brought over from the US to increase sales of one product - Thomson ONE IR did the exact opposite- in the time he was in Sydney sales dipped 25% of that product but yet he got wait for it - promoted?! He was also instrumental in getting several people made redundant who were working a lot harder than him - he used to watch US sport on his computer in work time!?! He did next to no work. Total lack of support for the Australian market, the company is totally focussed on the US. I was lied to and told I was going to get a pay rise and promoted by management and HR. I was also lured into a meeting with HR to be made redundant with a lie - a fellow employee - the same guy mentioned above - made out he wanted to have a meeting with me (he was even carrying a document) and led me into an office where HR were waiting - totally dishonest! HR could have just invited me to a meeting. No chance for career advancement in Australia - a dead end job. Totally underpaid. I found the job and company to be depressing and frustrating. So glad to be out of there! I was glad to leave and had been looking at leaving for some time and was glad to do so with a redundancy package. I'm so much happier now and earning a lot more money and surrounded by competent knowledgeable staff. Advice to Management Get rid of the talentless lazy managers who are all talk with no idea about strategy or delivering results and lack the skills and qualifications in the relevant areas, and who try and lay the blame on others. Local HR are incompetent and dishonest and need replacing - especially management.", "rating": 3, "pros": "Good benefits such as HCF Health Insurance top family cover, extra superannuation, bonus plan & equity, plus discounted purchasing of shares. Regular social events. Great location by Sydney Harbour. Some nice & competent staff.", "cons": "I got really bad pay for the amount of experience that I had, my skills and my qualifications, and the responsibility that I had. I worked in the Corporate Solutions part of the business. A lot of management are on huge salaries, even the sales team get huge commissions and salaries. Totally hamstrung by a lack of resources and no budget. A lot of talentless overpaid clueless lazy people in senior management roles. Some dishonest and incompetent staff. A lot of backstabbing and greasing up to senior management by certain people to get promoted, and greasing to secure their own roles in the company at the expense of others. Staff drinking too much at work functions or at lunch and acting inappropriately. A lot of people doing the bare minimum in their role. A lot hoping for redundancy. A lot of useless people brought across from Thomson Reuters. One guy who was brought over from the US to increase sales of one product - Thomson ONE IR did the exact opposite- in the time he was in Sydney sales dipped 25% of that product but yet he got wait for it - promoted?! He was also instrumental in getting several people made redundant who were working a lot harder than him - he used to watch US sport on his computer in work time!?! He did next to no work. Total lack of support for the Australian market, the company is totally focussed on the US. I was lied to and told I was going to get a pay rise and promoted by management and HR. I was also lured into a meeting with HR to be made redundant with a lie - a fellow employee - the same guy mentioned above - made out he wanted to have a meeting with me (he was even carrying a document) and led me into an office where HR were waiting - totally dishonest! HR could have just invited me to a meeting. No chance for career advancement in Australia - a dead end job. Totally underpaid. I found the job and company to be depressing and frustrating. So glad to be out of there! I was glad to leave and had been looking at leaving for some time and was glad to do so with a redundancy package. I'm so much happier now and earning a lot more money and surrounded by competent knowledgeable staff.", "advice": "Get rid of the talentless lazy managers who are all talk with no idea about strategy or delivering results and lack the skills and qualifications in the relevant areas, and who try and lay the blame on others. Local HR are incompetent and dishonest and need replacing - especially management."}, {"title": "Okay!?", "text": "Pros Team is one of the best things i ever had in nasdaq. Well, I guess that would give you motivation to work. Cons Management. I guess they still have to improve their upper management structure. Salary. Workloads. Too much workload causes up stress with the employees. Less worklife balance. Advice to Management Prevent often restructuring.", "rating": 3, "pros": "Team is one of the best things i ever had in nasdaq. Well, I guess that would give you motivation to work.", "cons": "Management. I guess they still have to improve their upper management structure.", "advice": "Prevent often restructuring."}, {"title": "Good place to work", "text": "Pros Great working environment and tools Cons People who work there are not very motivated", "rating": 3, "pros": "Great working environment and tools", "cons": "People who work there are not very motivated", "advice": null}, {"title": "gud one", "text": "Pros i like it. they give a gud salary. & convince u tat u r getting a nice one Cons not transparent at all. ones u resign ur job, forget ur pF amount. They dont co operate much. Pathetic HR team in Nagercoil really..They dont care for d employees day to day toils.. & incerement.. phew.. u get 100 bucks incremented-u r lucky Advice to Management Take some care on d workers...", "rating": 5, "pros": "i like it. they give a gud salary. & convince u tat u r getting a nice one", "cons": "not transparent at all. ones u resign ur job, forget ur pF amount. They dont co operate much. Pathetic HR team in Nagercoil really..They dont care for d employees day to day toils.. & incerement.. phew.. u get 100 bucks incremented-u r lucky", "advice": "Take some care on d workers..."}, {"title": "Project Manager", "text": "Pros Good training ground. You get to work with diverse and talented teams. Cons I can't think of any for now,", "rating": 5, "pros": "Good training ground. You get to work with diverse and talented teams.", "cons": "I can't think of any for now,", "advice": null}, {"title": "A company that should be jumping on potential", "text": "Pros The Sydney office is centrally located with plenty of entertainment and amenities - two kitchens, full barista-style coffee machine, cable TV, pool and ping pong tables as well as balconies and desk views overlooking Sydney Harbor. Nice work space generally quiet enough to work in peace. You will meet a lot of knowledgeable and friendly people (And some that aren't as inclined, same with every company). There is generally a lot to learn and improve on (for my role at least). The culture is very relaxed and most people can get away with super casual clothing. Employee benefits are a key human-resource drive in this company - Monthly drinks, higher than standard super, health insurance coverage, employee 'rewards' as well as fruit and biscuits available for your daily needs. Cons Nasdaq offers what is widely considered substandard pay. The disparity in payment between upper management and mid-level employees is far too big of a gap. Since the hierarchy is increasingly flattened, it becomes more and more of an issue amongst employees with many of the talented staff leaving for better opportunities elsewhere. Nasdaq doesn't seem to care too much about retaining anyone - they often replace loyal multi-year employee's with a mediocre entry-level hiree's for the purpose of budget. Most of us are made to feel disposable. Moving up and getting promoted here is nothing short of difficult and sometimes impossible. Since the structure is so flat, most of us only have a couple of jumps before managerial level If you do push hard enough you might get lucky but don't expect a significant jump in your salary. The unfairness becomes apparent when years on, employees with significant experience and knowledge are earning the same or even less than new hires. It makes it hard to see a long term future at NASDAQ. Your career 'path' here is more like a career 'step'. We rely on old legacy tools and processes that are due for a complete remake, but instead gets a bunch of periodic ad-hoc, band-aid fixes since it's cheaper but a total disaster in the long term. There's a lot of finger pointing when things go wrong when the process all together can often be a circus act. Documentation is seriously lacking. Most people retain information and as soon as they leave, that information goes with them. You get a lot of specialization that could be spread beyond one employee but that's hardly the case and I have no idea why. Potential employees of NASDAQ need to be okay with old-school autocratic culture and expect that moving up and implementing change is a long and difficult process. Advice to Management Management need to relax the \"it's just business\" motive and remember the importance of retaining employees who are the building blocks of the company. Treat them as invaluable and listen to the common consensus that career paths here are not clear and that promotions are far too difficult to attain. Perks and benefits don't make up for these pivotal motives. Reward those who deserve it and they will reward you with the productivity you desire. Work processes and culture needs fixing and a complete restructure in some instances. The integrity of the business feels long forgotten.", "rating": 3, "pros": "The Sydney office is centrally located with plenty of entertainment and amenities - two kitchens, full barista-style coffee machine, cable TV, pool and ping pong tables as well as balconies and desk views overlooking Sydney Harbor.", "cons": "Nasdaq offers what is widely considered substandard pay. The disparity in payment between upper management and mid-level employees is far too big of a gap. Since the hierarchy is increasingly flattened, it becomes more and more of an issue amongst employees with many of the talented staff leaving for better opportunities elsewhere. Nasdaq doesn't seem to care too much about retaining anyone - they often replace loyal multi-year employee's with a mediocre entry-level hiree's for the purpose of budget. Most of us are made to feel disposable.", "advice": "Management need to relax the \"it's just business\" motive and remember the importance of retaining employees who are the building blocks of the company. Treat them as invaluable and listen to the common consensus that career paths here are not clear and that promotions are far too difficult to attain. Perks and benefits don't make up for these pivotal motives. Reward those who deserve it and they will reward you with the productivity you desire."}, {"title": "Good place to work if you don't mind working overtime... a lot.", "text": "Pros Nice work place, well located and enjoyable colleagues. Work is interesting, developing interesting products and services and senior management seems to know where they are heading. Cons Work life/balance can rapidbly be very imbalanced. Nasdaq has a lean policy (positions are re-filled only when everyone else is exhausted...) and salary is below industry average. Advice to Management Reward talented employees better.", "rating": 3, "pros": "Nice work place, well located and enjoyable colleagues. Work is interesting, developing interesting products and services and senior management seems to know where they are heading.", "cons": "Work life/balance can rapidbly be very imbalanced. Nasdaq has a lean policy (positions are re-filled only when everyone else is exhausted...) and salary is below industry average.", "advice": "Reward talented employees better."}, {"title": "Good place to learn", "text": "Pros Possibility to have a lot of training and learning something you want. Great innovation and idea. Flexibel, possibility to work from home. Cons Location is not near to the public transport e.g station and bus stop Advice to Management Get a better location for Nasdaq Netherlands", "rating": 5, "pros": "Possibility to have a lot of training and learning something you want. Great innovation and idea. Flexibel, possibility to work from home.", "cons": "Location is not near to the public transport e.g station and bus stop", "advice": "Get a better location for Nasdaq Netherlands"}, {"title": "Disappointed", "text": "Pros If you want to start a career there and have a great name on your CV - go for it. Corporate culture within the company is good, some of the internal events I attended were interesting. That's pretty much it. Cons Awful management, outdated processes and not willing to change. Management reacted very badly to criticism. If you're starting your career, but you want to have a meaningful job - go the other way and never look back. Advice to Management Time to start listening to your employees, their criticism can be relevant and is not directed at you. This breakdown in communication is very visible and is not healthy for both management, employees and the company.", "rating": 1, "pros": "If you want to start a career there and have a great name on your CV - go for it.", "cons": "Awful management, outdated processes and not willing to change. Management reacted very badly to criticism. If you're starting your career, but you want to have a meaningful job - go the other way and never look back.", "advice": "Time to start listening to your employees, their criticism can be relevant and is not directed at you. This breakdown in communication is very visible and is not healthy for both management, employees and the company."}, {"title": "Autonomy in a friendly team", "text": "Pros - Autonomous character of the work but within a team of warm, supportive individuals - Intelligent, approachable and responsive management Cons - Problems communicating with India branch; delayed relay of information - Due to this, sometimes information is erroneously changed and must be changed back, reducing efficiency Advice to Management Stay warm and approachable; keep creating the sense of a flat hierarchy as much as possible. This is absolutely the way to go in Germany.", "rating": 5, "pros": "- Autonomous character of the work but within a team of warm, supportive individuals", "cons": "- Problems communicating with India branch; delayed relay of information", "advice": "Stay warm and approachable; keep creating the sense of a flat hierarchy as much as possible. This is absolutely the way to go in Germany."}, {"title": "Unprofessional", "text": "Pros Good location Flexible work can be interesting may be able to travel Cons The worst place ive worked in, glad to be out. I've spoken to some others who left, a few liked it, but more of them said they didn't like the people or management there. There were some decent people in but they tend to be quiet an inactive. My unlucky area was dominated by some guys who seemed friendly at first, but soon you realise theyre a bad stereotype of insecure IT bullies with low social skills and zero respect for others. Soon after tbh it didn't feel like a workplace, more like a bad footy team at the pub. Complete with the alpha games, constant conversations about genitals, and lets not even start on the sexism. Professionalism was a joke, and that felt like the common attitude. These guys clearly liked it perhaps because they were the top of the foodchain, but if you end up with such characters and you don't fit in to that, or they target you, good luck, you might find it toxic, and good luck finding help. I've worked in other workplaces with similar demographics and they were much better than this. Advice to Management Advice to management is hire those who are actually good at managing people, not who wants a promotion, or who has been there a long time. Because a few really didn't seem to know much about it, or care about the people who work there, and it showed. Though they could pretend pretty well when being watched. There were some good ones, who should take more control and be less passive.", "rating": 1, "pros": "Good location", "cons": "The worst place ive worked in, glad to be out. I've spoken to some others who left, a few liked it, but more of them said they didn't like the people or management there.", "advice": "Advice to management is hire those who are actually good at managing people, not who wants a promotion, or who has been there a long time. Because a few really didn't seem to know much about it, or care about the people who work there, and it showed. Though they could pretend pretty well when being watched."}, {"title": "Director", "text": "Pros Good working atmosphere and great office Cons cons that go with working for an exchange mainly operating out of the US", "rating": 5, "pros": "Good working atmosphere and great office", "cons": "cons that go with working for an exchange mainly operating out of the US", "advice": null}, {"title": "Bailing Buckets from a Slowly Sinking Ship", "text": "Pros Great location - view of the harbour and opera house. Good facilities like a pool table and ping pong table Still retains some of the great things about its former startup feel with some great gems amongst the employees (unfortunately most are bailing out) Global company which opens up opportunities to travel/move for select positions/employees (mainly London/New York but also offices in Hong Kong/Bangladesh/Manilla) Good health insurance package. Cons Since the takeover from New York, previous social events and great environment have become all too politicised as senior management seems to struggle for more power, while structure starts to spread gap between senior management and the regular employee. A slowly sinking ship at the moment, anyone with any good experience/skill sets is jumping ship quick, while everyone left try and get the water out of the ship. Huge turnover rate of anyone with skill. Very political promotion structure. Management doesn't do well with struggling employees, people severely underperforming seem to not be correctly dealt with. As another review states once you get a job you're most likely to keep it which is great for those who want job security, but it means the people you're working with aren't scared of bad performance and due to the poor promotional procedures they won't bother to work on it. It causes a lot of averagely made ad-hoc solutions as no-one is willing to take the extra step to fix processes and issues. Say they pay for performance yet pay rises are like getting blood from a stone. General consensus internally is that compensation is low despite the workloads and the somewhat false reputation that NASDAQ pays well. Pay rises come few and far between so ensure your start pay is high enough to start with. Some mid management are clearly only in positions due to being staying with the company for a long time, but are lacking any actual management skills and some are still less skilled than employees in their team. Advice to Management Need to rework the promotional structure, the current MyCareer is a false smoke screen of opportunity, most employees don't have any trust in it and because they see no prospects of movement there is so many sub standard practices being employed and work done, not to mention the notorious 'hacky solutions'.", "rating": 3, "pros": "Great location - view of the harbour and opera house.", "cons": "Since the takeover from New York, previous social events and great environment have become all too politicised as senior management seems to struggle for more power, while structure starts to spread gap between senior management and the regular employee.", "advice": "Need to rework the promotional structure, the current MyCareer is a false smoke screen of opportunity, most employees don't have any trust in it and because they see no prospects of movement there is so many sub standard practices being employed and work done, not to mention the notorious 'hacky solutions'."}, {"title": "No vision, no ethics", "text": "Pros Financial incentives, Salary, bonus, location Cons Ethic, lack of vision, local HR not able to provide support in any way and should be removed. To much emphasis has been placed on quick turn arounds with no talent retention, especially for devs Advice to Management Change your focus", "rating": 1, "pros": "Financial incentives, Salary, bonus, location", "cons": "Ethic, lack of vision, local HR not able to provide support in any way and should be removed.", "advice": "Change your focus"}, {"title": "Systems Operation Specialist", "text": "Pros Good benefits, good ESPP program, very employee focused. Small teams with good communication. Cons Constant pressure to perform. Job can be stressful at times. Advice to Management You're doing a good job.", "rating": 5, "pros": "Good benefits, good ESPP program, very employee focused.", "cons": "Constant pressure to perform. Job can be stressful at times.", "advice": "You're doing a good job."}, {"title": "Software developer", "text": "Pros Great office location, very good health insurance. Cons You mostly need soft skills to get promoted / better pay here. As for technical skills, as long as your product works somehow, nobody cares. Infamous myCareer framework praised by local HR is used as an excuse not to promote people (\"here is something you don't match yet, and yes, we won't let you work on it\"). At the same time, softly skilled people easily bypass those checks. Essentially, you are at the mercy of your manager to be promoted or not. New hires area generally made for the pretty high level in the career ladder (because pay for the lower level is truly ridiculous), but beware of existing employees who were denied promotion to the same level from within :) Extremely noisy office (though there are a few quieter areas). Skilled people are leaving the company as fast as they can (considering the current job market situation in Au), pretty mediocre people are hired instead. Very few people were fired during last years for not doing their job properly, so once you are hired your job is safe :)", "rating": 3, "pros": "Great office location, very good health insurance.", "cons": "You mostly need soft skills to get promoted / better pay here. As for technical skills, as long as your product works somehow, nobody cares.", "advice": null}, {"title": "Great culture, challenging work but subpar pay.", "text": "Pros Great work life balance with a very flexible work schedule. The culture is very friendly amongst developers. Problems are quite challenging. Cons Pay is quite subpar for the work you do as a developer. Very dependent on your team. I am very satisfied working in my team but I wouldn't feel the same for others. Higher management and bureaucracy from the US office places many constraints on other offices.", "rating": 3, "pros": "Great work life balance with a very flexible work schedule. The culture is very friendly amongst developers. Problems are quite challenging.", "cons": "Pay is quite subpar for the work you do as a developer.", "advice": null}, {"title": "Nasdaq, Inc.", "text": "Pros Great culture and work environment dominated by people who are passionate in what they do. If you're someone who thrives in change and innovation, this company is for you. Fair compensation, while benefits such as equity grant and stock purchase are desirable. Cons Organizational structure may be too lean for some, so promotions may not necessarily come in timely. Client centric rather than employee centric. Changes happen pretty quickly. Too many mergers/acquisitions over the past few years, so it confuses company culture. Advice to Management Continue developing talents from within. Provide more opportunities for structured training and development.", "rating": 5, "pros": "Great culture and work environment dominated by people who are passionate in what they do. If you're someone who thrives in change and innovation, this company is for you. Fair compensation, while benefits such as equity grant and stock purchase are desirable.", "cons": "Organizational structure may be too lean for some, so promotions may not necessarily come in timely. Client centric rather than employee centric. Changes happen pretty quickly. Too many mergers/acquisitions over the past few years, so it confuses company culture.", "advice": "Continue developing talents from within. Provide more opportunities for structured training and development."}, {"title": "Part time employee", "text": "Pros Mostly great people. A lot of knowledge in this workplace. If you're a fulltime employee you have access to a gym, dry cleaning and great parking. Cons Didn't care for entry/lower position people. Underpaid and no access to the benefits normal fulltime employees count on.", "rating": 3, "pros": "Mostly great people. A lot of knowledge in this workplace.", "cons": "Didn't care for entry/lower position people. Underpaid and no access to the benefits normal fulltime employees count on.", "advice": null}, {"title": "Good so far....", "text": "Pros Nice office Work/life balance Skilled and social people Pretty good compensation International culture Cons American Corp. culture. Very hirarctical which blocks invation and good ideas from none management people. Advice to Management Keep inventing and don't be afraid to test new technology.", "rating": 5, "pros": "Nice office", "cons": "American Corp. culture. Very hirarctical which blocks invation and good ideas from none management people.", "advice": "Keep inventing and don't be afraid to test new technology."}, {"title": "Great place to work", "text": "Pros Great people, good work/life balance, opportunities to develop skills and increase qualifications Cons I think this is only applicable to my business unit, but it is very hard to climb the corporate ladder", "rating": 5, "pros": "Great people, good work/life balance, opportunities to develop skills and increase qualifications", "cons": "I think this is only applicable to my business unit, but it is very hard to climb the corporate ladder", "advice": null}, {"title": "Poor management", "text": "Pros Nice office in London. Friendly colleagues. Cons Scattered global structure with poor local management. There are a lot of bully and lies.", "rating": 1, "pros": "Nice office in London. Friendly colleagues.", "cons": "Scattered global structure with poor local management. There are a lot of bully and lies.", "advice": null}, {"title": "Avoid if possible", "text": "Pros At first it started well due to the environment being still a startup where everybody is treated like family and everybody's input is important. But as NASDAQ acquired our company and the company grew, it became more like an American corporate and more business, less fun, too much by the book Cons Management focusing too much on results, not people building nor team building Advice to Management Management, listen to feedback from your people, not only on the money", "rating": 3, "pros": "At first it started well due to the environment being still a startup where everybody is treated like family and everybody's input is important. But as NASDAQ acquired our company and the company grew, it became more like an American corporate and more business, less fun, too much by the book", "cons": "Management focusing too much on results, not people building nor team building", "advice": "Management, listen to feedback from your people, not only on the money"}, {"title": "Fantastic team culture", "text": "Pros Great team support and culture. Supports personal development and career progression. Great work life balance. HR is very proactive and approachable. Cons Technology doesn't match the fast paced environment. I don't see any other cons. Overall a good place to work for and highly it.", "rating": 5, "pros": "Great team support and culture.", "cons": "Technology doesn't match the fast paced environment.", "advice": null}, {"title": "Highly volatile international", "text": "Pros Working at Nasdaq opens up an enormous world of opportunities. Its business is varied and spread all over the world. This is a great place to start learning to work in a multicultural, multinational organization. It is home to anybody from any background. Cons With such a big organization based on American principles, it is rather strict and bureaucratic. You will have to learn to work with this or strive to improve it. Advice to Management It is most important to practice what is preached. Having a set of guiding principles helps the organization to know what to focus on, but only if management adopts these principles in its core first.", "rating": 5, "pros": "Working at Nasdaq opens up an enormous world of opportunities. Its business is varied and spread all over the world. This is a great place to start learning to work in a multicultural, multinational organization. It is home to anybody from any background.", "cons": "With such a big organization based on American principles, it is rather strict and bureaucratic. You will have to learn to work with this or strive to improve it.", "advice": "It is most important to practice what is preached. Having a set of guiding principles helps the organization to know what to focus on, but only if management adopts these principles in its core first."}, {"title": "Nice work environment but WORST pay", "text": "Pros Nice work environment. Working on a full development project with proper scrum. Flexible timings. TL and Manager are very co-operative. Cons HR dept is not so active. Incentive offered is very poor as compared to same level of company in India this is the one single reason for which I will not recommend Advice to Management Please revisit the salary scale and do a proper analysis of salary scale in current market", "rating": 5, "pros": "Nice work environment. Working on a full development project with proper scrum. Flexible timings. TL and Manager are very co-operative.", "cons": "HR dept is not so active. Incentive offered is very poor as compared to same level of company in India this is the one single reason for which I will not recommend", "advice": "Please revisit the salary scale and do a proper analysis of salary scale in current market"}, {"title": "Super Man Specialist", "text": "Pros Challenging tasks, minimal latency, multi-tasking environment. Cons Perks sometimes does not surprise. Advice to Management Management can apply some creativity to employee entertainment events like renting yacht, trip to Antarctica etc.", "rating": 5, "pros": "Challenging tasks, minimal latency, multi-tasking environment.", "cons": "Perks sometimes does not surprise.", "advice": "Management can apply some creativity to employee entertainment events like renting yacht, trip to Antarctica etc."}, {"title": "Nothing impressive", "text": "Pros Pay is good for developers, reasonable hikes and bonus Cons Support teams will struggle to get paid as compared to the market, low recognition, routine work. lack motivation", "rating": 3, "pros": "Pay is good for developers, reasonable hikes and bonus", "cons": "Support teams will struggle to get paid as compared to the market, low recognition, routine work. lack motivation", "advice": null}, {"title": "ABSOLUTELY PHENOMENAL", "text": "Pros Every single thing you just get to enjoy life and relax and make money while looking at your computer screen! You get to be part of the 1% of the world!!! Cons Absolutely nothing and nothing will ever be a con as long as you just want money and to live the dream life!", "rating": 5, "pros": "Every single thing you just get to enjoy life and relax and make money while looking at your computer screen! You get to be part of the 1% of the world!!!", "cons": "Absolutely nothing and nothing will ever be a con as long as you just want money and to live the dream life!", "advice": null}, {"title": "A good internship", "text": "Pros Great management and colleagues, great and real projects as an intern, adequate salary, international environment, inspiring lectures and overall very educational while still being a part of something real, some benefits are very nice like the Nasdaq shuttle bus. Cons The office space is OK but it wouldn't hurt with some improvement as it's situated a bit \"off\", some IT platfrom restrictions are just ridiccolous and makes certain tasks taking a lot more time, a greater trust in the ingenuity, ideas and the willing to explore other solutions would benefit the progress of the intern's project. Advice to Management Lift some Windows UAC restrictions as it harms day to day operations. Allow interns to explore other solutions and place a bit more trust in them when it comes to the IT environment.", "rating": 5, "pros": "Great management and colleagues, great and real projects as an intern, adequate salary, international environment, inspiring lectures and overall very educational while still being a part of something real, some benefits are very nice like the Nasdaq shuttle bus.", "cons": "The office space is OK but it wouldn't hurt with some improvement as it's situated a bit \"off\", some IT platfrom restrictions are just ridiccolous and makes certain tasks taking a lot more time, a greater trust in the ingenuity, ideas and the willing to explore other solutions would benefit the progress of the intern's project.", "advice": "Lift some Windows UAC restrictions as it harms day to day operations. Allow interns to explore other solutions and place a bit more trust in them when it comes to the IT environment."}, {"title": "Good people, poor management", "text": "Pros Friendly culture with co-workers Nice amenities (Good office, pool table, coffee machine) Reasonably flexible work hours Cons Poorly managed projects Outdated technologies, little to no investment in the future Average salary Very top heavy - Upper level of management makes all decisions and is a very closed cluy\\b", "rating": 3, "pros": "Friendly culture with co-workers", "cons": "Poorly managed projects", "advice": null}, {"title": "Very Political, Not very Technical", "text": "Pros The Salary isn't awful, the offices are acceptable, the location I worked at is close to public transport (which is lucky, there's no hope of getting parking). Cons The politics are hideous, if you are hired by the \"wrong\" people you will have lies told about you and you will be sidelined at every opportunity, in this case the very best you can hope for is that you can survive long enough to be made redundant Advice to Management Get real feedback from the grassroots, understand what your management is doing and that all of the skill sets are important to the company not just a few stars.", "rating": 1, "pros": "The Salary isn't awful, the offices are acceptable, the location I worked at is close to public transport (which is lucky, there's no hope of getting parking).", "cons": "The politics are hideous, if you are hired by the \"wrong\" people you will have lies told about you and you will be sidelined at every opportunity, in this case the very best you can hope for is that you can survive long enough to be made redundant", "advice": "Get real feedback from the grassroots, understand what your management is doing and that all of the skill sets are important to the company not just a few stars."}, {"title": "Great learning experience", "text": "Pros Relatively flat organization. Good learning experience. Friendly and talented people. A Lot of own responsibility and no micromanagement from managers. Cons The thing I find the most annoying is that the best people isn't rewarded enough for their great work. Salary is not great (Nordic Office). Advice to Management More incentives to the best employees. More internal training.", "rating": 5, "pros": "Relatively flat organization.", "cons": "The thing I find the most annoying is that the best people isn't rewarded enough for their great work. Salary is not great (Nordic Office).", "advice": "More incentives to the best employees. More internal training."}, {"title": "A company in search of a purpose", "text": "Pros Apparently they have a reputation for paying above market - but this wasn't my experience! I endorse the focus on driving true business performance with full transparency Cons This is essentially and organization that doesn't pretend to be motivated by anything other than the profit motive. It has no real purpose, other than to create the infrastructure whereby rich people and companies can make themselves richer. For either new grads who want to change the world or old hacks who no better but still need a purpose - cross this one off your list Advice to Management Stop focusing on financial engineering to achieve meaningless margin targets and start running your business as it should be run: customers first but also for the true benefits of shareholders and employees. Shareholder value by the way, is built on the twin pillars of long-term financial and business discipline.....not the tyranny of the quarterly EPS increase.", "rating": 3, "pros": "Apparently they have a reputation for paying above market - but this wasn't my experience!", "cons": "This is essentially and organization that doesn't pretend to be motivated by anything other than the profit motive. It has no real purpose, other than to create the infrastructure whereby rich people and companies can make themselves richer. For either new grads who want to change the world or old hacks who no better but still need a purpose - cross this one off your list", "advice": "Stop focusing on financial engineering to achieve meaningless margin targets and start running your business as it should be run: customers first but also for the true benefits of shareholders and employees. Shareholder value by the way, is built on the twin pillars of long-term financial and business discipline.....not the tyranny of the quarterly EPS increase."}, {"title": "NASDAQ offers a stimulating environment, where daily activities vary greatly.", "text": "Pros Relaxed, flexible and usually informal environment that encourages individual input and self motivation. Daily activities vary greatly, offering variety and challenge. Regular client interaction on a global level makes the company feel grounded in the real world. Cons Large organisation which unfortunately brings a fair degree of bureaucracy with it. Training opportunities tend to be limited. Pay is industry standard. Advice to Management Greater access to training of employees would be beneficial to all. More allowance for R&D activities would help to get fresh IT ideas into the current products, as some of these are somewhat dated.", "rating": 5, "pros": "Relaxed, flexible and usually informal environment that encourages individual input and self motivation. Daily activities vary greatly, offering variety and challenge. Regular client interaction on a global level makes the company feel grounded in the real world.", "cons": "Large organisation which unfortunately brings a fair degree of bureaucracy with it. Training opportunities tend to be limited. Pay is industry standard.", "advice": "Greater access to training of employees would be beneficial to all. More allowance for R&D activities would help to get fresh IT ideas into the current products, as some of these are somewhat dated."}, {"title": "not a bad place to work if you are lucky work in the good team", "text": "Pros Relax working env, good people, good career prospective, HR training. Cons Some people are very hard to work with. Advice to Management listen more to new employees", "rating": 3, "pros": "Relax working env, good people, good career prospective, HR training.", "cons": "Some people are very hard to work with.", "advice": "listen more to new employees"}, {"title": "Represents everything that has gone wrong with the corporate world", "text": "Pros Some colleagues are nice and motivated, benefits offered are not bad. Work-life balance is good for financial services sector. The food in the canteen is decent. Cons Do you remember the film Office Space? Well, here is a place you can re-live it. LACK OF TEAMWORK: The culture is non-existent, people don't collaborate, don't share information. Everyone plays for themselves - team is an strange word in this company. Information is power is what I have been told. LACK OF SKILL: Middle-managers are lazy and totally uninterested in any development of those who report to them. People don't read and/or answer their emails, seriously. LACK OF MONEY (or just being stingy?):Everything is about saving costs. This results into staying in shabby hotels when travelling, unsubsidized cantine, having to use outdated technology...and slowly but surely decline in talent and performance....so sad. Of course there are teams that handle this better than others... Advice to Management 1. Please create a company culture - I know you tried, but failed. 2. Instead invest in your people, systems and the environment. 3. Stop trying to save cost - it gets a bit embarrassing.", "rating": 1, "pros": "Some colleagues are nice and motivated, benefits offered are not bad.", "cons": "Do you remember the film Office Space? Well, here is a place you can re-live it.", "advice": "1. Please create a company culture - I know you tried, but failed."}, {"title": "Forget about flexible working.", "text": "Pros Nasdaq is a technology focused company and focuses to implement and maintain cutting-edge solutions, so if you like working with the latest technology, then some projects can be intresting.. Cons Are a supporter of workshifting and the future of work? Do you believe that social media is no longer just a leisure activity but a big part of how companies are doing business and raising brand awareness? Do you believe that flex time is becoming more common, that if employees need to come into work later, or work from home on Fridays, they can. Do you appreciate companies that are recognizing your work and completing tasks on time are more important than meeting your 8-hour mark each day? Then Nasdaq is not the company for you. I found it very hard to maintain a working work/life balance, being used to perform certain personal task to keep up with day-to-day family issues, like having a shared personal calender in Google calendar, or communicate with my wife with Gmail. Nasdaq is using webfiltering to censor particular content Categories. Personal mail is not allowed, so access to mail providers like gmail.com, hotmail.com, outlook.com and Office 365 are blocked. Certain Personal Cloud storage providers are not blocked, however, bandwith are throttled, so access to sites like Dropbox is going painfully slow, making it useless. Among the categories and content blocked are Sex Education, Social Networking (Facebook is whitelisted), Chat (IM), Email, Gamling, Games, Abortion, Dating, Weapons. The company doesn't not encourague homeworking and criticize people not showing 100% facetime, not recognising family and caring responsibilites. There's a lot of internal politics hindering a dynamic and progressive work environment and managers tend to micromanage you. There are two types of career advancement: Progression (Moving to another job at the same or lower level) and Promotion (Moving to a job at a higher career level) Successfully meeting the skills and requirements for a career level does not necessarily entitle to a promotion. There must be either an open position, or the role’s depth and impact has had to increase in scope. The department must have a need and requirement for a higher level role. All workspaces are typically located in the open landscape and there's a fitness center with a gym that can be used free of charge. (classes cost money) Advice to Management Middle management need to practice company values. Senior Management need to open up for the future way of working.", "rating": 1, "pros": "Nasdaq is a technology focused company and focuses to implement and maintain cutting-edge solutions, so if you like working with the latest technology, then some projects can be intresting..", "cons": "Are a supporter of workshifting and the future of work? Do you believe that social media is no longer just a leisure activity but a big part of how companies are doing business and raising brand awareness? Do you believe that flex time is becoming more common, that if employees need to come into work later, or work from home on Fridays, they can. Do you appreciate companies that are recognizing your work and completing tasks on time are more important than meeting your 8-hour mark each day?", "advice": "Middle management need to practice company values. Senior Management need to open up for the future way of working."}, {"title": "Bumbling company", "text": "Pros Laid back culture, thats about it Cons Big visions ungrounded in reality Advice to Management Stop trying to live down Facebook IPO blunder", "rating": 3, "pros": "Laid back culture, thats about it", "cons": "Big visions ungrounded in reality", "advice": "Stop trying to live down Facebook IPO blunder"}, {"title": "Terrible", "text": "Pros None I can think of. Cons Old technology used. Old methods of doing business. CEO has major impact on all areas and fires high value, high paid staff to reduce costs and increase that all important margin. Upper Management have no clue on the business area I worked under. Advice to Management Leave and let someone more able take over. Don't fire high value staff, allow them to grow and help the business move forward.", "rating": 1, "pros": "None I can think of.", "cons": "Old technology used.", "advice": "Leave and let someone more able take over."}, {"title": "Great work environment, very professional staff and support teams", "text": "Pros Great exposure Individual creativity and innovation is valued Well defined processes Very supportive staff and managers Very helpful HR and IT support staff Cons Sometimes, things might move slowly Decision making take a long time", "rating": 5, "pros": "Great exposure", "cons": "Sometimes, things might move slowly", "advice": null}, {"title": "Very unorganized with clueless and reactionary management.", "text": "Pros Local team was great to work with. Cons Management is more concerned with reactionary cost cutting and saving their own jobs than they are with the effect it will create down the road. There are a lot of faceless names calling the shots with out even stepping foot in the door to find out what the issue are and how to fix them. Advice to Management If you keep cut down to the bone, you will have no muscle to flex your strength. Treat your employees like they matter to the company and not just a number on a spreadsheet", "rating": 1, "pros": "Local team was great to work with.", "cons": "Management is more concerned with reactionary cost cutting and saving their own jobs than they are with the effect it will create down the road. There are a lot of faceless names calling the shots with out even stepping foot in the door to find out what the issue are and how to fix them.", "advice": "If you keep cut down to the bone, you will have no muscle to flex your strength. Treat your employees like they matter to the company and not just a number on a spreadsheet"}, {"title": "Good.", "text": "Pros Work-life balance, international organization, colleagues Cons Matrix organization, too bureaucratic, American style leadership", "rating": 5, "pros": "Work-life balance, international organization, colleagues", "cons": "Matrix organization, too bureaucratic, American style leadership", "advice": null}, {"title": "The American organization with a Swedish working culture", "text": "Pros The Swedish working culture is friendly and creates an open athmosphere - you can ask anyonne about anything and always get a friendly welcome. Cons The organization is hierarchical which makes it less flexible and the process of taking decisions may take longer than average.", "rating": 5, "pros": "The Swedish working culture is friendly and creates an open athmosphere - you can ask anyonne about anything and always get a friendly welcome.", "cons": "The organization is hierarchical which makes it less flexible and the process of taking decisions may take longer than average.", "advice": null}, {"title": "Poor leadership at all levels-worked to death", "text": "Pros Good company name on resume, use it to get out and find a better company to work for, decent health insurance Cons Poor leadership at all levels, over last few years have consistenly piled on more and more work to the little people. Should be hiring due to more and more work coming in,new contracts being won, instead they are laying people off. They are suppose to be a market for technology and their technology is horrid, look at the day of the Facebook IPO and those issues, that was the tip of the iceberg. Regular workers are fed up and just trying to hang on until they can find something better. The GCS division is incredibly low-staffed, if clients only knew their jaws would drop. Advice to Management When business is way up in certain areas, and staff are feeling incredibly over-worked, don't ask them to do more with less and lay people off, hire. Take a pay cut like the rest of us", "rating": 1, "pros": "Good company name on resume, use it to get out and find a better company to work for, decent health insurance", "cons": "Poor leadership at all levels, over last few years have consistenly piled on more and more work to the little people. Should be hiring due to more and more work coming in,new contracts being won, instead they are laying people off. They are suppose to be a market for technology and their technology is horrid, look at the day of the Facebook IPO and those issues, that was the tip of the iceberg. Regular workers are fed up and just trying to hang on until they can find something better. The GCS division is incredibly low-staffed, if clients only knew their jaws would drop.", "advice": "When business is way up in certain areas, and staff are feeling incredibly over-worked, don't ask them to do more with less and lay people off, hire. Take a pay cut like the rest of us"}, {"title": "Exciting place to work", "text": "Pros - Fast changing business -- can be quite exciting - Expanding globally into new business lines - Generally strong management team - Leverages new technology (though some is ancient) - Many of the world's largest and well known companies are customers - Generally good communications from management - Small enough that you get to know much of the company - NASDAQ name has huge brand recognition Cons - Corporate bureaucracy - unusually high for a company of this size (<4K staff) - Too much going on - frequent strategic confusion among management - Not enough tech resources supporting most business units - Long work hours - but fun if you are up for the challenge - Disorganized budget planning processes Advice to Management - Focus on doing fewer things better - Improve marketing - bring back excitement of late-90s campaigns - Make additional investments in tech operations", "rating": 5, "pros": "- Fast changing business -- can be quite exciting", "cons": "- Corporate bureaucracy - unusually high for a company of this size (<4K staff)", "advice": "- Focus on doing fewer things better"}, {"title": "nice experience", "text": "Pros great local team and local management Cons poor high level/top management and communication to high level", "rating": 3, "pros": "great local team and local management", "cons": "poor high level/top management and communication to high level", "advice": null}, {"title": "positive in some ways - disappointing in others", "text": "Pros leader in space with good technology Cons confusion on how best to grow the business", "rating": 3, "pros": "leader in space with good technology", "cons": "confusion on how best to grow the business", "advice": null}, {"title": "summer intern", "text": "Pros great pay interesting projects to work on Cons no leadership Managing Director does not take the time to give clear directions Advice to Management provide leadership", "rating": 3, "pros": "great pay", "cons": "no leadership", "advice": "provide leadership"}, {"title": "Need a stronger senior management team.", "text": "Pros Big company with global appearance. Strong competitor in the industry. Strong products with steady portion of market shares. Good benefit package. Cons Senior management lacks of leading skills especially in the technical department . Too much overhead costs. The merge with OMX did not go well. Advice to Management Reorganize the product line. Trimming the overhead cost, especially the senior management and VP level management. Emphasize the client-oriented business model.", "rating": 3, "pros": "Big company with global appearance. Strong competitor in the industry.", "cons": "Senior management lacks of leading skills especially in the technical department . Too much overhead costs. The merge with OMX did not go well.", "advice": "Reorganize the product line. Trimming the overhead cost, especially the senior management and VP level management. Emphasize the client-oriented business model."}, {"title": "it's a nice place to launch a career in finance but you'll have to move on for 'real' success", "text": "Pros Nasdaq OMX has quite a bit of dedicated, bright and interesting employees. Morale is pretty good even through trying times for the financial sector. If you're good at what you do, job security is almost guaranteed. Cons Former management was far more cerebral. The company seems to be more interesting in acquiring companies than perfecting its existing organization. Managers don't seem particularly dedicated or concerned about developing talent or career mobility for better employees. Advice to Management Start to invest more in the employees. Ensure that there is more consistency across departments in the ways that workers are treated, evaluated and compensated.", "rating": 3, "pros": "Nasdaq OMX has quite a bit of dedicated, bright and interesting employees. Morale is pretty good even through trying times for the financial sector. If you're good at what you do, job security is almost guaranteed.", "cons": "Former management was far more cerebral. The company seems to be more interesting in acquiring companies than perfecting its existing organization. Managers don't seem particularly dedicated or concerned about developing talent or career mobility for better employees.", "advice": "Start to invest more in the employees. Ensure that there is more consistency across departments in the ways that workers are treated, evaluated and compensated."}, {"title": "Interessante Tätigkeit", "text": "Pros Kollegen, Arbeitsumfeld, Chef, Technik, Arbeitsweg Cons Entwicklungschancen, Aufstiegschancen, keine flachen Hierarchien, Gehalt", "rating": 5, "pros": "Kollegen, Arbeitsumfeld, Chef, Technik, Arbeitsweg", "cons": "Entwicklungschancen, Aufstiegschancen, keine flachen Hierarchien, Gehalt", "advice": null}, {"title": "Kundenberatung", "text": "Pros Umgang mit Team & Kollegen einfach toll Cons Abgefahrene Schichtarbeit, die dir überhaupt kein Privatleben lässt. Advice to Management Lern dazu, deine Mitarbeiter zu schätzen...", "rating": 3, "pros": "Umgang mit Team & Kollegen einfach toll", "cons": "Abgefahrene Schichtarbeit, die dir überhaupt kein Privatleben lässt.", "advice": "Lern dazu, deine Mitarbeiter zu schätzen..."}]