[{"title": "Great place to start a career - salary and experience will vary by team/department", "text": "Pros - Well known name in the analytics industry, especially when it comes to CPG - Exposure to higher ups at clients if you're in a client-facing role - Awesome place to start a career Cons - Salary was well below industry average and it was tough to get more than a 2-3% yearly increase. It was a common joke that you had to leave and come back a year later to get a significant salary bump - Depending on the team/client you could end up in a really terrible situation Advice to Management - Reassess salary when relative to the industry. People will just use this company as a springboard to better ops unless you incentivize them to stay.", "rating": 5, "pros": "- Well known name in the analytics industry, especially when it comes to CPG", "cons": "- Salary was well below industry average and it was tough to get more than a 2-3% yearly increase. It was a common joke that you had to leave and come back a year later to get a significant salary bump", "advice": "- Reassess salary when relative to the industry. People will just use this company as a springboard to better ops unless you incentivize them to stay."}, {"title": "Culture is great, but questionable long-term outlook", "text": "Pros There are two main reasons why I continue to stay at Nielsen: 1) Access to data and breadth of opportunities. Being constantly challenged is really important to me in a role. The variety of data we work with and the wide client base means that the work can be quite varied, and it's easy to get involved in complex projects. There are obviously roles at Nielsen where you can do the same thing day in and day out for years, but there's also a lot of opportunity to grow if you look for it. 2) Culture. This is huge--probably the biggest reason I stay at Nielsen. Overall, the culture is very relaxed and meritocratic; people who are helpful, kind and engaged are the norm. The company truly recognizes and values from top-down everyone's achievements and individuality; I've never felt like a cog in the machine here, and I feel evaluated on merit, not my title or tenure. I really like the people I work with, too, not just on my immediate team, but more broadly. Nielsen hires a wide variety of people, but a common trait throughout (and encouraged through the culture) is being engaging and supportive. Net net, I look forward to coming into work every day. Cons Do I see myself leaving Nielsen someday? Possibly, yes, but it would be as a result of the company's health if they can't right the ship. For a self-titled \"technology company\", Nielsen leaves a lot to desired across multiple levels, which is frustrating because I want the company to do well. Developing measurement capabilities is incredibly difficult, and I don't want to understate that, but I wish we were pushing the gas pedal even harder on measurement capabilities. TV is dying; so, too, eventually will much of our revenue. If we can't get digital right, then Nielsen is going to become quickly irrelevant, and much of pro #1 is going to dissipate for me. Also, a huge con is that Nielsen is already suffering financially, with no immediate end in sight. Layoffs, reorgs, the mad scramble to hit impossible revenue targets-it gets wearying. There are a lot of reasons why Nielsen isn't doing well, but one area that jumps out at me and frustrates me to no end is our technology (beyond measurement). Some of our products are, well, terrible. If you have to hire people to pull reports for clients because your products are so hard to use (there are -many- teams that do just this), it's arguable whether money might be better spent on improving the product? Relatedly, even in my department alone, there are a ton of things that could just be straight-out automated. Why should someone spend a week on highly canned decks that can be populated by a script in less than a minute? When Nielsen considers how to trim the fat, there's plenty of fat in inefficiency that never seems to be trimmed and should be. Throwing people at problems that should really be solved with technology is a recurring theme and one we need to be careful of.", "rating": 5, "pros": "There are two main reasons why I continue to stay at Nielsen:", "cons": "Do I see myself leaving Nielsen someday? Possibly, yes, but it would be as a result of the company's health if they can't right the ship. For a self-titled \"technology company\", Nielsen leaves a lot to desired across multiple levels, which is frustrating because I want the company to do well. Developing measurement capabilities is incredibly difficult, and I don't want to understate that, but I wish we were pushing the gas pedal even harder on measurement capabilities. TV is dying; so, too, eventually will much of our revenue. If we can't get digital right, then Nielsen is going to become quickly irrelevant, and much of pro #1 is going to dissipate for me.", "advice": null}, {"title": "Research Analyst", "text": "Pros PTO and 401K is good Cons healthcare plan is not so great", "rating": 5, "pros": "PTO and 401K is good", "cons": "healthcare plan is not so great", "advice": null}, {"title": "Market Research Interviewer", "text": "Pros Great Experience to learn something new! Cons It helps with my resume", "rating": 5, "pros": "Great Experience to learn something new!", "cons": "It helps with my resume", "advice": null}, {"title": "Field Representative", "text": "Pros Company car, possible career advancement and free training if you can find the time or even where to take it online via the poor intranet. Cons Very bad training that doesn't even cover the majority of the field work a rep will be performing. Area managers that are new may have no experience in field work as we found out though he was indeed a decent person. The equipment they use to meter televisions is outdated, they do not have quality control or quality assurance before releasing equipment or reparing it. Finally, the pressure to perform is tolerable for sure, accept when there is need for a scapegoat.......\"$^&$ runs down hill\" and this is a perfect model of how that works. If this company could get with the times, actually train reps for what they will actually do and managers were experienced in the field as well, I think it would be the best place to work. As it is now, take the 3 month training in lovely Tampa, do the best you can and find a better job. Especially if you have a degree. If this environment is new to you or you don't have a career pathway or college, stick it out and it will be possibly the best thing for you. Advice to Management Hire area managers that actually know what the field reps do, know the equipment and are capable of performing so they don't have a need to throw reps under the bus. I didn't face this problem but watched it over and over again. Develop a quality assurance department and don't send areas equipment that doesn't work. It is embarrasing and makes the job 100 times harder for what little pay we receive. Cheers.", "rating": 3, "pros": "Company car, possible career advancement and free training if you can find the time or even where to take it online via the poor intranet.", "cons": "Very bad training that doesn't even cover the majority of the field work a rep will be performing. Area managers that are new may have no experience in field work as we found out though he was indeed a decent person. The equipment they use to meter televisions is outdated, they do not have quality control or quality assurance before releasing equipment or reparing it. Finally, the pressure to perform is tolerable for sure, accept when there is need for a scapegoat.......\"$^&$ runs down hill\" and this is a perfect model of how that works.", "advice": "Hire area managers that actually know what the field reps do, know the equipment and are capable of performing so they don't have a need to throw reps under the bus. I didn't face this problem but watched it over and over again. Develop a quality assurance department and don't send areas equipment that doesn't work. It is embarrasing and makes the job 100 times harder for what little pay we receive. Cheers."}, {"title": "Sr. Data Scientist", "text": "Pros Flexible work schedule including work at home for up to 3 days a week. Decently updated downtown Chicago office. Pay is not bad. Cons Lack of oversight. No confidence that my work is really contributing to revenue generation. Bugs everywhere in codes. Extremely high turnover. Medical insurance (united healthcare) is worse than competitors’.", "rating": 3, "pros": "Flexible work schedule including work at home for up to 3 days a week. Decently updated downtown Chicago office. Pay is not bad.", "cons": "Lack of oversight. No confidence that my work is really contributing to revenue generation. Bugs everywhere in codes. Extremely high turnover. Medical insurance (united healthcare) is worse than competitors’.", "advice": null}, {"title": "Director", "text": "Pros Good tools for today’s business issues Cons Sheeplike behavior is primarily held in high regard Advice to Management Need checks and balances to solicit honest feedback from teams regarding team leaders without fear of retribution. I had a friend on another team who got a new leader and the first thing they did with the team was to give a ppt presentation about themselves, highlighting that thei IQ was “higher than Einstein’s,” but when it came to mentoring and working with their staff responses were incongruous with actions at best. Smoke and mirrors leader with no accountability. It’s a shame. It didn’t used to be like that", "rating": 3, "pros": "Good tools for today’s business issues", "cons": "Sheeplike behavior is primarily held in high regard", "advice": "Need checks and balances to solicit honest feedback from teams regarding team leaders without fear of retribution. I had a friend on another team who got a new leader and the first thing they did with the team was to give a ppt presentation about themselves, highlighting that thei IQ was “higher than Einstein’s,” but when it came to mentoring and working with their staff responses were incongruous with actions at best. Smoke and mirrors leader with no accountability. It’s a shame. It didn’t used to be like that"}, {"title": "Membership Representative", "text": "Pros Excellent benefits. Car, laptop and phone are provided. Cons Company is currently in a hiring frenzy. There is not enough quality work for everyone making it challenging to meet your numbers. Even when you meet your sales numbers the bonus is very small. Management micromanages and is quick to get you on a performance plan to help you-but all it means is that you need to work Saturdays. Their systems are outdated and slow making it difficult and frustrating to complete your work. I survived for 2 years which is more than most. Advice to Management Show a little respect for this low paying difficult job. Senior management should spend a day in the field with an MR.", "rating": 3, "pros": "Excellent benefits. Car, laptop and phone are provided.", "cons": "Company is currently in a hiring frenzy. There is not enough quality work for everyone making it challenging to meet your numbers. Even when you meet your sales numbers the bonus is very small. Management micromanages and is quick to get you on a performance plan to help you-but all it means is that you need to work Saturdays. Their systems are outdated and slow making it difficult and frustrating to complete your work. I survived for 2 years which is more than most.", "advice": "Show a little respect for this low paying difficult job. Senior management should spend a day in the field with an MR."}, {"title": "Cool place to work, needs some improvement", "text": "Pros Some cool teams, doing dynamic work Cons No room for growth if you're an admin. Some teams simply don't know what to do with you & it can leave you stagnant. Advice to Management Invest in mentorship and growth opportunities for your Admin personnel. Not all are content with being an Admin forever and many want the chance to move into different roles. Also, because you're an Admin does not mean all you're good for is scheduling meetings and processing T&E.", "rating": 3, "pros": "Some cool teams, doing dynamic work", "cons": "No room for growth if you're an admin. Some teams simply don't know what to do with you & it can leave you stagnant.", "advice": "Invest in mentorship and growth opportunities for your Admin personnel. Not all are content with being an Admin forever and many want the chance to move into different roles. Also, because you're an Admin does not mean all you're good for is scheduling meetings and processing T&E."}, {"title": "RI", "text": "Pros Higher end workplace, professional workplace, people and mgmt, fair pay... Cons None so far. (Save that position is only temp.) Advice to Management Zero, all good so far. (Rather new there.)", "rating": 5, "pros": "Higher end workplace, professional workplace, people and mgmt, fair pay...", "cons": "None so far. (Save that position is only temp.)", "advice": "Zero, all good so far. (Rather new there.)"}, {"title": "Good", "text": "Pros Easy pace of work - Good work-life balance. Salary is lower than median but flexibility and unlimited vacation makes up for it. Cons Low salary. Some sectors still use old technology.", "rating": 5, "pros": "Easy pace of work - Good work-life balance. Salary is lower than median but flexibility and unlimited vacation makes up for it.", "cons": "Low salary.", "advice": null}, {"title": "Filed representative", "text": "Pros Lots of freedom, car and gas card, bonus can be great if you run your area good. Schedule your own day for the most part. Meet and see lots of interesting people this company has HUGE opportunity to move up if your willing to relocate. The upper headquarters management really seems to care about there employees Cons Bonus are dependent on whether your homes that you're in charge of push there buttons or let you in to get things done, out equipment is ancient and consistently breaks but its your bonus that's effected. Management is outdated with managers stuck in the old ways of doing things. Only look at numbers and never pay attention to what you're actually getting done. Horrible work life Ballance if homes want to schedule at 7:30pm and they live 2 hours away that's were you'll be. Advice to Management Start paying attention to the low level managers. When you have a revolving door of reps leaving, look into the market management. Help FR in rougher areas earn there bonus. It's not fare that reps that run the rich nice areas always get bonus and the reps like me in the lower income or bad areas never earn anything do to pour preforming homes", "rating": 3, "pros": "Lots of freedom, car and gas card, bonus can be great if you run your area good. Schedule your own day for the most part. Meet and see lots of interesting people this company has HUGE opportunity to move up if your willing to relocate. The upper headquarters management really seems to care about there employees", "cons": "Bonus are dependent on whether your homes that you're in charge of push there buttons or let you in to get things done, out equipment is ancient and consistently breaks but its your bonus that's effected. Management is outdated with managers stuck in the old ways of doing things. Only look at numbers and never pay attention to what you're actually getting done. Horrible work life Ballance if homes want to schedule at 7:30pm and they live 2 hours away that's were you'll be.", "advice": "Start paying attention to the low level managers. When you have a revolving door of reps leaving, look into the market management. Help FR in rougher areas earn there bonus. It's not fare that reps that run the rich nice areas always get bonus and the reps like me in the lower income or bad areas never earn anything do to pour preforming homes"}, {"title": "Love my job", "text": "Pros Being able to bring back memories with a song Cons Not being live On the air to talk to people Advice to Management Bring back personality and live.shows", "rating": 5, "pros": "Being able to bring back memories with a song", "cons": "Not being live On the air to talk to people", "advice": "Bring back personality and live.shows"}, {"title": "Retail Service", "text": "Pros Work life balance is good Cons career opportunities are limited unless you're part of a clique.", "rating": 3, "pros": "Work life balance is good", "cons": "career opportunities are limited unless you're part of a clique.", "advice": null}, {"title": "Seems great so far...", "text": "Pros Professional, upscale work environment, fair wages... Cons Zero thus far, zero complaint... Advice to Management None!", "rating": 5, "pros": "Professional, upscale work environment, fair wages...", "cons": "Zero thus far, zero complaint...", "advice": "None!"}, {"title": "Director", "text": "Pros Well respected, considered crucial in the media ecosystem, data considered best in class. Cons Sometimes Management is more concerned about internal power struggles than making better projects. Advice to Management Get a grip on the needs of your clients.", "rating": 3, "pros": "Well respected, considered crucial in the media ecosystem, data considered best in class.", "cons": "Sometimes Management is more concerned about internal power struggles than making better projects.", "advice": "Get a grip on the needs of your clients."}, {"title": "A world of opportunities in a human company", "text": "Pros Opportunities to grow across departments, clients or countries Interest in the well-being of employees Cons Tough economic time with increased competition and overall FMCG world slow down", "rating": 5, "pros": "Opportunities to grow across departments, clients or countries", "cons": "Tough economic time with increased competition and overall FMCG world slow down", "advice": null}, {"title": "VP Sales", "text": "Pros Nielsen is good at delivery and customer service. Cons Their businesses are in decline, don't really want disruption so struggle with innovation and change. Slow moving, Senior Management. It's a highly political click amongst the lifers, those with 20+ years of Nielsen and only worked for NIelsen. Advice to Management Do some serious sould searching and objective evaluation of your business model, your culture and your people.", "rating": 3, "pros": "Nielsen is good at delivery and customer service.", "cons": "Their businesses are in decline, don't really want disruption so struggle with innovation and change. Slow moving, Senior Management. It's a highly political click amongst the lifers, those with 20+ years of Nielsen and only worked for NIelsen.", "advice": "Do some serious sould searching and objective evaluation of your business model, your culture and your people."}, {"title": "Membership Rep, Field operations", "text": "Pros insurance benefits, company car, work from home Cons Everything. IF you're interested in the M.R. position, it is common knowledge that they terminate the reps annually. First round is August, sept/oct is pushed for improved numbers and their bonus, then back to hell as they seek to have everyone fired before christmas. All the reviews calling it a \"turn-stile\" is true 100%. They lie during the interview that you can make 8-10K monthly bonus. Complete BS. I exceeded my performance and the best I could net after texas was $960 bonus. Salary/hourly is about 32K annual. They put reps on a \"schedule for success\" which is the path to rapid termination in three weeks. They even fraudulently filed FMLA on me and I wasn't sick! I wasted 1.5 year giving them time to fix things. yeah right. The board of directors are worthless and Dwight Barns (CEO destroying Nielsen) has a relationship with James Atwood of the Carlyle Group in NYC. Atwood becomes the Chairman of the Board jan. 2016. By Jan. 2017 the carlyle group completes it's first acquisition of a Nielsen subsidiary announced in their press release. Carlyle has also been funding Nielsen since 2006? Why? Dwight sits on the board for Monsanto for employee compensation and corporate responsibility. Seriously? I sent Dwight emails begging for field help including a cease and desist. Why did i get fired...??? I exceeded expectations on performance and did it in less than 40 hrs in a week, saved the company money and gave them excellent work. I got fired for being efficient. A friend got written up for being 7 minutes shy of her 40 hours. PLEASE PLEASE PLEASE DO NOT WORK FOR Nielsen as long as Dwight is the CEO. HE IS DESTROYING MR. NEILSEN'S LEGACY!!!! Advice to Management I can't find a Nielsen family member which is probably why Nielsen is in such poor shape. Someone needs to buy this company, like google, and restructure it from top to bottom. Since everyone has \"common knowledge\" of their abuse of power, why are they allowed to get away with this toxic behavior???? GOOGLE......!!!!! PLEASE BUY NIELSEN AND CLEAN HOUSE!!! Oh yeah........the ratings aren't accurate like Netflix claimed months ago. Nielsen management lies and lies to clients, to employees to everyone associated with Nielsen. I don't know how they sleep at night. This company is BEYOND anything I've seen in my almost 30 years of corporate life. The first flag should've been their website talking non-stop about integrity. How come the code of conduct doesn't cover corruption in the U.S. but for global code of conduct, you can find the corruption segment? How come the board of directors are getting paid for ZERO over-sight??? If they were doing their jobs, why has attwood gotten away with an subsidiary acquisition in less than 12 months??? Nielsen has premeditated all kinds of violations per state and federally. Isn't Abuse of Power illegal? Dwight is a total LOSER and has dragged all his NYC buds into the deep pockets of Nielsen. I suspect Dwight will get his golden parachute this year along with all his friends. The stock has dropped significantly from mid-50's last year to $35.79 as of this posting. Mark my words..........Nielsen is dying under Dwights leadership. Dwight doesn't care about his employees or his clients. Clients aren't happy among everyone else associated with nielsen. I should've quit within months of my hire date but I kept trustin management for changes. \"trust us, they said........\" Snakes in the grass........and there's a lot of snakes in this organization.", "rating": 1, "pros": "insurance benefits, company car, work from home", "cons": "Everything. IF you're interested in the M.R. position, it is common knowledge that they terminate the reps annually. First round is August, sept/oct is pushed for improved numbers and their bonus, then back to hell as they seek to have everyone fired before christmas. All the reviews calling it a \"turn-stile\" is true 100%. They lie during the interview that you can make 8-10K monthly bonus. Complete BS. I exceeded my performance and the best I could net after texas was $960 bonus. Salary/hourly is about 32K annual. They put reps on a \"schedule for success\" which is the path to rapid termination in three weeks. They even fraudulently filed FMLA on me and I wasn't sick! I wasted 1.5 year giving them time to fix things. yeah right. The board of directors are worthless and Dwight Barns (CEO destroying Nielsen) has a relationship with James Atwood of the Carlyle Group in NYC. Atwood becomes the Chairman of the Board jan. 2016. By Jan. 2017 the carlyle group completes it's first acquisition of a Nielsen subsidiary announced in their press release. Carlyle has also been funding Nielsen since 2006? Why? Dwight sits on the board for Monsanto for employee compensation and corporate responsibility. Seriously? I sent Dwight emails begging for field help including a cease and desist. Why did i get fired...??? I exceeded expectations on performance and did it in less than 40 hrs in a week, saved the company money and gave them excellent work. I got fired for being efficient. A friend got written up for being 7 minutes shy of her 40 hours. PLEASE PLEASE PLEASE DO NOT WORK FOR Nielsen as long as Dwight is the CEO.", "advice": "I can't find a Nielsen family member which is probably why Nielsen is in such poor shape. Someone needs to buy this company, like google, and restructure it from top to bottom. Since everyone has \"common knowledge\" of their abuse of power, why are they allowed to get away with this toxic behavior???? GOOGLE......!!!!! PLEASE BUY NIELSEN AND CLEAN HOUSE!!!"}, {"title": "VP", "text": "Pros Variety of opportunities (jobs and locations) Cons Tough competitive environment and need to meet shareholder value requirements Advice to Management Nothing now", "rating": 5, "pros": "Variety of opportunities (jobs and locations)", "cons": "Tough competitive environment and need to meet shareholder value requirements", "advice": "Nothing now"}, {"title": "Internship", "text": "Pros Very friendly environment and people. Many opportunities to learn. Cons The salary is not as good as other leading consulting firm but the work load is heavy.", "rating": 5, "pros": "Very friendly environment and people. Many opportunities to learn.", "cons": "The salary is not as good as other leading consulting firm but the work load is heavy.", "advice": null}, {"title": "Big company perks with small business salaries", "text": "Pros Lots of activities for employees, corporate discounts, good amount of vacation time, cheap insurance with HSA account paid by Nielsen to cover deductibles, Tuition reimbursement. Cons Salary is the worst, severely underpay employees compared to industry standards. Advancement can be a challenge, majority of the time is not merit based, just depends on who you know.", "rating": 3, "pros": "Lots of activities for employees, corporate discounts, good amount of vacation time, cheap insurance with HSA account paid by Nielsen to cover deductibles, Tuition reimbursement.", "cons": "Salary is the worst, severely underpay employees compared to industry standards. Advancement can be a challenge, majority of the time is not merit based, just depends on who you know.", "advice": null}, {"title": "RI", "text": "Pros Good bonuses based on your performance Cons Training isn't thorough enough. After asking many different team leaders different concerns and them not knowing the answer I finally decided I can't work in a place where I can do a better job and I think the team leaders knew that so they never addressed my schedule change request to day time because I'm a single mother who wanted to work while her kid was at school or promotion because I was already mentoring people anyways. Then they claimed job abandonment because I couldn't obtain my schedule online or get ahold of anyone to give it to me. My only option was to go there with my son to log on to the computers there to check my schedule of course even if I could it was the holidays and I was out of town. Despite having my request of time of granted there was a few times it was withdrawn with just a 24 hour notice. Advice to Management I tried to give them my advice. My advice is to listen to what your RI's are requesting because they are the ones on the phone.", "rating": 1, "pros": "Good bonuses based on your performance", "cons": "Training isn't thorough enough. After asking many different team leaders different concerns and them not knowing the answer I finally decided I can't work in a place where I can do a better job and I think the team leaders knew that so they never addressed my schedule change request to day time because I'm a single mother who wanted to work while her kid was at school or promotion because I was already mentoring people anyways. Then they claimed job abandonment because I couldn't obtain my schedule online or get ahold of anyone to give it to me. My only option was to go there with my son to log on to the computers there to check my schedule of course even if I could it was the holidays and I was out of town. Despite having my request of time of granted there was a few times it was withdrawn with just a 24 hour notice.", "advice": "I tried to give them my advice. My advice is to listen to what your RI's are requesting because they are the ones on the phone."}, {"title": "Director", "text": "Pros great variety of business solutions Cons the business solution support is not sufficient Advice to Management make sure basics are covered", "rating": 3, "pros": "great variety of business solutions", "cons": "the business solution support is not sufficient", "advice": "make sure basics are covered"}, {"title": "Can Nielsen continue to maintain it's leadership position?", "text": "Pros Blue-chip company with a terrific history of measuring what consumers watch and buy. Good global presence with a great suite of research tools and products. Wonderful list of clients and tons of room for people to grow and move between roles. Lots of fun, super smart people who are great team players. Great opportunity for growth at junior to mid levels but be prepared to put in the hours. One of the few companies that offers top-performing junior to mid-level team members the opportunity to work overseas. Nielsen has grown by acquisition so there are always opportunities to learn about new solutions. Nielsen Cares. Cons Fragmentation of media and consumer channels (esp. ecommerce), the rise of online, overdependence on CPG clients in developed markets and a lack of historical investment have put Nielsen on the back foot. So many acquisitions can mean that client facing teams are not clear which product is appropriate for a specific client problem. Outdated and old technology is a big problem and senior leaders need to realize that the organizations core competence is not developing IT; it is setting up measurement systems. Outsource the IT piece so products and services are delivered accurately, and help make sure the \"new service\" is not outdated upon delivery or already behind the competition! Nielsen is doing all it can to make themselves relevant for the future - but is it too little too late? Some really strong senior performers have recently left for other organizations and that is a concern. Lots of budget cuts to fund the big IT investment have meant that resources continue to disappear. This means long hours, tight deadlines and overworked teams. Advice to Management 1. Global coverage is a huge strategic advantage - leverage it. Continue to invest in building global channel coverage (esp. in developing markets). 2. Don't neglect junior to mid-level employees. 3. Stop trying to be the technology development company and let a technology company help. 4. At the senior level there seems to be a lot of politics .... there are a couple of senior leaders that seem to have 9 lives - despite failure to deliver in prior roles. 5. Continue to give back to the communities - Nielsen Cares is great.", "rating": 3, "pros": "Blue-chip company with a terrific history of measuring what consumers watch and buy. Good global presence with a great suite of research tools and products. Wonderful list of clients and tons of room for people to grow and move between roles. Lots of fun, super smart people who are great team players. Great opportunity for growth at junior to mid levels but be prepared to put in the hours. One of the few companies that offers top-performing junior to mid-level team members the opportunity to work overseas. Nielsen has grown by acquisition so there are always opportunities to learn about new solutions. Nielsen Cares.", "cons": "Fragmentation of media and consumer channels (esp. ecommerce), the rise of online, overdependence on CPG clients in developed markets and a lack of historical investment have put Nielsen on the back foot.", "advice": "1. Global coverage is a huge strategic advantage - leverage it. Continue to invest in building global channel coverage (esp. in developing markets)."}, {"title": "Large But Weak Management", "text": "Pros Talented staff with volumes of consumer and industry data to make a difference. Cons Leadership is not transparent with their plans. Those over the age of 45 need not apply. Their new focus is on \"hunting for business\", not developing insights for their clients. Advice to Management Take competitive threats seriously, do not assume because staff have experience they are more expendable.", "rating": 3, "pros": "Talented staff with volumes of consumer and industry data to make a difference.", "cons": "Leadership is not transparent with their plans. Those over the age of 45 need not apply. Their new focus is on \"hunting for business\", not developing insights for their clients.", "advice": "Take competitive threats seriously, do not assume because staff have experience they are more expendable."}, {"title": "Membership Manager", "text": "Pros flexibility in the field recruitment Cons limited opportunities for growth outside of frontline Membership Division", "rating": 3, "pros": "flexibility in the field recruitment", "cons": "limited opportunities for growth outside of frontline Membership Division", "advice": null}, {"title": "Iconic Company in Transformation", "text": "Pros - Great and interesting businesses - Watch & Buy - Clear and smart growth strategies - Smart people - Principled approach to talent development - Global - Takes diversity and inclusion seriously - Lots of opportunities in new fields - data science, machine learning, etc. - Pays well Cons - Buy business challenged in near term - some layoffs Advice to Management Continue transformation to leading edge digitally driven data/analytics company", "rating": 5, "pros": "- Great and interesting businesses - Watch & Buy", "cons": "- Buy business challenged in near term - some layoffs", "advice": "Continue transformation to leading edge digitally driven data/analytics company"}, {"title": "Great organization for breadth of career opportunities available.", "text": "Pros Remote employment for last seven years. Cons Main office across the country and lends to employee disconnect on day to day operations. Advice to Management Transparency should be a focus going forward.", "rating": 5, "pros": "Remote employment for last seven years.", "cons": "Main office across the country and lends to employee disconnect on day to day operations.", "advice": "Transparency should be a focus going forward."}, {"title": "Progressive balanced company", "text": "Pros Values its employees, many opportunities to constantly learn Cons Large company and sometimes hard to keep track of people/departments when there are changes Advice to Management Great communication efforts are happening to unite the troops and message company priorities", "rating": 5, "pros": "Values its employees, many opportunities to constantly learn", "cons": "Large company and sometimes hard to keep track of people/departments when there are changes", "advice": "Great communication efforts are happening to unite the troops and message company priorities"}, {"title": "Member Representative", "text": "Pros progressive corporate culture and well established brand Cons unprofessional work environment, poor management at the local level, base pay and commissions insufficient Advice to Management Member Rep's don't have enough prospects to have any type of realistic chance of reaching big numbers in IP...therefore base pay is too low to retain top member reps.", "rating": 3, "pros": "progressive corporate culture and well established brand", "cons": "unprofessional work environment, poor management at the local level, base pay and commissions insufficient", "advice": "Member Rep's don't have enough prospects to have any type of realistic chance of reaching big numbers in IP...therefore base pay is too low to retain top member reps."}, {"title": "Market Manager", "text": "Pros Great Benefits and opportunities with the company. Cons Maintaining a work/life balance.", "rating": 5, "pros": "Great Benefits and opportunities with the company.", "cons": "Maintaining a work/life balance.", "advice": null}, {"title": "World Class Company", "text": "Pros Great job experience working with top level clients and employees Cons Off-shoring a lot of the work Advice to Management Keep jobs in the USA", "rating": 5, "pros": "Great job experience working with top level clients and employees", "cons": "Off-shoring a lot of the work", "advice": "Keep jobs in the USA"}, {"title": "Good experience", "text": "Pros Helpful supervisors, challenging work Cons No advancement opportunities for interns", "rating": 5, "pros": "Helpful supervisors, challenging work", "cons": "No advancement opportunities for interns", "advice": null}, {"title": "Support Associate", "text": "Pros They are very organized as a company Cons They are way too analytical", "rating": 5, "pros": "They are very organized as a company", "cons": "They are way too analytical", "advice": null}, {"title": "Fantastic company to start a career with!", "text": "Pros Leadership invests in your development, when you deliver results Fun, friendly, sociable, smart people Cons Difficult to keep track of all the moving parts of the business", "rating": 5, "pros": "Leadership invests in your development, when you deliver results", "cons": "Difficult to keep track of all the moving parts of the business", "advice": null}, {"title": "Great Work/Life Balance and Flexibility", "text": "Pros The company provides the opportunity to work from home or remotely and has just introduced \"My Time\" which allows for flexible vacation days. Cons There are times when project deadlines are approaching that there is a heavy work load that can get up around 60-70 hours a week.", "rating": 5, "pros": "The company provides the opportunity to work from home or remotely and has just introduced \"My Time\" which allows for flexible vacation days.", "cons": "There are times when project deadlines are approaching that there is a heavy work load that can get up around 60-70 hours a week.", "advice": null}, {"title": "What have you done for me lately....", "text": "Pros Scale, breadth of resources, ability to invest, overall peer group. Cons Nielsen is good to you until they are not. There is no in between. Too silo'd and enacting change takes significant time, effort and work.... Advice to Management Change the way you measure the market.", "rating": 3, "pros": "Scale, breadth of resources, ability to invest, overall peer group.", "cons": "Nielsen is good to you until they are not. There is no in between. Too silo'd and enacting change takes significant time, effort and work....", "advice": "Change the way you measure the market."}, {"title": "Downward Trend", "text": "Pros It truly was a great place to start out - grow and get great experience. Some great and brilliant minds to learn from. You can wear jeans : / Cons First and foremost, they are NOTORIOUS for paying WELL under market value. I'm convinced the only way they make any money is not spending it/nickle and diming everywhere they can- while upper management spends 10k for executive flights to India at the drop of a hat. Its a running joke on the inside that the only way to get what your worth is to leave Nielsen - then come back. The stock absolutely tanked last year - and you know what that means. No yearly pay raises. Constant and never ending reorgs (this was even before the crash). The \"every 9 month reorgs\" is an indictment on management that they have never found a winning formula that lets people get settled and establish a foundation in what they are doing. Once you hit a middle management level the political game gets crazy. Beyond that - they have a program called \"emerging leaders\" in which they groom kids straight out of college - and 2 years later - create and insert them into middle management jobs . Good for them -- but REAL bad for people who have been putting in years of work to try and get these positions -- pretty raw deal--- and it occurs EVERY SIX MONTHS! Dozens of new 20-somethings right into middle management. Right now - I'm taking ques from the top -- a few months ago after a MASSIVE round of layoffs the CTO and Global OPs leader quit out of nowhere --- so they know something....cant be good. We spent an entire year converting to AGILE methodology b/c this is the way the world is heading - and they just completely dismantled it with the latest reorg --- back to waterfall. They have a TERRIBLE identity crisis in which they would NEVER call themselves a tech company - in which case they might have to actually dedicate resources towards.....well.....resources. People quit all the time and the answer is always \"we can absorb this\" and spread those responsibilities to other people to take on (of course WITHOUT compensating) rather than backfill the position. They do not value employees at ALL and have let some truly brilliant and one of a kind people just leave without any attempts at retention. Advice to Management Try showing that you appreciate and value your employees rather than give hollow messages at townhalls about how \"great we are\". Dont let people walk away so easy. Invest in your people - then THEY will invest in you, the company and the clients. Its that simple. Happy hours every 4 months dont count.", "rating": 3, "pros": "It truly was a great place to start out - grow and get great experience. Some great and brilliant minds to learn from.", "cons": "First and foremost, they are NOTORIOUS for paying WELL under market value. I'm convinced the only way they make any money is not spending it/nickle and diming everywhere they can- while upper management spends 10k for executive flights to India at the drop of a hat. Its a running joke on the inside that the only way to get what your worth is to leave Nielsen - then come back.", "advice": "Try showing that you appreciate and value your employees rather than give hollow messages at townhalls about how \"great we are\". Dont let people walk away so easy. Invest in your people - then THEY will invest in you, the company and the clients. Its that simple. Happy hours every 4 months dont count."}, {"title": "Research Interviewer", "text": "Pros amazing pay, great company, easy job Cons stay to yourself and do your job, and everything else will work itself out Advice to Management be more helpful to the employees.", "rating": 3, "pros": "amazing pay, great company, easy job", "cons": "stay to yourself and do your job, and everything else will work itself out", "advice": "be more helpful to the employees."}, {"title": "Great people!", "text": "Pros Company events were always something to look forward to. Cons I really can't think of one", "rating": 5, "pros": "Company events were always something to look forward to.", "cons": "I really can't think of one", "advice": null}, {"title": "Field Rep", "text": "Pros Good job, good money, company car, cellphone. Cons Work a lot of hours, some Saturdays; difficult to have a social life. Advice to Management There are only 24 hours in a day; we are humane and some tines we need to rest.", "rating": 5, "pros": "Good job, good money, company car, cellphone.", "cons": "Work a lot of hours, some Saturdays; difficult to have a social life.", "advice": "There are only 24 hours in a day; we are humane and some tines we need to rest."}, {"title": "Administrative Assistant", "text": "Pros Great people, culture and environment Cons Don't have anything bad to say.", "rating": 5, "pros": "Great people, culture and environment", "cons": "Don't have anything bad to say.", "advice": null}, {"title": "Senior data specialist", "text": "Pros data driven, get full experience Cons database is private, can't get much experience on data coding skills", "rating": 5, "pros": "data driven, get full experience", "cons": "database is private, can't get much experience on data coding skills", "advice": null}, {"title": "Account Executive", "text": "Pros Private/Work balance is good compared to other jobs. Cons Continously changing management causes for distance between daily business. Advice to Management Not to change so often.", "rating": 3, "pros": "Private/Work balance is good compared to other jobs.", "cons": "Continously changing management causes for distance between daily business.", "advice": "Not to change so often."}, {"title": "Analyst", "text": "Pros Challenging, good people, interesting work Cons Work/life balance and HR could use improvement", "rating": 5, "pros": "Challenging, good people, interesting work", "cons": "Work/life balance and HR could use improvement", "advice": null}, {"title": "Great Company and Great Leadership", "text": "Pros Great leadership development for interns. Cons Too many people work remote which slows down progress.", "rating": 5, "pros": "Great leadership development for interns.", "cons": "Too many people work remote which slows down progress.", "advice": null}, {"title": "Not what they claim to be.", "text": "Pros Company car. Short and long term projects. Cons With all the news about sexual harassment and other violations, I'm surprised this company hasn't been investigated for violating some or all of the complaint reports from past and present employees. I worked here for over 12 years and the last 5 years with the company I was harassed, discriminated against and bullied. The company is good in encouraging their employees to report any such violations but when you finally break down and report anything, they just retaliate against you and force you out for making such claims. There were some instances where my work was sabotaged by a co-worker to make me look incompetent and writing reports which were not true or accurate, never taking into consideration what I had to say, proof or otherwise show to management that there were violations been made on my behalf which were totally false. Not only the employee made my life a living hell in CT but when I transfer to NJ, this employee came after me 7 months after I moved to again harass me and writing false reports on dates that I was not even working for that market anymore. Lost of sexual harassment towards women as well but I can say for sure what happened to those women. Somehow, anybody that makes a claim is set for failure and is pushed out of the company. Again, this is what I experienced with Nielsen and not necessarily that of other past or present employees. I hope this gets posted and not deleted. Somebody needs to make those violators responsible for their actions and not reward them like they did with the co-worker that relentlessly made my last 5 years in Nielsen a living hell. Advice to Management Listen to the little people.", "rating": 1, "pros": "Company car. Short and long term projects.", "cons": "With all the news about sexual harassment and other violations, I'm surprised this company hasn't been investigated for violating some or all of the complaint reports from past and present employees. I worked here for over 12 years and the last 5 years with the company I was harassed, discriminated against and bullied. The company is good in encouraging their employees to report any such violations but when you finally break down and report anything, they just retaliate against you and force you out for making such claims. There were some instances where my work was sabotaged by a co-worker to make me look incompetent and writing reports which were not true or accurate, never taking into consideration what I had to say, proof or otherwise show to management that there were violations been made on my behalf which were totally false. Not only the employee made my life a living hell in CT but when I transfer to NJ, this employee came after me 7 months after I moved to again harass me and writing false reports on dates that I was not even working for that market anymore. Lost of sexual harassment towards women as well but I can say for sure what happened to those women. Somehow, anybody that makes a claim is set for failure and is pushed out of the company. Again, this is what I experienced with Nielsen and not necessarily that of other past or present employees. I hope this gets posted and not deleted. Somebody needs to make those violators responsible for their actions and not reward them like they did with the co-worker that relentlessly made my last 5 years in Nielsen a living hell.", "advice": "Listen to the little people."}, {"title": "Manager", "text": "Pros Forward thinking company. Multifaceted solutions. Cons Hard to move across different functions.", "rating": 5, "pros": "Forward thinking company. Multifaceted solutions.", "cons": "Hard to move across different functions.", "advice": null}, {"title": "Low pay good leaders", "text": "Pros Leadership respects intelligence and cares about the employees. Easy job even with all the unnecessary task. Decent amount of time off. Cons Low pay with a culture that requires a lot of baby sitting. The people hired don’t seem to want to really work which is unfortunate because it’s a simple job. Advice to Management Pay your leadership more.", "rating": 3, "pros": "Leadership respects intelligence and cares about the employees. Easy job even with all the unnecessary task. Decent amount of time off.", "cons": "Low pay with a culture that requires a lot of baby sitting. The people hired don’t seem to want to really work which is unfortunate because it’s a simple job.", "advice": "Pay your leadership more."}, {"title": "Nielsen Marketing Rep", "text": "Pros People I worked with were great ! Awesome benefits ! Cons Low pay even with the car . Drove 750-1000 miles a week . Impossible to hit numbers in this market . Bad technical service Advice to Management Increase base and more support", "rating": 3, "pros": "People I worked with were great ! Awesome benefits !", "cons": "Low pay even with the car . Drove 750-1000 miles a week . Impossible to hit numbers in this market . Bad technical service", "advice": "Increase base and more support"}, {"title": "Great work environment", "text": "Pros Great working environment, supportive managers, friendly co-workers Cons Do not find any at this point", "rating": 5, "pros": "Great working environment, supportive managers, friendly co-workers", "cons": "Do not find any at this point", "advice": null}, {"title": "Associate Client Manager", "text": "Pros Can work from home one day a week. Great work/life balance. Cons Clients can be demanding, company is sometimes behind in technology.", "rating": 5, "pros": "Can work from home one day a week. Great work/life balance.", "cons": "Clients can be demanding, company is sometimes behind in technology.", "advice": null}, {"title": "Marketing Effectiveness", "text": "Pros Lots of opportunity to gain experience in MMM Project Management, Modeling and Delivery. Some really smart folks within the group. Cons Long hours, little recognition and similar narrative to all of the other similar reviews. Too many squeaky wheels within the group, who tend to get the most attention (staffing, resources, projects, recognition) and this is something that is passed on to their direct reports, results are beyond nauseating.", "rating": 3, "pros": "Lots of opportunity to gain experience in MMM Project Management, Modeling and Delivery. Some really smart folks within the group.", "cons": "Long hours, little recognition and similar narrative to all of the other similar reviews. Too many squeaky wheels within the group, who tend to get the most attention (staffing, resources, projects, recognition) and this is something that is passed on to their direct reports, results are beyond nauseating.", "advice": null}, {"title": "Whatever it takes", "text": "Pros It pays the bills. Its a good filler for your resume. Cons No raises. There is a struggle with getting the tenured employees on board with the new policies. There is no accountability. No moral compass. Advice to Management Make accountability one of the corporate values.", "rating": 3, "pros": "It pays the bills. Its a good filler for your resume.", "cons": "No raises. There is a struggle with getting the tenured employees on board with the new policies. There is no accountability. No moral compass.", "advice": "Make accountability one of the corporate values."}, {"title": "OK place to work", "text": "Pros Good benefits - healthcare, 401(k), vacation Cons Fragmented business units (from acquisitions)", "rating": 3, "pros": "Good benefits - healthcare, 401(k), vacation", "cons": "Fragmented business units (from acquisitions)", "advice": null}, {"title": "SVP Data Science", "text": "Pros Great people. Wonderful Data. Exciting and interesting projects. Cons Nielsen makes some totally illogical decisions at a high level that are detrimental to their business Advice to Management Look at the number of decisions the business has made that in retrospect hurt the business. Don't try to solve those problems with illogical actions in the opposite direction, just plan more carefully and don't make those mistakes in the future.", "rating": 5, "pros": "Great people. Wonderful Data. Exciting and interesting projects.", "cons": "Nielsen makes some totally illogical decisions at a high level that are detrimental to their business", "advice": "Look at the number of decisions the business has made that in retrospect hurt the business. Don't try to solve those problems with illogical actions in the opposite direction, just plan more carefully and don't make those mistakes in the future."}, {"title": "Great culture, work-life balance, and interesting work!", "text": "Pros The culture is great - collaborate, team-oriented, young, and relaxed. The work-life balance is awesome - unlimited vacation, ability to work-from-home, reasonable hours The work is interesting Cons Salary - but the benefits make up for it Advice to Management n/a", "rating": 5, "pros": "The culture is great - collaborate, team-oriented, young, and relaxed.", "cons": "Salary - but the benefits make up for it", "advice": "n/a"}, {"title": "Senior Analyst", "text": "Pros The people are wonderful and depending on the team, it can be great. It's very open and accepting. Cons Just seems like every year things get chipped away at from the benefits perspective. They try to make it up in other ways but gets a tad frustrating", "rating": 5, "pros": "The people are wonderful and depending on the team, it can be great. It's very open and accepting.", "cons": "Just seems like every year things get chipped away at from the benefits perspective. They try to make it up in other ways but gets a tad frustrating", "advice": null}, {"title": "Sample specialist", "text": "Pros Different every day. Always learning something new Cons work/life benefit is troubled. A lot of projects are quick turn", "rating": 5, "pros": "Different every day. Always learning something new", "cons": "work/life benefit is troubled. A lot of projects are quick turn", "advice": null}, {"title": "Associate Client Manager", "text": "Pros Flexibility, independence, opportunity to work with some very smart/talented people. Cons There was a lot of turn-over on the account I was on. This did provide the opportunity for promotion but also understaffed and overworked at times.", "rating": 5, "pros": "Flexibility, independence, opportunity to work with some very smart/talented people.", "cons": "There was a lot of turn-over on the account I was on. This did provide the opportunity for promotion but also understaffed and overworked at times.", "advice": null}, {"title": "review", "text": "Pros global company, many branches in the world Cons Low pay rate, pressure from clients Advice to Management I don't have anything to say", "rating": 3, "pros": "global company, many branches in the world", "cons": "Low pay rate, pressure from clients", "advice": "I don't have anything to say"}, {"title": "Panel Relation Specialist", "text": "Pros Great benefits, excellent environment to grow in and an open and honest culture from within. Cons Job may get a bit monotonous at times.", "rating": 5, "pros": "Great benefits, excellent environment to grow in and an open and honest culture from within.", "cons": "Job may get a bit monotonous at times.", "advice": null}, {"title": "Great Place to grow", "text": "Pros Unlimited opportunities to move up within the company Cons Sometimes so big you can get lost", "rating": 5, "pros": "Unlimited opportunities to move up within the company", "cons": "Sometimes so big you can get lost", "advice": null}, {"title": "Good place to start", "text": "Pros Many young professionals starting out with plenty of areas of of the business to explore Cons Many fall into repetitious job functions", "rating": 3, "pros": "Many young professionals starting out with plenty of areas of of the business to explore", "cons": "Many fall into repetitious job functions", "advice": null}, {"title": "Operations and Technology Leadership Program Intern", "text": "Pros - High paying internship - Great culture - Company invest in your growth I've enjoyed my 10 weeks of internship. They put you through training and give you all the resources you need to thrive. Cons - Highly competitive - Managers can be very critical of your performance", "rating": 5, "pros": "- High paying internship", "cons": "- Highly competitive", "advice": null}, {"title": "Super flexible company, but slow moving", "text": "Pros Unlimited vacation, flexible hours, great work environment, fun coworkers Cons Moves slowly, bureaucratic, underpaid", "rating": 5, "pros": "Unlimited vacation, flexible hours, great work environment, fun coworkers", "cons": "Moves slowly, bureaucratic, underpaid", "advice": null}, {"title": "Research interviewer", "text": "Pros Meet nice people and sometimes snacks at breaks Cons 15 minute break in 6 hours Advice to Management No advice", "rating": 3, "pros": "Meet nice people and sometimes snacks at breaks", "cons": "15 minute break in 6 hours", "advice": "No advice"}, {"title": "Not what it used to be", "text": "Pros - a good place to grow if you are noticed - free breakfast + snacks - tech hub is cool - some smart folks Cons - disorganized direction for future - bleeding talent Advice to Management You seem confused on how to adjust to the shifts in the future of addressable advertising and disruptions of traditional retail. With lower margins for clients, it seems the solution is to add additional consultants to contracts rather than investing in your technologies to automate work.", "rating": 3, "pros": "- a good place to grow if you are noticed", "cons": "- disorganized direction for future", "advice": "You seem confused on how to adjust to the shifts in the future of addressable advertising and disruptions of traditional retail. With lower margins for clients, it seems the solution is to add additional consultants to contracts rather than investing in your technologies to automate work."}, {"title": "Great work/life balance", "text": "Pros Ability to work from home and anywhere remotely. Cons Some roles being sent offshore. Advice to Management Take another look at the pay structures.", "rating": 5, "pros": "Ability to work from home and anywhere remotely.", "cons": "Some roles being sent offshore.", "advice": "Take another look at the pay structures."}, {"title": "Research Interviewer", "text": "Pros the team leaders were caring and didn't mind giving each and every employee that one on one interaction when they needed the extra help Cons to me there was never a downside to working with this great company", "rating": 5, "pros": "the team leaders were caring and didn't mind giving each and every employee that one on one interaction when they needed the extra help", "cons": "to me there was never a downside to working with this great company", "advice": null}, {"title": "Outside Sales Representative", "text": "Pros Get a company Car, You get benefits on day one, You will have a great name on your Resume Cons knock door to door, The technology malfunctions weekly, there is very slim chance to advance your career unless you are willing to move. It is very hard to earn bonuses. They dont develop you and they only care when you are producing. You will have to work nights and weekends. Advice to Management na", "rating": 3, "pros": "Get a company Car, You get benefits on day one, You will have a great name on your Resume", "cons": "knock door to door, The technology malfunctions weekly, there is very slim chance to advance your career unless you are willing to move. It is very hard to earn bonuses. They dont develop you and they only care when you are producing. You will have to work nights and weekends.", "advice": "na"}, {"title": "Company review", "text": "Pros nice location/facilities, work form home Cons frequent reorganizations and employee layoffs", "rating": 5, "pros": "nice location/facilities, work form home", "cons": "frequent reorganizations and employee layoffs", "advice": null}, {"title": "Lots of opportunities but a lot to 'put up with' in return", "text": "Pros - Flexible work environment - Investment in training and staff development - Focus on culture, diversity and inclusion - Amazing suite of products to answer clients business challenges - Opportunities to work in other areas of the business including overseas Cons - Size of company and silo'd teams makes it difficult to get things done - Slow to adapt to change - Lack of agility/limited ability to respond to business or market opportunities quickly - Roles and responsibilities of leadership can be unclear leading to mistrust - Lack of transparency around decision making (linked to unclear responsibilities of leadership) that impacts buy in from the wider team - Struggles to successfully integrate new cultures which undermines the aggressive acquisition approach - Arrogance around the 'Nielsen culture' that can be alienating to both team members and clients Advice to Management Look to actively remove barriers that prevent client facing team members from delivering. Be open to different ways of doing business - make diversity in management styles and approaches a reality.", "rating": 3, "pros": "- Flexible work environment", "cons": "- Size of company and silo'd teams makes it difficult to get things done", "advice": "Look to actively remove barriers that prevent client facing team members from delivering. Be open to different ways of doing business - make diversity in management styles and approaches a reality."}, {"title": "VP Retail Professional Services", "text": "Pros Great array of watch and buy services Cons Challenged in bringing together the various services", "rating": 3, "pros": "Great array of watch and buy services", "cons": "Challenged in bringing together the various services", "advice": null}, {"title": "Research interviewer", "text": "Pros Flexible, will work with you Cons Hours are not always guaranteed", "rating": 3, "pros": "Flexible, will work with you", "cons": "Hours are not always guaranteed", "advice": null}, {"title": "I love my job more than pretty much everyone else I know", "text": "Pros Nielsen is extremely flexible. When my husband moved to rural Pennsylvania - an area with few opportunities for a market researcher - Nielsen volunteered to fly me to my client every other week, allowing me to continue working with my team. Another woman had a baby and needed to work part time. Nielsen made it happen. I have also met some of my best friends at the company, including my husband. The team environment is truly fantastic. Also... we have so much data! So fun! Cons It can be difficult to manage work life balance in the divisions that rely on ad hoc revenue, though this is certainly not the case everywhere. In my current role - in a division where the revenue is contracted - I regularly work forty hours a week. Advice to Management Keep up the great work. Love the direction.", "rating": 5, "pros": "Nielsen is extremely flexible. When my husband moved to rural Pennsylvania - an area with few opportunities for a market researcher - Nielsen volunteered to fly me to my client every other week, allowing me to continue working with my team. Another woman had a baby and needed to work part time. Nielsen made it happen.", "cons": "It can be difficult to manage work life balance in the divisions that rely on ad hoc revenue, though this is certainly not the case everywhere. In my current role - in a division where the revenue is contracted - I regularly work forty hours a week.", "advice": "Keep up the great work. Love the direction."}, {"title": "Membership Representative", "text": "Pros Flexible schedule. Home Office. Great place to work Cons You need good time management skills", "rating": 5, "pros": "Flexible schedule. Home Office. Great place to work", "cons": "You need good time management skills", "advice": null}, {"title": "Emphasis on employee engagement", "text": "Pros Large emphasis on employee well-being and engagement through several programs and benefits Cons Can be difficult for the 'average employee' to get noticed. This can be seen as a benefit to employees that go above and beyond", "rating": 5, "pros": "Large emphasis on employee well-being and engagement through several programs and benefits", "cons": "Can be difficult for the 'average employee' to get noticed. This can be seen as a benefit to employees that go above and beyond", "advice": null}, {"title": "Bilingual Panel Specialist", "text": "Pros Ability to work from home and great training if you work in office, good benefits and good time off with sick days Cons Low pay, office in Arlington is far, you start with night shifts, they micro manage your every call and time. Advice to Management They do layoff almost every year..and call you back every time. 1 year later with less pay.", "rating": 3, "pros": "Ability to work from home and great training if you work in office, good benefits and good time off with sick days", "cons": "Low pay, office in Arlington is far, you start with night shifts, they micro manage your every call and time.", "advice": "They do layoff almost every year..and call you back every time. 1 year later with less pay."}, {"title": "Associate client director", "text": "Pros values diverse working environment in all roles Cons forcus on day to day", "rating": 5, "pros": "values diverse working environment in all roles", "cons": "forcus on day to day", "advice": null}, {"title": "Research Interviewer", "text": "Pros great incentive program and part time Cons limited day time shifts available", "rating": 5, "pros": "great incentive program and part time", "cons": "limited day time shifts available", "advice": null}, {"title": "Great people! Great work dynamic!", "text": "Pros Great people, great work dynamic and a lot of learning. Cons Overwork. Lack of creativity. Advice to Management Be more flexible and honest.", "rating": 5, "pros": "Great people, great work dynamic and a lot of learning.", "cons": "Overwork. Lack of creativity.", "advice": "Be more flexible and honest."}, {"title": "Client Manager", "text": "Pros Good Values, Flexibility, and good leadership Cons Slow moving advancement, compensation", "rating": 5, "pros": "Good Values, Flexibility, and good leadership", "cons": "Slow moving advancement, compensation", "advice": null}, {"title": "Research Interviewer", "text": "Pros Starting pay is decent Cons Bonuses are good maybe just twice a year. Unprofessional. Cut your hours by a whole lot when business is slow", "rating": 3, "pros": "Starting pay is decent", "cons": "Bonuses are good maybe just twice a year. Unprofessional. Cut your hours by a whole lot when business is slow", "advice": null}, {"title": "Good and Bad Everywhere", "text": "Pros Unbelievable work/life balance, working remotely as needed or wanted, unlimited vacation policy, little to no micro-management, opportunities for lateral movement and learning, interesting/engaging work Cons Leadership lacks or is unable to communicate strategy, technology is not keeping pace with the market, poor/slow product development and product marketing, not structured or managed as a sales organization, lack of excitement around sales and growth Advice to Management Solicit feedback from people who interact with clients and listen to what they say about what the market wants and how to improve", "rating": 5, "pros": "Unbelievable work/life balance, working remotely as needed or wanted, unlimited vacation policy, little to no micro-management, opportunities for lateral movement and learning, interesting/engaging work", "cons": "Leadership lacks or is unable to communicate strategy, technology is not keeping pace with the market, poor/slow product development and product marketing, not structured or managed as a sales organization, lack of excitement around sales and growth", "advice": "Solicit feedback from people who interact with clients and listen to what they say about what the market wants and how to improve"}, {"title": "Anonymous", "text": "Pros Intelligent co-workers, work-life balance, NY office location was nice Cons Outdated hardware, pay is a bit lower than industry standard Advice to Management Consider investing in the office space and equipment", "rating": 5, "pros": "Intelligent co-workers, work-life balance, NY office location was nice", "cons": "Outdated hardware, pay is a bit lower than industry standard", "advice": "Consider investing in the office space and equipment"}, {"title": "Working for Nielsen", "text": "Pros Very well run company, good room to move up in the company Cons Some of the shifts are not at normal hours", "rating": 5, "pros": "Very well run company, good room to move up in the company", "cons": "Some of the shifts are not at normal hours", "advice": null}, {"title": "Manager", "text": "Pros GREAT culture and values. Strong ERGs and emphasis on philanthropy (Nielsen Cares). Strong early career programs. Getting better on emphasizing internal moves. Cons Doesn't pay as well as other companies. External hires or boomerang employees can make a higher salary than people who grow from within.", "rating": 5, "pros": "GREAT culture and values. Strong ERGs and emphasis on philanthropy (Nielsen Cares). Strong early career programs. Getting better on emphasizing internal moves.", "cons": "Doesn't pay as well as other companies. External hires or boomerang employees can make a higher salary than people who grow from within.", "advice": null}, {"title": "Sales Trainer", "text": "Pros Travel 50% of the time you are a road warrior Good base no incentives , good 401k, medical, dental. Cons Last minute travels, not allowed to take three weeks of vacation. Maximum two weeks, micromanage every day, reports, their security will investigate you to make sure there is no relationship to the media", "rating": 3, "pros": "Travel 50% of the time you are a road warrior", "cons": "Last minute travels, not allowed to take three weeks of vacation. Maximum two weeks, micromanage every day, reports, their security will investigate you to make sure there is no relationship to the media", "advice": null}, {"title": "Best Employer In The World!", "text": "Pros Wonderful company, great people. Great benefits. You get what you put in to this! Cons I could work every day of the week if I was allowed... unable to do so because I live in CA. Advice to Management Listen to your reps. We are out in the field and see a lot of what is going on.", "rating": 5, "pros": "Wonderful company, great people. Great benefits. You get what you put in to this!", "cons": "I could work every day of the week if I was allowed... unable to do so because I live in CA.", "advice": "Listen to your reps. We are out in the field and see a lot of what is going on."}, {"title": "Flexible, great pay for area", "text": "Pros Flexibility, pay, co-worker relationships, and ability to work from home Cons Uncertainty of being positions being offshored", "rating": 5, "pros": "Flexibility, pay, co-worker relationships, and ability to work from home", "cons": "Uncertainty of being positions being offshored", "advice": null}, {"title": "Mobile Data Test Driver", "text": "Pros Great Organization, diversity and family oriented. Offers endless opportunities to learn, grow and promoted within. They have one of the best communication process allowing ideas to flow between field employees and top executives. Definitely, a really good Companie to work for. Cons I could not think of any. Advice to Management You have a really great system in place. There is always to improve it. With your diverse workforce, it will be easy to keep striving in the right direction.", "rating": 5, "pros": "Great Organization, diversity and family oriented. Offers endless opportunities to learn, grow and promoted within. They have one of the best communication process allowing ideas to flow between field employees and top executives.", "cons": "I could not think of any.", "advice": "You have a really great system in place."}, {"title": "Senior Analyst", "text": "Pros Relaxed office culture, work from home Cons Narrowed job function and limited pay Advice to Management Invest in top talent", "rating": 3, "pros": "Relaxed office culture, work from home", "cons": "Narrowed job function and limited pay", "advice": "Invest in top talent"}, {"title": "Associate Client Director", "text": "Pros Solid company, sharp senior management Cons Not as limber as it needs to be", "rating": 5, "pros": "Solid company, sharp senior management", "cons": "Not as limber as it needs to be", "advice": null}, {"title": "Make Nielsen Great Again....", "text": "Pros Depending on the area, most people work from home. This can be a con if you are new to the company and want to build relationships with co-workers. Great place to START your career and gain valuable experience and knowledge. Take this experience and go somewhere that will value you. Cons I have seen many changes over my three decades working for Nielsen. The last ten years have been a revolving door with layoffs every 6 mos. Nielsen does not value it's employees only the bottom line. They use to care what employee thought. The company used to have annual reviews of themselves where every employee is encouraged to participate in review the company and department they contribute to. This allowed the company to look at areas for improvement. This is no longer a priority. They are trying to be a technology company and failing miserably as they don't have a clue. Do not build something expecting clients to buy into it, There is no integrity as they will promise the client things they know they cannot deliver. Advice to Management Need to find a good leader with some insights on how to get the company back to the great company of the past.", "rating": 1, "pros": "Depending on the area, most people work from home. This can be a con if you are new to the company and want to build relationships with co-workers.", "cons": "I have seen many changes over my three decades working for Nielsen. The last ten years have been a revolving door with layoffs every 6 mos. Nielsen does not value it's employees only the bottom line. They use to care what employee thought. The company used to have annual reviews of themselves where every employee is encouraged to participate in review the company and department they contribute to. This allowed the company to look at areas for improvement. This is no longer a priority.", "advice": "Need to find a good leader with some insights on how to get the company back to the great company of the past."}, {"title": "Great company, training ground for CPG", "text": "Pros Great training opportunities especially for young hires straight out of undergrad, competitive pay and benefits, great work life balance and opportunities to work remotely Cons Company is very siloed so hard to provide all the value that clients are looking for, and hard to find certain things given the separate systems Advice to Management Continue to integrate the businesses so Nielsen shows up as one company to clients", "rating": 5, "pros": "Great training opportunities especially for young hires straight out of undergrad, competitive pay and benefits, great work life balance and opportunities to work remotely", "cons": "Company is very siloed so hard to provide all the value that clients are looking for, and hard to find certain things given the separate systems", "advice": "Continue to integrate the businesses so Nielsen shows up as one company to clients"}, {"title": "Vice President", "text": "Pros Community focused company that is committed to CPG industry Cons Management is largely complacent and un-empowered. The organization is desperately lacking leadership. Advice to Management Try to help remove obstacles for your employees. Take ownership of your group and be more committed to quality than sticking to a 9-5 work day.", "rating": 1, "pros": "Community focused company that is committed to CPG industry", "cons": "Management is largely complacent and un-empowered. The organization is desperately lacking leadership.", "advice": "Try to help remove obstacles for your employees. Take ownership of your group and be more committed to quality than sticking to a 9-5 work day."}, {"title": "Data Scientist", "text": "Pros Good Training and good balance Cons Bad compensation and less vacation time", "rating": 5, "pros": "Good Training and good balance", "cons": "Bad compensation and less vacation time", "advice": null}, {"title": "Data Scientist", "text": "Pros Good work-life balance, good work from homes hours, lenient on vacation. Cons Low pay, not the best 401k match, company not giving out raises this year.", "rating": 3, "pros": "Good work-life balance, good work from homes hours, lenient on vacation.", "cons": "Low pay, not the best 401k match, company not giving out raises this year.", "advice": null}, {"title": "child care review", "text": "Pros Aspires to establish a partnership with families to support their children's development and to be a model in early childhood education. Cons the staff are professional, the hours are long the pay is competitive and the children and families are phenominal", "rating": 5, "pros": "Aspires to establish a partnership with families to support their children's development and to be a model in early childhood education.", "cons": "the staff are professional, the hours are long the pay is competitive and the children and families are phenominal", "advice": null}, {"title": "Good company Great people", "text": "Pros Fast-paced, new technology, smart people, diversity, volunteer opportunities, flex-time per area/merit Cons Morale varies based on area, sometimes too much change, can be hard to navigate growth, not a lot of remote opportunities, pay increases spread out +18 mos. Advice to Management Keep striving for growth but not at the expense of the loyal current work force. Bring back annual pay increases and bonuses. Keep up with the cost of living increases.", "rating": 5, "pros": "Fast-paced, new technology, smart people, diversity, volunteer opportunities, flex-time per area/merit", "cons": "Morale varies based on area, sometimes too much change, can be hard to navigate growth, not a lot of remote opportunities, pay increases spread out +18 mos.", "advice": "Keep striving for growth but not at the expense of the loyal current work force. Bring back annual pay increases and bonuses. Keep up with the cost of living increases."}, {"title": "Great company to start your career", "text": "Pros Great place to start out as you'll be exposed to a plethora of information Casual office and great flexibility in terms of hours and ability to work remotely Cons Company is going through a bit of a rough patch, which I think can be felt throughout the company. Company at times can be too big, which results in us being slow to react Can get political/bureaucratic trying to work across teams", "rating": 5, "pros": "Great place to start out as you'll be exposed to a plethora of information", "cons": "Company is going through a bit of a rough patch, which I think can be felt throughout the company.", "advice": null}, {"title": "Overall positive", "text": "Pros Colleagues are smart, and willing to help. Great opportunities to work with global clients. Culture overall is positive. Cons Company is complex, and siloed. Advice to Management listen to employees at all levels to understand really what is going on in the company.", "rating": 5, "pros": "Colleagues are smart, and willing to help. Great opportunities to work with global clients. Culture overall is positive.", "cons": "Company is complex, and siloed.", "advice": "listen to employees at all levels to understand really what is going on in the company."}, {"title": "Data Scientist", "text": "Pros Good manager, good work/life balance, interesting projects Cons working in the suburbs, salary", "rating": 5, "pros": "Good manager, good work/life balance, interesting projects", "cons": "working in the suburbs, salary", "advice": null}, {"title": "Fun and flexible", "text": "Pros Flexible schedule. Salary plus overtime. Cons Some assigned territory requires a lot of travel", "rating": 5, "pros": "Flexible schedule. Salary plus overtime.", "cons": "Some assigned territory requires a lot of travel", "advice": null}, {"title": "Intern", "text": "Pros Flexible hours, Casual Dress, Remote work Cons sometimes long hours, not always easy to advance Advice to Management N/A", "rating": 5, "pros": "Flexible hours, Casual Dress, Remote work", "cons": "sometimes long hours, not always easy to advance", "advice": "N/A"}, {"title": "Can't Evolve with The Times", "text": "Pros Great work culture - flexibility to work from home when you want, lots of fun young people Strong emphasis on data quality and precision Cons - Most tech and tools used are from the STONE AGE - it makes it hard to focus on doing your job when 70% of your time has to be dedicated to the minutiae of processes that should have been automated by now - Managers have a \"don't ask don't want to know\" policy - in many cases they are aware that employees are unhappy and they are not proactive about solving pain points and nipping in the bud, instead they ignore the issue until it gets to a much more serious point than it should Advice to Management REALLY listen to employees' concerns and suggestions - there are definitely a few consistent themes across all issues employees have, and it's pointless to have countless town halls and an \"open door policy\" if no real change ever comes about Also, know that from the amount of work you expect from people, Nielsen employees are severely underpaid - this + leaving many simple issues unsolved is what drives so many people to leave", "rating": 3, "pros": "Great work culture - flexibility to work from home when you want, lots of fun young people", "cons": "- Most tech and tools used are from the STONE AGE - it makes it hard to focus on doing your job when 70% of your time has to be dedicated to the minutiae of processes that should have been automated by now", "advice": "REALLY listen to employees' concerns and suggestions - there are definitely a few consistent themes across all issues employees have, and it's pointless to have countless town halls and an \"open door policy\" if no real change ever comes about"}, {"title": "number not a person", "text": "Pros Close to home the commute was easy. Cons I didn't feel necessary to the company. Advice to Management better millennial recruiting and structure.", "rating": 3, "pros": "Close to home the commute was easy.", "cons": "I didn't feel necessary to the company.", "advice": "better millennial recruiting and structure."}, {"title": "Great place to work (depending on manager & team)", "text": "Pros Opportunities for advancement/growth Flexible hours & work/life balance Cons Teams & management are inconsistent (some are great, others are \"meh\".) The higher your salary, the more you're a target for the next RIF Bottom line is more important than quality of work", "rating": 5, "pros": "Opportunities for advancement/growth", "cons": "Teams & management are inconsistent (some are great, others are \"meh\".)", "advice": null}, {"title": "Membership Rep", "text": "Pros Company car, laptop, and phone. Cons unrealistic goals, and the company make poor choices. CEO is garbage. Advice to Management meh", "rating": 3, "pros": "Company car, laptop, and phone.", "cons": "unrealistic goals, and the company make poor choices. CEO is garbage.", "advice": "meh"}, {"title": "Membership Representative", "text": "Pros Flexible, Interesting, Compliant, Recognition to Employees, Cons Red Tape, Not loyal to employees Advice to Management Reward tenured employees and adjust pay to keep up with inflation.", "rating": 5, "pros": "Flexible, Interesting, Compliant, Recognition to Employees,", "cons": "Red Tape, Not loyal to employees", "advice": "Reward tenured employees and adjust pay to keep up with inflation."}, {"title": "Agent", "text": "Pros Good stable company , great supervisor and team Cons Big company easy forgotten , been here over 7yrs only got 56 cent raise total Advice to Management Such a big company upper managment just trying to make it thru the day it feels like. Been here lots of years managers have litterly asked who I am", "rating": 3, "pros": "Good stable company , great supervisor and team", "cons": "Big company easy forgotten , been here over 7yrs only got 56 cent raise total", "advice": "Such a big company upper managment just trying to make it thru the day it feels like. Been here lots of years managers have litterly asked who I am"}, {"title": "Lucky to have found this job years ago", "text": "Pros Great pay, challenging yet rewarding work, team atmosphere, bonus isn't always guaranteed but can be lucrative, company car, laptop, phone, etc, never a dull day. Lots of peers that are willing to help someone new learn the role and help them along the way. Working well with each other is highly promoted in our group. Give this company a second look. Cons Can be long hours, have to want to work outside of regular business hours, many great people on the team and it is hard to promote them all. Each person on the team needs to pull their weight or the rest of the team can suffer because it makes it tough for market to hit its targets. Advice to Management Keep up the good work and thanks for keeping us heading in the right direction", "rating": 5, "pros": "Great pay, challenging yet rewarding work, team atmosphere, bonus isn't always guaranteed but can be lucrative, company car, laptop, phone, etc, never a dull day. Lots of peers that are willing to help someone new learn the role and help them along the way. Working well with each other is highly promoted in our group. Give this company a second look.", "cons": "Can be long hours, have to want to work outside of regular business hours, many great people on the team and it is hard to promote them all. Each person on the team needs to pull their weight or the rest of the team can suffer because it makes it tough for market to hit its targets.", "advice": "Keep up the good work and thanks for keeping us heading in the right direction"}, {"title": "2", "text": "Pros good compay to work for Cons limited mobility and growth is limited Advice to Management 2", "rating": 5, "pros": "good compay to work for", "cons": "limited mobility and growth is limited", "advice": "2"}, {"title": "Marketing Effectiveness Analyst", "text": "Pros The company has a great culture and my position is a great mix of analytics and consulting with clients. Cons Budget is always tight, so this makes getting a promotion unlikely. Also, late nights are required periodically", "rating": 5, "pros": "The company has a great culture and my position is a great mix of analytics and consulting with clients.", "cons": "Budget is always tight, so this makes getting a promotion unlikely. Also, late nights are required periodically", "advice": null}, {"title": "Long term employee", "text": "Pros The people are fantastic, I worked with some great people Cons Money driven, there are regular layoffs each year. Advice to Management You say 'People are our greatest asset' - Treat them like it.", "rating": 3, "pros": "The people are fantastic, I worked with some great people", "cons": "Money driven, there are regular layoffs each year.", "advice": "You say 'People are our greatest asset' - Treat them like it."}, {"title": "Steer clear", "text": "Pros Flexible schedule and Company car Cons Micro managed No support No one cares about you Advice to Management Validate your employees", "rating": 3, "pros": "Flexible schedule and", "cons": "Micro managed", "advice": "Validate your employees"}, {"title": "Panel Relation Specialist", "text": "Pros Good atmosphere and casual environment. Cons Too much favoritism among employees.", "rating": 1, "pros": "Good atmosphere and casual environment.", "cons": "Too much favoritism among employees.", "advice": null}, {"title": "Good foundation, but company is sinking", "text": "Pros Solid first job to have Cons Nielsen is very large and segregated by department, so employees love to send millions of emails in order to get anything done. The company seems to be in a perpetual hiring freeze.", "rating": 3, "pros": "Solid first job to have", "cons": "Nielsen is very large and segregated by department, so employees love to send millions of emails in order to get anything done. The company seems to be in a perpetual hiring freeze.", "advice": null}, {"title": "Pricing and Promotion analyst", "text": "Pros great learning and intelligent people Cons hard to move up, hard to convince", "rating": 3, "pros": "great learning and intelligent people", "cons": "hard to move up, hard to convince", "advice": null}, {"title": "It is what it is", "text": "Pros Caring staff, Nice pay, extensive training Cons Boring, repetitive, constantly changing practices Advice to Management Get everyone on the same page. Loosen up a little. Smile more.", "rating": 3, "pros": "Caring staff, Nice pay, extensive training", "cons": "Boring, repetitive, constantly changing practices", "advice": "Get everyone on the same page. Loosen up a little. Smile more."}, {"title": "Telemarketing outcalls", "text": "Pros Great schedule, team leads and pay Cons It gets boring, sometimes rude people hangup on you and use faul langua Advice to Management Keep up the great job and don't be pushy or rude on new employees", "rating": 5, "pros": "Great schedule, team leads and pay", "cons": "It gets boring, sometimes rude people hangup on you and use faul langua", "advice": "Keep up the great job and don't be pushy or rude on new employees"}, {"title": "research interviewer", "text": "Pros flexible good pay management work with you towards your goal Cons repetitive late night shifts", "rating": 5, "pros": "flexible", "cons": "repetitive", "advice": null}, {"title": "VP Finance", "text": "Pros Nielsen provided me with many growth opportunities during my 20 years at the company. The company is in the midst of fast change and new challenges. Cons As with any company the differences in managers and how they support their staff differs. With so much change in technology and approach focus needs to be on making sure the staff is aware, knowledgeable and comfortable with the new technology as it launches. Advice to Management Remember that your staff with experience has been with you through the good and bad and this experience is invaluable during this time of change.", "rating": 3, "pros": "Nielsen provided me with many growth opportunities during my 20 years at the company. The company is in the midst of fast change and new challenges.", "cons": "As with any company the differences in managers and how they support their staff differs. With so much change in technology and approach focus needs to be on making sure the staff is aware, knowledgeable and comfortable with the new technology as it launches.", "advice": "Remember that your staff with experience has been with you through the good and bad and this experience is invaluable during this time of change."}, {"title": "Membership Representative", "text": "Pros Flexible work schedule, company car, company iPhone Cons High pressure sales, you have to take hits on things that are out of your control, a lot of rules to screw you over.", "rating": 3, "pros": "Flexible work schedule, company car, company iPhone", "cons": "High pressure sales, you have to take hits on things that are out of your control, a lot of rules to screw you over.", "advice": null}, {"title": "Retail client management", "text": "Pros A check every two weeks. Mediocre health benefits. Cons A narcissist safe haven. Lazy, incompetent Bullies in management that are fully protected & supported by HR. DO NOT WORK HERE! Extremely toxic company. Advice to Management Nielsen will be obselete soon enough. The data is dirty and technology is old and stale.", "rating": 1, "pros": "A check every two weeks. Mediocre health benefits.", "cons": "A narcissist safe haven. Lazy, incompetent Bullies in management that are fully protected & supported by HR. DO NOT WORK HERE! Extremely toxic company.", "advice": "Nielsen will be obselete soon enough. The data is dirty and technology is old and stale."}, {"title": "Excellent place to work", "text": "Pros Diverse and inclusive environment, provides talent development and growth opportunities. Cons There are no cons to report. Advice to Management Keep up the good work.", "rating": 5, "pros": "Diverse and inclusive environment, provides talent development and growth opportunities.", "cons": "There are no cons to report.", "advice": "Keep up the good work."}, {"title": "Don't Let Them in Your Home", "text": "Pros Great opportunities, decent benefits, company car, independent work environment. Cons Seriously lacking morals. Classic corporate culture with bloated antiquated structure that is likely to fail in these fast evolving times. The company protects abusive managers and employees to its own detriment. Lie to participants and take horrible advantage of the American people. Advice to Management Lead by example, never micro-manage, discriminate, or allow other to lose respect for you.", "rating": 3, "pros": "Great opportunities, decent benefits, company car, independent work environment.", "cons": "Seriously lacking morals. Classic corporate culture with bloated antiquated structure that is likely to fail in these fast evolving times. The company protects abusive managers and employees to its own detriment. Lie to participants and take horrible advantage of the American people.", "advice": "Lead by example, never micro-manage, discriminate, or allow other to lose respect for you."}, {"title": "Membership Representative", "text": "Pros Fun and diverse working environment, meeting new people every day. Cons It can be stressful and long working hours.", "rating": 3, "pros": "Fun and diverse working environment, meeting new people every day.", "cons": "It can be stressful and long working hours.", "advice": null}, {"title": "Associate Manager - Innovation", "text": "Pros flexible schedule. Smart co-workers. Pockets of good culture. Incredible work ethics and excellent products. Cons Lack of transparency and communication. Required to be \"on\" all the time...little room for mistakes. Cultural discouragement of constructive criticism of superiors or strategy. Advice to Management Allow for emotional responses to change. Recognize the humanity of people instead of only the productivity.", "rating": 3, "pros": "flexible schedule. Smart co-workers. Pockets of good culture. Incredible work ethics and excellent products.", "cons": "Lack of transparency and communication. Required to be \"on\" all the time...little room for mistakes. Cultural discouragement of constructive criticism of superiors or strategy.", "advice": "Allow for emotional responses to change. Recognize the humanity of people instead of only the productivity."}, {"title": "Cheap company with poor leadership", "text": "Pros Lots of down time as long as you aren't part of consulting services work from home flexibility Cons Compensation below market Benefits below market Advice to Management Fire more middle managers", "rating": 3, "pros": "Lots of down time as long as you aren't part of consulting services", "cons": "Compensation below market", "advice": "Fire more middle managers"}, {"title": "Vice President", "text": "Pros Good culture, good opportunities. I love the people I get to work it. Cons Public company...managed to quarterly results.", "rating": 5, "pros": "Good culture, good opportunities. I love the people I get to work it.", "cons": "Public company...managed to quarterly results.", "advice": null}, {"title": "Full time", "text": "Pros Nielsen is an excellent company. Cons It is great to work here.", "rating": 3, "pros": "Nielsen is an excellent company.", "cons": "It is great to work here.", "advice": null}, {"title": "Lack of connection between C-Level and employees", "text": "Pros - Great work/life balance - Good culture in pockets of the company - Talented people Cons - Short-term decisions being made that could impact long-term growth of company (off-shoring engineering roles) - Too many products and Sales Teams are spread too thin - Not a clear strategy from top down", "rating": 3, "pros": "- Great work/life balance", "cons": "- Short-term decisions being made that could impact long-term growth of company (off-shoring engineering roles)", "advice": null}, {"title": "Manager Innovation", "text": "Pros A lot of flexibility when it comes to free time and working from home. The company is making huge efforts to improve the working conditions and benefits Cons Extremely long workings hours (In average 60 hours a week). There's constant change and reestructuring to cut cost, so employees are doing twice the work for the same salary.", "rating": 3, "pros": "A lot of flexibility when it comes to free time and working from home. The company is making huge efforts to improve the working conditions and benefits", "cons": "Extremely long workings hours (In average 60 hours a week). There's constant change and reestructuring to cut cost, so employees are doing twice the work for the same salary.", "advice": null}, {"title": "Thumbs down", "text": "Pros Teaches you what you don' t want to do in life. Cons Not caring about their staff. Can't make up their mind about the organizational structure. Outsourcing jobs and firing staff in the states. Advice to Management N/A", "rating": 1, "pros": "Teaches you what you don' t want to do in life.", "cons": "Not caring about their staff. Can't make up their mind about the organizational structure. Outsourcing jobs and firing staff in the states.", "advice": "N/A"}, {"title": "Modern Enterprise Stuck in the 50s", "text": "Pros Global company who wants to be open and integrated, and in many ways succeed in providing enriching opportunities for career growth and learning. Cons Political and male dominated factions create a fraternity of who's who. For a modern company there were times it felt like parts of the company were working in 1950. Advice to Management Look up, look around, be honest and always tell your CEO if things aren't going well.", "rating": 3, "pros": "Global company who wants to be open and integrated, and in many ways succeed in providing enriching opportunities for career growth and learning.", "cons": "Political and male dominated factions create a fraternity of who's who. For a modern company there were times it felt like parts of the company were working in 1950.", "advice": "Look up, look around, be honest and always tell your CEO if things aren't going well."}, {"title": "Software Develeper", "text": "Pros Relaxed work environment. Flexible schedule. Could work remotely at times. Cons - Leadership. I saw 3 Re-Orgs within 18 months. Each time yielding a new manager who a) was not accustomed to the team project and b) by the time they were, another swap would be made and someone new came in. Very unorganized at best. - TCS handles 90%+ so don't think you won't get replaced by someone who isn't qualified to save some money. - Balance. I would work averages of 60 hours a week. Advice to Management Fix the internal management issues.", "rating": 3, "pros": "Relaxed work environment. Flexible schedule. Could work remotely at times.", "cons": "- Leadership. I saw 3 Re-Orgs within 18 months. Each time yielding a new manager who a) was not accustomed to the team project and b) by the time they were, another swap would be made and someone new came in. Very unorganized at best.", "advice": "Fix the internal management issues."}, {"title": "Manager, Product Development", "text": "Pros Some great managers, but those are getting harder to find. Cons Poor benefits and salary not competitive in area. Senior management not very open to feedback on how to improve and can't seem to find an org structure that will stick. Constant re-orgs and team shuffles amidst a lack of communication on direction of company created a confusing work environment. Financial situation when I left looked bleak with more cuts most likely on the horizon. Management often played favorites, and had little transperancy into merit increases and bonus payments. Culture is toxic with management expecting 50+ hour weeks and to be on call for senior leaders 24/7. When staff leaves no replacements are sought and workload increased. Little opportunity to advance once you hit middle management or rotate to a new team. Not a great place to work. Advice to Management Management who has been there 20+ years is reluctant to change old habits. Bring in fresh management who are open to change.", "rating": 3, "pros": "Some great managers, but those are getting harder to find.", "cons": "Poor benefits and salary not competitive in area. Senior management not very open to feedback on how to improve and can't seem to find an org structure that will stick. Constant re-orgs and team shuffles amidst a lack of communication on direction of company created a confusing work environment. Financial situation when I left looked bleak with more cuts most likely on the horizon. Management often played favorites, and had little transperancy into merit increases and bonus payments. Culture is toxic with management expecting 50+ hour weeks and to be on call for senior leaders 24/7. When staff leaves no replacements are sought and workload increased. Little opportunity to advance once you hit middle management or rotate to a new team. Not a great place to work.", "advice": "Management who has been there 20+ years is reluctant to change old habits. Bring in fresh management who are open to change."}, {"title": "Great", "text": "Pros Easy job, nice people on phones. Cons None so far like it there.", "rating": 5, "pros": "Easy job, nice people on phones.", "cons": "None so far like it there.", "advice": null}, {"title": "Incredible Flexibility--Connections Help A Lot!", "text": "Pros Incredibly flexible working schedules Nice people Several locations Cons Some top-down things aren't entirely thought through Too much governance Advice to Management Allow for groups to experiment and grow instead of prescribing what is thought to be the best way of doing something.", "rating": 5, "pros": "Incredibly flexible working schedules", "cons": "Some top-down things aren't entirely thought through", "advice": "Allow for groups to experiment and grow instead of prescribing what is thought to be the best way of doing something."}, {"title": "A formerly great company searching for its future", "text": "Pros - Great place to learn if out of college  - Supportive and smart coworkers  - Incredibly flexible attitude towards working remotely, etc. Cons - Layoffs  - Subject matter expertise is not valued  - Claimed to be \"meritocracy\" but have seen no such evidence of this  - Stock price dropped $12/share in 12 months due to missteps by Mitch Barns. Advice to Management Don't lay off the more experienced and more dedicated employees in an organization. The short term labor savings is more harmful long term.", "rating": 5, "pros": "- Great place to learn if out of college", "cons": "- Layoffs", "advice": "Don't lay off the more experienced and more dedicated employees in an organization. The short term labor savings is more harmful long term."}, {"title": "lead", "text": "Pros flexible hours great workplace friendly Cons late shifts need longer breaks", "rating": 5, "pros": "flexible hours great workplace friendly", "cons": "late shifts need longer breaks", "advice": null}, {"title": "Great Company", "text": "Pros Great flexibility with schedule, promotion from within. Cons Work/life balance as they keep piling on the work", "rating": 3, "pros": "Great flexibility with schedule, promotion from within.", "cons": "Work/life balance as they keep piling on the work", "advice": null}, {"title": "Terrible experience", "text": "Pros free snacks, drinks, new office, Cons I worked at Nielsen Marketing Cloud in 2016. If I can give it 0 star I would. To summarize, my time there was confusing and abused. These are a few of the major reasons I felt this way: 1. The entire time I was there, I felt my role was a complete redundancy and it made me question why they hired me in the first place. When I finally made a minor breakthrough in an assignment and was going to move onto a bigger piece, I received a linkedin recruiting message that used exact same words I used for my project. I was horrified receiving that because I felt unsafe. Not many people knew what I was working on at that point and for those that did I wouldn't have enough power to fight back. After that, I soon lost the tiny amount of support I received for the project - anyway it was already a conflict with another team from parent company. 2. I was interviewed for a senior role but upon receiving the offer it was the same role but minus \"senior\". My manager never talked to me about team visions and goals of my responsibilities. A month and 18 days after I was hired, our team had a first ever formal team meeting and I found I was the only one (of 7) that had no assignment from the priority list. When I questioned why I was put off the priority list, my manager said (these were the original words) “you can’t just work on something you like (referring to the project in conflict with parent company)”. But I was assigned to that work! 3. Situation became progressively worse towards end of October and early November. I felt being monitored. I started to receive company emails that had \"integrity issues\" in the titles whenever I met with a coworker in private or took a personal short break during the day. I also found my intranet connection to parent company (Nielsen) was disabled and IT failed to fix it for me. 4. I was of the same ethnical group with another employee in our team. I felt being put into an unseen competition with that person the entire time. But I didn’t have the advantage. I was brand new to the company to the industry but the other person was with the startup (later acquired by Nielsen) for 5 years. As a result, my existence in any project became sensitive and coworkers including senior ranks started to avoid me. Because of this I couldn’t learn properly the data and analytics system which was fatal to my work. 5. During the time I was at the company we moved to a newly renovated building. I, along with one other coworker, was seated right in front of two glass door conference rooms with real low cubicle walls. So as along as I sat in front of my computer and looked up I could see everything going on in those conference rooms and even their projected computer screens. This made me terribly uncomfortable combined with those “integrity issues” emails because it made me think I was the target. 6. I had some idea for the product work I was working on at that time and after discussing with senior ranks it seemed to be leading somewhere. But I received very negative and open reaction from the person mentioned in point 4 and quickly lost all the support. It got so bad the last week I was with the company that I didn’t feel safe to communicate with anyone through any channels. coworkers, especially those from my team, were avoiding me or avoiding to discuss work topics with me. I felt being framed to appear as an incompetent person while the reality was I was in an unfamiliar environment not being given guidance and learning opportunities. 7. There were many other things which I couldn’t even finish counting. Based on my experience, I highly suggest anyone to look away from this company and work elsewhere to save yourself, your family and your life. Advice to Management rethink your product offering, be more responsible for the role you are given, be nicer and more genuine", "rating": 1, "pros": "free snacks, drinks, new office,", "cons": "I worked at Nielsen Marketing Cloud in 2016. If I can give it 0 star I would. To summarize, my time there was confusing and abused. These are a few of the major reasons I felt this way:", "advice": "rethink your product offering, be more responsible for the role you are given, be nicer and more genuine"}, {"title": "They don't care about their call center employees", "text": "Pros Nothing about this company is good Cons Horrible working conditions, lack of empathy and compassion for the ones who bring in the money. Advice to Management CARE ABOUT THE PEOPLE WHO LOOK FOR YOUR MONEY!", "rating": 1, "pros": "Nothing about this company is good", "cons": "Horrible working conditions, lack of empathy and compassion for the ones who bring in the money.", "advice": "CARE ABOUT THE PEOPLE WHO LOOK FOR YOUR MONEY!"}, {"title": "Cleaning house and losing knowledge", "text": "Pros The collaboration between teams is good. Flexible work schedules for some teams. Benefits are good. Cons Those who want to do the right thing are usually punished Fascinated by new technology & pushes out without a thorough plan which leads to chaos and poor planning Scheduled reduction in force - every 3-6 months (though always treated as a surprise) Messages to senior managers are filtered and do not represent what is happening within the teams. Advice to Management Rethink the core values - because they are not followed.", "rating": 3, "pros": "The collaboration between teams is good.", "cons": "Those who want to do the right thing are usually punished", "advice": "Rethink the core values - because they are not followed."}, {"title": "Analyst", "text": "Pros - Great people - Opportunities to transfer to other areas of the business Cons - Few promotions - Long hours and weekend work expected of you", "rating": 3, "pros": "- Great people", "cons": "- Few promotions", "advice": null}, {"title": "Training opportunities needed", "text": "Pros Advancement opportunities were available. Cons Not a lot of effort put into personal development. I was there for over 20 years and went on 2 training classes and that was because they were mandatory for a new position. Other than that they are not good at keeping employees up to date with training to current standards. Advice to Management Keep the people in training to maintain the top talent.", "rating": 3, "pros": "Advancement opportunities were available.", "cons": "Not a lot of effort put into personal development. I was there for over 20 years and went on 2 training classes and that was because they were mandatory for a new position. Other than that they are not good at keeping employees up to date with training to current standards.", "advice": "Keep the people in training to maintain the top talent."}, {"title": "Great company in tough environment", "text": "Pros Flexible work-life balance. Opportunity to move up, particularly if you can blend tech and business skills. Long-term strategy is solid. Cons It's a tough business climate right now. Nielsen clients (esp on Buy side) are facing a lot of competitive pressure which translates over. Advice to Management We have to move faster on new tech. There doesn't have to be a trade off between data quality and speed, but we may have to go back to the drawing board to step-change our efficiency.", "rating": 5, "pros": "Flexible work-life balance. Opportunity to move up, particularly if you can blend tech and business skills. Long-term strategy is solid.", "cons": "It's a tough business climate right now. Nielsen clients (esp on Buy side) are facing a lot of competitive pressure which translates over.", "advice": "We have to move faster on new tech. There doesn't have to be a trade off between data quality and speed, but we may have to go back to the drawing board to step-change our efficiency."}, {"title": "Field Representative", "text": "Pros self managed, large company, Cons large company, just a number", "rating": 3, "pros": "self managed, large company,", "cons": "large company, just a number", "advice": null}, {"title": "Director in Consulting Organization", "text": "Pros Great environment to learn. Had opportunities to take risks. Cons Tracking data remains most important business and it is under attack. Startups that tout new software in addition to consulting threaten the consulting business. Consulting businesses remain \"fiefdoms\" with different objectives that seem to delay integration that clients desperately want. Frequent reorganizations and strategy changes. Did not receive a performance review for three years. Most people managers are more individual contributors than team leaders.", "rating": 3, "pros": "Great environment to learn. Had opportunities to take risks.", "cons": "Tracking data remains most important business and it is under attack. Startups that tout new software in addition to consulting threaten the consulting business. Consulting businesses remain \"fiefdoms\" with different objectives that seem to delay integration that clients desperately want. Frequent reorganizations and strategy changes. Did not receive a performance review for three years. Most people managers are more individual contributors than team leaders.", "advice": null}, {"title": "Not too bad...", "text": "Pros Power of a huge name gets you in the door. investing in product and on the digital/mobile side of things Cons can be like working for the government...left hand doesn't know what the right hand is doing. Don't pay sales commissions...it's a bonus structure. Advice to Management Tell the left hand what the right hand is doing...before they do it!", "rating": 3, "pros": "Power of a huge name gets you in the door. investing in product and on the digital/mobile side of things", "cons": "can be like working for the government...left hand doesn't know what the right hand is doing. Don't pay sales commissions...it's a bonus structure.", "advice": "Tell the left hand what the right hand is doing...before they do it!"}, {"title": "Flexible Work Hours", "text": "Pros Super Flexible work hours Cons Large company, so it is difficult to effect change.", "rating": 5, "pros": "Super Flexible work hours", "cons": "Large company, so it is difficult to effect change.", "advice": null}, {"title": "Not for everybody", "text": "Pros As a Nielsen Recruiter, you get to work outside and have a flexible schedule. If you love \"playing the corporate game\" you will love it here. Cons Rigid, inflexible management style. Very corporate. If you love \"playing the corporate game\" (which I don't) you will love it here. Advice to Management I was laid off for a supposed infraction where I misclassified a home. You didn't actually investigate. You just called the homeowner and accepted whatever they said, even though the information they gave you was untrue.", "rating": 3, "pros": "As a Nielsen Recruiter, you get to work outside and have a flexible schedule. If you love \"playing the corporate game\" you will love it here.", "cons": "Rigid, inflexible management style. Very corporate. If you love \"playing the corporate game\" (which I don't) you will love it here.", "advice": "I was laid off for a supposed infraction where I misclassified a home. You didn't actually investigate. You just called the homeowner and accepted whatever they said, even though the information they gave you was untrue."}, {"title": "Not what it supposedly once was", "text": "Pros Ability to work remote - you basically reap the benefits of your client. Just changed to unlimited vacation (con: this probably was to save money by not having to pay out vacation time when people leave since they never paid sick time) Cons Culture is now \"culture of cost cutting\". Understaffed to the point where it will start to show with clients. Layoffs still happening and there is no internal talent that can be shuffled around. Don't see myself having a pay raise anytime soon and with the company missing numbers, not expecting much of anything really. We sell in projects but then there are not enough people to complete them. I left my last job because of this type of mentality, it is not sitting well. Currently working through a VERY disorganized restructuring of the company as well as changing all of our internal management platforms. Needless to say, there is total lack of transparency, and I honestly don't have a very good outlook. You have to reach out to senior leadership for updates on what is going on rather than them reaching out to you. No one checks in on you, general feeling of a lack of empathy/compassion for employees. Because most people are remote or on-site, there is no sense of community/culture with Nielsen. You feel more aligned with your clients. I can't speak for others but certainly feel alone with no resources for help. Advice to Management Care about the people. Clients are noticing the dysfunction, only a matter of time where our issues start spilling over to the clients. It shouldn't be this way, not entirely sure if consultants are to blame but seems to be the trend in companies to basically kill culture and positive feelings for a company by completely turning things on its head. If you make your people happy, give them tools to learn and succeed (this is a complete miss) clients will reap the benefits.", "rating": 3, "pros": "Ability to work remote - you basically reap the benefits of your client. Just changed to unlimited vacation (con: this probably was to save money by not having to pay out vacation time when people leave since they never paid sick time)", "cons": "Culture is now \"culture of cost cutting\".", "advice": "Care about the people. Clients are noticing the dysfunction, only a matter of time where our issues start spilling over to the clients. It shouldn't be this way, not entirely sure if consultants are to blame but seems to be the trend in companies to basically kill culture and positive feelings for a company by completely turning things on its head."}, {"title": "Membership Representative", "text": "Pros The training is good. The staff is positive and you have lots of support. You are given a car, and they pay the gas and the maintenance. Also a phone and a computer. You make your own hours. Great job if you don't have a home life. Cons Getting people to understand the value of their input, all the while asking them for personal information and invasive technology in their house. The computer and software constants are unacceptable and time consuming for a company that is basically suppose to be measuring with TECHNOLOGY what consumers doing Even the old pros here have a hard time with the constant changes they give their departments and or functions. No consistency. The pay stinks, even with the car they gave you it doesn't come close to the overload you have to do to close a home. You may be awesome but if your manager is no good, his or her ineptness is going to cut into your ability to make money. Often you succeed in doing your job and things totally out of your control make it that the home is not closed. Depending on the market you're in it's even harder because the payout to to the homes is dismal. The turn over in this particular job is OFF THE CHARTS. Nielsen get a clue! Nielsen doesn't do enough to make themselves known so that when you come to a home more than 50% of the time they have no idea who Nielsen is which is remarkable given they are the industry standard for tv ratings! They are not keeping up with the curve of people now streaming so much and abandoning local tv, and cable. Advice to Management Increase the base pay.", "rating": 3, "pros": "The training is good.", "cons": "Getting people to understand the value of their input, all the while asking them for personal information and invasive technology in their house.", "advice": "Increase the base pay."}, {"title": "Nielsen Review", "text": "Pros Great learning experience. Panel data knowledge helpful in future employment opportunities Cons Limited career path. Technology not as strong as competition", "rating": 5, "pros": "Great learning experience. Panel data knowledge helpful in future employment opportunities", "cons": "Limited career path. Technology not as strong as competition", "advice": null}, {"title": "Great Culture and Work/Life Balance", "text": "Pros Great company culture and work/life balance. Good people. Cons Lots of moving parts can get overwhelming", "rating": 5, "pros": "Great company culture and work/life balance. Good people.", "cons": "Lots of moving parts can get overwhelming", "advice": null}]