[{"title": "Cool Company, Great Team", "text": "Pros Customer focussed. Open to exploring and using new technologies and tools. Helping team. Cons Not very process oriented. but trying to get there. Not very great in bonuses and pay since its relatively small company, but lot to learn from here Advice to Management Great going.", "rating": 5, "pros": "Customer focussed. Open to exploring and using new technologies and tools. Helping team.", "cons": "Not very process oriented. but trying to get there. Not very great in bonuses and pay since its relatively small company, but lot to learn from here", "advice": "Great going."}, {"title": "A place that helps one learn and push boundaries", "text": "Pros The company has a fantastic ethos around helping customers not only when they need a loan but also when they face financial strains. Oakam not only looks after its customers but also its staff and regular team meetings, communications and positive energy all round not only keeps the staff informed but also motivated to go the extra mile Cons Tight regulations makes one to be on their toes Advice to Management Keep up the good work in keeping staff motivated as motivated and happier staff leads to better and fulfilling results", "rating": 5, "pros": "The company has a fantastic ethos around helping customers not only when they need a loan but also when they face financial strains. Oakam not only looks after its customers but also its staff and regular team meetings, communications and positive energy all round not only keeps the staff informed but also motivated to go the extra mile", "cons": "Tight regulations makes one to be on their toes", "advice": "Keep up the good work in keeping staff motivated as motivated and happier staff leads to better and fulfilling results"}, {"title": "Great learning opportunity", "text": "Pros Having worked at large banks and companies I had certain doubts about working for a smaller financial firm. However, after careful thought and consideration, something that attracted me was to work for a fintech company. I don’t regret this decision. It’s been an incredible journey by having the opportunity to learn about different aspects of the business by being involved in several projects and understanding more about the interactions between teams in the achievement of a common goal. * Constantly working on improving results in a challenging environment. * One of the best learning experiences I’ve ever had. Senior management knowledge and experience is best in class. * Despite being a smaller financial firm, growth opportunities exist. Cons Strategies change quite often and are not monitored accordingly.", "rating": 5, "pros": "Having worked at large banks and companies I had certain doubts about working for a smaller financial firm. However, after careful thought and consideration, something that attracted me was to work for a fintech company. I don’t regret this decision.", "cons": "Strategies change quite often and are not monitored accordingly.", "advice": null}, {"title": "Heavy investment in innovation and machine learning", "text": "Pros I am constantly encouraged to test innovative solutions and think out of the box, with a continuous exchange of ideas and business insights with other teams. The CEO is very keen on machine learning and the whole company is investing heavily in automation, gamification and digitizing the business Cons No particular issues so far.", "rating": 5, "pros": "I am constantly encouraged to test innovative solutions and think out of the box, with a continuous exchange of ideas and business insights with other teams. The CEO is very keen on machine learning and the whole company is investing heavily in automation, gamification and digitizing the business", "cons": "No particular issues so far.", "advice": null}, {"title": "My first good job in Uk", "text": "Pros This company gave me opportunity to improve my knowledge and my English also always care about their employees. Cons I do not have any Cons.", "rating": 5, "pros": "This company gave me opportunity to improve my knowledge and my English also always care about their employees.", "cons": "I do not have any Cons.", "advice": null}, {"title": "Store Manager", "text": "Pros Great company to work for, good incentive, good career Prospect, everybody very nice to work with, one of the best company i have worked for so far , and i have worked for over 10 Company which many are hard to say anything good about Cons Cant say anything bad about the company", "rating": 5, "pros": "Great company to work for, good incentive, good career Prospect, everybody very nice to work with, one of the best company i have worked for so far , and i have worked for over 10 Company which many are hard to say anything good about", "cons": "Cant say anything bad about the company", "advice": null}, {"title": "Good place to work", "text": "Pros Good place to start your career. Easy to grow up in this company if you show interest in your job. Friendly enviroment, nice teams in every department. You never get board of your job because every day is different and exsiting. Cons Sometimes it is too many changes at once and no clear guidance. Advice to Management Keep your employees happy", "rating": 5, "pros": "Good place to start your career. Easy to grow up in this company if you show interest in your job. Friendly enviroment, nice teams in every department. You never get board of your job because every day is different and exsiting.", "cons": "Sometimes it is too many changes at once and no clear guidance.", "advice": "Keep your employees happy"}, {"title": "Good Company !!!", "text": "Pros Excellent benefits package on top of basic salary, good incentive schemes that reward you for going above and beyond. Open environment where you feel comfortable approaching managers, committed to training and opportunities. Great people to work with - this is a huge plus for me. Leadership increasingly more open with communications. Cons Need to be proactive to expand your career and role, but good opportunities available if you seek them. Advice to Management Identify a vision and stick to the plan to achieve said vision rather than changing strategies and u-turning on already running initiatives and reducing wasted effort.", "rating": 5, "pros": "Excellent benefits package on top of basic salary, good incentive schemes that reward you for going above and beyond. Open environment where you feel comfortable approaching managers, committed to training and opportunities. Great people to work with - this is a huge plus for me. Leadership increasingly more open with communications.", "cons": "Need to be proactive to expand your career and role, but good opportunities available if you seek them.", "advice": "Identify a vision and stick to the plan to achieve said vision rather than changing strategies and u-turning on already running initiatives and reducing wasted effort."}, {"title": "Opportunities are endless", "text": "Pros A forward-thinking company with the customer at it's core. The environment is fast-paced and exciting. No two days are the same and the management and teams go out of their way to do right by the customer. Progression is quick to all those who are up for the challenge of helping to shape the future of this business. Cons In the industry, Oakam sometimes mistakenly gets categorized with pay-day lenders. This is not what we do - the business is focused solely on providing access of affordable credit for the financially excluded. Advice to Management Keep attracting talent to the organisation - we have some wonderful people on the team already which makes Oakam what it is", "rating": 5, "pros": "A forward-thinking company with the customer at it's core. The environment is fast-paced and exciting. No two days are the same and the management and teams go out of their way to do right by the customer. Progression is quick to all those who are up for the challenge of helping to shape the future of this business.", "cons": "In the industry, Oakam sometimes mistakenly gets categorized with pay-day lenders. This is not what we do - the business is focused solely on providing access of affordable credit for the financially excluded.", "advice": "Keep attracting talent to the organisation - we have some wonderful people on the team already which makes Oakam what it is"}, {"title": "Oakam = Opportunities !!", "text": "Pros Very friendly and environment in which you can feel comfortable to work in. Company and employees are multicultural - which is good for customers and employees also. We can grow to be a family in which is what make a happy team! You get given the opportunity to go higher as long as your willing to do the job and show that you want it and you are ready for it. Company offers loads of training and you can get a lot of support from the management team. Incentives are good and the little bonuses we have are great, maybe some more please :) Cons I find myself quite lucky to have been given the chance to work for the company and to be where I am today. BUTTT!! Salary could be better please - London is not cheap- Not so many changes all at once Some more benefits Bonuses are a must to keep employees happy !!! Pressure could be less. Advice to Management Make changes slowly in allowing employees to get use to them. Please more salary for everyone :)", "rating": 5, "pros": "Very friendly and environment in which you can feel comfortable to work in.", "cons": "I find myself quite lucky to have been given the chance to work for the company and to be where I am today.", "advice": "Make changes slowly in allowing employees to get use to them."}, {"title": "Great Bonuses", "text": "Pros One of the best companies I have worked for . The spirit of companionship,team work and achievement runs on the day to day bases. As a group we work very hard to achieve targets in order to bring the company to the next level. In terms of the company if you work hard and you have the right attitude towards work great opportunities can be given to grow in the company in management positions. Also the company provides you training on the weekly bases to make you improve your skills as an underwriter and as a customer relations manager. Just recently the company introduce the bonuses scheme that is very rewarding and boosts your moral. Cons Apart from working on bank holidays for a full day when is meant to be a national holiday I don't have any cons to point out...", "rating": 5, "pros": "One of the best companies I have worked for . The spirit of companionship,team work and achievement runs on the day to day bases. As a group we work very hard to achieve targets in order to bring the company to the next level. In terms of the company if you work hard and you have the right attitude towards work great opportunities can be given to grow in the company in management positions. Also the company provides you training on the weekly bases to make you improve your skills as an underwriter and as a customer relations manager.", "cons": "Apart from working on bank holidays for a full day when is meant to be a national holiday I don't have any cons to point out...", "advice": null}, {"title": "Current employee", "text": "Pros Exciting and challenging work place great environment to work and I learn a lot from my Managers that have patience and keep teaching us. Cons As company is growing every day sometimes is hard to keep up with changes Advice to Management General Managers and teams are positive and helpful with everything but we would be happy with better appreciation moneywise .", "rating": 5, "pros": "Exciting and challenging work place", "cons": "As company is growing every day sometimes is hard to keep up with changes", "advice": "General Managers and teams are positive and helpful with everything but we would be happy with better appreciation moneywise ."}, {"title": "Great", "text": "Pros Great Location on Tottenham court road. Friendly office, very multicultural Cons Forced to use windows , 2 day induction could have been reduced", "rating": 5, "pros": "Great Location on Tottenham court road.", "cons": "Forced to use windows , 2 day induction could have been reduced", "advice": null}, {"title": "Oakam Incentives", "text": "Pros I Have been working for Oakam over 3 years now,and I am happy with that someone actually appreciate my work in here, and reward me with Monthly and quarterly Incentives. Can`t really say anything wrong about company so far. If you know how to do your Job properly, your life should become much easier. Cons Nothing Wrong about the company.", "rating": 5, "pros": "I Have been working for Oakam over 3 years now,and I am happy with that someone actually appreciate my work in here, and reward me with Monthly and quarterly Incentives. Can`t really say anything wrong about company so far.", "cons": "Nothing Wrong about the company.", "advice": null}, {"title": "Love my job!", "text": "Pros I have been there for 2 years and I really like it. People are nice and helpful. I am always happy to come to work in the morning. Collaboration within the team as well as across departments is easy (as opposed to companies where each team follows their own agenda - here teams are pretty well aligned which makes it a lot easier on a day to day. The culture is customer-centric (more than half of the staff is customer facing) and we do regular focus groups and customer panels which is a great way to include customer input into the projects. Personally I feel valued, I am learning a lot and I feel respected. It's very fast-paced environment (projects move fast, deadlines are tight, decisions are made quickly) which is what you would expect from a Fintech company of this size but you do need to keep up. I find it a good way to learn lots in little time. But I can see how it's not a place for everyone. Make sure you ask enough questions during the interview process to confirm it's the right environment for you. But if you are up for a challenge, check out the job openings, we are on to something great! Cons Sometimes not everyone is in sync across departments and between the different Office sites and Retail locations. Advice to Management Benefits could be better", "rating": 5, "pros": "I have been there for 2 years and I really like it. People are nice and helpful. I am always happy to come to work in the morning. Collaboration within the team as well as across departments is easy (as opposed to companies where each team follows their own agenda - here teams are pretty well aligned which makes it a lot easier on a day to day. The culture is customer-centric (more than half of the staff is customer facing) and we do regular focus groups and customer panels which is a great way to include customer input into the projects. Personally I feel valued, I am learning a lot and I feel respected. It's very fast-paced environment (projects move fast, deadlines are tight, decisions are made quickly) which is what you would expect from a Fintech company of this size but you do need to keep up. I find it a good way to learn lots in little time. But I can see how it's not a place for everyone. Make sure you ask enough questions during the interview process to confirm it's the right environment for you. But if you are up for a challenge, check out the job openings, we are on to something great!", "cons": "Sometimes not everyone is in sync across departments and between the different Office sites and Retail locations.", "advice": "Benefits could be better"}, {"title": "Great Place for Techies", "text": "Pros Good place to understand how Financial Service company operates Cons No cons I can think of now. Very new to the company.", "rating": 5, "pros": "Good place to understand how Financial Service company operates", "cons": "No cons I can think of now. Very new to the company.", "advice": null}, {"title": "Poorly Managed", "text": "Pros Lovely people to work with. You can make lifelong friends here Cons Support functions are ignored - upper management are only interested in 'sales' departments and retail they have no interest in those who support those functions, Bare minimum of everything no benefits whatsoever.. 20 days holiday, poor sick pay, no one has ever seemed to receive a payrise let alone annual bonus (except retail!) Very long unsociable hours not suitable if you have a family as you will never see them. Salary below industry standard. Lack of progression opportunities Advice to Management Actually think about rewarding your people not just your customers.. all dandy having Oakam Grow and incentives for customers but the staff get nothing, Also stick to one strategy.. waking up one morning and deciding to change all the products and policies is not helpful for the stuff understanding the direction of the company.", "rating": 3, "pros": "Lovely people to work with. You can make lifelong friends here", "cons": "Support functions are ignored - upper management are only interested in 'sales' departments and retail they have no interest in those who support those functions, Bare minimum of everything no benefits whatsoever.. 20 days holiday, poor sick pay, no one has ever seemed to receive a payrise let alone annual bonus (except retail!) Very long unsociable hours not suitable if you have a family as you will never see them. Salary below industry standard. Lack of progression opportunities", "advice": "Actually think about rewarding your people not just your customers.. all dandy having Oakam Grow and incentives for customers but the staff get nothing,"}, {"title": "AMAZING COMPANY !!", "text": "Pros Multicultural, and friendly colleagues. The company gives you the opportunity to raise up and make decisions if you think that can help the company. Cons I really have no idea what could be bad in Oakam, I have met so many people and feel lucky to work in this big company. Advice to Management Try to share the tasks between more employees that could help to know better to create bridges between departments.", "rating": 5, "pros": "Multicultural, and friendly colleagues.", "cons": "I really have no idea what could be bad in Oakam, I have met so many people and feel lucky to work in this big company.", "advice": "Try to share the tasks between more employees that could help to know better to create bridges between departments."}, {"title": "Oakam's passion for financial inclusion and growth phase provides good opportunity to learn", "text": "Pros - Everyone at Oakam is emotionally invested about enabling financial inclusion and working hard to help those in need - Great place to learn about consumer lending - Learning how to evolve an organisation and operating model to the digital age Cons Oakam is ambitious, growth oriented and brimming with new ideas. Hence sometimes too many projects are started and not as many completed. Things are improving on this front though as management is getting more focused. Advice to Management Keep up the growth spirit and challenger attitude to disrupt the dominant players in the industry Embed long term thinking in the company and pivot methodically Move quicker on the digital front to go global", "rating": 5, "pros": "- Everyone at Oakam is emotionally invested about enabling financial inclusion and working hard to help those in need", "cons": "Oakam is ambitious, growth oriented and brimming with new ideas. Hence sometimes too many projects are started and not as many completed.", "advice": "Keep up the growth spirit and challenger attitude to disrupt the dominant players in the industry"}, {"title": "OaKaM", "text": "Pros Challenging, stimulating, exiting. Every day here is slightly different and the team is diverse and fun. Cons Sometimes there is not enough guidance, no clear instructions or no tools available to reach your objectives. Advice to Management A bit more smile and positivity on day to day", "rating": 5, "pros": "Challenging, stimulating, exiting. Every day here is slightly different and the team is diverse and fun.", "cons": "Sometimes there is not enough guidance, no clear instructions or no tools available to reach your objectives.", "advice": "A bit more smile and positivity on day to day"}, {"title": "Loan ops", "text": "Pros I have been at Oakam for a long time now , the company is open to every one and you will never feel subordinate. Challenging environment to work, everyone have the opportunity to move up #if you work hard deserve it. Cons The Challenge to work for a big and growing company . Advice to Management please keep it up guys With a great managers comes great responsibility and prosperity.", "rating": 5, "pros": "I have been at Oakam for a long time now , the company is open to every one and you will never feel subordinate.", "cons": "The Challenge to work for a big and growing company .", "advice": "please keep it up guys With a great managers comes great responsibility"}, {"title": "Embarrassment", "text": "Pros Met great friends for life Cons Low pay no bonuses staff forse to leave good review on glassdoor site to look good. No real competition only the same people win and in unfair way cheat all the time. Advice to Management Bosses only think of themselves. Can't wait to leave this place. I heard that once this was a good place to work for but that must of been long time ago.", "rating": 1, "pros": "Met great friends for life", "cons": "Low pay no bonuses staff forse to leave good review on glassdoor site to look good. No real competition only the same people win and in unfair way cheat all the time.", "advice": "Bosses only think of themselves. Can't wait to leave this place. I heard that once this was a good place to work for but that must of been long time ago."}, {"title": "Really bad company to work for.", "text": "Pros The staff is very multicultural and there's a lot of good people working there. That's all the good I can say about it. Cons The salary is low. The training you receive does not reflect the reality of your job. The facilities and equipment are not optimal. When something needs to be fixed or replaced it takes a long time for it to happen. There's no clear path of progression within the company. The company changes it's internal rules and business strategies way too often. There seems to be no communication between departments and you often see unreasonable decisions being made without any explanation. The company doesn't aim to make employees feel as a part of it and you often feel as an expendable piece of equipment. Advice to Management Go back to the basics. Treat your employees better and make them feel as an important part of the company. Have your departments discuss changes thoroughly. Give your workers the opportunity to achieve higher goals and recognise the people that go the extra mile to do an outstanding job. Remember that happy employees are more productive and more likely to give the extra effort.", "rating": 1, "pros": "The staff is very multicultural and there's a lot of good people working there. That's all the good I can say about it.", "cons": "The salary is low. The training you receive does not reflect the reality of your job. The facilities and equipment are not optimal. When something needs to be fixed or replaced it takes a long time for it to happen. There's no clear path of progression within the company. The company changes it's internal rules and business strategies way too often. There seems to be no communication between departments and you often see unreasonable decisions being made without any explanation. The company doesn't aim to make employees feel as a part of it and you often feel as an expendable piece of equipment.", "advice": "Go back to the basics. Treat your employees better and make them feel as an important part of the company. Have your departments discuss changes thoroughly. Give your workers the opportunity to achieve higher goals and recognise the people that go the extra mile to do an outstanding job. Remember that happy employees are more productive and more likely to give the extra effort."}, {"title": "WORST COMPANY TO WORK FOR. RUN LIKE THE WIND!!!", "text": "Pros Only good thing is the friends that you make there. Cons -Management who know nothing. A lot of them shouldn't even be managers, bunch of headless chickens running around -Executive board are a joke. They're all so emotional and can't even make firm decisions when it's needed. -Always being told to lie to the customers in order to hit targets. -Information is always hidden by the senior management from employees in order to exploit them. -Bullying of employees -Low paid salary Advice to Management Stop being stuck up your backside and actually start 'doing' rather than just talking behind closed doors.", "rating": 1, "pros": "Only good thing is the friends that you make there.", "cons": "-Management who know nothing. A lot of them shouldn't even be managers, bunch of headless chickens running around", "advice": "Stop being stuck up your backside and actually start 'doing' rather than just talking behind closed doors."}, {"title": "Not recommend to even apply for this job", "text": "Pros I only met great people here and we will stay friends for a long time. Cons No chance for salary increase of bonuses , unrealistic targets and they getting bigger every month. . Advice to Management Start appreciating the people who works for you, because the way this place is going looks like it will be no people left in 2017 to work for you -listen to us as we the one you need", "rating": 1, "pros": "I only met great people here and we will stay friends for a long time.", "cons": "No chance for salary increase of bonuses , unrealistic targets and they getting bigger every month. .", "advice": "Start appreciating the people who works for you, because the way this place is going looks like it will be no people left in 2017 to work for you -listen to us as we the one you need"}, {"title": "...", "text": "Pros The only good thing about Oakam are great people that works there Cons No benefits,minimum salary long working hours,absolutely no possibility of progress or salary increase,no motivation,politics.... Advice to Management If you don't start investing in PEOPLE no one would want to work there. You have to start appreciating hard work and motivate people to do better", "rating": 1, "pros": "The only good thing about Oakam are great people that works there", "cons": "No benefits,minimum salary long working hours,absolutely no possibility of progress or salary increase,no motivation,politics....", "advice": "If you don't start investing in PEOPLE no one would want to work there. You have to start appreciating hard work and motivate people to do better"}, {"title": "not the best", "text": "Pros Nice people. Good team. Great atmosphere. Cons Too much pressure. No appreciation for people.", "rating": 3, "pros": "Nice people. Good team. Great atmosphere.", "cons": "Too much pressure. No appreciation for people.", "advice": null}, {"title": "Lots to improve", "text": "Pros If you find yourself in a right place, at a right time, then you might be able to grow. Otherwise, it's quite tricky for advisors to show their abilities and achieve something within company. Cons Attitude of the managers towards advisors and support staff. Non-existent salary reviews or bonus. No benefits for employees. Advice to Management Start listenining.", "rating": 3, "pros": "If you find yourself in a right place, at a right time, then you might be able to grow. Otherwise, it's quite tricky for advisors to show their abilities and achieve something within company.", "cons": "Attitude of the managers towards advisors and support staff.", "advice": "Start listenining."}, {"title": "Great company to work for always reaching for the top", "text": "Pros Passionate, driven company and keen to achieve tough goals. Lots of opportunity to grow and stretch yourself. Cons Can get very busy very quickly. You must be able to manage multiple tasks simultaneously as pivots are common. Advice to Management Keep on expanding, there more ground to take.", "rating": 5, "pros": "Passionate, driven company and keen to achieve tough goals.", "cons": "Can get very busy very quickly. You must be able to manage multiple tasks simultaneously as pivots are common.", "advice": "Keep on expanding, there more ground to take."}, {"title": "WARNING", "text": "Pros Good for arrivals. For 3 months only. Cons I warning all before apply to this company. Oakam will being treated like a slave by 15K a year. Offer work in the Store assumes: (serving tea, coffee, washing floors, vacuuming, distribution of leaflets and customer service - who are sometimes dangerous). 2014 - 1st assault with a weapon in hand, 2015 2nd assault with a weapon in his hand applied to head of Advisor. On the other hand if you want to work in the Head Office (oral and e-mail results enforcement work, coaxing customers to take larger amounts of loans, the daily threat of dismissal). While you thinking about executives to count with this that they can fire form job day-to-day. In the last 2 months of the company gone or has been released about 30 people. Employee turnover is huge. No benefits! Advice to Management Don't treat people like slaves!", "rating": 1, "pros": "Good for arrivals. For 3 months only.", "cons": "I warning all before apply to this company. Oakam will being treated like a slave by 15K a year. Offer work in the Store assumes: (serving tea, coffee, washing floors, vacuuming, distribution of leaflets and customer service - who are sometimes dangerous). 2014 - 1st assault with a weapon in hand, 2015 2nd assault with a weapon in his hand applied to head of Advisor. On the other hand if you want to work in the Head Office (oral and e-mail results enforcement work, coaxing customers to take larger amounts of loans, the daily threat of dismissal). While you thinking about executives to count with this that they can fire form job day-to-day. In the last 2 months of the company gone or has been released about 30 people. Employee turnover is huge. No benefits!", "advice": "Don't treat people like slaves!"}, {"title": "Every medal has its reverse.", "text": "Pros Oakam is great company to work with as it provides fantastic experience in very challenging environment. It's something more than just loan company, all staff are always friendly and responsive. I'm happy to be at Oakam. Cons It's really difficult to find new customers, moreover, development of digital applications get less chances for stores to find them, because of invention of score cards, which automatically blocks \"risky\" customers. Also, a lot of customers get annoyed because of number of calls from Oakam and ask to opt them out from the system, as if they need more loans they now where to find us. One of our mission is to \"build relationships\" which our customers, however, regular calls are destroying it as we are too \"obsessive\". Existing customers are afraid to apply for TU, because we don't provide BR anymore and Bronze/Silver/ Gold rates are not interesting many of them. Advice to Management To think less about targets but more about people. Try to do more marketing and develop something similar to BR system, which would help to attract more customers and let existing customers to apply again and again.", "rating": 5, "pros": "Oakam is great company to work with as it provides fantastic experience in very challenging environment. It's something more than just loan company, all staff are always friendly and responsive. I'm happy to be at Oakam.", "cons": "It's really difficult to find new customers, moreover, development of digital applications get less chances for stores to find them, because of invention of score cards, which automatically blocks \"risky\" customers.", "advice": "To think less about targets but more about people. Try to do more marketing and develop something similar to BR system, which would help to attract more customers and let existing customers to apply again and again."}, {"title": "Underwriter", "text": "Pros Growing company that looks to make big changes in the near future. Great ideas. Great plans . Cons The company's management is poorly . Under-skilled managers dragging the stores efficiency behind. An idiotic policy to follow on the shop floor. Advice to Management Training . Listen to your employers. Fear is not the solution for respect.", "rating": 5, "pros": "Growing company that looks to make big changes in the near future. Great ideas. Great plans .", "cons": "The company's management is poorly . Under-skilled managers dragging the stores efficiency behind. An idiotic policy to follow on the shop floor.", "advice": "Training . Listen to your employers. Fear is not the solution for respect."}, {"title": "oppurtinity", "text": "Pros I'm working with this company, lovely people Cons i have not seen nothing wrong", "rating": 5, "pros": "I'm working with this company, lovely people", "cons": "i have not seen nothing wrong", "advice": null}, {"title": "Great experience - Great team", "text": "Pros Team is great, always there when you need them Customers are happy to talk in their own language and they are very thankful when we give them our support. I always learn and do new things and I am excited about that. Cons Uniform- always black - we should wear lighter colours", "rating": 5, "pros": "Team is great, always there when you need them", "cons": "Uniform- always black - we should wear lighter colours", "advice": null}, {"title": "Feels like second home", "text": "Pros Oakam has been second home for me, for a while now. I did join as sales advisor, with hard work and very supportive people I was able to progress and achieve where I’m now. I would highly recommend to those who are not afraid challenges and has some ideas to share.  ‘’And don’t forget, your sleep quality depends from the way you make your bed, never blame others.’’ Cons Probably none, well maybe one, recent feedback from few employees- start of the month should be fairer. Advice to Management Advice to management: we love you guys and we do understand that you are very busy, but sometimes just little chat would be great.", "rating": 5, "pros": "Oakam has been second home for me, for a while now. I did join as sales advisor, with hard work and very supportive people I was able to progress and achieve where I’m now. I would highly recommend to those who are not afraid challenges and has some ideas to share.", "cons": "Probably none, well maybe one, recent feedback from few employees- start of the month should be fairer.", "advice": "Advice to management: we love you guys and we do understand that you are very busy, but sometimes just little chat would be great."}, {"title": "Could be better", "text": "Pros It's a multicultural environment with many lovely people I really enjoy working with. It's also a good financial start, for those who are looking for a career into the bank/financial sector. Cons Too stressful, the salary is not consistent with the responsabilites. Managers are often too demanding Advice to Management More empathy, bigger salary, better working conditions.", "rating": 5, "pros": "It's a multicultural environment with many lovely people I really enjoy working with. It's also a good financial start, for those who are looking for a career into the bank/financial sector.", "cons": "Too stressful, the salary is not consistent with the responsabilites. Managers are often too demanding", "advice": "More empathy, bigger salary, better working conditions."}, {"title": "Challenging and Rewarding", "text": "Pros Being involved with underwriting decisions that actually make peoples lives better, great support network - Talent is spotted quickly and progression is possible (not just within dept but across the business.) The business is forward thinking with a great corporate culture. Great foundations to build on... Cons Very difficult (over regulated) marketplace. This is not a job for people who are unwilling to take responsibility for delivering results. Some people who are working for the business (even at relatively senior positions make you question the recruitment policy. Some decisions and business practices seem to favor procedure over logic... some small changes require meetings about meetings about meetings - while other large changes seem to be made on a whim without thinking out (or at least effectively communicating) the consequences - OVERALL no major cons - Hey - if you have nothing to moan about your not at work eh? Advice to Management Remember what made us different and refine this", "rating": 5, "pros": "Being involved with underwriting decisions that actually make peoples lives better, great support network - Talent is spotted quickly and progression is possible (not just within dept but across the business.) The business is forward thinking with a great corporate culture. Great foundations to build on...", "cons": "Very difficult (over regulated) marketplace. This is not a job for people who are unwilling to take responsibility for delivering results. Some people who are working for the business (even at relatively senior positions make you question the recruitment policy. Some decisions and business practices seem to favor procedure over logic... some small changes require meetings about meetings about meetings - while other large changes seem to be made on a whim without thinking out (or at least effectively communicating) the consequences - OVERALL no major cons - Hey - if you have nothing to moan about your not at work eh?", "advice": "Remember what made us different and refine this"}, {"title": "Good opportunity", "text": "Pros Family business concept, adopting the TFC values. Cons Not enough incentives for the employees Advice to Management Take care of your employees and they will take care of their customers.", "rating": 5, "pros": "Family business concept, adopting the TFC values.", "cons": "Not enough incentives for the employees", "advice": "Take care of your employees and they will take care of their customers."}, {"title": "Great Opportunities", "text": "Pros Been in Oakam for just under 1 year. Learnt so much from this business. Great experience. Great friendly staff. Management 5*. Looking forward no moving higher within business. Cons No great bonuses/Benefits for employees. Needs more initiatives for employees.", "rating": 5, "pros": "Been in Oakam for just under 1 year. Learnt so much from this business. Great experience. Great friendly staff. Management 5*. Looking forward no moving higher within business.", "cons": "No great bonuses/Benefits for employees. Needs more initiatives for employees.", "advice": null}, {"title": "a stepping stone to bigger and better things", "text": "Pros great colleagues, training programme, supportive managers Cons days off are split/ low pay/ sometimes you don't have time to get your break . Advice to Management keep up the good work", "rating": 5, "pros": "great colleagues, training programme, supportive managers", "cons": "days off are split/ low pay/ sometimes you don't have time to get your break .", "advice": "keep up the good work"}, {"title": "Has so much potential, but...", "text": "Pros It gives a great opportunity of learning and growing. Great experience for the future and building a career because you learn so many things, from retail to management, to call centre work, finance work and you learn how to underwrite really well. They make an effort to help the staff learn and keep they teaching them, you'll find yourself learning a lot. some people are really amazing and great to work with. you'll find giving and warm hearts willing to help you bring out the best in you. Cons Employees are told off a lot for not reaching the impossible targets. Many feel so stressed they stop performing. the paradox of being pushed so hard to perform and achieve the targets, to the point where you're forced to lower your risk instincts out of fear, versus all the consequences you get if your loans become Never Paids/write offs, which messes up your scores as an underwriter, is insane. The constant fear of both is very stressful and confusing. Management is really bad, and they don't take in what we say even though we are the ones dealing with the customers daily. We see ourselves losing customers due to the everyday harassment through call after call, still they keep pushing us to call again and again. Its sad when we make such an effort to build a relationship with them and then see them blocking our number or getting so upset at us because they cant take the amount of calls oakam is giving them. it feels like the management lacks basic understanding of customer service. It doesn't matter how cold it is outside, we are pushed to leave the doors open, even the stores with automatic doors that open as soon as someone walks by are forced to stay open, and of course, staff members get sick. and that's the cycle of working at oakam. Advice to Management Stop trying to squeeze all you can from your tired and stressed staff. so many stores are under-staffed, doing all they can, sometimes doing more than they were trained to, everyone works over hours without getting paid for it, just to keep oakam going, and then everyone is mistreated. how many of us have gone days without a lunch break. Its sad to see so many great long term employees leaving, and almost everyone talking about leaving. that is because no one feels appreciated. with the very low salary they give us they want us to do customer service, underwriting, marketing, advisor job, till work, management work and cleaning. all with a smile and never complaining.", "rating": 3, "pros": "It gives a great opportunity of learning and growing. Great experience for the future and building a career because you learn so many things, from retail to management, to call centre work, finance work and you learn how to underwrite really well. They make an effort to help the staff learn and keep they teaching them, you'll find yourself learning a lot. some people are really amazing and great to work with. you'll find giving and warm hearts willing to help you bring out the best in you.", "cons": "Employees are told off a lot for not reaching the impossible targets. Many feel so stressed they stop performing. the paradox of being pushed so hard to perform and achieve the targets, to the point where you're forced to lower your risk instincts out of fear, versus all the consequences you get if your loans become Never Paids/write offs, which messes up your scores as an underwriter, is insane. The constant fear of both is very stressful and confusing.", "advice": "Stop trying to squeeze all you can from your tired and stressed staff. so many stores are under-staffed, doing all they can, sometimes doing more than they were trained to, everyone works over hours without getting paid for it, just to keep oakam going, and then everyone is mistreated. how many of us have gone days without a lunch break. Its sad to see so many great long term employees leaving, and almost everyone talking about leaving. that is because no one feels appreciated. with the very low salary they give us they want us to do customer service, underwriting, marketing, advisor job, till work, management work and cleaning. all with a smile and never complaining."}, {"title": "The Best People, The Worst Salary", "text": "Pros Company is people friendly, it feels like home. My team is amazing, professional and committed to work. I could get useful experience and progress my career. Cons The company doesn't specify your salary on the first stage of interview. When you are accepted for the job they explain you condition of the contract and that you are going to get minimum wage just for 3 months and you can get a rise quickly. I am already 3 years in the company and I have the same wage as starters. This is unbelievable! Don't recommend! Advice to Management Increase salary from employees. You are loosing amazing people that can bring value to the company. We will leave sooner or later!!!!!!!!", "rating": 3, "pros": "Company is people friendly, it feels like home.", "cons": "The company doesn't specify your salary on the first stage of interview. When you are accepted for the job they explain you condition of the contract and that you are going to get minimum wage just for 3 months and you can get a rise quickly. I am already 3 years in the company and I have the same wage as starters. This is unbelievable! Don't recommend!", "advice": "Increase salary from employees. You are loosing amazing people that can bring value to the company. We will leave sooner or later!!!!!!!!"}, {"title": "Good company but ..", "text": "Pros -growing company -lots of opportunities for employees to progress -good experience Cons -working 9am-18pm or sometimes longer -no overtime -no bonuses, can't really earn more than salary -no real incentives (you can work really hard and get literally nothing in return) -no comission -new comers earn the same money as people who have worked there for 2-3 years i.e you can have mandate to authorise loans up to £5000 but you get almost the same money as people who have no idea about the job -huge expectations from management team but... nothing in return -Opening times are too long and overwhelming sometimes Advice to Management There should be a bonus scheme for advisors who do all the dirty work in this company. I advise to introduce it as soon as possible. I also would like to add that recognition for employees is the key .", "rating": 3, "pros": "-growing company", "cons": "-working 9am-18pm or sometimes longer", "advice": "There should be a bonus scheme for advisors who do all the dirty work in this company. I advise to introduce it as soon as possible. I also would like to add that recognition for employees is the key ."}, {"title": "Valuble expierience for the future.", "text": "Pros Opportunity to work in finance sector without previous experience in the field. Possibility to claim 'up the ladder' Cons Highly target driven environment. Accountability for decisions is very high and makes is harder to achieve targets set. Advice to Management My advice to senior management would be to create more incentive and benefits for staff.", "rating": 3, "pros": "Opportunity to work in finance sector without previous experience in the field.", "cons": "Highly target driven environment.", "advice": "My advice to senior management would be to create more incentive and benefits for staff."}, {"title": "Store Advisor in Oakam", "text": "Pros It gives a great opportunity to develop personal skills and gain experience. You can working with great people ready to support you every day. Cons The company is oriented only on target and what is good for profit. Targets which is hard to reach, everyday work on the same lists turning into harressmet and customer are very upset, so blocking or changing numbers. Nevermind what the weather outside is the door must stay open, but no proper heating is provide and we need to spend 9 hours in cold store. Due to multi task and not enough of staff very often we are not able to take our brakes. Overtimes are not paid and we are not getting the time back. No bonuses, extra hours for free and not really adequate salary is not motivating. Company procedures are changing the way we can't do our job properly, but we are still forcedto deliver the numbers. Advice to Management More focus on employees, some more motivation to them, not only stress and overtimes for free, but as well bonuses, salary increases and more support. More clear procedures and communication.", "rating": 3, "pros": "It gives a great opportunity to develop personal skills and gain experience. You can working with great people ready to support you every day.", "cons": "The company is oriented only on target and what is good for profit. Targets which is hard to reach, everyday work on the same lists turning into harressmet and customer are very upset, so blocking or changing numbers. Nevermind what the weather outside is the door must stay open, but no proper heating is provide and we need to spend 9 hours in cold store. Due to multi task and not enough of staff very often we are not able to take our brakes. Overtimes are not paid and we are not getting the time back. No bonuses, extra hours for free and not really adequate salary is not motivating. Company procedures are changing the way we can't do our job properly, but we are still forcedto deliver the numbers.", "advice": "More focus on employees, some more motivation to them, not only stress and overtimes for free, but as well bonuses, salary increases and more support."}, {"title": "Advisor", "text": "Pros Great opportunities for progression - great trainings Cons No motivation , no bonuses no appreciation Advice to Management Don't visit the store and make up your mind with one hour/day visit to understand what need to be done. Listen to the employees as they have great ideas for improvement.", "rating": 3, "pros": "Great opportunities for progression - great trainings", "cons": "No motivation , no bonuses no appreciation", "advice": "Don't visit the store and make up your mind with one hour/day visit to understand what need to be done. Listen to the employees as they have great ideas for improvement."}, {"title": "Great Company for beginners", "text": "Pros The company is giving you great opportunities to grow within business, lovely work environment, friendly staff, good working hours, provides a good training for all staff Cons Low salary for new starters,", "rating": 5, "pros": "The company is giving you great opportunities to grow within business, lovely work environment, friendly staff, good working hours, provides a good training for all staff", "cons": "Low salary for new starters,", "advice": null}, {"title": "Advisor", "text": "Pros Oakam is genuinely a good place to work, it is not just a boring office job. Every day is a fun day (depending on what store you are working in). There are new challenges everyday which keep you learn more and more about the industry. At Oakam there is weekly training sessions so you are always refreshing what you know and your skills. Cons There is a lot of information to take in! There are so many targets that you'll find yourself breaking your back to meet. It can be quite a stressful job at times. We are constantly marketing, so that could be Leafleting, Door Drops and constant phone calls to customers which could be a bit tedious ... annoying even.", "rating": 3, "pros": "Oakam is genuinely a good place to work, it is not just a boring office job. Every day is a fun day (depending on what store you are working in). There are new challenges everyday which keep you learn more and more about the industry. At Oakam there is weekly training sessions so you are always refreshing what you know and your skills.", "cons": "There is a lot of information to take in! There are so many targets that you'll find yourself breaking your back to meet. It can be quite a stressful job at times. We are constantly marketing, so that could be Leafleting, Door Drops and constant phone calls to customers which could be a bit tedious ... annoying even.", "advice": null}, {"title": "store manager", "text": "Pros oakam gives you the chance to learn a lot about customer service and finance and also to progress/I started as advisor in 2012 (my first job in the uk)and I was promoted Assistant manager in 2014, Tainee store manager in 2015 and Store manager on February 2016 Cons the training given when I started was not enough for me to fully understand my job/there is no bonus to earn Advice to Management to be closer to the employees and understand better the daily problems that they face in store dealing with customers and with their tasks/responsibiliies", "rating": 3, "pros": "oakam gives you the chance to learn a lot about customer service and finance and also to progress/I started as advisor in 2012 (my first job in the uk)and I was promoted Assistant manager in 2014, Tainee store manager in 2015 and Store manager on February 2016", "cons": "the training given when I started was not enough for me to fully understand my job/there is no bonus to earn", "advice": "to be closer to the employees and understand better the daily problems that they face in store dealing with customers and with their tasks/responsibiliies"}, {"title": "Challanging", "text": "Pros Working for Oakam Ltd and in retail business is very exciting as there is always something new to learn and you can develop your skills in many area of expertise such as retail management; staff management; cash management; local marketing; risk management and mainly in underwriting. Cons Oakam gives you a really good career opportunity, however the compensation & benefits are not consistent with responsibilities you need to take in your day to day job; Work & life balance many times effected by how busy the store is. Advice to Management There should be more communication between staff and management; Management should create a better atmosphere and work environment by giving bonuses, creating incentives; concentrate a bit more on work & life balance and at last but not least reward based on responsibilities.", "rating": 3, "pros": "Working for Oakam Ltd and in retail business is very exciting as there is always something new to learn and you can develop your skills in many area of expertise such as retail management; staff management; cash management; local marketing; risk management and mainly in underwriting.", "cons": "Oakam gives you a really good career opportunity, however the compensation & benefits are not consistent with responsibilities you need to take in your day to day job; Work & life balance many times effected by how busy the store is.", "advice": "There should be more communication between staff and management; Management should create a better atmosphere and work environment by giving bonuses, creating incentives; concentrate a bit more on work & life balance and at last but not least reward based on responsibilities."}, {"title": "Amazing colleagues", "text": "Pros Friendly company with very nice people working in there, amazing team, very nice environment to work. Good experience for the future, a lot of interesting things that you can learn, you can progress into your career. Cons The bad side is that the salaries are very low, as if the management is not aware that people in the store are doing the hardest job (attracting customers to develop the business). Maybe they should put more effort to pay more the employees because they are loosing very capable people. Advice to Management Increase the salaries, we are doing the toughest job.", "rating": 3, "pros": "Friendly company with very nice people working in there, amazing team, very nice environment to work. Good experience for the future, a lot of interesting things that you can learn, you can progress into your career.", "cons": "The bad side is that the salaries are very low, as if the management is not aware that people in the store are doing the hardest job (attracting customers to develop the business). Maybe they should put more effort to pay more the employees because they are loosing very capable people.", "advice": "Increase the salaries, we are doing the toughest job."}, {"title": "Working at oakam", "text": "Pros good place to learn and improve you skills, as a underwriter and adviser, you always ways being trained in something new every week, because the company is still growing you grow with it. good staff friendly. Cons for the amount and work the company asks you too do and all the risks you take, they don't pay you enough 15K a years, they dont have any employee benefits,", "rating": 3, "pros": "good place to learn and improve you skills, as a underwriter and adviser, you always ways being trained in something new every week, because the company is still growing you grow with it. good staff friendly.", "cons": "for the amount and work the company asks you too do and all the risks you take, they don't pay you enough 15K a years, they dont have any employee benefits,", "advice": null}, {"title": "Store advisor/underwriter", "text": "Pros teamwork orientated variety of languages and culture good career development & training Cons The downside would have to be the lack of rewards and benefits.", "rating": 3, "pros": "teamwork orientated", "cons": "The downside would have to be the lack of rewards and benefits.", "advice": null}, {"title": "Wish they appreciated us more", "text": "Pros Great company to start off your career, to gain confidence in talking to people, learn English and to get experience in finance, customer service and marketing. Great atmosphere in the store, interesting and stimulating tasks. Cons The salary doesn't reflect the amount to stress and responsibilities that comes with the job. In fact a receptionist earns more than an assistant manager at Oakam. The retail staff have more common sense than the people above which can be quite frustrating. Hard to progress with your career unless you are friends with the top management. They are not looking at your skills and hard work, but how much they like you. Advice to Management Instead of hiring people from outside, put your loyal staff members on training and support them to develop with their career before they get fed up and leave.", "rating": 3, "pros": "Great company to start off your career, to gain confidence in talking to people, learn English and to get experience in finance, customer service and marketing. Great atmosphere in the store, interesting and stimulating tasks.", "cons": "The salary doesn't reflect the amount to stress and responsibilities that comes with the job. In fact a receptionist earns more than an assistant manager at Oakam.", "advice": "Instead of hiring people from outside, put your loyal staff members on training and support them to develop with their career before they get fed up and leave."}, {"title": "Work at Oakam", "text": "Pros Good company to gain experience. Possibility to learn new things, good trainings. Opportunity to meet some nice people. Possitive atmoshpere in the store. Cons Too many requirements for the salary the company pays. In general, just lack of motivation.", "rating": 3, "pros": "Good company to gain experience. Possibility to learn new things, good trainings. Opportunity to meet some nice people. Possitive atmoshpere in the store.", "cons": "Too many requirements for the salary the company pays. In general, just lack of motivation.", "advice": null}, {"title": "...could be better!", "text": "Pros Oakam gives an experience for people, who never worked with finance before. Full training is provided and no any special financial degree needed! It's very good for beginners. Job is excited untill you understand---it's too much! Cons \"Promises\" this is the main problem! Advice to Management Make a business more organised/professional. Each department has to do his own job, not everyone to do everything.", "rating": 3, "pros": "Oakam gives an experience for people, who never worked with finance before. Full training is provided and no any special financial degree needed! It's very good for beginners. Job is excited untill you understand---it's too much!", "cons": "\"Promises\" this is the main problem!", "advice": "Make a business more organised/professional. Each department has to do his own job, not everyone to do everything."}, {"title": "Not happy!!!!!", "text": "Pros The reason to work here is not about the money, because it's not enough to survive, the reason is because I have a good colleagues that make me happy to do my job. Cons Working as a person who is doing loans should make me proud, but honestly when I realized that I am one of those people that is on a lower income it does not make me proud and confident in my job. it does not make me feel good staying more hours and not getting paid for that, but if you late there is a problem. No bonus for those people who are working hard, and try to reach targets.-There is no point to push yourself. with this salary!! Advice to Management Motivate people with Bonus rewards, I NEED Higher salary,", "rating": 3, "pros": "The reason to work here is not about the money, because it's not enough to survive, the reason is because I have a good colleagues that make me happy to do my job.", "cons": "Working as a person who is doing loans should make me proud, but honestly when I realized that I am one of those people that is on a lower income it does not make me proud and confident in my job. it does not make me feel good staying more hours and not getting paid for that, but if you late there is a problem. No bonus for those people who are working hard, and try to reach targets.-There is no point to push yourself. with this salary!!", "advice": "Motivate people with Bonus rewards, I NEED Higher salary,"}, {"title": "General Feedback", "text": "Pros Friendly environment in a fast growing company. Offers many career opportunities in a wide field of activities. Cons Long hours, no sick pay", "rating": 3, "pros": "Friendly environment in a fast growing company. Offers many career opportunities in a wide field of activities.", "cons": "Long hours, no sick pay", "advice": null}, {"title": "Store Advisor", "text": "Pros A lot of challenges to face, every day looks different, you are never bored at work and time flies really fast. Company is growing more and more every day which makes the job more exciting. Cons Company requires that employees book their all of holidays in advance first thing in January and 2 people are not allowed to have it off at the same time-fair enough taken the nature of the business. However, company could be more understanding to its employees who have emergency or simply days important to them like for example family weddings, christenings, or any other family/friends celebrations to attend and need to have specific day off but they cannot if other employee booked it a few minutes before them. Company could be more helpful in cases like this when there is a real and genuine reason. In terms of work itself-we are always told not to put barriers on customers which will prevent them from applying with us-yet the company puts constraints for these customers itself-policy changes e.g. payslip as POA only when its posted when majority of our customers receives them only via email. Our loans are often being stopped which makes all Advisors question their skills and not take any risks. Also. advisors are now being sent for training in places which are not convienient for them and could be done in stores closer to them. Another thing is the unrealistic targets-The more we do the more is expected of us(quiet days are not taken into consideration) and if its not met then we are being told of for not trying hard enough. Advice to Management Appreciate its employees more. Start doing more incentives that will benefit both company and its employees rather than just putting restrictions. Try to be more understanding supportive and trusting as at the end of the day happy employee-happy and growing Company.", "rating": 3, "pros": "A lot of challenges to face, every day looks different, you are never bored at work and time flies really fast. Company is growing more and more every day which makes the job more exciting.", "cons": "Company requires that employees book their all of holidays in advance first thing in January and 2 people are not allowed to have it off at the same time-fair enough taken the nature of the business. However, company could be more understanding to its employees who have emergency or simply days important to them like for example family weddings, christenings, or any other family/friends celebrations to attend and need to have specific day off but they cannot if other employee booked it a few minutes before them. Company could be more helpful in cases like this when there is a real and genuine reason. In terms of work itself-we are always told not to put barriers on customers which will prevent them from applying with us-yet the company puts constraints for these customers itself-policy changes e.g. payslip as POA only when its posted when majority of our customers receives them only via email. Our loans are often being stopped which makes all Advisors question their skills and not take any risks. Also. advisors are now being sent for training in places which are not convienient for them and could be done in stores closer to them. Another thing is the unrealistic targets-The more we do the more is expected of us(quiet days are not taken into consideration) and if its not met then we are being told of for not trying hard enough.", "advice": "Appreciate its employees more. Start doing more incentives that will benefit both company and its employees rather than just putting restrictions. Try to be more understanding supportive and trusting as at the end of the day happy employee-happy and growing Company."}, {"title": "Advisor", "text": "Pros Good opportunity for career grow, for experience financial and lending sector if you want to continue working in other places. Cons No motivation for Advisors, many rules and big responsibility for this kind of money, cold at winter time to be inside, because doors is always open, I think it has no bearing on the customer flow and you look not well with red hands or nose inside. Advice to Management I think many people left this place because salary and just came to get an experience. To keep staff should be more motivated, maybe bonuses or 13th salary.", "rating": 3, "pros": "Good opportunity for career grow, for experience financial and lending sector if you want to continue working in other places.", "cons": "No motivation for Advisors, many rules and big responsibility for this kind of money, cold at winter time to be inside, because doors is always open, I think it has no bearing on the customer flow and you look not well with red hands or nose inside.", "advice": "I think many people left this place because salary and just came to get an experience. To keep staff should be more motivated, maybe bonuses or 13th salary."}, {"title": "Lovely place", "text": "Pros Excellent people full of skills which allows you to lern and lern without limits. Cons Company still on growth process therefore there is some issues on the structure.", "rating": 3, "pros": "Excellent people full of skills which allows you to lern and lern without limits.", "cons": "Company still on growth process therefore there is some issues on the structure.", "advice": null}, {"title": "Moving to the right direction", "text": "Pros Growing company, lots of opportunities, great people. Cons Really needs to sort out a reasonable employment benefit structure. No sick pay or bonuses. Advice to Management Trust and value your employees.", "rating": 5, "pros": "Growing company, lots of opportunities, great people.", "cons": "Really needs to sort out a reasonable employment benefit structure. No sick pay or bonuses.", "advice": "Trust and value your employees."}, {"title": "One of the best company I've worked for", "text": "Pros A rapid growing, fast evolving fintech company. One of the best places to work for. career progression and flexible working hours. Cons slow implementation of procedures and policies but surely getting there", "rating": 5, "pros": "A rapid growing, fast evolving fintech company. One of the best places to work for.", "cons": "slow implementation of procedures and policies but surely getting there", "advice": null}, {"title": "Oakam, a company like no other", "text": "Pros Company with a great ambition, trying to make something good in this world. Great development opportunities thanks to a very employee oriented executive management. New ideas and any improvement are more than welcome. We are not afraid of change! CEO very close to his employees and with strong leadership. Young mindset throughout the organisation with committed and hard working people. Very enjoyable atmosphere where you're more likely to make friends than just work colleagues. Rich culture with our workforce coming from all parts of the world and speaking different languages, key ingredient to learning and success. Nice working environment with modern offices where you can take a break and play a bit of foosball or pool! Cons Growing company meaning numerous changes and tight deadlines. Objectives not always fully cascaded to the teams, which might lead to misunderstandings. Advice to Management Let's communicate better!", "rating": 5, "pros": "Company with a great ambition, trying to make something good in this world.", "cons": "Growing company meaning numerous changes and tight deadlines.", "advice": "Let's communicate better!"}, {"title": "Challenging Environment", "text": "Pros Great people, Good wages if you work hard, progression for people with a good mentality, good area managers and Head of retail. Cons Unrealistic targets, low staffing levels, day to day management-one bad day and you are no longer performing. High pressure from seniors. Advice to Management Prioritise the correct areas. Be clear about the direction required and support the teams to develop. Sometimes being told too many things blocks productivity.", "rating": 1, "pros": "Great people, Good wages if you work hard, progression for people with a good mentality, good area managers and Head of retail.", "cons": "Unrealistic targets, low staffing levels, day to day management-one bad day and you are no longer performing. High pressure from seniors.", "advice": "Prioritise the correct areas. Be clear about the direction required and support the teams to develop. Sometimes being told too many things blocks productivity."}, {"title": "Oakam as a working place - great people, opportunities and challenges", "text": "Pros Absolutely fantastic people to work with across the stores as well as within our two head offices! Deeply ingrained \"hard work\" ethos, As company keeps expanding, there are constant challenges which present very often themselves as opportunities on gaining extra knowledge and new skills across the company Cons Well everything comes with a price, so a massive amount of projects taken on board simultaneously, which results sometimes in contradicting decisions made across the business creating further confusion amongst employees and is strenuous for developers and project managers. Advice to Management Although running fast forward seems to be a sign of our times, it is good to stop from time to time and look back to check if we didn't leave any damage :-)", "rating": 5, "pros": "Absolutely fantastic people to work with across the stores as well as within our two head offices! Deeply ingrained \"hard work\" ethos, As company keeps expanding, there are constant challenges which present very often themselves as opportunities on gaining extra knowledge and new skills across the company", "cons": "Well everything comes with a price, so a massive amount of projects taken on board simultaneously, which results sometimes in contradicting decisions made across the business creating further confusion amongst employees and is strenuous for developers and project managers.", "advice": "Although running fast forward seems to be a sign of our times, it is good to stop from time to time and look back to check if we didn't leave any damage :-)"}, {"title": "Why Oakam? Why not...", "text": "Pros Relatively small company with ambition to grow. Multilingual, multicultural organisation with hard working, success hungry, very friendly bunch of people dedicating their lives to this business. Owner is man with vision, to create business like no other on the financial market, who inspiring his employees to work even harder towards clearly set goals - growth and global recognition. Cons Sharp turn in regards to objectives, very short and unexpected deadlines, often used quick win solutions, lack of long term robust planning, rushed and not fully justified decision talking process. Advice to Management The destination is set, end goal is well known, but sometimes journey ahead appears to be bleary... ... strong need of people with very good anti fog headlights to keep this boat on the right course.", "rating": 5, "pros": "Relatively small company with ambition to grow. Multilingual, multicultural organisation with hard working, success hungry, very friendly bunch of people dedicating their lives to this business. Owner is man with vision, to create business like no other on the financial market, who inspiring his employees to work even harder towards clearly set goals - growth and global recognition.", "cons": "Sharp turn in regards to objectives, very short and unexpected deadlines, often used quick win solutions, lack of long term robust planning, rushed and not fully justified decision talking process.", "advice": "The destination is set, end goal is well known, but sometimes journey ahead appears to be bleary..."}, {"title": "Working for Oakam", "text": "Pros Great team spirit. Teams are united and make a huge effort to work together and support each other The customers are really the reason why we are here and the teams make every effort to make a difference to our customer's lives The teams make the difference, without their enthusiasm and energy and drive I don't think we would be where we are today A big investment we got from RBS, we have full authorisation by the FCA...we are laughing! Future is Green, the future is Oakam! Cons Risk/Reward, getting the balance right is essential! Advice to Management Our people are our greatest asset!", "rating": 5, "pros": "Great team spirit.", "cons": "Risk/Reward, getting the balance right is essential!", "advice": "Our people are our greatest asset!"}, {"title": "Very poor management", "text": "Pros The people are all very approachable and supportive (non management) and make working in a stressful environment bearable Cons The management has no clue what they are doing. They change their course of action on a daily basis which leaves those around them confused and worried. Management has no interest in staff or people in general and in the end they leave because they feel un-valued and management think they can be replaced. Staff first think that this is a great place to work but soon realize that things are not as they first thought", "rating": 1, "pros": "The people are all very approachable and supportive (non management) and make working in a stressful environment bearable", "cons": "The management has no clue what they are doing. They change their course of action on a daily basis which leaves those around them confused and worried. Management has no interest in staff or people in general and in the end they leave because they feel un-valued and management think they can be replaced. Staff first think that this is a great place to work but soon realize that things are not as they first thought", "advice": null}, {"title": "its ok", "text": "Pros good training programs and progressive opportunities available in order to develop Cons income is low for the job criteria Advice to Management increase salaries.", "rating": 3, "pros": "good training programs and progressive opportunities available in order to develop", "cons": "income is low for the job criteria", "advice": "increase salaries."}, {"title": "Multi-functional ? This job is for you !", "text": "Pros Pleasant environment, friendly staff, supportive management (at store level), good training, don't need experience in finance. Cons The job title is Store Advisor which means that you will deal with customers, deal with cash/card transactions, clean the store, make collections (although there is a Collections department), and the worst - LEAFLETING in summer, winter, rain or tornado !! Minimum wages, hours that don't give you flexibility - don't get to have your own life. No kind of bonuses or rewards. Stressful, not getting any support from senior management, lack of communication. Advice to Management Your staff would all work the same if you would treat them the same.", "rating": 3, "pros": "Pleasant environment, friendly staff, supportive management (at store level), good training, don't need experience in finance.", "cons": "The job title is Store Advisor which means that you will deal with customers, deal with cash/card transactions, clean the store, make collections (although there is a Collections department), and the worst - LEAFLETING in summer, winter, rain or tornado !!", "advice": "Your staff would all work the same if you would treat them the same."}, {"title": "Good", "text": "Pros Great place for development - company gives you an opportunity to improve your skills within sales, admin, management...literally everything if you work in retail. Cons Salary could be slightly higher and annual salary reviews should be introduced for each employee, especially for management as they are the key in regards to the performance of the stores.", "rating": 3, "pros": "Great place for development - company gives you an opportunity to improve your skills within sales, admin, management...literally everything if you work in retail.", "cons": "Salary could be slightly higher and annual salary reviews should be introduced for each employee, especially for management as they are the key in regards to the performance of the stores.", "advice": null}, {"title": "Big opportunity for ordinary, hard working and ambitious people", "text": "Pros Company which gives opportunity for non experienced people in finance. Very laid back environment in store which make work and day much easier. Mix of cultures and languages. close relationship with customers Cons Growing company with loads of changes at the same time and pressure. They want management to be an expert in every field , such as customer service, marketing, managing people without prior training on it. no bonuses for staff, no pay for sicknesses Advice to Management You love it or hate it. Once you realise which way you feel, you stay or go...", "rating": 3, "pros": "Company which gives opportunity for non experienced people in finance. Very laid back environment in store which make work and day much easier. Mix of cultures and languages. close relationship with customers", "cons": "Growing company with loads of changes at the same time and pressure. They want management to be an expert in every field , such as customer service, marketing, managing people without prior training on it. no bonuses for staff, no pay for sicknesses", "advice": "You love it or hate it. Once you realise which way you feel, you stay or go..."}, {"title": "Oakam", "text": "Pros Ability to get first hand credit control training internal promotions to build a career work with people of all nationalites and backgrounds Cons Work longer hours than a bank and most other high street lenders Not enough staff hired at one time so when people leave there is a period of running short staffed Advice to Management if you have one vacancy hire one and bank the other but remain in contact.", "rating": 3, "pros": "Ability to get first hand credit control training", "cons": "Work longer hours than a bank and most other high street lenders", "advice": "if you have one vacancy hire one and bank the other but remain in contact."}, {"title": "LIFE AT OAKAM", "text": "Pros You have the opportunity to work with people from various backgrounds and learn about multiple cultures Cons Low rate salary, advisers are treated very badly, your employee contract is not transparent at all, they expect you to do street walking on the rain, snow (regardless the weather) sometimes your asked to work out of hours due to their ''target'', they want you to stay from 6pm-9pm to make calls Advice to Management advisers should be taken more in to consideration, everyone should be treated with respect (not only convenient) and marketing team should be fully responsible for marketing", "rating": 1, "pros": "You have the opportunity to work with people from various backgrounds and learn about multiple cultures", "cons": "Low rate salary, advisers are treated very badly, your employee contract is not transparent at all, they expect you to do street walking on the rain, snow (regardless the weather) sometimes your asked to work out of hours due to their ''target'', they want you to stay from 6pm-9pm to make calls", "advice": "advisers should be taken more in to consideration, everyone should be treated with respect (not only convenient) and marketing team should be fully responsible for marketing"}, {"title": "Advisor", "text": "Pros The fellow staff at the HQ and store levels are quite helpful in making new staff feel welcome and also assists in the day to day functionning of the company. People are passionate about working for Oakam. Store staff across the branches work as a united group Cons wages could be increased as the workload in the stores have increased. Store staff do not get their work given the same importance as the HQ staff. Advice to Management Treat staff more fairly especially in the wages department. Keep experienced staff by increasing wages", "rating": 1, "pros": "The fellow staff at the HQ and store levels are quite helpful in making new staff feel welcome and also assists in the day to day functionning of the company.", "cons": "wages could be increased as the workload in the stores have increased.", "advice": "Treat staff more fairly especially in the wages department."}, {"title": "Not recommended", "text": "Pros You can meet some really nice people. Cons As mentioned below(before it got covered up with the positive reviews) - no confidentiality- be careful what you say during 1:1 as the minute you leave the room it will spread from HR to management. To get a promotion you need to live on the good terms despite not having skills nor ability to perform your position(eg. Lack of basic written and verbal English skills). Very incoherent structure, prevalent culture of blame and shifting of responsibility, but foremost COMPLETE LACK OF COMMUNICATION. Not to mention lack of bonuses, no commission which is very dismotivatiaring, sometimes incentives which are not achievable for most team members, long hours (8-7pm in the head office), no sick pay and when you do call in sick they threthen you with disciplinary actions after 1 or 2 occasions, VERY LOW WAGES, also taking long to approve your holiday and causing you loads of problems with booking time off... There is loads to be improved within the company and management Advice to Management Fix the communication within the team", "rating": 3, "pros": "You can meet some really nice people.", "cons": "As mentioned below(before it got covered up with the positive reviews) - no confidentiality- be careful what you say during 1:1 as the minute you leave the room it will spread from HR to management. To get a promotion you need to live on the good terms despite not having skills nor ability to perform your position(eg. Lack of basic written and verbal English skills). Very incoherent structure, prevalent culture of blame and shifting of responsibility, but foremost COMPLETE LACK OF COMMUNICATION.", "advice": "Fix the communication within the team"}, {"title": "Worst employer ever! This company should be addressed FCA and Human RIGHTS!", "text": "Pros Only part time work max 16 hours. If you will work more - COMPANY WILL TREAT YOU AS RUBBISH! Cons If you want to be a cleaner, leaflets carrier and also painter This is a job for you. If you want to work for minimum wage without bonuses This is a job for you. If you want to lie to customers because COMPANY need achieve target This is a job for you. If you do not have a private life This is a job for you. If you want to work in constant stress This is a job for you. If you want to work in an atmosphere of intimidation and informer This is a job for you. Dissuade!!! Advice to Management TREAT YOUR CUSTOMER FAIRLY - Oakam - do you remember this motto? What you say to manipulation expenses to fit into the DTI? The pricing level not mention...", "rating": 1, "pros": "Only part time work max 16 hours. If you will work more - COMPANY WILL TREAT YOU AS RUBBISH!", "cons": "If you want to be a cleaner, leaflets carrier and also painter This is a job for you.", "advice": "TREAT YOUR CUSTOMER FAIRLY - Oakam - do you remember this motto? What you say to manipulation expenses to fit into the DTI? The pricing level not mention..."}, {"title": "low pay, good employer to get experience", "text": "Pros good to get experience work on rota financial experience as store advisors Cons peopel not treated best low wage extre,ely busy environent", "rating": 3, "pros": "good to get experience", "cons": "peopel not treated best", "advice": null}, {"title": "Doing It Right", "text": "Pros Company deals with customers and staff the right way. Good team feeling about day to day work and comfortable working environment. Time is taken with each customer to get the job done right. Ability to progress and transfer to other locations. Cons Leafleting outside is not always fun - but made as enjoyable as possible and company provide uniform and jackets.. Advice to Management Managers are accessible and knowledgeable. Communication is good. Need a bit more structure but this is a company that is going places and working towards a bright future.", "rating": 5, "pros": "Company deals with customers and staff the right way. Good team feeling about day to day work and comfortable working environment. Time is taken with each customer to get the job done right. Ability to progress and transfer to other locations.", "cons": "Leafleting outside is not always fun - but made as enjoyable as possible and company provide uniform and jackets..", "advice": "Managers are accessible and knowledgeable. Communication is good. Need a bit more structure but this is a company that is going places and working towards a bright future."}, {"title": "Advisor working in store", "text": "Pros a lot of lovely people works here and they are always a big help if you struggle with something and the atmosphere at work is very friendly, good job if you're looking for experience in finance Cons you will be required to do leafleting and cleaning (in store work only) - as long as you OK with it, it's not a big issue Advice to Management putting more attention to training programmes for all staff in retail and head office - but as far as I know they already working on it", "rating": 5, "pros": "a lot of lovely people works here and they are always a big help if you struggle with something and the atmosphere at work is very friendly, good job if you're looking for experience in finance", "cons": "you will be required to do leafleting and cleaning (in store work only) - as long as you OK with it, it's not a big issue", "advice": "putting more attention to training programmes for all staff in retail and head office - but as far as I know they already working on it"}, {"title": "Its going places", "text": "Pros The company growth over the last year has been a huge positive. Getting rid of top management who were not suitable-definitely needed. For those who want experience in finance its a great stepping stone. There are some great people that work for Oakam and that keep the buzz and energy going-you will know when you meet them!! Cons Communication could be better-especially to retail. Progression for the midlands stores is very limited with offices based in London. Perception of the sector in the media can put people off a great company. No incentives for Retail Managers. Advice to Management Involve Store Managers more and encourage midlands employees to go for job vacancies by making them open for location", "rating": 5, "pros": "The company growth over the last year has been a huge positive. Getting rid of top management who were not suitable-definitely needed. For those who want experience in finance its a great stepping stone. There are some great people that work for Oakam and that keep the buzz and energy going-you will know when you meet them!!", "cons": "Communication could be better-especially to retail.", "advice": "Involve Store Managers more and encourage midlands employees to go for job vacancies by making them open for location"}, {"title": "Ups and downs", "text": "Pros Progression into new roles seems easy however it takes a lot of passion and an \"I can do it\" attitude. Cons The Company does not pay bonuses, only gives some incentives every now and then. Sick days are unpaid. There is no motivation in that regards.", "rating": 3, "pros": "Progression into new roles seems easy however it takes a lot of passion and an \"I can do it\" attitude.", "cons": "The Company does not pay bonuses, only gives some incentives every now and then. Sick days are unpaid. There is no motivation in that regards.", "advice": null}, {"title": "Great company with high growth potential", "text": "Pros A fast-moving environment, lots of interesting project, great people and culture. Growth potential is very high and there is very high energy and excitement for the future Cons Resources are at times tight for all the projects that are in the pipeline. Some good hiring has been done recently and hopefully there's more to come", "rating": 5, "pros": "A fast-moving environment, lots of interesting project, great people and culture. Growth potential is very high and there is very high energy and excitement for the future", "cons": "Resources are at times tight for all the projects that are in the pipeline. Some good hiring has been done recently and hopefully there's more to come", "advice": null}, {"title": "An example of how much a bunch of commited people can actually change the world", "text": "Pros It is nice to work at a place where, no matter what your role is, you know that what you do is helping to provide opportunities for people who otherwise wouldn't get one. From an employee perspective, it is a great environment, opportunities to learn and get promoted and there is a lot of perks to keep us happy. The company has high ambitions for growth and everyone is pretty excited about it. Cons Some people still slacking off a bit. More extensive training would really help. Salaries could be a bit higher.", "rating": 5, "pros": "It is nice to work at a place where, no matter what your role is, you know that what you do is helping to provide opportunities for people who otherwise wouldn't get one.", "cons": "Some people still slacking off a bit. More extensive training would really help. Salaries could be a bit higher.", "advice": null}, {"title": "Strong leadership team, great environment", "text": "Pros - Really good culture internally, most people are nice, easy to work with, approachable and committed - Very nice office space - New leadership team in place willing to build better products for customers and make it a better place for employees Cons - Some teams are ahead than others in the transition - Benefits could be better Advice to Management - Better include the stores in overall strategy", "rating": 5, "pros": "- Really good culture internally, most people are nice, easy to work with, approachable and committed", "cons": "- Some teams are ahead than others in the transition", "advice": "- Better include the stores in overall strategy"}, {"title": "Going Places", "text": "Pros Great, forward thinking company that has set it's sights on becoming a market leader in its field. The opportunities that will be presented to every member of the team to grow and progress will be huge. Cons At the present size of the company it is sometimes hard to know what is happening in the other parts of the business. As we grow, we need better communication to ensure we all know what is going on. Advice to Management Continue to strive for future growth as this helps every employee to have the opportunity to progress in their career.", "rating": 5, "pros": "Great, forward thinking company that has set it's sights on becoming a market leader in its field. The opportunities that will be presented to every member of the team to grow and progress will be huge.", "cons": "At the present size of the company it is sometimes hard to know what is happening in the other parts of the business. As we grow, we need better communication to ensure we all know what is going on.", "advice": "Continue to strive for future growth as this helps every employee to have the opportunity to progress in their career."}, {"title": "Great company to work for. With great tech potential!", "text": "Pros - The people are great to work with - There's an open culture for sharing ideas and improvements - There's the opportunity to grow the business significantly - You can develop your career working with great people - Technology focus and investment Cons - They are still a small business growing, so processes and approaches are still being worked out.", "rating": 5, "pros": "- The people are great to work with", "cons": "- They are still a small business growing, so processes and approaches are still being worked out.", "advice": null}, {"title": "Going places", "text": "Pros Skilled and friendly team, ambitious company goals and vision, senior leaders full backing and support to achieve our targets Cons Perception of the sector in the media can put people off a great company Advice to Management Continue building out the teams to support the growth ambitions of the business, replace some of our systems to support that growth", "rating": 5, "pros": "Skilled and friendly team, ambitious company goals and vision, senior leaders full backing and support to achieve our targets", "cons": "Perception of the sector in the media can put people off a great company", "advice": "Continue building out the teams to support the growth ambitions of the business, replace some of our systems to support that growth"}, {"title": "A diverse workplace with good career progression", "text": "Pros great diverse team. exciting business to be a part of. committed to helping customers and offering career opportunities. has an ambitious growth strategy Cons This is not a company for those who want a 9-5 job -- for those who really want to commit to job and career.", "rating": 5, "pros": "great diverse team. exciting business to be a part of. committed to helping customers and offering career opportunities. has an ambitious growth strategy", "cons": "This is not a company for those who want a 9-5 job -- for those who really want to commit to job and career.", "advice": null}, {"title": "Good short term experience", "text": "Pros Some really great staff, great place to get some good experience if you are just out of university or are from outside the UK - allows you a foot in the door which often leads to better things. Cons Huge burn out factor, not enough reward, staff turnover is demotivating. Advice to Management Treat people better, give as much as you take,give people the tools they need to get on with it,, constructive criticism should come with constructive praise", "rating": 3, "pros": "Some really great staff, great place to get some good experience if you are just out of university or are from outside the UK - allows you a foot in the door which often leads to better things.", "cons": "Huge burn out factor, not enough reward, staff turnover is demotivating.", "advice": "Treat people better, give as much as you take,give people the tools they need to get on with it,, constructive criticism should come with constructive praise"}, {"title": "Good Place to Start", "text": "Pros Good place to start Cons They dont look after the staff", "rating": 3, "pros": "Good place to start", "cons": "They dont look after the staff", "advice": null}, {"title": "I was feeling and treat me without respect and worst company.", "text": "Pros Is good to improve your English professional and do some financial experience Cons They will find a reason to treat you like a no one. Like a rubbish. They doesn.t know what that means confidential, start from CEO to head office employed to the store employed. Advice to Management They have to close this company, FCA have to know what happen there.", "rating": 1, "pros": "Is good to improve your English professional and do some financial experience", "cons": "They will find a reason to treat you like a no one. Like a rubbish. They doesn.t know what that means confidential, start from CEO to head office employed to the store employed.", "advice": "They have to close this company, FCA have to know what happen there."}, {"title": "No Confidentiality", "text": "Pros Good company to start off for work experiences Cons Be careful of sharing information with HR or managers as there are no confidentiality in this company. Their method of getting rid of you is their constant disciplinary meetings which is frequent. Too many preferences and favourites. To received promotion, you have to be best friends with management Advice to Management You are all bringing down this company with your gossiping and bias work ethics", "rating": 3, "pros": "Good company to start off for work experiences", "cons": "Be careful of sharing information with HR or managers as there are no confidentiality in this company. Their method of getting rid of you is their constant disciplinary meetings which is frequent. Too many preferences and favourites. To received promotion, you have to be best friends with management", "advice": "You are all bringing down this company with your gossiping and bias work ethics"}, {"title": "Well worth it for the time being", "text": "Pros Time at Oakam was quite interesting. I loved the story behind the business, loved the success they achieved & was excited to be part of the success. Company values were great initially.... Cons Change in managment made it look like the business because more profit concious and let go over 90% of its start off staff. Sad to here its not the same place i used to know", "rating": 3, "pros": "Time at Oakam was quite interesting. I loved the story behind the business, loved the success they achieved & was excited to be part of the success. Company values were great initially....", "cons": "Change in managment made it look like the business because more profit concious and let go over 90% of its start off staff. Sad to here its not the same place i used to know", "advice": null}, {"title": "Oakam", "text": "Pros Great staff. Really good people to work with in my experience. Cons Company has an unclear marketing plan meaning the bulk of new business generation does fall on individual stores to manage. This is a problem as the company is extremely target orientated. Advice to Management Have a clear and effective central marketing plan that allows stores to focus on customer service.", "rating": 5, "pros": "Great staff. Really good people to work with in my experience.", "cons": "Company has an unclear marketing plan meaning the bulk of new business generation does fall on individual stores to manage. This is a problem as the company is extremely target orientated.", "advice": "Have a clear and effective central marketing plan that allows stores to focus on customer service."}, {"title": "OK in the short term", "text": "Pros some great people to work with Cons Non exsistant bonuses, incoherant structure, constantly shifting requirements and general culture of blame", "rating": 1, "pros": "some great people to work with", "cons": "Non exsistant bonuses, incoherant structure, constantly shifting requirements and general culture of blame", "advice": null}, {"title": "Advisor", "text": "Pros You have a lot of innovative products you can sell to customers which make it very interesting Cons You have to work Long hours, rigid work schedules and you have to clean up the office.", "rating": 3, "pros": "You have a lot of innovative products you can sell to customers which make it very interesting", "cons": "You have to work Long hours, rigid work schedules and you have to clean up the office.", "advice": null}, {"title": "ok to begin with", "text": "Pros Good place to start career and figure out what you want to do Cons lack of focus on employee Advice to Management Start thinking long term", "rating": 3, "pros": "Good place to start career and figure out what you want to do", "cons": "lack of focus on employee", "advice": "Start thinking long term"}]