[{"title": "Operations", "text": "Pros Great team Opportunities for growth No overtime Cons Repetitive work Provided hardware is outdated, and often has illegally download software on it Low salary", "rating": 5, "pros": "Great team", "cons": "Repetitive work", "advice": null}, {"title": "Biz Dev", "text": "Pros Great team Great culture Fun experience where I learnt alot Cons There were no cons that I could think of", "rating": 5, "pros": "Great team", "cons": "There were no cons that I could think of", "advice": null}, {"title": "Good job if you want to work in a great team", "text": "Pros Supportive and nice colleagues, great team spirit also after the merge with Sumup. Interesting challenges, lots of responsibility. Cons It's still a young company with a mix of experienced and not so experienced employees. Sometimes things can get a little chaotic. Documentation could be better. Advice to Management I think you are on a good track, listening to feedback from your employees.", "rating": 5, "pros": "Supportive and nice colleagues, great team spirit also after the merge with Sumup. Interesting challenges, lots of responsibility.", "cons": "It's still a young company with a mix of experienced and not so experienced employees. Sometimes things can get a little chaotic. Documentation could be better.", "advice": "I think you are on a good track, listening to feedback from your employees."}, {"title": "Good people", "text": "Pros independence in work on projects Cons very low salary is offered Advice to Management No advice", "rating": 3, "pros": "independence in work on projects", "cons": "very low salary is offered", "advice": "No advice"}, {"title": "Fintech Startup Berlin", "text": "Pros Good team of hard working people striving for an improved and updated product. Cons Company states they are not hierarchical however upper management struggle with this", "rating": 3, "pros": "Good team of hard working people striving for an improved and updated product.", "cons": "Company states they are not hierarchical however upper management struggle with this", "advice": null}, {"title": "Business Development Manager", "text": "Pros - Responsibilities - Independence - Great Team Cons - Not fully organized and sometimes lacks of cross country strategy Advice to Management Improve the processes", "rating": 5, "pros": "- Responsibilities", "cons": "- Not fully organized and sometimes lacks of cross country strategy", "advice": "Improve the processes"}, {"title": "Totally unorganized company but nice people", "text": "Pros Most of the people you work with are nice and easy going. Very often they become friends that you are still in touch with even when not working anymore together. Cons Huge lack of communication. Departments that should cooperate seem to try to obstruct each other quite often. Management has not enough experience in leading a team. No promotion or bonuses even when the company/team achieve big goals thanks to great employee's efforts. Extra hours are given for granted, not paid and requested almost on a daily basis. No balance between \"nothing to do days\" and days where you have to finish tasks in a few hours (Note: this is not the right company for people that has no problem solving skills or can't handle stress really well). Due to the working conditions people turnover is unbelievable: you work with other people every 3/6 months. Advice to Management There should be more planning and then small changes to these plan. The efforts and experience of the employees should be valued more through motivation and bonuses. The company should take also into consideration the needs an employee has in his private life.", "rating": 3, "pros": "Most of the people you work with are nice and easy going. Very often they become friends that you are still in touch with even when not working anymore together.", "cons": "Huge lack of communication. Departments that should cooperate seem to try to obstruct each other quite often. Management has not enough experience in leading a team. No promotion or bonuses even when the company/team achieve big goals thanks to great employee's efforts. Extra hours are given for granted, not paid and requested almost on a daily basis. No balance between \"nothing to do days\" and days where you have to finish tasks in a few hours (Note: this is not the right company for people that has no problem solving skills or can't handle stress really well). Due to the working conditions people turnover is unbelievable: you work with other people every 3/6 months.", "advice": "There should be more planning and then small changes to these plan. The efforts and experience of the employees should be valued more through motivation and bonuses. The company should take also into consideration the needs an employee has in his private life."}, {"title": "Great place to work!", "text": "Pros - Great colleagues - Open-minded working atmosphere - Opportunity to change things - Lovely benefits Cons - Work-Life-Balance is not ideal", "rating": 5, "pros": "- Great colleagues", "cons": "- Work-Life-Balance is not ideal", "advice": null}, {"title": "run for your life", "text": "Pros there isn't anything good about it Cons all of you can think of Advice to Management Get qualify. they relay on empirical skill that they don't have", "rating": 1, "pros": "there isn't anything good about it", "cons": "all of you can think of", "advice": "Get qualify. they relay on empirical skill that they don't have"}, {"title": "The worst company I've ever worked for", "text": "Pros The company is small enough that you are not tied to your role too much. Mostly nice people to work with. Office is in a nice part of town with good places to eat. Cons Awful middle management. There is are HR (over 25). No benefits. Pay is terrible. Laughable infrastructure that prevents most people doing a good job of anything. Advice to Management Hire an HR manager, respect employees, pay them.", "rating": 1, "pros": "The company is small enough that you are not tied to your role too much. Mostly nice people to work with. Office is in a nice part of town with good places to eat.", "cons": "Awful middle management. There is are HR (over 25). No benefits. Pay is terrible. Laughable infrastructure that prevents most people doing a good job of anything.", "advice": "Hire an HR manager, respect employees, pay them."}, {"title": "Lots of responsibility, but for a price", "text": "Pros You get a lot of responsibility if you work hard and show that you know what you're talking about. Most of the team is awesome and tight-knit. I have seen a lot of effort by the Managing Directors and Senior Management to improve employee morale and it seems to be slowly taking on. Cons You won't see a lot of career development if you leave on time every day, some overtime is expected. Some managers don't know how to lead and screw up their team. I agree with the other commentor about the coffee - I stopped drinking it. Advice to Management Show the managers how to manage a team and hold them accountable for employee happiness in their department, or the employees will leave.", "rating": 5, "pros": "You get a lot of responsibility if you work hard and show that you know what you're talking about.", "cons": "You won't see a lot of career development if you leave on time every day, some overtime is expected.", "advice": "Show the managers how to manage a team and hold them accountable for employee happiness in their department, or the employees will leave."}, {"title": "Great environment and opportunity to grow", "text": "Pros - great team spirit - many challenges so I can learn new things and improve my skills - colleagues from all over the world so you canNOT get bored ever - opportunity to give ideas, to be listened and to try new approaches - nice people that can keep the energy up even in busy times - the office in Berlin is in a great place, close to the U and the S-Bahn, and with many restaurants and parks nearby. - fruits, milk, coffee, cool kitchen and happy hours on Friday Cons - the coffee is not that good - every team need to work on cleaning the kitchen once in a while as they call it \"kitchen duty\" - not many meeting rooms, so we have many meetings in the kitchen - we cannot use Spotify with the company internet because it is blocked :o Advice to Management It would be nice if the company could pay courses, events and books to help employee to improve their skills :)", "rating": 5, "pros": "- great team spirit", "cons": "- the coffee is not that good", "advice": "It would be nice if the company could pay courses, events and books to help employee to improve their skills :)"}, {"title": "There is room for improvement", "text": "Pros The people are great and it is fun working with people from other departments. payleven provides a very interactive setting where most projects involve several departments which makes your day interesting due to meetings with others. Cons The management is not attentive to your needs, the compensation is low and the expectations definitely exceed compensation. The amount of people coming and going is way above average. Advice to Management Pay more, be more flexible, show that you care and keep your employees happy.", "rating": 1, "pros": "The people are great and it is fun working with people from other departments. payleven provides a very interactive setting where most projects involve several departments which makes your day interesting due to meetings with others.", "cons": "The management is not attentive to your needs, the compensation is low and the expectations definitely exceed compensation. The amount of people coming and going is way above average.", "advice": "Pay more, be more flexible, show that you care and keep your employees happy."}, {"title": "Dont bother", "text": "Pros Great place to learn about how not to manage people or run a business. Excellent lesson to be learned for anyone. Some of the staff are ok to work with. Cons Bullying and politics are the norm here. Very little possibility of promotion - though don't worry about that because as soon as you realize how bad it is you'll quit like anyone else with ambition has. Advice to Management What can you say to people who have let their company culture and people management fall so far? What can be learned by such people?", "rating": 1, "pros": "Great place to learn about how not to manage people or run a business. Excellent lesson to be learned for anyone.", "cons": "Bullying and politics are the norm here. Very little possibility of promotion - though don't worry about that because as soon as you realize how bad it is you'll quit like anyone else with ambition has.", "advice": "What can you say to people who have let their company culture and people management fall so far? What can be learned by such people?"}, {"title": "Internship Rocket Internet/payleven", "text": "Pros Co-founders and management made of high flying individuals with great learning possibilities Freedom to work on various projects across borders Involved in key decision making from day 1 as an intern Cons Long hours and wage could be more competitive", "rating": 5, "pros": "Co-founders and management made of high flying individuals with great learning possibilities", "cons": "Long hours and wage could be more competitive", "advice": null}, {"title": "forward thinking aggressive company", "text": "Pros The company has a very aggressive working environment but is very innovative and fast moving. time off policies promotions fun environment Cons The aggressive working environment can lead to high levels of stress especially if targets aren't met. leadership compensation company values stress", "rating": 3, "pros": "The company has a very aggressive working environment but is very innovative and fast moving.", "cons": "The aggressive working environment can lead to high levels of stress especially if targets aren't met.", "advice": null}, {"title": "Tolles Praktikum - Viel gelernt", "text": "Pros - Steile Lernkurve - Interessante Kollegen - Gute Atmosphäre - Faire Arbeitszeiten - Pizza jeden Freitag Cons - Wenig Struktur (da startup) - Bedingte Karrieremöglichkeiten", "rating": 5, "pros": "- Steile Lernkurve", "cons": "- Wenig Struktur (da startup)", "advice": null}, {"title": "Super Kollegen, viel zu tun, viel Verantwortung", "text": "Pros Junge Teams mit klaren Visionen und \"continously improving\" - was wirklich gelebt wird. Die Kommunikation zwischen den Abteilungen ist mittlerweile auf einen guten Stand. So können auch komplexe Projekte gestämmt werden. Kollegen sind allgemein sehr hilfsbereit und es gibt viele Möglichkeiten Wissen über die Branche aufzubauen und so zum Experten zu werden. Cons Es gibt natürlich noch viel zu verbessern, da einige Prozesse noch nicht existieren oder noch nicht ideal sind. Das spürt man dann, wenn man es manuell ausbaden darf. Advice to Management Weiter so! Das Management Team wächst immer weiter zusammen und so ist es einfacher zu wissen, wie grobe strategische Ziele auf die einzelnen Funktionen runterzubrechen sind.", "rating": 5, "pros": "Junge Teams mit klaren Visionen und \"continously improving\" - was wirklich gelebt wird. Die Kommunikation zwischen den Abteilungen ist mittlerweile auf einen guten Stand. So können auch komplexe Projekte gestämmt werden. Kollegen sind allgemein sehr hilfsbereit und es gibt viele Möglichkeiten Wissen über die Branche aufzubauen und so zum Experten zu werden.", "cons": "Es gibt natürlich noch viel zu verbessern, da einige Prozesse noch nicht existieren oder noch nicht ideal sind. Das spürt man dann, wenn man es manuell ausbaden darf.", "advice": "Weiter so! Das Management Team wächst immer weiter zusammen und so ist es einfacher zu wissen, wie grobe strategische Ziele auf die einzelnen Funktionen runterzubrechen sind."}, {"title": "Jung und energiegeladen, aber schrecklich unreif", "text": "Pros Man lernt schnell vieles über den finanziellen Sektor und den eigenen Geschäftsbereich. Eine Menge Verantwortung kommt auf einen zu. Man muss die Lecks stopfen und gleichzeitig Verbesserungen anregen. Sehr nette Kollegen. Feste feiern wie sie fallen. Sehr gut für Praktikanten und Anfänger, um eine Menge Erfahrungen zu sammeln. You'll learn fast about financial domain and your business area. A lot of responsibility if you're up to. You have to fix what's broken and step up to improve. Very nice colleagues. Party once in a time. Very good for interns and juniors to get a lot of experience. Cons Manche Leute arbeiten für zwei. Jüngere Führungskräfte sind unfähig zu führen und Mitarbeiter zu motivieren und verrennen sich oft in Projekten. Keine Balance zwischen Arbeit- und Privatleben, Überstunden werden als selbstverständlich angesehen. Karge Räumlichkeiten, keine Extraleistungen. Schlechte Kommunikation, zu viel Kontrolle. Mitarbeiterfluktuation wie in einem Fastfood-Restaurant. Some people do work of two. Young management uncapable of leading and motivating people, often lost in projects. No work/life balance, overtimes taken as granted. Spare office without any benefits. Very weak communication, too much control. Employee turnaround like in fast-food. Advice to Management Zuhören, mehr kommunizieren, Angestellte merken lassen, dass sie nicht egal sind, nicht nur leere Reden schwingen. Nicht auf Kosten der Praktikanten leben. Listen to people, communicate more, let employees know you care about them, not just words. Do not survive on interns.", "rating": 3, "pros": "Man lernt schnell vieles über den finanziellen Sektor und den eigenen Geschäftsbereich.", "cons": "Manche Leute arbeiten für zwei. Jüngere Führungskräfte sind unfähig zu führen und Mitarbeiter zu motivieren und verrennen sich oft in Projekten. Keine Balance zwischen Arbeit- und Privatleben, Überstunden werden als selbstverständlich angesehen. Karge Räumlichkeiten, keine Extraleistungen. Schlechte Kommunikation, zu viel Kontrolle. Mitarbeiterfluktuation wie in einem Fastfood-Restaurant.", "advice": "Zuhören, mehr kommunizieren, Angestellte merken lassen, dass sie nicht egal sind, nicht nur leere Reden schwingen. Nicht auf Kosten der Praktikanten leben."}]