[{"title": "One of the best employers in the area", "text": "Pros culture, duties, creativity, flexibility, teamevents, Unu scooters, Office, flat hierarchy, people! Cons apart from the workload, there is nothing negative. I think you can expect that, when you are applying to a startup", "rating": 5, "pros": "culture, duties, creativity, flexibility, teamevents, Unu scooters, Office, flat hierarchy, people!", "cons": "apart from the workload, there is nothing negative. I think you can expect that, when you are applying to a startup", "advice": null}, {"title": "Awful Management", "text": "Pros good place in munich and nice office Cons management is too weak tho Advice to Management if you want to build the best hr-software-company, you should manage your employees stronger", "rating": 1, "pros": "good place in munich and nice office", "cons": "management is too weak tho", "advice": "if you want to build the best hr-software-company, you should manage your employees stronger"}, {"title": "Ambitious and fun startup with typical \"teething\" problems", "text": "Pros - Great atmosphere with beautiful office in the heart of Munich and awesome colleagues to work towards a common goal or enjoy a beer or two with - Many opportunities to take on responsibility from day one and develop within and beyond the role - Various company and team events, free gym and free German courses for internationals Cons - Typical startup challenges with fast growth, lack of processes and inexperienced decision making (however, willing to learn and constantly improve)", "rating": 5, "pros": "- Great atmosphere with beautiful office in the heart of Munich and awesome colleagues to work towards a common goal or enjoy a beer or two with", "cons": "- Typical startup challenges with fast growth, lack of processes and inexperienced decision making (however, willing to learn and constantly improve)", "advice": null}, {"title": "Spannendes Unternehmen mit netten Kollegen", "text": "Pros interessante Aufgaben, flache Hierachien, tolles office, cooles team Cons viele Dinge noch im Wandel, teilweise sehr hohe Ansprüche an Arbeitsergebnisse", "rating": 5, "pros": "interessante Aufgaben, flache Hierachien, tolles office, cooles team", "cons": "viele Dinge noch im Wandel, teilweise sehr hohe Ansprüche an Arbeitsergebnisse", "advice": null}, {"title": "Tolles Unternehmen mit tollen Kollegen", "text": "Pros -viele Möglichkeiten sich zu entwickeln -tolles Team, man freut sich morgens in die Arbeit zu kommen -gute Feedback-Kultur Cons Mir fallen keine Kontras ein!", "rating": 5, "pros": "-viele Möglichkeiten sich zu entwickeln", "cons": "Mir fallen keine Kontras ein!", "advice": null}, {"title": "Klasse Arbeitsumfeld", "text": "Pros kleines, nettes Team, motivierte Leute.So wie man sich ein Startup vorstellt. Cons Es fehlt nich ein bisschen an Prozessen und Struktur.", "rating": 5, "pros": "kleines, nettes Team, motivierte Leute.So wie man sich ein Startup vorstellt.", "cons": "Es fehlt nich ein bisschen an Prozessen und Struktur.", "advice": null}]