[{"title": "Great experience, wages for dishwasher is good", "text": "Pros Wages, available of hours, friendly coworkers,ali is nice to work for Cons Not same schedule, no benefits, sometimes i don't get enough hours, and sometimes I work harder than other employees, and don't get enough help. Advice to Management Please in the kitchen area and dishwashing area if you could make sure we are fully staffed it would be nice. Ali is nice to work for, but if you could be more fair with hours it would be nice, sometimes I don't get enough hours, but i like the job, and coworkers, I met Matt and my girlfriend Braily here!!", "rating": 5, "pros": "Wages, available of hours, friendly coworkers,ali is nice to work for", "cons": "Not same schedule, no benefits, sometimes i don't get enough hours, and sometimes I work harder than other employees, and don't get enough help.", "advice": "Please in the kitchen area and dishwashing area if you could make sure we are fully staffed it would be nice. Ali is nice to work for, but if you could be more fair with hours it would be nice, sometimes I don't get enough hours, but i like the job, and coworkers, I met Matt and my girlfriend Braily here!!"}, {"title": "Stressed", "text": "Pros From the basic premise of a need to change, to using agile methods for design and feedback, to rolling it all out. They really are walking the talk when it comes to how best to provide feedback in a fast-moving, social environment. While the outside debate rages on about the value of performance management systems, IBM has done something about it, and has spent time listening Cons We'll wait to see how well managers can incorporate this. Any performance review and coaching system is only as good as the managers who implement it. But the basics are all there for them to use. Advice to Management Keep up the design, feedback, adjust, and adapt methodology.", "rating": 5, "pros": "From the basic premise of a need to change, to using agile methods for design and feedback, to rolling it all out. They really are walking the talk when it comes to how best to provide feedback in a fast-moving, social environment. While the outside debate rages on about the value of performance management systems, IBM has done something about it, and has spent time listening", "cons": "We'll wait to see how well managers can incorporate this. Any performance review and coaching system is only as good as the managers who implement it. But the basics are all there for them to use.", "advice": "Keep up the design, feedback, adjust, and adapt methodology."}, {"title": "God Help Them!", "text": "Pros Easy to get hired at this company. Cons They say one thing and do another. Advice to Management Respect your employees because you can't get by without them and there may not always be another warm body walking thru the door to replace them.", "rating": 3, "pros": "Easy to get hired at this company.", "cons": "They say one thing and do another.", "advice": "Respect your employees because you can't get by without them and there may not always be another warm body walking thru the door to replace them."}, {"title": "Very positive", "text": "Pros Total culture condusive to success. Cons Some ineptitude at top management levels. Advice to Management Lighten up!", "rating": 5, "pros": "Total culture condusive to success.", "cons": "Some ineptitude at top management levels.", "advice": "Lighten up!"}]