[{"title": "Poor leadership", "text": "Pros I worked as part of the tech team. These guys are great. The are committed, efficient and open-minded. They care about the software, architecture and all around the codebase. One of the best team I used to work with. You can learn a lot from them. Cons Unfortunately the management is not able to use the team right, their diagnosis and recognition of current state of the business is incorrect and somehow waterproof for the arguments. Their are fixed on the same single product and are unable to channel employees efforts into the right direction. Communication of vision, goals and rationale is poor. The startup spirit understood as place for the hard work and \"crazy\" discussions is not present at Roq.ad. Advice to Management Care about your team.", "rating": 3, "pros": "I worked as part of the tech team. These guys are great. The are committed, efficient and open-minded. They care about the software, architecture and all around the codebase. One of the best team I used to work with.", "cons": "Unfortunately the management is not able to use the team right, their diagnosis and recognition of current state of the business is incorrect and somehow waterproof for the arguments.", "advice": "Care about your team."}, {"title": "Sales", "text": "Pros Most of people are friendly Cons CEO & CTO are unfair. They don't care about employees. Narrow minded. They are focused on their ideas and don't listen others. Work/Life Balance doesn't exist there. It's just work. Advice to Management Remember that people are value of the company, not you.", "rating": 1, "pros": "Most of people are friendly", "cons": "CEO & CTO are unfair. They don't care about employees.", "advice": "Remember that people are value of the company, not you."}, {"title": "Sales", "text": "Pros -Cool company with innovative product -Great people -Nice office with food and drinks Cons -CEO micromanages everything which hinders productivity -Pays interns poorly but expect an Olympic performance -Office is awkwardly quiet Advice to Management Have CEO focus on generating revenue and let employees do what they need to do.", "rating": 3, "pros": "-Cool company with innovative product", "cons": "-CEO micromanages everything which hinders productivity", "advice": "Have CEO focus on generating revenue and let employees do what they need to do."}, {"title": "Junges Star Up mit Optimierungspotential", "text": "Pros professionelles und angenehmes Team breite Entwicklungsmöglichkeiten hohe Lernkurve fancy Office in Berlin-Kreuzberg gutes Gehalt und Benefits wie Sprachkurse, Hardware, Drinks und Früchte aufs Haus witzige Teamveranstaltungen Cons Management neigt ab and an zum Micromanagement etwas mehr Support wäre schön Advice to Management Glückliche Mitarbeiter sind gute Mitarbeiter, d.h. Vertrauen, Support und konstruktives Feedback ist der Schlüssel zum Erfolg!", "rating": 5, "pros": "professionelles und angenehmes Team", "cons": "Management neigt ab and an zum Micromanagement", "advice": "Glückliche Mitarbeiter sind gute Mitarbeiter, d.h. Vertrauen, Support und konstruktives Feedback ist der Schlüssel zum Erfolg!"}]