[{"title": "Good firm", "text": "Pros Like most investment firms, your experience will vary greatly depending on your department, manager, office location, etc. I work out of the New York City office in a professional level, middle office position. Schroders’ greatest strength is in the people it hires - overall very professional and diverse. It’s a good brand with a deep heritage; highly regarded in the industry; though not yet well known in the states. The new NYC office is thoughtfully designed and beautiful. Excellent vacation policy, very generous 401k plan, health benefits are fair. Compensation is fair from my perspective. Work/life balance is possible, but will vary greatly depending position/department. I hope to be here long-term, depending on future opportunities. Overall a really good firm with a positive outlook. Cons The flat structure has benefits, but often blurs a clear career path. There are opportunities but one needs to be self-motivated to succeed/move forward here. Communication from middle management could be improved. Advice to Management Reward your best talent. Communicate decision more clearly.", "rating": 5, "pros": "Like most investment firms, your experience will vary greatly depending on your department, manager, office location, etc. I work out of the New York City office in a professional level, middle office position. Schroders’ greatest strength is in the people it hires - overall very professional and diverse. It’s a good brand with a deep heritage; highly regarded in the industry; though not yet well known in the states. The new NYC office is thoughtfully designed and beautiful. Excellent vacation policy, very generous 401k plan, health benefits are fair. Compensation is fair from my perspective. Work/life balance is possible, but will vary greatly depending position/department. I hope to be here long-term, depending on future opportunities. Overall a really good firm with a positive outlook.", "cons": "The flat structure has benefits, but often blurs a clear career path. There are opportunities but one needs to be self-motivated to succeed/move forward here. Communication from middle management could be improved.", "advice": "Reward your best talent. Communicate decision more clearly."}, {"title": "Internal wholesaler", "text": "Pros Senior management cares about your career development Cons They don't always attract the best talent Advice to Management Hire quality people who share the company's long term values", "rating": 5, "pros": "Senior management cares about your career development", "cons": "They don't always attract the best talent", "advice": "Hire quality people who share the company's long term values"}, {"title": "Distribution", "text": "Pros Great pedigree, talented people and good work environment with work life balance. Cons Career development. Can be bureaucratic resulting in slow decision making. Advice to Management Spend more on talent management and challenging your top performers.", "rating": 5, "pros": "Great pedigree, talented people and good work environment with work life balance.", "cons": "Career development. Can be bureaucratic resulting in slow decision making.", "advice": "Spend more on talent management and challenging your top performers."}, {"title": "Product specialist", "text": "Pros Great benefits and people . Good work life balance and the hours you work are not bad. Cons Average age is quite high and there aren't many young people . This makes the overall environment and strategies a bit out of date . Advice to Management Hire graduate entry level students", "rating": 5, "pros": "Great benefits and people . Good work life balance and the hours you work are not bad.", "cons": "Average age is quite high and there aren't many young people . This makes the overall environment and strategies a bit out of date .", "advice": "Hire graduate entry level students"}, {"title": "Growing compant", "text": "Pros Competitive salaries but not enough opportunities to grow and develop. Cons Too many changes in senior management", "rating": 3, "pros": "Competitive salaries but not enough opportunities to grow and develop.", "cons": "Too many changes in senior management", "advice": null}, {"title": "Good work/life balance. Laid-back culture.", "text": "Pros Very laid-back culture compared to competing firms. Most people are friendly and the hours are reasonable. Great vacation policy and salaries and bonuses are fair although probably less than many competing firms. Some of the work is satisfying. Cons There's a lack of technology and career advancement opportunities in the NYC office. There are opportunities to learn, but mostly through trial-and-error and figuring things out on your own. The lack of egos/competition is refreshing, but it's easy to become lazy here since there's a general lack of ambition in the culture. Advice to Management Keep up the good work, but please realize you will not retain your best employees if you don't keep them engaged and offer them opportunities to advance in their careers.", "rating": 5, "pros": "Very laid-back culture compared to competing firms. Most people are friendly and the hours are reasonable. Great vacation policy and salaries and bonuses are fair although probably less than many competing firms. Some of the work is satisfying.", "cons": "There's a lack of technology and career advancement opportunities in the NYC office. There are opportunities to learn, but mostly through trial-and-error and figuring things out on your own. The lack of egos/competition is refreshing, but it's easy to become lazy here since there's a general lack of ambition in the culture.", "advice": "Keep up the good work, but please realize you will not retain your best employees if you don't keep them engaged and offer them opportunities to advance in their careers."}, {"title": "Communications", "text": "Pros Pay was pretty decent and some of the people were nice. Cons After 3 short months my position \"was eliminated.\" Management has no idea what they are doing. Poor communications with employees. For e.g. my immediate manager totally ignored me for almost the whole time I was at the firm. Towards the end of the third month when she had to do my probationary review, she finally met with me to discuss my \"performance.\" What a joke. Asset Management folks are a bunch of snobs who think they are better than everyone. No career path and room for growth! Advice to Management Don't hire someone unless you have a clear idea of what they should be doing.", "rating": 1, "pros": "Pay was pretty decent and some of the people were nice.", "cons": "After 3 short months my position \"was eliminated.\" Management has no idea what they are doing. Poor communications with employees. For e.g. my immediate manager totally ignored me for almost the whole time I was at the firm. Towards the end of the third month when she had to do my probationary review, she finally met with me to discuss my \"performance.\" What a joke. Asset Management folks are a bunch of snobs who think they are better than everyone. No career path and room for growth!", "advice": "Don't hire someone unless you have a clear idea of what they should be doing."}, {"title": "Short skirts or Underlying Essex roots helps.", "text": "Pros Some genuine people here but are muscled out occasionally . Cons Too much corruption if your not part of the crowd. If your a threat you can be sabotaged. Advice to Management We know how you got there. ...", "rating": 3, "pros": "Some genuine people here but are muscled out occasionally .", "cons": "Too much corruption if your not part of the crowd.", "advice": "We know how you got there. ..."}, {"title": "Great place as financial companies go", "text": "Pros Great poeple, culture, and benefits Cons Like any financial firm there are long hours - a lot more reasonable than other big firms. Brits are always treated better than Americans Advice to Management Treat the Americans as equals", "rating": 5, "pros": "Great poeple, culture, and benefits", "cons": "Like any financial firm there are long hours - a lot more reasonable than other big firms. Brits are always treated better than Americans", "advice": "Treat the Americans as equals"}, {"title": "Fairly negative", "text": "Pros Good benefits. Grat location. Nice office. Nice employees Cons Bad compensation. No career path. No mentoring. Advice to Management Set career growth plans", "rating": 3, "pros": "Good benefits. Grat location. Nice office. Nice employees", "cons": "Bad compensation. No career path. No mentoring.", "advice": "Set career growth plans"}, {"title": "Good overall", "text": "Pros Good culture and work/life balance. Cons Pay could be higher, as people often go elsewhere in search of higher reward. Advice to Management Reward people to incentivise", "rating": 5, "pros": "Good culture and work/life balance.", "cons": "Pay could be higher, as people often go elsewhere in search of higher reward.", "advice": "Reward people to incentivise"}, {"title": "Global technology", "text": "Pros Exciting place for building out new technology and innovating. Really good remuneration and benefits. Working with some fantastic talent and good people on the coal face. Cons Pace of change requires hard graft with little respite. Tough/dictatorial management style in some quarters (but not everywhere), expected long hours the norm in Tech. To be fair is why remuneration and benefits are high and were honest about it prior to hiring. If you want slow and steady look elsewhere, if work is your priority and you want exposure to new things, work with talent, get things done, benefit from the experience, then look here. Advice to Management Continue the work on leadership, culture and values, coupled with adopting the new ways of working.", "rating": 3, "pros": "Exciting place for building out new technology and innovating. Really good remuneration and benefits. Working with some fantastic talent and good people on the coal face.", "cons": "Pace of change requires hard graft with little respite. Tough/dictatorial management style in some quarters (but not everywhere), expected long hours the norm in Tech. To be fair is why remuneration and benefits are high and were honest about it prior to hiring. If you want slow and steady look elsewhere, if work is your priority and you want exposure to new things, work with talent, get things done, benefit from the experience, then look here.", "advice": "Continue the work on leadership, culture and values, coupled with adopting the new ways of working."}, {"title": "Steady and stable", "text": "Pros The atmosphere is very stable and family like, many of the people I work with have been here for decades. There are also no apparent levels of hierarchy, which tends to mean everyone is equally nice to everyone else Cons Its a bit backward in technology. Most software is pretty old and basic, which makes it hard to do a lot of things. Downside of stability is that although its quite easy to cruise, its quite hard to be ambitious Advice to Management Maybe some new blood in the organisation, in places", "rating": 5, "pros": "The atmosphere is very stable and family like, many of the people I work with have been here for decades. There are also no apparent levels of hierarchy, which tends to mean everyone is equally nice to everyone else", "cons": "Its a bit backward in technology. Most software is pretty old and basic, which makes it hard to do a lot of things. Downside of stability is that although its quite easy to cruise, its quite hard to be ambitious", "advice": "Maybe some new blood in the organisation, in places"}, {"title": "It’s a good place trying to be great", "text": "Pros I can confidently share that it’s an office of great people. The company is in a good position but still wants to modernise and take advantage of growth opportunities. The CEO has an inspiring vision of the future and is taking demonstrable action to make it a reality Global projects have started to be driven from Singapore Cons Being 200 yrs old you will tend to have your fair share of legacy processes and challenges but there is a focus on making things better. Sometimes people can forget that the main competition and threats are external and we all need to pull together to achieve real success Advice to Management Personally embrace change, be vulnerable and create an environment where people can consistently grow and develop. Focus on encouraging the right behaviours and not just outcomes", "rating": 5, "pros": "I can confidently share that it’s an office of great people. The company is in a good position but still wants to modernise and take advantage of growth opportunities.", "cons": "Being 200 yrs old you will tend to have your fair share of legacy processes and challenges but there is a focus on making things better.", "advice": "Personally embrace change, be vulnerable and create an environment where people can consistently grow and develop."}, {"title": "Mix bag of experiences", "text": "Pros Some smart people Nice offices close to shops Canteen Cons High pace working environment No flexible working practices Long working hours Poor culture Advice to Management Get rid of bloated middle management tier. Introduce flexible working practices Focus on staff retention issues", "rating": 3, "pros": "Some smart people", "cons": "High pace working environment", "advice": "Get rid of bloated middle management tier."}, {"title": "Great company with great people", "text": "Pros - great people who are smart and collaborative - working environment is family like - signature leadership development programs and generally invests in employees - great benefits Cons - decision making process can be quicker Advice to Management - stronger engagement with employees and share more of the vision", "rating": 5, "pros": "- great people who are smart and collaborative", "cons": "- decision making process can be quicker", "advice": "- stronger engagement with employees and share more of the vision"}, {"title": "Trade Operations Specialist", "text": "Pros Great colleagues, opportunities to move within the company, qualifications mostly paid for Cons Too many mid-level managers who create no value. Extremely political hierarchy at manager level. Advice to Management If you're managing a manager... first and foremost, make sure they are managing their team properly! Seems to be a culture of stopping Team Leaders from managing and instead placing them in pointless meetings - let the higher level managers do that.", "rating": 3, "pros": "Great colleagues, opportunities to move within the company, qualifications mostly paid for", "cons": "Too many mid-level managers who create no value. Extremely political hierarchy at manager level.", "advice": "If you're managing a manager... first and foremost, make sure they are managing their team properly! Seems to be a culture of stopping Team Leaders from managing and instead placing them in pointless meetings - let the higher level managers do that."}, {"title": "Good company to work for", "text": "Pros Good size, Good location, Well placed Cons Central functions in London, Some functions are not great", "rating": 5, "pros": "Good size, Good location, Well placed", "cons": "Central functions in London, Some functions are not great", "advice": null}, {"title": "Opportunities to make an impact on the business", "text": "Pros - Flat organisation culture which gives you the opportunity to work and interact with senior people - Organisation is looking to increase the efficiency and effectiveness of its processes, which presents a great opportunity to be part of the change and make an impact on the business - The team that I am in is very friendly, patient and open to ideas - Opportunities to take up bigger roles/projects and challenge yourself Cons - Many changes going on which can contribute to busy days, but also encourage learning and innovation - Interactions with the hq could be more frequent to align processes and strategies", "rating": 5, "pros": "- Flat organisation culture which gives you the opportunity to work and interact with senior people", "cons": "- Many changes going on which can contribute to busy days, but also encourage learning and innovation", "advice": null}, {"title": "Schroders", "text": "Pros Friendly colleagues. Good Christmas parties Cons To many grads who are staying in the company forever Advice to Management Bring fresh ideas and expertise from outside", "rating": 5, "pros": "Friendly colleagues. Good Christmas parties", "cons": "To many grads who are staying in the company forever", "advice": "Bring fresh ideas and expertise from outside"}, {"title": "Honestly bad", "text": "Pros Nice Pantry, short working hours Cons bad culture, ignorant people, many don't seem to know much about much on subjects related roles e.g. What's happening in the market, law, regulations", "rating": 1, "pros": "Nice Pantry, short working hours", "cons": "bad culture, ignorant people, many don't seem to know much about much on subjects related roles e.g. What's happening in the market, law, regulations", "advice": null}, {"title": "Graduate opportunity", "text": "Pros Highly professional and results driven environment. Chances to move up in career are available. Great scheme for graduates. Cons Can be tiring- long days.", "rating": 5, "pros": "Highly professional and results driven environment. Chances to move up in career are available. Great scheme for graduates.", "cons": "Can be tiring- long days.", "advice": null}, {"title": "Nice people", "text": "Pros Nice sized asset manager with a good range of investment products. These are often supplemented with small product acquisitions. The flat structure means employees aren’t too distant from the CEO. Cons The levels of staff turnover are low so there is not much knowledge of working differently or changing working practices. Little flexible working is offered to employees so balancing two working parents with childcare/school may not be easy. Little pay increases in recent years. Advice to Management The flat hierarchy and nice culture are edges versus American companies. Remuneration could be more competitive", "rating": 5, "pros": "Nice sized asset manager with a good range of investment products. These are often supplemented with small product acquisitions. The flat structure means employees aren’t too distant from the CEO.", "cons": "The levels of staff turnover are low so there is not much knowledge of working differently or changing working practices. Little flexible working is offered to employees so balancing two working parents with childcare/school may not be easy. Little pay increases in recent years.", "advice": "The flat hierarchy and nice culture are edges versus American companies. Remuneration could be more competitive"}, {"title": "6 year career..", "text": "Pros a positive experience, went from temp to perm within months and progressed over years to Cons Management need to be changed...", "rating": 5, "pros": "a positive experience, went from temp to perm within months and progressed over years to", "cons": "Management need to be changed...", "advice": null}, {"title": "Intern", "text": "Pros Good Salary and nice colleagues Cons Tempory contract, the rest are fine", "rating": 5, "pros": "Good Salary and nice colleagues", "cons": "Tempory contract, the rest are fine", "advice": null}, {"title": "Not the best place", "text": "Pros Some departments have great people, unfortunately I don't work in those. Good office location. The name is ok. Some people are quite friendly Cons In my department there were a lot of politics, incompetent management tend to ignore problems and unethical behavior. It is very clear that they don't want to hear or know about the problems, and wanting to wait for them to go away by themselves. When there are unfavorable feedback or complains even from clients, a lot of excuses were made instead of really evaluating and reflecting on how they could have done better. It just surprises me how low caliber some people are in Schroders. If you are considering to work here seriously do some due diligence. You can tell from the reviews here some departments are fine and others are just a disaster. Many other places are more worthwhile to work for", "rating": 1, "pros": "Some departments have great people, unfortunately I don't work in those. Good office location. The name is ok. Some people are quite friendly", "cons": "In my department there were a lot of politics, incompetent management tend to ignore problems and unethical behavior.", "advice": null}, {"title": "Very good place to work", "text": "Pros Good atmosphere. Lots of highly skilled investors. Cons Can be very siloed. Advice to Management keep it up", "rating": 5, "pros": "Good atmosphere. Lots of highly skilled investors.", "cons": "Can be very siloed.", "advice": "keep it up"}, {"title": "Great company!", "text": "Pros Tons of heritage Great career development Cons Lower salaries than comps A bit slow", "rating": 5, "pros": "Tons of heritage", "cons": "Lower salaries than comps", "advice": null}, {"title": "Excellent,friendly and very busy work environment", "text": "Pros Solid employer with super credentials. Great team, nice people. The wide benefits are quite competitive in relation to pension contribution and healthcare services. Cons Limited leadership and unclear strategy. Not much opportunity for promotion The basic salary could be better and more effort could be made to keep experienced and skilled staff. Too complex IT systems leading to inefficiencies. Too little reward (compensation for work). Advice to Management Provide people with carrier development plans and control execution. Reduce power distance.", "rating": 5, "pros": "Solid employer with super credentials. Great team, nice people.", "cons": "Limited leadership and unclear strategy.", "advice": "Provide people with carrier development plans and control execution."}, {"title": "A collegiate company with smart folk", "text": "Pros Interesting products and discussions; friendly people; good pensions; change of culture for the better. Cons Slow moving; siloed teams; lack of turnover; diversity of thought. Advice to Management Keep up the effort on getting collaboration to become more natural, doing well!", "rating": 5, "pros": "Interesting products and discussions; friendly people; good pensions; change of culture for the better.", "cons": "Slow moving; siloed teams; lack of turnover; diversity of thought.", "advice": "Keep up the effort on getting collaboration to become more natural, doing well!"}, {"title": "Schroders is a friendly place to work but poor management", "text": "Pros Friendly environment Great work/life balance Cons Low pay Poor management - often overlooked Advice to Management Pay staff well and take an interest in their career development.", "rating": 3, "pros": "Friendly environment", "cons": "Low pay", "advice": "Pay staff well and take an interest in their career development."}, {"title": "IT Infrastructure To Be Avoided", "text": "Pros There are some talented and helpful people at Schroders in some departments. The benefits including pension and bonus structure is pretty good. Cons In particular IT infrastructure is not a pleasant place to work. The department has a bad reputation company wide. I was embarrassed to represent this team and thus my decision to leave. Some members of management at the highest level have openly admitted to enjoying seeing aggressive behaviour within the wider team as they feel it makes the team stronger. The management team although very capable are chosen from a cookie cutter. If you are not white or male do not expect to move up in this chaotic environment as the ideals of the top dog have been passed down to the next level to uphold. The department overall is one where if you speak your mind you will be belittled until you are fired or forced to quit. There is an extremely high staff turnover in IT Infrastructure. Advice to Management Schroders should not claim to support diversity and equality as this is simply not the case evident in the fact that there are little to no female management, no employees of LGBTQ orientation and a poor representation from those over the age of 50 or of different ethnic backgrounds other than white British.", "rating": 1, "pros": "There are some talented and helpful people at Schroders in some departments. The benefits including pension and bonus structure is pretty good.", "cons": "In particular IT infrastructure is not a pleasant place to work. The department has a bad reputation company wide. I was embarrassed to represent this team and thus my decision to leave. Some members of management at the highest level have openly admitted to enjoying seeing aggressive behaviour within the wider team as they feel it makes the team stronger. The management team although very capable are chosen from a cookie cutter. If you are not white or male do not expect to move up in this chaotic environment as the ideals of the top dog have been passed down to the next level to uphold. The department overall is one where if you speak your mind you will be belittled until you are fired or forced to quit. There is an extremely high staff turnover in IT Infrastructure.", "advice": "Schroders should not claim to support diversity and equality as this is simply not the case evident in the fact that there are little to no female management, no employees of LGBTQ orientation and a poor representation from those over the age of 50 or of different ethnic backgrounds other than white British."}, {"title": "Review", "text": "Pros Good Pension, Purchase additional holiday. Cons Poor bonus and potential to progress Advice to Management Equal bonus distribution", "rating": 3, "pros": "Good Pension, Purchase additional holiday.", "cons": "Poor bonus and potential to progress", "advice": "Equal bonus distribution"}, {"title": "Headwinds getting tougher", "text": "Pros Pay was decent Even if you are underperforms, you are more likely to survive, if you are British. Cons Analysts are subordinate to fund managers. Management are genius to come up with cumbersome, but ineffective work for analysts. Regulators and clients will never be easier on the industry.", "rating": 3, "pros": "Pay was decent", "cons": "Analysts are subordinate to fund managers.", "advice": null}, {"title": "Great firm", "text": "Pros Supportive, collaborative with a great work life balance. They pan for teh super long termand are not distracted by short term market issues Cons A fair bit of red tape to get things done, but a virtue of size Advice to Management Keep being supportive with long term strategies", "rating": 5, "pros": "Supportive, collaborative with a great work life balance. They pan for teh super long termand are not distracted by short term market issues", "cons": "A fair bit of red tape to get things done, but a virtue of size", "advice": "Keep being supportive with long term strategies"}, {"title": "Employment", "text": "Pros Stability and good team work ethic and working environment Cons bureaucracy has led to a culture of red tape and jobs for jobs sake. Never forget this is a client centric business and all that we do should be in the interest of the client we look after no matter what role we have in the business Advice to Management foster innovation and freedom of expression", "rating": 5, "pros": "Stability and good team work ethic and working environment", "cons": "bureaucracy has led to a culture of red tape and jobs for jobs sake. Never forget this is a client centric business and all that we do should be in the interest of the client we look after no matter what role we have in the business", "advice": "foster innovation and freedom of expression"}, {"title": "Good workplace, bit old fashioned still", "text": "Pros Relatively relaxed environment, decent salaries once you factor in best in class pension. Colleagues are mostly smart and down to earth. At least making an attempt to differentiate itself, as the business model comes under increasing scrutiny. Cons Seemingly as everywhere the higher up the chain you go the more out of touch people become. Poor female representation at the higher levels. Definite favouritism towards old Etonians. Feels like it is struggling to find a niche as the active management gravy train slows to a halt. Pumping money into tickbox exercises that only purport to add value. Advice to Management Find a direction that doesn't involve throwing every industry buzzword at the wall to see what sticks. Ask employees who have the inside track on what makes a client tick. Do more to counter public schoolboy favouritism or face losing the best talent.", "rating": 5, "pros": "Relatively relaxed environment, decent salaries once you factor in best in class pension. Colleagues are mostly smart and down to earth. At least making an attempt to differentiate itself, as the business model comes under increasing scrutiny.", "cons": "Seemingly as everywhere the higher up the chain you go the more out of touch people become. Poor female representation at the higher levels. Definite favouritism towards old Etonians. Feels like it is struggling to find a niche as the active management gravy train slows to a halt. Pumping money into tickbox exercises that only purport to add value.", "advice": "Find a direction that doesn't involve throwing every industry buzzword at the wall to see what sticks. Ask employees who have the inside track on what makes a client tick. Do more to counter public schoolboy favouritism or face losing the best talent."}, {"title": "Anon", "text": "Pros Excellent place to work, very ambitious and innovative. Very pleasant people with shared goals. Cons A lot of transformation and change is excellent, but is also demanding. Advice to Management Acknowledge the level of delivery.", "rating": 5, "pros": "Excellent place to work, very ambitious and innovative. Very pleasant people with shared goals.", "cons": "A lot of transformation and change is excellent, but is also demanding.", "advice": "Acknowledge the level of delivery."}, {"title": "IT Infrastructure", "text": "Pros - Fantastic pension & benefits - Direct colleagues & peers generally nice people - Some very smart and approachable people in other business units Cons - This department specifically is an unpleasant place to work - Extremely demanding management with \"just do it now\" attitude, nothing else relevant, no leadership. - Culture of fear/consequence - nobody dares say anything in meetings - Cumbersome and outdated processes means everything takes forever to get done (though to their credit, they are working on at least some of these issues) - Terrible hours at times with no compensation for it (or even a thankyou) Advice to Management Stop treating staff like drones or we will continue to lose good people. Display some actual leadership and inspire staff. Say thankyou from time to time.", "rating": 3, "pros": "- Fantastic pension & benefits", "cons": "- This department specifically is an unpleasant place to work", "advice": "Stop treating staff like drones or we will continue to lose good people. Display some actual leadership and inspire staff."}, {"title": "Strong CEO but culture change difficult", "text": "Pros New strong CEO genuinely trying to engage wider organisation. Cons Strong tradition and long tenure seems to be making genuine culture change very challenging. Advice to Management Clear vision, strategy and communication is critical to empowering change.", "rating": 3, "pros": "New strong CEO genuinely trying to engage wider organisation.", "cons": "Strong tradition and long tenure seems to be making genuine culture change very challenging.", "advice": "Clear vision, strategy and communication is critical to empowering change."}, {"title": "Great Work/Life Balance - Poor Progression/Management/Development", "text": "Pros Great work life balance, often working 9-5 hours. The people hired here tend to be friendly. Overall benefits are very good with exceptional pension and share purchase scheme. Can see why so many people work here for many years. Will sponsor (i.e. pay) for some exams if the department thinks they are relevant. Cons Progression is incredibly slow and often its about getting years on the clock more than anything. Definitely not a meritocracy, which is partially due to managers having very limited ability to measure quality and quantity of work done by team members. Quite political which probably stems from the fact so many managers and middle managers have been working for such a long time. Most managers tend to be technical experts/specialists but have very poor people management skills. No real efforts to motivate using tools such as salary/bonus/progression or even engaging team. Focus is on keeping things ticking along quite nicely with small incremental changes. Advice to Management More progression to keep staff engaged and to demonstrate there is future staying in the team.", "rating": 3, "pros": "Great work life balance, often working 9-5 hours. The people hired here tend to be friendly. Overall benefits are very good with exceptional pension and share purchase scheme. Can see why so many people work here for many years. Will sponsor (i.e. pay) for some exams if the department thinks they are relevant.", "cons": "Progression is incredibly slow and often its about getting years on the clock more than anything. Definitely not a meritocracy, which is partially due to managers having very limited ability to measure quality and quantity of work done by team members.", "advice": "More progression to keep staff engaged and to demonstrate there is future staying in the team."}, {"title": "IT Infrastructure", "text": "Pros Some pretty decent people work there at a lower level. The locations are convenient. Not sure what else to say. Cons They don't hire people over the age of 50. No female management. Blame culture. Negative atmosphere. People always shouting in office. No overtime or time in lieu given to staff who are forced to work like slaves during the week and over the weekend. Management has no respect for employees. Was invited to farewell parties almost every week during my time working there. Advice to Management Does it matter....they don't listen anyhow.", "rating": 1, "pros": "Some pretty decent people work there at a lower level. The locations are convenient. Not sure what else to say.", "cons": "They don't hire people over the age of 50. No female management. Blame culture. Negative atmosphere. People always shouting in office. No overtime or time in lieu given to staff who are forced to work like slaves during the week and over the weekend. Management has no respect for employees. Was invited to farewell parties almost every week during my time working there.", "advice": "Does it matter....they don't listen anyhow."}, {"title": "Great culture", "text": "Pros Pension, culture, work ethic and politics all good Cons Limited progression. Flat management. A lot of dead wood.", "rating": 5, "pros": "Pension, culture, work ethic and politics all good", "cons": "Limited progression. Flat management. A lot of dead wood.", "advice": null}, {"title": "3+years and counting", "text": "Pros Great family ran business. colleagues always willing to help, even if issue is not within their remit Cons Schroders have a habit of over complicating issues, No real progression, Tendency to bring wrong people into projects", "rating": 5, "pros": "Great family ran business.", "cons": "Schroders have a habit of over complicating issues,", "advice": null}, {"title": "Inclusion and diversiand", "text": "Pros Good work/life balance. 9-5 working hours. Cons The company claims thet they give importance to inclusion and diversity, but this is not true. It is clearly always people coming from certain backgrounds who are favoured. There is no diversity in the working environment and your opinion will not be heard. Schroeder claims about inclusion and diversity have rather been used to create a nicer profile towards investors. Advice to Management Do not claim something that you are not.", "rating": 1, "pros": "Good work/life balance. 9-5 working hours.", "cons": "The company claims thet they give importance to inclusion and diversity, but this is not true. It is clearly always people coming from certain backgrounds who are favoured. There is no diversity in the working environment and your opinion will not be heard. Schroeder claims about inclusion and diversity have rather been used to create a nicer profile towards investors.", "advice": "Do not claim something that you are not."}, {"title": "Recommended", "text": "Pros Great culture, very nice environment Cons Few cons, very diverse base and keen to help people develop Advice to Management Keep doing what you are doing", "rating": 5, "pros": "Great culture, very nice environment", "cons": "Few cons, very diverse base and keen to help people develop", "advice": "Keep doing what you are doing"}, {"title": "Good overall", "text": "Pros Stable company, good pension, hours can be good Cons Limited change, can be disorganised at times", "rating": 5, "pros": "Stable company, good pension, hours can be good", "cons": "Limited change, can be disorganised at times", "advice": null}, {"title": "Excellent Culture and Fast Moving", "text": "Pros Fast moving organization with excellent culture. Definitely looks after its employees. Cons If you're in a front office role, you'd probably spend 20% of your time doing support teams' jobs.", "rating": 5, "pros": "Fast moving organization with excellent culture. Definitely looks after its employees.", "cons": "If you're in a front office role, you'd probably spend 20% of your time doing support teams' jobs.", "advice": null}, {"title": "IT", "text": "Pros No Pros - chaotic, no process, poor management, no leadership Cons Stay away from this company. Asians are treated like slaves to British guys Advice to Management Change leadership team", "rating": 1, "pros": "No Pros - chaotic, no process, poor management, no leadership", "cons": "Stay away from this company. Asians are treated like slaves to British guys", "advice": "Change leadership team"}, {"title": "A solid company going places", "text": "Pros Full of really nice people. New CEO is taking the business forward in many ways, including use of data science. Collaboration is getting better after having been quite siloed. Cons Sometimes a bit slow making things happen as decision-making quite consensual. With some exceptions, not as much sideways movement as could be which makes for 'dead man's shoes' career path for many. Advice to Management Get people moving between business areas more, don't let people stagnate in any one role too long.", "rating": 5, "pros": "Full of really nice people. New CEO is taking the business forward in many ways, including use of data science. Collaboration is getting better after having been quite siloed.", "cons": "Sometimes a bit slow making things happen as decision-making quite consensual. With some exceptions, not as much sideways movement as could be which makes for 'dead man's shoes' career path for many.", "advice": "Get people moving between business areas more, don't let people stagnate in any one role too long."}, {"title": "Supportive environment and low turnover", "text": "Pros - Intelligent and motivated colleagues - Well-regarded company with long legacy - Growing and successful - Decent work-life balance (esp by City standards) - Meritocratic and opportunities for rapid career progression - Good benefits package - Low turnover: still a 'job for life' for many employees Cons - Somewhat old-fashioned corp culture - Silos and poor internal communication, increasing problem as company grows - Lack of clarity on long-term vision and strategy, resource allocation sometimes a head-scratcher Advice to Management Continue to enhance efforts to communicate with the employee base and seek grassroots feedback. We are all cognisant the industry is changing and our model is challenged - need to understand clearly how the leadership sees us navigating it, rather than throwing money at more middle management roles and woolly titles.", "rating": 5, "pros": "- Intelligent and motivated colleagues", "cons": "- Somewhat old-fashioned corp culture", "advice": "Continue to enhance efforts to communicate with the employee base and seek grassroots feedback. We are all cognisant the industry is changing and our model is challenged - need to understand clearly how the leadership sees us navigating it, rather than throwing money at more middle management roles and woolly titles."}, {"title": "IT Project Manager", "text": "Pros Office environment is great. Staffs are friendly Cons Benefits and perks offered is not up to market Advice to Management Do share more team visions with staffs.", "rating": 3, "pros": "Office environment is great. Staffs are friendly", "cons": "Benefits and perks offered is not up to market", "advice": "Do share more team visions with staffs."}, {"title": "retail manager", "text": "Pros stable, good work life balance Cons lack of innovation drives, and seniors may not listen to advices from frontline", "rating": 5, "pros": "stable, good work life balance", "cons": "lack of innovation drives, and seniors may not listen to advices from frontline", "advice": null}, {"title": "Great place to work", "text": "Pros Friendly people, good benefits, great progression Cons Slow salary increases, nothing else bad to say", "rating": 5, "pros": "Friendly people, good benefits, great progression", "cons": "Slow salary increases, nothing else bad to say", "advice": null}, {"title": "Review", "text": "Pros A very flat organization structure. Cons It is very political among divisions. Advice to Management Change the various teams mentality to work together as one whole big group", "rating": 3, "pros": "A very flat organization structure.", "cons": "It is very political among divisions.", "advice": "Change the various teams mentality to work together as one whole big group"}, {"title": "First work Experience in London", "text": "Pros Perks are great, name is good for your CV Cons If you are not a Fund manager the salary is really low. You would better be a British male with a posh accent... Very British culture and organisation", "rating": 3, "pros": "Perks are great, name is good for your CV", "cons": "If you are not a Fund manager the salary is really low. You would better be a British male with a posh accent... Very British culture and organisation", "advice": null}, {"title": "Good Woklife Balance", "text": "Pros Generally a good team environment and work life balance. Cons Poor people management skills of some senior investors", "rating": 5, "pros": "Generally a good team environment and work life balance.", "cons": "Poor people management skills of some senior investors", "advice": null}, {"title": "good company", "text": "Pros good salaries/benefits. Good work life balance. Cons difficult to progress in luxembourg", "rating": 5, "pros": "good salaries/benefits. Good work life balance.", "cons": "difficult to progress in luxembourg", "advice": null}, {"title": "Former Employee", "text": "Pros Fantastic long term career opportunities Cons Need to be able to navigate the culture of such a large business", "rating": 3, "pros": "Fantastic long term career opportunities", "cons": "Need to be able to navigate the culture of such a large business", "advice": null}, {"title": "A great place to work", "text": "Pros Big firm reach and prestige with small firm warmth and culture Positive collaborative culture Cons There are inevitably a small number people who are less collaborative, but it's a much smaller proportion than in most other firms. Advice to Management Maintain consistency to help employees succeed.", "rating": 5, "pros": "Big firm reach and prestige with small firm warmth and culture", "cons": "There are inevitably a small number people who are less collaborative, but it's a much smaller proportion than in most other firms.", "advice": "Maintain consistency to help employees succeed."}, {"title": "Intern", "text": "Pros Financial firm without the overly white collar feel. There is a social side to the firm which is fantastic Cons Tough on targets. Must be hardworking Advice to Management ........................................", "rating": 3, "pros": "Financial firm without the overly white collar feel. There is a social side to the firm which is fantastic", "cons": "Tough on targets. Must be hardworking", "advice": "........................................"}, {"title": "Senior Client Executive", "text": "Pros Benefits and training on offer excellent. Good solid independent company to work for with great support from the Schroder family who still have majority stake in company Cons Can be hard to get promoted if job role doesn't fit standard role descriptions. Patience is needed. Become somewhat bureaucratic due to being much larger than it was. Advice to Management More flexibility with role descriptions so they match up with what employees do.", "rating": 5, "pros": "Benefits and training on offer excellent. Good solid independent company to work for with great support from the Schroder family who still have majority stake in company", "cons": "Can be hard to get promoted if job role doesn't fit standard role descriptions. Patience is needed. Become somewhat bureaucratic due to being much larger than it was.", "advice": "More flexibility with role descriptions so they match up with what employees do."}, {"title": "Watch this space", "text": "Pros Progressive view to change and innovation, Increasingly collaborative environment Right size company for ambitious and talented individuals. Completely customer focussed. Cons a fair amount of change so not for those who don't have a stomach for it.", "rating": 5, "pros": "Progressive view to change and innovation,", "cons": "a fair amount of change so not for those who don't have a stomach for it.", "advice": null}, {"title": "Great company", "text": "Pros Can be a fun place to work, people are relaxed. Also there are lots of social events and fund raising opportunities. Cons Can be a bit slow paced, if you like a constant change of scenery, maybe not the place for you.", "rating": 5, "pros": "Can be a fun place to work, people are relaxed. Also there are lots of social events and fund raising opportunities.", "cons": "Can be a bit slow paced, if you like a constant change of scenery, maybe not the place for you.", "advice": null}, {"title": "Analyst", "text": "Pros Very good culture, amazing work / life balance Cons not much, depends on the team", "rating": 5, "pros": "Very good culture, amazing work / life balance", "cons": "not much, depends on the team", "advice": null}, {"title": "Good Place to work", "text": "Pros I enjoyed the job that I was doing there most of the time. Cons Career progression a bit difficult depending on job description. Advice to Management Ensuring that goals/targets are achievable and that there is scope to progress.", "rating": 3, "pros": "I enjoyed the job that I was doing there most of the time.", "cons": "Career progression a bit difficult depending on job description.", "advice": "Ensuring that goals/targets are achievable and that there is scope to progress."}, {"title": "A good culture and on balance a very good place to work", "text": "Pros Good work atmosphere. Good people and culture. Wealth Management has an autonomous structure to Schroders Group. Exposure to all levels of seniority. Cons Salary and benefits are lower comparatively. Progression may be difficult given the flat structure", "rating": 5, "pros": "Good work atmosphere. Good people and culture. Wealth Management has an autonomous structure to Schroders Group. Exposure to all levels of seniority.", "cons": "Salary and benefits are lower comparatively. Progression may be difficult given the flat structure", "advice": null}, {"title": "Vice President", "text": "Pros Good company to work Decent environment Some work life balance Nothing much to complain Cons Lot of things can be improved Clarity on jobs roles and responsibilities Improve the chances of internal mobility Encourage individual contributor Advice to Management Listen to middle and lower level people Middle management never cares about career growth of immediate reports Also increase or normalize pay structure", "rating": 3, "pros": "Good company to work", "cons": "Lot of things can be improved", "advice": "Listen to middle and lower level people"}, {"title": "A fair bit of internal politics..", "text": "Pros Good work life balance for the industry Job security Some clever people Cons A lot of internal politics Generally was a place to come to if you had no other offers Advice to Management Be more open", "rating": 3, "pros": "Good work life balance for the industry", "cons": "A lot of internal politics", "advice": "Be more open"}, {"title": "Analyst", "text": "Pros Good people and good work life balance Cons Hierarchical and collaboration can be absent", "rating": 5, "pros": "Good people and good work life balance", "cons": "Hierarchical and collaboration can be absent", "advice": null}, {"title": "Avoid If you are talanted and motivated.", "text": "Pros Easy job, no challenge, not too much stress. Cons Employees doesn't develop, no promotions, pay is Very low according to other companies, se employees doesn't have even basic education. My 2 cents - Avoid. Advice to Management if you wanna be what you are just stay like this, but if you wanna change a be a good company like UK office you shoud stop treating employees this way, you shoud start to hire talanted people, as for now only what you are going for is a cost saving, you keep people who are 10-15 years doing same thing, people are not motivated and everybody is complaining.", "rating": 3, "pros": "Easy job, no challenge, not too much stress.", "cons": "Employees doesn't develop, no promotions, pay is Very low according to other companies, se employees doesn't have even basic education. My 2 cents - Avoid.", "advice": "if you wanna be what you are just stay like this, but if you wanna change a be a good company like UK office you shoud stop treating employees this way, you shoud start to hire talanted people, as for now only what you are going for is a cost saving, you keep people who are 10-15 years doing same thing, people are not motivated and everybody is complaining."}, {"title": "Good company & great work-life balance", "text": "Pros *great reputation *great people *great working hours Cons *hierarchical management structure *can be difficult to move internally", "rating": 5, "pros": "*great reputation", "cons": "*hierarchical management structure", "advice": null}, {"title": "Good employee benefit", "text": "Pros Company offers very good bonus and benefits Cons Roles are siloed , difficult switching roles Advice to Management Communicate better with staff members", "rating": 3, "pros": "Company offers very good bonus and benefits", "cons": "Roles are siloed , difficult switching roles", "advice": "Communicate better with staff members"}, {"title": "Review", "text": "Pros Schroders relaxed atmosphere with great company perks and benefits Cons Despite being a flexible working employer, this was not available to all. HR were not approachable, therefore makes it difficult to report any grievances. Seems to harbour and pander to the wrong type of individuals.", "rating": 3, "pros": "Schroders relaxed atmosphere with great company perks and benefits", "cons": "Despite being a flexible working employer, this was not available to all. HR were not approachable, therefore makes it difficult to report any grievances. Seems to harbour and pander to the wrong type of individuals.", "advice": null}, {"title": "Client Manager", "text": "Pros Good people, opportunities to get involved in other areas of the business Cons Hard to progress, people there a long time, no succession planning Advice to Management Flexible working and work life balance needs to be promoted", "rating": 5, "pros": "Good people, opportunities to get involved in other areas of the business", "cons": "Hard to progress, people there a long time, no succession planning", "advice": "Flexible working and work life balance needs to be promoted"}, {"title": "Long-term, collegial and a great name.", "text": "Pros Friendly people who are always keen to help. Good work / life balance. Smart concepts being produced makes the work interesting. Cons Lack of movement through the company to other office locations. Lower basic pay than average. More diversity needed at higher levels.", "rating": 5, "pros": "Friendly people who are always keen to help.", "cons": "Lack of movement through the company to other office locations.", "advice": null}, {"title": "Good", "text": "Pros Well established company with good reputation, and international presence. Within our group we enjoy full autonomy on decisions and leeway on innovation. Cons The company still struggles to satisfy employees in certain areas and remains slow implementing targeted changes as it still attempts to lead.", "rating": 3, "pros": "Well established company with good reputation, and international presence. Within our group we enjoy full autonomy on decisions and leeway on innovation.", "cons": "The company still struggles to satisfy employees in certain areas and remains slow implementing targeted changes as it still attempts to lead.", "advice": null}, {"title": "Good", "text": "Pros Good firm, increasing focus on mobility. Very favourable work life balance relative to other firms Cons Bit of an old boys club... need to dangle the carrot a little closer.", "rating": 5, "pros": "Good firm, increasing focus on mobility. Very favourable work life balance relative to other firms", "cons": "Bit of an old boys club... need to dangle the carrot a little closer.", "advice": null}, {"title": "Investment management roles", "text": "Pros Plenty of high quality individuals. Lots of internal and external research. Ability to raise substantial sums when good performance aligns with a market sweetspot. Cons Lots of overlapping teams means lots of internal competition, so very political organisation. Very siloed, which can lead to lack of cooperation across different businesses. Advice to Management Try and build businesses from the inside rather than always looking to bring in teams and individuals from outside. Pay should be fair, transparent and simple.", "rating": 3, "pros": "Plenty of high quality individuals. Lots of internal and external research. Ability to raise substantial sums when good performance aligns with a market sweetspot.", "cons": "Lots of overlapping teams means lots of internal competition, so very political organisation. Very siloed, which can lead to lack of cooperation across different businesses.", "advice": "Try and build businesses from the inside rather than always looking to bring in teams and individuals from outside. Pay should be fair, transparent and simple."}, {"title": "Long time employee", "text": "Pros Stable, high integrity, some very good people Cons Staid, a bit passive and becoming to big Advice to Management Remember the drive that caused the current success.", "rating": 5, "pros": "Stable, high integrity, some very good people", "cons": "Staid, a bit passive and becoming to big", "advice": "Remember the drive that caused the current success."}, {"title": "Great company but low pay..", "text": "Pros Nice offices, great people, good support for staff Cons Low pay Too upper management heavy Advice to Management Raise pay for lower staff", "rating": 5, "pros": "Nice offices, great people, good support for staff", "cons": "Low pay", "advice": "Raise pay for lower staff"}, {"title": "Great Job Fantastic First Job", "text": "Pros Good Interesting work that was challenging. It did start slow but I became very busy quickly Cons The social aspects was very quite we didn't have too much interactions at all except for wok", "rating": 5, "pros": "Good Interesting work that was challenging. It did start slow but I became very busy quickly", "cons": "The social aspects was very quite we didn't have too much interactions at all except for wok", "advice": null}, {"title": "Good brand, stable employer but no upward mobility", "text": "Pros Stable company which brings employment security. Good work-life-balance, nice people and great location Cons Low turnover amongst senior staff = high turnover amongst junior staff. Development and career progression opportunities are limited. The company is a bit slow moving, bearocratic, pace of change is frustrating. Senior staff are very set in their ways and aren't going anywhere.", "rating": 5, "pros": "Stable company which brings employment security. Good work-life-balance, nice people and great location", "cons": "Low turnover amongst senior staff = high turnover amongst junior staff. Development and career progression opportunities are limited. The company is a bit slow moving, bearocratic, pace of change is frustrating. Senior staff are very set in their ways and aren't going anywhere.", "advice": null}, {"title": "Fund Accountant", "text": "Pros Very good company, very nice staff, good atmosphere. The benefits offered are very good. Cons Not as challenging as expected", "rating": 5, "pros": "Very good company, very nice staff, good atmosphere. The benefits offered are very good.", "cons": "Not as challenging as expected", "advice": null}, {"title": "Portfolio Manager", "text": "Pros Great company value and culture of consistent progressing Cons Lack of system integration at some local offices with group's", "rating": 5, "pros": "Great company value and culture of consistent progressing", "cons": "Lack of system integration at some local offices with group's", "advice": null}, {"title": "Review", "text": "Pros Good people, opportunities to learn. Cons Stagnant, low progression, below average pay.", "rating": 3, "pros": "Good people, opportunities to learn.", "cons": "Stagnant, low progression, below average pay.", "advice": null}, {"title": "Analyst", "text": "Pros Reputable fundhouse Decent work life balance Engaging seniors Humble, talented analysts in the investment teams Cons Not flexible to talent mobility between teams Old-timers get too comfortable, being less ambitious to take on risky projects to raise profile for the business Lack of definitive direction in business development Advice to Management Listen to what juniors have to say Keep your promises to stay credible Re-evaluate everyone's skill sets more frequently to prevent people from cruising and leeching off the ones that are actually doing the real work", "rating": 3, "pros": "Reputable fundhouse", "cons": "Not flexible to talent mobility between teams", "advice": "Listen to what juniors have to say"}, {"title": "Can be hard at times", "text": "Pros Benefits are not bad but pay so so Cons Unreasonable working hours and deadline. Quite a few weekend work and expect employees to work more than 15 hours straight quite often. Advice to Management Please treasure your emplyees and treat them as human, not robots", "rating": 3, "pros": "Benefits are not bad but pay so so", "cons": "Unreasonable working hours and deadline. Quite a few weekend work and expect employees to work more than 15 hours straight quite often.", "advice": "Please treasure your emplyees and treat them as human, not robots"}, {"title": "Good Company. Pays for CFA.", "text": "Pros Well respected company. No egos. Good training structure. Cons Quite cliquey. Slow moving with progression.", "rating": 3, "pros": "Well respected company.", "cons": "Quite cliquey.", "advice": null}, {"title": ".", "text": "Pros nice collegues to work with Cons no cons in working here", "rating": 5, "pros": "nice collegues to work with", "cons": "no cons in working here", "advice": null}, {"title": "Analyst", "text": "Pros good people to work with - collaborative and friendly Cons staff turnover in certain teams a concern", "rating": 5, "pros": "good people to work with - collaborative and friendly", "cons": "staff turnover in certain teams a concern", "advice": null}, {"title": "UK Institutional", "text": "Pros Work with a lot of nice people who are very good at their jobs Cons Company culture is increasingly aggressive towards other internal departments. Not collegiate. Teams tend to work in silos rather than across departments.", "rating": 3, "pros": "Work with a lot of nice people who are very good at their jobs", "cons": "Company culture is increasingly aggressive towards other internal departments. Not collegiate. Teams tend to work in silos rather than across departments.", "advice": null}, {"title": "Slow steady paced culture..", "text": "Pros a firm that tends to encourage longevity..not uncommon to come across people who have spent the better part of their career here Cons low octane existence...pay will never match your other high flying friends in other firms", "rating": 5, "pros": "a firm that tends to encourage longevity..not uncommon to come across people who have spent the better part of their career here", "cons": "low octane existence...pay will never match your other high flying friends in other firms", "advice": null}, {"title": "good", "text": "Pros nice people, good hours, nice office Cons not very varying work, always the same tasks Advice to Management s", "rating": 3, "pros": "nice people, good hours, nice office", "cons": "not very varying work, always the same tasks", "advice": "s"}, {"title": "Good, secure place, however not exciting for a young employee.", "text": "Pros - Job Security, the turnover seems to be pretty low and there's no hire/fire mentality - Solid Business - Good name for the CV - Good work/life balance. Most people are out the office between 5-6pm. - A huge amount of training is given to you (IMC, CFA, ISEB, CIMA, professional investment training, sales techniques, and you can pretty much justify anything else you like training wise) Cons - Compensation below par, not just compared to sell-side either. (Within your first 2 years as a Graduate Trainee you're treated like just an accessory with minimal bonuses) and low base. - The environment is very slow. Echos the traditional 200 year old values of the firm. - 90% of the workforce are going to be 20+ years older than you, have kids or be married/engaged. This makes for quite a depressing work environment where there's absolutely no social vibe or anyone you can relate to. Advice to Management Seems to be doing a good job. I would say hire a younger, more vibrant workforce, but there's no point even putting that because this place is never going to have the startup feel that makes for a fun work environment, as that's not really the way/values of a 200 year old investment company.", "rating": 3, "pros": "- Job Security, the turnover seems to be pretty low and there's no hire/fire mentality", "cons": "- Compensation below par, not just compared to sell-side either. (Within your first 2 years as a Graduate Trainee you're treated like just an accessory with minimal bonuses) and low base.", "advice": "Seems to be doing a good job. I would say hire a younger, more vibrant workforce, but there's no point even putting that because this place is never going to have the startup feel that makes for a fun work environment, as that's not really the way/values of a 200 year old investment company."}, {"title": "Nice people, relaxed culture, but dated", "text": "Pros Nice genuine people Friendly office culture Good free gym on site Excellent transport links; good location for shops, food Good work life balance, good hours Cons Too focused on its 'heritage' which makes it seem slow and dated, relatively less agile than competitors (e.g. slow to take up digital as a communication strategy with clients) HR do not seem very organised or fluid when giving feedback Non rotational grad programme Not as diverse or international a workforce in London office as some other US asset managers, or investment banks", "rating": 3, "pros": "Nice genuine people", "cons": "Too focused on its 'heritage' which makes it seem slow and dated, relatively less agile than competitors (e.g. slow to take up digital as a communication strategy with clients)", "advice": null}, {"title": "Analyst", "text": "Pros Good work life balance Good perks Nice People Good Brand Name Great Location Cons lower pay than market rate Conservative Culture", "rating": 3, "pros": "Good work life balance", "cons": "lower pay than market rate", "advice": null}, {"title": "17 Years: Laughter and Tears, but many opportunities to learn and grow", "text": "Pros At its best Schroders has a collaborative collegiate culture, and allows opportunities to work with terrific people and achieve exciting progressive steps forward. It also allowed me personally the chance to experience many different roles in different business areas, progress to greater and more exciting challenges, and achieve success, without getting stuck in a one-track rut. Cons All this however is marred by outbursts of clique culture and crony-ism and damaging internal political struggles. As ever there is an innate snobbery associated with some parts of the Investment Management culture. The reciprocity of loyalty to the employee is questionable, as evidenced by their willingness to dispose of loyal hard-working veteran employees who no longer fit the current culture with extraordinary lack of sensitivity. (But would you expect anything different anywhere?) Advice to Management Listen more actively and carefully to the smarter and more experienced people in your operational teams further down the hierarchy. Especially when embarking on significant re-organisations and change programmes - and while they are in progress. By talking to them directly - not by 'surveys'. Management by walking about. The upward chain of communication always distorts the reality as seen at the rock-face.", "rating": 5, "pros": "At its best Schroders has a collaborative collegiate culture, and allows opportunities to work with terrific people and achieve exciting progressive steps forward. It also allowed me personally the chance to experience many different roles in different business areas, progress to greater and more exciting challenges, and achieve success, without getting stuck in a one-track rut.", "cons": "All this however is marred by outbursts of clique culture and crony-ism and damaging internal political struggles. As ever there is an innate snobbery associated with some parts of the Investment Management culture.", "advice": "Listen more actively and carefully to the smarter and more experienced people in your operational teams further down the hierarchy. Especially when embarking on significant re-organisations and change programmes - and while they are in progress. By talking to them directly - not by 'surveys'. Management by walking about. The upward chain of communication always distorts the reality as seen at the rock-face."}, {"title": "Spent 26 happy years at Schroders as a Butler then Head Butler", "text": "Pros When i was working for Schroders there were many benefits, free lunches, mortgage subsidies, free tickets for Wimbledon, free tickets for the Royal Opera House, London Philharmonic Orchestra, good holidays and great Christmas parties. Good leadership and HR department. Wish I was still there. Great company Cons Quite a few departments were out sourced, lost some of the perks, but that was due to recession. Promotions dropped off. Advice to Management Go back to the old days and make Schroders the company everyone wanted to work for and could only get in if they knew someone working there.", "rating": 5, "pros": "When i was working for Schroders there were many benefits, free lunches, mortgage subsidies, free tickets for Wimbledon, free tickets for the Royal Opera House, London Philharmonic Orchestra, good holidays and great Christmas parties. Good leadership and HR department. Wish I was still there. Great company", "cons": "Quite a few departments were out sourced, lost some of the perks, but that was due to recession. Promotions dropped off.", "advice": "Go back to the old days and make Schroders the company everyone wanted to work for and could only get in if they knew someone working there."}, {"title": "Great work/life balance!", "text": "Pros The people are generally great to work with. Managers receive core training, so employees without management experience do get at least a foundation level of knowledge to work with and aren't just left to invent a management style for themselves. Work/life balance is real and unless the pressure is on to meet a deadline no one is a slave to their desk. A 9 to 5 day can actually be the norm! Cons Compensation is not as good as at comparable companies. Development of talent at all levels is not fantastic - the focus is on the obvious and HR/senior management do not look within often enough to develop talent across the business. Advice to Management Instead of relying on hearsay or ill defined talent development practices, why not ask employees to identify themselves if they are actively looking to develop within the company? Typically the most obvious candidate (i.e. the person 2nd in command of a team) is recruited into a leadership/management role, and the role is never offered out to employees. If the role is never advertised, how can you know that you got the best candidate for the job? Same goes for sideways moves.. the assumption is that for niche roles there is no one who could move into that role and typically recruitment is from external sources. A way of allowing employees to identify themselves and their full skill set would give HR a larger talent pool to offer up for those roles.", "rating": 5, "pros": "The people are generally great to work with. Managers receive core training, so employees without management experience do get at least a foundation level of knowledge to work with and aren't just left to invent a management style for themselves. Work/life balance is real and unless the pressure is on to meet a deadline no one is a slave to their desk. A 9 to 5 day can actually be the norm!", "cons": "Compensation is not as good as at comparable companies.", "advice": "Instead of relying on hearsay or ill defined talent development practices, why not ask employees to identify themselves if they are actively looking to develop within the company? Typically the most obvious candidate (i.e. the person 2nd in command of a team) is recruited into a leadership/management role, and the role is never offered out to employees. If the role is never advertised, how can you know that you got the best candidate for the job?"}, {"title": "OK place", "text": "Pros - Good name - Some good ideas - Not too intense in general Cons - Too many changes in management - Not enough unity in the culture Advice to Management More positive encouragement, so teams could feel that there is a common goal.", "rating": 3, "pros": "- Good name", "cons": "- Too many changes in management", "advice": "More positive encouragement, so teams could feel that there is a common goal."}, {"title": "Confused", "text": "Pros Gym in basement - decent coffee shop - some intersting corporate art Cons This company seems to have got deeply confused about its own identity - trying to move on from the parochial, family run firm to a more corporate approach - and has carefully taken the worst characteristics of both. An ivory tower dwelling, dictatorial senior management who expect to be treated like royalty and demonstrate hubris and superciliousness as their most common character traits. This arrogance and feudal attitude means motivation among the serfs is lower than the gym in the basement. Advice to Management Resign", "rating": 1, "pros": "Gym in basement - decent coffee shop - some intersting corporate art", "cons": "This company seems to have got deeply confused about its own identity - trying to move on from the parochial, family run firm to a more corporate approach - and has carefully taken the worst characteristics of both. An ivory tower dwelling, dictatorial senior management who expect to be treated like royalty and demonstrate hubris and superciliousness as their most common character traits. This arrogance and feudal attitude means motivation among the serfs is lower than the gym in the basement.", "advice": "Resign"}, {"title": "Good people, good pay, poor management", "text": "Pros Fund and product managers are good, as well as marketing. Good access to fund management. Base salary lower than average, but good bonus (cash+shares). Good work/life balance Cons Management struggle to retain talents, especially the ones who are not in the HQ in London or close to some big guys. The Schroders shares are very volatile, so they impact the value of the deferred portion of your bonus. Too many people who spend more time in promoting themselves internally rather than Schroders products externally and buttering up their bosses. Overstaffed organization. Advice to Management To look more in detail the entities outside the big centres (London, NYC) in order to understand where the added value is really generated. Sometimes mediocrity is rewarded,", "rating": 3, "pros": "Fund and product managers are good, as well as marketing. Good access to fund management. Base salary lower than average, but good bonus (cash+shares). Good work/life balance", "cons": "Management struggle to retain talents, especially the ones who are not in the HQ in London or close to some big guys. The Schroders shares are very volatile, so they impact the value of the deferred portion of your bonus. Too many people who spend more time in promoting themselves internally rather than Schroders products externally and buttering up their bosses. Overstaffed organization.", "advice": "To look more in detail the entities outside the big centres (London, NYC) in order to understand where the added value is really generated. Sometimes mediocrity is rewarded,"}, {"title": "Good firm.", "text": "Pros English firm, good business-minded CEO. Cons High turnover of investment staff. Advice to Management Try to retain investment staff for longer - not via financial incentives but via making them feel valued / taking care over who is in head of division roles.", "rating": 5, "pros": "English firm, good business-minded CEO.", "cons": "High turnover of investment staff.", "advice": "Try to retain investment staff for longer - not via financial incentives but via making them feel valued / taking care over who is in head of division roles."}, {"title": "Great employees, decent business, poor people/talent managers", "text": "Pros There are many talented, hard-working people at the company and they are a pleasure to work with. The business works hard at putting on social events & getting employees across disciplines to interact, share time & ideas, even contribute something to society via charity or volunteering. A positive work environment is reflected in a fairly successful & happy work force. Compensation is decent but not the highest in the industry. Bonuses are OK, though not always based on absolute merit. Bonuses are rarely in the form of equity/options unless you're middle/top management which is unusual in finance. Vacation increases with length of service & is a decent to good allocation p.a. The company is global with many offices in varied geographies and the occasional opportunity to move country/job which is rewarding for both career & personal development. Cons Almost constant restructuring over time, often repeating structures/business plans as they go in & out of fashion. This destabilizes the confidence of employees. Top management & HR are unaware/inactive when (in rare cases) middle management acts poorly or treats subordinates unprofessionally, often taking years to fix problems and/or waiting for employee turnover to fix the issue. Much of this is par for the course across finance but this company is no exception to the rule. Advice to Management Stick to an internal business plan or structure for more than 3 years. It will literally pay dividends.", "rating": 5, "pros": "There are many talented, hard-working people at the company and they are a pleasure to work with. The business works hard at putting on social events & getting employees across disciplines to interact, share time & ideas, even contribute something to society via charity or volunteering. A positive work environment is reflected in a fairly successful & happy work force. Compensation is decent but not the highest in the industry. Bonuses are OK, though not always based on absolute merit. Bonuses are rarely in the form of equity/options unless you're middle/top management which is unusual in finance. Vacation increases with length of service & is a decent to good allocation p.a. The company is global with many offices in varied geographies and the occasional opportunity to move country/job which is rewarding for both career & personal development.", "cons": "Almost constant restructuring over time, often repeating structures/business plans as they go in & out of fashion. This destabilizes the confidence of employees. Top management & HR are unaware/inactive when (in rare cases) middle management acts poorly or treats subordinates unprofessionally, often taking years to fix problems and/or waiting for employee turnover to fix the issue. Much of this is par for the course across finance but this company is no exception to the rule.", "advice": "Stick to an internal business plan or structure for more than 3 years. It will literally pay dividends."}, {"title": "Lost Few Years", "text": "Pros The toilets are quite clean. Cons Management makes false promises to attract young talents. However, they never keep promises or develop young people. Advice to Management Make promises that you are 100% sure that you are going to keep.", "rating": 1, "pros": "The toilets are quite clean.", "cons": "Management makes false promises to attract young talents. However, they never keep promises or develop young people.", "advice": "Make promises that you are 100% sure that you are going to keep."}, {"title": "Good company but management not the fairest", "text": "Pros Established and good infrastructure, good staff benefits Cons They don't really care about the individual..some management decisions are unfair. Can be a political place too. Advice to Management Get to know how the staff on the ground really feel and what they think about their managers..you may be surprised!", "rating": 3, "pros": "Established and good infrastructure, good staff benefits", "cons": "They don't really care about the individual..some management decisions are unfair. Can be a political place too.", "advice": "Get to know how the staff on the ground really feel and what they think about their managers..you may be surprised!"}, {"title": "A fantastic excellent firm full of talented analysts and portfolio managers.", "text": "Pros Schroders assembled a team of seasoned investors and portfolio managers, a group of very astute investors. Very much applaud the firm's strategy to exit the investment banking business and be a pure investment management firm. Cons Some of the perceived top performers, are not, it is the team that drives performance. Shockingly unprofessional behaviour (such as manager sending vitriolic abusive e-mails to subordinates) is allowed. Administrative staff in the US has mixed level of dedication. Advice to Management Pay attention to the analyst contribution versus PM. Be careful of the little fiefdoms and how it can cloud who is really doing meaningful work to make money on behalf of shareholders.", "rating": 5, "pros": "Schroders assembled a team of seasoned investors and portfolio managers, a group of very astute investors. Very much applaud the firm's strategy to exit the investment banking business and be a pure investment management firm.", "cons": "Some of the perceived top performers, are not, it is the team that drives performance. Shockingly unprofessional behaviour (such as manager sending vitriolic abusive e-mails to subordinates) is allowed. Administrative staff in the US has mixed level of dedication.", "advice": "Pay attention to the analyst contribution versus PM. Be careful of the little fiefdoms and how it can cloud who is really doing meaningful work to make money on behalf of shareholders."}, {"title": "Professional", "text": "Pros Professional work culture, nice work environment,flexible Cons Need more pay salaries, health benefits, need decentralisation in reporting hierarchy", "rating": 5, "pros": "Professional work culture, nice work environment,flexible", "cons": "Need more pay salaries, health benefits, need decentralisation in reporting hierarchy", "advice": null}, {"title": "Very rewarding, many times I felt like the company was giving to me far more than it was asking from me", "text": "Pros - Great working environment, relaxed atmosphere, lots of social events - Senior management is very accessible, even for interns - Great figures within the company, some of the line managers really care about your career development - I never felt pressured to work extremely long hours, never worked a single weekend Cons - Pay is considerably lower than in Investment Banking - The Summer Internship scheme does not give you direct access to the Graduate Program in case of a successful experience, you have to reapply", "rating": 5, "pros": "- Great working environment, relaxed atmosphere, lots of social events", "cons": "- Pay is considerably lower than in Investment Banking", "advice": null}, {"title": "Worst nightmare of my career", "text": "Pros Modest Gym Modest office In the city Cons I had the worst experience of my carreer in my small stint at schroder IT at Gresham street I worked very hard and efficiently but was laid of for no apparent reason( believe me no proof of anything ) Neither it was performance, competence or any personal reason . I'm still puzzled at their behavior tho. it was a good riddance.  I cannot comment about other departments but the IT dept. at Schroders is run by incompetent and whimsical people . The HR department is completely subservient to managers with no say of its own. Even the most senior management in IT is unresponsive and total waste.  The mind of this firm is very narrow and conservative - salary is one of the reflection of it. I also witnessed some nepotism I'm my department . I would highly advise not to join this firm, and if u have no option join with your risk.", "rating": 1, "pros": "Modest Gym", "cons": "I had the worst experience of my carreer in my small stint at schroder IT at Gresham street", "advice": null}, {"title": "Working at Locus BOSS deeply increases your knowledge about financial market", "text": "Pros Good relationship among colleagues and senior management; Excellent environment for intellectual development; Very good perspectives of carreer growth. Cons Small company with budget restrictions; Extremely concentrated in the financial market. Advice to Management Diversify the product lines", "rating": 5, "pros": "Good relationship among colleagues and senior management;", "cons": "Small company with budget restrictions;", "advice": "Diversify the product lines"}, {"title": "It is like a big family, in one hand there is a lot of support but in the other not everyone is treated the same.", "text": "Pros - total support with professional development (i.e. IMC, CFA, etc.) - great social activities (sports, pub quiz, tours, etc.) - global offices allowing for great exposure to international markets - leading technology - HR has a great variety of personal development courses - you will work with one of the most talented people in this business - a great variety of products allowing for a 360 degree exposure to asset classes - great place for a graduate or for one starting their career - bonus is based on clear appraisal system varying from 5-20% your salary for non-investment professionals Cons - flat structure not allowing for senior staff to be promoted which contributes to high turnover and constant restructure - staff is treated differently depending of who is their line manager or which social activities one takes part on Advice to Management -Concentrate on managing down. - Schroders is filled with very talented people which requires a lot of incentive to keep them engaged and motivated. - Setting clear targets and promotion levels is fundamental for long-term career progression. - There can be a lot of improvement in terms of peer recognition in meetings, conferences, etc, which at the moment is very poor.", "rating": 3, "pros": "- total support with professional development (i.e. IMC, CFA, etc.)", "cons": "- flat structure not allowing for senior staff to be promoted which contributes to high turnover and constant restructure", "advice": "-Concentrate on managing down."}, {"title": "they'll give you time to learn and grow, good HR policies, money not great, competent investment teams", "text": "Pros - good work life balance - you'll get the time to learn about investing and markets - enough good coaches around - at the junior/intermediate level, not a very political place - people tend to stick around in the firm, generally stable characters - a lot of exposure to senior managers at an early stage - excellent HR - free gymnasium - a true \"buy-side\" firm: they care about their clients, their reputation and their investment performance. - good pension contribution from the firm Cons - pay not good enough - sometimes cautious to the extent of being annoying - very little EM footprint - hedge fund platform/pe platform leaves lot to be desired Advice to Management generally a good place to work for but need to improve retention of juniors. more communication will help. time to expand the firm's reach further, faster.", "rating": 5, "pros": "- good work life balance", "cons": "- pay not good enough", "advice": "generally a good place to work for but need to improve retention of juniors. more communication will help. time to expand the firm's reach further, faster."}, {"title": "Old established City bank", "text": "Pros Competent, friendly people, interesting work, the work-life balance tends to be better than some other financial organisations. Convenient location near St. Pauls. Cons Remuneration not very competitive. Job security still poor. How you are treated depends very much on your boss. Too many internal reorganisations. Middle management don't sometimes understand just how hard their people work. Advice to Management Senior management tend to be preoccupied with spending cuts and a \"more from less\" mindset; there is a limit to just how far they can squeeze things.", "rating": 3, "pros": "Competent, friendly people, interesting work, the work-life balance tends to be better than some other financial organisations. Convenient location near St. Pauls.", "cons": "Remuneration not very competitive. Job security still poor. How you are treated depends very much on your boss. Too many internal reorganisations. Middle management don't sometimes understand just how hard their people work.", "advice": "Senior management tend to be preoccupied with spending cuts and a \"more from less\" mindset; there is a limit to just how far they can squeeze things."}, {"title": "A great brand", "text": "Pros Relaxed working environment, low staff turnover and a great name in the City enabling opportunities beyond working for the company Cons Pay is not great although benifits and holidat allowance partially make up for poor basic compensation. Inequality of pay in senior management. Advice to Management Senior management need to integrate themselves better and understand the day to day running of the business. Otherwise, can't grumble.", "rating": 5, "pros": "Relaxed working environment, low staff turnover and a great name in the City enabling opportunities beyond working for the company", "cons": "Pay is not great although benifits and holidat allowance partially make up for poor basic compensation. Inequality of pay in senior management.", "advice": "Senior management need to integrate themselves better and understand the day to day running of the business. Otherwise, can't grumble."}, {"title": "Nice place to work!", "text": "Pros Quality staff, systems and organisation. Good employees facilities. Just the right size company, not too big or small. Cons Less $ than investment bank Advice to Management Good managment who took accountability for their actions", "rating": 5, "pros": "Quality staff, systems and organisation. Good employees facilities.", "cons": "Less $ than investment bank", "advice": "Good managment who took accountability for their actions"}, {"title": "Good place to work.", "text": "Pros Schroders are moving forwards in the use of technology and modern financial techniques to keep up with the best competition. Cons If you're in the back office then lack of ablity to move from back to front office, no worse than average though. Advice to Management Keep up the good work. But spend the cash pile once valuations have improved or else return it to shareholders.", "rating": 5, "pros": "Schroders are moving forwards in the use of technology and modern financial techniques to keep up with the best competition.", "cons": "If you're in the back office then lack of ablity to move from back to front office, no worse than average though.", "advice": "Keep up the good work. But spend the cash pile once valuations have improved or else return it to shareholders."}]