[{"title": "Great team and place to work", "text": "Pros SelfMade is a great place if you’re looking to work for a growing company where leadership is invested in your professional and personal development. The two founders genuinely care that everyone is growing and evolving. There is a culture of transparency and collaboration and you can learn about building a business from the ground up. The team is smart and driven and genuinely enjoys each other’s company Cons Definitely hard work required of any startup at this stage but the whole team is committed and working alongside you. You have to figure out stuff on your own and there isn’t a playbook handed to you- which is a pro or con depending what you are looking for.", "rating": 5, "pros": "SelfMade is a great place if you’re looking to work for a growing company where leadership is invested in your professional and personal development. The two founders genuinely care that everyone is growing and evolving.", "cons": "Definitely hard work required of any startup at this stage but the whole team is committed and working alongside you.", "advice": null}, {"title": "Great team, horrible product and management", "text": "Pros Really cool office and fun group outings. The team has a fun vibe and everyone genuinely cares about their work and the growth of the company. Cons Zero growth opportunities, multi team layoffs, and depending on your manager, likely a whole lot of micromanaging. The CEO can be really motivational, but is also extremely unapproachable with lots of favoritism going on. The product is a great idea, but it’s not just “startup growing pains” that are slowing success. Advice to Management Reward hard work. Bonuses and raises go a lot further than snacks.", "rating": 3, "pros": "Really cool office and fun group outings. The team has a fun vibe and everyone genuinely cares about their work and the growth of the company.", "cons": "Zero growth opportunities, multi team layoffs, and depending on your manager, likely a whole lot of micromanaging. The CEO can be really motivational, but is also extremely unapproachable with lots of favoritism going on. The product is a great idea, but it’s not just “startup growing pains” that are slowing success.", "advice": "Reward hard work. Bonuses and raises go a lot further than snacks."}, {"title": "Image Specialist", "text": "Pros Wonderful staff and plenty of opportunities to learn about coworkers Cons Similar to a revolving door, new part-time employees would come in only to later leave or be let go with an extremely short notice", "rating": 5, "pros": "Wonderful staff and plenty of opportunities to learn about coworkers", "cons": "Similar to a revolving door, new part-time employees would come in only to later leave or be let go with an extremely short notice", "advice": null}, {"title": "It Was Good At First", "text": "Pros - Working at your own schedule - Getting to do a job that I love -Improving editing skills by using techniques I usually wouldn't use Cons - Office team doesn't seem to listen to or respect editors working remotely - Seems like they outsource their workers so they can pay them cheaply -No transparency with the main office Advice to Management Listen to your editors, treat them better. We do a lot of work and a lot of it goes unnoticed.", "rating": 3, "pros": "- Working at your own schedule", "cons": "- Office team doesn't seem to listen to or respect editors working remotely", "advice": "Listen to your editors, treat them better. We do a lot of work and a lot of it goes unnoticed."}, {"title": "Fantastic place to work!", "text": "Pros - solving new/challenging problems that haven't been solved before - opportunity to make a huge impact on the company and user base - incredibly smart, fun, hard-working and creative coworkers - transparent culture - focus on design Cons - before moving to Little Italy, our office was small. We could only turn on the AC in one room at a time. Now we have lots of space and lots of AC - every 2 to 3 weeks or so we run out of seltzer", "rating": 5, "pros": "- solving new/challenging problems that haven't been solved before", "cons": "- before moving to Little Italy, our office was small. We could only turn on the AC in one room at a time. Now we have lots of space and lots of AC", "advice": null}, {"title": "Image Specialist", "text": "Pros Fun Team Always work available Can manage your own time Cons No fixed salary Bonuses are hard to aquire", "rating": 5, "pros": "Fun Team", "cons": "No fixed salary", "advice": null}]