[{"title": "A challenge every day", "text": "Pros Fast paced environment with a steep learning curve. Ability to implement your own projects and highly diverse projects from every department! Cons Not a lot of team activities.", "rating": 5, "pros": "Fast paced environment with a steep learning curve.", "cons": "Not a lot of team activities.", "advice": null}, {"title": "Company", "text": "Pros Nice atmosphere Intelligent colleagues Excellent coffee and Friday BBQ Cons Not enough communication between departments Not enough alignment between departments Advice to Management Improve reporting Improve Marketing efforts", "rating": 5, "pros": "Nice atmosphere", "cons": "Not enough communication between departments", "advice": "Improve reporting"}, {"title": "A Soap Opera", "text": "Pros Great starting salary and bonuses Some really fantastic people Limitless opportunity to pursue your own strategy Cons A product that didn't work or suit the needs of the clients Catastrophic disarray in overall strategy and operations Scattergun and upsetting approach to hiring and firing Outspoken characters fired for speaking the truth for the good of the business Zero confidence that you would still be employed at the start of each week Managers who were there by virtue of connections or favouritism rather than ability Amazing incompetency in many important parts of the business Marketing focused on flights of fancy rather than selling the product Cringeworthy use of fist bumps, 'go team,' 'rockstar' etc to build team morale Lies told to smooth over unpopular decisions and to paint a rosier picture than the all too apparent reality Advice to Management The business and management principles of Kim Jong-un are not a good model for any company.", "rating": 3, "pros": "Great starting salary and bonuses", "cons": "A product that didn't work or suit the needs of the clients", "advice": "The business and management principles of Kim Jong-un are not a good model for any company."}, {"title": "Used to be a good place", "text": "Pros - Great team - Great idea with a lot of potential - Nice office - Fair C&B - Very good first 18 months Cons - Extreme (70+) working hours for about 30% of the employees - Very hard culture change in 2017 - Big layoff in 2017 with not enough fairness and transparency in communication - Free pizza won't gonna help if there is no professional communication Advice to Management If you want to play like rocket, don't pretend to be something else.", "rating": 3, "pros": "- Great team", "cons": "- Extreme (70+) working hours for about 30% of the employees", "advice": "If you want to play like rocket, don't pretend to be something else."}, {"title": "Awesome company - rocking the office management market", "text": "Pros - great international culture - high energy - fair compensation Cons - lots of work (which is also at the end rewarding)", "rating": 5, "pros": "- great international culture", "cons": "- lots of work (which is also at the end rewarding)", "advice": null}, {"title": "Great startup", "text": "Pros ++ great culture ++ very good team spirit ++ nice office, lots of perks (fresh fruit, massages, sport teams, ...) ++ business idea that works Cons - sometimes loud office - fast growth is challenging Advice to Management Do not grow to fast, concentrate on structure and processes", "rating": 5, "pros": "++ great culture", "cons": "- sometimes loud office", "advice": "Do not grow to fast, concentrate on structure and processes"}]