[{"title": "So far this has been awesome - great team and great work", "text": "Pros Its a very social team with great ambition. It’s a company in the making and at this stage you have the freedom to guide it. Everyone’s ideas are encouraged and taken seriously. It feels like we are all in it together and that great things are happening... Cons Difficult to answer. It’s a startup, meaning it’s all encompassing and everyone is pushing each other hard to make this a success. Advice to Management Don’t ever change. Keep hiring people that fit the culture and all the rest will fall into place.", "rating": 5, "pros": "Its a very social team with great ambition. It’s a company in the making and at this stage you have the freedom to guide it. Everyone’s ideas are encouraged and taken seriously. It feels like we are all in it together and that great things are happening...", "cons": "Difficult to answer. It’s a startup, meaning it’s all encompassing and everyone is pushing each other hard to make this a success.", "advice": "Don’t ever change. Keep hiring people that fit the culture and all the rest will fall into place."}, {"title": "Never had so much fun building something great!", "text": "Pros First and foremost, the team is incredible! We are all in this together and have formed such a strong friendly, collaborative and encouraging culture to take us all the way. The amazing talent in the office propels everyone forward together and I love working here. Testament to this comes from friends and family who say my face lights up every time I talk about work. Cons Is too much fun a con...? Advice to Management Never lose our core values", "rating": 5, "pros": "First and foremost, the team is incredible! We are all in this together and have formed such a strong friendly, collaborative and encouraging culture to take us all the way. The amazing talent in the office propels everyone forward together and I love working here. Testament to this comes from friends and family who say my face lights up every time I talk about work.", "cons": "Is too much fun a con...?", "advice": "Never lose our core values"}, {"title": "Passionate and driven team", "text": "Pros A very driven and energetic team all working towards a common goal, making sure to create a fun and dynamic working environment along the way! Cons As long as you're prepared to work across departments and outside of your role and are interested in working and learning across all parts of the business (which I see as a massive bonus!), I haven't found any downside to being part of the team at ShieldPay. Advice to Management Great team, exciting times - keep it up! Count myself lucky to be a part of the team.", "rating": 5, "pros": "A very driven and energetic team all working towards a common goal, making sure to create a fun and dynamic working environment along the way!", "cons": "As long as you're prepared to work across departments and outside of your role and are interested in working and learning across all parts of the business (which I see as a massive bonus!), I haven't found any downside to being part of the team at ShieldPay.", "advice": "Great team, exciting times - keep it up! Count myself lucky to be a part of the team."}, {"title": "Great place to work - Very engaging culture", "text": "Pros ShieldPay have worked hard to build a team of passionate and dedicated professional people. Everyone works hard, but also knows how to have a good time. There is an all round good atmosphere and you really feel the team is trying to making a difference in delivering its mission. Communication between everyone is generally very good and you get soaked up in everything very quickly. A very exciting place to be. Cons Not many things actually. The business is growing quickly and the team is passionate to keep it a tight knit and well run team with the right culture. Advice to Management Keep it up and ensure that with the growth the culture remains the same and never lose sight of the goal.", "rating": 5, "pros": "ShieldPay have worked hard to build a team of passionate and dedicated professional people. Everyone works hard, but also knows how to have a good time. There is an all round good atmosphere and you really feel the team is trying to making a difference in delivering its mission. Communication between everyone is generally very good and you get soaked up in everything very quickly. A very exciting place to be.", "cons": "Not many things actually. The business is growing quickly and the team is passionate to keep it a tight knit and well run team with the right culture.", "advice": "Keep it up and ensure that with the growth the culture remains the same and never lose sight of the goal."}, {"title": "A great team in a business that's going places", "text": "Pros Fantastic close knit and highly skilled team Working on a product fixing real problems with loads of interest Great office location Huge opportunities for everyone Everyones opinion matters and gets actioned Cons Really fast paced, being first to market, not for the feint hearted High performing team - you'l need to be on top of your game! Advice to Management Keep it going, keep the culture", "rating": 5, "pros": "Fantastic close knit and highly skilled team", "cons": "Really fast paced, being first to market, not for the feint hearted", "advice": "Keep it going, keep the culture"}]