[{"title": "high stress", "text": "Pros some team members are great Cons micro management poor goal setting lack of positive feedback when something good happens but much bad feedback when something bad happens some of management create hostile atmosphere Advice to Management ask everyone who work for you for feedback and listen to what they have to say. all workers talk to each other.", "rating": 3, "pros": "some team members are great", "cons": "micro management", "advice": "ask everyone who work for you for feedback and listen to what they have to say. all workers talk to each other."}, {"title": "Great culture, great product", "text": "Pros I really like the culture at Simplaex: Clear expectations and freedom to find my own way to come to the expected result. There is always a colleague ready to help you if needed. The team is young, engaged and really diverse. The mix of different nationalities makes a very attractive environment. Most important: great product! Cons Only small things, not worth to be mentioned here. Advice to Management Continue and make this outstanding product successful all over the world.", "rating": 5, "pros": "I really like the culture at Simplaex: Clear expectations and freedom to find my own way to come to the expected result. There is always a colleague ready to help you if needed. The team is young, engaged and really diverse. The mix of different nationalities makes a very attractive environment. Most important: great product!", "cons": "Only small things, not worth to be mentioned here.", "advice": "Continue and make this outstanding product successful all over the world."}, {"title": "Learning by doing and doing by learning", "text": "Pros At Simplaex everyone has a lot of freedom to fulfill their role. This gives great responsibility and a sense of ownership. Employees are willing to help each other along the way. Thumbs up! Cons It took me too long to think about that, so.. nope! Advice to Management Hire the best!", "rating": 5, "pros": "At Simplaex everyone has a lot of freedom to fulfill their role. This gives great responsibility and a sense of ownership. Employees are willing to help each other along the way. Thumbs up!", "cons": "It took me too long to think about that, so.. nope!", "advice": "Hire the best!"}, {"title": "As simplaex as that", "text": "Pros - nice colleagues - interesting product - diversity of tasks - flexible hours of work - 100% reliable payments Cons Honestly, I have no idea what to write in here.  If I have some cons I`ll let you know!", "rating": 5, "pros": "- nice colleagues", "cons": "Honestly, I have no idea what to write in here.", "advice": null}, {"title": "startup vibe at its best", "text": "Pros - really cool and international team - interesting product - diversity of tasks - fast growing - management encourages self-development and learning - Berlin is really cool!!! Cons - not many to begin with... well, maybe not enough transparency between the different departments Advice to Management to continue to encourage the development of employees and to keep up the good work", "rating": 5, "pros": "- really cool and international team", "cons": "- not many to begin with... well, maybe not enough transparency between the different departments", "advice": "to continue to encourage the development of employees and to keep up the good work"}, {"title": "QA Engineer", "text": "Pros Startup vibe, good location, good enumeration Cons Unstable, micromanaging, Plenty of firing rounds. Advice to Management Let the people you hire do what you hired them for.", "rating": 1, "pros": "Startup vibe, good location, good enumeration", "cons": "Unstable, micromanaging, Plenty of firing rounds.", "advice": "Let the people you hire do what you hired them for."}]