[{"title": "Truly amazing team", "text": "Pros Simple Contacts is unlike any startup I've ever worked for. Everyone is so incredibly positive and friendly, it's an actual joy to come to work every day. Really, really smart people and an awesome product. Plus the usual startup perks -- uncapped time off, weekly lunches, coffee and snacks (cold brew on tap!), team outings, etc -- without any of the frat-house culture so prevalent in the industry. Cons Still figuring out our processes because we're so young, but that's par for the course Advice to Management Keep prioritizing culture even as we scale, it makes all the difference", "rating": 5, "pros": "Simple Contacts is unlike any startup I've ever worked for. Everyone is so incredibly positive and friendly, it's an actual joy to come to work every day. Really, really smart people and an awesome product. Plus the usual startup perks -- uncapped time off, weekly lunches, coffee and snacks (cold brew on tap!), team outings, etc -- without any of the frat-house culture so prevalent in the industry.", "cons": "Still figuring out our processes because we're so young, but that's par for the course", "advice": "Keep prioritizing culture even as we scale, it makes all the difference"}, {"title": "Great place to work!", "text": "Pros - Fantastic workplace environment with high emphasis on not only high paced business growth but also personal development. - Management kept everything transparent and pushed everyone to perform their best, taking a vested interest in each employee of the company. - Optional company-paid off-sites in interesting locations. - Flexible work from home policy. Cons Long work hours due to small but growing team Advice to Management Keep doing what you're doing.", "rating": 5, "pros": "- Fantastic workplace environment with high emphasis on not only high paced business growth but also personal development.", "cons": "Long work hours due to small but growing team", "advice": "Keep doing what you're doing."}, {"title": "Awesome place to work", "text": "Pros Working with smart, talented people on interesting projects. Really nice founders. A lot of people wear more than one hat and it's a supportive environment for career development. Fun off-sites and happy hours. Cons It's a startup so it is busy, but there is still a good work-life balance. Advice to Management Keep doing what you're doing!", "rating": 5, "pros": "Working with smart, talented people on interesting projects. Really nice founders. A lot of people wear more than one hat and it's a supportive environment for career development. Fun off-sites and happy hours.", "cons": "It's a startup so it is busy, but there is still a good work-life balance.", "advice": "Keep doing what you're doing!"}]