[{"title": "Einfach nur Super", "text": "Pros Selten solch nette Vorgesetzte gehabt - die Arbeit ist spannend und der Firmenhintergrund fordert auf zum aktiven Mitarbeiten, keine eingestaubten Prozesse - im Gegenteil ! Das Betriebsklima toll, frische, junge , offene Atmosphäre in allen Bereichen, bei Problemen oder Fragen ist immer jemand da, der ein offenes Ohr hat, nette Talks zwischendurch mit den Kollegen - da passt einfach alles ! Interessant auch das multilinguale Team und die vielen jungen Mitarbeiter. Bin echt happy bei Smacc zu arbeiten. Cons keine Kontras, für mich stimmt alles. Ich bin noch nie so gerne zur Arbeit gefahren. Für mich passt einfach alles !!! Advice to Management Macht weiter so - bin ehrlich begeistert und wünsche Euch und Eurer Idee alles erdenklich Gute !!!!!", "rating": 5, "pros": "Selten solch nette Vorgesetzte gehabt - die Arbeit ist spannend und der Firmenhintergrund fordert auf zum aktiven Mitarbeiten, keine eingestaubten Prozesse - im Gegenteil ! Das Betriebsklima toll, frische, junge , offene Atmosphäre in allen Bereichen, bei Problemen oder Fragen ist immer jemand da, der ein offenes Ohr hat, nette Talks zwischendurch mit den Kollegen - da passt einfach alles !", "cons": "keine Kontras, für mich stimmt alles. Ich bin noch nie so gerne zur Arbeit gefahren. Für mich passt einfach alles !!!", "advice": "Macht weiter so - bin ehrlich begeistert und wünsche Euch und Eurer Idee alles erdenklich Gute !!!!!"}, {"title": "I ❤️ SMACC", "text": "Pros Flexible Arbeitszeiten, entspannte und nette Chefs, super Kollegen mit denen man gerne die Mittagspause verbringt, Cons Die Verkehrsanbindung ist zwar gut, aber es ist trotzdem nicht um die Ecke...", "rating": 5, "pros": "Flexible Arbeitszeiten, entspannte und nette Chefs, super Kollegen mit denen man gerne die Mittagspause verbringt,", "cons": "Die Verkehrsanbindung ist zwar gut, aber es ist trotzdem nicht um die Ecke...", "advice": null}, {"title": "Angenehme Atmosphäre", "text": "Pros Der Altersdurchschnitt des gesamten Teams ist sehr niedrig, die technische Ausstattung auch okay. Zudem gibt es Getränke (Kaffee, Wasser, Club Mate) sowie täglich frisches Obst zur Nervenstärkung. Außerdem gibt es einen wunderbaren, lieben Hund :) Das so genannte \"All Hands Meeting\" ist eine sehr schöne \"Erfindung\", um auch an den anderen Teilen des Unternehmens teilhaben zu können und zu wissen, was andere Abteilungen derzeit bewerkstelligen. Cons Eine günstige und sättigende Möglichkeit zum Essen ist leider nicht in unmittelbarer Nähe. Advice to Management VL anbieten, Teilnahme am DAK-Firmenlauf als Werbemaßnahme", "rating": 5, "pros": "Der Altersdurchschnitt des gesamten Teams ist sehr niedrig, die technische Ausstattung auch okay. Zudem gibt es Getränke (Kaffee, Wasser, Club Mate) sowie täglich frisches Obst zur Nervenstärkung. Außerdem gibt es einen wunderbaren, lieben Hund :)", "cons": "Eine günstige und sättigende Möglichkeit zum Essen ist leider nicht in unmittelbarer Nähe.", "advice": "VL anbieten, Teilnahme am DAK-Firmenlauf als Werbemaßnahme"}]