[{"title": "To balance things out ... a sensible perspective", "text": "Pros - FAST paced conditions, exciting technology and genuine opportunities for the right people. ALL tech companies need to move quickly to keep up with the space they work in; don't evolve or change, you'll look round and realize you've been left behind. Looking for a 9-5 role? Can't stand the heat? Don't like to embrace change? This isn't the ride for you. - THE Customer Experience Management Platform: Customers who have experienced other' social media' software solutions and have the teams in place that are mature enough to appreciate what we are doing, understand why Sprinklr is the answer. The product team continue to expand and enhance the product. After several large acquisitions, of course it takes time to bring the technology into one unified platform. We are on the right track (all tracks have bumps) and we will continue to crush the competition for many years to come. - GREAT customers: We work with many of the world's largest companies across their marketing, advertising, research, care and commerce teams - and beyond. We help solve their problems in order for them to provide positive experiences for their customers. - Work/Life balance: Good pay and benefits. Work hard, play hard. If you're being micro-managed in your current role, ask yourself why that is? Can you look yourself in the eye at the end of EVERY day and say you've done the best you possibly could and have worked to the highest possible standards? If yes, you won't have anything to worry about. Cons - All companies that grow, especially those that have grown at the pace of Sprinklr, experience what is being felt right now. Change. The company does need to work harder at keeping the 'Sprinklr culture' alive. Easier said than done when a lot of the 'old school' have left and new teams are being built. It's down to the Execs & Senior Management to frequently communicate the good, bad and ugly - and remind us why we are here and the direction for us all to follow. Advice to Management - I wanted to write this as I feel some of the recent reviews & criticisms here are unfair. I appreciate some of these may have been written (perhaps tinged with bitterness) by recent ex-employees who seem quick to forget the good times, the skills they have learnt and the positive experiences they had while here. - It's OK. EVERYONE is learning every day. Keep doing what you feel is best for the company and employees - but most importantly OUR CUSTOMERS. They must continue to come first for us to succeed.", "rating": 5, "pros": "- FAST paced conditions, exciting technology and genuine opportunities for the right people. ALL tech companies need to move quickly to keep up with the space they work in; don't evolve or change, you'll look round and realize you've been left behind. Looking for a 9-5 role? Can't stand the heat? Don't like to embrace change? This isn't the ride for you.", "cons": "- All companies that grow, especially those that have grown at the pace of Sprinklr, experience what is being felt right now. Change. The company does need to work harder at keeping the 'Sprinklr culture' alive. Easier said than done when a lot of the 'old school' have left and new teams are being built. It's down to the Execs & Senior Management to frequently communicate the good, bad and ugly - and remind us why we are here and the direction for us all to follow.", "advice": "- I wanted to write this as I feel some of the recent reviews & criticisms here are unfair. I appreciate some of these may have been written (perhaps tinged with bitterness) by recent ex-employees who seem quick to forget the good times, the skills they have learnt and the positive experiences they had while here."}, {"title": "Not that good as it was years ago..!!", "text": "Pros Free lunch and snacks festival celebrations macbook pro (will be given windows now for SDET's/QA's) Cons The company has changed a lot over an year and i personally feel the company is not even caring for its employees and their problems. I think none of the core values of the company are followed now. Seniors are not given proper respect by some devs. Advice to Management @CTO Kindly don't only consider automation into account when it comes to SDET's performance or appraisals as automation alone can never give us great product. It's the combination of both manual and automation efforts. Kindly take number of support tickets verified and QA bugs filed by each individual into account. If a person has verified more support tickets then that means she is concerned about customer satisfaction. If she has filed more number of bugs then that means she has worked a lot on the product features to make them bug free. So, Kindly consider, all these factors into account during individual performance appraisals.", "rating": 3, "pros": "Free lunch and snacks", "cons": "The company has changed a lot over an year and i personally feel the company is not even caring for its employees and their problems. I think none of the core values of the company are followed now. Seniors are not given proper respect by some devs.", "advice": "@CTO Kindly don't only consider automation into account when it comes to SDET's performance or appraisals as automation alone can never give us great product. It's the combination of both manual and automation efforts. Kindly take number of support tickets verified and QA bugs filed by each individual into account. If a person has verified more support tickets then that means she is concerned about customer satisfaction. If she has filed more number of bugs then that means she has worked a lot on the product features to make them bug free. So, Kindly consider, all these factors into account during individual performance appraisals."}, {"title": "Points to be kept in mind before joining", "text": "Pros 1) Mac Book to all 2) Free Food ( though the quality & quality of food has decreased, even sometimes the food gets over in the kitchen within half an hour) 3) Good tool to work on 4) Handsome package for the freshers 5) You are surrounded by brilliant minds under one roof. Most people are from IIT's, IIM's and other well reputed colleges Cons 1) No work life balance 2) Fake promises by the company about perks especially in Gurgaon office. For ex. (A) The company has failed to reimburse the GYM membership fee as promised at the time of joining. (B) The company also promise to deliver a birthday gift voucher on your birthday which in reality doesn't exist. They keep on extending the dates for issuing birthday voucher as well as the reimbursement for gym membership. 3) Unrealistic targets and employees are forced to extend their shifts and even take hell lot of work for home. 4) Low retention ratio. 5) The environment in the company is also at times dead, all you see is people just typing codes and be busy with work as the work load is too much. 6) The food is used to be the USP of Sprinklr but the quality of food has gone down from past few months. 7) At times the managers are very rude and pushy. 8) Though the Sprinklr as a product is par excellence but it is unstable too, which results in increasing your shift hours and working more and more on it. Advice to Management Please focus on the above points to make the company the best place to work with.", "rating": 3, "pros": "1) Mac Book to all", "cons": "1) No work life balance", "advice": "Please focus on the above points to make the company the best place to work with."}, {"title": "After 2 years at Sprinklr", "text": "Pros Sprinklr London has nice employees, great benefits such as getting your nails done for women and haircuts for men as well as massages and reflexology on a monthly basis. Also supplies of fruits and sweets and regular lunches. The office has mostly a nice vibe but really depends on your team it can be quite hit or miss. Cons The management! Ive never seen so many employees doing absolutely nothing and not only not being ket go of but even getting promoted. However on average a year later when in their new role and couldn't hide anymore were then let go. Ive seen about 4 of those cases in my time. I personally found that very frustrating as a hard worker and was overlooked for a promotion. Advice to Management Improve HR, hire more locally placed people. Too many work remote.", "rating": 3, "pros": "Sprinklr London has nice employees, great benefits such as getting your nails done for women and haircuts for men as well as massages and reflexology on a monthly basis. Also supplies of fruits and sweets and regular lunches. The office has mostly a nice vibe but really depends on your team it can be quite hit or miss.", "cons": "The management! Ive never seen so many employees doing absolutely nothing and not only not being ket go of but even getting promoted. However on average a year later when in their new role and couldn't hide anymore were then let go. Ive seen about 4 of those cases in my time. I personally found that very frustrating as a hard worker and was overlooked for a promotion.", "advice": "Improve HR, hire more locally placed people. Too many work remote."}, {"title": "A company in transition", "text": "Pros All pros and cons are result of characteristics the company has. One really good pro about a workplace because of certain characteristic can also result in really bad and deal breaker con in different context. Sprinklr is going through the same. The transition from a startup to a potential big company is not going well ( especially for its R&D team, which is the engine of Sprinklr). I will try to point out the best Sprinklr has to offer and cons that either were always present or have emerged recently. 1. For me the best thing about working at Sprinklr is the ownership you get for the work, which is completely independent of your length of employment. You joined a team for only 1 week and you are told to do complete refactoring of one of the most business critical component in that module. It makes you feel as if you have a piece in this big thing which is completely yours. 2. Salary. Its really good especially for complete beginners like college graduate. Also everything is in hand i.e. what CTC quotes is what you get every month in your bank account. No cab cost, or sodexo coupons or shares. Many big companies quote huge CTC but only later you get to see that monthly pay is a lot less than what you expected. 3. Technology stack. In some departments the stack is as modern as it can be. Latest technology trends are adapted quickly and pushed in production. But some departments need to update its stack and bring new trends in company. But inspite of old stack, there is tremendous learning opportunity for everyone. Sprinklr will always support you ( especially in monetary ways ) in your learning, you can enroll in online courses, buy books and everything will be reimbursed. 4. Free food. There is a kitchen that serves 3 meals and while the quality of food goes up and down, its overall satisfactory. There is also a pantry which serves tea, bournvita and other snacks throughout the day. 5. Promotion and increment in salary can come too quickly if you are in the right place at right time. Salary increment of 100% is quite common. Employee stock options are also given after promotion. But there are some issues in this whole promotion process which I will discuss in detail in cons section. 6. Surprise gifts. Sprinklr knows how to please its employees. Latest iPhones or foreign trips for entire team after some major milestone happens frequently. Party can be thrown at any day with lots of pizza, drinks and a rock band in office. 7. Potential. Sprinklr has huge potential to be a great player in market because its really at right spot at right time. The innovation and disruption it can cause is amazing and people working here or coming to work here know that they have hit a gold mine. Cons If you see Sprinklr rating trend on Glassdoor you can clearly see it has gone down quite a lot in last one year. And rating truly reflects the company current state. I would have given Sprinkr atleast 4 stars but issues below make it impossible to rate the current conditions any higher than 3.5 1. The biggest problem with Sprinklr right now, which was its biggest strength in past, is its speed. Sprinklr always believed in getting things done at extremely fast pace. Modules/features were delivered to clients whenever they needed completely disregarding any time limitations. But the bigger and complex something becomes more time is required to change it without causing any breakage. Many people at top are still trapped in old Sprinklr days where things were going at fast pace because there were very little complexities. But they complete disregard that Sprinklr now is a really big company with a mammoth size codebase. Its not possible to re-write a module that was built in past 2 years in 2 days and release it without any bugs. Its not a question on the developer coding quality but your management capability. And if the management doesn't expect it to be delivered in such short period, then be realistic about this and form a proper roadmap with realistic deadlines considering all factors ( available resources, client priorities, regression ) instead of dispatching impossible missions on your team. Tell your team that client need this thing by this time and then believe in your team to come up with best plan. Majority of people here treats this company as their own company ( see pro #1 ). 2. Talk doesn't match action. A company is built on trust. Its importance is paramount. Sprinklr has done a poor job in ensuring its employees that they can put their complete trust in it. While there are great leaders in workplace whom you can always lookup to and you know they have your back, a few people at top have not realised that trust is something that is the key in differentiating between a leader and a boss. And talented and hard working employees need leaders not boss. Trust is broken every time you promise something that even you know is not going to happen. What Sprinklr already provides is great but these broken promises and false hopes are what make employees frustrated the most and they think about leaving and venting out their anger on Glassdoor reviews. 3. Recognition and Promotion Process. The system to recognise the hard working employees and promote them accordingly is never easy for any company but Sprinklr has never paid even tiny attention to this. Promotion depends whether your team is doing well or whether you have good relations with seniors or whether you were lucky to have got some new big features/modules instead of being stuck in maintaining the existing code and solving client support tickets and bugs. Employees need a proper feedback on regular interval. one-on-one are important and shouldn't happen only once a year just to inform you why you are not being promoted now but could be promoted after 6 months. And even after 6 months of hard work people are not promoted without telling them any reason at all. This may seem opposite to what pro #5 states but its a reality. The variance is astronomically high in salaries but still the worst part is there was no feedback for the past whole year. If particular employee is not doing well, give him/her a proper feedback and help him/her. Don't surprise him/her after one year with a small increment while other people are enjoying double salary. 4. Discrimination between Dev and other staff ( especially QA, Design ). Dev team in Gurgaon experience all the cons specified above but they are also enjoy all the pros mentioned above. Other teams and especially QA and Design team have to deal with all the cons without all the awesome pros that Sprinklr offer its dev team. Low salary increments, no recognition, excluded from foreign trips while workload is almost same. This is one of the reason why platform quality is decreasing because talented QAs and designers are leaving company for other better opportunities. 5. Hierarchy structure. Developers have been running the R&D for quite some time. But in last one year managers were hired from IIMs to aid Sprinklr in becoming a big player. But the transition to a new hierarchy was not done properly. People are no longer sure of their roles and what or how much say they have in the process. This needs to be tackled as it can be the most catastrophic for Sprinklr out of all the cons that are mentioned here. 6. Work life balance. Its not good but most people neglect their health completely which I think is their own fault as its their onus. But if above cons are taken care of then I don't think most people in Sprinklr will mind work overloading their life. They will be happy to be part of something good and big. Advice to Management Walk the talk. Practise what you preach. Talk to employees about their problems. Most importantly don't put unrealistic deadlines or promises that you know are not going to happen. You have a great team and great potential in market. How you handle this phase will determine whether Sprinklr will go in history as a great company or a company that could have but couldn't.", "rating": 3, "pros": "All pros and cons are result of characteristics the company has. One really good pro about a workplace because of certain characteristic can also result in really bad and deal breaker con in different context.", "cons": "If you see Sprinklr rating trend on Glassdoor you can clearly see it has gone down quite a lot in last one year. And rating truly reflects the company current state. I would have given Sprinkr atleast 4 stars but issues below make it impossible to rate the current conditions any higher than 3.5", "advice": "Walk the talk. Practise what you preach. Talk to employees about their problems."}, {"title": "Intern - Sprinklr", "text": "Pros Good food. Flexible Working Hours. Cons No real interaction with CTO. Advice to Management Keep going, you guys are doing good work.", "rating": 5, "pros": "Good food. Flexible Working Hours.", "cons": "No real interaction with CTO.", "advice": "Keep going, you guys are doing good work."}, {"title": "The Sprinklr Way !!", "text": "Pros I cannot talk for everyone, I can only share, what Sprinklr Journey has been to me. Sprinklr was not my first job, I have worked in MNCs and seen the corporate world before landing here. Initial days were tough. It was very fast paced. Everyday there were discussion around creating new products or ensuring that customer issues were addressed in highest priority. I tried to get involved in everything I could, to add value in any possible way. I could find so many opportunities where I can help solve the issue or add value that wasn’t my primary role. In fact, no body cared what roles & designation you are. I love that about Sprinklr. I was given an unexpected hike in the very first 6 months of joining and I was really surprised. In fact, I asked, shouldn't we wait for at-least 1 year?   But I realised, I wasn’t an exception but a norm. To recognise and reward as soon as it can, has been always the Sprinklr way. Sprinklr can be challenging place for many people, who want everything organised and defined. It is not a place where one talk about job descriptions (JDs) all the time. It is place for people, who want to solve real problems. Who want to add value to the company and to themselves. Who has founders’ attitude. Who look / focus into the bright side of the coin and move forward. There is always so much opportunities, so much work to keep you hooked. You either love Sprinklr or hate Sprinklr.  And it depends on what you are seeking from your job. It depends on if you are looking for easy or not. For me, it has been a learning experience, much more than I ever thought. It is a place you add value to your self and to the company and create win –win situation everyday. Sprinklr works in a Pull model (not in Push model). Everyone tries to pull highest value adding opportunities to create maximum value. Love this freedom and opportunity about Sprinklr. I wont talk about good food and flexible timings, Goa Trips & outings and best salaries, as you can get that at many places. You wont get a place that make you feel that you have limitless opportunity and you share the founder’s concern of ensuring Customer Delight. Cons Refer to Pros section. World is not absolute unfortunately. All the pros , I have written can be cons for you. Advice to Management - No need to introspect, every time , someone gives a bad reviews. Lets talk more to the new joiners. Right nurturing in initial months is very important to enable them to start adding value to themselves first and then to the company. - Keep creating win -win opportunities for the company and employees. - Its human nature to crib when even a small things goes wrong and they hardly say THANKS , when so many things are so good. - Thank you Sprinklr !!. Not sure about others, but for me it has been just awesome journey so far.", "rating": 5, "pros": "I cannot talk for everyone, I can only share, what Sprinklr Journey has been to me.", "cons": "Refer to Pros section. World is not absolute unfortunately. All the pros , I have written can be cons for you.", "advice": "- No need to introspect, every time , someone gives a bad reviews. Lets talk more to the new joiners. Right nurturing in initial months is very important to enable them to start adding value to themselves first and then to the company."}, {"title": "Conditions for employees improving but still a lot to do", "text": "Pros 1. Amazing salary 2. Best laptops and technology stack to work on 3. Flexible timing (should be counted as a con too) 4. Responsible to the product 5. Free food and pantry Cons There are gonna be lot many: 1. If some feature breaks, either the developer or QA is responsible. Management isn't responsible which provides you the least time to build a feature 2. You can expect a call from office anytime 3. You don't have weekends. The build will go on Saturday which will cause QAs to burn out on Saturday then QA will file bugs on Saturday which will make developers to burn out on Sunday 4. Build goes every weekend (sometimes thrice a week. YES!!) 5. If a customer asks for some feature, managers will agree upon it without talking to developers about the sanity of the existing product which makes the product buggy. (they call them commitments) 6. They'll ask you to fix the bugs and judge you on how many bugs you're producing. 7. Flexible timings which makes you work at least 12 hours a day, 6 days a week 8. They'll make you write positive reviews on glassdoor and most of the positive ones are from people who are just 4-5 months into the company (YES!!) 9. Product managers who thinks building a feature is 5 minutes task (Did I say anything about \"commitments\" to the clients??) Advice to Management A lot many 1. Please be more responsible towards the employees. Give them little more time to code than just roaming over their heads about how this feature should be sent this weekend. 2. Ask the product managers to strongly remain in touch with developers about what can be done and what can't be. This is the main reason of buggy product. 3. Don't assume that QAs and developers are slaves and work for you. They should be working with you.", "rating": 3, "pros": "1. Amazing salary", "cons": "There are gonna be lot many:", "advice": "A lot many"}, {"title": "Amazing startup culture", "text": "Pros Colleagues are friendly. Need to be on toes to perform which is good if you have growth mindset Cons Gurgaon office needs a larger office space and few fun things to include.", "rating": 5, "pros": "Colleagues are friendly. Need to be on toes to perform which is good if you have growth mindset", "cons": "Gurgaon office needs a larger office space and few fun things to include.", "advice": null}, {"title": "Change management and communication is flat lining", "text": "Pros People and customer base and some of the product vision. These are good for now but not for long if current trends continue. Cons Empty words and missing leadership. Changes announced with no thought of the impact they may have on employees and the loyalty they feel to the people they have followed. Global sales leaders who have spent no time learning who people are and who the people are who will make customer and sales teams successful. Interim HR is now invisible. Employee engagement continues to crash. People on the ground floor screaming out for communication from leaders in the ivory tower. Enablement (known as services everywhere else in the market) teams under valued and cut regularly. new sales enablement leadership who is changing everything and trampling over anyone and everything just to get things done. Advice to Management Please please please talk to people. Don’t just choose a new book every quarter and think it is a substitute for strategy and communication of a plan. Leaders please please talk to each other and stop creating conflict down the ladder because you don’t. Hire a chief customer officer who is respected and understands the range of roles in the post sales teams. Be clear on what we will do and what we will stop doing. Tell teams what is most important and what not to spend time on. Everyone is trying to do everything all the time and it is causing burnout frustration and people to leave. Did I mention please please talk to people. Tell them what is happening. Tell them how they can make a difference. Tell them why they matter.", "rating": 1, "pros": "People and customer base and some of the product vision. These are good for now but not for long if current trends continue.", "cons": "Empty words and missing leadership.", "advice": "Please please please talk to people. Don’t just choose a new book every quarter and think it is a substitute for strategy and communication of a plan. Leaders please please talk to each other and stop creating conflict down the ladder because you don’t."}, {"title": "Really bad Work Culture", "text": "Pros Good Salary Free food Product idea is good Cons Messed up Work-life balance People work for even 12 - 14 hours a day.. I interned there last summer and I would say experience was horrible. No proper management was there to handle interns. And also not much talented people are there. they mostly hire from a sinle college and people work more like paid labourers than Software Engineers. Advice to Management Try to fix your management. Everyone is controlled by one guy in Gurgaon office Which is not going to be scalable for the company.", "rating": 1, "pros": "Good Salary", "cons": "Messed up Work-life balance", "advice": "Try to fix your management. Everyone is controlled by one guy in Gurgaon office Which is not going to be scalable for the company."}, {"title": "Lot of potential as company but upper management needs to improve", "text": "Pros Code stack is really good and lot of talented engineers around hence you will learn a lot. Scope to contribute to scaling and performance letting you grow in terms of talent. Good and free food. Cons Work keep on spilling to weekends(both days) over and over due to bad management and after certain time you will feel exhausted. Culture is bad, no respect and no professionalism. Advice to Management Please try to improve attitude towards everyone, rough language, sir culture, preferential treatment, and not understanding importance of people for a company will be bad for future.", "rating": 3, "pros": "Code stack is really good and lot of talented engineers around hence you will learn a lot.", "cons": "Work keep on spilling to weekends(both days) over and over due to bad management and after certain time you will feel exhausted.", "advice": "Please try to improve attitude towards everyone, rough language, sir culture, preferential treatment, and not understanding importance of people for a company will be bad for future."}, {"title": "Good work but bad work culture", "text": "Pros Get to learn a lot in short span of time Cons No life other than work", "rating": 3, "pros": "Get to learn a lot in short span of time", "cons": "No life other than work", "advice": null}, {"title": "Support is in WRONG hands", "text": "Pros Very few things to mention here, Office is great, but we dont feel like coming here, Food used to be good, now that sucks too, Product is great, but copied. Cons They keep trying new things with support engineers, are we your Lab Rats? 1st everyone was trained on everything, then split in modules, then split in clouds now we work on everything... What's next? As mentioned in a previous comment, management does not think about people, they have hired people from big brands, who keep talking about way things happen in Sales Force and other big brands. We are not Salesforce or Google or Microsoft or any big brand, please accept us as Sprinklr, 1 yardstick doesnt fit all. Great you have seen the world, but WE built this! Earlier, we had shortage of people and they hired a batch of people, after that another and another, and now suddenly no more hiring, because the company has a plan, are the people not a part of your plan??? Does the CEO or CTO or Support Management think that they can execute all plans by making the people work extra hours??? We dont want to become another Gurgaon! People in support are so frustrated right now that all of us are looking for jobs elsewhere. Its just a matter of time when we get another job and you will see an influx of resignations coming your way. FEEL FREE TO EXECUTE YOUR PLANS THEN. There is no fun anymore, we dont feel like coming to work. Earlier we used to have team outings, used to get gifts from the company, now its only work. The environment has become so toxic that we just wish some drastic measures are taken to improve things. I wish most of us are there to see those changes (IF AT ALL THEY HAPPEN), but with the new leadership, i dont think they ever will. Advice to Management My advice to the management is; Set your priorities, your engineers run the business for you, if you do not care for people, then who will CARE for you.", "rating": 1, "pros": "Very few things to mention here, Office is great, but we dont feel like coming here, Food used to be good, now that sucks too, Product is great, but copied.", "cons": "They keep trying new things with support engineers, are we your Lab Rats?", "advice": "My advice to the management is; Set your priorities, your engineers run the business for you, if you do not care for people, then who will CARE for you."}, {"title": "Sad to see a unicorn lose its sparkle", "text": "Pros If you had asked me a few years ago - I could have listed a bucket load. Today - its the people that are still there trying to make sure that the company sticks to its core values. The values of the majority of people in the company are spot on and you will make friends for life. Cons I have read a lot on here about specific people, and therefore i will keep this general. 1. You will work hard (harder than you ever have done in your life) 2. You wont have a career plan and will never break into management 3. You will feel like a very small cog - even though to your clients - you are the most important person working with them. 4. You will feel tired all the time as you cant change anything Advice to Management 1. Stop changing the direction of the product. Keep it simple, keep in un-complicated, keep it stable and look at what all customers want, not what some customers demand. 2. Clear out the management in every region - it is toxic. The problem with management is not that they are horrid or don't mean well. They simply do not know the product anymore. Some are micro-managers, some have no idea about the product, some used to know but now have been left behind. There is a wave of amazing people who support the management teams and they are left frustrated as unless you are 'friends' with someone in the higher management, you will never progress. 3. Stop telling everyone that everything is going well. Everyone at the company knows that the company is not meeting its goals. Why then do we continue to celebrate every chance we get? Why not knuckle down and do what we do best - Fix things. It makes management look even more deluded when people hear that things are going well when we all know they are not 4. Give the entire product team in India a break and show them so much more respect. I have had the pleasure of working with developers, QA's, Product owners and support teams. They are by far the single best assets Sprinklr has and they are not shown the respect they deserve (read other reviews about offices in India for more context). Instead of hiring new leaders for regions, new managers for people and new executives, why not cut the fat that is at Sprinklr and invest it to double the size of our product team and give them the best working conditions possible? 5. Listen to people, not just the ones who say things are great. Sprinklr was always great at listening 2-3 years ago. Now - it falls on deaf ears which is so sad to see.", "rating": 1, "pros": "If you had asked me a few years ago - I could have listed a bucket load. Today - its the people that are still there trying to make sure that the company sticks to its core values.", "cons": "I have read a lot on here about specific people, and therefore i will keep this general.", "advice": "1. Stop changing the direction of the product. Keep it simple, keep in un-complicated, keep it stable and look at what all customers want, not what some customers demand."}, {"title": "Good company but room for improvement", "text": "Pros Better perks and benefits. Good Facilities. Cons Management has to look all the way down at every level and improve process and policies. Advice to Management To Take care of employees", "rating": 5, "pros": "Better perks and benefits. Good Facilities.", "cons": "Management has to look all the way down at every level and improve process and policies.", "advice": "To Take care of employees"}, {"title": "Product Engineer", "text": "Pros No pros.Seriously not at all Cons They will abuse you any time . No peace in your life. They just want to make money by any how. CTO is fake totally. No care for employee health .They will urge to till you fall ill to complete the given task and still you have to do it . Advice to Management Please have some humanity .Money can not buy to everything", "rating": 1, "pros": "No pros.Seriously not at all", "cons": "They will abuse you any time . No peace in your life. They just want to make money by any how. CTO is fake totally. No care for employee health .They will urge to till you fall ill to complete the given task and still you have to do it .", "advice": "Please have some humanity .Money can not buy to everything"}, {"title": "Looking forward to the future", "text": "Pros Current, fun, talented people, great organisation!Learning every day, opportunity to experience different areas within the business. Able to add value Cons Change, lack of communication and no view of at all of what the strategy looks like (or no help to understand why changes are made) Advice to Management Trust your hires, communicate, listen to staff", "rating": 5, "pros": "Current, fun, talented people, great organisation!Learning every day, opportunity to experience different areas within the business. Able to add value", "cons": "Change, lack of communication and no view of at all of what the strategy looks like (or no help to understand why changes are made)", "advice": "Trust your hires, communicate, listen to staff"}, {"title": "Run far far away from this dying and the most hopeless workplace", "text": "Pros Work from home option on public holidays, as the office building is shut down on these days, which is not in the control of Sprinklr Writing any other pro is a sin, as it might give a false negligible positive impression about this sweatshop. Disclaimer After reading the reviews, if anyone still wants to join this sweatshop, then they truly deserve this horrible workplace. I wonder if I can find any workplace worse than this. It is screwed up in all the ways possible, all credit to the most crazy, inefficient CTO of Gurgaon branch. I sincerely request the IIT placement committees to ban this sweatshop (company if it can be called one) and save the students. IITians already have a bad impression about the Indian companies and the work culture. Please do not add more oil to this belief. Also the Gurgaon management makes fool of the IIT placement committee, by offering US placement just to get Day-1 slot. They wantedly did not file the H1-b visa application for some of this year’s US offered students, just because one senior employee wanted them to work in the Gurgaon office. Cons Highly unstable product: Lots of poor quality code gets checked in everyday, and they do not have a single unit test the maintain the sanity. The CTO’s principle is to make customers happy (by fooling them). He believes, it is a time waste to write unit or integration tests. To compensate for this, they have a release every Saturday. Developers are forced to push features or fixes very quick, so that any more resulting fixes can be fixed, the next weekend. Any major fixes, occurring from the hasty release, are sent on Saturday and Sunday. So, you have to be available every weekend 24/7. No quality work at all. Quantity is given preference over quality. Sir culture: You are forced to call your seniors as Sir. Only Sprinklr can have this most stupid culture all credit to you know who. The seniors get offended if you don’t call them by Sir. Egoistic senior co-workers: It is great capability of the CTO, that he could consistently maintain this culture among most of the senior employees (senior refers to more than 1 year experienced). You see 1 year experienced employees shouting on their junior freshers, who have just started learning. It is so very surprising how the CTO inculcates this into its employees. This makes the work place, very miserable and toxic. False promises : The CTO just speaks anything that comes to his mind. Gurgaon is highly polluted and the office is very crowded with no space at all. Till now, he has promised that the office will be shifting to places like Goa, Dharamshala, Chandigarh, Panchkula, etc since 2 years. They claimed they reimburse gym memberships, and after taking them, they refused to reimburse them. Long hours : You are expected to dedicate your life to them, just because they are paying your salary. You are constantly threatened to be fired if you can not align with them. You are under constant pressure 24/7 due to their inefficiency. A lot of Computer science students are hired to do manual testing and they do not believe in writing any tests and following any engineering process inspite of the company being 8 years old. Please do not spoil their careers by under utilising their talent. If you try take this up with HR, you will be fired soon, as they don't encourage anyone who do not align with their culture to work in the company. So also be careful when any senior employee asks for a feedback. Advice to Management Please strive to make Gurgaon branch, a remotely decent place to work.", "rating": 1, "pros": "Work from home option on public holidays, as the office building is shut down on these days, which is not in the control of Sprinklr", "cons": "Highly unstable product: Lots of poor quality code gets checked in everyday, and they do not have a single unit test the maintain the sanity.", "advice": "Please strive to make Gurgaon branch, a remotely decent place to work."}, {"title": "New support management is rude and not people friendly at all", "text": "Pros Great office Good product Good team work among engineers Cons No job security. In the last 6 months, the support team has a new set of leaders. All of them have no idea about the product, process or people. They are not even interested to know how it works. All we get is \"instruction to follow\" and a lot of times it makes no sense at all. They supposedly bring \"best practises\" from the industry but spend no time to understand how it can align with Sprinklr. As soon as they came, they started to fire people at every level. From engineers to senior directors. It was their way of making sure that everyone knows them. They have started again. All we talk is who's next. Everyone is under constant fear. Advice to Management Outside perspective is good but not at the cost of ridiculous changes. Please validate the changes. Someone from the board or the CEO should see if these changes are effective or just show offs. Sprinklr has always been a people centric company. Hire people who matches your culture. It's completely broken in the support team now. Stop treating employees as numbers in a spreadsheet. Where is the human touch of the old leaders? They used to know everyone personally. Your current set of leaders have bread disloyalty and fear. Is that how you want to continue? They sound diplomatic at best and ridiculous at other times. Bring in the old style of leadership. Let everyone work out of inspiration and not fear.", "rating": 1, "pros": "Great office", "cons": "No job security. In the last 6 months, the support team has a new set of leaders.", "advice": "Outside perspective is good but not at the cost of ridiculous changes. Please validate the changes. Someone from the board or the CEO should see if these changes are effective or just show offs."}, {"title": "New QA Management screwed up and no future for QA in Sprinklr", "text": "Pros 1 - Free food of low quality in Bangalore. 2 - Nice office. 3 - Free pantry. Cons The new QA management has screwed up everything and now it is not a healthy place for QA engineers. Please take this review very very very seriously else you will regret throughout your life. The biggest problem is the mindset of the CTO,dev leads and QA management. Senior QA managers and Leads are asked to leave in a day. 1 - New senior QA management is toooooooooooo arrogant and always talk about firing the Engineers on the floor. 2 - In last 8 months all the leads are kicked out. 3 - QA management only listens to CTO/Dev leads and due to some random decision some 40 QA engineers resigned in last 3 months. 4 - QA Management even didn't bothered to retain a single resource, all the talented folks are gone now. 5 - No clear career and growth path for QA. 6 - QA is treated like Slaves/donkey/dogs., even the daily wages workers have a better life. 7 - No work life balance, you will not be able to spend an hour with your family due to unplanned patches/releases. 8 - People are asked to write good reviews on Glassdoor. 9 - Every weekend releases.no one can escape from this. else you will get fired. 10 - QA has to be available 365 days - 24x7. 11 - Have to work on all public holidays, weekends, and festivels in south India. Recently QA management asked folks  to cancel the planned leaves for Dusherra. 12 - HR team is also helpless, if you and talk / complain they can't do anything as CTO is the BOSS here and don't listen to anyone. 13 - If you argue you will get fired next day. 14 - No planning for releases, random patches, on an average some 10 -15 patches are send every week. 15 - Very complex and Buggy product. 16 - lot of layoffs across the board. 17 - Developer with 1 year of experience will scold you.Everyone on the floor talks about just autoamtion but no one understand. 18 - No one respect QA, even Dev leads abuses if there is any miss from QA.Literally bad words are used. 19 - No team outings for QA in bangalore. For Gurgaon team every year there is outings in Goa, international outings. 20 - Developers are also treated like salves but they will team outings in Bangkok / Thiland /Goa 21 - In same company there are different policies for Bangalore and Gurgaon center     For Example : Team outings, Birthday Gift,Diwali gifts, Low quality food in bangalore office, Difference in laptops used in both the center. 22 - All dev leads shouts on QA., toxic culture everywhere, even the devs are frustated. 23 - Hike for QA is very bad instead of working 24x7. 24 - No insurance for hardware and if there is any damage to your machine/laptop you need to pay from your pocket. 25 - Time in and time out is tracked. Advice to Management Ask your CTO, Dev leads to give respect QA team, don't treat them as slaves. Be more transparent and respectful to people. Money and Free food is not everything. Let employees have there personal life.", "rating": 1, "pros": "1 - Free food of low quality in Bangalore.", "cons": "The new QA management has screwed up everything and now it is not a healthy place for QA engineers.", "advice": "Ask your CTO, Dev leads to give respect QA team, don't treat them as slaves."}, {"title": "the 5 values.. they are all lies", "text": "Pros Whatever pro I think there are is to exploit Employees. So they give you benefits like free food, mac book, sometimes alcohol, parties just to make you realise we invested so much so that you work for 24/7. And i am not here to review product wise. Cons The problem with Gurgaon office is Mindset and principles. CEO keeps repeating 5 values but CTO discourages all of those. And its quite frustrating to work in Gurgaon Office. And the great thing you can not reach out to HR with this frustration because they are useless, whatever CTO says everyone has to follow even the HR. This becomes propaganda and no one from US is realising this. The culture is unsuitable for devs to innovate. Most of the new things company does is copied from some competitors. 75% or more employees in Gurgaon office are unhappy and therefore a lot of them leave the company in an year. Stress level are equivalent to Pollution levels. No documentation, unrealistic deadlines & no processes is the forte here. Most of the leads have not worked for any other companies and therefore lack perspectives and are not ready to accept. No professionalism and if you are lucky you might hear CTO swearing in his cabin or parties. Advice to Management So many have advised on glassdoor before and it seems no one care a lot. The HR or others will write fake 5 stars to compensate. And seriously they do write fake ones.", "rating": 1, "pros": "Whatever pro I think there are is to exploit Employees. So they give you benefits like free food, mac book, sometimes alcohol, parties just to make you realise we invested so much so that you work for 24/7.", "cons": "The problem with Gurgaon office is Mindset and principles. CEO keeps repeating 5 values but CTO discourages all of those. And its quite frustrating to work in Gurgaon Office. And the great thing you can not reach out to HR with this frustration because they are useless, whatever CTO says everyone has to follow even the HR. This becomes propaganda and no one from US is realising this.", "advice": "So many have advised on glassdoor before and it seems no one care a lot. The HR or others will write fake 5 stars to compensate. And seriously they do write fake ones."}, {"title": "Worst management", "text": "Pros Nice food (which is not nice these days) Cons Worst Management Roles are not assigned properly objectives are not given for any particular task Task becomes boring when you are doing the same task for more than a month Nothing challenging and motivating to stay in organization Hierarchical structure is not proper Salary is quite low for some department Team meetings doesn't take place at all Advice to Management Free food and casual working hours are nothing if you do not have a proper working structure and hierarchal system. Kindly work on it.", "rating": 1, "pros": "Nice food (which is not nice these days)", "cons": "Worst Management", "advice": "Free food and casual working hours are nothing if you do not have a proper working structure and hierarchal system. Kindly work on it."}, {"title": "So far at Sprinklr!", "text": "Pros 1. Friendly Management and folks. 2.Friendly Environment 3.One of the best places to start off your career! 4.Great learning opportunities 5.Free Food and perks 6.Great looking office! You'll never get bored ;) Cons As of now nothing :) Advice to Management You guys are doing great! Keep up the same spirit and service!!", "rating": 5, "pros": "1. Friendly Management and folks.", "cons": "As of now nothing :)", "advice": "You guys are doing great! Keep up the same spirit and service!!"}, {"title": "Best place to work if you have the right attitude", "text": "Pros Sprinklr is one of its kind. It cares for its people, both employees and clients. Obviously, it demands, but it also gives you your space(and a lot of money) to learn and grow, then its upto you how you use it. It recognizes good work, but yes you have to make your work visible. Given that we are growing, its obvious that things are changing, work environment is changing. Bosses get angry, they shout but then its their job to get the work done and they do this for obvious reasons. But yeah sometimes its not fair and people are hurt, you have to be strong. Work wise, there is a lot to do here. Lot of technical challenges, people wont give it to you, you will have to take them. Lot of improvements to be done. Lot of ownership and responsibilities given. Its a place where you are given opportunities to prove yourself. Culture wise, at least in gurgaon office, management tries, but people don't participate much, Workaholics. Obviously there would be a difference in culture and environment when there are 300 people in office and when there were 40 people in office. So, Its fading/changing. I have personally grown a lot over the last 3-4 years both professionally and personally. There has been constant support and encouragement from the senior team members. Even today, there are feedbacks when you go wrong and the constant push to make you move forward and learn more. If you are smart and dedicated to Sprinklr and its cause, trust me, sprinklr will reward you and love you back. Dont be stupid and do stupid things, it can cost you big. Cons Not much. Its upto you, if you perform and do well, all good, if not, there is going to be lot of pressure and bad words. Its a no nonsense company. Your work and attitude can do all the talking for you.", "rating": 5, "pros": "Sprinklr is one of its kind. It cares for its people, both employees and clients.", "cons": "Not much. Its upto you, if you perform and do well, all good, if not, there is going to be lot of pressure and bad words. Its a no nonsense company. Your work and attitude can do all the talking for you.", "advice": null}, {"title": "Toxic Culture , Top management messed up", "text": "Pros - A bit above the market salary, but I bet you will work 5 times of what you are paid of. - Few talented and hard working engineers around. - Lots of work Cons There are plenty,I might not be able to write them all.. - Theres lot of labour work(bug solving) , very buggy product - Very high attrition, which leads different guys(mostly freshers) maintaining a code every few months, hence the instability or buggy platform. - Adhoc Development, sudden client requirements come up frequently. - No praise for your work, but scoldings can be there. - Work on weekends many times, there is no work-life balance, infact work is your life. - Very crowded and noisy office. - your manager/senior talks to you at abstract level, No in depth discussion.You have to come up with your own solution, which is later changed modified later multiple times. - No priority order of work, anything can escalate anytime and the work you were doing can become redundant. - No fun , not a cheerful Office Environment, a sense of fear in the employees is there in Office. - No Work from Home. I would like to suggest the future employees to join Sprinklr, only if you are ready to give up all other things and work like a horse, you will definitely get monetary rewards but at a price. Advice to Management Please change the management or seniors , so maybe the working culture becomes somewhat positive.", "rating": 1, "pros": "- A bit above the market salary, but I bet you will work 5 times of what you are paid of.", "cons": "There are plenty,I might not be able to write them all..", "advice": "Please change the management or seniors , so maybe the working culture becomes somewhat positive."}, {"title": "Exciting company to work for", "text": "Pros Lively work environment, lots of recreational activities Cons Work pressure is high, irregular working hours Advice to Management Be more responsive to emails", "rating": 5, "pros": "Lively work environment, lots of recreational activities", "cons": "Work pressure is high, irregular working hours", "advice": "Be more responsive to emails"}, {"title": "such a shame", "text": "Pros the right kind of product at exactly the right time with some great people. there's some strong vision and direction, most of the time Cons top team is woefully in adequate and unable/unwilling to learn or change. founder syndrome is so clearly a problem, but nobody is able to get the CEO to see it Advice to Management retire CEO to being a visionary cheerleader and bring in a seasoned professional to run the company with a total mandate and backing of the board", "rating": 1, "pros": "the right kind of product at exactly the right time with some great people. there's some strong vision and direction, most of the time", "cons": "top team is woefully in adequate and unable/unwilling to learn or change. founder syndrome is so clearly a problem, but nobody is able to get the CEO to see it", "advice": "retire CEO to being a visionary cheerleader and bring in a seasoned professional to run the company with a total mandate and backing of the board"}, {"title": "Sprinklr Review after 18 months of Experience", "text": "Pros 1. There is no fixed time to start working, anytime one can come & start working. 2. The team members in Bangalore are actually helpful are more fun to work with and learning wise. 3. Some good allowances are given for all the employees (food & cab). 4. More friendly work environment in Bangalore and better management. Cons 1. Since there is no fixed time to start / stop working, employees are asked on to work on even in personal leaves / or in late nights also (especially on release weekends) where it gets intense often. 2. There is no recognition within a team for the people who work hard. 3. The promises which are said by Team managers are never fulfilled by them. 4. There are no team outings at all even after requesting. 5. No importance are given to a team member considering he's apart of the company. 6. Work life & personal life is disturbed after joining here and it is difficult to manager considering you've to work for 7 days of a week and without any extra money paid working on weekends. Advice to Management Please value your employees and let them have there own personal time. Do recognize the people who work in unnoticed manner.", "rating": 3, "pros": "1. There is no fixed time to start working, anytime one can come & start working.", "cons": "1. Since there is no fixed time to start / stop working, employees are asked on to work on even in personal leaves / or in late nights also (especially on release weekends) where it gets intense often.", "advice": "Please value your employees and let them have there own personal time."}, {"title": "Good product. But needs work om the environment", "text": "Pros Good food (though repeatetive) Good salary Talented people Product had potential CEO wants to achieve even more Company could get listed or would be acquired by a tech giant Some perks like iphone and all to few selected influential people (mainly PM, some devs and designers) Cons To much work load (especially Delhi office) No respect for QA(SDET) in delhi office Highly unstable product one cause is weekly releases. Less to learn as QA as most of the time you are busy reviewing customer tickets, doing manual testing due to release work Devs don't get time to even check that what they are doing, they simply push. Thus there is mainly black box testing as at this level only lots of bugs are caught. Advice to Management You guys are rockstars and doing great. But few things you are missing. Company has reached a level where you just can't work as you were working in initial days. Bridge the gap between QAs and Devs. If you check in other major companies work of QA and Devs is a lot overlapping. QAs know exactly what is going on, what was the reason for some change, devs consult QA for which is better option amongst two. But unfortunately, here QA only gets to know that some feature has come, test in one day. They don't know how back end is working whereas ideally they devs and QA should be sitting together and doing collaborate work. Devs would get time to check corner cases, QA would know the product well and this would help them find better bugs. Currently the kind of bugs caught by QA should be caught in dev reviews and QAs should catch quality bugs, the corner cases. This would help reduce the customer tickets coming in and would stabilise the product. Encourage people to gain more knowledge, do courses or get higher degrees. It would ultimately help company. Company is spending a lot and it deserves good. An employee stays when along with salary , they get a sense that they are valued and gaining new skills. But in case I see the company growing exponentially in the near future. CTO is a very kind and cool person.", "rating": 3, "pros": "Good food (though repeatetive)", "cons": "To much work load (especially Delhi office)", "advice": "You guys are rockstars and doing great. But few things you are missing. Company has reached a level where you just can't work as you were working in initial days. Bridge the gap between QAs and Devs. If you check in other major companies work of QA and Devs is a lot overlapping. QAs know exactly what is going on, what was the reason for some change, devs consult QA for which is better option amongst two. But unfortunately, here QA only gets to know that some feature has come, test in one day. They don't know how back end is working whereas ideally they devs and QA should be sitting together and doing collaborate work. Devs would get time to check corner cases, QA would know the product well and this would help them find better bugs. Currently the kind of bugs caught by QA should be caught in dev reviews and QAs should catch quality bugs, the corner cases. This would help reduce the customer tickets coming in and would stabilise the product."}, {"title": "Great place to work at", "text": "Pros * Amazing work culture * Great HR department * Helpful co-workers * Amazing food (Bangalore office) Cons * Showing that you are doing work is more important than actually doing it", "rating": 5, "pros": "* Amazing work culture", "cons": "* Showing that you are doing work is more important than actually doing it", "advice": null}, {"title": "Very good company, lot of things to learn", "text": "Pros Free food, uses new technologies, very good company to join for freshers Cons I dont find any cons and have to work more but I find it as good so that we can learn more", "rating": 5, "pros": "Free food, uses new technologies, very good company to join for freshers", "cons": "I dont find any cons and have to work more but I find it as good so that we can learn more", "advice": null}, {"title": "Great company to start with", "text": "Pros Get on the board and start growing Cons Join in if you like coding. Advice to Management Nothing", "rating": 5, "pros": "Get on the board and start growing", "cons": "Join in if you like coding.", "advice": "Nothing"}, {"title": "Great Company to Work", "text": "Pros Good vibe! Excellent team knowledge and solutions, with a good environment to work and learn, without fear about be wrong. Cons Sometimes you have doubts about the future. Advice to Management Try to be clear what you think about the future of sprinklr on each country he was present.", "rating": 5, "pros": "Good vibe! Excellent team knowledge and solutions, with a good environment to work and learn, without fear about be wrong.", "cons": "Sometimes you have doubts about the future.", "advice": "Try to be clear what you think about the future of sprinklr on each country he was present."}, {"title": "Poor Management", "text": "Pros Good food, infrastructure n perks. Friendly employees, good work environment. I liked the colleagues a lot and they were very helpful. Cons Poor management as they don’t know to take right decisions. I was an intern and they gave me full confirmation of converting me in full time but at the end of 6 months internship they said it cannot be done...it is very bad on their part to inform me in such a way and that too completion of 6 months of internship. Advice to Management Try to be transparent and proper decision making. Management need to be changed. This is not how MNC work.", "rating": 3, "pros": "Good food, infrastructure n perks. Friendly employees, good work environment. I liked the colleagues a lot and they were very helpful.", "cons": "Poor management as they don’t know to take right decisions. I was an intern and they gave me full confirmation of converting me in full time but at the end of 6 months internship they said it cannot be done...it is very bad on their part to inform me in such a way and that too completion of 6 months of internship.", "advice": "Try to be transparent and proper decision making. Management need to be changed. This is not how MNC work."}, {"title": "Wish Glassdoor had the option to give negative ratings", "text": "Pros Ummm...well I'm at loss of words here. Well only thing I could think of is that there are a lot of bright, young individuals who are just stuck at the wrong place. Cons The review is not coming from someone who was fired or not performing well (far from it in fact), so you can trust the content to follow. And why am I bringing this up?  Because if I were to plot a heat map of the words I came across during my Sprinklr tenure, the word \"FIRE\" would outshadow every single word. Also, note that I'll be sugar coating things, so don't forget to exaggerate things when you make your decision since the problems listed below only constitute a drop in the ocean. Problems run much much much deeper. So, here we go: 1. To begin with, just have a look at the glassdoor trend of the rating of this company. That alone should be sufficient to ease your decision-making dilemma. 2. Majority of the positive reviews you see out here are from the employees who are just a week (probably a month) into Sprinklr. Reason being, you're begged to write positive reviews about the company as soon as you join (Probably the company also knows that no one can write anything positive once they get to know the company and the culture). 3. Every weekend is a release, so feel free to deduce the most obvious conclusion out of this. (Hint: Working hours. Ring any bells?) 4. Claiming the company is unstructured would be a huge understatement. It is here that you can practically learn the meaning of \"chaos\". 5. The only deadlines you get are today, tomorrow or the coming weekend (if you're lucky) 6. Immaturity is brimming among the masses. I wish I could quote instances (Yes, they are that shameful). 7. The whole office atmosphere is so negative and so robotic. It's more or less like a puppet show. I've never heard a single positive thing from anyone working there, be it a PM, developer or tester. Everyone is stressed out. Everyone is frustrated. Everyone is pissed. 8. Attrition rate is high even if you overlook the firing part. That's why their policy is to hire freshers from colleges who have no idea about how corporate world functions and use them the way they want to and make them work like machines. 9. Coming to the product now, firstly the number of broken features outnumber the number of working ones. Secondly, I don't understand why do they even call it a product. Implementation is a mess and moreover everything the client demands is taken as a requirement (however stupid that might be). Someone please tell them this is not a service based company. 10. You might think of this as an opportunity to improve stuff but trust me, don't even think about it. It'll be a huge disappointment. All in all, you lose your peace of mind, time and everything. That should be more than enough for you to make an informed decision I hope. Advice to Management Giving advice to the management is like banging your head against the wall.", "rating": 1, "pros": "Ummm...well I'm at loss of words here.", "cons": "The review is not coming from someone who was fired or not performing well (far from it in fact), so you can trust the content to follow. And why am I bringing this up?", "advice": "Giving advice to the management is like banging your head against the wall."}, {"title": "Staying for the people", "text": "Pros Sprinklr has some of the most exceptional front line staff and they are the reason I have stayed. Working with smart, fun people makes me better at my job and is where I learn the most from. A member of the HR team recently started an 8 week program to help staff change their lifestyle and improve wellbeing. Frankly its the best thing that has happened at Sprinklr since I have joined. Its a real investment in staff and the amount of work, information and care that has been put into it has motivated me more in the last 5 days than I have felt in the last 3 years. I think they volunteered to do this off their own back but if this is the type of investment Sprinklr is making in staff across the board then its clear there is a strategy that involves actually caring about people and turning the ship around. Cons Zero coherent strategy and mission. You ask 5 people what our mission is and you'll get 5 different answers. Senior leaders in NYC do not listen to feedback and despite being told countless times across countless mediums about the issues that are causing good people to vote with their feet by leaving, nothing changes. Every day I'm shocked by how little they care. Actions do not align to company values. Programs put in place to make collaboration between departments more efficient but feels phoney and forced and are ultimately abandoned. I actually think a donkey as CEO would be more effective. Advice to Management Set a strategy. Communicate it. Execute it. Its not that difficult. There are good people who are keeping staff anchored but you lunacy is driving them away.", "rating": 5, "pros": "Sprinklr has some of the most exceptional front line staff and they are the reason I have stayed. Working with smart, fun people makes me better at my job and is where I learn the most from.", "cons": "Zero coherent strategy and mission. You ask 5 people what our mission is and you'll get 5 different answers. Senior leaders in NYC do not listen to feedback and despite being told countless times across countless mediums about the issues that are causing good people to vote with their feet by leaving, nothing changes. Every day I'm shocked by how little they care. Actions do not align to company values. Programs put in place to make collaboration between departments more efficient but feels phoney and forced and are ultimately abandoned. I actually think a donkey as CEO would be more effective.", "advice": "Set a strategy. Communicate it. Execute it. Its not that difficult. There are good people who are keeping staff anchored but you lunacy is driving them away."}, {"title": "One of the best company to work in and learn", "text": "Pros Best platform for those who have passion and the desire to make an impact—in their careers. Here people thrive on their own terms and push their intelligence to its limit. Provides variety of in-house opportunities for career advancement. Everyone is helpful and great universe of opportunities. Cons The management should be more strong", "rating": 5, "pros": "Best platform for those who have passion and the desire to make an impact—in their careers. Here people thrive on their own terms and push their intelligence to its limit. Provides variety of in-house opportunities for career advancement. Everyone is helpful and great universe of opportunities.", "cons": "The management should be more strong", "advice": null}, {"title": "Bright experience to start with", "text": "Pros 1. The projects are dynamic and require you to have knowledge of the underlying structure. 2. Good for beginners as they get to learn lot of stuffs from their team members. 3. Good and Healthy Food. 4. Everyone is assigned a responsibility to which he becomes accountable to. Cons 1. The work life is long. You have to manage your time.", "rating": 5, "pros": "1. The projects are dynamic and require you to have knowledge of the underlying structure.", "cons": "1. The work life is long. You have to manage your time.", "advice": null}, {"title": "Great company to start your career", "text": "Pros 1. Fast paced environment. If you want to learn there is a lot of opportunities. 2. Exposure to many new technologies. 3. Seniors in the company are a lot helpful. 4. Decent compensation 5. Nice and Tasty food One of best thing I like about Sprinklr is you are given responsibility of work at a very early stage and you are expected to do it end to end which helps in comprehensive understanding of the concepts. Cons It becomes a little difficult to adjust to the long working hour environment and coming to office on some weekends in the beginning as you come from college where life is super chill but if you the like the work then again no problem for you.", "rating": 5, "pros": "1. Fast paced environment. If you want to learn there is a lot of opportunities.", "cons": "It becomes a little difficult to adjust to the long working hour environment and coming to office on some weekends in the beginning as you come from college where life is super chill but if you the like the work then again no problem for you.", "advice": null}, {"title": "Win Win scenario for person with interest to learn.", "text": "Pros You are flooded with opportunities once you prove your caliber with an added advantage of excellent pay. Cons work life balance would take a hit in some cases. Advice to Management None.", "rating": 5, "pros": "You are flooded with opportunities once you prove your caliber with an added advantage of excellent pay.", "cons": "work life balance would take a hit in some cases.", "advice": "None."}, {"title": "Good company to learn and implement new technologies", "text": "Pros 1. Lot of learning opportunities. 2. Company provides complete flexibility to work on latest technologies. 3. Awesome work environment. 4. Awesome employee perks. 5. Very supportive senior technical and management staff. 6. Great Parties. Cons 1. Lot of work i.e sudden work 2. Only 15 leaves(all inclusive) in year. Advice to Management Can improve more on coordination between different teams.", "rating": 5, "pros": "1. Lot of learning opportunities.", "cons": "1. Lot of work i.e sudden work", "advice": "Can improve more on coordination between different teams."}, {"title": "A positive experience", "text": "Pros There are lots of opportunities for professional development since the company's growth is exponential. The company encourages \"thinking outside the box\", which allows you use your creative juices. The environment is intense and fast-paced, which makes you feel like you're part of a movement. Free food, gym membership, parties are some of the perks of working at Sprinklr. You get to work on the latest standards and technology stack and the company puts extra emphasis on learning and encourages oneself to handle any task. You can do what you're passionate about - if you figure out what that is - and speak up. For a third person, the latest trend of reviews can be a little disheartening to see. I have seen this company grow from the ground up to a freaking Unicorn which is an incredible feat in itself considering the handful number of Unicorns without bloated evaluations. The work can be daunting for some and can sometimes push you to your limits where you would be likely to break - but I believe that all these challenges solidifies one's core and helps us prepare to handle any sort of challenges that may arise in future. It's the journey and the experiences that you build matters. Rome was not built in a Day. Cons If you like adventures, daily challenges and a constantly-changing environment, you'll love it here and excel. If you prefer knowing what to anticipate on a day to day basis, this probably isn't the place for you. As you would expect in a start-up, things are very busy and there are long hours required to build something special. It can get tiring at times. Advice to Management Continue building the company on strong foundations and drill the culture and value to new hires. Unify departments better.", "rating": 5, "pros": "There are lots of opportunities for professional development since the company's growth is exponential. The company encourages \"thinking outside the box\", which allows you use your creative juices. The environment is intense and fast-paced, which makes you feel like you're part of a movement.", "cons": "If you like adventures, daily challenges and a constantly-changing environment, you'll love it here and excel. If you prefer knowing what to anticipate on a day to day basis, this probably isn't the place for you.", "advice": "Continue building the company on strong foundations and drill the culture and value to new hires. Unify departments better."}, {"title": "Mixed opinions", "text": "Pros 1. Colleagues are friendly 2. Facilities like medical, food cab are good 3. Top performers are treated Good 4. Good HR Cons 1.New improvements have created a sense of terror in minds of employees. Half left and many are planning to leave because of him. 2.Less hike (0% to 5%) 3,QA team in Bangalore office is slowly been shifted to Gurgaon Advice to Management Bringing back 2016's management might solve the issues,", "rating": 1, "pros": "1. Colleagues are friendly", "cons": "1.New improvements have created a sense of terror in minds of employees. Half left and many are planning to leave because of him.", "advice": "Bringing back 2016's management might solve the issues,"}, {"title": "False hope and promises by the company!", "text": "Pros 1. Macbook pro (16GB Ram): to make sure your work is not affected. 2. Free Food and parties occasionally. Cons The core values of sprinklr which are not followed now: 1. it's ok: When you are not at home on a \"Sunday Evening\", you get calls coz you need to be online \"every single min\", EVERY WEEKEND. 2. Sprinkle, don't shout:  When this is followed, you won't get hike/bonus/etc. Your work will not be recognized, unless you shout and work OR you need to be close to seniors, even if you dont work. 3. Fix, don’t complain: The Manager and other senior folks encourage this and follow this. But when it comes to the seniors(few), God bless their lectures. 4. Never, ever, give up: This is TRUE. they ask you not to give up on work. Even on Sunday Evenings/ when you're on leave with family,etc. 5. Passionately, genuinely care: This is not true anymore. Sprinklr has changed a lot in the last few months. NOTE: hope this is taken into serious consideration. The main disadvantages of working here: 1. WORK: when a newbie joins, he/she is told there is scope for learning more. They do get excited and start working and learning. Few months down the line, he/she will be left with the \"SAME OLD WORK\" (manual testing) and the learning curve falls drastically. if you ask your seniors, then you are told that this is the new Learning! i.e Manual Testing. 2. HIKE: this is the most interesting thing which attracts everyone. HIKE is inversely proportional to what you work on. Factors for hike: a) how good you are with your seniors, b) people talk behind your back about you, \"instead of finishing their work\" just to make sure your suffer, c) Grudge if you dont help anyone senior to you, even if you have a lot of work d) if you are offline for \"sometime\" on Weekends. 3. QA's are treated as SLAVES by MOST of the developers. (I STRONGLY suggest the management to look into this. To get a product to the customer is not just because of coding. there are many other factors. ) 4. Nights are meant to sleep. But you get pings from devs, you need to be awake till everything is fixed and come to office on time the next day. 5. Blame game: If something breaks, May God Bless your day. Everyone will attack you, coz you are paid to take the blame and scoldings. 6. NO WORK LIFE BALANCE :You need to keep people updated while having your food, bath, etc. Be online everyday regardless of holidays, leaves and weekends. 7. Seniors expect a newbie to know everything once you join like incuding the Hotpatches/Migrations . If something goes Wrong, then pls be prepared for the Roller coster Rider without seat belts and a broken track. 8. Travelling To Gurugram: If you dont travel to Gurugram, then you are going to face some serious consequences, not immeadiately. 9. Leads: SOME leads should know what they are working on, rather than showcasing that their team has more work. Leads compete among themselves, which effects the team members a lot. 10. National Holidays are sometimes cancelled! So its better not to celebrate on national holidays, instead wish everyone on slack and continue working. 11. People who are dedicated to work are given more work. Other enjoy with less work. If you take some time off after lunch then you will be under the limelight. If you goto smoke then you are not questioned. Cons can be continued. But I would want Sprinklr to be great again. (NOTE: These pros and cons are not written to find out who has written. They are written to correct the mistakes. So instead of finding out the person, it would be better if the work is executed in the right way.) Advice to Management 1. Please consider to pay people who work on weekends. Being online every week is not bringing the Work Life Balance. There should be atleast one day where a person can realise they have a life and can breathe. 2. Sprinklr is one product. All the leads, Devs, Support and everyone need to work together which will surely bring a GOOD rating on glassdoor.", "rating": 1, "pros": "1. Macbook pro (16GB Ram): to make sure your work is not affected.", "cons": "The core values of sprinklr which are not followed now:", "advice": "1. Please consider to pay people who work on weekends. Being online every week is not bringing the Work Life Balance. There should be atleast one day where a person can realise they have a life and can breathe."}, {"title": "I regret for joining this company", "text": "Pros Free lunch Macbook Pro I will have to research to find if there are any pros. Cons Zero work-life balance QA's are treated as slaves by few developers(who think they are legends) No proper hike/bonus when compared to other teams Few team leads are very egoistic and pathetic. I still wonder on what basis they are named leads. No rewards and recognitions. Advice to Management 2 stars is only for 1 reason - Founder/CEO's vision. No second reason for it.", "rating": 3, "pros": "Free lunch", "cons": "Zero work-life balance", "advice": "2 stars is only for 1 reason - Founder/CEO's vision. No second reason for it."}, {"title": "Terrible culture, avoid at all costs.", "text": "Pros - Food is served daily and is reasonably good - Reasonably high compensation - Some people around are really passionate about building a good product Cons - Extremely toxic culture: People here are extremely arrogant and more than your work, they want your dignity. You are shouted at, treated poorly, routinely made a scapegoat if need be, sometimes from your mistakes, sometimes for someone else's. - Negativity in the people: Most developers are extremely frustrated, dev leads are always angry, and there is always passing of blame from one party to another. QA is exhausted too, and the Design Team is always overloaded. - Long working hours and absolutely no work-life balance: Working hours are long, and not because work gets done. Work is generally inefficient and people are expected to show up on Saturdays just because everyone else is. - Buggy and terrible product: Many reviews feel the product is excellent, but I did not feel this. The product is extremely buggy, and most of the time is spent on Support Issues working 24x7. Advice to Management - Build a more conducive culture. - Talk nicely to people - it's not that hard. - Maybe sell the company off - I doubt this can be fixed.", "rating": 1, "pros": "- Food is served daily and is reasonably good", "cons": "- Extremely toxic culture: People here are extremely arrogant and more than your work, they want your dignity. You are shouted at, treated poorly, routinely made a scapegoat if need be, sometimes from your mistakes, sometimes for someone else's.", "advice": "- Build a more conducive culture."}, {"title": "Worst experience ever. Don't ever join this company", "text": "Pros Breakfast, Lunch, Dinner everything at office(Some people may find it in pros). But it just a strategy for long working hours. Cons 1. Upper Management is disrespectful. They literally abuse in office and disrespectful towards other startups. 2. No Work-Life Balance. Forget you have a personal life. No Weekend. 3. They maintain their login-time and logout time of office and even circulate it across whole organisation. 4. Upper management will consider you as slave in name of money. They think you should be available 24*7 5. Too much politics and baisedness.", "rating": 1, "pros": "Breakfast, Lunch, Dinner everything at office(Some people may find it in pros). But it just a strategy for long working hours.", "cons": "1. Upper Management is disrespectful. They literally abuse in office and disrespectful towards other startups.", "advice": null}, {"title": "1 week into the job", "text": "Pros Excellent hiring and onboarding experience Cons More required communication about the ongoing changes in the company", "rating": 5, "pros": "Excellent hiring and onboarding experience", "cons": "More required communication about the ongoing changes in the company", "advice": null}, {"title": "No work life balanced. Bad schedule", "text": "Pros food is only thing that makes me going Cons Lot of work, no weekend holidays.", "rating": 1, "pros": "food is only thing that makes me going", "cons": "Lot of work, no weekend holidays.", "advice": null}, {"title": "Candidates hear this. You need to join this company!", "text": "Pros Just look at the website, the product is amazing, Sprinklr has a huge roster of excellent customers, the management are really on point and executing flawlessly, the sales and pre-sales teams are lazer focused. The PS teams gets the solution up and running in half the time you expect. HR are incredible, super responsive. The team members, especially the those crazy millennials are super nice and will welcome you with open arms and support. Cons Oh wait. Why do you NEED to join this company? Well one very good reason. The incompetent management are firing people in all locations. Those not fired but still possess wisdom and intelligence are leaving in droves. Sprinklr NEEDS you, in fact they need anyone with a heartbeat. You don’t really have to know much about social, engagement etc. No one else really does. You just have to turn up in the office, look busy and you can tread water for at least 6 months. The product is way to over engineered for the main use cases used by the customers. It’s too expensive, buggy and difficult to implement. The management are incompetent, just look at those Glassdoor reviews. And they love to SHOUT, oh yes, they are shouty shouty managers. If you are in sales they will shout at you, they will verbally abuse you, they will make you feel worthless when all they can achieve is way under par results. Results that all other North American software companies would not tolerate. Sprinklr is not a ‘startup’ so don’t fall for that rhetoric, it’s a 9 year old company, most successful tech companies have either gone public or sold by now, twice in some cases. Sprinklr has done neither of those. An acquisition is possible so if your career objective is to work for Microsoft consider Sprinklr as a stepping stone. Advice to Management Call the investors they want their money back", "rating": 1, "pros": "Just look at the website, the product is amazing, Sprinklr has a huge roster of excellent customers, the management are really on point and executing flawlessly, the sales and pre-sales teams are lazer focused. The PS teams gets the solution up and running in half the time you expect. HR are incredible, super responsive. The team members, especially the those crazy millennials are super nice and will welcome you with open arms and support.", "cons": "Oh wait.", "advice": "Call the investors they want their money back"}, {"title": "No importance given to interns", "text": "Pros Only one thing they brag about is that their pay is good. Cons No time devoted to interns. No mentor provided. No appreciation even if project goal are attained way better than expected. Meeting with manager happened biweekly that too were delayed. Advice to Management Poor management.", "rating": 1, "pros": "Only one thing they brag about is that their pay is good.", "cons": "No time devoted to interns.", "advice": "Poor management."}, {"title": "toxic work culture and leadership", "text": "Pros good pay, free food, nothing else Cons employees are treated as slaves some people have no leadership and vision many seniority level are there because of politics and not skills overall, a very toxic environment", "rating": 1, "pros": "good pay, free food, nothing else", "cons": "employees are treated as slaves", "advice": null}, {"title": "Toxic environment", "text": "Pros Centrally located office Some extremely smart and genuinely nice people Cons I honestly have never worked in such a toxic environment. Bullying, discrimination and sexism are a daily regimen. You are constantly being reminded that you are working in a sales organisation and that you should be bending over backwards to please sales people and their overinflated egos. Strategic directions change every week or fortnight making working on the enterprise level a walk on fire. The product is too complex and not scaled to markets outside of the US. Sales practices are not localised and the rejection of local practices is staggering and hard to understand by both people on the field, prospects and clients. Advice to Management You have really smart and skilled people working in your organisation, start listening to them and learn from them. They do know their markets and in the best position to make the organisation thrive.", "rating": 1, "pros": "Centrally located office", "cons": "I honestly have never worked in such a toxic environment. Bullying, discrimination and sexism are a daily regimen.", "advice": "You have really smart and skilled people working in your organisation, start listening to them and learn from them. They do know their markets and in the best position to make the organisation thrive."}, {"title": "Front end Developer", "text": "Pros Equipment, location, parties, tools and professional level Cons Benefits, salary, activities, scopes and integration", "rating": 3, "pros": "Equipment, location, parties, tools and professional level", "cons": "Benefits, salary, activities, scopes and integration", "advice": null}, {"title": "Worst Company", "text": "Pros Only pros is pay that too is mediocre if we compare it to working hours Cons - Worst Management. Team leads and managers are always scolding employees. - No proper training to freshers, then they expect that they should know every work that is assigned to them. - Team leads waste half of the time by assigning projects with Bangalore team. In a day, the people can never communicate every now and then being 2000km apart. Definitly efficiency is affected. - CTO preaches work life balance. Nothing of that sort is found. - Employees are treated as donkeys who are just given work(excessive) and money and also scoldings to bring their morale down. Advice to Management If you want the company to survive in future, fix the management. Some of your managers are pathetic. Please reduce the working hours to increase efficiency of your employees", "rating": 1, "pros": "Only pros is pay that too is mediocre if we compare it to working hours", "cons": "- Worst Management. Team leads and managers are always scolding employees.", "advice": "If you want the company to survive in future, fix the management."}, {"title": "Fastest growing company in the world", "text": "Pros -Free food, flexible timings, latest technologies, capable R&D Team, Good hikes, transparent culture. -CTO wants every employee to have founder attitude and he helps everyone in that. -People who work hard and smart, are appreciated very very well. Cons -heavy workload if u think u are an employee but if you are working with founder/ co-founder attitude, you will enjoy the work. - Product Management suite might be weak but it keeps on better day by day.", "rating": 5, "pros": "-Free food, flexible timings, latest technologies, capable R&D Team, Good hikes, transparent culture.", "cons": "-heavy workload if u think u are an employee but if you are working with founder/ co-founder attitude, you will enjoy the work.", "advice": null}, {"title": "It's a mix of of both good and bad worlds (but in extreme)", "text": "Pros - Very fast growth (both career and skills) - A few great people to learn from, - Huge Salary - A very complex product, with so many features, huge data, and fixed SLA. This makes sure you are exposed to good quality, scalable product development. Cons - No work life balance. Actually, there is no life, only work. You have to work on Sundays also, forget about Saturday. You have to work on national holidays also, even the office build is closed and there is no AC/food. - Even after all this work, there is very little appreciation and that is only from a few good people I mentioned. There is no appreciation from the expected people. - In spite of appreciation, there is a lot of scolding regularly. Many times it was done by people in upper management to make fun of us. Sometimes also in social gatherings. - They don't know how to talk to their employees. Only abusive language is used. Again sometimes just to make your fun and again sometimes in social gatherings. - Many times your work credit is taken by other people. Mostly flattery wins over actual work. - Giving high salary is always used as a reason to make sure you work on weekends, you work late nights and many times you work 2-3 days continuously. Though it is never mentioned in the offer letter. Advice to Management I don't know whether you exist or not. There is no feedback chain. This makes me feel, you guys know about all the problems & issues and you are fine with it. Else in a company like Sprinklr, there should be active feedback cycle. I even tried once to initiate an anonymous feedback process but I got the following response: \"If we start this then people will actually able to speak what they have in mind. So let's not do it.\" Simply said the management is broken.", "rating": 3, "pros": "- Very fast growth (both career and skills)", "cons": "- No work life balance. Actually, there is no life, only work. You have to work on Sundays also, forget about Saturday. You have to work on national holidays also, even the office build is closed and there is no AC/food.", "advice": "I don't know whether you exist or not. There is no feedback chain. This makes me feel, you guys know about all the problems & issues and you are fine with it. Else in a company like Sprinklr, there should be active feedback cycle. I even tried once to initiate an anonymous feedback process but I got the following response: \"If we start this then people will actually able to speak what they have in mind. So let's not do it.\""}, {"title": "Preparing IPO with expandable talents", "text": "Pros Thrilling challenges, the teams of consultants are doing daily marvels. Best onboarding sessions ever. Helpful sub-management staff. Fancy perks for millenials, unlimited holiday (but take days off at your own risk). Cons Politics, short-sighted actions, painful disconnect between footsoldiers and the generals. The middle management is ineffective and harmful. The feedback from the field is not processed by regional managers, and consultants pay the price. Lack of coherence between strategy and the ways of implementing it. Being led by visionary dreamers who lack the proper team to manage execution is the best way to bring a brilliant company to irrelevance. Be ready to be fired without notice if it can help the management, despite your excellent work, and with no reward at all for your involvement. Countless hours only make the company more valuable, not you: think twice before coming home late. Advice to Management Care more for your footsoldiers. Stop using employees as an expandable way of increasing your valuation. Make middle management and above more accountable, care for the talent bleed. Choose more clearly between valuation and the team. Remember : if your shares will make you rich once sold, low level employees make the value of Sprinklr.", "rating": 1, "pros": "Thrilling challenges, the teams of consultants are doing daily marvels.", "cons": "Politics, short-sighted actions, painful disconnect between footsoldiers and the generals. The middle management is ineffective and harmful. The feedback from the field is not processed by regional managers, and consultants pay the price.", "advice": "Care more for your footsoldiers."}, {"title": "Temporarily troubled but easily recoverable", "text": "Pros - Best technology solution - Brilliant people - Never dull Cons - Misfiring of internal alignment across teams - Cultural dissonance between new management and rest of company Advice to Management I am an experienced seller who's done well at Sprinklr and I foresee this success continuing in the medium term. Why? Sprinklr has the best enterprise social technology in the market - there's no doubt. Even on Glassdoor our competitors mention Sprinklr as the main obstacle to winning deals! Sprinklr's technology advantage will NOT, however, immunize the company from destruction by fear culture and erratic management, as has been imposed by the new senior leadership. It's not too late to stop this company from falling off a cliff - it requires one bold, yet decisive action at board level. It's easy to trivialize these cries for help by believing they come from people 'resistant to change' or 'not cut out for enterprise'. But as convenient as it is to do this, it is equally as dangerous. When people are scared and isolated, productivity drops, collaboration dies and no amount of micro-managing the next month's deals will mitigate the negative impact this will have on medium and long term revenue. To sales folks considering joining Sprinklr, it depends what you're up for. If you are a skilled seller who knows - or is willing to know better - this rapidly developing space, you will be successful and will make good money. If you're coming from another enterprise vendor, you'll need grit to get deals done but we're constantly edging out the bigger players in more and more opportunities and the momentum is with us. Hence why, despite my feedback on the leadership, I still give this company 3 stars. I have faith recent issues will be viewed in hindsight as a momentary blip.", "rating": 3, "pros": "- Best technology solution", "cons": "- Misfiring of internal alignment across teams", "advice": "I am an experienced seller who's done well at Sprinklr and I foresee this success continuing in the medium term. Why? Sprinklr has the best enterprise social technology in the market - there's no doubt. Even on Glassdoor our competitors mention Sprinklr as the main obstacle to winning deals!"}, {"title": "The rocket ships going to explode", "text": "Pros Great technology. It really could change the world (well the world where selling products people don't need is the most important thing) Cons The \"new\" (they've been there 9 months) senior management have said \"the future it's going to be a rocket ship, you need to hold on\", only problem is they are standing over you with a pair of pliers ready to chop those fingers off. They want to grow the company at such speed they need to streamline however fear is the number 1 management motivation used in all offices. With fear comes doubt and with doubt comes lack of productivity. It's a vicious downward spiral that could be truly destructive. Advice to Management \"People never forget how you make them feel\" - read those words over and over and try and let it resonate. As if you read June's reviews you'll realise people never forget.", "rating": 3, "pros": "Great technology. It really could change the world (well the world where selling products people don't need is the most important thing)", "cons": "The \"new\" (they've been there 9 months) senior management have said \"the future it's going to be a rocket ship, you need to hold on\", only problem is they are standing over you with a pair of pliers ready to chop those fingers off.", "advice": "\"People never forget how you make them feel\" - read those words over and over and try and let it resonate. As if you read June's reviews you'll realise people never forget."}, {"title": "on course to 1B ARR", "text": "Pros Change is always hard, people don't understand what brought a success in past won't bring success in future as scale will be different. We behaved very differently as kids, as teens, as adults, as married couples etc, that doesn’t mean it was bad. Sprinklr is on similar transition from unstructured to structured. Sprinklr has a solid strategy and market product leadership to achieve this. Sprinklr has brought in an experienced leadership who is doing lot of things right. Lot of micromanagement which people complain now is simply holding people accountable for Activity. In order to achieve predictable growth one needs to track activity and course correct every week. Cons Sprinklr has not focussed much on adopting its cultural and leadership values. They are there but not practiced. New leadership should take existing employees along, coach them and make them successful. Sprinklr's success finally will be if its employees will be successful. Advice to Management Put your core values and leadership values in practice every day and you would be just fine.", "rating": 5, "pros": "Change is always hard, people don't understand what brought a success in past won't bring success in future as scale will be different. We behaved very differently as kids, as teens, as adults, as married couples etc, that doesn’t mean it was bad. Sprinklr is on similar transition from unstructured to structured. Sprinklr has a solid strategy and market product leadership to achieve this. Sprinklr has brought in an experienced leadership who is doing lot of things right. Lot of micromanagement which people complain now is simply holding people accountable for Activity. In order to achieve predictable growth one needs to track activity and course correct every week.", "cons": "Sprinklr has not focussed much on adopting its cultural and leadership values. They are there but not practiced. New leadership should take existing employees along, coach them and make them successful. Sprinklr's success finally will be if its employees will be successful.", "advice": "Put your core values and leadership values in practice every day and you would be just fine."}, {"title": "Product Engineer", "text": "Pros Product is great Cutting edge technology Lots to learn Good to start the career with this company Developers have lots of opportunities to learn Cons Gurgaon Office place is not up to the expectations, in fact, it's too congested with no any recreation places. Food is very repetitive and not that good. Please take good care of your employees. I hope this review doesn't fall on the deaf ears. I know Sprinklr takes reviews very positively. Hope to see the changes soon. And some good surprises to the employees. Advice to Management Please provide good facilities to employees", "rating": 1, "pros": "Product is great", "cons": "Gurgaon Office place is not up to the expectations, in fact, it's too congested with no any recreation places.", "advice": "Please provide good facilities to employees"}, {"title": "Fix, Don't Complain.", "text": "Pros Great exposure to various technologies. Great things to learn from experienced people in the company. Cons Politics are be done on you by few of fellow employees who are competing (hunger games) with you for better \"grade\". (\"It's not okay\").", "rating": 3, "pros": "Great exposure to various technologies.", "cons": "Politics are be done on you by few of fellow employees who are competing (hunger games) with you for better \"grade\". (\"It's not okay\").", "advice": null}, {"title": "Bad start leads to a quick ending", "text": "Pros The product is good. There are some smart cookies in the team. Sprinklr has a good customer base and the salary is OK if you are successful. Cons Where to start? At the beginning. HR was a challenge. It was difficult to get through the hiring process, there was a lack of communication at every stage, I almost gave up at one stage and took a role elsewhere. On boarding. Very disappointed. The ‘field enablement consultant’ I think she calls herself really does not put one in good stead for your future at the company. That needs to change. ProServe seems to be pretty much in shape. Great team, some smart cookies there.. They seem to do a good job and the customer is probably in good hands with their support. Management at all levels are a something else. You can read all about this group elsewhere on Glassdoor. I've never seen such ineptitude on behalf of senior management. The future? It's hard to say. There are rumors of a sellout all over the place. The recent state of firing does not help. The product is being enhanced in a random sort of way but it is what it is. Advice to Management HR get your head out of the sand. You need to up your game. Refresh the EMEA field enablement people, it's not working. Support and show respect to your team members and stop treating them like people that will be fired at a moment notice.  Grow up and become a mature enterprise software company. Help our customers be successful, don't refer to them as 'logos', give our customers the respect they deserve.", "rating": 1, "pros": "The product is good. There are some smart cookies in the team. Sprinklr has a good customer base and the salary is OK if you are successful.", "cons": "Where to start? At the beginning.", "advice": "HR get your head out of the sand. You need to up your game."}, {"title": "Toxic Environment", "text": "Pros Part of Growing Industry Good Pay (maybe) Technology Cons Firstly, there is so much fear in people to write a review here that they won't take this step. Though they want to but are scared. HR will keep on asking for 5 star reviews. It's a dictator's kingdom where everyone else in the office is treated like slave. Be Ready to get humiliated and harassed by CTO at anytime in his completely defaming, insulting and arrogant manner. I joined this company with lot of passion and hope but after spending more than 2 years with Sprinklr all my hopes are thrashed now. No clarity on product roadmap or where the company is heading. No career path or even goals defined. Every day the work priorities changes. Ready to get fired at any moment without any notice. Expect to work on every weekend. No Learning, high attrition. No development process followed. Think 100 times before raising a question in this toxic environment. Creativity and passion is killed here daily. Only hire freshers in engineering as it is difficult to overpower experienced people and harass them. Complete chaos. No value of your work or ideas. You will only be questioned for not delivering. Be ready to always get the blame for failures, all success belongs to upper management. No one to share your feedback or any complaints. Advice to Management Advice to Board. Management has eyes and ears closed for this office. Get a healthy professional environment. Employees deserve some respect and not never ending harassment. Listen to employees. Employees are the strength of this company. Remove Dictatorship", "rating": 1, "pros": "Part of Growing Industry", "cons": "Firstly, there is so much fear in people to write a review here that they won't take this step. Though they want to but are scared. HR will keep on asking for 5 star reviews.", "advice": "Advice to Board. Management has eyes and ears closed for this office. Get a healthy professional environment. Employees deserve some respect and not never ending harassment. Listen to employees. Employees are the strength of this company. Remove Dictatorship"}, {"title": "wouldn't join again", "text": "Pros Great technology, felxible home office policy, good salary, great potential as a business if company adopts another attitude Cons Culture got lost because of changes in almost every level of Management over last 12 month. excitement replaced by fear and pressure. Micromanagement is daily business (if you don't like that someone counts your emails sent, then you must not join!). High turn over rate, company can't hire as fast as people leave -> risk for growth. And...HR is a mess... (they truly have no idea what they do) Advice to Management Remember :\"People never forget how you make them feel\". Sprinklr has a hugh potential to rock the market. Keep ambition high but treat people per Sprinklr core values (they got lost!!) and stop micro managing people. People leaving too soon and everytime value - to clients and Sprinklr - get lost.", "rating": 3, "pros": "Great technology, felxible home office policy, good salary, great potential as a business if company adopts another attitude", "cons": "Culture got lost because of changes in almost every level of Management over last 12 month. excitement replaced by fear and pressure. Micromanagement is daily business (if you don't like that someone counts your emails sent, then you must not join!). High turn over rate, company can't hire as fast as people leave -> risk for growth. And...HR is a mess... (they truly have no idea what they do)", "advice": "Remember :\"People never forget how you make them feel\". Sprinklr has a hugh potential to rock the market. Keep ambition high but treat people per Sprinklr core values (they got lost!!) and stop micro managing people. People leaving too soon and everytime value - to clients and Sprinklr - get lost."}, {"title": "Toxic - best to avoid", "text": "Pros The tech is decent, it isn't head and shoulders above everything else, but it is mostly good. The onboarding is good so you'll see lots of positive \"newby\" reviews before reality hits home. Cons Where to start? This place is toxic. Lies told through interview process, dreadful management and a non-existent work/life balance. Anyone who was any good has now left - like rats from a sinking ship. If you're an \"A player\" then this is not the place for you, you can do better! Advice to Management No point offering advice, it would not be listened to.", "rating": 1, "pros": "The tech is decent, it isn't head and shoulders above everything else, but it is mostly good. The onboarding is good so you'll see lots of positive \"newby\" reviews before reality hits home.", "cons": "Where to start? This place is toxic. Lies told through interview process, dreadful management and a non-existent work/life balance. Anyone who was any good has now left - like rats from a sinking ship. If you're an \"A player\" then this is not the place for you, you can do better!", "advice": "No point offering advice, it would not be listened to."}, {"title": "Moderation Services, Sprinklr", "text": "Pros - Mac book for everyone - Free lunch and dinner - Limited Work from home option - Night shift allowance Cons - 24/7 flexibility requirement - No overtime pay Advice to Management - Department manager should really figure out on how to communicate/involve himself around the department but without annoying anyone. - Don't hold back information that has no harm in being shared with rest of the team.", "rating": 5, "pros": "- Mac book for everyone", "cons": "- 24/7 flexibility requirement", "advice": "- Department manager should really figure out on how to communicate/involve himself around the department but without annoying anyone."}, {"title": "Nothing to see here", "text": "Pros Good London office location (close to plenty of bars when you need to drown your sorrows after a day in the well located office) Cons Too many egos (sales) and snowflakes (pre-sales) The VLC management should not be there, they are discredited and not respected. VPs not respected. They are so disconnected from their teams they may as well stay at home. People get fired like flys get swatted - with about the same amount of compassion and speed. It was fun a couple of years ago now it's just a drain on the employees soul. Advice to Management Fire VLC, fix culture, show compassion", "rating": 1, "pros": "Good London office location (close to plenty of bars when you need to drown your sorrows after a day in the well located office)", "cons": "Too many egos (sales) and snowflakes (pre-sales)", "advice": "Fire VLC, fix culture, show compassion"}, {"title": "AVOID!", "text": "Pros There used to be lots and now there are none. Cons It is such a shame what this company has become. With the VCE leadership take over they have destroyed everything Sprinklr once was. Every employee is just a number, and every client is just a logo. They do not care about either, instead work their employees to the bone, installing fear into the work place leaving everyone looking over their shoulder and will do anything to get a buck out of a \"logo\" even if its completely the wrong offering for the customer. They have recently laid off a lot of staff, some of which very long serving who made the company what is WAS....... VCE management seen laughing about letting these people go, while they line their own pockets with the newly available shares. If it wasn't for their on boarding process, where they ask for new starters to provide a 5 star review on Glass door, or plead with existing employees over company all hands, Sprinklr's true rating would be 1 star, (Glass door should update their star rating to include minus stars in order to provide a true reflection). Advice to Management Start again.", "rating": 1, "pros": "There used to be lots and now there are none.", "cons": "It is such a shame what this company has become. With the VCE leadership take over they have destroyed everything Sprinklr once was. Every employee is just a number, and every client is just a logo. They do not care about either, instead work their employees to the bone, installing fear into the work place leaving everyone looking over their shoulder and will do anything to get a buck out of a \"logo\" even if its completely the wrong offering for the customer.", "advice": "Start again."}, {"title": "Need some time to know more", "text": "Pros Agile, fun, unstructured, start-up, flat Cons Random, needs improvement in top management", "rating": 5, "pros": "Agile, fun, unstructured, start-up, flat", "cons": "Random, needs improvement in top management", "advice": null}, {"title": "Fast Track - No limits", "text": "Pros This company is on a fast track with literally no limits to where it will be in the next five-ten years. Possible buy-out in a couple of years. So, consider yourself to be quite fortunate to be working for Sprinklr. Cons Timing. This could be crucial, if you are an ambitious hire, you will be the first to be removed without any decency. So, ask around, where is the gap, and should you fill the gap wholly or you're an extension to the team? Advice to Management Decency. If you're to remain focused on the US market, why expand in other developed markets, let alone emerging?", "rating": 3, "pros": "This company is on a fast track with literally no limits to where it will be in the next five-ten years. Possible buy-out in a couple of years. So, consider yourself to be quite fortunate to be working for Sprinklr.", "cons": "Timing. This could be crucial, if you are an ambitious hire, you will be the first to be removed without any decency. So, ask around, where is the gap, and should you fill the gap wholly or you're an extension to the team?", "advice": "Decency. If you're to remain focused on the US market, why expand in other developed markets, let alone emerging?"}, {"title": "Professional Services", "text": "Pros Excellent Culture, Great benefits, amazing office Cons Not much, but the managers need to be more mentors than dictators Advice to Management NA", "rating": 5, "pros": "Excellent Culture, Great benefits, amazing office", "cons": "Not much, but the managers need to be more mentors than dictators", "advice": "NA"}, {"title": "Going through an employer rough patch", "text": "Pros CEO & CTO vision is crystal clear and Sprinklr is on the verge to dominate the market with the best digital customer engagement & experience management platform the world has ever seen. Seeing the technology evolves that way gives a real sense of purpose and strengthen the feeling that \"yes, what I do is important. yes, I can make a difference. yes, I can help my customer\" Cons Sprinklr has never been the best place to work when it comes to work-life balance and wearing as many hats as required without looking at working hours or job descriptions has always been law. However, a complete shake down of the top leadership and an insane obsession in (over?)-ambitious objectives aggravated the situation.", "rating": 3, "pros": "CEO & CTO vision is crystal clear and Sprinklr is on the verge to dominate the market with the best digital customer engagement & experience management platform the world has ever seen.", "cons": "Sprinklr has never been the best place to work when it comes to work-life balance and wearing as many hats as required without looking at working hours or job descriptions has always been law. However, a complete shake down of the top leadership and an insane obsession in (over?)-ambitious objectives aggravated the situation.", "advice": null}, {"title": "Worst company to work", "text": "Pros Only good thing about the company is the payroll Cons -No time for Personal life -Torture you to Death -They will expect you to work 24/7 even if you are on PTO -Worst Management Ever, they just don't care about employee satisfaction they just want the employees to work -No recognition for work done. Advice to Management Employees are not slave , treat them well !!!", "rating": 1, "pros": "Only good thing about the company is the payroll", "cons": "-No time for Personal life", "advice": "Employees are not slave , treat them well !!!"}, {"title": "Inefficient Management and Leadership. No consideration for people", "text": "Pros Possibility to work from home Great coworkers Cons Too many management layers No perspective for professional development Lack of strategic vision for our customers Absence of employees consideration even if they are there for a long time and could be a greater asset to the company", "rating": 1, "pros": "Possibility to work from home", "cons": "Too many management layers", "advice": null}, {"title": "Better to know what to expect there", "text": "Pros Good environment for a first job after university. Free (not \"good\") food . Cons - At Sprinklr, to grow or get promoted internally, it's all about \"who knows you\", never about \"what you can do\", and that tends to demotivate many people. Senior management hiring their friends, or acquaintances. Nothing is transparent. - HR exists... they don't do much! Policies are never clear or don't exist for specific situations. - No sense of professionalism, the majority of the leadership inexperienced and not given means to progress or learn how to lead. - Work/life balance isn't always possible especially when you have to work with teams based all over the globe - expect to have meetings late/early. - A very clicky atmosphere, some consultants are so unprofessional, that they will not want to work with you if you are not friends! - Restructures are very common and occur regularly. You can end up having 3 different managers in 3 months time, things change quickly, not especially for the best! Advice to Management Avoid hiring friends, teams want to believe in you, but you're just making it hard for everyone. \"Transparency\" should be one of Sprinklr's values.", "rating": 1, "pros": "Good environment for a first job after university.", "cons": "- At Sprinklr, to grow or get promoted internally, it's all about \"who knows you\", never about \"what you can do\", and that tends to demotivate many people. Senior management hiring their friends, or acquaintances. Nothing is transparent.", "advice": "Avoid hiring friends, teams want to believe in you, but you're just making it hard for everyone. \"Transparency\" should be one of Sprinklr's values."}, {"title": "Going through big changes", "text": "Pros Product covers lots of interesting areas and lots of interesting clients and use cases. Some great people to work with. Exciting vision for customer experience management. Cons CEO is hugely ambitious and wants to turn Sprinklr into the next Salesforce no matter the cost in people and culture. Lots of new senior management have been brought in recently with a remit to remake Sprinklr ready for this next stage, which has changed the culture dramatically. No longer has the sense of excitement, fun and \"scrappiness\" it once did. If remaking it works, could become great again but there's a lot of pain to get through first. Advice to Management Scale back your ambitions and focus on building something that delivers great value to your customers and is, once again, a great place to work.", "rating": 3, "pros": "Product covers lots of interesting areas and lots of interesting clients and use cases. Some great people to work with. Exciting vision for customer experience management.", "cons": "CEO is hugely ambitious and wants to turn Sprinklr into the next Salesforce no matter the cost in people and culture. Lots of new senior management have been brought in recently with a remit to remake Sprinklr ready for this next stage, which has changed the culture dramatically. No longer has the sense of excitement, fun and \"scrappiness\" it once did. If remaking it works, could become great again but there's a lot of pain to get through first.", "advice": "Scale back your ambitions and focus on building something that delivers great value to your customers and is, once again, a great place to work."}, {"title": "Lack of Professanilsm", "text": "Pros Only money is good. If looking for a career and not just moeny this isn't a place for you. Cons Unprofessional working environment. Promotion/stability based only on how much have you cozied u to your boss and not based on work done by you. No growth in your skills (other than licking). Advice to Management try to build a constructive professional environment.", "rating": 1, "pros": "Only money is good.", "cons": "Unprofessional working environment.", "advice": "try to build a constructive professional environment."}, {"title": "On-boarding & first 2 weeks", "text": "Pros This is my first Glassdoor review, and I'll keep it short as I've only been here 2 weeks! But those 2 weeks have both met and well exceeded expectations! Fantastic on-boarding, and Field Sales training, run by a fantastic team. Great content, engaging, fun events and an addictive team spirit you want to be part of! Quite easily the best on-boarding I've experienced so far.. Cons None I've found so far.. Advice to Management Keep investing in the on-boarding & development, it's a hard thing to get right but when you do, you're really starting employees on the best possible track.", "rating": 5, "pros": "This is my first Glassdoor review, and I'll keep it short as I've only been here 2 weeks! But those 2 weeks have both met and well exceeded expectations! Fantastic on-boarding, and Field Sales training, run by a fantastic team. Great content, engaging, fun events and an addictive team spirit you want to be part of! Quite easily the best on-boarding I've experienced so far..", "cons": "None I've found so far..", "advice": "Keep investing in the on-boarding & development, it's a hard thing to get right but when you do, you're really starting employees on the best possible track."}, {"title": "A company that is on a growth journey but still only at the beginning.", "text": "Pros Young team and good for entry level roles and people fresh out of university who want to have something on the CV and are happy to do monotonous roles. For more senior roles I would apply in NY only as every month they let go of people in EMEA and it is not reliable workplace. Cons Very messy and no processes or proper systems in place to being on boarded in non sales roles. Also senior execs have zero leadership or people skills and when people leave the company or are forced to leave, zero information is shared internally and people revert to gossip instead of valid HR information.", "rating": 1, "pros": "Young team and good for entry level roles and people fresh out of university who want to have something on the CV and are happy to do monotonous roles. For more senior roles I would apply in NY only as every month they let go of people in EMEA and it is not reliable workplace.", "cons": "Very messy and no processes or proper systems in place to being on boarded in non sales roles. Also senior execs have zero leadership or people skills and when people leave the company or are forced to leave, zero information is shared internally and people revert to gossip instead of valid HR information.", "advice": null}, {"title": "Disappointing Experience and unethical leadership", "text": "Pros Good food, Good office space,its good place for success teams and support teams. Cons No proper direction for engineers, Team leaders are very inexperienced in their jobs and as old timers get lots of advantage in all terms...some got lifetime blessed WFH facility and appear 1-2 times to the team in a year...Directors are not decisive and are better musicians than good at management..24*7 availability and no work life balance..how hard you work they treat you like slave..few old sprinklr blessed so called leads think they can decide anything..one day they will face what they do...demotions have become frequent and attrition is increasing..there is no job security for engineers.. Advice to Management Get to root cause and don't take random decisions...when you tell you care about people then mean it don't just say it...HR team needs to do more than just arranging good food...Higher management should care about what is going wrong with engineering...just don't be so money minded..", "rating": 1, "pros": "Good food, Good office space,its good place for success teams and support teams.", "cons": "No proper direction for engineers, Team leaders are very inexperienced in their jobs and as old timers get lots of advantage in all terms...some got lifetime blessed WFH facility and appear 1-2 times to the team in a year...Directors are not decisive and are better musicians than good at management..24*7 availability and no work life balance..how hard you work they treat you like slave..few old sprinklr blessed so called leads think they can decide anything..one day they will face what they do...demotions have become frequent and attrition is increasing..there is no job security for engineers..", "advice": "Get to root cause and don't take random decisions...when you tell you care about people then mean it don't just say it...HR team needs to do more than just arranging good food...Higher management should care about what is going wrong with engineering...just don't be so money minded.."}, {"title": "A Great Company", "text": "Pros We have an incredibly supportive and fun culture that helps us grow and become amazing partners to our clients . Amazing Mentors Cons There are no cons, probably some will say about work life balance is hard to maintain but I think that is cool . It only happen sometimes .", "rating": 5, "pros": "We have an incredibly supportive and fun culture that helps us grow and become amazing partners to our clients .", "cons": "There are no cons, probably some will say about work life balance is hard to maintain but I think that is cool . It only happen sometimes .", "advice": null}, {"title": "Turn this around please", "text": "Pros Best social technology in the market. Period. Great vision for social and digital transformation that is spot on and just needs to be executed properly. Cons Slaves to their investors targets, which has meant they are forced to upsell the hell out of every client regardless of need. Technology is hard to use once early adopters have moved on and left a knowledge gap. Advice to Management Stop chasing the IPO or exit, revert back to caring about your customers, build an external ecosystem of partners that can help with platform adoption. Get to a profitable cash position, reduce your growth as you're creaking at the seams, focus on expanding relationships instead of building a sale force of lemmings. Growth and platform adoption comes from advocacy, practice what you preach. You're close, just don't be greedy.", "rating": 3, "pros": "Best social technology in the market. Period. Great vision for social and digital transformation that is spot on and just needs to be executed properly.", "cons": "Slaves to their investors targets, which has meant they are forced to upsell the hell out of every client regardless of need. Technology is hard to use once early adopters have moved on and left a knowledge gap.", "advice": "Stop chasing the IPO or exit, revert back to caring about your customers, build an external ecosystem of partners that can help with platform adoption. Get to a profitable cash position, reduce your growth as you're creaking at the seams, focus on expanding relationships instead of building a sale force of lemmings. Growth and platform adoption comes from advocacy, practice what you preach. You're close, just don't be greedy."}, {"title": "Entrepreneurial Spirit", "text": "Pros I love working at Sprinklr because it's a perfect home for entrepreneurial spirits. If you have ambition and take initiative without being micro-managed, you will succeed here. There are also tons of perks: good work-life balance if you know how to manage your time, travel (depending on your role), free breakfast and lunch once a week, fun, dog-friendly office, and work from home. Cons Change is the only constant. If you want a predictable 9-5 with a clear hierarchical structure, this is not the place for you. Advice to Management Abysmal pension by UK/EMEA standards, lower-than-average base salaries", "rating": 5, "pros": "I love working at Sprinklr because it's a perfect home for entrepreneurial spirits. If you have ambition and take initiative without being micro-managed, you will succeed here. There are also tons of perks: good work-life balance if you know how to manage your time, travel (depending on your role), free breakfast and lunch once a week, fun, dog-friendly office, and work from home.", "cons": "Change is the only constant. If you want a predictable 9-5 with a clear hierarchical structure, this is not the place for you.", "advice": "Abysmal pension by UK/EMEA standards, lower-than-average base salaries"}, {"title": "Sales @ Sprinklr (a mess)", "text": "Pros Proposition in the social space is strong Free snacks and lots of food Some good, hard working people Cons Micro-management like you didn't know existed Not enterprise sales - you don't have the time for this Completely toxic atmosphere Easy to tell when someone has left - the group chats show 'ejected' Territories are completely pot luck and most likely churned several times. HR asking for a positive Glassdoor review when new is a poor policy. Advice to Management Stop throwing people at the problem and churning them when they don't fit. Treat people with respect and get people working together. Provide some leadership and inspiration rather than threats and pressure.", "rating": 1, "pros": "Proposition in the social space is strong", "cons": "Micro-management like you didn't know existed", "advice": "Stop throwing people at the problem and churning them when they don't fit. Treat people with respect and get people working together. Provide some leadership and inspiration rather than threats and pressure."}, {"title": "You'd be better off optimizing your skills elsewhere", "text": "Pros I don't know if there are pros that I could think of that directly matters, but since Glassdoor requires 20 word minimum, I'll just write something up here. Cons Back when I started with Sprinklr years ago, I noticed it received a lot of glowing reviews, with an average rating of 4.5 stars and now it has gone down to 3.6 stars - and this says it all. All recent 2017 reviews here suggest that good talented people were let go (me included). Sprinklr acquired so many companies in a year and that resulted in organizational mess as well as incompetent products! You can be great at what you're doing, but trust me, this is hardly appreciated in particular when your direct manager pats his/her boss for his/her own benefits and not caring about his/her team development. To a candidate - if you have invested your time and money to be a great worker, then please do not waste it on Sprinklr as it will take you down big time. Advice to Management You should figure it out yourself", "rating": 1, "pros": "I don't know if there are pros that I could think of that directly matters, but since Glassdoor requires 20 word minimum, I'll just write something up here.", "cons": "Back when I started with Sprinklr years ago, I noticed it received a lot of glowing reviews, with an average rating of 4.5 stars and now it has gone down to 3.6 stars - and this says it all.", "advice": "You should figure it out yourself"}, {"title": "Think not just twice before joining OR talk to an old employee", "text": "Pros Free Food Flexibility (NO MORE) Amazing Product Commitment to improving the product continuously Cons Lack of job security (too high). You are always in a pressure cooker environment. Management doesn't respect you and your skill at all. They force people to such extent that the person would have to choose between his ego and Sprinklr. Out of my experience with Sprinklr - They always win in the most unreasonable manner. Yearly salary appraisals are always delayed and they declare the appraised figure on the last day of the month. Old management is completely changed. Newest bunch is rude and arrogant. Work from homes / PTO / Tenure leaves are a joke. You never get it. Advice to Management Treat your employees well. We are or should be your best advocates. Give respect and take respect. Also want to let you know that, I have the guts to write against the current system but most of them are scared to take this step. Please do good and please make us part of it. Instead of threatening us and making us quit.", "rating": 1, "pros": "Free Food", "cons": "Lack of job security (too high). You are always in a pressure cooker environment. Management doesn't respect you and your skill at all. They force people to such extent that the person would have to choose between his ego and Sprinklr. Out of my experience with Sprinklr - They always win in the most unreasonable manner. Yearly salary appraisals are always delayed and they declare the appraised figure on the last day of the month. Old management is completely changed. Newest bunch is rude and arrogant. Work from homes / PTO / Tenure leaves are a joke. You never get it.", "advice": "Treat your employees well. We are or should be your best advocates. Give respect and take respect. Also want to let you know that, I have the guts to write against the current system but most of them are scared to take this step. Please do good and please make us part of it. Instead of threatening us and making us quit."}, {"title": "The best place to start your career", "text": "Pros A lot has already been written about the perks and all . But what I think truly stands out is that for a company the quality of the people it has its workforce matters and in this regard Sprinklr stands out among the best in the world. They have got the best mind across the country and therefore you get to work with them . Every day you go home from Sprinklr it always feels like u have learnt a lot. The kind of responsibilities that are given to a new comer here in Sprinklr is unparalleled . You are responsible for the product and that is one of the real reasons that it feels like you are the owner of the product and not working for some product in an organization. At last they give really awesome hikes(if you are an A grader). Cons The product management side really needs a lot of improvement . Though these people have been hired from the best B schools they are really not at par with what their job truly should be. They need to be more dedicated and more responsible for the product rather than just become a blocker and time consumer for the developers. Advice to Management Need more and more work. The developers might get frustated some times but we are habituated to more and more works and we love it . It also feel very good when we get any appreciation from the management so please continue to do so more and more.", "rating": 5, "pros": "A lot has already been written about the perks and all . But what I think truly stands out is that for a company the quality of the people it has its workforce matters and in this regard Sprinklr stands out among the best in the world. They have got the best mind across the country and therefore you get to work with them . Every day you go home from Sprinklr it always feels like u have learnt a lot.", "cons": "The product management side really needs a lot of improvement . Though these people have been hired from the best B schools they are really not at par with what their job truly should be. They need to be more dedicated and more responsible for the product rather than just become a blocker and time consumer for the developers.", "advice": "Need more and more work. The developers might get frustated some times but we are habituated to more and more works and we love it . It also feel very good when we get any appreciation from the management so please continue to do so more and more."}, {"title": "Great place to learn", "text": "Pros Open system and access to everything to learn. Cons Work life balance not maintained Advice to Management Be nice", "rating": 5, "pros": "Open system and access to everything to learn.", "cons": "Work life balance not maintained", "advice": "Be nice"}, {"title": "Learning and recognition", "text": "Pros The reason I love my job is that I'm constantly learning. Each day comes with new challenges, and if you have the right attitude it's the perfect place to embrace the opportunity and grow professionally. If you work hard people genuinely recognise it. Plus, the benefits are good and the people are fun. Personally I count myself very lucky to be part of the company. Cons It's hard work! Don't come here if you want to be comfortable. Almost every day I face a problem but I learn how to sort it and I'm better at my job as a result. You either love that, or you don't. Fix it, don't complain. Advice to Management Keep communication open and honest, that's really important to people.", "rating": 5, "pros": "The reason I love my job is that I'm constantly learning. Each day comes with new challenges, and if you have the right attitude it's the perfect place to embrace the opportunity and grow professionally. If you work hard people genuinely recognise it. Plus, the benefits are good and the people are fun. Personally I count myself very lucky to be part of the company.", "cons": "It's hard work! Don't come here if you want to be comfortable. Almost every day I face a problem but I learn how to sort it and I'm better at my job as a result. You either love that, or you don't. Fix it, don't complain.", "advice": "Keep communication open and honest, that's really important to people."}, {"title": "Director", "text": "Pros Great vision for the future Cons Big small company getting to terms", "rating": 5, "pros": "Great vision for the future", "cons": "Big small company getting to terms", "advice": null}, {"title": "Review for Product Engineers", "text": "Pros Great learning environment. Open to experiment with latest and upcoming technologies . Cons Will be made to work hard on some weekends too, if work demands that , so might be a problem some.", "rating": 5, "pros": "Great learning environment. Open to experiment with latest and upcoming technologies .", "cons": "Will be made to work hard on some weekends too, if work demands that , so might be a problem some.", "advice": null}, {"title": "Exciting place to work", "text": "Pros 1. Full ownership of products is given, which gives encouragement to work. 2. Opportunities to learn stuff increases while building products with full ownership 3. Good interaction with senior staff. Friendly environment 4. Flexible timings Cons Not many to mention here, other than occasionally heavy workload, which might have you working on weekends sometimes", "rating": 5, "pros": "1. Full ownership of products is given, which gives encouragement to work.", "cons": "Not many to mention here, other than occasionally heavy workload, which might have you working on weekends sometimes", "advice": null}, {"title": "Bad Experiences are more than Good experiences", "text": "Pros 1. Good salary initially. 2.Few colleagues are extremely helpful in nature(Most of them left company). Cons 1. Test engineer life is horrible in here. 2. 24/7 availability 3. Very very less hike 4. Test engineer are treated as slaves by Managers and Developers 5. No recognition for manual testers. 6. Lot of politics inside office when it comes to hike, promotions and bonus. 7. Repeating work most of the time. Nothing technical 8. Testing team is being shifted to Gurugram, Few people were fired in Bengaluru. Advice to Management Hike should be reasonable in order to motivate employees. Try to keep work life balance of employees", "rating": 3, "pros": "1. Good salary initially.", "cons": "1. Test engineer life is horrible in here.", "advice": "Hike should be reasonable in order to motivate employees."}, {"title": "Best startup (maybe not a startup anymore) in india to grow professionally", "text": "Pros Can achieve as much as the effort you put it. Loads of opportunities to learn and grow. Seniors care like family in times of trouble. Holidays are never an issue. :) Cons None i guess. More one on one regular reviews needed maybe. Advice to Management Keep the Sprinklr culture alive.", "rating": 5, "pros": "Can achieve as much as the effort you put it.", "cons": "None i guess. More one on one regular reviews needed maybe.", "advice": "Keep the Sprinklr culture alive."}, {"title": "Great company to work with", "text": "Pros Been working here for almost an year and it has been a wonderful journey. Cons Not any major con. Earlier there were talks about people not getting enough learning opportunity and the work hours. But there has been a lot of movement in both these areas from the higher management.", "rating": 5, "pros": "Been working here for almost an year and it has been a wonderful journey.", "cons": "Not any major con. Earlier there were talks about people not getting enough learning opportunity and the work hours. But there has been a lot of movement in both these areas from the higher management.", "advice": null}, {"title": "Enriching at first, Suffocating over time", "text": "Pros For a fresher, the learning curve is excellent. Modern tech stack. Amazing Mentors and leads. Free food from breakfast to dinner. Other than that, you can order tea/coffee/milk anytime and there is also well-stocked pantry. MAC Encouragement to take online courses (expenses paid by the company) No fixed timings. Good salary. Lots of residential options within 1km radius of the company location. Occasional outings to 5-star resorts. Cons Well, the list is quite long. Developers are treated as SLAVES. Work life balance is minimal or close to none. You are expected to work for atleast 10 hours (otherwise people literally judge you), you are expected to work when you get back home, you are expected to work on weekends. The only time that you get to yourself is when you sleep and even there are times when you are woken up by office colleagues. You are asked to cancel your pre-planned, pre-approved vacation and called back from one if they feel so. The priorities are not communicated properly. will be different according to different people. HR policies are changed overnight. (surprisingly a couple of weeks before the appraisals) Your work is judged by the amount of time you spend in the office, taking the minimal amount of leaves, spreading your presence on skype/slack, or having occasional chats with the upper management. The atmosphere is so competitive that you have to literally fight to showcase your work. Advice to Management Please change the perspective through which you appreciate your employees. There are many hard working employees who are fiercely loyal to the company but they are not appreciated just because they are too shy to have a good rapport with the upper management.", "rating": 3, "pros": "For a fresher, the learning curve is excellent.", "cons": "Well, the list is quite long.", "advice": "Please change the perspective through which you appreciate your employees. There are many hard working employees who are fiercely loyal to the company but they are not appreciated just because they are too shy to have a good rapport with the upper management."}, {"title": "The best place for a fresher.", "text": "Pros An excellent place to learn for a fresher. Amazing mentors. Perfect work place. Perfect and healthy food from breakfast to dinner. Good salary. Finally a perfect work place and most suitable environment for a fresher to start his/her career. Cons Nothing as such.. all i need is right there.. the company is doing a great job.", "rating": 5, "pros": "An excellent place to learn for a fresher.", "cons": "Nothing as such.. all i need is right there.. the company is doing a great job.", "advice": null}, {"title": "Worst experience. Avoid this factory", "text": "Pros No pros that I can think of. One good thing is it's location Gurgaon, which is a happening place. You get access to a variety of pubs here. Cons Very noisy work environment, as the office space is very congested. You are expected to work 24/7. You are expected to respond to queries even at wee hours. Saturdays are working days here, which they don't mention in the offer letter. Very unethical practices by the HR to get 5 star ratings on glass door. New joinees are asked to write 5 star reviews by the HR constantly. You can observe, all 5 star ratings are given by the freshers and seniors only give a 1 star. Avoid this company at all costs. Advice to Management Beyond repair. No advices here.", "rating": 1, "pros": "No pros that I can think of. One good thing is it's location Gurgaon, which is a happening place. You get access to a variety of pubs here.", "cons": "Very noisy work environment, as the office space is very congested. You are expected to work 24/7. You are expected to respond to queries even at wee hours.", "advice": "Beyond repair. No advices here."}, {"title": "Ask for the nature of the job before you join!! And Get confirmation date for Relieving letters", "text": "Pros 1.Cool company culture 2.Free food , recreation bay, extra food coupons 3.Birthday perks, pick up - drops 4.Growth ONLY if you work hard irrespective of the many years you spend in the system 5.Good pay for \"Technical\" personalities 6.Hard-working Senior Managers, I have not seen the time they are off-line on Skype, available all the time Cons 1. Dont know what to say about the Associate HR lady, When you ask for the relieving letters that are very essential for your next career step , You get lame answers stating \"She is busy\" / fake promises like \"Today\"/ \"Tomorrow\", Till date i was assuming HR work is to work for welfare of the employees, I was wrong. it was easy to get the birth certificate from the Regional BBMP office than with Sprinklr Associate HR lady. 2. Coming to Project Managers , No matter how hard you work, you ll not grow unless you're close to project manager/ TL, You're hardwork goes un-noticed. 3. Company is growing exponentially but only selected people grow along with it 4. Didn't see or experience opportunities for all, you'll be restricted/not given opportunities though you're interested in to work on certain things not sure why! but you keep hearing \"Opportunities will not come to you, you should go to it\" 5. You'll be reviewed for every quarter that's a good thing but no matter how much ever you work hard, The one who gets opportunities are pre-decided Note: Above written reviews are for Professional Services Team , NOT for technical /QA team", "rating": 3, "pros": "1.Cool company culture", "cons": "1. Dont know what to say about the Associate HR lady, When you ask for the relieving letters that are very essential for your next career step , You get lame answers stating \"She is busy\" / fake promises like \"Today\"/ \"Tomorrow\", Till date i was assuming HR work is to work for welfare of the employees, I was wrong. it was easy to get the birth certificate from the Regional BBMP office than with Sprinklr Associate HR lady.", "advice": null}, {"title": "Building the next best thing", "text": "Pros Quick, fast and agile working mode. Fresh, young and enthusiastic peer group. Immense learning opportunities A very friendly kitchen and (near to)homely food Good housekeeping and logistics staff The office has air purifiers! (read life_saver_in_gurgaon) Cons The company is ideal of young graduates who want to get to know the industry, learn what's new and work on the latest technology. In a nutshell, if your work is your life, then this is the best place to be. Else, it might to find a \"Work-life balance\". Advice to Management -", "rating": 5, "pros": "Quick, fast and agile working mode.", "cons": "The company is ideal of young graduates who want to get to know the industry, learn what's new and work on the latest technology. In a nutshell, if your work is your life, then this is the best place to be. Else, it might to find a \"Work-life balance\".", "advice": "-"}, {"title": "One of the best work cultures amongst the ones i saw", "text": "Pros Great management, wonderful work atmosphere, helpful co workers Cons Couldn't find a single one :)", "rating": 5, "pros": "Great management, wonderful work atmosphere, helpful co workers", "cons": "Couldn't find a single one :)", "advice": null}, {"title": "impartial review", "text": "Pros 1. Free food. Food at Sprinklr are awesome. I really missed it 2. Work hard . party hard 3. good salary Cons 1. No development at Bengaluru branch. Only QA and moderation teams working 2. Repeating work most of the time. No learning after 1 year 3. Managers say flexible timing. But by the end it's equal to 24/7 work 4. It feels like Developers at Gurgaon treats QA as slaves. 5. Need to available 24/7 even though you are on leave. 6. Employee performance based on how long you are online on Skype/Slack. 7. Hectic work and no work life balance. 8. More priority to manual testing than automation. 9. weekend release frustrates the employees. No payments on weekend work. 10. No innovating idea's , it's more or less same manual test everyday. It was happened that During release, bitbucket access will be revoked if you found working on automation. 11. Need to wait for Skype/Slack pings. It may come on midnight or early morning or on holidays or even on sick leaves. 12. None of the weekends are free. Either prod release or app release or staging or hotpatch. 13. you need to be online even if you don't have any work on weekends. 14. you need to inform them whatever you are doing even including having dinner. I got the warning that i am not available for testing after 9 pm. [ no work life balance ]. Advice to Management 1. try to keep work life balance 2. if possible, Give extra payment for people working on weekend. it makes employees to work more.", "rating": 3, "pros": "1. Free food. Food at Sprinklr are awesome. I really missed it", "cons": "1. No development at Bengaluru branch. Only QA and moderation teams working", "advice": "1. try to keep work life balance"}, {"title": "Love it!", "text": "Pros Great office. Colleagues are very helpful. Flexible environment with so much to learn. Cons Nothing to complain about so far, it's all good!", "rating": 5, "pros": "Great office. Colleagues are very helpful. Flexible environment with so much to learn.", "cons": "Nothing to complain about so far, it's all good!", "advice": null}, {"title": "Fab place!!!!", "text": "Pros Lots of learning, smart people ,good work culture, perks, great leadership Cons Nothing really... There's nothing That's a con... Company is on right path Advice to Management Nothing much", "rating": 5, "pros": "Lots of learning, smart people ,good work culture, perks, great leadership", "cons": "Nothing really... There's nothing That's a con... Company is on right path", "advice": "Nothing much"}, {"title": "Depends what you are looking for", "text": "Pros 1. Free Food 2. Good pay Cons 1. Culture. People spending way too much time at office. Teaches you poor management skills. The language and communication carried out at the office might not fit well with everyone. 2. No management as such. No well defined work and requirements might change overnight. 3. No vision or roadmap. Everything seems like a hack for contemporary needs. Advice to Management Might wanna start fixing the culture first among other problems.", "rating": 1, "pros": "1. Free Food", "cons": "1. Culture. People spending way too much time at office. Teaches you poor management skills. The language and communication carried out at the office might not fit well with everyone.", "advice": "Might wanna start fixing the culture first among other problems."}, {"title": "If you take the opportunities, you will learn a lot.", "text": "Pros As a designer, you get to work on the complete process from research till it's developed. The product has many modules, so there are tonnes of opportunities to work on. Cons Work-personal life balance might get to you if you work over hours, which usually happens during a release. Even if you're not a designer, always try to learn the user needs, go out there and speak to the users instead of taking briefs from the PMs. Advice to Management You're doing good, but you can be a lot better.", "rating": 5, "pros": "As a designer, you get to work on the complete process from research till it's developed. The product has many modules, so there are tonnes of opportunities to work on.", "cons": "Work-personal life balance might get to you if you work over hours, which usually happens during a release. Even if you're not a designer, always try to learn the user needs, go out there and speak to the users instead of taking briefs from the PMs.", "advice": "You're doing good, but you can be a lot better."}, {"title": "The Dying Culture - Bangalore PS & Marketing Group", "text": "Pros -used to be a fun place to work, small team, which eventually grew to a stellar number -the culture was great with Ragy and Murali visiting the office, inspiring us - This means a lot (Pls do that) - Older hires were given an importance, owing to Sprinklr experience (now treated like dirt bags) Cons -Bad hiring by team leads, leading to 'sprinklr culture' depreciation - there is no culture here - No career maps drawn for employees - people who came in 3 years ago still doing the same work - Favoring by team leads - based on regions and flattery - New process hence more shift and fight in hierarchy (I wish the Top mgt can look into this) - the attrition rate is higher and 2 out of 3 employees are frustrated - Since most work is outsourced here, underpaid - a mere 10% hike for a top performer on a yearly basis ( the amount of work done is the same as the US counterparts) - No bonus or incentives - unproductive team meetings - onsite opportunities are discouraged and only the team leads (who barely know the workflow) get to travel Advice to Management Bring Back the Culture, we need to be open to bring in more ideas and productivity. Getting managers from premier schools will just add more control and process.", "rating": 1, "pros": "-used to be a fun place to work, small team, which eventually grew to a stellar number", "cons": "-Bad hiring by team leads, leading to 'sprinklr culture' depreciation - there is no culture here", "advice": "Bring Back the Culture, we need to be open to bring in more ideas and productivity. Getting managers from premier schools will just add more control and process."}, {"title": "Great business idea but not thinking strategically", "text": "Pros Good culture and good employee benefits with unlimited holidays. Good induction and on-boarding team - very good plans to introduce new employees to the company and they make it sound too good to be true. Cons Senior management not thinking strategically- growing too quick but not enough staff to carry the growth. They just want to get the job done but not thinking clearly resulting in more pressure for the employees. Not ideal for people who want work life balance. Advice to Management Consider all departments need growing - not just sales.", "rating": 3, "pros": "Good culture and good employee benefits with unlimited holidays. Good induction and on-boarding team - very good plans to introduce new employees to the company and they make it sound too good to be true.", "cons": "Senior management not thinking strategically- growing too quick but not enough staff to carry the growth. They just want to get the job done but not thinking clearly resulting in more pressure for the employees. Not ideal for people who want work life balance.", "advice": "Consider all departments need growing - not just sales."}, {"title": "Product Engineer", "text": "Pros Good career opportunity Good tech stack to work on CTO is a very good person and a technical expert Cons Little value given to employees. Don't care about them Work at unusual times Slight pressure on deadlines.", "rating": 3, "pros": "Good career opportunity", "cons": "Little value given to employees. Don't care about them", "advice": null}, {"title": "Energetic with Purpose", "text": "Pros Just started with Sprinklr who provided the the warmest of welcomes and have recruited the smartest people. After 3 weeks in the role, Sprinklr have provided an excellent on-boarding programme, providing the tools to hit the ground running, to enable enterprise to drive customer experience. Cons The role is for high performing, can do sales professional, who thrive on making a difference........ Advice to Management Carry on doing what your doing - enabling teams and individuals to accelerate learning in a fun environment. Aligning the Exec and providing access to the new recruits is golden....", "rating": 5, "pros": "Just started with Sprinklr who provided the the warmest of welcomes and have recruited the smartest people. After 3 weeks in the role, Sprinklr have provided an excellent on-boarding programme, providing the tools to hit the ground running, to enable enterprise to drive customer experience.", "cons": "The role is for high performing, can do sales professional, who thrive on making a difference........", "advice": "Carry on doing what your doing - enabling teams and individuals to accelerate learning in a fun environment. Aligning the Exec and providing access to the new recruits is golden...."}, {"title": "Love it everyday!", "text": "Pros Great culture, great environment, very fast paced, great flexibility. you will be recognised on your merit Cons a growing startup, so everything that comes with that. However, this stage of growth is very well managed here, as compared to other companies at the same stage", "rating": 5, "pros": "Great culture, great environment, very fast paced, great flexibility. you will be recognised on your merit", "cons": "a growing startup, so everything that comes with that. However, this stage of growth is very well managed here, as compared to other companies at the same stage", "advice": null}, {"title": "Success Manager", "text": "Pros Good work life balance is encouraged. Fun environment. Work with many of the worlds largest brands. Strong management team, globally. Company recognise and reward high performance. Cons Bug fixes can take a long time. Communication channels aren't always clear. Advice to Management Make it easier for us to support our clients by improving internal communication channels. It's not always clear who we should be talking to to get things done, quickly. Provide a clear progression path to keep us motivated.", "rating": 5, "pros": "Good work life balance is encouraged. Fun environment. Work with many of the worlds largest brands. Strong management team, globally. Company recognise and reward high performance.", "cons": "Bug fixes can take a long time. Communication channels aren't always clear.", "advice": "Make it easier for us to support our clients by improving internal communication channels. It's not always clear who we should be talking to to get things done, quickly. Provide a clear progression path to keep us motivated."}, {"title": "Associate Engineer", "text": "Pros Awesome workplace, amazing culture, fast paced work environment Cons Hectic schedules and weekend releases", "rating": 5, "pros": "Awesome workplace, amazing culture, fast paced work environment", "cons": "Hectic schedules and weekend releases", "advice": null}, {"title": "Intern", "text": "Pros Good working environment,helpful team members and supportive team managers. Cons i have not find anything wrong yet.", "rating": 5, "pros": "Good working environment,helpful team members and supportive team managers.", "cons": "i have not find anything wrong yet.", "advice": null}, {"title": "operations engineer", "text": "Pros good technologies , amazing company cluture Cons promotion delays , frequently changing managers Advice to Management keep up the good work", "rating": 5, "pros": "good technologies , amazing company cluture", "cons": "promotion delays , frequently changing managers", "advice": "keep up the good work"}, {"title": "Money vs. Respect", "text": "Pros The CTC is better than most of the companies, even better than the big names like Amazon Cons Continuous Insecurity of being fired - they fire people within the first 6 months of hiring.", "rating": 3, "pros": "The CTC is better than most of the companies, even better than the big names like Amazon", "cons": "Continuous Insecurity of being fired - they fire people within the first 6 months of hiring.", "advice": null}, {"title": "Average", "text": "Pros - Good Salary - Comfortable Office - Salary increments can be good if you work very very hard Cons - No Work Life balance no matter how hard you try - Work quality is average, sometimes have to engage in pretty monotonous work - No growth (professional or personal)", "rating": 3, "pros": "- Good Salary", "cons": "- No Work Life balance no matter how hard you try", "advice": null}, {"title": "Senior SDET", "text": "Pros 1) Really good work environment. 2) One gets to work on a number of new technologies as an Automation Engineer. 3) Good Perks Cons No cons to fill in this section. Advice to Management None, they are very good.", "rating": 5, "pros": "1) Really good work environment.", "cons": "No cons to fill in this section.", "advice": "None, they are very good."}, {"title": "For the fast paced career seeker!", "text": "Pros Great benefits, great company for CV and progression Cons fast pace, not for those looking to sit comfortably for long periods", "rating": 5, "pros": "Great benefits, great company for CV and progression", "cons": "fast pace, not for those looking to sit comfortably for long periods", "advice": null}, {"title": "Best company to work with", "text": "Pros Growth Good pay Good food Amazing culture Cooperative management Best guidance may it be related to personal or professional life. Helpful people around If somebody actually wants to grow and willing to work hard and outshine please come and join, rest just excuse us :) Challenging surrounding Happy being here Cons I want my retirement from here :) Advice to Management you guys are doing amazing job. Thank you for all guidance and support at every step. #feelingshandaar", "rating": 5, "pros": "Growth", "cons": "I want my retirement from here :)", "advice": "you guys are doing amazing job. Thank you for all guidance and support at every step."}, {"title": "Great place to begin career", "text": "Pros Lots of learning, good working environment, flexible timings, helpful teammates Cons work life balance sometimes becomes hard to maintain but can be done if planned properly.", "rating": 5, "pros": "Lots of learning, good working environment, flexible timings, helpful teammates", "cons": "work life balance sometimes becomes hard to maintain but can be done if planned properly.", "advice": null}, {"title": "Confused if job location is Bangalore or Gurgaon", "text": "Pros No need to worry about food. It is free of cost Cons Job location is given as Bangalore. But sent to Gurgaon so often that half of the time is in Gurgaon. You are given less than 2 days notice of traveling to Gurgaon and you have to pack and leave Job location is Bangalore in offer letter and there is no mention of traveling so frequently to Gurgaon Frequent travel does not allow for any leave plans even if you really need few days of leave The leadership body at the managerial level is pathetic.Micromanagement is done. Managers threaten you with your appraisals The job is unstable.First year of work is good. After that, they can ask you to leave any time The work is repetitive. You have to do the same work 24*7 (No weekends are free) You are given work at odd hours like 2 am in the night or 9 pm in the night (There is no shift and you have to be available to work 24*7) It is a stressful job and if you are on leave , you are asked to carry your laptop wherever you go and continue to work Advice to Management Build a strong leadership team in Bangalore Office Don't force employees to travel frequently to Gurgaon or mention this in the offer letter", "rating": 1, "pros": "No need to worry about food. It is free of cost", "cons": "Job location is given as Bangalore. But sent to Gurgaon so often that half of the time is in Gurgaon.", "advice": "Build a strong leadership team in Bangalore Office"}, {"title": "Good Place to work", "text": "Pros - Abundance knowledge sharing - Good for individual growth - Free food - Flexible timings Cons - work-life balance too difficult to maintain - less happening place to be at, as it was before", "rating": 5, "pros": "- Abundance knowledge sharing", "cons": "- work-life balance too difficult to maintain", "advice": null}, {"title": "Good Work, Great People", "text": "Pros Great people, Progressive culture, good compensation, casual dress, healthcare Cons Nothing, Nothing, Nothing, Nothing, Nothing", "rating": 5, "pros": "Great people, Progressive culture, good compensation, casual dress, healthcare", "cons": "Nothing, Nothing, Nothing, Nothing, Nothing", "advice": null}, {"title": "Ok for a Short Term", "text": "Pros Great Office Atmosphere is Awesome Great team leads and Project Managers Cons No Career Growth No Social Life", "rating": 3, "pros": "Great Office", "cons": "No Career Growth", "advice": null}, {"title": "SDET", "text": "Pros Awesome work culture and great perks. Cons Recruitment of new managers has spoiled the startup culture", "rating": 5, "pros": "Awesome work culture and great perks.", "cons": "Recruitment of new managers has spoiled the startup culture", "advice": null}, {"title": "Not what it looks like in the reviews", "text": "Pros - Free breakfast and lunch. - Modern technology stacks Cons Don't trust the ratings for the gurgaon office here. Sprinklr understands the importance of the voice of the social network. Get in touch with a employee who's been working recently here for an extended period of time. Personal Recommendation: unless you are starved for decent job options, avoid. -> Non-existent work-life balance. There is no non-office hours, no evenings to yourself, no weekends to yourself. You'll be asked for your personal number and you'll get messages and calls any time of the day. -> Sprinklr wants code monkeys, not smart engineers. You are not entering a remotely creative field, you're getting yourself into a lot of uninspiring work with a lot of management overheads. If you think you're smart and will keep work limited to office by working smart and this work-life balance thing everyone is complaining about wont happen to you, you would be wrong. You'll be left with no life of your own. -> Asked to work like you're in a start-up, while being rewarded with none of the typical start-up goodies like work-flexibility, a part of the company's success, etc. Expect to earn a months salary worth of ESOPs after working a few years here. -> Although its a hugely successful company, its petty and will cut-costs at every opportunity, even if it is at the employees expense. -> Employees are not respected at all. On the contrary, they're downright unprofessional. Like being the target of unwelcome personal remarks unprofessional. -> Expect to do the support team and the QA team's work too. The extremely high turnover rates mean something. I could go on for a while. Make an informed decision, get in touch with someone who can give you a fair honest insight into the company.", "rating": 1, "pros": "- Free breakfast and lunch.", "cons": "Don't trust the ratings for the gurgaon office here. Sprinklr understands the importance of the voice of the social network. Get in touch with a employee who's been working recently here for an extended period of time. Personal Recommendation: unless you are starved for decent job options, avoid.", "advice": null}, {"title": "Long hours", "text": "Pros Good salary, you can really get a lot of money here especially in the sales team People are cool and smart Cons Long hours How about free food?! People are too busy Advice to Management Listen to your employee, they work too.much and would like to have time and also more opportunities.", "rating": 3, "pros": "Good salary, you can really get a lot of money here especially in the sales team", "cons": "Long hours", "advice": "Listen to your employee, they work too.much and would like to have time and also more opportunities."}, {"title": "Great place to work and learn", "text": "Pros - Flexible timings - You're allowed to plan your own timings, - Benefits: like gym membership, breakfast and lunch on the house, - Lots of opportunities to learn - Teams become really close Cons - Intense projects near deadlines: Work can get really hectic near releases, can put some pressure - Work life balance is a bit hard to maintain - but that is getting better, with more leaders taking the opportunity to make it a priority Advice to Management The workshops for learning so that the current employees are up to date on the most recent technologies is a great idea, but will require consistency as well as motivation.", "rating": 5, "pros": "- Flexible timings - You're allowed to plan your own timings,", "cons": "- Intense projects near deadlines: Work can get really hectic near releases, can put some pressure", "advice": "The workshops for learning so that the current employees are up to date on the most recent technologies is a great idea, but will require consistency as well as motivation."}, {"title": "Good company", "text": "Pros Good Company to work nice culture environment people are friendly Cons Pay scale is different and some people do the work while other just take credit for others work", "rating": 5, "pros": "Good Company to work nice culture environment people are friendly", "cons": "Pay scale is different and some people do the work while other just take credit for others work", "advice": null}, {"title": "Awesome!", "text": "Pros Every new joiner is assigned to a buddy who is in charge of training him/her. Very efficient program and great way to get to know your colleagues! Competitive salaries Major clients and business perspectives The office is amazing with great rooftop and a PS4 I've joined the company recently and I've seen a lot of people in my team to be promoted! It inspires a new joiner like me! Cons The hiring process took a long time", "rating": 5, "pros": "Every new joiner is assigned to a buddy who is in charge of training him/her. Very efficient program and great way to get to know your colleagues!", "cons": "The hiring process took a long time", "advice": null}, {"title": "Zero work life Balance", "text": "Pros • Good pay scale • Free kitchen • Technical learning is good Cons • Zero work life balance. People work extended hours and almost all weekends • Highly unprofessional environment in terms of processes. • Irrespective of how much dedication one shows, people always want more and the effort is not appreciated Advice to Management There's a lot of hypocrisy, please try to overcome that. If you promise one thing and mean something else, don't expect loyalty", "rating": 1, "pros": "• Good pay scale", "cons": "• Zero work life balance. People work extended hours and almost all weekends", "advice": "There's a lot of hypocrisy, please try to overcome that. If you promise one thing and mean something else, don't expect loyalty"}, {"title": "A place which brings in a responsible developer from a college procrastinator", "text": "Pros OK now time to select some best ones: 1. You get mac's (trust me this matters to freshers) and a world class working environment, the office is not some monotonous work environment its a combination of some great interiors which is designed to make you make comfortable, you are served with a full breakfast and lunch and can order tea and small snacks anytime, there is also a fun zone where there is a TT table Pool table and Fooseball table. So infrastructure wise its a treat to you everyday. 2. Your work matters and you are responsible for it, feels like pain right but trust me it is a different when something you have administered with such effort goes live and actual users are using it. So yes it takes a bit time but a sense of responsibility is indulged in you. The attitude of 'dekh lia jayega' if converted to 'dekho and fix karo'. 3. Technically we try to be updated to all the latest tools and frameworks in the market right now so its a great place to learn all these technologies and work with them. Your learning curve is drastically improved and trust me as a developer learning stuff quickly is as important as developing stuff quickly. 4. These people are trust me pretty flexible you can work the way you want to and where you want to in office and wear casual clothes. Trust me its so comfortable that you actually miss coming to office when you are on a holiday for some reason. 5. Its challenging, trust me there would be times that you would be ask to make some thing is incredibly short amount of time, people are there to help you in process but your limits are really pushed and you wont realise when you start loving it. See working here for quite a long time now i can list a lot of benefits but to summarise all i can say is when i wake up in morning i don't think 'oh darn i have to go to work' and working here has helped me grow technically and personally. Cons Ohk now these are also interesting 1) If you are thinking that this is a perfect 9 - 5 job 5 days a week not the case, as i said you are responsible for work so although there is a work time followed but if it is required that you stay late or work on weekend to complete your work on time you are expected to do so. 2) Forget advanced planning for trips and work. As i said you matter here so does your work, so you never know till friday whether you would be free this weekend or not or whether you would be free on a wed to catch a show at 9PM. It all depends on what work is given to assigned to you. 3) Trust me these people spoil you with all the food and such good services and yes its a CON these are not available everywhere. :P Work wise this is a challenging place trying to solve real time problems so if you are kind of a person who loves a simple 9 - 5 small job this might not be a place for you", "rating": 5, "pros": "OK now time to select some best ones:", "cons": "Ohk now these are also interesting", "advice": null}, {"title": "Best job for a fresher", "text": "Pros One can explore a lot of challenges here Many brilliant people to work with The leaders are very enthusiastic and concerned about their product and customers Great exposure to a lot of technologies and opportunities Work culture is improving Cons Need to keep hiring more employees for the increasing work-load", "rating": 5, "pros": "One can explore a lot of challenges here", "cons": "Need to keep hiring more employees for the increasing work-load", "advice": null}, {"title": "Great place to work", "text": "Pros Always something new to learn. Lively fast paced environment Fun Cons I don't have any to list yet.", "rating": 5, "pros": "Always something new to learn.", "cons": "I don't have any to list yet.", "advice": null}, {"title": "Overall Experience of Sprinklr in 2 months.", "text": "Pros 1) Young and hard working people around you. 2) Since company is growing in very well shape. There is a very good chance to get important responsibilities in short time. 3) Food is free and it is very good. I will give 5 out of 5 star for this service. 4) No typical company politics here. Everyone works for team and company. Cons I am not able to find cons so far.", "rating": 5, "pros": "1) Young and hard working people around you.", "cons": "I am not able to find cons so far.", "advice": null}, {"title": "Served more than 2 yrs and true review", "text": "Pros 1. Interview was good 2. Free good and snacks 3. Nice salary and benefits (though cost cutting started now) 4. Good culture and values. (differs from offices) Cons 1. Lot of politics team to team 2. Salary and benefits reduced just one started job it will be good for first yr alone 3. They tell flexible timing and work from home option. But rather we end up in working 24/7 even saturdays and sundays. Which no one values as well. 4. So many leads around who just bring new processes then and there which lead to more confusions and stress for employees. 5. No breathing time for employees . And lot of pressure. 6. Finally after working much there will be no promotion cycle for the whom really worked . And work not counted also Advice to Management Company is good . We quit managers not company. We are in need of leaders not boss. Sprinklr doesn't shout but managers and leads do often. Please consider the hard work of your employees.", "rating": 3, "pros": "1. Interview was good", "cons": "1. Lot of politics team to team", "advice": "Company is good . We quit managers not company. We are in need of leaders not boss. Sprinklr doesn't shout but managers and leads do often. Please consider the hard work of your employees."}, {"title": "Moderations", "text": "Pros Good place to work , posh, food is free good pay Cons Nothing much to learn from their end in services , its all depends on ur capability", "rating": 3, "pros": "Good place to work , posh, food is free good pay", "cons": "Nothing much to learn from their end in services , its all depends on ur capability", "advice": null}, {"title": "Work Hard . . . Party Harder !", "text": "Pros It is the best place I have come across in my professional life to work and also enjoy working We can learn a lot, especially the kind of training we get on Sprinklr software. Open culture and highly supportive leadership team Amazing perks and work environment which will be the added advantage for us to work Cons I feel employees are over pampered and I have personally seen many of my colleagues taking advantage of this. resulting in wasting our energy to solve these petty issues. Advice to Management Please increase the number of leaves per annum, Our leadership team is doing a great job. Let them do their work.", "rating": 5, "pros": "It is the best place I have come across in my professional life to work and also enjoy working", "cons": "I feel employees are over pampered and I have personally seen many of my colleagues taking advantage of this. resulting in wasting our energy to solve these petty issues.", "advice": "Please increase the number of leaves per annum,"}, {"title": "It nice place to work", "text": "Pros Lot to learn if you are SDET Free food Cons Nothing to learn if you are just a manual tester Advice to Management Give rewards of good work in team.", "rating": 5, "pros": "Lot to learn if you are SDET", "cons": "Nothing to learn if you are just a manual tester", "advice": "Give rewards of good work in team."}, {"title": "If you Want to learn and be with amazing people , Sprinklr is for you.", "text": "Pros 1. High product contribution , every now and then you see big things coded solely by you on production and it gives me immense pleasure. 2. Latest technologies in the market are adopted quickly. SO you get to learn a lot. 3. Very open environment , I frequently have frank discussions with CTO , VPs 4. Family like environment where everybody cares for your health and well being. 5. Beautiful Recreational area. 6. Free Tasty Food(breakfast and lunch) 7. full time tea , maggi , snacks served on table 8. Great salary 9. Big TV screen where people watch football,cricket together. Cons No cons , but at-least 20 words are required as per glassdoor policy. 1. Gurgaon city has very few good low cost places for dinner , So for bachelors dinner will be a problem. Advice to Management though this choice will differ person to person but please don't renovate 9th floor office , I love the current openness of it. If renovation is going to be done don't make it cubicle like 10th floor. At-least one team of 10 people should be able to sit together without any barriers", "rating": 5, "pros": "1. High product contribution , every now and then you see big things coded solely by you on production and it gives me immense pleasure.", "cons": "No cons , but at-least 20 words are required as per glassdoor policy.", "advice": "though this choice will differ person to person but please don't renovate 9th floor office , I love the current openness of it. If renovation is going to be done don't make it cubicle like 10th floor. At-least one team of 10 people should be able to sit together without any barriers"}, {"title": "Good employer", "text": "Pros Work life balance Fun Beer fridge Dogs Location Size Culture Direction Cons Not really any issues, great place to work Advice to Management consider a review of compensation", "rating": 5, "pros": "Work life balance", "cons": "Not really any issues, great place to work", "advice": "consider a review of compensation"}, {"title": "Sprinklr Experience", "text": "Pros Facilities, free food, Culture(to an extent) Cons Micro management, bad working hours, less public holidays(u gotto work) Advice to Management Get a better and experienced person to manage the organisation, current ones ain't efficient to handle the current no.", "rating": 3, "pros": "Facilities, free food, Culture(to an extent)", "cons": "Micro management, bad working hours, less public holidays(u gotto work)", "advice": "Get a better and experienced person to manage the organisation, current ones ain't efficient to handle the current no."}, {"title": "Product Engineer", "text": "Pros Friendly culture ,helpful people and a lot of responsibilities Cons No prons that can I see of at this moment Advice to Management You people are doing great", "rating": 5, "pros": "Friendly culture ,helpful people and a lot of responsibilities", "cons": "No prons that can I see of at this moment", "advice": "You people are doing great"}, {"title": "Not good for developers and designers", "text": "Pros - The company is growing well because of a good sales team. - There are chances of the IPO, hence, there can be some quick wealth creation for individuals who have been connected with this company for the past 2-4 years. Cons - Work as a developer / designer is not at all exciting. - For developers, this is more of a services company where you need to do as your clients say. There are no interesting challenges to solve. - People are not respected for their work. Too much of politics. - Things are not conducted professionally. - There is no organizational culture. Good employees who want to work hard get stranded between the politics within the teams. Advice to Management - Try to set a culture within the organization. - Set some company policies and give more power to the HR, so that things can be conducted professionally.", "rating": 3, "pros": "- The company is growing well because of a good sales team.", "cons": "- Work as a developer / designer is not at all exciting.", "advice": "- Try to set a culture within the organization."}, {"title": "Fake cool company", "text": "Pros Good vision and salary. A lot of references'names to support the sales pitch. Nice training in new york to get to know the product and the company. Cons If you are reading this, it means you have doubts. If you have doubts, dont go there! Recruit only top talent with too much ambition and zero empathy. Middle management class is rising and bringing political games first far before any customer (or company) interests. No desire to deliver what they promise. (For customers, for employees) Advice to Management Do actually care instead of shouting about it!", "rating": 3, "pros": "Good vision and salary.", "cons": "If you are reading this, it means you have doubts.", "advice": "Do actually care instead of shouting about it!"}, {"title": "Best place to work", "text": "Pros 1. Cool technology 2. Learning opportunity 3. Challenging work 4. Best colleagues 5. Cool company culture Cons I haven't found yet. Advice to Management More team-building activities for every group", "rating": 5, "pros": "1. Cool technology", "cons": "I haven't found yet.", "advice": "More team-building activities for every group"}, {"title": "Community Manager", "text": "Pros One of the best social media companies to be in. Benefits given are really good. Opportunity to grow. Surrounded by the best mind. Cons The location of the office is far from the city. Advice to Management Continue the good work", "rating": 5, "pros": "One of the best social media companies to be in.", "cons": "The location of the office is far from the city.", "advice": "Continue the good work"}, {"title": "Great place to start your career.", "text": "Pros It is a nice place to learn especially for the freshers. You get to work on live projects, take full responsibility. Cons Not as much, but a little of politics in employee favouritism is there and it should be there, so that others learn from it. Advice to Management You are doing awesome and keep going like this only.", "rating": 5, "pros": "It is a nice place to learn especially for the freshers.", "cons": "Not as much, but a little of politics in employee favouritism is there and it should be there, so that others learn from it.", "advice": "You are doing awesome and keep going like this only."}, {"title": "Fantastic onboarding experience @ Sprinklr", "text": "Pros - All new employees are sent the New York HQ for a two day induction program, including several interventions from the company's executives (CFO, COO) - The office is fantastic, as well as the employee experience team Cons - It may be time to have some single sign on capabilities when we see all the applications we are using.", "rating": 5, "pros": "- All new employees are sent the New York HQ for a two day induction program, including several interventions from the company's executives (CFO, COO)", "cons": "- It may be time to have some single sign on capabilities when we see all the applications we are using.", "advice": null}, {"title": "Very good", "text": "Pros Good work culture. Helpful seniors. The management is good. Good crowd. The facilities provided are the best. Proud to be in Sprinklr. Cons Less growth. Some managers are partial", "rating": 5, "pros": "Good work culture. Helpful seniors. The management is good. Good crowd. The facilities provided are the best. Proud to be in Sprinklr.", "cons": "Less growth. Some managers are partial", "advice": null}, {"title": "Love It", "text": "Pros Great benefits, fun atmosphere, autonomous working Cons Not a great pension Advice to Management More of the same!", "rating": 5, "pros": "Great benefits, fun atmosphere, autonomous working", "cons": "Not a great pension", "advice": "More of the same!"}, {"title": "Not all is good about this place.", "text": "Pros Good facilities are provided. Office organizes parties on weekends. Pay is decent compared to other companies. Free food is provided. Cons Work is mainly based on UI. So not much technical knowledge growth possible. Variable pay is more than fixed pay. Fair hikes are not given based on performance. Different hikes are given based on job profile rather than performance. No extra incentives for working on weekends. Advice to Management Treat all the employees equally by giving fair and justified hikes. Conduct more employee engagement activities. Extra incentives for employees who work on weekends.", "rating": 3, "pros": "Good facilities are provided.", "cons": "Work is mainly based on UI. So not much technical knowledge growth possible.", "advice": "Treat all the employees equally by giving fair and justified hikes."}, {"title": "No work life balance, great perks", "text": "Pros Salary and benefits are good Cons No work life balance present", "rating": 3, "pros": "Salary and benefits are good", "cons": "No work life balance present", "advice": null}, {"title": "Senior Success Manager", "text": "Pros You are really free to give your job the flexibility you want. Clients are big entreprises/majors companies which give you the ability to work with different clients typologies. The vision and the product are amazing and you really know where you are going on a daily basis. Cons You need to deliver and do what it takes to suits your clients. You need to work hard but the game is clear and the rule are defines. Managers can really help you when you are too overwhelmed.", "rating": 5, "pros": "You are really free to give your job the flexibility you want. Clients are big entreprises/majors companies which give you the ability to work with different clients typologies. The vision and the product are amazing and you really know where you are going on a daily basis.", "cons": "You need to deliver and do what it takes to suits your clients. You need to work hard but the game is clear and the rule are defines. Managers can really help you when you are too overwhelmed.", "advice": null}, {"title": "Working at Sprinklr", "text": "Pros Cutting-edge product, incredible spirit and ethos, working with the world's biggest brands, potential for advancement, passion and commitment from C-Suite Cons Dynamic and fast moving processes and industry not for the faint hearted, external regulatory and competitive challenges (that we overcome!), requires flexibility working across global teams and timezones Advice to Management Keep doing what you're doing! Pleasure to work with Senior Management who care so genuinely about the product, customers and employees", "rating": 5, "pros": "Cutting-edge product, incredible spirit and ethos, working with the world's biggest brands, potential for advancement, passion and commitment from C-Suite", "cons": "Dynamic and fast moving processes and industry not for the faint hearted, external regulatory and competitive challenges (that we overcome!), requires flexibility working across global teams and timezones", "advice": "Keep doing what you're doing! Pleasure to work with Senior Management who care so genuinely about the product, customers and employees"}, {"title": "Awesome place to work", "text": "Pros Sprinklr has everything you need to keep yourself motivated. Someone would for sprinklr not as any other company but his own. Latest technology, freedom to code, nice work facility and good food are somethings one can look for. Cons There are not much to mention, if we could keep ourself motivated as one big sprinklr family no one can stop us, no matter how much we grow. Advice to Management Staying aligned to the vision as you have done in the past.", "rating": 5, "pros": "Sprinklr has everything you need to keep yourself motivated. Someone would for sprinklr not as any other company but his own. Latest technology, freedom to code, nice work facility and good food are somethings one can look for.", "cons": "There are not much to mention, if we could keep ourself motivated as one big sprinklr family no one can stop us, no matter how much we grow.", "advice": "Staying aligned to the vision as you have done in the past."}, {"title": "Great Company", "text": "Pros -Great work environment -Supportive management -Excellent Facilities Cons No cons so far and I hope it remains this way.", "rating": 5, "pros": "-Great work environment", "cons": "No cons so far and I hope it remains this way.", "advice": null}, {"title": "Social Media Community Manager", "text": "Pros Good environment to work, nice place Cons No cons as yet :)", "rating": 5, "pros": "Good environment to work, nice place", "cons": "No cons as yet :)", "advice": null}, {"title": "Helping Social & Digital Transformation", "text": "Pros Creative, progressive and effective. Sprinklr genuinely feel very passionately about their clients and want to ensure that their clients truly understand their customers across all of their social interactions. Cons Only 5 weeks into my new positions so too early to comment. Non experienced this far.", "rating": 5, "pros": "Creative, progressive and effective. Sprinklr genuinely feel very passionately about their clients and want to ensure that their clients truly understand their customers across all of their social interactions.", "cons": "Only 5 weeks into my new positions so too early to comment. Non experienced this far.", "advice": null}, {"title": "Great place to work & grow", "text": "Pros - Competitive salary - Lots to learn - Great people in the work place Cons - Work over the weekends - All Indian holidays might not be off", "rating": 3, "pros": "- Competitive salary", "cons": "- Work over the weekends", "advice": null}, {"title": "Good", "text": "Pros Good job,great salary and other compensation benefits. Cons Nothing much,keep it simple,take care of ur employees the same way", "rating": 3, "pros": "Good job,great salary and other compensation benefits.", "cons": "Nothing much,keep it simple,take care of ur employees the same way", "advice": null}, {"title": "It's great to be a part of Sprinklr.", "text": "Pros 1. Work is quite good and the company is moving at a sonic pace. 2. Enjoyment is equally emphasised. 3. Culture is very open and enthusiastic for the ones who want to work. 4. Compensates very well if you're worthy. Cons 1. You work might be over-shadowed with the ones who already performed well, but competition is good for overall and long term growth. 2. That's it. :D Advice to Management Spend the money on right things, rather than wasting on things which may not help everyone.", "rating": 5, "pros": "1. Work is quite good and the company is moving at a sonic pace.", "cons": "1. You work might be over-shadowed with the ones who already performed well, but competition is good for overall and long term growth.", "advice": "Spend the money on right things, rather than wasting on things which may not help everyone."}, {"title": "Best place to work at, hands down", "text": "Pros Great growth opportunities. Focussed towards staff welfare. Fun and challenging to work at Management team is absolutely amazing and approachable for all your concerns. Great work culture and policies Cons absolutely none so far! :)", "rating": 5, "pros": "Great growth opportunities.", "cons": "absolutely none so far! :)", "advice": null}, {"title": "Good Learning Opportunities but professionalism needed", "text": "Pros Excellent learning opportunities with some of the greatest tech minds who always try to upgrade to latest stack on every platform. Some of the senior really help to improve your tech skills. Cons Sometimes, the superiors are more biased towards the ones who code good and are valuable to them. I think its expected in a company but what everyone wants is to feel accepted by the company and i think Sprinklr needs to improve on that part.", "rating": 3, "pros": "Excellent learning opportunities with some of the greatest tech minds who always try to upgrade to latest stack on every platform. Some of the senior really help to improve your tech skills.", "cons": "Sometimes, the superiors are more biased towards the ones who code good and are valuable to them. I think its expected in a company but what everyone wants is to feel accepted by the company and i think Sprinklr needs to improve on that part.", "advice": null}, {"title": "Best company to work at", "text": "Pros - Too much learning opportunities - Smartest techies all around - No politics - Lot of motivation around - Awesome facilities at office Cons - Working from past 1 year and see no cons so far Advice to Management - Keep motivating people as you always do", "rating": 5, "pros": "- Too much learning opportunities", "cons": "- Working from past 1 year and see no cons so far", "advice": "- Keep motivating people as you always do"}, {"title": "Tough to get in but once in, you'll get the best workplace experience!", "text": "Pros People here are so highly qualified, intelligent and friendly. It's not a corporate style company, and therefore it's a very relaxed working environment. Unlimited number of holidays - which is a great bonus if you want to take a long holiday to recharge. Moving up to a different opportunity within Sprinklr is a great potential as the company is constantly looking for people. If you are looking for a true Work/Life balance, then this is the perfect company! Cons Like many other big companies, clear communication is always a problem. Having difficulties to understand company's visions which seem to be changing constantly. Advice to Management Re-think about acquiring more companies and focus on rapid growth and success within enormous number of staff you already have.", "rating": 5, "pros": "People here are so highly qualified, intelligent and friendly. It's not a corporate style company, and therefore it's a very relaxed working environment. Unlimited number of holidays - which is a great bonus if you want to take a long holiday to recharge. Moving up to a different opportunity within Sprinklr is a great potential as the company is constantly looking for people. If you are looking for a true Work/Life balance, then this is the perfect company!", "cons": "Like many other big companies, clear communication is always a problem. Having difficulties to understand company's visions which seem to be changing constantly.", "advice": "Re-think about acquiring more companies and focus on rapid growth and success within enormous number of staff you already have."}, {"title": "Great place to work at", "text": "Pros - Welcoming work culture - Great learning opportunities - Good learning curve - Flexible timings taken seriously Cons None that I've found up till now", "rating": 5, "pros": "- Welcoming work culture", "cons": "None that I've found up till now", "advice": null}, {"title": "Best place to start", "text": "Pros Best environment to learn around great people, free food, loads of parties, flexible timings Cons For the sake of 5 words", "rating": 5, "pros": "Best environment to learn around great people, free food, loads of parties, flexible timings", "cons": "For the sake of 5 words", "advice": null}, {"title": "Awesome, hectic and well intentioned", "text": "Pros Fast paced working environment A great mix of people who all genuinely care and help each other Nice soft perks like free food, drinks and free massages Cons Some areas where growth has outpaced the structure of the business and there's a need for a backfill on process (eg introduction of a formal career development and appraisals structure for staff) American benefits (rubbish pension, limited fixed holiday although additional holiday is available at manager's discretion) Advice to Management Start thinking like a mid sized company, we aren't a startup any more!", "rating": 5, "pros": "Fast paced working environment", "cons": "Some areas where growth has outpaced the structure of the business and there's a need for a backfill on process (eg introduction of a formal career development and appraisals structure for staff)", "advice": "Start thinking like a mid sized company, we aren't a startup any more!"}, {"title": "Good place to work at", "text": "Pros Modern technologies, good and young team. Different office location. Cons Very sturtupish development process, often overwork", "rating": 5, "pros": "Modern technologies, good and young team. Different office location.", "cons": "Very sturtupish development process, often overwork", "advice": null}, {"title": "yayyy", "text": "Pros Great infrastructure. Great People Lot of learning. Cons Shifts could get tedious,but that is part of the job-can't be helped. Advice to Management Keep up the good work!", "rating": 5, "pros": "Great infrastructure.", "cons": "Shifts could get tedious,but that is part of the job-can't be helped.", "advice": "Keep up the good work!"}, {"title": "Alert! read each review very cautiously.. Some are just justifications.. not a review", "text": "Pros Facilities are pretty awesome and office management do their best to serve you with good things to make your evening or day special. Cons Moderation services management are stubborn and arrogant, they are not at all open to feedback everyone like listening good things about them but being a manager most of the lead lack in managerial skills. Too much of micro management is not required sometimes. I know it is a part of your job but it is not the only job u have.... People take credit for your work most of the time... Fame is something which most of them never leave a chance to achieve. HR is not at all neutral which I guess should be the basic understand of being a HR everyone does.. They keep interfering in your personal life you are ask to work in your off timings.. People are very judgmental...mostly the old crowd in the system... I wish I should have never joined sprinklr..... Advice to Management I know management is not open to negative feedback so it;s pointless writing one...", "rating": 3, "pros": "Facilities are pretty awesome and office management do their best to serve you with good things to make your evening or day special.", "cons": "Moderation services management are stubborn and arrogant, they are not at all open to feedback everyone like listening good things about them but being a manager most of the lead lack in managerial skills. Too much of micro management is not required sometimes. I know it is a part of your job but it is not the only job u have.... People take credit for your work most of the time... Fame is something which most of them never leave a chance to achieve. HR is not at all neutral which I guess should be the basic understand of being a HR everyone does.. They keep interfering in your personal life you are ask to work in your off timings.. People are very judgmental...mostly the old crowd in the system... I wish I should have never joined sprinklr.....", "advice": "I know management is not open to negative feedback so it;s pointless writing one..."}, {"title": "Wouldn't touch it with a badge poll!", "text": "Pros The long term vision is great and what it aspires to. The attempt to be best in class is great but that's all. Consistently recruiting without a plan but then devising services are not required then they lay off people but still go on to acquire companies offering the very services of the people they lay off! Cons There are far too many cliques! Low self esteem g employees that have been there longer & threatened by new entrants! Lots of mud slinging & fabrications against anyone that is a threat. Senior management protects bullies and brushes any such complaints under the carpet. Dare to speak against such behaviours and you are out of the door. The company is over sold to you when you join what's on the ground is a total opposite. The vision is lost if not delusional! Ideas are never welcomed unless introduced by a senior staff member and to survive you must do a lot of sucking up or mud slinging! This is a very late start up that wants to cling on to the \"start up\" title in order to justify the chaos within Sprinklr. Expect a defence response from the Experience Director but it needs to be done to look good! Advice to Management There is no point in giving the advice. They don't listen to anyone.", "rating": 1, "pros": "The long term vision is great and what it aspires to. The attempt to be best in class is great but that's all. Consistently recruiting without a plan but then devising services are not required then they lay off people but still go on to acquire companies offering the very services of the people they lay off!", "cons": "There are far too many cliques! Low self esteem g employees that have been there longer & threatened by new entrants! Lots of mud slinging & fabrications against anyone that is a threat. Senior management protects bullies and brushes any such complaints under the carpet. Dare to speak against such behaviours and you are out of the door. The company is over sold to you when you join what's on the ground is a total opposite. The vision is lost if not delusional! Ideas are never welcomed unless introduced by a senior staff member and to survive you must do a lot of sucking up or mud slinging! This is a very late start up that wants to cling on to the \"start up\" title in order to justify the chaos within Sprinklr. Expect a defence response from the Experience Director but it needs to be done to look good!", "advice": "There is no point in giving the advice. They don't listen to anyone."}, {"title": "Faced Paced and Positive Energy", "text": "Pros 1. Great place to start a career, Sprinklr is growing at a rapid pace and works with the greatest brands. 2. Excellent work culture and family like atmosphere. Work place is always a buzz, full of activities, fun, gaming and food. Cons My Team Leader was working from Delhi, there were issues with regards to co-ordination at certain occasions and also they never stocked Chocos in the Pantry, Just kidding. Advice to Management No advice, they are doing a fine job.", "rating": 5, "pros": "1. Great place to start a career, Sprinklr is growing at a rapid pace and works with the greatest brands.", "cons": "My Team Leader was working from Delhi, there were issues with regards to co-ordination at certain occasions and also they never stocked Chocos in the Pantry, Just kidding.", "advice": "No advice, they are doing a fine job."}, {"title": "General", "text": "Pros Flexible work culture,good people,nice salary Cons bad location,less people per team Advice to Management Recruit more software researchers", "rating": 3, "pros": "Flexible work culture,good people,nice salary", "cons": "bad location,less people per team", "advice": "Recruit more software researchers"}, {"title": "#sprinklrlife - the beginning", "text": "Pros Great onboarding experience during my first week with Sprinklr. Met so many people and everyone was friendly and approachable. There really is the 'all in it together' feeling and that everyone is aiming for the same goal - delighted customers. As a remote employee, it's even more important to build those strong relationships with my peers and there is a true feeling of collaboration amongst this ever expanding team. So far, so good! Cons The pace is incredible, just like the product. Not so much of a 'Con' but you have to dive right in and look to get up to speed as quickly as possible. Advice to Management As the company continues to grow, be sure to maintain that 'family' feel .. difficult across so many different countries and cultures but a companies values are so important to its' success. Keep doing what you're doing!", "rating": 5, "pros": "Great onboarding experience during my first week with Sprinklr. Met so many people and everyone was friendly and approachable. There really is the 'all in it together' feeling and that everyone is aiming for the same goal - delighted customers. As a remote employee, it's even more important to build those strong relationships with my peers and there is a true feeling of collaboration amongst this ever expanding team. So far, so good!", "cons": "The pace is incredible, just like the product. Not so much of a 'Con' but you have to dive right in and look to get up to speed as quickly as possible.", "advice": "As the company continues to grow, be sure to maintain that 'family' feel .. difficult across so many different countries and cultures but a companies values are so important to its' success. Keep doing what you're doing!"}, {"title": "Powerful technology, speaks for itself", "text": "Pros - Powerful technology - Easy solution to sell, the power of it spoke for itself - Hard working group, friendly - Benefits and perks - Casual dress code - Dog friendly - great starter job Cons - vision changes frequently and lack of proper direction - over ambitious goals and targets - there are some big egos and can be cut throat - can be a negative environment at times - long hours Advice to Management Listen to your employees and take the exit interview feedback seriously.", "rating": 3, "pros": "- Powerful technology", "cons": "- vision changes frequently and lack of proper direction", "advice": "Listen to your employees and take the exit interview feedback seriously."}, {"title": "Excellent Start", "text": "Pros It is rare to find a group of employees who are so passionate about being at work. Very refreshing. Extremely friendly but real with it, and genuinely believe in the work we are doing. Cons None so far, but all the free food will no doubt play havoc with my fitness plan.", "rating": 5, "pros": "It is rare to find a group of employees who are so passionate about being at work. Very refreshing.", "cons": "None so far, but all the free food will no doubt play havoc with my fitness plan.", "advice": null}, {"title": "Great company", "text": "Pros Great company with nice values and culture. The CEO is amazing. It's very easy to meet him and talk to him. Cons You need to be a self starter: this can be hard at the beginning.", "rating": 5, "pros": "Great company with nice values and culture. The CEO is amazing. It's very easy to meet him and talk to him.", "cons": "You need to be a self starter: this can be hard at the beginning.", "advice": null}, {"title": "Good place to start", "text": "Pros a very good place to start for people who want to learn and are into Information technology and computer science. Cons Nothing as yet. FIve words Advice to Management Keep the new recruits in the loop. Keep them involved with the company culture and make them feel like a part of the family!", "rating": 5, "pros": "a very good place to start for people who want to learn and are into Information technology and computer science.", "cons": "Nothing as yet. FIve words", "advice": "Keep the new recruits in the loop. Keep them involved with the company culture and make them feel like a part of the family!"}, {"title": "Sprinklr Senior Associate Moderation services", "text": "Pros Sprinklr is one of the best place to work. The Sprinklrite’s are excited and contributing well to reach the goal of Sprinklr, Moreover we all have a vision to take this company to the great heights. Sprinklr is one of the fastest growing company and I am very proud that I am a part of this family. All the leads in Sprinklr are showing the way to learn better and they are scrutinizing every employee to reach great heights. As a Sprinklrite I enjoyed every moment and its been three years of my career and looking forward to be more challenging. Every Sprinklrites brings something or other to the table and it will mould Sprinklr in a better way. Everyday we learn something new. I am fascinated for the opportunity and journey of my Sprinklr and it will be ongoing till the end. Cons Only thing is we work on every national holidays but Sprinklr does not make us to work, Its the nature of job which clients requires. We always pitch in whenever clients requires us thats the servicing part no can beat Sprinklr. Spirit of Sprinklr is its Core Values. Advice to Management Keep rocking and we will support you till end.", "rating": 5, "pros": "Sprinklr is one of the best place to work. The Sprinklrite’s are excited and contributing well to reach the goal of Sprinklr, Moreover we all have a vision to take this company to the great heights. Sprinklr is one of the fastest growing company and I am very proud that I am a part of this family. All the leads in Sprinklr are showing the way to learn better and they are scrutinizing every employee to reach great heights. As a Sprinklrite I enjoyed every moment and its been three years of my career and looking forward to be more challenging. Every Sprinklrites brings something or other to the table and it will mould Sprinklr in a better way. Everyday we learn something new.", "cons": "Only thing is we work on every national holidays but Sprinklr does not make us to work, Its the nature of job which clients requires. We always pitch in whenever clients requires us thats the servicing part no can beat Sprinklr. Spirit of Sprinklr is its Core Values.", "advice": "Keep rocking and we will support you till end."}, {"title": "good workplace and a good launchpad for career", "text": "Pros people with good energy and enthusiasm have scope to grow quickly good environment to learn and enhance the skill-set timings are flexible having mostly flat-hierarchy, you have access to almost every1 Cons work-life balance takes a toll", "rating": 5, "pros": "people with good energy and enthusiasm have scope to grow quickly", "cons": "work-life balance takes a toll", "advice": null}, {"title": "Sprinklr awesome to work", "text": "Pros Everything is so good . Awesome environment to work for. pay is good . Sprinklr is a family .Once you experience sprinklr its very hard to go somewhere else an join as an employee. Cons Nothing as such . I seriously could not find any cons till date . Advice to Management Awesome management .", "rating": 5, "pros": "Everything is so good . Awesome environment to work for. pay is good . Sprinklr is a family .Once you experience sprinklr its very hard to go somewhere else an join as an employee.", "cons": "Nothing as such . I seriously could not find any cons till date .", "advice": "Awesome management ."}, {"title": "One of the best places to work for", "text": "Pros I specially wanted to write this review seeing all the bad ones already given. If you notice the ones which marks Sprinklr as bad company to work for, all of them complains about the extra work. I really feel sorry for those people. You are paid to work, in fact the salary given by Sprinklr is probably way above the normal standards. So, you better be ready to take up the challenge. Coming back to pros. I can't say about other teams, so i will limit myself to my team: IT Operations. One amazing place to be. Learning curve just sky rockets. What I learned in my 2 and half years there is way more what I had ever learned. You always get to work on the cutting edge technology. People actually listen and care as much as possible. Once I asked for a shower in office and trust me when I say this, I myself never expected it. But turns out the offices premises needed to be redesigned, so during the redisgn a bathroom with a shower was provided. and now think how many other employers will be willing to do that. Forget actually doing it. Its simply incredible. Your work gets appreciated. I can't tell how many times my team members have got something for performing well ( not things like a greeting card or something cheap. Things like 15000 rs coupon or something as costly ). I myself got an iPod nano, a nike fuel band and few other coupons. Considering all these, I dare you to complain about little extra work. As I was part of operations team, our team didn't get to go for frequent team outings, but office parties totally made up for it. Pizzas, Cupcakes, rolls, biryanis used to be usual things. Free lunch. and reimbursement for dinner for support team. Flexible hours. Only expectation was to finish the task under appropriate time period. How you do it / From where you do it, no one cared. But yeah, regular status updates were a strict thing. lots of things in office premises for recreation. I don't even want to list them. You start guessing what would be appropriately called recreation for work environment, and it would be there. In fact more. The company is growing in leaps and bounds. and not just the business, company as a brand is taking on the world head on. So a good time to be a part of it. Cons well, glassdoor will not let me complete it if I don't write anything here. so here are something which I think will come under cons: Very bad location of old office in bangalore. Very high traffic in office hours. and I totally hated Sprinklr for it. But that hate was only till my commute between office and house. That office is about to change now (Jul 2015), so not sure if this problem still exists. at times the work pressure gets to you. which is more of a personal thing i feel. But as I said before, considering the overall picture, I dare you to complain. Advice to Management take a bit of control in terms of everything related to employee. I mean how an employee is performing, if not then why he/she is not. If they have some specific complains. Probably the word is proactive. I feel management doesn't pitch in until its too late. For everything else, its perfect the way it is.", "rating": 5, "pros": "I specially wanted to write this review seeing all the bad ones already given. If you notice the ones which marks Sprinklr as bad company to work for, all of them complains about the extra work. I really feel sorry for those people. You are paid to work, in fact the salary given by Sprinklr is probably way above the normal standards. So, you better be ready to take up the challenge.", "cons": "well, glassdoor will not let me complete it if I don't write anything here. so here are something which I think will come under cons:", "advice": "take a bit of control in terms of everything related to employee. I mean how an employee is performing, if not then why he/she is not. If they have some specific complains. Probably the word is proactive. I feel management doesn't pitch in until its too late. For everything else, its perfect the way it is."}, {"title": "By far the most inspiring place to be", "text": "Pros Based on my experience - - Very inspiring place to be. Team is focussed and the work is challenging yet exciting - Pro-activeness and hard work is appreciated and rewarded - Work is highly dynamic and it requires one to consistently update themselves - The atmosphere be it fun or work is highly infectious - The culture is by far the best I have experienced Cons I have not experienced any serious down side. Work-Life balance yes may sometimes get affected but considering the challenging work and roles, you sort of get swept into it. Advice to Management Keep up the awesome work! The best is yet to come! :)", "rating": 5, "pros": "Based on my experience -", "cons": "I have not experienced any serious down side. Work-Life balance yes may sometimes get affected but considering the challenging work and roles, you sort of get swept into it.", "advice": "Keep up the awesome work! The best is yet to come! :)"}, {"title": "Don't join this company if you are looking for knowledge and your career in long run in QA", "text": "Pros financially company is good and product is also good. 1.Free beer and snacks 2.If you are working on Saturday and Sunday you will get pizza and good food. 3.They will give parties in a month 3.The more you are chat on Skype more appreciation you will get. 4.Development team is very good in Gurgaon 5.Directly Interaction with CEO and COO. 6.Good salary. Cons 1.No appreciation for work even if you are working 7 days it is directly prop to your Skype availability status. All your hard work goes in vain 2.No manager. 3.People work more but no smart work. 4.No job security they can ask you to leave any time. 5.Zero decision making capability of higher authority in QA. 6. Your work credit will be taken by others 7.No good quality of training provided to QA.they play around only with UI and they have people with very less intellect .QA does not have the knowledge of code flow they just know the simple UI 8. No QA life cycle life is followed 9.Nothing new to learn in QA.Here learning means just learning UI 10.if you are working here you will get good salary but in the long run it will impact your career badly because after some time you will realize that you have learnt nothing 11.In other compaines QA means Manual+Automation+Unit Testing but here QA means only manual testing , you will get bored just clicking , clicking 12.Lastly if you are starting your career i will recommend you please do not join this company. Go for knowledge , not for money Advice to Management They should hire a manager and should follow protocols", "rating": 1, "pros": "financially company is good and product is also good.", "cons": "1.No appreciation for work even if you are working 7 days it is directly prop to your Skype availability status. All your hard work goes in vain", "advice": "They should hire a manager and should follow protocols"}, {"title": "Stop torturing Employees", "text": "Pros They pay well but whats the use. when they start interfering in your personal life,and no national or public holiday need to work on Weekends horrible, we need to file a case on the company valeting labor laws. Cons They treat you like a slave,you will feel like you are in a jail away from your personal life they do not value employees. they only need money biggest mistake of my life joining sprinklr , no growth no learning you have to do is Help desk work which can be done by 10 std student. i pit people working in Sprinklr, guys come out of sprinklr you will not how to work what is achievement,Growth.... Advice to Management Take notice before more people start leaving 10 off us left the company together such a shame sprinklr pathetic company Change your atittudeplease treat people well. Give value to the person if he/she has talent. if you can not respect talented person then please do not hire them. Dont interrupt in people's personal life give them space too.", "rating": 1, "pros": "They pay well but whats the use. when they start interfering in your personal life,and no national or public holiday need to work on Weekends horrible, we need to file a case on the company valeting labor laws.", "cons": "They treat you like a slave,you will feel like you are in a jail away from your personal life they do not value employees. they only need money biggest mistake of my life joining sprinklr , no growth no learning you have to do is Help desk work which can be done by 10 std student. i pit people working in Sprinklr, guys come out of sprinklr you will not how to work what is achievement,Growth....", "advice": "Take notice before more people start leaving 10 off us left the company together such a shame sprinklr pathetic company Change your atittudeplease treat people well. Give value to the person if he/she has talent."}, {"title": "QA Test Engineer", "text": "Pros I joined Sprinklr as an Intern for 6 months. When I first joined the company I was very hesitant as I had no experience, but I was eager to learn and Sprinklr provided me the best platform to learn. It was a true learning experience , I learnt something new each day at work. The work environment at Sprinklr is unlike any other company. They make weekends fun to work. A lot of opportunity to grow and discover yourself at Sprinklr. Cons For some, work life balance could be an issue. As a Startup company still establishing itself in the market, We have regular weekend releases, which require us to work over the weekends. It is a wonderful learning experience for all bachelors, but for some it may get a little hard to commit on the weekends, but gradually things are changing, and Sprinklr shall be one of the best companies to work for.", "rating": 5, "pros": "I joined Sprinklr as an Intern for 6 months. When I first joined the company I was very hesitant as I had no experience, but I was eager to learn and Sprinklr provided me the best platform to learn. It was a true learning experience , I learnt something new each day at work. The work environment at Sprinklr is unlike any other company. They make weekends fun to work. A lot of opportunity to grow and discover yourself at Sprinklr.", "cons": "For some, work life balance could be an issue. As a Startup company still establishing itself in the market, We have regular weekend releases, which require us to work over the weekends. It is a wonderful learning experience for all bachelors, but for some it may get a little hard to commit on the weekends, but gradually things are changing, and Sprinklr shall be one of the best companies to work for.", "advice": null}, {"title": "A Dream Company to work for", "text": "Pros At Sprinklr, every assignment presents a new chance for me to develop creative solutions to the real-world problems - and to gain invaluable, versatile skills. I am glad to be a part of a team that thousands of knowledge workers from Fortune 500 companies, use everyday to create and manage their social media content. Apart from gaining domain knowledge, I am exposed to working in a innovative yet very time bound culture. Our work is fueling the growth of many industries and making people’s life simpler. Sprinklr has a very open and dedicated team of smart people who have the hunger to solve the biggest challenges and do it faster than anyone else. I am obliged to work with such great leaders and learn from the depth of their knowledge. Apart from flexible working hours, we are also pampered with goodies and awe-inspiring trips. Sprinklr is the dream company I always wanted to work for. Cons At Sprinklr, development happens with the speed of light. So sometimes you tend to wear yourself to a shadow. But in the end the experience really pays off.", "rating": 5, "pros": "At Sprinklr, every assignment presents a new chance for me to develop creative solutions to the real-world problems - and to gain invaluable, versatile skills.", "cons": "At Sprinklr, development happens with the speed of light. So sometimes you tend to wear yourself to a shadow. But in the end the experience really pays off.", "advice": null}, {"title": "Review for Sprinklr Solutions Pvt. Ltd.", "text": "Pros Working at Sprinklr makes for a great experience because of the people working here - who are not only excellent developers, but also enthusiastic teachers and learners at the same time. Not only this, the workplace offers comfort and warmth, whether in terms of the physicality of the office, or the encouragement of the leaders and colleagues alike. There are lots of rewards, perks and pampering for good performance. The work hours are extremely flexible, as long as you get the work done, your work-life balance can be completely governed by you. Not only this, Sprinklr provides the most encouragement and morale to work for the good of the company, which is why I have only met people who are extremely passionate about what they do. Regardless of what you do at Sprinklr, if you work well and with ethics, there is no way you won't be noticed and appropriately rewarded. Sprinklr is definitely a exceptional place to work at. Cons Although this isn't really a con, there are a lot of expectations to keep learning and growing while you work here. So definitely not a company for lazy minds.", "rating": 5, "pros": "Working at Sprinklr makes for a great experience because of the people working here - who are not only excellent developers, but also enthusiastic teachers and learners at the same time. Not only this, the workplace offers comfort and warmth, whether in terms of the physicality of the office, or the encouragement of the leaders and colleagues alike. There are lots of rewards, perks and pampering for good performance.", "cons": "Although this isn't really a con, there are a lot of expectations to keep learning and growing while you work here. So definitely not a company for lazy minds.", "advice": null}, {"title": "#dreamjob", "text": "Pros Fantastic company to work for. Perks big and small include; - collaborative workforce with genuinely nice people who are passionate about what they do (inflated egos are not welcome) - work is value-add and has measurable impact - unlimited holidays - casual dress code - flexible work environment (work anywhere in the world at any time that is convenient to you, dependant on business needs) - monthly in office;          * manicures          * massages          * haircuts - unlimited free food (kitchen quality, not pre-packaged garbage) - did I mention how incredible the people are? Every day I go home thinking \"I have won the job lottery\". It is so nice not to work in fear- fear of being late, fear of being yelled at, fear of not being trusted. The management team behind this business puts real value on their human capital and openly talks about wanting Sprinklr to be a great place to work and genuinely meaning it. I could go on for paragraphs about how much I love the company but in summary, it is a place you want to work, and work hard for, because it is a Company that is pioneering its field, understands truly flexible work/life balance, and genuinely, passionately cares about every single person in the business. Cons This is not a con, but it is an explanation of what some may \"perceive\" as a con. Sprinklr is a late stage start up so it inherently has challenges that larger, more established organisations do not have - clearly defined process, onsite training in Europe, etc. However, the business is working on those things and this is 100% what you can expect to see in a business at this stage. You need to be self-motivated and a visionary in your role. Unless you are joining as an intern or entry level, there will be no hand holding, You will define your own tasks and priorities based on business need. Your manager will support you but they will not dictate everything you need to do. Again, these are not cons in my eyes, these are PROS but to each their own! Advice to Management Keep treating us as adults and caring about our happiness. Your current approach to how you treat your employees is inspiring and it is why I tell everyone I know (and don't!) that Sprinklr is the best company in the world in terms of product, leadership and progressive thought. Keep it up - but also improve your maternity and paternity policy. This is out of touch with reality.", "rating": 5, "pros": "Fantastic company to work for. Perks big and small include;", "cons": "This is not a con, but it is an explanation of what some may \"perceive\" as a con.", "advice": "Keep treating us as adults and caring about our happiness. Your current approach to how you treat your employees is inspiring and it is why I tell everyone I know (and don't!) that Sprinklr is the best company in the world in terms of product, leadership and progressive thought."}, {"title": "Compulsory Glassdoor Review", "text": "Pros Nice Working Environment Good Impact work Cons Not that I know as of now.", "rating": 5, "pros": "Nice Working Environment", "cons": "Not that I know as of now.", "advice": null}, {"title": "Company who thinks the employees are Robats verst company to work", "text": "Pros They have big brand what's the use all the employees including managers do help desk job they don't need experience people house wife's or PUC pass do such work Cons They provide good food that's all other wise they treat you like a slave, I do not recommend people to join Sprinkr.... If u r PUC pass it's a good job for u, not for experienced people graduates....verst company to work for ..... :( Advice to Management HR should know kind of people to hire for such a job they don't need experience people here..... Thank God I got freedom from that job", "rating": 1, "pros": "They have big brand what's the use all the employees including managers do help desk job they don't need experience people house wife's or PUC pass do such work", "cons": "They provide good food that's all other wise they treat you like a slave, I do not recommend people to join Sprinkr.... If u r PUC pass it's a good job for u, not for experienced people graduates....verst company to work for ..... :(", "advice": "HR should know kind of people to hire for such a job they don't need experience people here..... Thank God I got freedom from that job"}, {"title": "Life Changing - No Exaggeration!", "text": "Pros Walking into the office, you get a sense that everyone is actually happy and enjoys what they do. The office is a fun environment to be in where everyone passionately, genuinely cares about their work, their colleagues, the company! The leadership team is so inspiring; they love the company and they genuinely want their employees to be happy. There are no corporate buzz words flying around with no meaning: everything they say, they believe and actually instill confidence in us as employees. There is a huge emphasis on making home/life balance as seamless as possible and this flexibility can't be ignored, this is one of the reasons Sprinklr has been life changing for me. If something personal comes up and I have to get to work later than usual, thats no problem, it's ok! If I need to leave early for whatever reason, it's ok! 'It's Ok' is a Sprinklr value and everyone lives by it! It's so refreshing to hear 'it's ok!' We've all worked in places where years in, we still don't remember the core values....at Sprinklr, every single employee will roll the values off their tongue, because we live by them on a daily basis, they are not just 'buzz' words. Joining Sprinklr has been a life changing experience and I'm so excited about being part of such an amazing set up! Cons Not the place for the faint hearted...this place moves at speed. If you need handholding, then this isn't the place for you. Sprinklrites are self starters and super dedicated and committed to Sprinklr!", "rating": 5, "pros": "Walking into the office, you get a sense that everyone is actually happy and enjoys what they do. The office is a fun environment to be in where everyone passionately, genuinely cares about their work, their colleagues, the company!", "cons": "Not the place for the faint hearted...this place moves at speed.", "advice": null}, {"title": "SDET", "text": "Pros Yes they can give you money. but they will take your complete social life.You will forget to laugh. Cons As the name of the company suggest Sprinklr.  i am telling you you will run out of your family, friends your world .every day you will feel like you are in jail. yes i agree to the fact if someone is paying you money you have to work but they want people to work 24*7. their system is too unstable.even they do not know what will break after every release. they are so dynamic they want to keep client happy but they do not care much about employes. If you are from IIT then seriously this place is not for you or if you landed on this place by mistake i am sure you will end your journey after few months. in this company people do not laugh. they come and go. no extra activity nothing , Advice to Management Change your atittudeplease treat people well. Give value to the person if he/she has talent. if you can not respect talented person then please do not hire them. Dont interrupt in people's personal life give them space too.", "rating": 3, "pros": "Yes they can give you money. but they will take your complete social life.You will forget to laugh.", "cons": "As the name of the company suggest Sprinklr.", "advice": "Change your atittudeplease treat people well. Give value to the person if he/she has talent."}, {"title": "Fast-paced, hard work but good fun with some great people", "text": "Pros Accessibility and approachability of all people in the company, regardless of seniority Full of intelligent, driven people Outstanding product Customer service levels Cons Company growing so fast there can be some major growth pains such as processes breaking and running out of space Advice to Management Work hard to maintain the vibrant culture as the company scales to enterprise level as many companies fail in this, particularly after IPO", "rating": 5, "pros": "Accessibility and approachability of all people in the company, regardless of seniority", "cons": "Company growing so fast there can be some major growth pains such as processes breaking and running out of space", "advice": "Work hard to maintain the vibrant culture as the company scales to enterprise level as many companies fail in this, particularly after IPO"}, {"title": "you will seek greatness", "text": "Pros Sprinklr is a place where everyone has opportunities, feels stimulated, empowered, encouraged to do stuff, to do well for customers, to feel good about ourselves, to be the best in the field and to improve each day. Living the values. A few examples, \"Never ever ever ever give up\", \"its ok\", \"truly genuinely care\". So pros? Everything. From the people (and by people I mean everyone from the intern to the President) who bring stuff to the table, want to excel and make everyone feel good, to the technology, the client base, the career opportunities, the food, the massages, soccer... pretty much everything. Don't take me wrong, this is not a place for everyone. Its a place for people who want to do their best and get amazing stuff done, well DONE! Cons The current office is getting small for such a light speed growth but we already have a moving date for a new one! Advice to Management Keep doing what you are doing. Carlos Dominguez joining was the best addition we could hope for.", "rating": 5, "pros": "Sprinklr is a place where everyone has opportunities, feels stimulated, empowered, encouraged to do stuff, to do well for customers, to feel good about ourselves, to be the best in the field and to improve each day.", "cons": "The current office is getting small for such a light speed growth but we already have a moving date for a new one!", "advice": "Keep doing what you are doing. Carlos Dominguez joining was the best addition we could hope for."}, {"title": "Regional Sales Manager", "text": "Pros Great Package, great Opportunity, great people, they are clever, passionate and driven, this creates a fantastic work culture that is infectious! The product stands out amongst its peers and is something the market wants, all this and Ive been here less than a month.If Work Cons Non so far, a start up but not really, infrastructure is in place and a great list of customers Advice to Management Carry on with what you are doing", "rating": 5, "pros": "Great Package, great Opportunity, great people, they are clever, passionate and driven, this creates a fantastic work culture that is infectious!", "cons": "Non so far, a start up but not really, infrastructure is in place and a great list of customers", "advice": "Carry on with what you are doing"}, {"title": "Thrilled to be part of such an amazing and exciting organization!", "text": "Pros Great experience from interview through to employment. Everyone is motivated and passionate about Sprinklr and genuinely strives to ensure customer success. Such a refreshing vibe. Cons We're growing so rapidly, it's hard to keep up with our offerings and who's who.", "rating": 5, "pros": "Great experience from interview through to employment. Everyone is motivated and passionate about Sprinklr and genuinely strives to ensure customer success. Such a refreshing vibe.", "cons": "We're growing so rapidly, it's hard to keep up with our offerings and who's who.", "advice": null}, {"title": "What Sprinklr offers", "text": "Pros All facilities. care. an environment where if you can let go of your worldly attachments, you can achieve anything. work life balance is difficult to achieve, but with the salary given, one cannot complain. Cons very difficult to get recognition for your work unless u go and brag of every small work you do. no career growth. mostly the credit for your work goes to other people. Advice to Management take notice before more people start leaving. you need to put in a process for proper work evaluation. otherwise its all just going down the drain.", "rating": 3, "pros": "All facilities. care. an environment where if you can let go of your worldly attachments, you can achieve anything. work life balance is difficult to achieve, but with the salary given, one cannot complain.", "cons": "very difficult to get recognition for your work unless u go and brag of every small work you do. no career growth. mostly the credit for your work goes to other people.", "advice": "take notice before more people start leaving. you need to put in a process for proper work evaluation. otherwise its all just going down the drain."}, {"title": "Best Facility, Big Salary based on the performance", "text": "Pros Best Facility(Any time food, Any time work) Good Work related to Social Media. Celebration now and then. Fitness training session. Company cares for you Cons Less workforce ( Expecting much increase in the workforce in the future ) hence More pressure. Advice to Management Do not keep Releases on Weekends. Good Training Must be provided.", "rating": 5, "pros": "Best Facility(Any time food, Any time work)", "cons": "Less workforce ( Expecting much increase in the workforce in the future ) hence More pressure.", "advice": "Do not keep Releases on Weekends."}, {"title": "QA", "text": "Pros It will give you all luxury but no time for urself.. to spend that money.. to sleep.. to breathe.. want to see hell join sprinklr Cons They will treat u like servants.. pathetic company .. can ask u to leave anytime for stupid reasons.. Advice to Management have a life..", "rating": 1, "pros": "It will give you all luxury but no time for urself.. to spend that money.. to sleep.. to breathe.. want to see hell join sprinklr", "cons": "They will treat u like servants.. pathetic company .. can ask u to leave anytime for stupid reasons..", "advice": "have a life.."}, {"title": "Nice company", "text": "Pros Will get lot to learn . Learning's will be exponential lottttttttttttttttttt off opportunities. Cons maybe sometimes u will feel alone... as people are more work oriented.", "rating": 5, "pros": "Will get lot to learn . Learning's will be exponential lottttttttttttttttttt off opportunities.", "cons": "maybe sometimes u will feel alone... as people are more work oriented.", "advice": null}, {"title": "Feel sorry... for those that can't get onboard!!!!", "text": "Pros This company has a product that provides real value to clients that people have heard of. Incredible opportunity to work with the biggest brands in the world. Aside from the product being awesome, the people elevate the experience even more. Hard working, creative and focused. If you're not up for a challenge, this company will not be a good fit. One should be all in and have an attitude of 'whatever it takes.' Sprinklr is a place for those that are willing and able to work hard, everyday. Product/people = A+. The culture is comfortable and forward thinking. Just outside of being a \"young company\" there is still plenty of opportunity to make an impact and be recognized for it. Additionally, the offices are dog friendly and snacks are provide!! Cons ..n/a.. (must add at least 5 words) Advice to Management Stay the course. Continue to push teams to want to change the world. Reinforce client delight. Enjoy the ride. #believeitis", "rating": 5, "pros": "This company has a product that provides real value to clients that people have heard of. Incredible opportunity to work with the biggest brands in the world. Aside from the product being awesome, the people elevate the experience even more. Hard working, creative and focused. If you're not up for a challenge, this company will not be a good fit. One should be all in and have an attitude of 'whatever it takes.' Sprinklr is a place for those that are willing and able to work hard, everyday. Product/people = A+. The culture is comfortable and forward thinking. Just outside of being a \"young company\" there is still plenty of opportunity to make an impact and be recognized for it. Additionally, the offices are dog friendly and snacks are provide!!", "cons": "..n/a..", "advice": "Stay the course. Continue to push teams to want to change the world. Reinforce client delight. Enjoy the ride. #believeitis"}, {"title": "Great sales opportunity- explosive growth", "text": "Pros - Helping make the Sprinklr vision become reality- company is investing in the vision - Growing portfolio of significant capabilities to sell, that are meaningful for clients - Compensation plan aggressive - #1 rated platform and capabilities- not rated by us, but by our customers and analysts Cons Hyper growth means many priorities, and the need to continually assess where to invest time and resources is crucial. Not necessarily a con, but a reality Advice to Management - Please stay focused on the vision, and continue investing in the best people on the planet", "rating": 5, "pros": "- Helping make the Sprinklr vision become reality- company is investing in the vision", "cons": "Hyper growth means many priorities, and the need to continually assess where to invest time and resources is crucial. Not necessarily a con, but a reality", "advice": "- Please stay focused on the vision, and continue investing in the best people on the planet"}, {"title": "Awesome start-up to work for", "text": "Pros 1. Good salary 2. Very chilled out work environment 3. work from home facility 4. very flexible timings 5. flat heirarchy structure 6. good learning opportunities 7. good quality of work 8. free snacks 9. great recreation room 10. great people 11. great product Cons 1.nothing nothing nothing nothing 2.nothing nothing nothing nothing 3.nothing nothing nothing nothing nothing 4.nothing nothing nothing nothing nothing 5.nothing nothing nothing nothing nothing Advice to Management no advice. you're going great.", "rating": 5, "pros": "1. Good salary", "cons": "1.nothing nothing nothing nothing", "advice": "no advice. you're going great."}, {"title": "The Best Experience of Life", "text": "Pros 1. Working with awesomely smart people. 2. Super fast paced environment. 3. Hard Work pays 4. Recognition of your work 5. Free food and drinks Cons Lots of hard work but that does not matter when it pays. Advice to Management Go Go Go. Build a billion dollar company.", "rating": 5, "pros": "1. Working with awesomely smart people.", "cons": "Lots of hard work but that does not matter when it pays.", "advice": "Go Go Go. Build a billion dollar company."}, {"title": "worst place to work. no process, no career growth", "text": "Pros salary is good. gets new challenges every day Cons No process, company run by few sick mentally managers Advice to Management Please think for your employee", "rating": 1, "pros": "salary is good. gets new challenges every day", "cons": "No process, company run by few sick mentally managers", "advice": "Please think for your employee"}, {"title": "Sur la mauvaise pente", "text": "Pros Equipe locale brillante, avec qui des liens forts se créent et employés qui se soutiennent mutuellement. Possibilité de se construire une vraie \"seconde famille\". Salaire très intéressant. Croissance importante. Lieu de travail très agréable. Cons Une déshumanisation croissante imposée par une direction sans scrupule qui change d'orientation stratégique comme de chemise. Ne vous laissez pas berner par les discours de conquête à l'américaine et les salaires mirobolants : Sprinklr fera de vous un chiffre (en dollars si possible) et oubliera ce que vous êtes et ce que vous pouvez lui apporter. Il vous essorera jusqu'à la dernière goutte, et ne manifestera aucun respect pour votre vie privée. Si vous attendez un tant soit peu de bienveillance, d'accompagnement, ou que vos souhaits d'évolution professionnelle soient pris en compte, alors passez votre chemin. Advice to Management Arrêtez de prêcher vos sacro saintes valeurs et METTEZ-LES EN OEUVRE pour de bon ou tout le monde désertera.", "rating": 3, "pros": "Equipe locale brillante, avec qui des liens forts se créent et employés qui se soutiennent mutuellement. Possibilité de se construire une vraie \"seconde famille\".", "cons": "Une déshumanisation croissante imposée par une direction sans scrupule qui change d'orientation stratégique comme de chemise.", "advice": "Arrêtez de prêcher vos sacro saintes valeurs et METTEZ-LES EN OEUVRE pour de bon ou tout le monde désertera."}]