[{"title": "Cares about people", "text": "Pros With any growing company, there are always going to be growing pains - communication challenges, or new policies you may not like, for example - but Squarespace does a better job than any I have seen at navigating these challenges. It's clear that leadership is genuinely striving to create a positive workplace, and perhaps more importantly, that coworkers care about and respect each other. From monthly All Hands and CEO office hours, to \"Women at Squarespace\" speaker series and Friday happy hours, there's a living breathing community here. It's been really refreshing to work alongside people who try their best and bring their whole selves to work. Cons There's a disconnect between offices. Most people don't have the opportunity to work with others outside their home office, and with most departments centralized at HQ I can imagine folks in the other locations feeling less in the loop.", "rating": 5, "pros": "With any growing company, there are always going to be growing pains - communication challenges, or new policies you may not like, for example - but Squarespace does a better job than any I have seen at navigating these challenges. It's clear that leadership is genuinely striving to create a positive workplace, and perhaps more importantly, that coworkers care about and respect each other. From monthly All Hands and CEO office hours, to \"Women at Squarespace\" speaker series and Friday happy hours, there's a living breathing community here. It's been really refreshing to work alongside people who try their best and bring their whole selves to work.", "cons": "There's a disconnect between offices. Most people don't have the opportunity to work with others outside their home office, and with most departments centralized at HQ I can imagine folks in the other locations feeling less in the loop.", "advice": null}, {"title": "People Team", "text": "Pros -Free lunch & snacks daily -Dog Friendly office NYC -Growth potential -Company philosophy Cons There could be more interactions across various teams Advice to Management Keep growing the way you are and continue to be smart about it", "rating": 5, "pros": "-Free lunch & snacks daily", "cons": "There could be more interactions across various teams", "advice": "Keep growing the way you are and continue to be smart about it"}, {"title": "Amazing Experience", "text": "Pros - catered lunch every day - dog friendly office - Amazing people, friendly atmosphere - the benefits are incredible! Cons The environment can feel slightly clicky, but some teams do a better job than others at reaching outside of their comfort zone", "rating": 5, "pros": "- catered lunch every day", "cons": "The environment can feel slightly clicky, but some teams do a better job than others at reaching outside of their comfort zone", "advice": null}, {"title": "What an employer should strive to be", "text": "Pros - Work/life balance - Impactful work - Ownership or projects - Autonomy Cons - Keep working on adjust communications to the larger teams/org Advice to Management - Ensure you have a plan to grow people. I can see it but want to see it continue to grow.", "rating": 5, "pros": "- Work/life balance", "cons": "- Keep working on adjust communications to the larger teams/org", "advice": "- Ensure you have a plan to grow people. I can see it but want to see it continue to grow."}, {"title": "Great Experience So Far", "text": "Pros -Incredible/Inclusive Benefits -Beautiful office space -Solid on-boarding process -Feels more grown-up than any tech company I've worked for. People take their work seriously yet know how to have fun and be human with each other. -Creative and collaborative -Innovation comes from all levels -Strong product with a strong future, using new technologies. Product roadmap is thoughtful and exciting -Financially [more than] stable with great growth opportunities, both for the company and for the individual Cons -Going through a period of change, as any company does when going from small start-up to mid-sized, established company. Good news is that the company is investing in things like Diversity & Inclusion, Learning&Development, Experience, and Employer Branding to help scale the right way. Advice to Management Continue to be transparent, invest in culture, and focus on manager development and training.", "rating": 5, "pros": "-Incredible/Inclusive Benefits", "cons": "-Going through a period of change, as any company does when going from small start-up to mid-sized, established company. Good news is that the company is investing in things like Diversity & Inclusion, Learning&Development, Experience, and Employer Branding to help scale the right way.", "advice": "Continue to be transparent, invest in culture, and focus on manager development and training."}, {"title": "FE interview", "text": "Pros It's really a good company. Cons um but everything is good.", "rating": 5, "pros": "It's really a good company.", "cons": "um but everything is good.", "advice": null}, {"title": "Real(!) Cutting-edge Work", "text": "Pros Data scientists on the Strategy team work on fascinating business problems, develop pretty cool machine learning models, and have real influence on decision making across the organization. As the data science and data engineering teams have grown, our ability to do interesting work has definitely expanded. Subteams (Business, Product, and Marketing do long-term \"consulting\" style projects as well as providing increasingly fine-grained metrics on business performance, customer experience, and marketing efficacy. Cons Data scientists on the Strategy team work on *Strategy*. There is a machine learning team for engineers who put machine learning models into production. It is possible to move between these two teams in theory, but these are different mandates.", "rating": 5, "pros": "Data scientists on the Strategy team work on fascinating business problems, develop pretty cool machine learning models, and have real influence on decision making across the organization. As the data science and data engineering teams have grown, our ability to do interesting work has definitely expanded. Subteams (Business, Product, and Marketing do long-term \"consulting\" style projects as well as providing increasingly fine-grained metrics on business performance, customer experience, and marketing efficacy.", "cons": "Data scientists on the Strategy team work on *Strategy*. There is a machine learning team for engineers who put machine learning models into production. It is possible to move between these two teams in theory, but these are different mandates.", "advice": null}, {"title": "Poor management of good business", "text": "Pros Benefits Daily lunch + snacks Good neighborhood Office space Cons Absentee, negligent, and incompetent management contributes to dysfunction and, in some cases, extreme toxicity. (Some managers are quick to pull rank and retaliate as their default form of leadership.) There should be a sign that reads \"Welcome to Slytherin.\" You've been warned. Advice to Management Start with teaching management about the value of emotional intelligence and inspiring people by leading through example. Good luck.", "rating": 1, "pros": "Benefits", "cons": "Absentee, negligent, and incompetent management contributes to dysfunction and, in some cases, extreme toxicity. (Some managers are quick to pull rank and retaliate as their default form of leadership.) There should be a sign that reads \"Welcome to Slytherin.\" You've been warned.", "advice": "Start with teaching management about the value of emotional intelligence and inspiring people by leading through example. Good luck."}, {"title": "Toxic", "text": "Pros Catered lunches, somewhat of a cool office. Cons Everything Else, no growth opportunities, bad management who do not know how to manage.", "rating": 1, "pros": "Catered lunches, somewhat of a cool office.", "cons": "Everything Else, no growth opportunities, bad management who do not know how to manage.", "advice": null}, {"title": "Great place to work", "text": "Pros Time to work through projects, ability to make mistakes Cons Not much to say here", "rating": 5, "pros": "Time to work through projects, ability to make mistakes", "cons": "Not much to say here", "advice": null}, {"title": "Come for the food, stay for the people.", "text": "Pros Great for recent grads or young people looking to build a resume. Great office perks, lunch and beer on tap. Work parties are amazing, and there is a general familial feel around the office. The product itself is really beautiful and easy to use. Very robust training materials, intended to set the adviser up for success. The people here are warm and caring, and generally the only reason people stay at this company for so long, myself included. Oh, and the benefits are amazing. Cons Poor management structure. Projects and teams are constantly switching ownership, making it difficult to get a straight answer. There is a lack of transparency on the hiring process as well as salary levels among employees of different tenure. There can be a general feeling of loyalty to the company above all else, including legitimate deputes. My largest qualm is the lack of advancement opportunities in the Portland office. There are many highly skilled and over qualified workers kept in menial customer service roles. Jobs become available internally very rarely, and are poorly communicated to employees. Often external hires are brought in and not trained adequately on the platform, creating a disconnect between management and their subordinates. There is very poor communication throughout the organization, with products being rolled out constantly without providing any information to advisers. There was often a strong feeling of shoulder tap promotions, particularly internally. Huge lack of racial diversity and acknowledgement of racial issues. Political discourse if often encouraged at work, creating a fraught work environment. Advice to Management Value individual contributors more openly. Make improving communication paths a priority. Compensate all employees fairly and transparently. Work harder to promote racial diversity and community outreach to a racially diverse population.", "rating": 3, "pros": "Great for recent grads or young people looking to build a resume. Great office perks, lunch and beer on tap. Work parties are amazing, and there is a general familial feel around the office. The product itself is really beautiful and easy to use. Very robust training materials, intended to set the adviser up for success. The people here are warm and caring, and generally the only reason people stay at this company for so long, myself included. Oh, and the benefits are amazing.", "cons": "Poor management structure. Projects and teams are constantly switching ownership, making it difficult to get a straight answer. There is a lack of transparency on the hiring process as well as salary levels among employees of different tenure. There can be a general feeling of loyalty to the company above all else, including legitimate deputes. My largest qualm is the lack of advancement opportunities in the Portland office. There are many highly skilled and over qualified workers kept in menial customer service roles. Jobs become available internally very rarely, and are poorly communicated to employees. Often external hires are brought in and not trained adequately on the platform, creating a disconnect between management and their subordinates. There is very poor communication throughout the organization, with products being rolled out constantly without providing any information to advisers. There was often a strong feeling of shoulder tap promotions, particularly internally. Huge lack of racial diversity and acknowledgement of racial issues. Political discourse if often encouraged at work, creating a fraught work environment.", "advice": "Value individual contributors more openly. Make improving communication paths a priority. Compensate all employees fairly and transparently. Work harder to promote racial diversity and community outreach to a racially diverse population."}, {"title": "Awesome", "text": "Pros Teams and co workers. Free lunch and snacks everyday and loads of fun events Cons Managerial upward growth limited but internal movements are available", "rating": 5, "pros": "Teams and co workers. Free lunch and snacks everyday and loads of fun events", "cons": "Managerial upward growth limited but internal movements are available", "advice": null}, {"title": "Customer Support Specialist", "text": "Pros > Great People, actually, AMAZING people > Intense and in-depth training on marketable skills > The health insurance is amazing > A lot of resume building opportunities > Great entry level job Cons > Very little room for growth and they know it, so they call everything you could possibly get paid more for, a resume builder. They don't expect you to over stay your welcome. > Low pay > Expectation to join the Squarespace cult, where free lunch and gushers means life is fabulous. > High stress work environment, where metrics are king > 0% salary increases are possible at yearly review Advice to Management You guys think no one can do better than working for you, and treat is as a privilege, and treat people like they're disposable. It seems like a bad move to put so much money into training and education, to just cut people loose when all they want is more opportunity.", "rating": 3, "pros": "> Great People, actually, AMAZING people", "cons": "> Very little room for growth and they know it, so they call everything you could possibly get paid more for, a resume builder. They don't expect you to over stay your welcome.", "advice": "You guys think no one can do better than working for you, and treat is as a privilege, and treat people like they're disposable. It seems like a bad move to put so much money into training and education, to just cut people loose when all they want is more opportunity."}, {"title": "Best Place that I've Worked!", "text": "Pros Amazing benefits including compensation, medical/dental benefits, amazing office space, free lunch/snacks, NYC rooftop and happy hours, employee experience (welcome lunch, team outings Great company culture with monthly company all hands to stay in the know of the rapid growth. Extremely smart people that are great to work with and motivated to do great work. Relaxed work environment where employees are highly valued and trusted. Cons There is no bonus structure as part of compensation at this time. Advice to Management Keep up the great work!", "rating": 5, "pros": "Amazing benefits including compensation, medical/dental benefits, amazing office space, free lunch/snacks, NYC rooftop and happy hours, employee experience (welcome lunch, team outings", "cons": "There is no bonus structure as part of compensation at this time.", "advice": "Keep up the great work!"}, {"title": "Awesome Culture!!", "text": "Pros Definitely the people. Everyone here is super friendly and helpful. Also love the free lunch, snacks, drinks and happy hours. Benefits are also pretty awesome. The office and rooftop are beautifulll. They put a lot of thought into design. It's definitely been the best company I've worked for in my career. Cons The company is rapidly growing, so things can change fairly quickly. Advice to Management N/A", "rating": 5, "pros": "Definitely the people. Everyone here is super friendly and helpful. Also love the free lunch, snacks, drinks and happy hours. Benefits are also pretty awesome. The office and rooftop are beautifulll. They put a lot of thought into design. It's definitely been the best company I've worked for in my career.", "cons": "The company is rapidly growing, so things can change fairly quickly.", "advice": "N/A"}, {"title": "Past it's prime. No room for growth, terrible leadership. Not worth the bad pay", "text": "Pros - Free catered lunch every day. - Unlimited snacks in kitchen and bar has free drinks every day - People are terrific. If i could start a new company and hire everyone, I would. - Easy job (but it gets to be the same thing everyday) - I like the company values and connect with them, but it's hard to say if the company lives up to it. Cons Do not trust the People/HR team! They are gossippy and dont keep things confidential. I left because I went to them with an issue I had with my manager and they immediately turned and told my manager. The manager retaliated and made the environment toxic and I was forced to leave. Thanks for doing that. People can be very immature. The company is filled with whiney millennials who complain constantly about snack selection. Doritos are not organic, get over it. Random promotions that dont make any sense. For example, the executives were all promoted before the July review cycle before everyone else. The rest of the people get 3% adjustments or less and the execs get crazy fancy titles and more money. Great for morale. This is a place that rewards engineers constantly and the engineers can do no wrong. In Cust Ops, people have no opportunity for career advancement and the pay is terrible. But if you're an engineer, you can be sexist and say & do whatever you want and you will never be fired. If you're an engineer, this is a great place to work. For everyone else, good luck. Advice to Management Your competitors are beating you. When was the last time you launched a product? How do you have all these so called amazing engineers and still not launch anything? It's embarrassing that wix and shopify are beating you. But no one wants to say anything because you dont want to upset the engineers who are doing the amazing work. This is for the executives. You are in your ivory towers and you don't even bother learning the names of the people who are on the front lines working with customers every day. I never heard not once an executive say hi to me when i was passing by. Sets a a really bad tone for the company and made me not respect them.", "rating": 1, "pros": "- Free catered lunch every day.", "cons": "Do not trust the People/HR team! They are gossippy and dont keep things confidential. I left because I went to them with an issue I had with my manager and they immediately turned and told my manager. The manager retaliated and made the environment toxic and I was forced to leave. Thanks for doing that.", "advice": "Your competitors are beating you. When was the last time you launched a product? How do you have all these so called amazing engineers and still not launch anything? It's embarrassing that wix and shopify are beating you. But no one wants to say anything because you dont want to upset the engineers who are doing the amazing work."}, {"title": "Customer Support Advisor", "text": "Pros Very nice product Very good training focused on quality Nice people Fast pace company Cons Shifts times Lack of flexibility Evolution in the company is limited (Dublin)", "rating": 5, "pros": "Very nice product", "cons": "Shifts times", "advice": null}, {"title": "Customer Care Advisor", "text": "Pros + Open, caring and accepting environment for LGBTQI+ folks + Active in community outreach + Fair compensation for field and locale + Great benefits (medical, dental, vision, onsite meals) + Wonderful people Cons + The company is getting bigger quickly, which is great for learning and opportunities, but also has the general growing pains that accompany that (communication, sometimes feeling lost in the shuffle, etc). That being said, they work hard to address these. Advice to Management Make sure to pay attention to the folks that aren't loud or extremely social. They may not feel comfortable bolstering their image for promotion purposes, but work hard behind the scenes.", "rating": 5, "pros": "+ Open, caring and accepting environment for LGBTQI+ folks", "cons": "+ The company is getting bigger quickly, which is great for learning and opportunities, but also has the general growing pains that accompany that (communication, sometimes feeling lost in the shuffle, etc). That being said, they work hard to address these.", "advice": "Make sure to pay attention to the folks that aren't loud or extremely social. They may not feel comfortable bolstering their image for promotion purposes, but work hard behind the scenes."}, {"title": "Overall not a bad place for an entry-level tech position", "text": "Pros Great benefits, friendly people and peers, typical tech company perks like catered lunch and stocked snacks. I feel that I'm genuinely considered as a human and my feelings are taken into account. Cons Trivial metrics that are constantly inaccurate or being re-calculated, one year comp review cycle, lack of communication and documentation on processes, lack of opportunity or growth as an Advisor. Advice to Management You try taking chats all day and see how it feels.", "rating": 3, "pros": "Great benefits, friendly people and peers, typical tech company perks like catered lunch and stocked snacks. I feel that I'm genuinely considered as a human and my feelings are taken into account.", "cons": "Trivial metrics that are constantly inaccurate or being re-calculated, one year comp review cycle, lack of communication and documentation on processes, lack of opportunity or growth as an Advisor.", "advice": "You try taking chats all day and see how it feels."}, {"title": "Great People, Great Company", "text": "Pros Free lunch saves you so much money. The people are fantastic. The company works really hard to hire employees that are so awesome to work with. They value your opinion and will make sure you are listened to. The healthcare is great. Cons Burn out is very possible and can happen quickly. Training on the platform isn't thorough enough in terms of how much there is to know, a lot of on the job learning that can be very stressful. Advice to Management More transparency and more notice when rolling out certain new products and protocols.", "rating": 5, "pros": "Free lunch saves you so much money. The people are fantastic. The company works really hard to hire employees that are so awesome to work with. They value your opinion and will make sure you are listened to. The healthcare is great.", "cons": "Burn out is very possible and can happen quickly. Training on the platform isn't thorough enough in terms of how much there is to know, a lot of on the job learning that can be very stressful.", "advice": "More transparency and more notice when rolling out certain new products and protocols."}, {"title": "Quality Control Specialist", "text": "Pros The culture at Squarespace is fun and friendly. The benefits are fantastic and the company as a whole puts their employees first. Cons There's a quick turnover due to the lack of growth once becoming a Customer Operations Advisor.", "rating": 5, "pros": "The culture at Squarespace is fun and friendly. The benefits are fantastic and the company as a whole puts their employees first.", "cons": "There's a quick turnover due to the lack of growth once becoming a Customer Operations Advisor.", "advice": null}, {"title": "Uncaring Managers and Crazy High Workload Expectations.", "text": "Pros Decent salary for post-retail work, though most perks are written into your salary package so it sounds like you’ll earn more when signing on. Catered lunch, though very unhealthy, it’s also written into your salary package even if you don’t partake in it. 100% paid for health/dental insurance, except that is also written into your salary package. Near transit, easy to get to the office. They don’t provide a bus/train pass though. Because other companies don’t provide it… except other companies absolutely do. Nice computers to work on/Equipment is up to date Pretty awesome coworkers, extremely talented folks in Customer Ops Work from home policy was nice (though, it was slowly being scaled back at the office I worked at.) CMS is easily implemented, easy to design with, though they tend to make changes that don’t make sense to the customer nor designer working within it. Cons No time to learn new initiatives nor time to really get a good idea of the product if something new is added. Everything is dropped on customer service agents at the last possible moment (like an hour before public deploy, so they don’t have time to understand what exactly will be expected of them.) At times the new initiatives when deployed break the platform or cause other issues. It doesn’t seem like they tested these deployments thoroughly before making them public. As a customer service agent, you’ll need to grow a thick skin due to developers inability to take constructive feedback, answer customer complaints, and constant need to stroke their ego. Be prepared to say “I’m sorry, Squarespace doesn’t do that” frequently. Feature requests up the chain do absolutely no good. They aren’t read nor ever acted upon, they are merely a way to placate the customer. They are also summarily ignored like quickly dissipating smoke. When we did get trained on new initiatives or updates to the platform, it was conducted by people who never touched the product/platform, nor understood what or how it worked in actuality. Dedicated trainers would even provide unfocused and incorrect information to new hires. In the past, training was conducted by working peers who would pass on their tried and true knowledge before pushing new hires out into the queue. This was a better way to learn, learn from those who are actually doing the job versus those who never touch the product/platform day to day. No career growth, nor any opportunity to advance your career. Want to be a web designer or software engineer or grow into one of those roles? Better look elsewhere. Especially if you land a job in Dublin or Portland. The odds are only slightly better if you are in NYC, but even still, they don’t grow their employees at all. They rarely look at internal talent when looking to fill managerial, technical, and design roles. It has been said that the job you interview for will be the same one you’ll have 2+ years down the road. Executives absolutely know that the churn and burn rate is also 2 years per customer service agent as well. So don’t expect to be mentored or recommended for promotions, you probably won’t be there long enough to see any. Want to know why there are always “classes” of newly hired people? It’s because the seasoned folks who have reached burnout and have no outlet have left and they need to fill in the empty space. They could absolutely leverage their office locations and provide really fantastic places to work, like in Dublin. In Dublin, they could be the main European hub and provide support in native languages, not just English due to the availability of agents with multilingual backgrounds. In Portland, which is known for being a design and developer hub, they could provide not only template development, but tiered support and possibly even charge for in-house design and development. High stress without a way to alleviate that stress. The customer service floors are chaotic where team leads and supervisors have nerf dart gunfights over the heads of customer service agents trying to do their 5 chats an hour. It’s loud, distracting, and you’d better take advantage of the good headphones they offer you, you’ll need them to cut out the noise. You are expected to take 2+ chats simultaneously and keep them at around 15 minutes long. Taking on an issue for a customer that lasts longer will affect your closely monitored metric (you can be written up if you deviate and only take say 4 chats per hour. The metric doesn’t care if those chats are difficult to work through or require thought beyond billing questions.) Not only this, but they will micromanage you to death on just about everything. Want to work in the quiet rooms? They’ll ask why you don’t want to sit with your team. Interested in learning more about how JSON-T regioning works? They’ll ask why when developer mode isn’t supported by nor necessary for you to do your (customer service) job. Interested in applying for or wanting to do the summer internship in NYC? Why, aren’t you happy doing customer service, I hope you don’t want to leave *my* team. Want to ask your coworkers playing games around you if they’d quiet down? You’ll be seen as negative and not a team player. At every turn, they will attempt to placate and gaslight you and make you feel like you aren’t deserving of any advancement nor respect. Workload. Here I’ll talk about the office and role I worked. It probably comes as no surprise, I was a customer service agent. As a customer service agent, you were expected to take consecutive and simultaneous chats during the day. The total came about to 5 per hour. Doesn’t seem like a lot written out, but let’s play a small game. You take your 1st chat immediately after logging into the chat software. (Better make sure you have your coffee right then and there, you won’t be getting up anytime soon.) Then the second one follows immediately after. If you miss it and the one after that, the system automatically logs you as “inactive” which will be marked down. Too many of these and your team lead will talk to you about timeliness in your next biweekly 1 on 1. As you take your chats, they are also expected to be about 10 - 15 minutes in length maximum. Going over this time and you’ll be talked to about time management and cheerfully closing out your chats faster. It takes absolutely no consideration on the type of chat you are in nor if the customer is totally confused. You know what else this scenario doesn’t take into account? The human need to stretch, use the facilities, have lunch, or refresh themselves in between chats with customers. Now multiply all this by 39. Thirty-nine hours per week that you will be taking on chats. They give you maybe one hour a week to learn something new. The one nice thing is that you do have the ability to transition a particularly tough chat to email to follow up, but usually the customer dictates when that happens, not you. The constant go-go-go of the metric and nature of the work is extremely tough to get through day after day after day. Even motivated people with a high work ethic have trouble with this constant after a couple months. I could venture a guess that this is why Squarespace tends to hire ex-Apple employees on the regular. But even they struggle with this workload after a couple months. Remember how I mentioned the catered lunches? Good luck making it down to grab a plate while in chats. Lunch was delivered around 11am and just about everyone will scramble to get a plate and get back to their desk in time to grab another chat before their scheduled lunch time. Team Leads and Supervisors would saunter down to grab a plate without a worry in the world. Agents would have to strategize and figure out the best way to get a plate while still scheduled in chats. Some wouldn’t make it down at all and miss out on food, as a result having to make a quick lunch using available snacks and hustle back to their desk. (There was even a menu about how to make things using available ingredients in the snack cupboard if you missed lunch. Seriously.) MANY agents ate their lunch while still working regardless of when their actual lunch was scheduled. Burnout. <— This is a bad word at Squarespace. If you merely mention that you are starting to feel burnt out due to the workload, quite a few things will begin to happen. Your team lead will begin to be skeptical about your “devotion to the brand and the customers.” A target will be placed on your back. Any and all concerns that you have had up to this point will be seen as negative. Any and all constructive feedback provided by others or by your team lead will come back to bite you. They will try to find ways to undermine your abilities and won’t look to you for understanding or possible causation. You’ll basically be tossed aside, your thoughts, experiences, and concerns placated until you decide to leave or they figure out a legal way to get rid of you. As a company, they will try to downplay the possibility that the workload causes burnout. Ask an executive (like the head of Customer Ops) about how they are handling this problem and they will sidestep the issue like a slick politician. The moonlighting policy is extremely biased. Say you feel like you’ve learned a lot on the job and you’d love to start creating sites for clients on the side. You know, so you can learn the product and make some side cash, because they aren’t really allowing viable training time to learn new templates or the new initiatives. Not so fast, you will have to submit that to the legal team for approval. What if you’re in school and are learning code or need to gain real world experience for a grade? What if you are in a business that is suddenly doing well? You’ll have to submit all that to legal to ensure there is no conflict of interest. I understand that is an important part of a business to make sure there is discretion and no one is stealing customers, but the rules seem rather draconian in application. Do you want a normal 9-5 after the craziness that is shift work (at a retail store?) Better look elsewhere, your schedule is not your own and at the whim of “needs of the business”. Guess what, it’s shift work. It’s seriously not better than your old retail position and the hours are longer and potentially more varied. The Portland office is especially susceptible to a varied schedule. You could be scheduled up to 11pm or midnight in some cases. Want to have a better balance between work and your life? You’re better off at Starbucks or Apple where they at least close by 8pm. Think you got out of working on Saturdays and Sundays? Nope, you’ll do at least one weekend a month. So that splitting up of a weekend midweek is still something you’ll have to contend with. What about that “unlimited” vacation though, aren’t you able to take a vacation when you need to? Um, no. That wonderful unicorn that is unlimited vacation is pretty limited and monitored. You get about 2 weeks per year, it doesn’t accrue (so they don’t have to pay you out if/when you leave), and is completely dependent upon how many people are already off from your team and office. The average for each office is around 2 people can be off at any specific time period. Fortunately, if you’re sick or need a personal day (just one), you’re ok. If you’re sick, you could work from home. If you do submit time off for a vacation, better do it way far in advance and be sure to bring it up in conversation with your team lead frequently, they may attempt to gaslight you or “forget” about your request and you’ll have to seek refunds for those plane tickets. Ineffectual HR. They ask current employees throughout the year to submit reviews on Glassdoor, LinkedIn, and other sites to puff themselves up and make them look awesome from the outside. So while there may be a lot of “Innovative Place to Work” or “Best Job Ever” reviews, the more lengthy and detailed ones saying “Meh” or “You Risk your Mental Health Working Here” are ones to pay attention to and there is definitely truth within those. Granted, HR is there to ensure that the company’s values are adhered to which is normal for any company. But when they attempt to mask the problems, flat out refuse to sign a diversity pledge, or place blame on employees for harassment, how can you seriously feel ok going to them if you have troubles while on the job. Not only that, but going to them with a grievance may put a target on your back due to the perception of your “negativity.” Overall toxic environment. While I understand a lot of what I experienced as an employee gave me insight in a small and very specific scope, seeing things happen to my fellow coworkers made me feel helpless and stuck in what amounts to a dead-end job. There is so much cronyism and bro-culture at the office I worked, it was difficult to get through the day sometimes. There were a lot of back-patting promotions that occurred during my tenure there, even after it was formalized with interviews for said positions. There were also demotions and firings for nothing more than speaking your mind. If you are outspoken and raise concerns about how you or others are treated, a target will be placed on your back. You’ll be seen as negative and they will be very skeptical of you moving forward, so much so they may make you feel like nothing is going to change and it’s your fault. They will also begin to try to break you down. This is the culture of Squarespace. I was hired when there was a fun, startup mentality. We all had each other’s back and there was camaraderie and excitement in what we were doing and the goals we were working towards. Fast forward to now, the culture is toxic and paranoid as I’ve illustrated in the paragraphs above. But it doesn’t even scratch the surface. Some people have had to go into therapy because of the mistreatment they received at the hands of management and executives. Moving out of retail, Squarespace seemed to be a logical step towards getting into web design, with it’s slick templates/themes, hipster-cool employees, and museum quality downtown offices. Don’t be fooled by their slick presentations and misleading promises to you during hiring. They will wave these in front of your face and hope you won’t follow up if extended a hiring letter. These promises will quickly evaporate and you’ll be stuck in a job that isn’t better than the retail job you left or the call center job you didn’t sign up for. Once the “Kool-Aid” wears off and you see what it’s really like, you will feel like you wasted your time. Advice to Management I know you won’t listen to this review. Though I wish you would. If you do end up listening to what I have to say, I’ll leave with this: take a hard look at what you are doing and creating in the cities where Squarespace has offices. You pride yourselves on having a good reputation as being a great place to work, sadly your reputation is taking quite a beating not only in Portland, but also in Dublin and NYC. You still have time to fix this though. Take Squarespace back to when the core values meant something (all the way back in 2013). Definitely don’t stonewall your employees if things are less than “awesome” and they have concerns that they vocalize to you. Anthony, you need to pay attention to what is happening in Customer Ops and especially what’s happening in the Portland and Dublin offices. People are not happy and not staying. Your best and brightest are leaving for anything they can get their hands on. Some have even gone back to retail. The huge reason employees leave a company isn’t necessarily the company itself, they leave managers and supervisors first and foremost. Second only to the huge workload and high expectations you are placing upon your employees. I’d agree that the push towards quantity over quality is not sustainable and you are going to continue to burn out batches of intelligent and motivated people because of this. They are basically giving up their lives for your product and your company, it would be wonderful to offer them something worthy, valuable, and your utmost respect in return.", "rating": 3, "pros": "Decent salary for post-retail work, though most perks are written into your salary package so it sounds like you’ll earn more when signing on.", "cons": "No time to learn new initiatives nor time to really get a good idea of the product if something new is added. Everything is dropped on customer service agents at the last possible moment (like an hour before public deploy, so they don’t have time to understand what exactly will be expected of them.) At times the new initiatives when deployed break the platform or cause other issues. It doesn’t seem like they tested these deployments thoroughly before making them public. As a customer service agent, you’ll need to grow a thick skin due to developers inability to take constructive feedback, answer customer complaints, and constant need to stroke their ego. Be prepared to say “I’m sorry, Squarespace doesn’t do that” frequently. Feature requests up the chain do absolutely no good. They aren’t read nor ever acted upon, they are merely a way to placate the customer. They are also summarily ignored like quickly dissipating smoke.", "advice": "I know you won’t listen to this review. Though I wish you would. If you do end up listening to what I have to say, I’ll leave with this: take a hard look at what you are doing and creating in the cities where Squarespace has offices. You pride yourselves on having a good reputation as being a great place to work, sadly your reputation is taking quite a beating not only in Portland, but also in Dublin and NYC. You still have time to fix this though. Take Squarespace back to when the core values meant something (all the way back in 2013). Definitely don’t stonewall your employees if things are less than “awesome” and they have concerns that they vocalize to you."}, {"title": "Great!", "text": "Pros Great atmosphere, very nice ppl. Cons Hard to climb up the ladder.", "rating": 5, "pros": "Great atmosphere, very nice ppl.", "cons": "Hard to climb up the ladder.", "advice": null}, {"title": "No room for growth", "text": "Pros benefits are competitive and robust in comparison to the industry. Cons HR team is biased and unresponsive. Advice to Management If it wasn't for knowing someone at the company, i would never have been interviewed. Recruiting team is leaving behind qualified candidates who are never spoken to. This is creating a bad impression of the organization.", "rating": 1, "pros": "benefits are competitive and robust in comparison to the industry.", "cons": "HR team is biased and unresponsive.", "advice": "If it wasn't for knowing someone at"}, {"title": "Past the tipping point", "text": "Pros Luxurious office space, fantastic benefits, free food, lots of wonderful and smart people. Cons Squarespace likes to push the notion that they care. Do not be fooled by the fancy benefits, fancy office spaces, and HR presentations. While these perks are quite nice and worth a good amount of money, they are in place to attract talent and because its where the industry bar has been set. Some of what I'm about to say is relevant only to the department in which I worked and does not necessarily apply to the company as a whole. However, some of it does. The spirit of collaboration is dead here. While autonomy can be nice in that there is no micromanaging - you are simply trusted to just do a good job - the reality is that Its largely every person for themselves. If you want to learn anything and grow \"you gotta steal it.\" (as stated repeatedly by upper management.) Opportunity and advancement seems somewhat arbitrary – with some people working for over a year at levels well above their title or what they were being paid for and others being hired or promoted for positions in which they had close to zero experience (including positions in management.) Obviously this is not across the board, but when it comes to hiring management, one bad decision can (and did) cause significant inertia in critical areas where the company shouldn't have been falling behind. Equally as arbitrary is how they choose to deal with sexual harassment. (Not implied, subtle undermining, mind you, but blatant, public, verifiable acts.) Over the course of a few years there were a handful of firings for this kind of misconduct, but there were also exceptions that involved a mere slap on the wrist. The distinction was seemingly based on whether the employe had established their value to the company as a worker. That is - if you're talented, hard working and generally good at your job, you're more likely to get away with it. And some have. Like other prominent tech companies, there seems to be a bit of wiggle room in the so called Zero Tolerance Harassment Policy. If the recent TechCrunch article is any indication, (\"Uber is Not the Only Company That Mishandles Sexual Harassment Claims\") Squarespace has proven that it is sadly on par with the tech industry in this respect. After one such public allegation, HR did a lengthy presentation addressing issues of diversity and harassment in which it reiterated its policies and stated that they are a \"safe place\" for any employee to come and speak honestly. However, the truth is that they are there to protect the interests of the company first and foremost. This became clear when on each of the two times I brought up my discomfort about an employee who had not been dismissed after publicly harassing a colleague, my concerns were received with something between well maneuvered neutrality and politically necessary indifference. That said, Squarespace is not altogether a bad place. When I started, the true spirit of a start up was still intact; It was clear that the people there were driven by the desire to innovate and do their best work – a genuinely exciting and fulfilling environment to be in. It could be said that it has merely encountered the common tipping point in the growth curve where principles take a back seat to politics and integrity rapidly degrades. If you go into it with this in mind, you'll be fine. However, this was not a transition I could abide. Advice to Management Get back to the principles that made you a success.", "rating": 3, "pros": "Luxurious office space, fantastic benefits, free food, lots of wonderful and smart people.", "cons": "Squarespace likes to push the notion that they care. Do not be fooled by the fancy benefits, fancy office spaces, and HR presentations. While these perks are quite nice and worth a good amount of money, they are in place to attract talent and because its where the industry bar has been set.", "advice": "Get back to the principles that made you a success."}, {"title": "Came for the free lunch, left with a career", "text": "Pros I can't say enough good things about my time at Squarespace. Typical tech perks aside, it is an absolutely fantastic place to work, where hard work and dedication is rewarded with opportunities to pursue what you're passionate about. I gave the company 110% and in turn was always well taken care of, especially in times of need. I came to Squarespace with no career prospects, and I'm leaving with skills and knowledge that will sustain me for the rest of my working life. The Recruiting Team does a phenomenal job hiring not only top talent, but truly the best *people* - there is not a single person in the company that I wouldn't go have a beer with after work. I've made friendships that have endured and will continue to long after I'm gone. Cons I honestly don't have any.", "rating": 5, "pros": "I can't say enough good things about my time at Squarespace.", "cons": "I honestly don't have any.", "advice": null}, {"title": "I thought I was joining an innovator in the tech industry but I ended up in a call center.", "text": "Pros Above-average pay for customer service/call center work. This would be a good job right out of college, or possibly as a transition between nametag-customer-service and working in an office environment. The pros are definitely in place to dull the drudgery of menial customer service work. You could do a lot worse. If you're any further in your career and think working for a tech company may be beneficial to your development, please see below. Cons I applied for work here when the Portland office was opening, lured by the promise of getting in on the ground floor of a new office for a growing company. However, this office is a complete dead end, as Squarespace's customer care is run like another, separate company within the company. There's no room to move up. New positions within customer care are few and far between, and most management positions are given to outside hires. A title and role change doesn't mean a pay raise, and since customer care is constantly reshuffling and restructuring, what used to be your own separate role will suddenly become something baked into everyone else's job. When I began, for example, the transition from email to live chat came with a pay raise, and only if you elected to pursue it. Now it's been shuffled in as a standard responsibility for everyone in customer care. Sadly, I was moved to live chat during that shuffling, so my job completely changed under me and I saw no compensation. I would not have elected to do live chat if given the choice, but unfortunately I was the last person with any opinion on my career at Squarespace. Pay raises are nominal, infrequent, and matched by incoming employees' base salaries, leaving tenured, hardworking employees with nothing to show for their efforts and time. It's clear management is ill-equipped to support the needs of their employees; they don't share the workload and are mainly there to babysit you and feed you the company line. When you've spent an hour taking abuse from an irate winery owner who's unable to log into their account because they've had their caps lock on the whole time, it can be quite lousy to have to sit down with your supervisor and be told how you could've possibly ended the interaction sooner, or how you could've been more cheerful in your responses. The moment you stop drinking the Kool-Aid, things go downhill fast. Advocate for yourself and you'll just put a target on your back. Often the benefits are thrown back in your face; on multiple occasions, mentions of unfair treatment or untenable changes were met with a reminder that we get free lunch or \"unlimited\" PTO. I've heard stories as well as seen firsthand people have their place in the company threatened for asking inconvenient (but valid) questions in \"ask me anything\"-style meetings. Many would call this retaliation. Customer Care is the first point of contact for customers, and the furthest away from any actionable change. You'll tire of hearing the same basic shortcomings of the platform and fielding suggestions that cannot possibly be implemented. You'll soon tire of submitting feature requests or bug fixes, as you know most of them fall on deaf ears. There's an utter lack of ongoing product training after onboarding, and as the platform and internal policies are eternally shifting, you can ask three people the same question and get three answers that were right at one point or another. Features and integrations are constantly implemented and live tested without warning. Sometimes you'll be informed of a change through a backdated email, or when a customer reaches out with an issue about said change, leaving you scrambling for an answer on the fly. This leads to an aggressive in-house apathy where advisors just try to push emails and chats through as fast as possible without actually *solving* the problems customers present. Management doesn't keep promises and benefits are slowly being scaled back. Open communication is mainly lip service; management will say \"we're looking into it\" when a valid issue is brought up and then never readdresses the issue. Often you're told to come up with a project to solve an issue that's beyond your authority to address. Other times, you'll be asked for \"actionable feedback,\" which is another way of shrugging off staff concerns and gaslighting you into thinking nothing's going to change, and that it's your own fault things haven't. Most of the perks are in place a) because that's where the tech-world bar's been set and b) to maintain the company's image. There's a reason the office is smack-dab in the middle of downtown Portland; Squarespace wants to be seen as cool and vital, even though they're just running a call center. The hip, sleek office is actually quite sterile and unfriendly, especially as we were discouraged from hanging anything on walls. There's an eerie paranoia surrounding allowing visitors or the general public to see what it looks like inside. The \"open\" office environment means no privacy or personal space. Team Leads and advisors who aren't yet in chat make distracting levels of noise, leaving you feeling like a curmudgeon for having to focus on your concurrent chats. Personal space isn't respected, and often you'll come in to find your chair readjusted or straight-up missing, and personal items on your desk broken or missing. Some of this you can turn a blind eye to and possibly abide a lot earlier in your career. However, it'll wear you down sooner rather than later, especially chat, where KPIs are unrealistic, as has been admitted by management (but of course, nothing's been done about it). Based on the direction things had been taking in the two years I'd worked there, it's only bound to get worse. Advice to Management I'm not sure there's much I can say that won't go unheard. I've spoken up about these concerns as your employee and your actions have spoken volumes about your lack of interest in anything other than the Bottom Line. Talented, innovative people are jumping ship for really anything else they can get their hands on. Maybe the next batch of hires won't notice the problems as you stabilize, but I doubt it, as I still hear stories about constant shuffles and restructuring. To the CEO: I know everyone's telling you everything's going So Great over in PDX, and maybe you got that impression from the hour of photo op time you spent here on your last visit, but the pivot in focus from quality to quantity will only hurt your company's customer service.", "rating": 3, "pros": "Above-average pay for customer service/call center work. This would be a good job right out of college, or possibly as a transition between nametag-customer-service and working in an office environment. The pros are definitely in place to dull the drudgery of menial customer service work. You could do a lot worse.", "cons": "I applied for work here when the Portland office was opening, lured by the promise of getting in on the ground floor of a new office for a growing company. However, this office is a complete dead end, as Squarespace's customer care is run like another, separate company within the company. There's no room to move up. New positions within customer care are few and far between, and most management positions are given to outside hires. A title and role change doesn't mean a pay raise, and since customer care is constantly reshuffling and restructuring, what used to be your own separate role will suddenly become something baked into everyone else's job. When I began, for example, the transition from email to live chat came with a pay raise, and only if you elected to pursue it. Now it's been shuffled in as a standard responsibility for everyone in customer care. Sadly, I was moved to live chat during that shuffling, so my job completely changed under me and I saw no compensation. I would not have elected to do live chat if given the choice, but unfortunately I was the last person with any opinion on my career at Squarespace.", "advice": "I'm not sure there's much I can say that won't go unheard. I've spoken up about these concerns as your employee and your actions have spoken volumes about your lack of interest in anything other than the Bottom Line. Talented, innovative people are jumping ship for really anything else they can get their hands on. Maybe the next batch of hires won't notice the problems as you stabilize, but I doubt it, as I still hear stories about constant shuffles and restructuring."}, {"title": "Customer Care is an ill-managed call center with little to no growth.", "text": "Pros The biggest 'pro' is the name recognition, and it absolutely carries weight when applying for similar gigs in tech. Good step for those transitioning out of retail into office culture. Typical tech/startup company window dressing (free meals, snacks, etc.), but this is already the standard at most tech companies. I'm genuinely a fan of the product. Cons Other negative reviews here accurately reflect life in Customer Care in great depth, so just to echo similar points: - Management is self-serving and ill-equipped to do their jobs. Upwards feedback is deflected. Managers goof around with nerf fights and other distractions while agents are too busy. If you do provide valid and constructive feedback, be ready to be lectured on how grateful you should be that they provide free lunch and snacks. - Drink the office Kool-Aid if you want to get anywhere. I get it, every office has its politics, but Squarespace has it dialed up to 11. I've seen quality employees get overlooked in favor of company cheerleaders who spend more time playing ping-pong than working. - Little to no growth opportunities from entry-level CC positions. - No innovation in CC. Management doesn't care to hear it from agents. - For all intents and purposes, CC is separate from the rest of the company. Don't bother hoping to move elsewhere, or at the very least get an opportunity to learn from and to collaborate with members in other departments. Yes, some CC agents have been promoted to the mothership, but that was a long time ago and the org is just too big now. - Inadequate training, and when you are struggling, leadership throws you shade and makes you feel incompetent. It's a lot of the old guard spouting lines like \"well I didn't have this training when I started and I could do it so why can't you?\" - My role changed to one with added responsibility but without a pay raise. The thing is, I've had jobs I've liked way less. It's a better than retail as far as the day-to-day is concerned, but the Squarespace culture is just so toxic. Their presence on Crain's Best Places to Work is compelling, but keep in mind companies have to submit themselves to be eligible and acceptance is based on evaluations submitted by employees. A good chunk of Squarespace doesn't work in CC, so bear that in mind when factoring that into your decision to apply. Advice to Management I said my piece to management on multiple occasions and just get stonewalled. CEO needs to take more interest in the largest department in the org.", "rating": 3, "pros": "The biggest 'pro' is the name recognition, and it absolutely carries weight when applying for similar gigs in tech.", "cons": "Other negative reviews here accurately reflect life in Customer Care in great depth, so just to echo similar points:", "advice": "I said my piece to management on multiple occasions and just get stonewalled."}, {"title": "Amazingly creative people", "text": "Pros Company prides itself on excellency, regardless of the time it takes Cons Some decisions take too long Advice to Management Keep up leading by example!", "rating": 5, "pros": "Company prides itself on excellency, regardless of the time it takes", "cons": "Some decisions take too long", "advice": "Keep up leading by example!"}, {"title": "Lucky to work here", "text": "Pros I can't say enough positive things about working at Squarespace. Passionate and talented people, incredible work life balance, impactful product, meaningful mission and an emphasis on employees' well being. The beautiful office, free lunch, roof deck and dog policy don't hurt either! Cons Can't think of one con. Advice to Management Keep putting employees first and try to maintain our unique culture as we scale.", "rating": 5, "pros": "I can't say enough positive things about working at Squarespace. Passionate and talented people, incredible work life balance, impactful product, meaningful mission and an emphasis on employees' well being. The beautiful office, free lunch, roof deck and dog policy don't hurt either!", "cons": "Can't think of one con.", "advice": "Keep putting employees first and try to maintain our unique culture as we scale."}, {"title": "Amazing Company!", "text": "Pros Great food and perks! Enjoyed the office culture. Cons regular startup issues. Sometimes quick unexpected changes.", "rating": 5, "pros": "Great food and perks! Enjoyed the office culture.", "cons": "regular startup issues. Sometimes quick unexpected changes.", "advice": null}, {"title": "Meh.", "text": "Pros Amazing benefits (100% coverage) Beautiful offices Catered lunch / snacks Company outings Cons Upper management sees you as a number. Metrics are almost impossible to meet. A lot of the emphasis is on Live Chat, and if you're not hitting five an hour, then you just put a target on your back. Most of the times this is out of your control as the volume isn't there. In addition to this, there are a lot of customers that require more in depth assistance, yet management doesn't care. They want quantity over quality, in order to meet the needs of the business. We get countless compliments from customers regarding our service, which is true. The customer care department is one of the most dedicated teams I've worked with, but the sheer expectations of management will lead you to be overworked and burnt out very quickly. You're put into teams and assigned to a team lead, who just consistently micro manage you. You can't really blame them as this is all in the hands of upper management. If you're more of an independent worker, then this place isn't for you. Be prepared to get reprimanded if you're not meeting or exceeding your metrics. Everything is a competition. Recognition is great, but to boast about certain people exceeding expectations isn't encouraging at all, and it tends to make people feel worthless, and things like this often leads to favoritism. Also note that you will apologize to customers a countless number of times for features that the platform doesn't have because the product is severely lacking. I've learned of so many creative ways to say sorry to customers. The customer care team is incredibly huge, over 200 employees, which makes up the majority of the company. With that being said, there is zero room for growth. I've been with the company for three years, and never had the opportunity to show my true talents, even though you have the chance to contribute to other speciality teams, you're left to do the grunt work. I've literally been told that Squarespace may not be the place for me by one of my supervisors, and that I should consider another job because of this. Seriously. When I first started, this was a true start up and a very close, tight knit community. Forget about that now. No one speaks to each other, and overall the team is very \"clique-ey\" Products and changes will be released with little notice. On top of this, you don't really get to learn the product because you're answering chats and tickets all day. How are you expected to be productive and have a steady workflow when you know nothing about the product, or things are sprung on you last minute. Management has a BS open door policy. They urge you to bring up concerns and ideas. However, if those don't match to the opinions of management, then again, you just made yourself a target. I've learned that some of my colleagues have been terminated for speaking up about the rampant favoritism that goes on here. While the benefits are amazing, you're left to feel extremely over worked and under paid. All in all, if you're a compassionate, empathetic person, who truly wants to help people, and are seeking out growth then this isn't the place for you. Advice to Management Customer care makes up the majority of the company. While all departments are equally important, emphasis should be put on this team as it is the largest and the face of the company. Customers speak to advisors, not to engineers, marketing, or HR. Be realistic with your expectations, and get more involved. True leaders lead by example.", "rating": 3, "pros": "Amazing benefits (100% coverage)", "cons": "Upper management sees you as a number. Metrics are almost impossible to meet. A lot of the emphasis is on Live Chat, and if you're not hitting five an hour, then you just put a target on your back. Most of the times this is out of your control as the volume isn't there. In addition to this, there are a lot of customers that require more in depth assistance, yet management doesn't care. They want quantity over quality, in order to meet the needs of the business. We get countless compliments from customers regarding our service, which is true. The customer care department is one of the most dedicated teams I've worked with, but the sheer expectations of management will lead you to be overworked and burnt out very quickly.", "advice": "Customer care makes up the majority of the company. While all departments are equally important, emphasis should be put on this team as it is the largest and the face of the company. Customers speak to advisors, not to engineers, marketing, or HR. Be realistic with your expectations, and get more involved. True leaders lead by example."}, {"title": "Software Engineer", "text": "Pros Excellent Health Care Great offices Careful and thoughtful management - constantly looking for constructive feedback. Sense that company honestly cares about your work-life balance, wellbeing, happiness in your role, etc. They are happy to have you transfer to a different role if you want to. Work is challenging and varied Unlimited vacation - which people _actually_ take Steady business - they are almost always cash flow break even, so you know this company isn't just burning through VC money as fast as possible. Cons Sometimes work can be too difficult - not enough guidance or support. Since company is growing quickly, some of the organization structure doesn't make sense and there are a few gaps. For example not enough product managers, like in the CMS system. Small company with a very flat org structure, so it can be hard to get a 'promotion' on your resume (though you can grow a lot in other ways) Advice to Management Anthony (CEO) acknowledges that there are gaps in the product and its management, but they haven't been rectified. He's an engineer by training so I understand it's not particularly glamorous, but you have to fill those roles so that those systems don't fall apart / become not beautiful.", "rating": 5, "pros": "Excellent Health Care", "cons": "Sometimes work can be too difficult - not enough guidance or support.", "advice": "Anthony (CEO) acknowledges that there are gaps in the product and its management, but they haven't been rectified. He's an engineer by training so I understand it's not particularly glamorous, but you have to fill those roles so that those systems don't fall apart / become not beautiful."}, {"title": "Innovative and Inclusive Place to Work", "text": "Pros The people that you work with are some of the smartest in the industry. They're passionate and invested in the company, but everyone is also down to earth and focused on collaboration and diversity of ideas. The people you work here are a huge reason the company is so successful and why it's such an enjoyable place to work. The product is also top in it's field, so when you combine amazing talent with an incredible product, you get Squarespace. Of course, the free lunch every day, amazing benefits, and insane offices don't hurt either. Cons Customer Operations is draining work, and can get monotonous quickly. With how quickly the department has grown, some Cust. Ops people have been left in the dust -- if you have ambitions, you need to advocate for yourself and put yourself out there. However, the company does seem very aware of this and is making lots of efforts to move Cust. Ops employees into more specialized roles -- there's been a lot of improvement here.", "rating": 5, "pros": "The people that you work with are some of the smartest in the industry. They're passionate and invested in the company, but everyone is also down to earth and focused on collaboration and diversity of ideas. The people you work here are a huge reason the company is so successful and why it's such an enjoyable place to work. The product is also top in it's field, so when you combine amazing talent with an incredible product, you get Squarespace.", "cons": "Customer Operations is draining work, and can get monotonous quickly. With how quickly the department has grown, some Cust. Ops people have been left in the dust -- if you have ambitions, you need to advocate for yourself and put yourself out there. However, the company does seem very aware of this and is making lots of efforts to move Cust. Ops employees into more specialized roles -- there's been a lot of improvement here.", "advice": null}, {"title": "These fake reviews are a joke", "text": "Pros Not much other than a paycheck. Product used to be good. Nice office. The usual tech company benefits. Cons A lot. Terrible communication and transparency. Company has a pretty nasty culture of blame. Growth stalled and it's just a constant cycle of blaming the next guy, most recently forcing an executive out of the company for no good reason. Apparently they didn't get the memo that the company's problems are because the product and technology sucks (To be fair it's ok just stagnant and falling way behind). Also a lot of deadweight here. Good talent does not stay here long. There is absolutely no accountability here and too many yes men. Advice to Management If you spent as much time and energy improving your company as you did writing fake reviews maybe your numbers would start moving again.", "rating": 1, "pros": "Not much other than a paycheck. Product used to be good. Nice office. The usual tech company benefits.", "cons": "A lot. Terrible communication and transparency. Company has a pretty nasty culture of blame. Growth stalled and it's just a constant cycle of blaming the next guy, most recently forcing an executive out of the company for no good reason. Apparently they didn't get the memo that the company's problems are because the product and technology sucks (To be fair it's ok just stagnant and falling way behind). Also a lot of deadweight here. Good talent does not stay here long.", "advice": "If you spent as much time and energy improving your company as you did writing fake reviews maybe your numbers would start moving again."}, {"title": "A Stain on the Portland Tech Community", "text": "Pros The medical benefits are great, and there are catered lunches along with kitchens stocked with junk food. Hiring is also pretty spot-on, advisors a lot of mutual interests that make workplace conversations very entertaining. Cons Pretty much everything that has to do with the job itself. You're underpaid, held to arbitrary metrics that can change without notice, and despite claims to the contrary, your career won't go anywhere unless you manage to luck out. But don't expect that to happen to you. Once upon a time it was a pretty fun place to work at, and it even felt like a stereotypical tech company job that you see on TV where it had a fun and loose atmosphere. However the company started growing faster than it could support, in part thanks to the multi-million dollar advertising campaigns, and the area that suffered the most was the customer support end. But suddenly the focus shifted from email to live chat because this was allegedly the hot new thing for customer support trends. The smiles began to fade as the environment became more like a depressing computer farm, where many advisors were either struggling with their product knowledge (since you rarely receive any additional product training after you hire in, including updates/changes that you are never informed of because advisors are not important) or making creative apologies for the platform's numerous bugs or missing features. And when it comes time for your compensation review, don't count on much more than getting bumped up to the current pay that incoming advisors will get due to the cost of living increase. Your seniority and projects will play no part in your comp review despite possibly being mentioned as they go over your year, as the focus will only be on your live chat metrics. Also don't expect a Christmas bonus or any other kind of thank you for your year of hard work. Don't like it? Don't speak up about it, because all you're doing is putting a target on your back and sooner or later there will be an excuse to get rid of you. This is the work environment we're currently dealing with, and the amount of paranoia the managers currently have means that it's pretty likely that this whole house of cards will come down on itself in an ugly way. For a company that spends millions of dollars on advertising themselves as a \"creative\" and easy platform, they sure don't bother sharing any revenue with their employees who work significantly harder. Once you're in it's harder to get out because of the steady paycheck and benefits, so do yourself a favor and look elsewhere. Don't degrade yourself, don't apply to Squarespace. Advice to Management There's absolutely zero point in providing any advice, since you aren't going to listen anyway despite the \"open door\" policy. From what I've seen, everything that doesn't align with your opinion is considered non-constructive, and it's the excuse you use every time valid concerns are brought up by employees that you've forcefully exited from the company.", "rating": 3, "pros": "The medical benefits are great, and there are catered lunches along with kitchens stocked with junk food. Hiring is also pretty spot-on, advisors a lot of mutual interests that make workplace conversations very entertaining.", "cons": "Pretty much everything that has to do with the job itself. You're underpaid, held to arbitrary metrics that can change without notice, and despite claims to the contrary, your career won't go anywhere unless you manage to luck out. But don't expect that to happen to you.", "advice": "There's absolutely zero point in providing any advice, since you aren't going to listen anyway despite the \"open door\" policy. From what I've seen, everything that doesn't align with your opinion is considered non-constructive, and it's the excuse you use every time valid concerns are brought up by employees that you've forcefully exited from the company."}, {"title": "Great Stepping Stone to Other Jobs", "text": "Pros Fun coworkers, great annual events (parties, team outings), tons of snacks, beautiful office, amazing product. A good way to get into the tech community and move quickly onto something better. Benefits are truly amazing. Cons High burnout (for customer ops folks), unfocused goals & unrealistic expectations from management, inexperienced managers, no room to advance, constantly changing policies, poor inner department communication, little accommodation for employees with obligations outside of work (school, children, volunteering), culture of paranoia and need to pretend that everything is amazing all the time. Advice to Management Treat the cust ops positions as they are: tech support positions with high expectations on # of interactions employees take a day - not some great career. Higher strong, motivational managers WITH EXPERIENCE managing others. Focus on innovation, not \"catch up\" with competitors.", "rating": 5, "pros": "Fun coworkers, great annual events (parties, team outings), tons of snacks, beautiful office, amazing product. A good way to get into the tech community and move quickly onto something better. Benefits are truly amazing.", "cons": "High burnout (for customer ops folks), unfocused goals & unrealistic expectations from management, inexperienced managers, no room to advance, constantly changing policies, poor inner department communication, little accommodation for employees with obligations outside of work (school, children, volunteering), culture of paranoia and need to pretend that everything is amazing all the time.", "advice": "Treat the cust ops positions as they are: tech support positions with high expectations on # of interactions employees take a day - not some great career. Higher strong, motivational managers WITH EXPERIENCE managing others. Focus on innovation, not \"catch up\" with competitors."}, {"title": "Comfortable Job, Not Challenging", "text": "Pros The entire company is staffed with phenomenal people and the best part of this job was everything that happened when I wasn't in front of my computer in 2/3 chats. I loved lunch time, time spent at happy hours, and the events that Squarespace put on -- this was the best benefit you could ask for. The entire product and office is beautifully designed and a joy to be a part. If you are a fresh-eyed customer service minded recent college graduate or someone looking for some stability at a job that isn't overly challenging, Customer Operations is the place for you! Cons No tiered support, so the most seasoned support agents are still encountering the most mundane questions day in and day out. There is a missed opportunity for Squarespace to have the most successful customers treated with a higher level of attention from the best support agents. People get burnt out and feel disenfranchised about the state of their career progression in CustOps, and it's hard to be around sometimes, because in a sense it is true that it is hard to move up in the company, but that's kind of the nature of a large successful company. There are more qualified people coming into the company to work on the hardest problems and this forces some of the longer tenured employees to feel looked over. Advice to Management You got a tough job -- the company is big and CustOps does a great job day in and day out, but the people who perform that function will inevitably feel burnt out. Focus on being available and personable. Also, what the hell is going on in those off-sites that take place on site? Lots of graphs and quotes, and those donuts looked pretty good.", "rating": 5, "pros": "The entire company is staffed with phenomenal people and the best part of this job was everything that happened when I wasn't in front of my computer in 2/3 chats. I loved lunch time, time spent at happy hours, and the events that Squarespace put on -- this was the best benefit you could ask for.", "cons": "No tiered support, so the most seasoned support agents are still encountering the most mundane questions day in and day out. There is a missed opportunity for Squarespace to have the most successful customers treated with a higher level of attention from the best support agents.", "advice": "You got a tough job -- the company is big and CustOps does a great job day in and day out, but the people who perform that function will inevitably feel burnt out. Focus on being available and personable. Also, what the hell is going on in those off-sites that take place on site? Lots of graphs and quotes, and those donuts looked pretty good."}, {"title": "All about perspective", "text": "Pros The benefits at Squarespace are incredible. 100% health cost, 401k matching, free lunch, parties to celebrate achievement, weekly happy hour, relatively great culture (though it involves a high level of socialization, which may be harder for introverts), high caliber of creative, collaborative individuals. If you work hard, apply yourself and work towards the general improvement and growth of the office you will succeed. It is a great place to expand your skill set, become a really confident and skilled worker in a number of areas and become an expert in the area of your choosing organizing, commerce, writing, public speaking, design, scaling opps) Cons All locations, as many tech companies can and should, could stand to prioritize diversity in the work place and sourcing talent from a variety of pools. Squarespace is a leader in web design and should work be a leader in progressive, diverse hiring. Aside from that, there are a lot of entitled individuals who work at the Portland location -- it seems as though it is many people's first or second job right out of college. There are lot of opportunities for those who persistently apply themselves and make their interest and availability known. However, there are plenty of people who feel entitled to better positions and quicker growth because they believe and champion their intellect over others. There is a lack of humility which is very palpable. Advice to Management Set achievable expectations for employees and do not solicit every type of feedback (ie: compensation) if you realize it will not be actionable. The one misstep of the Portland office was setting the expectation that everyone would have an opportunity to fully grow/realize their career as the office grew, when in fact there are not infinite opportunities. Set the expectation that if you work hard, apply yourself, are innovative and for see fixes to challenges SQSP didn't know it had, you will have an opportunity to grow.", "rating": 5, "pros": "The benefits at Squarespace are incredible. 100% health cost, 401k matching, free lunch, parties to celebrate achievement, weekly happy hour, relatively great culture (though it involves a high level of socialization, which may be harder for introverts), high caliber of creative, collaborative individuals. If you work hard, apply yourself and work towards the general improvement and growth of the office you will succeed. It is a great place to expand your skill set, become a really confident and skilled worker in a number of areas and become an expert in the area of your choosing organizing, commerce, writing, public speaking, design, scaling opps)", "cons": "All locations, as many tech companies can and should, could stand to prioritize diversity in the work place and sourcing talent from a variety of pools. Squarespace is a leader in web design and should work be a leader in progressive, diverse hiring.", "advice": "Set achievable expectations for employees and do not solicit every type of feedback (ie: compensation) if you realize it will not be actionable. The one misstep of the Portland office was setting the expectation that everyone would have an opportunity to fully grow/realize their career as the office grew, when in fact there are not infinite opportunities. Set the expectation that if you work hard, apply yourself, are innovative and for see fixes to challenges SQSP didn't know it had, you will have an opportunity to grow."}, {"title": "A truly, awesome job!", "text": "Pros The community is second to none. You will feel very comfortable and right at home when you know you're working with the best there is. Cons Don't have much to say in terms of cons. Just keep pushing and excelling at your role. Advice to Management Keep up the great work!", "rating": 5, "pros": "The community is second to none. You will feel very comfortable and right at home when you know you're working with the best there is.", "cons": "Don't have much to say in terms of cons. Just keep pushing and excelling at your role.", "advice": "Keep up the great work!"}, {"title": "A disgrace to the PDX tech community", "text": "Pros - Health insurance premium paid 100% by Squarespace - Employer matches for 401k contributions - Catered lunch every weekday Cons Pretty much everything else about the job. It'll seem like a dream come true for the first 6 months with free lunch, but once you see how everything really is behind the fake happy front everyone puts up you'll be pretty miserable. Overall, the company acts fairly egotistical and doesn't seem to care much about customer feedback. Those bug reports you'll be filing and the feature requests you'll be submitting will most likely be ignored by engineering. You'll spend most of your days in three Live Chats at a time giving workarounds for features that should be there and making excuses for shortcomings in the product. In Portland, the company has zero presence in anything related to the local tech community. When some employees spoke up to management about this, they were given many excuses as to why this was the case all while painting Squarespace as still caring about contributing to the local tech community. There was also the topic of diversity brought up multiple times by different employees. Even though management says they care about diversity, I still see tons of caucasian hipster-like new hires in their 20s. Actions speak louder than words. You're expected to dedicate your entire life to working at Squarespace and if you want to do anything outside of work (including volunteering), you need to sign a form and get approval from legal. If you don't fill out the form and they find out...that's an offense that could get you terminated. The main downside to dedicating you entire life to Squarespace is the fact that there are no growth opportunities. Customer Care is so large that it is run as a separate company within the company, so there is little conversation and few ways to bridge into working in other departments. This also applies for individuals that have the skills to work in another department. The training team is out of touch with the product and teaches incorrect things, so you're essentially thrown into the queue unprepared and stressed out. All of this is happening while managers still gaslight you that there are opportunities and that you're just not working hard enough to prove that you deserve something more. Unless you have a stroke of luck, they'll most likely end up just shoulder tapping someone who plays the politics game better than you or hiring an external candidate. They expect people to go above and beyond, yet offer little incentive to do so. Even the salary is not very comparable given the rising rents in Portland. That is another thing that was brought up and ignored by management/HR. I've heard stories about people getting a promotion, yet never got a raise for that promotion until their comp review...which was months later. Overall it seems like a game to see how much more they can get you to do, without compensating you any more. If you don't like it...don't speak up. Management will put a target on your back and try to come up with any excuse as to why your argument is incorrect in an attempt to silence you by threatening your job. Once upon a time this was a great office environment, but now management/HR rules by making people afraid of losing their jobs. The open door policy is a joke. Overall, it's great for a first time job and resume builder since the outside community doesn't quite realize how awful this company is yet, but if you still decide to accept a job here don't expect anything more than another bullet of experience on your resume. Oh also free lunch too. Advice to Management My advice to Mr. Casalena. Please keep an eye on what's happening in your remote office. You made mistakes with VPs of Customer Care in the past, so please don't trust that things are being handled properly until a disgruntled ex employee writes another Medium post expose. When that happens, it's already too late. Take action now. My advice to the Customer Operations management: never push a loyal employee to the point where they no longer care. My advice to the PDX Customer Operations \"leadership\" team: people work for Squarespace because they really believe and care about the company. Please offer legitimate career pathing instead of making excuses as to how it's already here and also changing the topic by saying this is a great resume builder to go somewhere else.", "rating": 3, "pros": "- Health insurance premium paid 100% by Squarespace", "cons": "Pretty much everything else about the job. It'll seem like a dream come true for the first 6 months with free lunch, but once you see how everything really is behind the fake happy front everyone puts up you'll be pretty miserable.", "advice": "My advice to Mr. Casalena. Please keep an eye on what's happening in your remote office. You made mistakes with VPs of Customer Care in the past, so please don't trust that things are being handled properly until a disgruntled ex employee writes another Medium post expose. When that happens, it's already too late. Take action now."}, {"title": "One of the best companies I've worked for", "text": "Pros If you have a solution to problem, they'll listen to you, or at the very least give feedback. Cons I don't really have much in terms of cons. Typical start up nature that comes with it's downfalls.", "rating": 5, "pros": "If you have a solution to problem, they'll listen to you, or at the very least give feedback.", "cons": "I don't really have much in terms of cons. Typical start up nature that comes with it's downfalls.", "advice": null}, {"title": "Lost that Magic", "text": "Pros The product is amazing but the pace of development has slowed to the point where the competition has caught up. Squarespace was really special when it was growing but has floundered in the last year because the founder doesn't care about employees outside his most favorite product and design folks. New office is spectacular. Cons Favoritism is valued more than performance. The company is becoming soulless and corporate. Pace and energy are not very fast. Can't really point to new products recently that are redefining anything. Everything is just very comfortable. Advice to Management Give Anthony a number two who really cares about building a great company so Anthony can continue to only focus on the things he cares about like he always has.", "rating": 5, "pros": "The product is amazing but the pace of development has slowed to the point where the competition has caught up. Squarespace was really special when it was growing but has floundered in the last year because the founder doesn't care about employees outside his most favorite product and design folks. New office is spectacular.", "cons": "Favoritism is valued more than performance. The company is becoming soulless and corporate. Pace and energy are not very fast. Can't really point to new products recently that are redefining anything. Everything is just very comfortable.", "advice": "Give Anthony a number two who really cares about building a great company so Anthony can continue to only focus on the things he cares about like he always has."}, {"title": "Incredible place to work", "text": "Pros Amazing culture, intelligent employees and inspiring leadership. Cons I can't think of any cons. I'm honored to work here. Advice to Management Keep up the good work and maintain the transparency you've already established.", "rating": 5, "pros": "Amazing culture, intelligent employees and inspiring leadership.", "cons": "I can't think of any cons. I'm honored to work here.", "advice": "Keep up the good work and maintain the transparency you've already established."}, {"title": "Great place to work", "text": "Pros Talented team, awesome product, competitive compensation, cool office, tons of flexibility, and great benefits. The company is growing and growing with the right people. Cons Nothing to add here. Will edit in the future if this changes. Advice to Management Continue to focus on growing your people and building out a great product.", "rating": 5, "pros": "Talented team, awesome product, competitive compensation, cool office, tons of flexibility, and great benefits. The company is growing and growing with the right people.", "cons": "Nothing to add here. Will edit in the future if this changes.", "advice": "Continue to focus on growing your people and building out a great product."}, {"title": "Great place to work!", "text": "Pros Great benefits and tons of wonderful people to work with! Catered lunch every day, unlimited PTO, paid dental, vision and health insurance. Cons There is a divide where people that have been there for longer than 2 years are not feeling valued and do not feel that there is room for growth. As an entry level tech job, this place is perfect. The pay is below average, but the quality of life makes up for it. Advice to Management Keep up the good work and keep your team hungry and inspired!", "rating": 5, "pros": "Great benefits and tons of wonderful people to work with! Catered lunch every day, unlimited PTO, paid dental, vision and health insurance.", "cons": "There is a divide where people that have been there for longer than 2 years are not feeling valued and do not feel that there is room for growth. As an entry level tech job, this place is perfect. The pay is below average, but the quality of life makes up for it.", "advice": "Keep up the good work and keep your team hungry and inspired!"}, {"title": "Fun company, good product", "text": "Pros Good team. When I was there the COO rocked. The CEO is a sharp developer and I enjoyed getting a look into how his vision had evolved. Offices were nice. Technology was efficient and the company was focused on delivering. Cons I was working support there. Support is always a tough job. The company scaled quickly and support has to figure out how to keep up with that. One thing that happens to support as companies grow is that the support becomes less personal. I had to focus more on closing tickets quickly than I could on deeply solving something. Also, they Beta tested their new release on paying customers in my opinion. The latter two points didn't fit me well. ...also NYC in general sucks at work life balance. Advice to Management The Support lead was a sharp manager. I respected her. That job is tough. Well done.", "rating": 5, "pros": "Good team. When I was there the COO rocked. The CEO is a sharp developer and I enjoyed getting a look into how his vision had evolved. Offices were nice. Technology was efficient and the company was focused on delivering.", "cons": "I was working support there. Support is always a tough job. The company scaled quickly and support has to figure out how to keep up with that. One thing that happens to support as companies grow is that the support becomes less personal. I had to focus more on closing tickets quickly than I could on deeply solving something. Also, they Beta tested their new release on paying customers in my opinion. The latter two points didn't fit me well. ...also NYC in general sucks at work life balance.", "advice": "The Support lead was a sharp manager. I respected her. That job is tough. Well done."}, {"title": "Fantastic workplace!", "text": "Pros Squarespace in the PDX office is truly one of the best jobs I've ever had. The office is like a quirky family that care deeply for one another. Cons They do seem to hire some people that probably shouldn't be there after not quite working well with the team as a whole. Also, it's obvious that this is some of the team's first real job and they can get super spoiled. Don't complain about an amazing place! Advice to Management Keep up the good work. I love my job and enjoy coming to work every day. Maybe consider cutting loose some dead weight if the need arises.", "rating": 5, "pros": "Squarespace in the PDX office is truly one of the best jobs I've ever had. The office is like a quirky family that care deeply for one another.", "cons": "They do seem to hire some people that probably shouldn't be there after not quite working well with the team as a whole. Also, it's obvious that this is some of the team's first real job and they can get super spoiled. Don't complain about an amazing place!", "advice": "Keep up the good work. I love my job and enjoy coming to work every day. Maybe consider cutting loose some dead weight if the need arises."}, {"title": "Dealing with facts", "text": "Pros The platform. I will be the first person to say I firmly and staunchly support/believe in the product. It's a product that empowers and enables it's users to focus on their craft and to not sweat the minutia; like building out your online presence. The CEO, I'm a little torn on this one. Ultimately I'm a big fan of Anthony's, I think he has a built an incredibly successful product and has a passion for the business he's created. However why I default to a neutral opinion on him is this; the culture failure in Customer Operations as a whole and particularly PDX ultimately falls on him as the head of this company. Catered lunch Monday-Friday? (Just kidding, that's factored into your overall salary and monetized in your offer letter) Cons Unlimited PTO: Unlike traditional PTO accrual you have \"unlimited\" or the now phrased \"flexible\" PTO. Unlimited sounds like a solid deal until you examine the way Squarespace handles this benefit. Traditional PTO are hours you've earned and by most reasoning exist as your own actual income. With Unlimited PTO you have no accrual, hence no cash out if you leave the company, cap out on hours; not the biggest of gripes overall. The big clincher is the clause Squarespace provides with the PTO: *Within the needs of the business. This phrase is rather benign and does not raise any red flags immediately but be aware that your request for PTO is based off of a 1 person per team (13 or so people) per day, another restriction that takes precedent is an overall cap for the office, and as you may have guessed by now that cap is below 1 person per team. Finally your now \"flexible\" PTO is actually managed at around 2 weeks of PTO per year, congratulations on being as competitive with time as my first job bagging groceries. Summary: Unlimited PTO sounds great, but you won't likely be able to use it much. Career Opportunities: Here I will only be able to speak to Customer Operations in Portland, Oregon. It's pretty simple. You will likely never advance into another role aside from the one you're hired for. If you do, you won't get a raise until your next review cycle (once a year), this may or may not take into account your new role. That last statement probably sounds weird, well it's because it is. Squarespace has a \"solely performance\" based compensation structure. This means you will only ever be up for compensation review once a year, changing roles does not impact this. Almost forgot, compensation reviews have a possibility of a 0% increase, even for those far below a compensation cap. Summary: You likely will never advance if you work in the Portland, OR office (strictly Customer Operations), if you are one of the few, you will not be compensated for it; possibly for an entire 6-12 months. Senior Management: I'd love to protect my anonymity so I won't say a lot. Summary: Let's call it an area of opportunity Work/Life Balance: This one will likely be met with some immediate, \"But it's great right now!\". Squarespace has a goal of expanding Live Chat coverage to be 24/7. As with previous support structures such as email, Customer Operations in Portland will cover the hours of 8am-12pm PST. Be aware, you will work weekends and you will work late night shifts; maybe not now, but you will. Summary: This is a support center for a 24/7 support structure, your schedule is dictated by demand, end of story. Culture and Values: Apparently Squarespace scores a 4.4 out of 5 at the current juncture. Senior management will regularly encourage everyone to fill out Glassdoor reviews and surveys around high points of the year and while they enter various workplace popularity contests. Exit paperwork includes quite the legal talk about why you can't and shouldn't say anything negative about the company; I'm no mathematician but 4.4 makes a lot more sense now. The Way Things Were: This one will arguably sound very whine-y; I believe it's worth noting for a company that has grown more fiscally prosperous quarter over quarter. There are employees who joined this company during a time where annual boat cruises to celebrate with your team happened, holiday gifts were given, standing desks were provided for employees looking to avoid a completely sedentary work life. I do indeed know these are nice to haves and they were great, they were also monetized in your offer letter and a huge part of the culture and reasons you could feel invested in and valued. These things will likely continue to dissipate over as time goes on. Summary: As the company scales, these things will change. \"Scalability” is the name of the game. Don't be fooled. Squarespace Portland is not an innovative startup with a similar culture, it is a corporate support center. Quantity is #1 as the KPI to rule them all. Compensation: Entry level support positions pay roughly the same as some of the more established coffee shops and retail establishments in town. Summary: If you're a single debt free individual you may just be able to afford a studio in Portland city proper on entry level wage. Benefits: There is no public transit stipend, because according to Squarespace, no one offers this benefit; well other than every other tech company on the west coast, but I digress. No fitness reimbursement, so expect to run your butt off on your own dime after sitting in the same spot taking live chats for 9 hours a day, according to Squarespace no other tech companies offer this benefit as well, oh wait, except every other tech company on the west coast, but I digress. Your health, vision and dental is paid by Squarespace; vision is standard VSP, health and dental are the worst plans I have ever had. Be prepared to pay around $2,000 out of pocket for surgical procedures like tonsillectomies and wisdom tooth extractions with this coverage. Comparatively at my previous employer, both of these would have been covered at a 100% or an out of pocket expense of less than $200. Work from home can sometimes be an expectation of your job as well, they offer no partnership or subsidy for internet costs. Summary: Vision is standard, health coverage sucks, dental coverage sucks, no fitness reimbursement, no internet subsidy/partnership, no public transit subsidy. Benefits are paid by employer however. Advice to Management Learn to value your people, or as has been the trend of attrition lately, all of the good ones will be gone.", "rating": 1, "pros": "The platform. I will be the first person to say I firmly and staunchly support/believe in the product. It's a product that empowers and enables it's users to focus on their craft and to not sweat the minutia; like building out your online presence.", "cons": "Unlimited PTO:", "advice": "Learn to value your people, or as has been the trend of attrition lately, all of the good ones will be gone."}, {"title": "Stable", "text": "Pros Good working environment. Smart people. Great team. Cons None that I can think of", "rating": 5, "pros": "Good working environment. Smart people. Great team.", "cons": "None that I can think of", "advice": null}, {"title": "Still feels like a startup", "text": "Pros Power to influence change Cares about employees Moving in the right direction Cons Frustrations with building out new processes Clarity over mobility is ambigious", "rating": 5, "pros": "Power to influence change", "cons": "Frustrations with building out new processes", "advice": null}, {"title": "Great place to work; wonderful benefits", "text": "Pros Really wonderful place to work. Great work-life balance and amazing benefits including fully paid health and dental insurance; unlimited vacation days; free lunch; fully stocked kitchen. People are really nice and easy to get along with. Everyone works hard and tries to make the company and products better. Cons Some millennials who work at the company have unrealistic expectations. This is a job first and foremost -- you're getting paid to work, not to take unlimited vacation! Advice to Management Keep up the great work!", "rating": 5, "pros": "Really wonderful place to work. Great work-life balance and amazing benefits including fully paid health and dental insurance; unlimited vacation days; free lunch; fully stocked kitchen. People are really nice and easy to get along with. Everyone works hard and tries to make the company and products better.", "cons": "Some millennials who work at the company have unrealistic expectations. This is a job first and foremost -- you're getting paid to work, not to take unlimited vacation!", "advice": "Keep up the great work!"}, {"title": "Great Starting Point", "text": "Pros Great job for someone just out of college looking for a place to get their feet wet in the tech industry. Excellent benefits, and wonderful co-workers. Cons Communication between management and Advisors could be improved, additionally, not much room for growth in the Customer Operations side of things.", "rating": 5, "pros": "Great job for someone just out of college looking for a place to get their feet wet in the tech industry. Excellent benefits, and wonderful co-workers.", "cons": "Communication between management and Advisors could be improved, additionally, not much room for growth in the Customer Operations side of things.", "advice": null}, {"title": "Okay place, I guess", "text": "Pros Good benefits, nice people, easy work. Cons They won't work with you on issues, want you to drink the kool-aid as they grow more corporate. Advice to Management Care more about your employees.", "rating": 3, "pros": "Good benefits, nice people, easy work.", "cons": "They won't work with you on issues, want you to drink the kool-aid as they grow more corporate.", "advice": "Care more about your employees."}, {"title": "Best Place to Work in NYC", "text": "Pros This company takes employee experience very seriously. They're constantly pushing the boundaries of what it means to care for their employee's well. These include things like catered lunch, ridiculous health benefits, beautiful work environments, unlimited vacation and a passion to hire the best people. Cons Sometimes, employee's don't feel heard or listened too. A lot of this may be due to the fact that the company is still learning in this area or that we're not all together in the same office. I get the sense that some teams feel secluded or not apart of the company as a whole. Advice to Management Managers, remember listen to your employees and take 1:1's seriously. Celebrate their successes and provide constructive feedback on their loses. Always create an environment where the best idea wins.", "rating": 5, "pros": "This company takes employee experience very seriously. They're constantly pushing the boundaries of what it means to care for their employee's well. These include things like catered lunch, ridiculous health benefits, beautiful work environments, unlimited vacation and a passion to hire the best people.", "cons": "Sometimes, employee's don't feel heard or listened too. A lot of this may be due to the fact that the company is still learning in this area or that we're not all together in the same office. I get the sense that some teams feel secluded or not apart of the company as a whole.", "advice": "Managers, remember listen to your employees and take 1:1's seriously. Celebrate their successes and provide constructive feedback on their loses. Always create an environment where the best idea wins."}, {"title": "A Company That Values You!", "text": "Pros I have never felt as valued at a job as I do at Squarespace. Upon being hired, you are automatically enrolled in life insurance and health care (eye, dental and medical) that is covered in full by the company. Lunch is catered every day by a local catering company that cooks vegetables that are grown on their own farm (in Portland). There are snacks and drinks (soda water, energy drinks, teas, kombucha, pressed juices, coffees, etc.) that are stocked in the kitchens in the office. The food at Squarespace is just a great example of the generosity of the company. They value their employees and they really show it in the way that they treat you. Beyond the all you can eat buffet that is the office - You are truly listened to here, and are frequently given an opportunity to provide anonymous feedback via company surveys. Communication is kept open between all three offices and teams during the company-wide and department-wide monthly meetings. Management listens to feedback and makes changes quickly when possible. Above all, even though you are a salaried employee, you are scheduled a strict 40 hours (overtime pay if you go over) and when you leave the office, you leave your work behind. There is a great work/life balance here. Cons In Customer Operations, career development is really unclear. Depending on who your direct supervisor is, you may not have as good as an opportunity as other people. Advancement is largely up to your manager advocating for you, so hopefully you get stuck with a good manager! You really have to push yourself and have a super clear goal when getting hired on if you want to advance at all within Cust. Opps.. I have seen that some colleagues feel \"stuck\" in their current role. Advice to Management - Create more meaningful roles in Customer Operations, in order to keep your employees motivated. - Create an application process for advisors that want to advance from Level 1 to Level 2 customer operations, instead of relying on manager referrals (which becomes corrupt pretty quickly) and pacing metrics (which are really easy to cheat / do not reflect quality work).", "rating": 5, "pros": "I have never felt as valued at a job as I do at Squarespace. Upon being hired, you are automatically enrolled in life insurance and health care (eye, dental and medical) that is covered in full by the company. Lunch is catered every day by a local catering company that cooks vegetables that are grown on their own farm (in Portland). There are snacks and drinks (soda water, energy drinks, teas, kombucha, pressed juices, coffees, etc.) that are stocked in the kitchens in the office. The food at Squarespace is just a great example of the generosity of the company. They value their employees and they really show it in the way that they treat you. Beyond the all you can eat buffet that is the office - You are truly listened to here, and are frequently given an opportunity to provide anonymous feedback via company surveys. Communication is kept open between all three offices and teams during the company-wide and department-wide monthly meetings. Management listens to feedback and makes changes quickly when possible. Above all, even though you are a salaried employee, you are scheduled a strict 40 hours (overtime pay if you go over) and when you leave the office, you leave your work behind. There is a great work/life balance here.", "cons": "In Customer Operations, career development is really unclear. Depending on who your direct supervisor is, you may not have as good as an opportunity as other people. Advancement is largely up to your manager advocating for you, so hopefully you get stuck with a good manager! You really have to push yourself and have a super clear goal when getting hired on if you want to advance at all within Cust. Opps.. I have seen that some colleagues feel \"stuck\" in their current role.", "advice": "- Create more meaningful roles in Customer Operations, in order to keep your employees motivated."}, {"title": "Great engaging tech workplace", "text": "Pros AMAZING benefits, catered lunch, great vacation benefits and ability to move shifts a bit around to accommodate one-off events like friends or family visiting or attending a concnert Cons Communication is constantly being worked on but still could be improved; vast disparities in salary between people of similar training (read: both have college degrees) but of different tasks in the company (read: software engineers paid a ton more than customer-facing customer service agents). Advice to Management Take the lead in the tech industry and put your money where it matters: show that great customer service and personal care is just as important and valuable as programming and engineering work by making more equitable (read: livable in NYC) salaries.", "rating": 5, "pros": "AMAZING benefits, catered lunch, great vacation benefits and ability to move shifts a bit around to accommodate one-off events like friends or family visiting or attending a concnert", "cons": "Communication is constantly being worked on but still could be improved; vast disparities in salary between people of similar training (read: both have college degrees) but of different tasks in the company (read: software engineers paid a ton more than customer-facing customer service agents).", "advice": "Take the lead in the tech industry and put your money where it matters: show that great customer service and personal care is just as important and valuable as programming and engineering work by making more equitable (read: livable in NYC) salaries."}, {"title": "Thumbs up", "text": "Pros Great company culture; employees are treated like adults and this is reflected in the flexible working hours and vacation policy. Other benefits include free catered lunch and a great healthcare package. Cons The approach to project management in engineering is generally \"it's finished when it's ready\". I know that some people dislike this lack of planning/deadlines.", "rating": 5, "pros": "Great company culture; employees are treated like adults and this is reflected in the flexible working hours and vacation policy. Other benefits include free catered lunch and a great healthcare package.", "cons": "The approach to project management in engineering is generally \"it's finished when it's ready\". I know that some people dislike this lack of planning/deadlines.", "advice": null}, {"title": "Great", "text": "Pros Just a really great place to work. Cons Nothing that I can think of. Advice to Management Keep doing a great job.", "rating": 5, "pros": "Just a really great place to work.", "cons": "Nothing that I can think of.", "advice": "Keep doing a great job."}, {"title": "Couldn't Ask for More", "text": "Pros Upper management cares about the health and happiness of employees and it shows in their actions. Tons of support from a friendly work environment and opportunities to learn at your own pace. Free (good) lunches, snacks and drinks along with fully equipped gaming rooms in offices. Employees are encouraged to take advantage of \"flexible\" PTO as well as breaks during the work day. Lots of opportunities to give feedback on how the company is performing from an employee experience standpoint through many surveys and all hands meetings. 100% benefits coverage doesn't hurt in the least bit either! Cons The flat organizational structure of the company makes career development a bit unclear. You'll need to be strongly self motivated and aware of what you want if you're looking to progress. Advice to Management Keeping Squarespace a happy place to work at is a great pillar of the company culture to uphold and helps to attract the best applicants and candidates.", "rating": 5, "pros": "Upper management cares about the health and happiness of employees and it shows in their actions.", "cons": "The flat organizational structure of the company makes career development a bit unclear. You'll need to be strongly self motivated and aware of what you want if you're looking to progress.", "advice": "Keeping Squarespace a happy place to work at is a great pillar of the company culture to uphold and helps to attract the best applicants and candidates."}, {"title": "People Relations", "text": "Pros The company culture is fantastic. I feel that each employee really cares about each other, and takes an interest in each others well being both in the office and outside. I've made countless friends in the office, and feel supported by my managers in whatever I do. The managers give me independence to work on projects and take initiative in creating new ones, but are always there to give guidance and support. I feel that my managers care about my personal health and wellbeing just as much as my performance in the office, which I've never felt as strongly at another job. There's some obvious perks too -- catered lunches, amazing benefits, office location, super fun events, etc. Cons The company is growing rapidly, so you have to make sure you're confident in your work and opinions or you might get overtaken.", "rating": 5, "pros": "The company culture is fantastic. I feel that each employee really cares about each other, and takes an interest in each others well being both in the office and outside. I've made countless friends in the office, and feel supported by my managers in whatever I do.", "cons": "The company is growing rapidly, so you have to make sure you're confident in your work and opinions or you might get overtaken.", "advice": null}, {"title": "They have made a terrible job great.", "text": "Pros The Customer Care Advisor position is one that under any other company would be a call center job. You know the type, headset strapped to your head, hours of angry customers etc. Squarespace has turned this sort of customer advisory job into a sustainable career that exceeds my expectations for what a good career should be. They provide tools to make the job incredible, they always offer positive, constructive feedback on how I am doing. They give me ample opportunities to grow within the company, pay me well, and give incredible benefits. Not a day goes by that I am not happy to have this job. Cons You will hear from a number of people that the schedule is the one downside of this job, if you know that going into the job, its really not that bad. I never work over 40 hours in a week, and I know my schedule 3 months out, so I can plan accordingly. This is a 24/7 customer care position, but they have three offices around the globe to balance this work load. I have never worked before 8a, and have never worked past 12p, and never more than 8 hours in a day. Advice to Management Keep it up! This job is absolutely fantastic.", "rating": 5, "pros": "The Customer Care Advisor position is one that under any other company would be a call center job. You know the type, headset strapped to your head, hours of angry customers etc. Squarespace has turned this sort of customer advisory job into a sustainable career that exceeds my expectations for what a good career should be. They provide tools to make the job incredible, they always offer positive, constructive feedback on how I am doing. They give me ample opportunities to grow within the company, pay me well, and give incredible benefits. Not a day goes by that I am not happy to have this job.", "cons": "You will hear from a number of people that the schedule is the one downside of this job, if you know that going into the job, its really not that bad. I never work over 40 hours in a week, and I know my schedule 3 months out, so I can plan accordingly. This is a 24/7 customer care position, but they have three offices around the globe to balance this work load. I have never worked before 8a, and have never worked past 12p, and never more than 8 hours in a day.", "advice": "Keep it up! This job is absolutely fantastic."}, {"title": "Love my job", "text": "Pros Amazing office energy. Positive co-workers. Amazing Employee Experience perks! Cons I do not have any cons", "rating": 5, "pros": "Amazing office energy. Positive co-workers. Amazing Employee Experience perks!", "cons": "I do not have any cons", "advice": null}, {"title": "Fast growing mid-size company", "text": "Pros - Great people, friendly teammates - Good benefits; fully paid healthcare, parental leave policies, healthy paid daily lunch options - People work hard but also can be less strict about schedules than a corporate environment (outside of CustOps) - Company All-Hands keep employees up-to-date on company going ons Cons - Strategy/upper management can change ideas and leave your work and/or ideas hanging in the dust - In the beginning it can be a sink or swim culture, people coming from larger companies or with less work experience might feel a bit lost - Culture retention is unclear; more and more layers of management being added instead of the flat hierarchy Advice to Management - Don't forget about culture when scaling. - People have different work styles, learn to be flexible.", "rating": 5, "pros": "- Great people, friendly teammates", "cons": "- Strategy/upper management can change ideas and leave your work and/or ideas hanging in the dust", "advice": "- Don't forget about culture when scaling."}, {"title": "It's an amazing place to work at a very exciting time!", "text": "Pros Endless benefits and perks. Challenging work. Genius co-workers. Real work-life balance (I didn't know that existed before I got here). A sense of fulfillment from my contributions. Career growth and development opportunities. An amazing product. Customers who love what we do. Do I need to say more? Cons You have to be self-motivated and be willing to find and fix problems proactively. No one will hold your hand but no one will stop you from going above and beyond as long as you are making the company better. Advice to Management Keep moving forward. Growing to this scale was not easy and it's not going to get any easier but everyone is doing a great job!", "rating": 5, "pros": "Endless benefits and perks. Challenging work. Genius co-workers. Real work-life balance (I didn't know that existed before I got here). A sense of fulfillment from my contributions. Career growth and development opportunities. An amazing product. Customers who love what we do. Do I need to say more?", "cons": "You have to be self-motivated and be willing to find and fix problems proactively. No one will hold your hand but no one will stop you from going above and beyond as long as you are making the company better.", "advice": "Keep moving forward. Growing to this scale was not easy and it's not going to get any easier but everyone is doing a great job!"}, {"title": "Awesome place to work!", "text": "Pros I'm learning a lot at Squarespace and am surrounded by intelligent people who are dedicated to making a change. Everyone here is talented and also very kind. Cons My friends are often jealous of my job. Besides that, with any growing company, we're learning how to be more prepared for changes, but things are drastically improving and there is a huge effort from Senior Leadership and the rest of the management team. Advice to Management Keep up the good work! The transparency is awesome and I believe will help us become more aligned.", "rating": 5, "pros": "I'm learning a lot at Squarespace and am surrounded by intelligent people who are dedicated to making a change. Everyone here is talented and also very kind.", "cons": "My friends are often jealous of my job. Besides that, with any growing company, we're learning how to be more prepared for changes, but things are drastically improving and there is a huge effort from Senior Leadership and the rest of the management team.", "advice": "Keep up the good work! The transparency is awesome and I believe will help us become more aligned."}, {"title": "Very Happy", "text": "Pros Great working environment. Among my peers, the bar for quality is set high, but the workplace is relaxed and friendly. Leadership/managers encourage employees to discuss their professional goals and try their best to accommodate while keeping in line with company needs. The Human Resources/Experience team is very engaged and involved in keeping the employees happy. The benefits are fantastic. Really enjoy the monthly All-Hands meetings led by the CEO. Cons “Good work takes time” is one of the company values and sometimes means that projects take longer to go live.", "rating": 5, "pros": "Great working environment. Among my peers, the bar for quality is set high, but the workplace is relaxed and friendly. Leadership/managers encourage employees to discuss their professional goals and try their best to accommodate while keeping in line with company needs. The Human Resources/Experience team is very engaged and involved in keeping the employees happy. The benefits are fantastic. Really enjoy the monthly All-Hands meetings led by the CEO.", "cons": "“Good work takes time” is one of the company values and sometimes means that projects take longer to go live.", "advice": null}, {"title": "Best Job I've Ever Had", "text": "Pros -Fantastic coworkers (these people are some of my best friends) -A really awesome community -Beautiful workplace/great location in town -Rotating schedule that allows for some weekdays off (which I find really helpful) -Flexible time off -AMAZING benefits -Free lunch and unlimited snacks/drinks/coffee Cons -Usually have to work every third weekend -Sometimes have to work late hours (as late as midnight). On average 1 per week, but it varies. Sometimes I've had 2-3 per week and sometimes I haven't had any. -There is some room for growth up to a higher level advisor, but after that, it seems more difficult to continue up the ladder Advice to Management Squarespace is fantastic. I feel ridiculously lucky to be here. That said, I wish I didn't have to work as many late shifts as I do. I feel that as the night goes on, I'm not as productive as I would be during the day.", "rating": 5, "pros": "-Fantastic coworkers (these people are some of my best friends)", "cons": "-Usually have to work every third weekend", "advice": "Squarespace is fantastic. I feel ridiculously lucky to be here."}, {"title": "I love my job.", "text": "Pros Catered lunches, amazing staff, lots of free time, work from home, unlimited snacks, full healthcare benefits, tons of skill building exercises Cons The pay is a little low and there isn't much room for growth within my department.", "rating": 5, "pros": "Catered lunches, amazing staff, lots of free time, work from home, unlimited snacks, full healthcare benefits, tons of skill building exercises", "cons": "The pay is a little low and there isn't much room for growth within my department.", "advice": null}, {"title": "Great work environment", "text": "Pros Young and energetic work force. Autonomy, trust and innovation-driven strategies make this job easy to wake up for. Cons Too much split up between offices.", "rating": 5, "pros": "Young and energetic work force. Autonomy, trust and innovation-driven strategies make this job easy to wake up for.", "cons": "Too much split up between offices.", "advice": null}, {"title": "Best job I've ever had", "text": "Pros Lots of autonomy, trust, and respect for employees. Great work environment, not a ton of hierarchy or hoops to jump through. Strong product and vision. Cons Not a ton of structure - it's a \"make your own goals\" type of workplace. Best suited for folks who self-manage and take the initiative. Not a place for folks who need to be told what to do or are used to routine tasks. Advice to Management Communicate more!", "rating": 5, "pros": "Lots of autonomy, trust, and respect for employees. Great work environment, not a ton of hierarchy or hoops to jump through. Strong product and vision.", "cons": "Not a ton of structure - it's a \"make your own goals\" type of workplace. Best suited for folks who self-manage and take the initiative. Not a place for folks who need to be told what to do or are used to routine tasks.", "advice": "Communicate more!"}, {"title": "Awesome Company", "text": "Pros Great people, office space, food, work environment, and growth opportunities. Squarespace was a company that treated everyone great and with a lot of respect. Cons You must be self-disciplined in regards to structuring meetings, goals, as well as assignments yourself. The flexibility of the company in regards to employee schedules is great.", "rating": 5, "pros": "Great people, office space, food, work environment, and growth opportunities. Squarespace was a company that treated everyone great and with a lot of respect.", "cons": "You must be self-disciplined in regards to structuring meetings, goals, as well as assignments yourself. The flexibility of the company in regards to employee schedules is great.", "advice": null}, {"title": "Great place to work at", "text": "Pros Very young and dynamic company Lots of autonomy - Empowered employees Cons Nothing bad really worth mentioning here.", "rating": 5, "pros": "Very young and dynamic company", "cons": "Nothing bad really worth mentioning here.", "advice": null}, {"title": "Great company and evolving", "text": "Pros Great place to start your career in the start up industry. Excellent welcome package at the time I started. Moleskin book, M&M's, T-Shirt. Love the goodies and catered lunch. Great staff and support team. Cons None that I can think of. Advice to Management Keep growing and keep looking out for your employees.", "rating": 5, "pros": "Great place to start your career in the start up industry. Excellent welcome package at the time I started. Moleskin book, M&M's, T-Shirt. Love the goodies and catered lunch. Great staff and support team.", "cons": "None that I can think of.", "advice": "Keep growing and keep looking out for your employees."}, {"title": "Culture is great, Compensation is not.", "text": "Pros Culture and people are amazing Cons Huge disparity of pay rates depending on department. Some departments are on the high end of the range as it relates to salaries while others are on the lower end. Advice to Management Balance the disparity between salaries across the org.", "rating": 5, "pros": "Culture and people are amazing", "cons": "Huge disparity of pay rates depending on department. Some departments are on the high end of the range as it relates to salaries while others are on the lower end.", "advice": "Balance the disparity between salaries across the org."}, {"title": "Lead Designer", "text": "Pros Great culture and work/life balance Cons Currently in an awkward growth phase Advice to Management Hire more experienced people", "rating": 5, "pros": "Great culture and work/life balance", "cons": "Currently in an awkward growth phase", "advice": "Hire more experienced people"}, {"title": "a good job, but not a career", "text": "Pros generous PTO, great people to work with Cons little to no career growth", "rating": 3, "pros": "generous PTO, great people to work with", "cons": "little to no career growth", "advice": null}, {"title": "Meh", "text": "Pros Amazing benefits and perks. Ability to work from home. Unlimited PTO. Cons Open work enviornment means a lot of distractions. Its almost like people don't have respect for one another. Weekly meetings that aren't even worth having. Most of the topics brought up in meetings could have been addressed in an email. Managers promote transparency, but the lack of communication is ridiculous. 1:1's with supervisors and other team meetings are pointless most of the time, Id rather be doing something more constructive. Advice to Management Improve your level of communication. Don't drop things on your subordinates last minute. How can you promote transparency when there is almost no communication?", "rating": 3, "pros": "Amazing benefits and perks. Ability to work from home. Unlimited PTO.", "cons": "Open work enviornment means a lot of distractions. Its almost like people don't have respect for one another. Weekly meetings that aren't even worth having. Most of the topics brought up in meetings could have been addressed in an email. Managers promote transparency, but the lack of communication is ridiculous. 1:1's with supervisors and other team meetings are pointless most of the time, Id rather be doing something more constructive.", "advice": "Improve your level of communication. Don't drop things on your subordinates last minute. How can you promote transparency when there is almost no communication?"}, {"title": "Unprofessional leads, no growth, inmature attitude", "text": "Pros - good benefits, 401K, free lunch, snacks and gifts - chilled environment (too relaxed, so this can also be a con) - good training - If you're a recent college grad or just need a job to pay the bills, this is a good place to be. - you don't need much intelligence, skills or experience to perform \"well\" - feedback is handled pretty easy: \"everything and you are doing awesome\" (can also be considered as an annoying con) - you don't work much over time and if you do you get paid better Cons - absolutely no growth for smart, creative and dedicated people - promotions are handled by and with sympathy, favoritism and just by having a cheerleader attitude (remember to repeat frequently that all is f*** awesome) - schedule is annoying and doesn't provide a good life-work balance (you are demanded to work weekends, early or late hours, your needs are not being taken into consideration) - team leads are inefficient and lack of people leading expereince, skills and don't know how to provide useful feedback. - all kind of feedback is handled by filling in annoying surveys - customer care department is like the third world country of the company: the ugliest office, the dirtiest facilities (fridge can be considered a zoo for fungus and microorganisms and the restrooms are shabby, leaking, etc.), the snacks are ok but compared to the other offices in CS are the cheapest and not well stocked) - atmosphere is cold and borderline unfriendly (people don't consider greeting as common sense), with a lot of fake behavior to pretend that all is just oh so awesome - the biannual review is not even based on your performance, rather than you just get per default a raise after 6 months - it's still nice but if you work hard it's a joke (so just don't work more than you have to, which can be a pro) - high turnover - annoying meetings where it's more cheerleading than productive information Advice to Management Treat all your departments equally, promote people that have the skills and experience to lead people, punish nepotism and buddyship-promotions. Learn from feedback rather than from turnover. Stop pretending that everything is awesome but then start saying all the time that there is this and that to be changed.", "rating": 3, "pros": "- good benefits, 401K, free lunch, snacks and gifts", "cons": "- absolutely no growth for smart, creative and dedicated people", "advice": "Treat all your departments equally, promote people that have the skills and experience to lead people, punish nepotism and buddyship-promotions. Learn from feedback rather than from turnover. Stop pretending that everything is awesome but then start saying all the time that there is this and that to be changed."}, {"title": "Tech Support", "text": "Pros I worked telecommute from home. Great company. Felt small and like a family. Cons They are now a huge company and require you to work in NYC. They offered me a position there but I declined because I did not want to move to NYC.", "rating": 5, "pros": "I worked telecommute from home. Great company. Felt small and like a family.", "cons": "They are now a huge company and require you to work in NYC. They offered me a position there but I declined because I did not want to move to NYC.", "advice": null}, {"title": "fammunity is a lie - no loyalty, no security", "text": "Pros working from home before that was phased out - some of the most talented, amazing people you will ever meet Cons restructured customer care and became a revolving door - pushing dedicated talent out like they are nothing. some customer care cared about the people they were writing to but mgmt prioritized numbers and metrics over quality and satisfaction - an email could go 20 rounds with quick incorrect responses annoying a customer to fury and if someone takes longer to answer it the right way and soothe that person they are admonished for slow pace. also we were allowed to speak a certain way and received feedback on anything that was not said in the company \"voice.\" very stressful to feel constantly critiqued and ridden on top of trying to do what's best for your customer because doing just that is not good enough. the hours also became super unpredictable and miserable by the time I left. and favoritism. Advice to Management quit preaching fammunity when there is no love and no loyalty as you tear amazing people down and push them out the door.", "rating": 1, "pros": "working from home before that was phased out - some of the most talented, amazing people you will ever meet", "cons": "restructured customer care and became a revolving door - pushing dedicated talent out like they are nothing. some customer care cared about the people they were writing to but mgmt prioritized numbers and metrics over quality and satisfaction - an email could go 20 rounds with quick incorrect responses annoying a customer to fury and if someone takes longer to answer it the right way and soothe that person they are admonished for slow pace. also we were allowed to speak a certain way and received feedback on anything that was not said in the company \"voice.\" very stressful to feel constantly critiqued and ridden on top of trying to do what's best for your customer because doing just that is not good enough. the hours also became super unpredictable and miserable by the time I left. and favoritism.", "advice": "quit preaching fammunity when there is no love and no loyalty as you tear amazing people down and push them out the door."}, {"title": "Rampant favoritism", "text": "Pros Great benefits and perks here Cons Favoritism is rampant, have to be a certain way to get promoted", "rating": 1, "pros": "Great benefits and perks here", "cons": "Favoritism is rampant, have to be a certain way to get promoted", "advice": null}, {"title": "Very Happy Here", "text": "Pros Great and brilliant people, great benefits and perks, challenging work. Cons Until they move into their long term headquarters in 2017 the office spaces leave something to be desired. Advice to Management pay more attention to the younger talent at the bottom of the ladder and create more paths of advancement for them to encourage employee loyalty.", "rating": 5, "pros": "Great and brilliant people, great benefits and perks, challenging work.", "cons": "Until they move into their long term headquarters in 2017 the office spaces leave something to be desired.", "advice": "pay more attention to the younger talent at the bottom of the ladder and create more paths of advancement for them to encourage employee loyalty."}, {"title": "Great experience, lots of changes.", "text": "Pros Amazing benefits, everyone genuinely loves what they do. Free lunch and regular team outings. Cons Favoritism is through the roof. They hire for personality, but you have to fit the personality mold to move up in the company. Advice to Management Keep up the forward motion, but don't leave employees behind.", "rating": 3, "pros": "Amazing benefits, everyone genuinely loves what they do. Free lunch and regular team outings.", "cons": "Favoritism is through the roof. They hire for personality, but you have to fit the personality mold to move up in the company.", "advice": "Keep up the forward motion, but don't leave employees behind."}, {"title": "Good place to work", "text": "Pros laid back, lots of opportunities to advance Cons lots of favoritism, lots of change, a bit disorganized", "rating": 5, "pros": "laid back, lots of opportunities to advance", "cons": "lots of favoritism, lots of change, a bit disorganized", "advice": null}, {"title": "Great Place to work", "text": "Pros All the typical perks of a start up / tech company. Young, vibrant and fun environment! Cons Leadership is still in a growing phase.", "rating": 5, "pros": "All the typical perks of a start up / tech company. Young, vibrant and fun environment!", "cons": "Leadership is still in a growing phase.", "advice": null}, {"title": "Incredible workplace with fun and kind people, and a nurturing environment for growth in the organization", "text": "Pros - Consistent contact with your manager that actual is able to vouch for your interests - Consistent workload that only gets more challenging in content, not in actual work. Your knowledge increases, you're able to assist customers with more specific requests, and your title increases. - Visible paths to positions with more responsibility. - Full health and dental benefits for full-time employees - Free lunch everyday. - One hour of break for lunch in the middle of your shifts, allows you to sit and chat with coworkers, play some FIFA in the game room, go for a walk, etc. The way the shifts are setup allows for a complete hour break. Do your work for your shift and it is mandatory to stop for an hour. There is no pressure from the org or your coworkers to work during break for any reason, like there may be with other companies. Then you are back on, ready to work again. - Fully stocked kitchen. Cons - Newer employees come into a rapidly growing organization can feel overwhelmed by the content of the workload and the style of work. It is difficult for some to acclimate to an environment like this. - Office in New York is decentralized and requires walking outside to go to meetings in other offices. There is an inevitable, but sometimes weird split between the departments in different buildings with different amenities. E.G. One office in New York has private stalls, the other has communal bathrooms. Small change stuff. Advice to Management Continue listening and discussing how the experience of working at Squarespace can be improved for the quickly growing Customer Operations org. The system set in place for learning the platform and assisting customers sets your employees up for success in assisting customers. Management is accessible and open about mistakes made in the past. They have nothing to hide, because they are real people with ambitions to make Squarespace an incredible product inside and outside of the organization.", "rating": 5, "pros": "- Consistent contact with your manager that actual is able to vouch for your interests", "cons": "- Newer employees come into a rapidly growing organization can feel overwhelmed by the content of the workload and the style of work. It is difficult for some to acclimate to an environment like this.", "advice": "Continue listening and discussing how the experience of working at Squarespace can be improved for the quickly growing Customer Operations org. The system set in place for learning the platform and assisting customers sets your employees up for success in assisting customers. Management is accessible and open about mistakes made in the past. They have nothing to hide, because they are real people with ambitions to make Squarespace an incredible product inside and outside of the organization."}, {"title": "Great Opportunity", "text": "Pros Unlimited time-off, amazing catered lunches, and getting to work on projects that mean something to you. Cons Deadlines are starting to be implemented more, and there's some tension over that. Advice to Management Be more accessible to a wider range of people.", "rating": 5, "pros": "Unlimited time-off, amazing catered lunches, and getting to work on projects that mean something to you.", "cons": "Deadlines are starting to be implemented more, and there's some tension over that.", "advice": "Be more accessible to a wider range of people."}, {"title": "WORKING HERE IS NIGHTMARE!", "text": "Pros The benefits are great. Pay is competitive. Cons Outside of customer care, the corporate culture was extremely hostile. Takedowns seemed to be a favorite past time from top management all the way down the ranks. Everyone's always trying to prove themselves - not always in the best of ways. People who had been there for several years were constantly worried about losing their job. It's a dog eat dog culture and simply not what many expect from a startup. It felt like people didn't want to see each other succeed. The company prides itself on being transparent and \"level\", and in many ways it is. However, there's a lot of channels and unwritten rules that one quickly discovers. The CEO is eccentric and difficult. Reminds me a bit of the character Gavin on Silicon Valley. They don't promote despite several yrs of service and growth. If you're straight out of college, it's good to have on the resume for a year but then go somewhere that does promote. I'm sure for other people working here is a great experience, but it wasn't for me. Advice to Management Be nice to people. Set an example for the rest of your employees. Try to show up at the monthly hangouts.", "rating": 1, "pros": "The benefits are great. Pay is competitive.", "cons": "Outside of customer care, the corporate culture was extremely hostile. Takedowns seemed to be a favorite past time from top management all the way down the ranks. Everyone's always trying to prove themselves - not always in the best of ways. People who had been there for several years were constantly worried about losing their job. It's a dog eat dog culture and simply not what many expect from a startup. It felt like people didn't want to see each other succeed.", "advice": "Be nice to people. Set an example for the rest of your employees. Try to show up at the monthly hangouts."}, {"title": "Great Workplace", "text": "Pros The company continues to grow and is getting better and better. There have been some considerable improvements in both the product and in how the company is being run. The company is more transparent, feedback flows better, there is more training for managers (helpful as I manage a few people), building a team culture is encouraged, and there are a host of well-thought-out events and perks. I feel like I'm constantly learning and love being given a lot of responsibility and ownership. Cons The first few weeks you may feel somewhat lost - although I understand that they (HR) is working on making improvements in onboarding new people. Some folks need to share information better. Advice to Management Keep it up. This place keeps getting better", "rating": 5, "pros": "The company continues to grow and is getting better and better. There have been some considerable improvements in both the product and in how the company is being run.", "cons": "The first few weeks you may feel somewhat lost - although I understand that they (HR) is working on making improvements in onboarding new people.", "advice": "Keep it up. This place keeps getting better"}, {"title": "Never been happier.", "text": "Pros Transparent communication on company development, clean and fun offices with tons of perks (such as PS4, ping pong tables, catered food, fully stocked fridge etc), room to grow with a hands off approach Cons Sink or swim environment which can leave you either confused or excited.", "rating": 5, "pros": "Transparent communication on company development, clean and fun offices with tons of perks (such as PS4, ping pong tables, catered food, fully stocked fridge etc), room to grow with a hands off approach", "cons": "Sink or swim environment which can leave you either confused or excited.", "advice": null}, {"title": "Love the Company, Hate the hours", "text": "Pros Company knows how to take care of their employees. For Full-time employees the benefits are covered in full! A lot of great perks Cons 24 hours support means long late hours", "rating": 5, "pros": "Company knows how to take care of their employees. For Full-time employees the benefits are covered in full! A lot of great perks", "cons": "24 hours support means long late hours", "advice": null}, {"title": "A dream come true", "text": "Pros No-bullshit type of culture that facilitates getting things done over everything else. Great opportunities to take on a lot of responsibility – if you've got what it takes, no job title or org chart will stop you from being successful. Fantastic benefits and the friendliest, smartest people I've ever worked with. Cons If you need a lot of guidance, you will be lost on a lot of teams. Advice to Management Keep it up!", "rating": 5, "pros": "No-bullshit type of culture that facilitates getting things done over everything else. Great opportunities to take on a lot of responsibility – if you've got what it takes, no job title or org chart will stop you from being successful. Fantastic benefits and the friendliest, smartest people I've ever worked with.", "cons": "If you need a lot of guidance, you will be lost on a lot of teams.", "advice": "Keep it up!"}, {"title": "The image that Squarespace tries to portray as a company, and what it's actually like to work there, are very different.", "text": "Pros Opportunity to move up quickly, if willing to sacrifice a work-life balance. A genuine \"start-up\" culture. Free lunches, stocked kitchen, etc. Cons Compensation is menial for the amount of time that is required out of you. High turn over rate. To get any time off, you must get others to cover your shift, which is often hopeless.", "rating": 3, "pros": "Opportunity to move up quickly, if willing to sacrifice a work-life balance. A genuine \"start-up\" culture. Free lunches, stocked kitchen, etc.", "cons": "Compensation is menial for the amount of time that is required out of you. High turn over rate. To get any time off, you must get others to cover your shift, which is often hopeless.", "advice": null}, {"title": "Fresh Out of college? This might be for you", "text": "Pros Decent pay for someone coming straight out of college. Stocked kitchens/daily lunch/unlimited drinks, etc. The ability to work from home whenever you wanted (not sure if they still do this) Cons -High turn over -A ton of employees. You might get lost in the crowd. -Can get a bit stressful (but it's work, right?!) -To get a day off you have to find someone to take your shift (which most of the time did not happen) Advice to Management Keep doing what you all are doing, but don't lose your way as the company becomes bigger & bigger. When I left the company started to take a big change (for the better). I started to see new faces in the office, and things became a little more chaotic. Keep the spirits of the employees up & I'm sure you all will continue to do great things in the future.", "rating": 5, "pros": "Decent pay for someone coming straight out of college.", "cons": "-High turn over", "advice": "Keep doing what you all are doing, but don't lose your way as the company becomes bigger & bigger. When I left the company started to take a big change (for the better). I started to see new faces in the office, and things became a little more chaotic. Keep the spirits of the employees up & I'm sure you all will continue to do great things in the future."}, {"title": "a completely different picture than what was painted on their website.", "text": "Pros Genuine start-up culture. You had a free snacks, free meals, tons of free swag and the ability to work from home. Cons You were trained in this beautiful workspace but when you were taken to your actually workspace (around the corner) it was a rude awakening. There were not enough desks for the amount of people who worked there. The weekly meetings were pointless. The compensation was awful compared to the amount of the work your were asked to do. The training didn't set you up for success. If you wanted time off, you needed to find someone to cover your shift - holidays included. 60% of the staff were once Apple Retail Employees. Advice to Management They need to start paying their Customer Care team members more. Instead of wasting people's time on Thursday's with weekly meetings, the team should start making this a productive time to learn best practices and understanding how their role has an impact instead of berated your team with negative feedback. Leadership needs to work on their condescending attitude, maybe your team would be more responsive during the weekly meetings.", "rating": 1, "pros": "Genuine start-up culture. You had a free snacks, free meals, tons of free swag and the ability to work from home.", "cons": "You were trained in this beautiful workspace but when you were taken to your actually workspace (around the corner) it was a rude awakening. There were not enough desks for the amount of people who worked there. The weekly meetings were pointless. The compensation was awful compared to the amount of the work your were asked to do. The training didn't set you up for success. If you wanted time off, you needed to find someone to cover your shift - holidays included. 60% of the staff were once Apple Retail Employees.", "advice": "They need to start paying their Customer Care team members more. Instead of wasting people's time on Thursday's with weekly meetings, the team should start making this a productive time to learn best practices and understanding how their role has an impact instead of berated your team with negative feedback. Leadership needs to work on their condescending attitude, maybe your team would be more responsive during the weekly meetings."}, {"title": "The best place to work", "text": "Pros The company really cares about your well being and your future. Also offers ridiculous compensation. Cons Too many people working on projects. No one to really lead a team. Advice to Management Project Managers", "rating": 5, "pros": "The company really cares about your well being and your future. Also offers ridiculous compensation.", "cons": "Too many people working on projects. No one to really lead a team.", "advice": "Project Managers"}, {"title": "A great, individual-driven start-up culture with none of the financial worries", "text": "Pros - Working around amazing people that help you learn and grow and push you to new levels - Freedom to pursue what you are passionate about Cons - The flat structure of the company can result in feeling lost for awhile until you figure out how things work", "rating": 5, "pros": "- Working around amazing people that help you learn and grow and push you to new levels", "cons": "- The flat structure of the company can result in feeling lost for awhile until you figure out how things work", "advice": null}, {"title": "Thriving company with the best work environment", "text": "Pros This company attracts the best talent, has an inspiring CEO, and great benefits. Free lunch, 401k, medical and life insurance, yoga membership, stock options, beautiful office, AMAZING events (boat trip, monthly happy hour, conferences, and fantastic hack weeks!) The best part about working here is not the work, but the people you meet - they only hire people with great personalities and it's hard to not feel at home here. You feel cared for and respected as an employee and you know they value you. Cons The work is not always fulfilling. Management can be unclear about the goals sometimes and also have difficulty communicating to the team so projects can take many directions without designated leaders to spearhead them. A lot of people can be worth separately on the same project without knowing someone is already solving the problem. Decisions aren't explained well and there are a lot of abrupt changes to the roadmap without clear explanation or context. A lot of projects are put on hold indefinitely or shut down without notice. Employees are on the young side so many don't have prior working experience though they do have a lot of energy and great ideas. The work can be repetitive after a while and the company isn't big enough for there to be switches between teams or promotions within. Generally employees come here, have a great experience and network with talented people, then peace out within a year for bigger opportunities elsewhere. Worthwhile nonetheless! Advice to Management Keep up the great benefits, great environment, but improve the way employees are managed and work is delegated.", "rating": 5, "pros": "This company attracts the best talent, has an inspiring CEO, and great benefits. Free lunch, 401k, medical and life insurance, yoga membership, stock options, beautiful office, AMAZING events (boat trip, monthly happy hour, conferences, and fantastic hack weeks!) The best part about working here is not the work, but the people you meet - they only hire people with great personalities and it's hard to not feel at home here. You feel cared for and respected as an employee and you know they value you.", "cons": "The work is not always fulfilling. Management can be unclear about the goals sometimes and also have difficulty communicating to the team so projects can take many directions without designated leaders to spearhead them. A lot of people can be worth separately on the same project without knowing someone is already solving the problem. Decisions aren't explained well and there are a lot of abrupt changes to the roadmap without clear explanation or context. A lot of projects are put on hold indefinitely or shut down without notice. Employees are on the young side so many don't have prior working experience though they do have a lot of energy and great ideas. The work can be repetitive after a while and the company isn't big enough for there to be switches between teams or promotions within. Generally employees come here, have a great experience and network with talented people, then peace out within a year for bigger opportunities elsewhere. Worthwhile nonetheless!", "advice": "Keep up the great benefits, great environment, but improve the way employees are managed and work is delegated."}, {"title": "Ever changing responsibilities mean I learn something new every week.", "text": "Pros Great team. Smart, and nice. Cons If you aren't self-directed you won't succeed. Advice to Management Mingle more.", "rating": 5, "pros": "Great team. Smart, and nice.", "cons": "If you aren't self-directed you won't succeed.", "advice": "Mingle more."}, {"title": "Incredible career opportunity.", "text": "Pros I've learned a ton sitting next to some of the best engineers I've ever met, I get to work on challenging projects, and there is always an opportunity to present an idea or pitch a project to the higher ups. Cons They seem to be having some minor growing pains, turning from a small company into a medium company. It's not really a terrible thing, but it might cause problems for some people. Especially those who seek direction. Advice to Management Keep doing what you're doing, for the most part. I have no real complaints.", "rating": 5, "pros": "I've learned a ton sitting next to some of the best engineers I've ever met, I get to work on challenging projects, and there is always an opportunity to present an idea or pitch a project to the higher ups.", "cons": "They seem to be having some minor growing pains, turning from a small company into a medium company. It's not really a terrible thing, but it might cause problems for some people. Especially those who seek direction.", "advice": "Keep doing what you're doing, for the most part. I have no real complaints."}, {"title": "Awesome place to work", "text": "Pros You're provided everything you need to be productive Cons Nothing I can think of", "rating": 5, "pros": "You're provided everything you need to be productive", "cons": "Nothing I can think of", "advice": null}, {"title": "A poisonous place to work", "text": "Pros Good perks:  * high salary  * free lunch every day Cons No autonomy - all decisions had to go through the owner who cared little for most people's opinions, and worse changed his decisions on a daily basis. He would re-write people's code without saying anything - no mention that is was done let alone an explanation, even if what was written was exactly what had been agreed upon. Siloed working arrangements - everyone worked on their own thing and there was no cross-pollination, discussion or sharing. Depressing culture - the company didn't care about the people that worked there, cared much more about impressing customers/press. Advice to Management Listen to your people, treat them with respect, stand by your word.", "rating": 1, "pros": "Good perks:", "cons": "No autonomy - all decisions had to go through the owner who cared little for most people's opinions, and worse changed his decisions on a daily basis. He would re-write people's code without saying anything - no mention that is was done let alone an explanation, even if what was written was exactly what had been agreed upon.", "advice": "Listen to your people, treat them with respect, stand by your word."}, {"title": "Squarespace is intense, yet fun. I love that. Most importantly, the leaders care about the employees.", "text": "Pros The people at Squarespace are smart, and there is a ton of potential for this company to grow. Because Squarespace is growing so quickly, most people here get a variety of opportunities, and learn a lot while on the job. The offices are beautiful, and an amazing lunch is catered in each day. Cons Because Squarespace is moving at the pace it is, you have to be willing to adapt when asked to do things outside of your job description. I few this as a positive, some may view it as a negative. Advice to Management Keep caring about every employee. Keep listening, and help our company remain trusting (in one another) and make sure we stay true to the core values of our company and product.", "rating": 5, "pros": "The people at Squarespace are smart, and there is a ton of potential for this company to grow. Because Squarespace is growing so quickly, most people here get a variety of opportunities, and learn a lot while on the job. The offices are beautiful, and an amazing lunch is catered in each day.", "cons": "Because Squarespace is moving at the pace it is, you have to be willing to adapt when asked to do things outside of your job description. I few this as a positive, some may view it as a negative.", "advice": "Keep caring about every employee. Keep listening, and help our company remain trusting (in one another) and make sure we stay true to the core values of our company and product."}, {"title": "I love what I do and who I work with, and sometimes I can't believe I get paid for it.", "text": "Pros Profitable since day one, collaborative environment, flexible schedule and vacations, gorgeous office in downtown Manhattan, top-tier health insurance, 401k with company match, daily catered lunch, game room and paid yoga classes in the building. Cons No complaints come to mind.", "rating": 5, "pros": "Profitable since day one, collaborative environment, flexible schedule and vacations, gorgeous office in downtown Manhattan, top-tier health insurance, 401k with company match, daily catered lunch, game room and paid yoga classes in the building.", "cons": "No complaints come to mind.", "advice": null}, {"title": "Interesting company", "text": "Pros Company culture Nice people Benefits Areas of expertise that you can develop Flexibility (Work from home) Cons Micromanaging No career opportunities unless you are in the New York office Top management, are not putting enough attention to advisors feedback and the issues that clients are facing, Scheduling which has a big impact how we serve our customers, holiday and allocation of staff in the different channel, is managed is a Google spreadsheet, extremely manual, the same way that a small company without budget will be run in this area, and it leads to a lot of mistakes, getting a shifts at the wrong hour, getting the holiday removed on the wrong day or removed to the wrong person. The internal policy for holidays, hard conflict ( studies) is suppose to be flexible, but the reality is different and it seems that some of the top management is not fully aware Advice to Management CHOPS (Scheduling) is run badly, invest a bit of money internally and provide proper tools. If you have internal documentation offering flexible PTO, hard conflict (time to go to evening classes/masters), make sure that this policies are applied, otherwise change the policies as you are misleading employees and future employees.  Flexible PTO, is nothing but flexible, they won't approve 2 hours extra in your yearly leave.", "rating": 5, "pros": "Company culture", "cons": "Micromanaging", "advice": "CHOPS (Scheduling) is run badly, invest a bit of money internally and provide proper tools."}, {"title": "Micromanagement", "text": "Pros Free snacks Great tools Great co workers - it's the main reason to make the company bearable One of the girls in the Experience team who has been there for about two years, she makes everything better. Cons Team Leads should not always be agents that performed in an excellent way. They should also be humans. Let me explain: micromanaging your team makes them feel anxious, feel that they are not enough, that they're the stupid person in the team. At first you don't say anything to anyone, but then you realise that this is a behavior applied to many people. Little by little they lower your self steem, and there many, many hypocrites in management of control positions over the agents, so there is little to do when it comes to ask for help. Because, in order to remain in their positions, they support each other and people are afraid to stand up for their rights, so you can see many people feeling miserable, but until they realise that they can go somewhere else and feel better and sometimes with even a better salary, it takes some time. It's like a toxic relationship. They make you feel as if you want to belong to a group, to the popular group, to the main mafia that has been working there for a long time and go choosing between the newcomers to make the net bigger. The issue here is that this group of people and their \"management skills\" have resulted in many people leaving the company in the last year. I'm talking about more than 20 people. And don't think that their hiring enough people to replace them. They just command those who stay to work more, and in worse conditions - the holidays are not as flexible as they say, new shifts until 10pm, which makes extremely difficult to have a good balance between your personal and work life. Even people who were loved by most of the agents have left the company. And without any real reason from management. Making everyone feel insecure because even the greatest people ended up having crisis due to the company. Advice to Management It's not all about numbers, think about the people in the company, you've hired a bunch of people whose ethics and morals are some of the worst I've ever seen in my life. And value some agents who are always helping, both morally and at work and are not really valued. Also, I've seen many people advised that they were going to work in their own language. That actually never happened. Although in their role description it said so. Also, as soon as language experts were chosen, people who have no idea of punctuation or grammar in their own language were hired for those positions because of their numbers as agents instead of their background. That, let me say, it's ridiculous.", "rating": 1, "pros": "Free snacks", "cons": "Team Leads should not always be agents that performed in an excellent way. They should also be humans. Let me explain: micromanaging your team makes them feel anxious, feel that they are not enough, that they're the stupid person in the team. At first you don't say anything to anyone, but then you realise that this is a behavior applied to many people.", "advice": "It's not all about numbers, think about the people in the company, you've hired a bunch of people whose ethics and morals are some of the worst I've ever seen in my life. And value some agents who are always helping, both morally and at work and are not really valued."}, {"title": "Lack of professionalism, human attitude, transparency and flexibility", "text": "Pros Like others mentioned: - free food and snacks; - health insurance; - pension scheme; - occasional massages or doctor checkups; - quarterly dinners + summer and X-mas party; - lots of new technical knowledge within the first 4 -6 months. Cons I will list my full experience below: CONTRACT: Lack of transparency. It says 'flexible holiday', but the first week I started working I found out, that they'd prefer me not to take holiday within the first 4-6 months until the training is finished, and you cannot pick the day you want you can only choose from what's left on the list. These means that when you join the company, you get to see the calendar that is pre-booked until the end of the year and you grab what's left. Three times within the last 9 months I tried to get 3 days off, and it was impossible, because a) you're still in training b) you need to become an expert ASAP, and you need to focus on this goal c) there are no slots available. THREE days off in this company is big problem. Sometimes volumes are very low, you have nothing to do, no one allows you to take a project either. I asked twice, I came up with the projects, and both times I was denied, because I 'needed to focus on becoming an expert asap'. Once I asked my manager for help, saying that I really need him to approve 3 days of holiday, could you please make an exception since the volumes are low? And what I received was a question:'Why do you think you deserve an exception?\" Because I am a human who needs rest, I am not a robot! Holiday policy was never explained prior to signing the contract, it was revealed only a week after I started. SHIFTS: They still change weekly, and you'd work anything between 7am and 10pm! I cannot combine work and sport activities, the classes I want to take are in the evening so half of them I miss. And you can barely swap the shifts. Before I signed the contract I asked if I could combine work and evening studies, and was told that this shouldn't be a problem, and I could swap shifts if needed. Isn't the case! My manager told me if the classes are not tech related, they are in conflict with my work. So my personal development was not valued at all! I was very disappointed to hear that. Plus, for each shift, lunch and meeting you need to clock in and clock out online, this makes you live by the clock. You cannot be late EVER. I never been late for work more than one minute within the last 9 months! I am not saying it's good to be late, I am saying I developed an internal fear of being late more than a minute. MANAGEMENT: Mostly very young, with lack of experience people. My manager lives by the management book and it's really easy to put him off by asking a thought provoking question. It often feels if this is not in the book, he cannot answer it and struggles to phrase a constructive answer. Many people who were hired for a specific language, ended up working in English, because for years they are not able to launch support in other languages. And there is a lot of micromanagement. You always feel like you're been controlled and not trusted, I often have to write in the sheet what resources I've been checking for the last hour in order to improve my performance. How many minutes it took and what I learned. I feels like being back to school. CAREER: No development plan, no options to grow. Many people who worked here for years always remained just admins, you have nowhere to move really. And important to add, you stop learning after 6 months, you're done with training and there are no new challenges in front of you, you do the same things and deal with the same topics daily. Maximum you can do, run a global meeting or initiate one project that you will never be given enough time for. LIVE CHAT: Now we work primarily in Live Chat. Parallel to that you're expected to take tickets! Double work and multi-tasking. It's really really exhausting. We have no time to go to the toilet, sometimes you have to run while awaiting for a customer's answer in the Live Chat. Sometimes you don't have such chance for an hour or two if the customers are really intense! You cannot go to the toilet for an hour! It's ridiculous! It's unhuman. Think of females, please! Even in prison they can go to the toilet whenever they want! This way the company kills more volume using the same amount of people. Smart move, but shows that the admins are treated like robots, not humans. Advice to Management Re-work your shifts, be more transparent about the conditions before one signs the contract. Please be more human, listen to your admins, don't turn them into robots, there are pregnant women on the floor! People need time for personal life, people need to know they have 25 days of holidays yearly, they need to be able to take those days, not to fights or bag for at least 20! Consider hiring external staff, outsource weekend and late shift work. Don't stay by excuses that it is hard to train the people outside, find the way, outsource training and support too if needed. Hire more professional team leads, who have years of experience, not those who went to a conference or read a management book. Don't make your team leads to become dictators who just demand high numbers and hear no voice of the team. You seem to be open to feedback, but it often feels ignored in the end.", "rating": 1, "pros": "Like others mentioned:", "cons": "I will list my full experience below:", "advice": "Re-work your shifts, be more transparent about the conditions before one signs the contract. Please be more human, listen to your admins, don't turn them into robots, there are pregnant women on the floor! People need time for personal life, people need to know they have 25 days of holidays yearly, they need to be able to take those days, not to fights or bag for at least 20!"}, {"title": "Great company, but an isolated department.", "text": "Pros Fantastic colleagues, great sense of community and support in daily work. Cushy perks (catered lunch, snacks, coffee, wellness at work, happy hours, etc.). Perceptive, honest, collaborative, motivated and supportive team leads / middle management. Cons Strictly scheduled shift work within a narrowly defined role resulting in lack of flexibility or space for creativity, growth, and acquiring new skills. Advice to Management Work on leveling out the playing field for Customer Operations employees as compared to other departments within the company. Specifically in terms of career progression, demonstrating respect for and confidence in your workers, and the impact they can have on product development and marketing. Ensure the well being and integration of the department within the company does not get looked over as the company grows.", "rating": 5, "pros": "Fantastic colleagues, great sense of community and support in daily work. Cushy perks (catered lunch, snacks, coffee, wellness at work, happy hours, etc.). Perceptive, honest, collaborative, motivated and supportive team leads / middle management.", "cons": "Strictly scheduled shift work within a narrowly defined role resulting in lack of flexibility or space for creativity, growth, and acquiring new skills.", "advice": "Work on leveling out the playing field for Customer Operations employees as compared to other departments within the company. Specifically in terms of career progression, demonstrating respect for and confidence in your workers, and the impact they can have on product development and marketing. Ensure the well being and integration of the department within the company does not get looked over as the company grows."}, {"title": "Account Manager", "text": "Pros Great work balanced environment, and great atmosphere, the people are very kind. Cons Need a better induction process", "rating": 5, "pros": "Great work balanced environment, and great atmosphere, the people are very kind.", "cons": "Need a better induction process", "advice": null}, {"title": "Customer Advisor", "text": "Pros Good benefit package Suit night people Cons Holidays(Vacation) really difficult to arrange Shifts are not great (loads of late shift)", "rating": 1, "pros": "Good benefit package", "cons": "Holidays(Vacation) really difficult to arrange", "advice": null}, {"title": "New age office feel", "text": "Pros Great people. great opportunities, free food free beer Cons Some difficulty progressing in the role for others.", "rating": 5, "pros": "Great people. great opportunities, free food free beer", "cons": "Some difficulty progressing in the role for others.", "advice": null}, {"title": "Squarespace or what it used to be!", "text": "Pros Good Salary Free Lunch (If you can get any) Good Equipment Cons No time for development Once customer support - Now nothing more than a Call Center enviroment. No Career Opportunities - Generally, if you're not hired as something more you most likely remain a Customer Advisor till you can't take it anymore High Stress Enviroment wihtout an outlet No cool off period Shift work Advice to Management Squarespace once was an amazing Company to work for, but fast forward to 2017, now its all about handling as much as possibe. Might be a good idea to step back on the workload and hire more people. No career chances unless you're in NY HQ, which is sad if you think about that Dublin could and should be the European Hub for Squarespace. Offering the same chances as in the NY would do the trick. Also, it would be an amazing idea to make sure that everybody knows their stuff. A knowledge test all 6 months or so would be an idea to make sure of that.", "rating": 3, "pros": "Good Salary", "cons": "No time for development", "advice": "Squarespace once was an amazing Company to work for, but fast forward to 2017, now its all about handling as much as possibe. Might be a good idea to step back on the workload and hire more people."}, {"title": "Meh...", "text": "Pros Great people Great tools Decent wage Free snacks Cons Workload Misleading hiring policy Progression or lack thereof (everyone says it but it's true) Micromanagement Advice to Management Although the company is better than most in the industry, it still has all the tropes of a middle-tier employer. Too many chiefs, too many numbers, too many targets, not enough humanity.", "rating": 3, "pros": "Great people", "cons": "Workload", "advice": "Although the company is better than most in the industry, it still has all the tropes of a middle-tier employer. Too many chiefs, too many numbers, too many targets, not enough humanity."}, {"title": "Delusional expectations vs a great working environment", "text": "Pros Great work environment, you're able to work from home when needed plus flexible vacations. Everybody's warm and welcoming. They try to create the most relaxing environment so you can be more productive. Great health insurance benefits. Cons Still lacking proper training on certain subjects. They don't take in consideration your effort, neither they give you time to adapt to changes on a service/product. The required productivity is insanely high and exhausting. Advice to Management . Review your goals/metrics - they're too high! . Set realistic expectation to your employees - transparency is a must - putting them under pressure won't help, neither the sense of micromanaging that comes with it. . Don't come up with areas of improvement where they don't exist, just to stall and extend probation periods.", "rating": 3, "pros": "Great work environment, you're able to work from home when needed plus flexible vacations.", "cons": "Still lacking proper training on certain subjects.", "advice": ". Review your goals/metrics - they're too high!"}, {"title": "Customer Care Specialist", "text": "Pros Working from home available here and there, laid back office environment, great benefits (medical, optional pension, paid PTO) Cons Poor management decisions, not a lot of internal promotion opportunities, constant changes and poorly managed internal communication between offices Advice to Management Try not to apply general textbook examples on how to deal with your team, be more personal with employees and be truthful in the best possible way", "rating": 3, "pros": "Working from home available here and there, laid back office environment, great benefits (medical, optional pension, paid PTO)", "cons": "Poor management decisions, not a lot of internal promotion opportunities, constant changes and poorly managed internal communication between offices", "advice": "Try not to apply general textbook examples on how to deal with your team, be more personal with employees and be truthful in the best possible way"}, {"title": "If you need a wage and you don't mind to your self esteem or mental health", "text": "Pros Free food but not healthy. Medical insurance and paid holidays. Cons Short term workplace if you mind to your mental health. Management is bossy, discriminatory and if you try to change something or report some negligence their sort of so-called managers are ready to retaliate against you. No path to develop skill or change position is in place, poor internal culture, idiotic HR, everything is so micromanaged that people get sick working for hours in chat. So mind your targets, shut up or go and find a better place to work! Advice to Management How to advise someone that is not ready to listen to you?", "rating": 1, "pros": "Free food but not healthy.", "cons": "Short term workplace if you mind to your mental health. Management is bossy, discriminatory and if you try to change something or report some negligence their sort of so-called managers are ready to retaliate against you. No path to develop skill or change position is in place, poor internal culture, idiotic HR, everything is so micromanaged that people get sick working for hours in chat. So mind your targets, shut up or go and find a better place to work!", "advice": "How to advise someone that is not ready to listen to you?"}, {"title": "Customer Agent", "text": "Pros lots of snacks and lunches. PTO. Swapping shifts with colleagues. You'll learn lots about web design, domains, SEO and other Internet stuff. Cons I worked in Squarespace for three years and I never got the chance to work with my native language, which I was hired for in the first place. The company opened in Dublin with the idea of expanding the platform in Europe. They've failed at that, due to lack of planning, zero marketing and of course the fact that the platform and help site isn't translated into other languages. The service is too expensive for most customers - excepting those in the US, I guess - and taking that into account it's impossible that it will ever grow in LA countries and most European countries at such expensive rates. If you're a bilingual person and would like to work in your native language, Squarespace isn't the place for you. You'll be working exclusively in English. Also, no chances to grow internally. Most leadership positions are filled with external professionals - almost all team leaders, HR and the two managers were hired externally. When I left, I had actually been in the company longer than all team leaders and managers. How weird is that. Also, lots of favouritism, finger pointing and back stabbing. You'll see groups of friends and how some agents grow and take on new projects every now and then, while most of the others - usually with better results and metrics - never get the chance to grow. The more visible and noisy you are, the more you'll grow. Advice to Management stop micromanaging. Maybe try to actually answer an email or chat one day. That's how you'll learn what Squarespace agents do 8 hours a day.", "rating": 1, "pros": "lots of snacks and lunches. PTO. Swapping shifts with colleagues. You'll learn lots about web design, domains, SEO and other Internet stuff.", "cons": "I worked in Squarespace for three years and I never got the chance to work with my native language, which I was hired for in the first place.", "advice": "stop micromanaging. Maybe try to actually answer an email or chat one day. That's how you'll learn what Squarespace agents do 8 hours a day."}, {"title": "Values vs reality", "text": "Pros Nice benefits, great people and enviroment Cons Lack of opportunities Lack of transparency Advice to Management Everything meant to be awesome, the core values and culture looks great. But it looks like some management members doesn't have the same values and you might get disillusioned of the company when you start seeing the reality.", "rating": 5, "pros": "Nice benefits, great people and enviroment", "cons": "Lack of opportunities", "advice": "Everything meant to be awesome, the core values and culture looks great. But it looks like some management members doesn't have the same values and you might get disillusioned of the company when you start seeing the reality."}, {"title": "Great place to work", "text": "Pros Culture; Managers; Benefits; Environment; Carrier Progression Cons Late Shifts; Targets are difficult to reach;", "rating": 5, "pros": "Culture; Managers; Benefits; Environment; Carrier Progression", "cons": "Late Shifts; Targets are difficult to reach;", "advice": null}, {"title": "Amazing company environment, culture and job!", "text": "Pros The best aspect of the company, besides it's amazingly positive and encouraging culture, is the fact that you have a Team Lead that truly cares about your well being in the company and your personal development. Although performance review is certainly a part of the relationship with your Team Lead, it's done on a regular basis (every two weeks), and with the goal of setting you up for success and not catching your mistakes. Furthermore, you have the opportunity to work on your own projects, do training courses and life lab sessions. Also, no micro managing! If you prove you are responsible and invested in your projects (and the company), you are given trust and autonomy to organize your own work. The salary is competitive and the benefits are great: free lunch, kitchen full of snacks, paid time off, medical insurance, regular pay upgrades etc. Although the company is fast growing it is doing a great job of retaining its original startup culture and atmosphere, and it's proven that it listens to employee concerns. For example, at the beginning you had to trade shifts and find someone who would cover you if you wanted to take time off, now you just have to ask, and as long as there aren't too many people off, you can take plenty of vacation days! Cons There are still growing pains, for example management is still finding the best company structure or the best way to organize schedules, so things might shift around from quarter to quarter. Also, the Dublin offices are still being worked on, so it's not as polished as the other two offices. Advice to Management Keep the amazing, friendly and positive culture of the company, and provide more opportunities to grow and a clearer view of how the company structure will develop in the future.", "rating": 5, "pros": "The best aspect of the company, besides it's amazingly positive and encouraging culture, is the fact that you have a Team Lead that truly cares about your well being in the company and your personal development. Although performance review is certainly a part of the relationship with your Team Lead, it's done on a regular basis (every two weeks), and with the goal of setting you up for success and not catching your mistakes.", "cons": "There are still growing pains, for example management is still finding the best company structure or the best way to organize schedules, so things might shift around from quarter to quarter.", "advice": "Keep the amazing, friendly and positive culture of the company, and provide more opportunities to grow and a clearer view of how the company structure will develop in the future."}, {"title": "Will make your mind Square and leave Space in your heart...", "text": "Pros as previously outined in other reviews, the standard most start up, fancy american companies are offering: - free snacks, lunch, nibbles, happy hours on Friday, team outing once a quarter - pension and health cover (the best bits) - the location in city centre behind dublin castle - Flexible time off... flexible as \"unlimited\" was first released but people abused so they kept it around 25 days (unofficially) be aware of contractual advertisements ;) Cons Now the cons... I warn you the list is long(er), honest (many former of SS Dublin will certainly agree) - Incompetent senior management team ==> Many have been recruited as TL (internally) only by politics, favoritism. They are simply lacking experience, humanity, respect, competence and experience to be in the shoes of a lead. The only one that are standing out of the pack are the lead recruited externally, as we can feel they have been leads in a different environment where KPI's where certainly a more human, realistic and respected approach of the management was practiced. They start with a good spirit (at the beginning) and quickly develop an egotistic approach at the contact of the new management that are imposing them to micro manage (they know everything, they have seen everything in the industry... no need to feed you more on that). Retain the keyword: MICRO MANAGEMENT This is their new crusade, as they are convinced that this is by following every single people's movements they will become more productive and responsive than similar companies on the market. Wrong. Everything changed between the moment I started. The old office was at Benson Street, with the Grand Canal Dock spirit and atmosphere. It felt like a real startup where changes, development, growth were possible. They quickly arranged themselves (voluntarily or not) to clean what was great to replace it by the worst... When things turned sour and bitter was the transition to the new location in Great Ship Street, Le Pole House where the office is now located. Decisions are made and done behind curtains (a lot), one thing is announced and will never see the light of the day. We then saw a massive growth of the team (which should be positive when properly handled... but wasn't). Then some projects were continuing to develop (or not), applied a week as pilot, removed the week after, No structure, proper guidelines leaving the Shift Leads (Supervisors) empty handed, with issues to guide us in the queues. They are testing things like amateurs. Not even Facebook are running pilots this way. . Important aspect to underline here, they divided the leads in 2 parts: Team leads and Shift Leads. Those helping us in the queues, answering our questions (any, and they were fantastic at this) were them, leaving the Team Leads doing just 1:1 and doing their shenanigans in the back with a minimum of interactions with us on a daily basis. The sad result of this is obviously having no visibility on what we really do and judging us through metrics that are not even reliable (internal tools breaking reflecting different numbers one week and another). We have been initially hired because of our language to support other markets... almost 2 years later... and still going, no support in other languages. They are supposedly working on an international expansion but the support for the english speaking market is still not yet fully secured. This aspect comes back naturally to incompetency. Reminding that the company is already more than 10 years and yet NO international support. Naturally the pressure of the investors might be knocking hard(er) to get results. - Growth and development ==> Inexistent. As I mentioned, the oldest that arrived first had eventually a chance to get a bone or some left overs, for the new guys, you are hired as Customer Advisors and will stay in that role. If you ever try to step up, lead some projects, present at the local team meeting, or even request to apply for an internal position (when it is posted), regardless of what you do best, you will never have a chance to progress EXCEPT if you are the buddy of a team lead, shift lead or a manager. The number of people who progressed just by being best friends of somebody in the management is countless. The word for this is FAVOURITISM or POLITICS. You will tell me that they exist everywhere but in Squarespace Dublin this is the HQ for such practices. - Work/Life Balance ==> Expect to work shifts between 7am and 8pm. Not the same from one day to the other one. Changing without warning when an event comes (advertising campaigns in the US = change of your schedule with just 48h prior warning. Do they know people have lives? Families? Responsibilities outside of this company? No! 2016 and still no improvement. Once you get your shifts for the quarter there are no turnarounds, take it or leave it as I have heard being said once. They will expect to constantly move between channels when their new Channel Leads are sneezing. I have seen people doing full day in chats and forced to keep 2 concurrent chats and being denied to run to the toilets. They had to even make public meetings about the problems. As it has been highlighted in previous reviews, they give you a treat (ice cream) and the minute after they announce you they will change your schedule. Beware of the treats they are made to make you swallow the worst. - Culture and values ==> Well, we went from a startup that used to praise unicorns and rainbows to a place that looks like to hell. Not sure how the other offices are run in Portland and New York, but after previously outlining what i said above, not sure there is much left of a culture and values. When people are being let go for nothing, when the respect of the people who are contributing to the growth of this company is not recognized (not speaking of a new absurd system to recognize \"stars\"... next step, they will give people vouchers or lollipops). Useless local meeting that are constantly changing, not regularities, empty content (oops the monkey, where you are supposed to tell to the whole assembly your oops moment of the week, and if you win, you keep on your desk a non washed monkey). There was a culture before, when all the best people started the things (for CFO, former customer office Manager... well in fact all the people they pushed outside to hire instead people from Google in the top management team to \"clean\" the place as it seems the good couldn't stay. It breaks my heart to write this review as I really thought I found with Squarespace the company I would spend a lot of time with, but the venture of Squarespace in Dublin is the perfect example on how great things can turn wrong for any company settling in a different country. There was a real care about the people who joined this \"famunity\" as they called it at the start, and then quickly the things turned to be sour and bad to the point where I saw people preferring to leave and ready to take a cut in salary for other people rather than staying in this place. Maybe it wasn't perfect at the start, maybe there wasn't a lot of benefits but there was warmth, people respecting each other, helping each other and having a passion of the products, all you can see now are people stuck with no chance to progress and prove they are do and accomplish things, they turn bitter and angry and end up making no efforts to stay. They end up being burnt out, tired and emptied of energy. Advice to Management Review in deep your organisation and structure to make sure Dublin gets the same chances Portland and New York seem to exhibit... after reading other reviews it seems the issue is the same... your best chance is to consolidate and fix the management methods before you launch the international support as it will break and the support will turn less than average.", "rating": 1, "pros": "as previously outined in other reviews, the standard most start up, fancy american companies are offering:", "cons": "Now the cons... I warn you the list is long(er), honest (many former of SS Dublin will certainly agree)", "advice": "Review in deep your organisation and structure to make sure Dublin gets the same chances Portland and New York seem to exhibit... after reading other reviews it seems the issue is the same... your best chance is to consolidate and fix the management methods before you launch the international support as it will break and the support will turn less than average."}, {"title": "lack of career development", "text": "Pros lovely people and food, caterers every day! Cons office space is not pleasant!", "rating": 3, "pros": "lovely people and food, caterers every day!", "cons": "office space is not pleasant!", "advice": null}, {"title": "Great at the start, worse over the last year", "text": "Pros The staff and the teams are great overall. You'll meet awesome people. The company provides lots of snacks, drinks, cookies that will motivate you at first. Weekly meetings take place with news, games and jokes to update and help employees learn new stuff while having fun. Cons Working hours from 7am to 8pm depending on the day. You'll never start/finish at the same time more than two days in a row, makes it hard to handle personal life or other activities. Also, you'll be working some weekends. Breaks are controlled and lunch breaks are taken at a different time every day. Sometimes before lunch has arrived or when it's already removed. Lots of employees will rather have snacks or crisps as lunch is usually taken in front of your computer while working. Although this has been brought up, the company won´t make changes. I can't really understand how a good company will prioritize work volumes to your own health. Also, no chances to grow or develop a different role. The few employees who managed to evolve seem to get it through favouritism or cigarette-break friendship. Lots of brilliant employees with a great background and experience are left behind doing the same boring task day after day. Company has been expected to provide support in several languages for the last TWO years and most of the employees (around a hundred) were hired for this purpose. However, there's no transparency as to how this is going to happen and it keeps being delayed and foreign employees, who applied for a linguistic role in their native language, are ignored and have only been working in English since their first day. Working hours have increased over the last year, from 32 to 40h/weekly, while salaries didn't. Still, most of us were impressed by the free snacks, drinks and lunch, but this won't help once you start getting exhausted from the rotating shifts, repetitive tasks and no perspective of improvement. Company has fired several employees without notice and they're always asked not to mention the reasons, which leaves it to outside office gossip. Some of them had babies or a foreign visa. Company doesn't allow for employees to carry second paid jobs even if ocassional. A couple of employees were fired on the spot as soon as company found out they had a side job. If there's a concern or an issue, they will be ignored, delayed or replied with a reminder that our customers go first. I still remember the day we got free cupcakes first and then we received the news that we'd be working more hours weekly, with the same salary. Advice to Management There's lot of opportunities in Dublin and abroad. Right now Squarespace is not offering anything better that other bigger companies. To keep employees satisfied, proud and to have us recommend the squarespace products and any available roles, you'll need to make a few improvements over the next months. The 'customers go first' policy is obsolete. I'm sure companies like McDonalds or Lidl follow that same policy and that doesn't mean they're a great place to work. You've lost lots of brilliant employees and some others are actively looking for another job.", "rating": 3, "pros": "The staff and the teams are great overall. You'll meet awesome people. The company provides lots of snacks, drinks, cookies that will motivate you at first. Weekly meetings take place with news, games and jokes to update and help employees learn new stuff while having fun.", "cons": "Working hours from 7am to 8pm depending on the day. You'll never start/finish at the same time more than two days in a row, makes it hard to handle personal life or other activities. Also, you'll be working some weekends.", "advice": "There's lot of opportunities in Dublin and abroad. Right now Squarespace is not offering anything better that other bigger companies. To keep employees satisfied, proud and to have us recommend the squarespace products and any available roles, you'll need to make a few improvements over the next months. The 'customers go first' policy is obsolete. I'm sure companies like McDonalds or Lidl follow that same policy and that doesn't mean they're a great place to work."}, {"title": "Overrated company underrating amazing people", "text": "Pros Very knowledgeable colleagues Decent healthcare package Snacks, free lunches Great work tools Cons There's no space for individual growth. Squarespace employs people that are under used in customer support positions and offers no opportunities to evolve. They'll fool you into believing it's a whole big family but you'll know better after two months there. Advice to Management Start making the most of the skills of the people you hire.", "rating": 3, "pros": "Very knowledgeable colleagues", "cons": "There's no space for individual growth. Squarespace employs people that are under used in customer support positions and offers no opportunities to evolve. They'll fool you into believing it's a whole big family but you'll know better after two months there.", "advice": "Start making the most of the skills of the people you hire."}, {"title": "Great employer but a real risk of becoming an \"average Joe", "text": "Pros - Still has the mentality of a startup. If you're willing to push your ideas forward, they will have an impact. - Great people at every level, Squarespace has en eve for catching people that are a good cultural fit. - Enployees are given a lot a freedom to manage their workflow. Can be difficult to handle if you're used to very structured workplaces, though. - The ability to work from home. - Free food, snacks & drinks. Cons - As they grow, they're tending to structure things more and more, become less flexible at times. - Although they're fantastic lads to hangout with, a couple of team leads seem to be lacking the skills and leadership to be the fantastic leads the company deserves. - Communication and decision making is not the most transparent. Many changes are implemented in a \"top-down\" way making you feel like \"ok, so where is this coming from now?\". - The power is still way to centralized in NYC and Portland offices. - The office itself (Dublin) is dull and lacks personality. - There seems to be some favoritism when it comes to internal promotion with again lack of transparency and communication on the overall process and assessment. - Professional opportunities are a bit limited - Working during the weekend - shifts - Salaries could be higher Advice to Management -Enhance that office floor! Colorful, trendy, inspiring even decadent, that's what an office should be on 2015 (visit AirBNB Dublin HQ for insights) - Communicate and explain things that are happening and will happen - Saying \"It's awesome!\" Doesn't make something awesome", "rating": 5, "pros": "- Still has the mentality of a startup. If you're willing to push your ideas forward, they will have an impact.", "cons": "- As they grow, they're tending to structure things more and more, become less flexible at times.", "advice": "-Enhance that office floor! Colorful, trendy, inspiring even decadent, that's what an office should be on 2015 (visit AirBNB Dublin HQ for insights)"}, {"title": "Excellent company, only misses on compensation", "text": "Pros Great benefits, excellent people to work with, good structure and totally commited to their employees. Gotta love the city centre location as well, you can go anywhere during lunch time because it's all closeby. Cons Compare to other tech companies, salaries are not the best. Benefits are great, but they can only go so far in getting you things such as a mortgage or an apartment. Advice to Management none", "rating": 5, "pros": "Great benefits, excellent people to work with, good structure and totally commited to their employees. Gotta love the city centre location as well, you can go anywhere during lunch time because it's all closeby.", "cons": "Compare to other tech companies, salaries are not the best. Benefits are great, but they can only go so far in getting you things such as a mortgage or an apartment.", "advice": "none"}, {"title": "Great company to work for", "text": "Pros Great benefits, work–life balance and any other benefits. Cons Growth is quite low or doesn't exist. Favouritism. Advice to Management Please, pay attention to your employees, you're losing many stars that wanted to shine, but you didn't even care.", "rating": 5, "pros": "Great benefits, work–life balance and any other benefits.", "cons": "Growth is quite low or doesn't exist. Favouritism.", "advice": "Please, pay attention to your employees, you're losing many stars that wanted to shine, but you didn't even care."}, {"title": "Very happy to have found Squarespace", "text": "Pros A company with very little bureaucracy and red tape. This is refreshing and Ideas are nurtured and people are rewarded. If you are willing to talk they are willing to listen. Company is very successful and invest in their people. Cons Not sure if it's a con, but things are becoming more structured than they were before so stats are important but not the be all and end all. There is an intention to be the best of the best. Advice to Management Keep rewarding those who go out of their way to impress. Keep up the parties and fun side of things :)", "rating": 5, "pros": "A company with very little bureaucracy and red tape. This is refreshing and Ideas are nurtured and people are rewarded. If you are willing to talk they are willing to listen. Company is very successful and invest in their people.", "cons": "Not sure if it's a con, but things are becoming more structured than they were before so stats are important but not the be all and end all. There is an intention to be the best of the best.", "advice": "Keep rewarding those who go out of their way to impress. Keep up the parties and fun side of things :)"}, {"title": "Great company to work for", "text": "Pros Benefits, flat hierarchy, great team Cons Redundant nature of work in Customer Care Advice to Management Develop more opportunities", "rating": 5, "pros": "Benefits, flat hierarchy, great team", "cons": "Redundant nature of work in Customer Care", "advice": "Develop more opportunities"}, {"title": "Went from good to very disappointing", "text": "Pros - Unlimited PTOs, you have to love that! - The possibility to work from home -> But check out the Cons that go with that - The people -> Most of them are great! Cons Well that's the issue... We had quite a few Pros, and now they are Cons: - We were paid 40 hours while only working 36 hours - They were quite flexible in their schedule, trying to make us work to live and not the contrary ------------------------ These aren't true anymore. - Now I work 40 or more hours and I'm paid 40 hours. - They are very stiff in their scheduling and as soon as you demand a change, you are told that they can't do that for everybody - Live Chat... What to say? I did LC in the past, and I didn't mind it at all, but there they are just looking at the productivity. But the worst and the thing most of my LC colleagues complain about, is the fact that when your shift is done and you're still in chat, you have to wait half an hour before asking to transfer your chat; which can again take 10 / 15 minutes. -> Big, big issue! - Team Leaders are chosen as Project Managers for project they have no clue how to lead, when people with the experience for these projects are completely ignored because they aren't TL. When I brought this up to their attention I was told it wasn't my place. Advice to Management Stop ignoring all the language people you hired! When I was hired I was told about the localization project, despite my experience and background, and that of several of my colleagues, none of us was chosen, instead someone with no experience, and when we try to help with suggestion, we're told they know what they are doing. We're all very disappointed about the way things are happening and nobody is taking it into account. Please use our skills instead of pushing us to leave.", "rating": 3, "pros": "- Unlimited PTOs, you have to love that!", "cons": "Well that's the issue... We had quite a few Pros, and now they are Cons:", "advice": "Stop ignoring all the language people you hired!"}, {"title": "Great place to Work!", "text": "Pros Fantastic enviornment. Great place to work, great people, relaxed athmosphere in a company that is contanstly raising the bar to an higher level. Sometimes, I have to be honest, it was a pleasure to wake up early and come to work. Cons Nothing in particular, the management can give you training, benefits and consideration. The workplace is great and all the people are tremendously friendly. Advice to Management Well Done to the Management of the company, to have created such a good and genuine business and company ethic.", "rating": 5, "pros": "Fantastic enviornment. Great place to work, great people, relaxed athmosphere in a company that is contanstly raising the bar to an higher level. Sometimes, I have to be honest, it was a pleasure to wake up early and come to work.", "cons": "Nothing in particular, the management can give you training, benefits and consideration. The workplace is great and all the people are tremendously friendly.", "advice": "Well Done to the Management of the company, to have created such a good and genuine business and company ethic."}, {"title": "Best company I've ever worked at", "text": "Pros Clear direction and employees are all very motivated; awesome culture, working here is really fun; everyone here is friendly and there are lots of company sponsored events every other week; the product design is best in the industry, lots of proud to work here; catered food and the unlimited snacks and drinks are composed of a very organic and healthy selection; and free insurance policy and generous time off. You can come to work with sandals and any time you want. Cons Not sure if I can think of one yet; If I have to name one it would be that people are too funny in hipchat that some are easily get distracted by the links they sent Advice to Management Keep it up.", "rating": 5, "pros": "Clear direction and employees are all very motivated; awesome culture, working here is really fun; everyone here is friendly and there are lots of company sponsored events every other week; the product design is best in the industry, lots of proud to work here; catered food and the unlimited snacks and drinks are composed of a very organic and healthy selection; and free insurance policy and generous time off. You can come to work with sandals and any time you want.", "cons": "Not sure if I can think of one yet; If I have to name one it would be that people are too funny in hipchat that some are easily get distracted by the links they sent", "advice": "Keep it up."}, {"title": "It used to be so nice. It used to be so good.", "text": "Pros Nice office. Cool workmates. Decent benefits package. Cons Don't let them fool you: they'll trick you into believing that the job of advisor can lead to a fulfilling career within the company. It won't, at least for the large majority. Take the job as it is: a way to pay your bills while having free snacks, before you find your own way outside the company. You'll be working with very smart and talented people, who are in the same hell as you. Seems like a waste of good people? It is, but discussing and trying to change things will only make you the \"troublemaker\". Advice to Management Please, pretty please with cherry on top! Start taking care of people that work hard and well and care about their job despite the lack of recognition. Not only those who tell you what you like to ear.", "rating": 3, "pros": "Nice office. Cool workmates. Decent benefits package.", "cons": "Don't let them fool you: they'll trick you into believing that the job of advisor can lead to a fulfilling career within the company. It won't, at least for the large majority. Take the job as it is: a way to pay your bills while having free snacks, before you find your own way outside the company. You'll be working with very smart and talented people, who are in the same hell as you. Seems like a waste of good people? It is, but discussing and trying to change things will only make you the \"troublemaker\".", "advice": "Please, pretty please with cherry on top! Start taking care of people that work hard and well and care about their job despite the lack of recognition. Not only those who tell you what you like to ear."}]