[{"title": "Mission-driven dynamic company with amazing leadership that empowers personal and professional growth.", "text": "Pros Stash is simplifying peoples financial life and the products (Investments, Retirement, Banking) are fantastic but it's really the people who make this place such an enjoyable place to work. They're passionate and 100% invested in the company. Everyone is down to earth, intelligent, focused, and collaborative. The office offers a great atmosphere and the mission of the company is meaningful. Pros: -Great people! Stash employs high achieving, interesting, intelligent people that are well-balanced and caring. -Employees are encouraged to own work and go after the challenges that are interesting to them. Meaningful initiatives are resourced without friction. -Great work is rewarded. -Casual, fun start-up environment. -The company is doing so well and is the industry-leading \"disrupter\". -Great mission, vision, and monetization strategy. -Incredibly smart and qualified senior management, highly willing to mentor and engage with employees of all levels. Also, the founders are two of the most incredible people I have ever worked with in my career. -HUGE emphasis on educating consumers on their finances. Check out the LEARN section. -Diverse staff across all departments. -ZERO turnover. -Work-life balance. -We move FAST! Cons Some growing pains that often accompany fast-growth companies. Everything can seem very fast paced so it helps to be self-motivated and proactive. Advice to Management -Keep up the good work. -Keep hiring great people.", "rating": 5, "pros": "Stash is simplifying peoples financial life and the products (Investments, Retirement, Banking) are fantastic but it's really the people who make this place such an enjoyable place to work. They're passionate and 100% invested in the company. Everyone is down to earth, intelligent, focused, and collaborative. The office offers a great atmosphere and the mission of the company is meaningful.", "cons": "Some growing pains that often accompany fast-growth companies. Everything can seem very fast paced so it helps to be self-motivated and proactive.", "advice": "-Keep up the good work."}, {"title": "So far so good!", "text": "Pros - Funding: The company is in a very good place with funding right now, since launching about 2 years ago they have already raised their Series C in July 2017 raising their total funding raised to $78.75M. These multiples in this short amount of time is pretty fantastic. In addition to this, they're backed by top tier VCs suchs as Goodwater Capital, Valar Ventures, and Coatue Management who have a solid track record in their investments. The team seems to also have a pretty solid monetization plan going into the long term. All these signs are encouraging, especially at a company this young. - Leadership: For a startup this young I feel that we have a mature leadership team in place, not in a \"stuck-up business person\" kind of way, but they're able to lead by example (with great work ethic and compassionately) and have clearly had a wide range of experiences between them. In regards to the co-founders - they're great, I personally feel they strike a nice balance between business and fun and hope they keep it up. - The Product: We're in NYC and there's a lot of fintech and adtech out there. It's nice to be able to work for a product that doesn't make the rich people richer byt actually helps lower the barrier to investment and financial education for everyday people. Also, it should lead to some extremely interesting challenges when it comes to scaling both on the company side and product side. - Pay & Benefits: Given the stage of the company, we're actually offered fairly competitive salaries and benefits compared to other companies in similar stages. Hopefully they continue to improve! - Diversity: The team overall is fairly diverse across the board. In terms of gender diversity in tech (male, female, non-binary) I think we're around average (or possibly even slightly above average?). As we continue to grow, I'm pretty hopeful that we can improve on our current metrics - actions our leadership has taken have shown they care about fostering an environment that all kinds of people will feel comfortable in. - The people: We have an interesting mix of people from all different companies from agencies, startups, and some major players in the tech space. Everyone is really smart, passionate about the product, and are just fun people - there's such a wide range of personalities on the teams from introverts, ambiverts, extroverts, etc. I've really enjoyed all my colleagues so far! Cons - Processes: Being a fairly young company, we don't have everything figured out yet, there are some processes that need tweaking and some processes that need to be straight up built out. - Work hours: As a high growth startup this is NOT a traditional 9-5. While the company is flexible with the work hours let's be real that as a high growth startup there may be some extra hours put in whether it's in the office or at home. Still, you won't be worked to the bone. The company is in a good place where they can open headcount if there is a proven need especially when teams are getting overwhelmed. In addition to this, I've noticed that we've had several team members with families (with their own children) who are able to manage this - so it is doable. Advice to Management Continue to keep hiring great people and a diverse team. It's really great to see that leadership stays back and hangs out with everyone after happy hours. The only thing I can think of is just to be aware (which for the most part you are) of people who may be facing burnout as it's common during high growth phases of startups. The weekly meetings are great in keeping things transparent and open - so thanks!", "rating": 5, "pros": "- Funding: The company is in a very good place with funding right now, since launching about 2 years ago they have already raised their Series C in July 2017 raising their total funding raised to $78.75M. These multiples in this short amount of time is pretty fantastic. In addition to this, they're backed by top tier VCs suchs as Goodwater Capital, Valar Ventures, and Coatue Management who have a solid track record in their investments. The team seems to also have a pretty solid monetization plan going into the long term. All these signs are encouraging, especially at a company this young.", "cons": "- Processes: Being a fairly young company, we don't have everything figured out yet, there are some processes that need tweaking and some processes that need to be straight up built out.", "advice": "Continue to keep hiring great people and a diverse team. It's really great to see that leadership stays back and hangs out with everyone after happy hours. The only thing I can think of is just to be aware (which for the most part you are) of people who may be facing burnout as it's common during high growth phases of startups. The weekly meetings are great in keeping things transparent and open - so thanks!"}, {"title": "An Incredible Place To Work", "text": "Pros Stash is one of those places where you can walk in and instantly feel the passion, drive, and excitement that each and every employee feels for the company. In any startup, it comes from the top down and our Co-Founders are two of the most genuine people I've ever met. They constantly harp on the mission that every single person here (no matter your age, years of experience, background, etc.) has a voice and you are heard. In addition to the team and culture being amazing, the product is solid. It feels good to know that we're creating something that is helping the underserved American population feel like they have the tools they need to be fiscally responsible. We're not stopping either. We're continuing to iterate on our current product offering and build new products every day. Cons At this point, I haven't come across one con while working at Stash. Advice to Management Continue to keep your standards high when hiring. The culture here is solid and it's important to keep it that way even though we're growing so quickly.", "rating": 5, "pros": "Stash is one of those places where you can walk in and instantly feel the passion, drive, and excitement that each and every employee feels for the company. In any startup, it comes from the top down and our Co-Founders are two of the most genuine people I've ever met. They constantly harp on the mission that every single person here (no matter your age, years of experience, background, etc.) has a voice and you are heard.", "cons": "At this point, I haven't come across one con while working at Stash.", "advice": "Continue to keep your standards high when hiring. The culture here is solid and it's important to keep it that way even though we're growing so quickly."}, {"title": "Best.job.EVER.", "text": "Pros I'm not sure how I'm the first review, because Stash is an incredible place to work! I joined a year ago and can't say I've ever been happier or more fulfilled in a role before. . .and I've been working for over 10 years. As someone who has worked at several startups as well as 5+ established businesses, I can easily speak to what makes Stash a unique place to come to every day. --Our mission: I feel proud coming into work every day, as it feels like we are actually helping humanity through our goal of bringing financial education and literacy to everyone, regardless of income. --Our co-founders: Ed and Brandon are incredible leaders. We have an exciting roadmap for the future, and a level of transparency that I've never been privy to in any of my roles. Additionally, as a woman, I feel completely protected, which seems to be a rarity in tech these days. Our cofounders sent an email out last week in regards to yet another tech CEO who was accused of sexual harassment. Their policy is zero tolerance across the board--use intimidation or make people feel unsafe and you will be terminated. Lastly, they actually invest in our growth through continuing education, training etc. --Our team: we work with an incredible group of passionate, driven, hardworking, team-oriented people who are motivated to win. People are looking for ways to work together, rather than looking for ways to undermine each other. And fun seems to creep into every single thing we do. . .way more than coworkers, my colleagues are my friends --Our trajectory: we are a legit rocket ship right now. Fastest growing investing app in the U.S., over 1M customers and we aren't even 2 years old, we've grown our team by nearly 200% and we've raised rounds A, B and C totaling over $78M in the last 1.5 years. Winning feels good. Cons We move fast, we're growing quickly and we haven't built every process YET. That's simply not for everyone. That said, I don't know anyone who's unhappy here. Advice to Management Keep supporting your people, keep growing them and keep being transparent. We know we are lucky to be a part of Stash!", "rating": 5, "pros": "I'm not sure how I'm the first review, because Stash is an incredible place to work! I joined a year ago and can't say I've ever been happier or more fulfilled in a role before. . .and I've been working for over 10 years. As someone who has worked at several startups as well as 5+ established businesses, I can easily speak to what makes Stash a unique place to come to every day.", "cons": "We move fast, we're growing quickly and we haven't built every process YET. That's simply not for everyone. That said, I don't know anyone who's unhappy here.", "advice": "Keep supporting your people, keep growing them and keep being transparent. We know we are lucky to be a part of Stash!"}]