[{"title": "Cool also for tech", "text": "Pros As a developer: - A very competent product team that helps the dev team focus and listens to feedback - Loose hierarchy, autonomy, we are encouraged to experiment - Modern development practices - Code quality is valued As an employee: - The other reviews are right, awesome work environment Cons Nothing that comes to mind to write here. Advice to Management Keep it up with the openness and the drive to experimentation.", "rating": 5, "pros": "As a developer:", "cons": "Nothing that comes to mind to write here.", "advice": "Keep it up with the openness and the drive to experimentation."}, {"title": "Viel Verantwortung und steile Lernkurve", "text": "Pros - Teamgeist und Arbeitsatmosphäre - Respekt und Umgang - flache Hierarchien - Transparenz - Verantwortung und eigene Projekte Cons - Nutzung des privaten Telefons", "rating": 5, "pros": "- Teamgeist und Arbeitsatmosphäre", "cons": "- Nutzung des privaten Telefons", "advice": null}, {"title": "Wohlfühlatmosphäre im professionellem Umfeld!", "text": "Pros -Transparentes Umfeld -Feedback-Kultur -Spannende Aufgaben -Hohes Entwicklungspotenzial / steile Lernkurve -Professionelles Gründerteam Cons -Schönere Office Einrichtung -Mehr Teamevents -Schwieriger Markt", "rating": 5, "pros": "-Transparentes Umfeld", "cons": "-Schönere Office Einrichtung", "advice": null}, {"title": "Spannendes Geschäftsumfeld mit Weiterentwicklungspotenzial", "text": "Pros Fairness, offenes Feedback, respektvolles Miteinander, Perspektiven Cons Als junges Unternehmen kann store2be selbstverständlich nicht alle denkbaren Mitarbeiter Benefits gewähren", "rating": 5, "pros": "Fairness, offenes Feedback, respektvolles Miteinander, Perspektiven", "cons": "Als junges Unternehmen kann store2be selbstverständlich nicht alle denkbaren Mitarbeiter Benefits gewähren", "advice": null}, {"title": "Tolle Unternehmenskultur & motivierende Aufgaben", "text": "Pros Herausfordernde Aufgaben, Chancen zur Weiterentwicklung und ein hohes Maß an Verantwortung von Anfang an. Cons Es gibt derzeit kein nennenswerten Kontras zu berichten.", "rating": 5, "pros": "Herausfordernde Aufgaben, Chancen zur Weiterentwicklung und ein hohes Maß an Verantwortung von Anfang an.", "cons": "Es gibt derzeit kein nennenswerten Kontras zu berichten.", "advice": null}, {"title": "Das beste Team", "text": "Pros Beste Arbeitskollegen Sehr spannendes Businessmodel Home Office Coole Team-Events Cons Nichts zu sagen - Alles ist super", "rating": 5, "pros": "Beste Arbeitskollegen", "cons": "Nichts zu sagen - Alles ist super", "advice": null}, {"title": "Super Team - super Atmosphäre", "text": "Pros Man wird von Anfang an sehr nett aufgenommen. Die Arbeitsatmosphäre könnte nicht besser sein. Das erfahrene und junge Team ergänzt sich sehr gut! Cons Nichts zu sagen. Absolut empfehlenswert!", "rating": 5, "pros": "Man wird von Anfang an sehr nett aufgenommen. Die Arbeitsatmosphäre könnte nicht besser sein. Das erfahrene und junge Team ergänzt sich sehr gut!", "cons": "Nichts zu sagen. Absolut empfehlenswert!", "advice": null}, {"title": "Bei store2be wird man gefördert und gefordert", "text": "Pros -motiviertes Team -dynmaisches Umfeld -spannende Aufgaben -viel Platz im Büro -gute Atmosphäre -tolle Feedbackkultur Cons -wenige feste Strukturen. Sollte man aber als Bereicherung erleben ;) Advice to Management Visionen in allen Mitarbeitern wecken", "rating": 5, "pros": "-motiviertes Team", "cons": "-wenige feste Strukturen. Sollte man aber als Bereicherung erleben ;)", "advice": "Visionen in allen Mitarbeitern wecken"}, {"title": "Professionelles, engagiertes UND freundliches Gründerteam", "text": "Pros - Teamspirit - lockere Arbeitsatmosphäre - Chefs die sich um die Mitarbeiter kümmern - viel zu lernen - dynamisches Umfeld - super Karriereperspektiven - die eigene Meinung wird sofort gehört Cons - Gehalt noch nicht auf Großkonzern-Niveau Advice to Management Weiter so!", "rating": 5, "pros": "- Teamspirit", "cons": "- Gehalt noch nicht auf Großkonzern-Niveau", "advice": "Weiter so!"}, {"title": "5*-Haus all inclusive", "text": "Pros + flache Hierarchien + starkes Gründerteam + spannendes, innovatives Thema + hohe Verantwortung ab dem ersten Tag + höchstsympathisches Klima und motivierender Teamspirit + offen-konstruktive Diskussionskultur + hochkarätiges Werteniveau Cons - zu meiner Zeit keine Club-Mate-Flatrate im Büro", "rating": 5, "pros": "+ flache Hierarchien", "cons": "- zu meiner Zeit keine Club-Mate-Flatrate im Büro", "advice": null}, {"title": "Nur zu empfehlen!!!", "text": "Pros Sehr motiviertes Team Gute Arbeitsatmosphäre Faire Arbeitszeiten Nette Kollegen Viele Möglichkeiten eigene Ideen einzubringen Spannendes, erfolgsversprechendes Business Model Cons Arbeitsbelastung kann je nach Auftragslage variieren", "rating": 5, "pros": "Sehr motiviertes Team", "cons": "Arbeitsbelastung kann je nach Auftragslage variieren", "advice": null}, {"title": "Praktikum mit hohem Lernpotential, Spaß, Abwechslung & Herausforderung", "text": "Pros Ein Startup, bei dem man viel bewegen kann, eigene Vorschläge willkommen sind und man viel lernt! Man wird gefordert und die Weiterentwicklung der Mitarbeiter steht an oberster Stelle. Die Arbeitsatmosphäre ist super! Top Praktikum!!! Cons Es war ein super Praktikum! Daher keine Kontras. Advice to Management Macht weiter so!", "rating": 5, "pros": "Ein Startup, bei dem man viel bewegen kann, eigene Vorschläge willkommen sind und man viel lernt! Man wird gefordert und die Weiterentwicklung der Mitarbeiter steht an oberster Stelle. Die Arbeitsatmosphäre ist super! Top Praktikum!!!", "cons": "Es war ein super Praktikum! Daher keine Kontras.", "advice": "Macht weiter so!"}]