[{"title": "Perfect place to have your dreams crushed", "text": "Pros Before they fired the entire editorial department, they were a great team to work with. We got beers and pizza on a Friday as a kind of apology for making us work until 8pm. Twice a year there would be social events with terrible food. Cons StoYo media works their employees to the bone. My colleagues were having burn-outs and getting physically sick from working so hard for barely any recognition. I saw sexist, racist and homophobic comments made by and laughed at by multiple employees and management which were very rarely examined. Lots of people were employed under false-pretences, believing they were being hired into a creative company whereas in actual fact, they were being hired to perform robotic, monotonous tasks every day. It felt like the founders had little to no interest in their employees lives, but felt like they already owned a massive corporation, and we were just cogs in their machine. At one point they kept firing people and not telling the rest of the company, so we confronted management and asked if our jobs were safe. They assured us we had nothing to worry about. Less than six months later, they let more than half of the company go, with one months notice. Some people who had worked there for more than a year had to fight for one months pay. I don't believe any of the remaining employees see themselves staying at the company for more than a few more months. Advice to Management Pay your employees equally Stop expecting people to give their entire life to StoYo Bring in some of the perks you promised but never delivered - language classes, yoga etc. Give more than 20 days holiday", "rating": 3, "pros": "Before they fired the entire editorial department, they were a great team to work with.", "cons": "StoYo media works their employees to the bone. My colleagues were having burn-outs and getting physically sick from working so hard for barely any recognition. I saw sexist, racist and homophobic comments made by and laughed at by multiple employees and management which were very rarely examined. Lots of people were employed under false-pretences, believing they were being hired into a creative company whereas in actual fact, they were being hired to perform robotic, monotonous tasks every day. It felt like the founders had little to no interest in their employees lives, but felt like they already owned a massive corporation, and we were just cogs in their machine. At one point they kept firing people and not telling the rest of the company, so we confronted management and asked if our jobs were safe. They assured us we had nothing to worry about. Less than six months later, they let more than half of the company go, with one months notice. Some people who had worked there for more than a year had to fight for one months pay. I don't believe any of the remaining employees see themselves staying at the company for more than a few more months.", "advice": "Pay your employees equally"}, {"title": "Free beer replaces employment policies", "text": "Pros The people in my team - a sense of comradeship really forms friendships! Cons Over 2 years old, the founders still claim 'Startup' status in order to excuse its lack of organisation and responsibility for its workers. When they fired 25 people, no one was surprised. However, their lack of professionalism throughout the process never ceased to surprise me. Many had to challenge them legally, as asking them to follow correct protocols failed. We were disappointed by the process of leaving, but not about leaving the environment. Shortly before, a number of incidents arose of sexual and racial inappropriateness. Before these incidents, an adored team-meeting rhetoric consisted of the 'international diversity' of the team - which was exclusively European, cis-gendered and able-bodied. Advice to Management Young CEOs offering free pizza is not enough for experience Management or for a Cool Berlin Startup", "rating": 1, "pros": "The people in my team - a sense of comradeship really forms friendships!", "cons": "Over 2 years old, the founders still claim 'Startup' status in order to excuse its lack of organisation and responsibility for its workers. When they fired 25 people, no one was surprised. However, their lack of professionalism throughout the process never ceased to surprise me. Many had to challenge them legally, as asking them to follow correct protocols failed.", "advice": "Young CEOs offering free pizza is not enough for experience Management or for a Cool Berlin Startup"}, {"title": "Not all that glitters is gold", "text": "Pros - If you work hard, your efforts are recognised and awarded. As in any startup, hierarchies are kind of flat and there are opportunities to increase your responsibility and/or salary. - The human team used to come from a very creative and diverse background, the mood in the office was really good - even though that has changed recently (more about that on the cons). The company organises a few activities/parties, which are usually good fun. - There's an honest (or so it seems) intention of making things right for workers. Cons - As said, it used to be a creative place. That has changed recently, and now it's definitely a place with a \"business\", \"entrepreneurial\" vibe. This is NOT the right company for someone with a creative drive who expects to come and make revolutionary adverts. - There's a constant official speech about \"how well we do things, how brilliant our project is\" that doesn't match reality 100% and that can be misleading and confusing, because it goes hand in hand with firing lots of people at once, changing strategies, taking decisions and then never making them happen, etc. - You're expected to work MANY hours. Literally. And of course those hours are not paid. - The values of the company come from minds who are mainly male and mainly white. This is not to say there's no diversity in the office (nor that there's discrimination), but if you have a very progressive sensibility, your feelings might be hurt at times by decisions or comments made by some people. - This is not a place one would like to be at for more than two years.", "rating": 3, "pros": "- If you work hard, your efforts are recognised and awarded. As in any startup, hierarchies are kind of flat and there are opportunities to increase your responsibility and/or salary.", "cons": "- As said, it used to be a creative place. That has changed recently, and now it's definitely a place with a \"business\", \"entrepreneurial\" vibe. This is NOT the right company for someone with a creative drive who expects to come and make revolutionary adverts.", "advice": null}, {"title": "Fast growing company but uncertain future", "text": "Pros Young company with a lot of opportunity to do things as you want. Interesting and exciting business. Open atmosphere and office style. Cons Not many benefits or perks compared to other companies. Long working hours normal. Many people being fired or leaving company, fast turn around of employees. No warning of firings and no clarity as to why being have been fired. Answer for trouble in business is to fire someone rather than train them to do a better job. Advice to Management Build up trust again with employees before it is too late. Look into training existing employees rather than firing and then hiring someone new to do the same job you just fired someone for. Decide what the mission of company is so that people are on board and do not need to worry about their future or career.", "rating": 3, "pros": "Young company with a lot of opportunity to do things as you want. Interesting and exciting business. Open atmosphere and office style.", "cons": "Not many benefits or perks compared to other companies. Long working hours normal. Many people being fired or leaving company, fast turn around of employees. No warning of firings and no clarity as to why being have been fired. Answer for trouble in business is to fire someone rather than train them to do a better job.", "advice": "Build up trust again with employees before it is too late. Look into training existing employees rather than firing and then hiring someone new to do the same job you just fired someone for. Decide what the mission of company is so that people are on board and do not need to worry about their future or career."}]