[{"title": "Fun Environment", "text": "Pros Pool table Open fridge Fun events Free wed lunch Training Games Cons Tight deadline High quality standard Advice to Management More space for gaming", "rating": 5, "pros": "Pool table", "cons": "Tight deadline", "advice": "More space for gaming"}, {"title": "Feel good", "text": "Pros Smart, and effective colleagues Can see your contribution Very good friendship Many perks (free food, audible, yoga classes, trainings, gaming, parties) Cons To be honest I can’t say any cons. Just can say there is high pace to keep up. You can’t lie down. Advice to Management Thanks for great parties and activities please keep doing", "rating": 5, "pros": "Smart, and effective colleagues", "cons": "To be honest I can’t say any cons. Just can say there is high pace to keep up. You can’t lie down.", "advice": "Thanks for great parties and activities please keep doing"}, {"title": "Community Engagement Manager", "text": "Pros -Great work culture -Open working environment, not hierarchical Cons -Lack of clear career progression -Lack of development opportunities", "rating": 3, "pros": "-Great work culture", "cons": "-Lack of clear career progression", "advice": null}, {"title": "Great people, exciting future", "text": "Pros Leading company in the industry with latest technology and top-notch talent. Lots of transparency from leadership. Clear roadmap for growth. Lots of international career opportunities. The company is good at owning mistakes and taking action fast. Cons The business flow is complex and needs to be managed well. The management team currently leaves too much space for everyone to figure things out. Some of the chaos that is inherent to fast growth can be managed more tightly. Company still has a flat structure and now is the time to build up mid management. Advice to Management The vision of the company i very exciting. Hire line managers to execute on the vision.", "rating": 5, "pros": "Leading company in the industry with latest technology and top-notch talent.", "cons": "The business flow is complex and needs to be managed well. The management team currently leaves too much space for everyone to figure things out. Some of the chaos that is inherent to fast growth can be managed more tightly. Company still has a flat structure and now is the time to build up mid management.", "advice": "The vision of the company i very exciting. Hire line managers to execute on the vision."}, {"title": "Amazing place to work - please ignore the terrible reviews!", "text": "Pros - Fun dynamic place to work with talented and lovely people - Young company, so a real opportunity to craft your own role and have a say in the company’s direction - Multicultural workforce which is brilliant. To the review who mentioned that the company is racist - please look at the Linkdin profiles of people who work here. I think doing that will prove to you very quickly that the company is far from racist and truly embraces diversity - Being part of something that is truly revolutionising the market research industry Cons - fast paced environment where you need to be flexible. Not necessarily a con, and I think it is great, but not for people who want to take a back seat Advice to Management Keep doing what you are doing!", "rating": 5, "pros": "- Fun dynamic place to work with talented and lovely people", "cons": "- fast paced environment where you need to be flexible. Not necessarily a con, and I think it is great, but not for people who want to take a back seat", "advice": "Keep doing what you are doing!"}, {"title": "Smart, global and growing super fast!", "text": "Pros - Huge brands have joined as clients - Insights come from people from all over the world - Probably the most diverse office in London: even split of male/female, LGBT, and every ethnicity and language under the sun - Smart and fun coworkers who work very hard everyday - Cool location in Old Street - Free breakfast everyday and Wednesday lunches Cons - typical growing pains of a fast-growing startup - the new building still needs some updates, but the office itself is pretty nice - super high expectations, not a perfect fit for everyone Advice to Management Keep hiring great people! Lots of new faces lately, the more the merrier.", "rating": 5, "pros": "- Huge brands have joined as clients", "cons": "- typical growing pains of a fast-growing startup", "advice": "Keep hiring great people! Lots of new faces lately, the more the merrier."}, {"title": "Warning to all - avoid!", "text": "Pros Unfortunately there were very few things that I can recommend about working there. The food on Wednesday lunchtime and the staff, removed from management layer, were good and the old office was quite cool. They also gave out good equipment (macs, phones) Cons I almost lost my mind working here, and it took significant time to recover. This was primarily caused by the CEO, whose actions were at best, horrible, and at worst, downright abusive and bullying. The company is controlled singularly by the CEO and the COO is only there to back her up and force people to do what she says. You will never be given autonomy You will live in fear You will watch interns be shouted at regularly on the floor You will see staff members leave only to be replaced with more interns You and your colleagues will work nights and weekends, only to be told you aren't working hard enough. The CEO even once said that \"If the project isn't done I'll slit my wrists\" to a group of young graduates. Advice to Management Replace yourselves, or surely the investors will.", "rating": 1, "pros": "Unfortunately there were very few things that I can recommend about working there. The food on Wednesday lunchtime and the staff, removed from management layer, were good and the old office was quite cool. They also gave out good equipment (macs, phones)", "cons": "I almost lost my mind working here, and it took significant time to recover.", "advice": "Replace yourselves, or surely the investors will."}, {"title": "Stay away from this place!!", "text": "Pros A good product and intelligent friendly employees. Cons The whole mood of the business is controlled by one person, the CEO, and as soon as she walks through the door in the morning the mood changes and people get scared. There is non-stop fear amongst the employees and it’s such an unhealthy and sad environment, controlled by fear and bullying. The CEO doesn’t understand that people need a life outside of work and expects people to be online 24/7. The bottom line is that she utterly focussed on the detail and control, and lacks all empathy. It’s sad as the business has great potential. Amazing employees are brought on-board to bring the business forward - but they soon realise that everything needs to go via the CEO who micromanages everything. A waste of such great talent. The co-founder's opinion holds no importance to the CEO so don't even bother going to him with any issues….. Advice to Management Relax, breath, trust your employees and threat them with respect.", "rating": 1, "pros": "A good product and intelligent friendly employees.", "cons": "The whole mood of the business is controlled by one person, the CEO, and as soon as she walks through the door in the morning the mood changes and people get scared. There is non-stop fear amongst the employees and it’s such an unhealthy and sad environment, controlled by fear and bullying.", "advice": "Relax, breath, trust your employees and threat them with respect."}, {"title": "Toxic", "text": "Pros I really believed the longterm product roadmap was valuable and well-thought-through. Some of the brightest and nicest staff I’ve worked with. Among non-management, a strong feeling of togetherness in adversity. Cons Short and medium-term strategy utterly lacking, but I reaffirm the longterm plan is good. As has been mentioned in other reviews, the CEO is overbearing. The atmosphere is toxic, no decisions but hers matter and these are taken without input. The result is unfeasible projects being agreed to at too low a price and with too short a timeframe. Staff are expected to abandon all other activities to deliver, but feedback upwards about the business capabilities is ignored. The CEO is personally responsible for all the negative aspects of the business, but is enabled in this by the cofounder who is incapable of providing a moderating influence. Personal abuse is not unheard of, and management repeatedly have inappropriate conversations relating to individual performance loudly on the open floor. This contributes to the poisonous atmosphere. Advice to Management Choose aspects of the business to consciously delegate and stick to it Restrain your selfish impulses to demand the most but offer nothing but bile in return Don’t tell staff that you have a working assumption only 30% of them are worth keeping If you want to post false reviews, best to do it on a workday – it’s more convincing", "rating": 1, "pros": "I really believed the longterm product roadmap was valuable and well-thought-through.", "cons": "Short and medium-term strategy utterly lacking, but I reaffirm the longterm plan is good.", "advice": "Choose aspects of the business to consciously delegate and stick to it"}, {"title": "Not a good place to work", "text": "Pros The product is great. Most of the team is great also. Cons The management is done like we're in the 19th century. It's just the CEO that takes all the decisions. The turnover is constant. The London office feels toxic because of top management's actions. Advice to Management Just take some time off and let the team you hired do the work. I'm pretty sure it will turn out better than now.", "rating": 1, "pros": "The product is great. Most of the team is great also.", "cons": "The management is done like we're in the 19th century. It's just the CEO that takes all the decisions. The turnover is constant. The London office feels toxic because of top management's actions.", "advice": "Just take some time off and let the team you hired do the work. I'm pretty sure it will turn out better than now."}, {"title": "DO NOT WORK HERE!!", "text": "Pros Err, the only pro is that it's near a tube station. There is also loads to do around Old Street/Shoreditch. Cons The CEO, who is the most unpleasant person I've had misfortune to meet/work for. A horrible human being. The atmosphere in the office is toxic. I recently left my role in the sales team and everyone in the team wants the leave. Everyone is totally demotivated and flat. The company won't last. Do not join this company, it's a horrible place to work and it's a sinking ship. Advice to Management Leave", "rating": 1, "pros": "Err, the only pro is that it's near a tube station. There is also loads to do around Old Street/Shoreditch.", "cons": "The CEO, who is the most unpleasant person I've had misfortune to meet/work for. A horrible human being. The atmosphere in the office is toxic. I recently left my role in the sales team and everyone in the team wants the leave. Everyone is totally demotivated and flat. The company won't last. Do not join this company, it's a horrible place to work and it's a sinking ship.", "advice": "Leave"}, {"title": "Toxic environment", "text": "Pros Get to work with an extremely talented pool of international professionals Cons Abusive company. No structure or organisation. The CEO is single handedly taking all of the decisions without the advice of other members. Constant turnover.", "rating": 1, "pros": "Get to work with an extremely talented pool of international professionals", "cons": "Abusive company. No structure or organisation. The CEO is single handedly taking all of the decisions without the advice of other members. Constant turnover.", "advice": null}, {"title": "Great work environment; friendly and enthusiastic people", "text": "Pros Friendly staff Helpful management who are approachable and work with you in effective problem solving manner Great company socials and free lunches regularly provided Cons Work can be demanding at times but expansion is helping with this", "rating": 5, "pros": "Friendly staff", "cons": "Work can be demanding at times but expansion is helping with this", "advice": null}, {"title": "Product Manager", "text": "Pros A truly visionary product. I've been working with Streetbees for over 2 years and it never gets dull. Lots of interesting problems to solve Cutting-edge technology Blue-chip clients And a super focussed management team. Cons Classic challenges of a high growth environment. The job is demanding and requires agility. Fast growth means fast career progress with great compensation! Advice to Management We need to hire faster!", "rating": 5, "pros": "A truly visionary product. I've been working with Streetbees for over 2 years and it never gets dull.", "cons": "Classic challenges of a high growth environment. The job is demanding and requires agility. Fast growth means fast career progress with great compensation!", "advice": "We need to hire faster!"}, {"title": "Community Engagement Manager", "text": "Pros A lot of pros for working for this company Cons Not many cons I can I think of", "rating": 3, "pros": "A lot of pros for working for this company", "cons": "Not many cons I can I think of", "advice": null}, {"title": "Full of promise but no chance of delivering", "text": "Pros The proposition remains a good one Agility to move with market needs Blue ribbon client list Cons The cons like many of the previous posts are built completely around the founders. There are 2 cultures at Streetbees - one when the founders are present and one when they are not. The former unsurprisingly is the dominant one, the latter the better and more productive. I recently read an article describing psychopathic bosses. While I am not an expert in this field I did see enough common traits with the article to get me thinking. I have read many books on building successful teams, businesses, culture, etc and lying to employees and clients is never top of the to do list. Having this as the foundation means that when employees are asked to quite frankly go way above and beyond for the cause they have absolutely no buy in and quickly feel disillusionment and leave. There is a reason almost every senior hire over the past 8 months (plus many mid & junior level) have been and gone. This is currently not a very healthy work environment. Advice to Management Let go of the reigns and place a capable management team in the business to grow it for you", "rating": 1, "pros": "The proposition remains a good one", "cons": "The cons like many of the previous posts are built completely around the founders. There are 2 cultures at Streetbees - one when the founders are present and one when they are not. The former unsurprisingly is the dominant one, the latter the better and more productive. I recently read an article describing psychopathic bosses. While I am not an expert in this field I did see enough common traits with the article to get me thinking. I have read many books on building successful teams, businesses, culture, etc and lying to employees and clients is never top of the to do list. Having this as the foundation means that when employees are asked to quite frankly go way above and beyond for the cause they have absolutely no buy in and quickly feel disillusionment and leave. There is a reason almost every senior hire over the past 8 months (plus many mid & junior level) have been and gone. This is currently not a very healthy work environment.", "advice": "Let go of the reigns and place a capable management team in the business to grow it for you"}, {"title": "Horrible Work Experience_Burn out and bad treatment", "text": "Pros cool team free lunch on wednesday Cons burn out style management with extremely aggressive behaviour from founders working late on weekends (without having food and transportation paid) making fun of people getting fired or leaving on their own Advice to Management stop reading management books and just start applying the advices in it", "rating": 1, "pros": "cool team", "cons": "burn out style management with extremely aggressive behaviour from founders", "advice": "stop reading management books and just start applying the advices in it"}, {"title": "An exciting place to be", "text": "Pros Energetic, fast-paced and creative environment where you have the opportunity to push yourself, learn and excel. Great team of very smart people, who are supportive and help one another. The offer is ground-breaking and the CEO and COO are very passionate and driven to succeed. An exciting place to be. Cons Work load can be challenging at times and you need to be prepared to work hard.", "rating": 5, "pros": "Energetic, fast-paced and creative environment where you have the opportunity to push yourself, learn and excel. Great team of very smart people, who are supportive and help one another. The offer is ground-breaking and the CEO and COO are very passionate and driven to succeed. An exciting place to be.", "cons": "Work load can be challenging at times and you need to be prepared to work hard.", "advice": null}, {"title": "Not so good place", "text": "Pros The other people are good, i liked spending time with them. Lots of intelligence. Always very helpful. Cons The managers of the company aren't good at their jobs and this lead to us working for many weekends at a time. Too much time spent chasing a deadline and not respecting our team. Advice to Management Look after your teams better otherwise many others surely will leave the company and go.", "rating": 3, "pros": "The other people are good, i liked spending time with them. Lots of intelligence. Always very helpful.", "cons": "The managers of the company aren't good at their jobs and this lead to us working for many weekends at a time.", "advice": "Look after your teams better otherwise many others surely will leave the company and go."}, {"title": "Avoid this company", "text": "Pros - Free food once a week. - People Cons - Worst company I have ever worked for. - CEO is a wolf in sheep's clothing. - COO is the CEO's puppy. - CTO another puppy without will. Advice to Management Quit the job.", "rating": 1, "pros": "- Free food once a week.", "cons": "- Worst company I have ever worked for.", "advice": "Quit the job."}, {"title": "Horrendous experience - miserable & thankless", "text": "Pros The only pro is you learn a lot about what not to do across a broad range of areas (people, product, company etc). Cons As several people have mentioned, Streetbees has a massive turnover of employees. Most people leave within 6 months (before their probation ends) and I even saw a few people leave after just a few days! It is a miserable and stressful place to work and so this turnover is not very surprising. The culture at Streetbees is one of fear and intimidation. This fear culture filters through all areas of Streetbees, from product development meetings all the way through to the CEO screaming at the interns on a Wednesday afternoon if the Deliveroo order turns up 1 minute later (literally) than 12:30. As an aside, I have no idea why the CEO goes crazy if the Deliveroo order arrives at 12:31, but she does go mad and watching a powerful CEO scream and shout at a group of interns over something so trivial is not pleasant. The CEO is by the far the worst person I’ve ever worked with and is entirely responsible for the cultural and operational problems at Streetbees. The other co-founder is aware of the issues that exist, but is unable or unwilling to do anything about it. Meanwhile, lots of people continue to leave Streetbees each month and employee morale is always extremely low. Transparency isn’t something that is valued, despite what the founders say. There isn’t anything close to a collaborative or supportive working environment, there is little opportunity for organisational or individual learning and growth and it is absolutely not a fun or fulfilling place to work. Work/life balance is non-existent and project deadlines are ridiculous. You are expected to work late every single evening and on weekends. It got to the point where I felt like I needed to have my laptop with me wherever I went on the weekends, just in case I got that dreaded message from the CEO demanding something immediately. I could go on, but to summarise, working at Streetbees is relentless, miserable, stressful and thankless and my advice would be to avoid at all costs. Advice to Management Contrary to your management philosophy, your people should come first, not last. Your people deserve to be treated with dignity and respect and you should listen to them and value them. Right now, you're literally doing the opposite.", "rating": 1, "pros": "The only pro is you learn a lot about what not to do across a broad range of areas (people, product, company etc).", "cons": "As several people have mentioned, Streetbees has a massive turnover of employees. Most people leave within 6 months (before their probation ends) and I even saw a few people leave after just a few days! It is a miserable and stressful place to work and so this turnover is not very surprising.", "advice": "Contrary to your management philosophy, your people should come first, not last. Your people deserve to be treated with dignity and respect and you should listen to them and value them. Right now, you're literally doing the opposite."}, {"title": "Support Team", "text": "Pros Good clients, given full ownership over large projects, young team Cons Very long hours including frequent weekends, low pay considering", "rating": 5, "pros": "Good clients, given full ownership over large projects, young team", "cons": "Very long hours including frequent weekends, low pay considering", "advice": null}, {"title": "Horrible experience", "text": "Pros Nice offices. Great staff who are skilled, smart and very likeable. Big decisions made and implemented quickly. Cons Toxic treatment of staff that is often disrespectful, aggressive, rude. Absurd deadlines forced on you for no apparent reason, requiring late night, and weekends. Advice to Management Accept you have a deep issue with treatment of staff and fix it by engaging someone who sits above authority of management and who can align everyone including staff behind a plan to change.", "rating": 1, "pros": "Nice offices. Great staff who are skilled, smart and very likeable. Big decisions made and implemented quickly.", "cons": "Toxic treatment of staff that is often disrespectful, aggressive, rude.", "advice": "Accept you have a deep issue with treatment of staff and fix it by engaging someone who sits above authority of management and who can align everyone including staff behind a plan to change."}, {"title": "A terrible experience", "text": "Pros Good product, free lunch on Wednesdays Cons The CEO is the most difficult person I have ever worked with. The rest of the management are fine apart from the stress they receive from the CEO. Advice to Management Leave before you are driven to suicide by the CEO", "rating": 1, "pros": "Good product, free lunch on Wednesdays", "cons": "The CEO is the most difficult person I have ever worked with. The rest of the management are fine apart from the stress they receive from the CEO.", "advice": "Leave before you are driven to suicide by the CEO"}, {"title": "Good work life balance", "text": "Pros A very great and structured place to work.Good work balance,Nice office environment. Cons Very fast pace!! Deadlines have to be met.They don't take \"No\" for an answer!!", "rating": 5, "pros": "A very great and structured place to work.Good work balance,Nice office environment.", "cons": "Very fast pace!! Deadlines have to be met.They don't take \"No\" for an answer!!", "advice": null}, {"title": "Not a happy place to work", "text": "Pros Brand new equipment - high spec touch bar macbook pros, nice open office, fantastic, extremely talented colleagues. Awesome location too. The product has so much potential! Cons Expectations are completely unrealistic. You will be burned out, and there will be nothing you can do about it apart from leaving the company. It feels like the worst of both worlds startup and corporate: insane amounts of stuff to do, dealing with extremely top down hierarchy, micromanagement, and not a lot of sense of security or reward. Startups are lots of hard work: but there is no sense of progress, and a toxic culture around expectation that make hard work at Streetbees unbearable. There is a massive fear culture: and it's hard because you feel like you're not _allowed_ to make mistakes. A lot of startups are about making mistakes and becoming stronger and growing as a business and individuals. In this company mistakes make you fear about your job. Many people left (at one time, it was 1 or 2 per week) because of the pressure, or because of mistakes they made being a cause for their termination. It feels like nobody is happy to be working at Streetbees. It really dampens the morale. Advice to Management The distinct lack of product vision, understanding about technological capabilities and really listening to employees have been the most frustrating things for me. Work on understanding the talents of the brilliant people you have hired, and inspire people to do good work, rather than scaring them into doing it.", "rating": 1, "pros": "Brand new equipment - high spec touch bar macbook pros, nice open office, fantastic, extremely talented colleagues. Awesome location too. The product has so much potential!", "cons": "Expectations are completely unrealistic. You will be burned out, and there will be nothing you can do about it apart from leaving the company.", "advice": "The distinct lack of product vision, understanding about technological capabilities and really listening to employees have been the most frustrating things for me."}]