[{"title": "Dynamic Employer", "text": "Pros - the SumUp community is tight-nit and takes care of their own - independence is encouraged in your work - you are able to have a real impact on the business thanks to a flat hierarchy Cons - embracing the chaos of a startup - you must be a self-starter and able to work independently, little help given otherwise Advice to Management Be available for your team, introduce structure to guide employees through work, and carry on. You're on a meteoric trajectory!", "rating": 5, "pros": "- the SumUp community is tight-nit and takes care of their own", "cons": "- embracing the chaos of a startup", "advice": "Be available for your team, introduce structure to guide employees through work, and carry on. You're on a meteoric trajectory!"}, {"title": "Good people, good product", "text": "Pros Great product, great company and overall amazing people working there. Many things happening all the time, events, new products. great vibe. Cons Don't get fooled by the \"flat hierarchy\" and the \"we care about people\" quotes, that's how they're branding themselves as employers but they won't give a damn especially if you don't want to do extra hours or have a work life balance of yours.", "rating": 3, "pros": "Great product, great company and overall amazing people working there. Many things happening all the time, events, new products. great vibe.", "cons": "Don't get fooled by the \"flat hierarchy\" and the \"we care about people\" quotes, that's how they're branding themselves as employers but they won't give a damn especially if you don't want to do extra hours or have a work life balance of yours.", "advice": null}, {"title": "Good atmosphere but underpaid", "text": "Pros International environment and great colleagues. Cons Understaffed. e.g. CS has to do multiple markets, localization, onboarding with minimum salary. Also holidays are constant issue because there might be nobody else who can do CS for your market. Advice to Management Hire more people to support or increase salaries of people who do several jobs simultaneously. Otherwise your CS turnover will never go down.", "rating": 3, "pros": "International environment and great colleagues.", "cons": "Understaffed. e.g. CS has to do multiple markets, localization, onboarding with minimum salary. Also holidays are constant issue because there might be nobody else who can do CS for your market.", "advice": "Hire more people to support or increase salaries of people who do several jobs simultaneously. Otherwise your CS turnover will never go down."}, {"title": "Great people, challenging technology, and open to feedback", "text": "Pros - Lots of autonomy to try new things. You don't get bogged down in bureaucracy to experiment. - The business progress is very promising - you can believe in the vision of the company and the numbers back it up. - The people are very friendly. There are a lot of social events, which can be really great because the company is very international and a lot of people don't come to Berlin with a network. - On career development -- many reviews say SumUp doesn't support this. Contrarily, if you take control of your own career development, you will find tons of support: the company sponsors visiting conferences, courses, many people from other areas are promoted to new positions in the company. But you need to find your own path and not wait for someone to take over for you. Cons - Communicating with other offices can be challenging - but not more than in other international companies, I believe. But you have to be aware that you work differently when your colleagues are also remote. - You need to be self-directed to succeed here. It's not for everyone, but if it is for you then you will move mountains. Advice to Management - Keep listening and learning.", "rating": 5, "pros": "- Lots of autonomy to try new things. You don't get bogged down in bureaucracy to experiment.", "cons": "- Communicating with other offices can be challenging - but not more than in other international companies, I believe. But you have to be aware that you work differently when your colleagues are also remote.", "advice": "- Keep listening and learning."}, {"title": "Excellent company mindset and great place to work", "text": "Pros Result oriented, startup mindset and way to manage Cons There is not a clear career plan", "rating": 5, "pros": "Result oriented, startup mindset and way to manage", "cons": "There is not a clear career plan", "advice": null}, {"title": "SumUP - Great place to work !", "text": "Pros - Freedom to learn new technology. - Nice and Friendly work colleagues. - Great work environment. - Of Sites and team building events Cons Not much of Automation process used. More frequent performance evaluation and reviews Advice to Management Great Management Team, Always open to new ideas and opinions.", "rating": 5, "pros": "- Freedom to learn new technology.", "cons": "Not much of Automation process used.", "advice": "Great Management Team, Always open to new ideas and opinions."}, {"title": "Software Engineer", "text": "Pros good product with high potential Cons bad management and overall atmosphere", "rating": 3, "pros": "good product with high potential", "cons": "bad management and overall atmosphere", "advice": null}, {"title": "Employee", "text": "Pros Great place if you are curious about payments. The company is making great progress. Cons The recent merger with Payleven has been a serious bump for the employees from both companies. There is no career ladder, you only do what you are hired for. Advice to Management Take it less serious. As before the merger.", "rating": 5, "pros": "Great place if you are curious about payments. The company is making great progress.", "cons": "The recent merger with Payleven has been a serious bump for the employees from both companies.", "advice": "Take it less serious. As before the merger."}, {"title": "Amazing company, and great people", "text": "Pros - Management is completely open minded and considers input from everyone - The tech is nice to work with, and for the most part, structured/clean - Great office in a good location, lots of natural lighting and open floor plan - Multinational team - Technical decisions live in tech, not business or marketing - The company is still rather small, so you have the opportunity to make an impact on vision, goals, etc - Flat hireachy that's actually flat Cons - The engineering team is split between mutiple offices, which makes collaboration slightly challenging at times, especially for someone new to the codebase - Equipment provided to perform job related tasks (MacBook & accessories, external display) isn't in the best condition - In some areas, notably IT (not engineering), it's difficult to get responses and help when needed. Advice to Management Keep going, keep improving, and let's do this", "rating": 5, "pros": "- Management is completely open minded and considers input from everyone", "cons": "- The engineering team is split between mutiple offices, which makes collaboration slightly challenging at times, especially for someone new to the codebase", "advice": "Keep going, keep improving, and let's do this"}, {"title": "Good company", "text": "Pros Great company culture. Great people. Management cares about you and if you have complains they will be listened. Cons Depending on the department, there might be a lot of collaboration with people that work remotely and this can be very frustrating.", "rating": 5, "pros": "Great company culture. Great people. Management cares about you and if you have complains they will be listened.", "cons": "Depending on the department, there might be a lot of collaboration with people that work remotely and this can be very frustrating.", "advice": null}, {"title": "Interesting experience", "text": "Pros Great product and vision, multinational team Cons Poor management, noisy environment and chaotic communication Advice to Management Improve transparency, more trust and freedom to employees.", "rating": 3, "pros": "Great product and vision, multinational team", "cons": "Poor management, noisy environment and chaotic communication", "advice": "Improve transparency, more trust and freedom to employees."}, {"title": "It was an experience", "text": "Pros The team I worked with in Dublin were great, as were a handful of people from the other locations. Cons Poorly managed, in particular the Berlin office. Advice to Management Put experienced engineers in charge of important projects.", "rating": 1, "pros": "The team I worked with in Dublin were great, as were a handful of people from the other locations.", "cons": "Poorly managed, in particular the Berlin office.", "advice": "Put experienced engineers in charge of important projects."}, {"title": "Tolle Atmosphäre / Teamklima / Wachstumspotenzial", "text": "Pros - Sehr internationales, ambitioniertes und aufgeschlossenes Team - Wachstumspotenzial der Firma ist enorm, was persönliche Entwicklungs- und Entfaltungsmöglichkeiten mit sich bringt - Work-Life-Balance stimmt - Flache Hierarchie: eigene Vorschläge wurden vom Management immer berücksichtigt und ggf. umgesetzt Cons - Abstimmung zwischen Departments könnte noch verbessert werden (Startup-Kultur)", "rating": 5, "pros": "- Sehr internationales, ambitioniertes und aufgeschlossenes Team", "cons": "- Abstimmung zwischen Departments könnte noch verbessert werden (Startup-Kultur)", "advice": null}, {"title": "Tolle Atmosphäre", "text": "Pros SumUp besteht aus einem sehr motivierten, netten, jederzeit hilfsbereiten und familiären Team. Es herrscht eine sehr flache Hierarchie. Die Geschäftsführung hat ein offenes Ohr für die Mitarbeiter. Außerdem bekommen auch Berufseinsteigern die Chance, sich zu entwickeln. Für Mitarbeiter gibt es kostenloses Obst, Kaffee, Kekse und vieles mehr. Außerdem findet alle zwei Wochen ein großes Frühstück statt. Cons Man kann es vielleicht als Nachteil sehen, dass man Englisch beherrschen sollte, da die Kommunikation, aufgrund der Internationalität des Unternehmens, hauptsächlich auf Englisch stattfindet.", "rating": 5, "pros": "SumUp besteht aus einem sehr motivierten, netten, jederzeit hilfsbereiten und familiären Team. Es herrscht eine sehr flache Hierarchie. Die Geschäftsführung hat ein offenes Ohr für die Mitarbeiter. Außerdem bekommen auch Berufseinsteigern die Chance, sich zu entwickeln.", "cons": "Man kann es vielleicht als Nachteil sehen, dass man Englisch beherrschen sollte, da die Kommunikation, aufgrund der Internationalität des Unternehmens, hauptsächlich auf Englisch stattfindet.", "advice": null}, {"title": "Zufrieden", "text": "Pros Intarnational, freundlich, jung, frisch, gut ausgestattet, nette leute, angenehme atmosphähre, alles auf englisch, möglichkeiten zu anderen bueros zu reisen, kompetente mittarbeiter, freie arbeitszeiten Cons teilweise stressige fristen und unbezahlte ueberstunden, viele der kommunikation nur ueber webcam oder telefon, viele meetings Advice to Management grundsaetzlich kann ich nur sagen - macht weiter so. das unternehmen hat viel potenzial und wenn das management weiter so arbeitet wird es meiner meinung nach auch ihre ziele erreichen", "rating": 5, "pros": "Intarnational, freundlich, jung, frisch, gut ausgestattet, nette leute, angenehme atmosphähre, alles auf englisch, möglichkeiten zu anderen bueros zu reisen, kompetente mittarbeiter, freie arbeitszeiten", "cons": "teilweise stressige fristen und unbezahlte ueberstunden, viele der kommunikation nur ueber webcam oder telefon, viele meetings", "advice": "grundsaetzlich kann ich nur sagen - macht weiter so. das unternehmen hat viel potenzial und wenn das management weiter so arbeitet wird es meiner meinung nach auch ihre ziele erreichen"}, {"title": "Naja, Startup halt", "text": "Pros Aufregendes Geschäft in einem Zukunftsmarkt Viele Engagierte Mitarbeiter, mit denen die Zusammenarbeit Spaß macht Kostenlose Getränke und Frühstück Cons Kommunikation des Managements lässt zu wünschen übrig Man ist bei der Arbeit sehr auf seinen eigenen Bereich beschränkt Vergütung ist unterdurchschnittlich für die Arbeit, die man macht Firma kümmert sich nur bedingt um das Wohl der Mitarbeiter Advice to Management Mitarbeitern mehr Autonomie und Vertrauen geben Strategische Entscheidungen besser und vor allem offener kommunizieren Ein Umfeld aufbauen, in dem man gerne arbeitet, nicht nur wegen der coolen Leute", "rating": 1, "pros": "Aufregendes Geschäft in einem Zukunftsmarkt", "cons": "Kommunikation des Managements lässt zu wünschen übrig", "advice": "Mitarbeitern mehr Autonomie und Vertrauen geben"}, {"title": "Einzigartige Kultur, großes Wachstumspotenzial!", "text": "Pros Super Team Zusammenhalt Internationale Kollegen in Berlin und in weltweiten Offices Weltklasse Gründer & CEO, Daniel Klein Tolles Produkt Fuehrende Technologie im Payments Bereich Zufriedene Kunden Fortlaufend internationale Expansion Kaum Konkurrenz im Zielsegment Cons Vergleichsweise lange Entwicklungszyklen aufgrund komplexer Technologie und Regulierung", "rating": 5, "pros": "Super Team Zusammenhalt", "cons": "Vergleichsweise lange Entwicklungszyklen aufgrund komplexer Technologie und Regulierung", "advice": null}, {"title": "Tolles Arbeitsklima", "text": "Pros Tolles Arbeitsklima, interessante und vielseitige Aufgaben. Cons Kommunikations-/Sprachbarrieren mit Kollegen im Ausland, schwere Abstimmung Advice to Management Stärkt das tech Team", "rating": 5, "pros": "Tolles Arbeitsklima, interessante und vielseitige Aufgaben.", "cons": "Kommunikations-/Sprachbarrieren mit Kollegen im Ausland, schwere Abstimmung", "advice": "Stärkt das tech Team"}, {"title": "Back-End-Entwickler", "text": "Pros Gut gelegenes Büro im Herzen von Berlin Nicely located office in the heart of Berlin Cons 1. Lausiges Management und Projektmanager 2. Keine Transparenz, die darlegte, dass die Gründer beschlossen hatten, das Büro in Dublin ohne Vorwarnung zu schließen 3. Gründer respektieren die Angestellten nicht 4. Das Büro in Sofia übernahm alles und sie kommunizierten dürftig 1. Poor management and project managers 2. No transparency that extended that the founders decided to close the Dublin office without any heads up 3. Founders don't respect employees 4. Sofia office taking over everything and they poorly communicate", "rating": 1, "pros": "Gut gelegenes Büro im Herzen von Berlin", "cons": "1. Lausiges Management und Projektmanager", "advice": null}]