[{"title": "Overall good experience", "text": "Pros You can win free prizes when you meet targets Cons A lot of pressure to meets targets", "rating": 5, "pros": "You can win free prizes when you meet targets", "cons": "A lot of pressure to meets targets", "advice": null}, {"title": "Superdrug Review", "text": "Pros - A fun place to work and is ideal for students. - Excellent training and support provided. - Self-development and career progression encouraged for long-term workers. - Understanding attitude towards students needs and very flexible. - Staff discount card available. Cons - As with many shop assistant roles, expect to work weekends.", "rating": 5, "pros": "- A fun place to work and is ideal for students.", "cons": "- As with many shop assistant roles, expect to work weekends.", "advice": null}, {"title": "Team Leader - Good Experience", "text": "Pros Climb up the ladder easily Cons low pay, long hours", "rating": 5, "pros": "Climb up the ladder easily", "cons": "low pay, long hours", "advice": null}, {"title": "Good and helpful, learnt a lot", "text": "Pros Good discounts when promotions, learnt a lot Cons Managers can be grumpy and on a power trip", "rating": 5, "pros": "Good discounts when promotions, learnt a lot", "cons": "Managers can be grumpy and on a power trip", "advice": null}, {"title": "miss", "text": "Pros The environment is friendly and i have wonderful colleges to ask for help Cons there is nothing bad about it. Advice to Management carry on with the amazing job.", "rating": 5, "pros": "The environment is friendly and i have wonderful colleges to ask for help", "cons": "there is nothing bad about it.", "advice": "carry on with the amazing job."}, {"title": "Extras better than the job", "text": "Pros - Nice office - Informal - Fun/lots going on socially - Great benefits Cons - Role specific training isn’t great - Poor communication from management about what is expected and changing priorities Advice to Management Invest more in training to have efficient and happy staff", "rating": 3, "pros": "- Nice office", "cons": "- Role specific training isn’t great", "advice": "Invest more in training to have efficient and happy staff"}, {"title": "superdrug review", "text": "Pros friendly place to work and nice people. Cons I was only meant to work one day a week as I was a student at the time but i was made to work more than my contracted hours every week. If i told them i was unable to i was told that it was up to me to get it covered when I wasn't meant to be working that day in the first place. The pay was awful too.", "rating": 3, "pros": "friendly place to work and nice people.", "cons": "I was only meant to work one day a week as I was a student at the time but i was made to work more than my contracted hours every week. If i told them i was unable to i was told that it was up to me to get it covered when I wasn't meant to be working that day in the first place. The pay was awful too.", "advice": null}, {"title": "sales advisor", "text": "Pros good people to work with some nice customers Cons Long hours terrible management rubbish pay too involved in targets and not caring about staff Advice to Management get training on how to treat your staff better", "rating": 3, "pros": "good people to work with", "cons": "Long hours", "advice": "get training on how to treat your staff better"}, {"title": "Good career builder", "text": "Pros Easy to move up and opportunities for promotion Cons Long hours, no overtime pay", "rating": 5, "pros": "Easy to move up and opportunities for promotion", "cons": "Long hours, no overtime pay", "advice": null}, {"title": "Sales advisor - do not recommend", "text": "Pros The discount is pretty decent. Also, you get to spray tester perfumes as much as you like so my clothes always smelled nice. I met about three or four lovely people there who deserve better work. Cons Absolutely horrendous. There’s a bullying culture present within the store with all the swearing, name-calling and whispering behind people’s backs. Constant gossip amongst senior members of staff that makes you feel on edge whenever they’re grouped together talking. There were rumoured numerous complaints about certain managers because of this, although of course you still had to put up with it because of the fear culture and their inability to speak to you like you’re a fellow adult. Ridiculous expectations for sales assistants. If you didn’t comply with the same number of questions for EVERY transaction on the till you’d get called out. It always had to be in the same order too. If you didn’t ask EVERYONE if they wanted a bag for one eyebrow pencil or a packet of tissues, that was a fault of yours. Constant pushing of Star Buys, even if somebody was in a rush. You had to ask EVERY CUSTOMER if they wanted Britney Spears perfume or else you’d all get into trouble. Penalties for sick days. Rumours amongst management about people calling in sick when they weren’t actually, but, of course, they didn’t ever do anything and just acted a little bit meaner towards the poor sods in question. Rumours about pretty much everything, actually. To top it all off, awful pay whilst you’re treated like a child and talked down to. I do not recommend being a sales assistant here to anyone. Advice to Management Be nice. Treat your employees, especially younger ones, like adults with agency, not schoolchildren you have to discipline.", "rating": 1, "pros": "The discount is pretty decent. Also, you get to spray tester perfumes as much as you like so my clothes always smelled nice. I met about three or four lovely people there who deserve better work.", "cons": "Absolutely horrendous. There’s a bullying culture present within the store with all the swearing, name-calling and whispering behind people’s backs. Constant gossip amongst senior members of staff that makes you feel on edge whenever they’re grouped together talking. There were rumoured numerous complaints about certain managers because of this, although of course you still had to put up with it because of the fear culture and their inability to speak to you like you’re a fellow adult.", "advice": "Be nice. Treat your employees, especially younger ones, like adults with agency, not schoolchildren you have to discipline."}, {"title": "You Get Out What You Put In", "text": "Pros A company that engages with their people, supports development, and most importantly allows you to put your own stamp and personality on your role - you're not expected to be a company robot... The company culture is fun, fast paced and exciting Discount and benefits are good Great team environment with support from your colleagues when needed, but also the trust to be a leader without being \"micromanaged\" If you are driven and passionate, and prepared to put the work in, you are acknowledged and respected. My whole career has been in retail, and this is the best company I've worked for. Cons Retail is a fast paced, tough and often stressful career choice, but it's exactly that - a choice. I can't believe that anyone would expect to be a successful Store Manager in the current climate working 39 hours per week, and yes, the company expect their managers to work over and above to get the job done, but that's made very clear, and if it's not something you are happy with, then don't sign the contract!!! There can be a heavy pressure at times to sell Star Buys and sign up Loyalty cards, particularly in smaller stores with a more regular community customer base, and it is not always helped by the Star Buy offers at times being quite repetitive - it's not always new products every week, which can make for a hard sell. Again though, if you do your research before joining the company, you will know that this is one of the challenges, and you accept it. Advice to Management Develop the Star Buy offer - when there's good products on, it's a breeze - when the offer is not as good it can be really tough!!", "rating": 5, "pros": "A company that engages with their people, supports development, and most importantly allows you to put your own stamp and personality on your role - you're not expected to be a company robot...", "cons": "Retail is a fast paced, tough and often stressful career choice, but it's exactly that - a choice. I can't believe that anyone would expect to be a successful Store Manager in the current climate working 39 hours per week, and yes, the company expect their managers to work over and above to get the job done, but that's made very clear, and if it's not something you are happy with, then don't sign the contract!!!", "advice": "Develop the Star Buy offer - when there's good products on, it's a breeze - when the offer is not as good it can be really tough!!"}, {"title": "awful", "text": "Pros some good colleagues and customers good discount Cons long hours often asked to stay late never get paid correct active selling is a major focus no time off near Christmas Advice to Management pay your staff correctly give them more time off around the holidays to spend with family", "rating": 1, "pros": "some good colleagues and customers good discount", "cons": "long hours often asked to stay late never get paid correct active selling is a major focus no time off near Christmas", "advice": "pay your staff correctly give them more time off around the holidays to spend with family"}, {"title": "No appreciation for team leaders", "text": "Pros 30% off exclusive items Good stepping stone to get into management Cons Only 10% branded - students sometimes get more than staff when they do 20% discount Team leaders are given no appreciation until management need them to run the store or cover their lunches 12 hour contracts Poor pay- 50p more than a sales advisor over 25 Very long days with little breaks Advice to Management Show team leaders more appreciation and pay more to compete with other retailers", "rating": 1, "pros": "30% off exclusive items", "cons": "Only 10% branded - students sometimes get more than staff when they do 20% discount", "advice": "Show team leaders more appreciation and pay more to compete with other retailers"}, {"title": "Not much room for development", "text": "Pros Good work/life balance Nice atmosphere to work in Cons Lack of opportunities to progress Long-winded appraisal system Advice to Management Don't promise career progression and development if you can't deliver it", "rating": 3, "pros": "Good work/life balance", "cons": "Lack of opportunities to progress", "advice": "Don't promise career progression and development if you can't deliver it"}, {"title": "superdrug", "text": "Pros discount is really good, even though it firstly seems like it wouldn't be that much discount off. The other staff make it really fun, and its very team based. Good chance of progression and mobility within your area if that's what you want. Cons can be boring when its not busy and very repetitive, management can be difficult about getting holidays off and things like that which is annoying.", "rating": 3, "pros": "discount is really good, even though it firstly seems like it wouldn't be that much discount off. The other staff make it really fun, and its very team based. Good chance of progression and mobility within your area if that's what you want.", "cons": "can be boring when its not busy and very repetitive, management can be difficult about getting holidays off and things like that which is annoying.", "advice": null}, {"title": ".", "text": "Pros Good environment nice people benefits Cons Hard work bad pay commitment", "rating": 3, "pros": "Good environment nice people benefits", "cons": "Hard work bad pay commitment", "advice": null}, {"title": "alright", "text": "Pros flexible hours pay was decent Cons very repetitive, always doing the same job managers weren't great Advice to Management better communication", "rating": 3, "pros": "flexible hours", "cons": "very repetitive, always doing the same job", "advice": "better communication"}, {"title": "customer advisor", "text": "Pros good discount on exclusive products (30%) Cons management are rude bad pay don't get appreciated even though i was contracted to 20 hours, some weeks i were given less hours. Meaning i couldn't pay my expenses Advice to Management treat your employees better (a team leader once hit me)", "rating": 3, "pros": "good discount on exclusive products (30%)", "cons": "management are rude", "advice": "treat your employees better"}, {"title": "Great Office", "text": "Pros Head office is lively and bubbly, clean and well looked after. Cons Discount could be better. Advice to Management Keep up the good work.", "rating": 5, "pros": "Head office is lively and bubbly, clean and well looked after.", "cons": "Discount could be better.", "advice": "Keep up the good work."}, {"title": "Rude management, family unfriendly rota", "text": "Pros The only good thing in working there is some nice customers and team, you have discount card as well and Cons Too much to say: rude management, not suitable if you have family, unpaid overtime, do not follow contract, being unfair, requires overtime, do not give days off, problem to book holidays and do not give an answer up to week before your planned holidays without giving explanation, giving you holidays without asking (all suddenly you off for a week, but getting paid from holiday) Advice to Management Listen to your staff needs, be polite we doing our best", "rating": 3, "pros": "The only good thing in working there is some nice customers and team, you have discount card as well and", "cons": "Too much to say: rude management, not suitable if you have family, unpaid overtime, do not follow contract, being unfair, requires overtime, do not give days off, problem to book holidays and do not give an answer up to week before your planned holidays without giving explanation, giving you holidays without asking (all suddenly you off for a week, but getting paid from holiday)", "advice": "Listen to your staff needs, be polite we doing our best"}, {"title": "Overall fine", "text": "Pros Good staff discount Get to talk to customers about makeup/cosmetics Most of staff team get along well Not stressful work Good breaks for longer shifts (2x 15 minutes, 1x 60 minutes) Cons Management keep most hours for themselves Not a lot of hours Mostly till work Short breaks for most shifts (15 minutes)", "rating": 5, "pros": "Good staff discount", "cons": "Management keep most hours for themselves", "advice": null}, {"title": "Good environment", "text": "Pros Good people to work with Cons not really much options for career", "rating": 5, "pros": "Good people to work with", "cons": "not really much options for career", "advice": null}, {"title": "sales advisor", "text": "Pros benefits, good staff, easy, job opportunities Cons boring not much to do rude customers Advice to Management non", "rating": 3, "pros": "benefits, good staff, easy, job opportunities", "cons": "boring", "advice": "non"}, {"title": "Insensitive Work Place", "text": "Pros Discount card, cruelty-free products, socialising. Cons Terrible management, unfair/too short breaks, racism in the workplace, insensitivity from managers, bad training, not even allowed a bottle of water behind till (very hot space to work in). Join Superdrug if you want to be exploited and anxious. Advice to Management Stop making racist/insensitive remarks. Learn to properly manage your employees. Genuinely actually be a decent person - we're not slaves/numerical values you can exploit.", "rating": 1, "pros": "Discount card, cruelty-free products, socialising.", "cons": "Terrible management, unfair/too short breaks, racism in the workplace, insensitivity from managers, bad training, not even allowed a bottle of water behind till (very hot space to work in). Join Superdrug if you want to be exploited and anxious.", "advice": "Stop making racist/insensitive remarks. Learn to properly manage your employees. Genuinely actually be a decent person - we're not slaves/numerical values you can exploit."}, {"title": "Warehouse", "text": "Pros Good community, nice people, overtime opportunity, training Cons Badly organized, shortsighted, unprofessional mentality Advice to Management More serious planning, improvements, investing in people", "rating": 3, "pros": "Good community, nice people, overtime opportunity, training", "cons": "Badly organized, shortsighted, unprofessional mentality", "advice": "More serious planning, improvements, investing in people"}, {"title": "Okay", "text": "Pros Quite flexible hours and easy Cons Poor salary, management, boring, no room for growth", "rating": 3, "pros": "Quite flexible hours and easy", "cons": "Poor salary, management, boring, no room for growth", "advice": null}, {"title": "Cashier at Victoria Station in London", "text": "Pros 30% discount on Superdrug label products and 10% discount on brands, even if that product is already discounted. Nothing else. Cons Very repetitive job. All day scanning items, pushing fidelity cards and perfumes on sale (without any rewards, just the glory). 8 hours with included 30 min of paid break, but too often was asked me to stay longer or to work on a day I was supposed to be off. Very small stockroom where having the break sit on a dirty stair Advice to Management Better working conditions and more rewards in order to stimulate the employees", "rating": 3, "pros": "30% discount on Superdrug label products and 10% discount on brands, even if that product is already discounted.", "cons": "Very repetitive job. All day scanning items, pushing fidelity cards and perfumes on sale (without any rewards, just the glory). 8 hours with included 30 min of paid break, but too often was asked me to stay longer or to work on a day I was supposed to be off. Very small stockroom where having the break sit on a dirty stair", "advice": "Better working conditions and more rewards in order to stimulate the employees"}, {"title": "Fast paced and not rewarding", "text": "Pros Friendly environment and a calm working hours. Cons Wages are poor and progress is not rewarded. Advice to Management Increase payment to staff", "rating": 3, "pros": "Friendly environment and a calm working hours.", "cons": "Wages are poor and progress is not rewarded.", "advice": "Increase payment to staff"}, {"title": "Long hours and no rewards", "text": "Pros An ok career progression structure Staff discount Cons Minimum or low wage Low hours contracts Constant pressure and unrealistic targets Minimal security - this is left for staff to stop shoplifters and staff are not trusted and searched every time they leave the store No reward when active selling products Advice to Management Management are fully aware that a lot of hard working store managers/assistant managers will skip breaks and work voluntary hours to keep up with targets. Theres no allowance to pay overtime. Management need to deal with this problem and start paying and appreciating these staff which go the extra mile.", "rating": 3, "pros": "An ok career progression structure", "cons": "Minimum or low wage", "advice": "Management are fully aware that a lot of hard working store managers/assistant managers will skip breaks and work voluntary hours to keep up with targets. Theres no allowance to pay overtime. Management need to deal with this problem and start paying and appreciating these staff which go the extra mile."}, {"title": "Sales Advisor", "text": "Pros Good for students. People who work there are most friendly. Cons Long hours, management is soooooooooo unorganised they need to fix up Advice to Management Needs to be more organsied", "rating": 3, "pros": "Good for students. People who work there are most friendly.", "cons": "Long hours, management is soooooooooo unorganised they need to fix up", "advice": "Needs to be more organsied"}, {"title": "Exploitative", "text": "Pros NONE. Had the loveliest manager but that’s him as a person. Superdrug is a billion£ company but can only pay their staff minimum wage? Cons Worst pay of £5 for being on your feet for nearly 10 hours, and having to wear ‘smart’ yet uncomfortable shoes. Stores are old and dirty - you’re expected to clean the dirt that’s built up over the year. Systems are slow and so stuck up middle class city workers of the ethnic majority.. love to tap their fingers and look at staff as though they’re stupid. Only good thing was I kept on getting overpaid each month haha. Advice to Management Not the store management. But the executives - your all hungry capitalist men.", "rating": 1, "pros": "NONE. Had the loveliest manager but that’s him as a person. Superdrug is a billion£ company but can only pay their staff minimum wage?", "cons": "Worst pay of £5 for being on your feet for nearly 10 hours, and having to wear ‘smart’ yet uncomfortable shoes. Stores are old and dirty - you’re expected to clean the dirt that’s built up over the year. Systems are slow and so stuck up middle class city workers of the ethnic majority.. love to tap their fingers and look at staff as though they’re stupid. Only good thing was I kept on getting overpaid each month haha.", "advice": "Not the store management. But the executives - your all hungry capitalist men."}, {"title": "Store Manager", "text": "Pros Employee discount scheme and prizes of competitions (if ever you can win) Cons Do not trust employees. Expect sun & moon form Store managers. contract 39hrs, work exceeding 55hrs. Good not appreciated, bad punished. Advice to Management Incorporate \"sensibility\" in to the corporate plan. Have a forum to listen to what is happening at the Store Manager level.", "rating": 1, "pros": "Employee discount scheme and prizes of competitions (if ever you can win)", "cons": "Do not trust employees. Expect sun & moon form Store managers. contract 39hrs, work exceeding 55hrs. Good not appreciated, bad punished.", "advice": "Incorporate \"sensibility\" in to the corporate plan. Have a forum to listen to what is happening at the Store Manager level."}, {"title": "Working at superdrug", "text": "Pros Good progression in terms of becoming team leader etc. A lot of motivation and new skills to learn too Cons Poor pay, too much focus on active selling makes it an unhappy place to work sometimes Advice to Management Hire security guards rather than expecting sales advisors to do 10 jobs in one", "rating": 3, "pros": "Good progression in terms of becoming team leader etc. A lot of motivation and new skills to learn too", "cons": "Poor pay, too much focus on active selling makes it an unhappy place to work sometimes", "advice": "Hire security guards rather than expecting sales advisors to do 10 jobs in one"}, {"title": "beauty expert", "text": "Pros friendly team, good support Cons some managers rude and un helpful, power hungry can feel unfairly treated as managers have favourites but isn't that with a lot of jobs. Good for a first job", "rating": 5, "pros": "friendly team, good support", "cons": "some managers rude and un helpful, power hungry can feel unfairly treated as managers have favourites but isn't that with a lot of jobs. Good for a first job", "advice": null}, {"title": "Team Leader", "text": "Pros Plenty of hours, more responsibility than Sales Advisors, Excellent courses for Team Leaders/Assistant Managers etc Cons Not much praise given for a job well done", "rating": 5, "pros": "Plenty of hours, more responsibility than Sales Advisors, Excellent courses for Team Leaders/Assistant Managers etc", "cons": "Not much praise given for a job well done", "advice": null}, {"title": "Eye opening", "text": "Pros I have made long life friends Great as a first job but hardly a career Cons Corrupt management bullying from managment no progression unless you are liked by managment Advice to Management Power trips dont work Bullying doesnt work Be firm but fair Lead by example and your team will follow", "rating": 1, "pros": "I have made long life friends", "cons": "Corrupt management bullying from managment no progression unless you are liked by managment", "advice": "Power trips dont work"}, {"title": "Good environment can be stressful", "text": "Pros Great environment and lovely team Cons Can be stressful at times Advice to Management Keep up to good work", "rating": 5, "pros": "Great environment and lovely team", "cons": "Can be stressful at times", "advice": "Keep up to good work"}, {"title": "Store Manager Leeds area", "text": "Pros Hard to find any really. Joined the company to manage a Leeds city centre branch. Salary is competitive with other companies...that about the only positive. Cons 49 hours a week is more like 60 hours in reality. Worst week was 68 hours. Teams tend to be really close knit and unwelcoming to outsiders. All self serving and out for themselves. They’d give the Romans a run for their money. Advice to Management More work life balance. Create a team culture rather than reward self servers", "rating": 1, "pros": "Hard to find any really. Joined the company to manage a Leeds city centre branch. Salary is competitive with other companies...that about the only positive.", "cons": "49 hours a week is more like 60 hours in reality. Worst week was 68 hours. Teams tend to be really close knit and unwelcoming to outsiders. All self serving and out for themselves. They’d give the Romans a run for their money.", "advice": "More work life balance. Create a team culture rather than reward self servers"}, {"title": "Absolutely horrible!", "text": "Pros Literally none. If I could leave less stars for management, I would. Superdrug tries to brainwash their staff into believing they are a part of something great. Cons - you're expected to stay longer for free. Management is not happy when you refuse - awful area manager - you're expected to constantly upsell and register beauty cards, yet bonuses are only for management, you get nothing - try to make you work when you're sick - management lie about you're responsibility. Try to make you to come to work when you're really sick and lie that you need a fit note for sickness longer than 3 day (legally it's 7 days). One of my colleagues came in and was vomitting during a shift, because she was told she needed a note from her GP. - Try to stop you from going to toilet or drinking, not happy when you stand your ground - management lies and abuses their power - you literally get no training, except \"training videos\", yet you're expected to know things that aren't there. - promo change is absolutely absurd. Management gets angry if you don't want to stay beyond your scheduled time, even though you do not get paid for it. - management sits in the office all day and gets angry when needed on the shop floor - managers expect you to work 13 days straight and get angry when you say you won't - split shifts - rubish discount. You get 10% off. The same as student discount. Student discount is 20% every now and then, so you are getting less discounts than people who do not work for superdrug. - Team time. You have to come in for an hour and listen to your manager read notes that were send from headquarters. I couldn't care less how much profit Superdrug made last year. They still pay their staff minimum wage. - Constantly understaffed. - Not enough staff, cutting hours yet responsibilities grow every year. - management is not happy when you take full 1 hour lunch break (not paid 1 hour break when you work 9 hours). Try to persuade you into not taking a break and working for that hour, even though, you don't get paid. Advice to Management - You need to train your management and stuff better - You need to make sure that the management know the law and don't lie to staff about it. Expecting fit note for 3 day sickness is ridiculous and no gp wants to supply one. Expecting someone to come to work when they are vomiting is absolutely horrible and should not happen.", "rating": 1, "pros": "Literally none. If I could leave less stars for management, I would. Superdrug tries to brainwash their staff into believing they are a part of something great.", "cons": "- you're expected to stay longer for free. Management is not happy when you refuse", "advice": "- You need to train your management and stuff better"}, {"title": "Sales Assistant", "text": "Pros Decent staff discount, friends and family offers are great. Loved speaking to customers and making their day. Cons Very unorganised management, treat staff like just another number in their statistics, too much pressure on targets. Poor pay for the amount of work required per hour and too much training. Advice to Management Start treating employees with more respect. Raise hourly pay.", "rating": 3, "pros": "Decent staff discount, friends and family offers are great. Loved speaking to customers and making their day.", "cons": "Very unorganised management, treat staff like just another number in their statistics, too much pressure on targets. Poor pay for the amount of work required per hour and too much training.", "advice": "Start treating employees with more respect."}, {"title": "Talking the talk, but not walking the walk", "text": "Pros Good business results resulting in healthy bonuses. Cons An increasingly sweat-shop style environment where the gap between senior and middle management grows almost by the day. Current success appears to be built on sand and hiding a multitude of sins. Very good at talking about 'our people', but terrible at delivering the very basic tenements of a happy working environment. Advice to Management Take your head out of the sand and stop paying lip service to the increasingly vocal concerns from the 'little people'. Continuing to ask for 'more for less' cannot sustain. You are close to breaking point now and it shows in the quality of people in the business, another year of chasing an unachievable top line at the expense of our people may do irrecoverable damage.", "rating": 3, "pros": "Good business results resulting in healthy bonuses.", "cons": "An increasingly sweat-shop style environment where the gap between senior and middle management grows almost by the day. Current success appears to be built on sand and hiding a multitude of sins. Very good at talking about 'our people', but terrible at delivering the very basic tenements of a happy working environment.", "advice": "Take your head out of the sand and stop paying lip service to the increasingly vocal concerns from the 'little people'. Continuing to ask for 'more for less' cannot sustain. You are close to breaking point now and it shows in the quality of people in the business, another year of chasing an unachievable top line at the expense of our people may do irrecoverable damage."}, {"title": "Sales Assistant", "text": "Pros - Good job for young people - Lots of overtime Cons - Low hourly rate - Every store is very hot and air conditioning never works - Get searched every time you leave work to show you haven't stolen anything. It's a shame they don't trust the staff but I do understand why they do it as items go missing. Advice to Management - Make hourly rate higher", "rating": 3, "pros": "- Good job for young people", "cons": "- Low hourly rate", "advice": "- Make hourly rate higher"}, {"title": "Good", "text": "Pros Very good people to work with Cons Only 10% branded and 30% on own brand", "rating": 3, "pros": "Very good people to work with", "cons": "Only 10% branded and 30% on own brand", "advice": null}, {"title": "Unorganised", "text": "Pros Good discount, lots of colleagues teenagers like me Cons managers horrible do not care about your mental health, and everything is basically your fault. barely had any breaks, shifts i couldn't do and just an overall horrible 9 months Advice to Management treat your staff like humans, not robots", "rating": 1, "pros": "Good discount, lots of colleagues teenagers like me", "cons": "managers horrible do not care about your mental health, and everything is basically your fault. barely had any breaks, shifts i couldn't do and just an overall horrible 9 months", "advice": "treat your staff like humans, not robots"}, {"title": "Good temporary job", "text": "Pros The other members of staff are lovely and everyone gets along like an extended family, its perfect for students and individuals looking to go retail experience Cons The pay isn't great and management do not always treat those in lower job roles with much respect, time off is also difficult to obtain Advice to Management Recognise lower members of staff for their efforts and not be quite so cliquey", "rating": 3, "pros": "The other members of staff are lovely and everyone gets along like an extended family, its perfect for students and individuals looking to go retail experience", "cons": "The pay isn't great and management do not always treat those in lower job roles with much respect, time off is also difficult to obtain", "advice": "Recognise lower members of staff for their efforts and not be quite so cliquey"}, {"title": "General manager", "text": "Pros Fun colleagues and average pay Cons Mice problem in most stores. Bully culture", "rating": 1, "pros": "Fun colleagues and average pay", "cons": "Mice problem in most stores. Bully culture", "advice": null}, {"title": "Questions to customers need to be relaxed!", "text": "Pros Great colleagues, good discount scheme, opportunities to progress Cons Too much focus trying to be the best in customer service (Mary Gober); customers don't want continuous questions! Low wage, a team leader getting only 50p more an hour than a sales advisor when some team leaders are running their stores on their own. Heavy workload and no hours or staff put into stores. Advice to Management The stress being put on team members to reel off a whole script when trying to help a customer is too much! Customers just want friendly help, which we give! They are put off coming back when we have to bombard them with offers and questions at the tills and on the shop floor. What happened to just being smiley and friendly?!", "rating": 5, "pros": "Great colleagues, good discount scheme, opportunities to progress", "cons": "Too much focus trying to be the best in customer service (Mary Gober); customers don't want continuous questions! Low wage, a team leader getting only 50p more an hour than a sales advisor when some team leaders are running their stores on their own. Heavy workload and no hours or staff put into stores.", "advice": "The stress being put on team members to reel off a whole script when trying to help a customer is too much! Customers just want friendly help, which we give! They are put off coming back when we have to bombard them with offers and questions at the tills and on the shop floor. What happened to just being smiley and friendly?!"}, {"title": "Hard work for little pay", "text": "Pros Staff discount. Helping customers find what there looking for. Working with great people. Paid holiday. Double discount weeks and friends and family vouchers. Cons Bad pay, heavy work load. Too concerned with the customer not the staff. Working bank holidays and most of Christmas. Giving a lot of my time for no pay. Too many managers so don't know who to take orders from. Not enough staff on the shop floor at busy times. No sickness pay regardless of how long you have worked for the company. Advice to Management Need to focus more on the employees, Poor training for new staff. Managers need to Listen to their staff.", "rating": 3, "pros": "Staff discount. Helping customers find what there looking for. Working with great people. Paid holiday. Double discount weeks and friends and family vouchers.", "cons": "Bad pay, heavy work load. Too concerned with the customer not the staff. Working bank holidays and most of Christmas. Giving a lot of my time for no pay. Too many managers so don't know who to take orders from. Not enough staff on the shop floor at busy times. No sickness pay regardless of how long you have worked for the company.", "advice": "Need to focus more on the employees, Poor training for new staff. Managers need to Listen to their staff."}, {"title": "sales adviser", "text": "Pros Management was very friendly Good hours Overall it was a good experience Cons could have been paid a bit more", "rating": 5, "pros": "Management was very friendly", "cons": "could have been paid a bit more", "advice": null}, {"title": "Great company, shocking pay!", "text": "Pros The people A growing company Plenty of opportunity to move up Cons Poor pay levels Constant pressure to deliver exceptional results with little support Too much focus on KPI's Advice to Management One cannot expect the world from somebody while expecting to pay them peanuts!", "rating": 3, "pros": "The people", "cons": "Poor pay levels", "advice": "One cannot expect the world from somebody while expecting to pay them peanuts!"}, {"title": "Good for part time but low pay compared to other places", "text": "Pros Friendly customers, great discount, busy working environment, staff praise/rewards, good work/life balance, opportunities to move up the career ladder Cons Low pay, repetitive tasks, temporary management, sometimes unorganized Advice to Management Staff should be properly notified in advance if their hours have changed during the week so there is no confusion", "rating": 5, "pros": "Friendly customers, great discount, busy working environment, staff praise/rewards, good work/life balance, opportunities to move up the career ladder", "cons": "Low pay, repetitive tasks, temporary management, sometimes unorganized", "advice": "Staff should be properly notified in advance if their hours have changed during the week so there is no confusion"}, {"title": "Work hard, get paid less", "text": "Pros Good discount scheme Lots of training materials Competitions to be won Cons Long hours, care more about customers and will belittle you so the customer gets what they want even though you're following policy. Pay is poor, don't consider the stress they put management under until the reach breaking point.area managed only care about their fave managed and stores Advice to Management Outdated systems they need to be streamlined Fair pay between male and female managers More support Don't think managers working 50+ hour weeks is okay when we don't get paid for it Must engage with people more Mary Gober isn't working", "rating": 3, "pros": "Good discount scheme", "cons": "Long hours, care more about customers and will belittle you so the customer gets what they want even though you're following policy. Pay is poor, don't consider the stress they put management under until the reach breaking point.area managed only care about their fave managed and stores", "advice": "Outdated systems they need to be streamlined"}, {"title": "Care more about customers than staff.", "text": "Pros Good discount (30% exclusive and 10% branded) Yearly bonus if targets are met Good team spirit, happy working environment Always busy Cons Budget for hours is too little for what they expect of the stores People from head office have 0 retail experience so they expect the impossible No consideration for staff and the stress that staff are under They will give you a policy to ‘stick to’ but if a customers complains about this policy they will belittle you just to keep the customer happy Advice to Management Consider your staff more and think a little more about the jobs you’re giving and the hours you’re giving to do them. I’ve seen way too many managers in my area have breakdowns because of the amount of pressure they’re under.", "rating": 3, "pros": "Good discount (30% exclusive and 10% branded)", "cons": "Budget for hours is too little for what they expect of the stores", "advice": "Consider your staff more and think a little more about the jobs you’re giving and the hours you’re giving to do them. I’ve seen way too many managers in my area have breakdowns because of the amount of pressure they’re under."}, {"title": "Beauty Consult", "text": "Pros I love makeup,I love to help people to find their best product,I love to communicate with different people. Cons I would like to work in this kind of stores because I am really inlove with my hobby -makeup,and this is my dream since I was little. Advice to Management My advice is that Superdrug have to take people that have passion on makeup and want to work with big smile and they will give all of them.Because I am trying to work there and I am very confident everytime but none give me this chance from Superdrug stores :( .", "rating": 5, "pros": "I love makeup,I love to help people to find their best product,I love to communicate with different people.", "cons": "I would like to work in this kind of stores because I am really inlove with my hobby -makeup,and this is my dream since I was little.", "advice": "My advice is that Superdrug have to take people that have passion on makeup and want to work with big smile and they will give all of them.Because I am trying to work there and I am very confident everytime but none give me this chance from Superdrug stores :( ."}, {"title": "not great", "text": "Pros Discount card that you can use in store Cons Where I worked at Cribbs they expected you to work 6 days in a row, they don't seem to care about the needs of their staff. Managers expected to work 50+ hours and not get paid for any overtime. If you become a team leader, your life is over its very draining. The toilets are used as storage areas for the stock that will be sold to customers. This includes makeup. Which ironically you can't return if you are a customer because of hygiene. Day to day it's like a typical retail job, but you have nowhere to have a break, the staff room is a shoe box, and is often disgusting and not usable. Managers don't care, and won't pay for a decent cleaner, or be strict about hygiene. Basic human rights are ignored. They expect a lot from their staff, but don't understand why their staff isn't happy. If you want a part time job its ok, like just a couple days a week, but if you are an adult and want real pay, this is not the place to work. £8.29 to be a team leader is not enough. The amount of responsibility and stress and lack of support is ridiculous for the pay. Advice to Management Give your staff better rotas, better pay, actually care more about who you hire and the quality of work life you are giving to your staff, happy staff=happy customers=more money for you. Stop putting so much pressure on staff, and treating them like £ sign. Sack managers that don't do their jobs don't just let them drift from one store to the next causing havoc as they go. Listen to your staff complaints, learn from your mistakes, and please hire a cleaner that actually cleans.", "rating": 3, "pros": "Discount card that you can use in store", "cons": "Where I worked at Cribbs they expected you to work 6 days in a row, they don't seem to care about the needs of their staff. Managers expected to work 50+ hours and not get paid for any overtime. If you become a team leader, your life is over its very draining. The toilets are used as storage areas for the stock that will be sold to customers. This includes makeup. Which ironically you can't return if you are a customer because of hygiene. Day to day it's like a typical retail job, but you have nowhere to have a break, the staff room is a shoe box, and is often disgusting and not usable. Managers don't care, and won't pay for a decent cleaner, or be strict about hygiene. Basic human rights are ignored. They expect a lot from their staff, but don't understand why their staff isn't happy. If you want a part time job its ok, like just a couple days a week, but if you are an adult and want real pay, this is not the place to work. £8.29 to be a team leader is not enough. The amount of responsibility and stress and lack of support is ridiculous for the pay.", "advice": "Give your staff better rotas, better pay, actually care more about who you hire and the quality of work life you are giving to your staff, happy staff=happy customers=more money for you. Stop putting so much pressure on staff, and treating them like £ sign. Sack managers that don't do their jobs don't just let them drift from one store to the next causing havoc as they go. Listen to your staff complaints, learn from your mistakes, and please hire a cleaner that actually cleans."}, {"title": "A lot of admin and work, the pay is less than average. Use for experience as you will learn a lot.", "text": "Pros Majority of colleagues are great, fun, intelligent and good to be around. You can learn a lot. Fun and casual atmosphere Excellent way to learn the retail business Bonus scheme is a plus Other benefits are terrible if you are not a higher grade Cons Expect a lot of administrative tasks, even seniors have to deal with admin Location is not good Work hours can be long quite regularly Pay is low in comparison to many other companies in London (20% less than average unless you are at a senior level) Advice to Management Career progression is difficult in the business, senior members of staff hardly move around and roles are not varied. There are some employees at headoffice who do not pull their weight but slide by unnoticed due to status/politics/who they know, this should be minimized as it is a waste of resources and better talent could take over. Systems are a bit outdated", "rating": 3, "pros": "Majority of colleagues are great, fun, intelligent and good to be around. You can learn a lot.", "cons": "Expect a lot of administrative tasks, even seniors have to deal with admin", "advice": "Career progression is difficult in the business, senior members of staff hardly move around and roles are not varied. There are some employees at headoffice who do not pull their weight but slide by unnoticed due to status/politics/who they know, this should be minimized as it is a waste of resources and better talent could take over."}, {"title": "Manager", "text": "Pros You can cure headaches and back pains caused by the job without going out of the shop if your store has a pharmacy Cons Typical high street retailer, they'll fill your head with facts and stories to make you believe they're better than anyone else, they're actually the same. Enormous work load if you manage an average size store, you will not be provided with the promised training cause there is too much to do. Watch out on your contract, there are some points which are actually illegal (i.e. Remaining holidays payments at the end of employment). Impossible to talk to anyone in the Company if you have a problem Advice to Management Start to be realistic when setting tasks for the stores Stop lying", "rating": 1, "pros": "You can cure headaches and back pains caused by the job without going out of the shop if your store has a pharmacy", "cons": "Typical high street retailer, they'll fill your head with facts and stories to make you believe they're better than anyone else, they're actually the same. Enormous work load if you manage an average size store, you will not be provided with the promised training cause there is too much to do. Watch out on your contract, there are some points which are actually illegal (i.e. Remaining holidays payments at the end of employment). Impossible to talk to anyone in the Company if you have a problem", "advice": "Start to be realistic when setting tasks for the stores"}, {"title": "Sales Assistant", "text": "Pros Interactions Helping customers Up-selling products Building rapports with clients Cons Standing Last min sicknesses Lack of cleanliness Theft", "rating": 5, "pros": "Interactions", "cons": "Standing", "advice": null}, {"title": "Excellent time", "text": "Pros Loved the store manager he was great Cons Sometimes shifts can be boring if nothing to do Advice to Management Keep up the good work", "rating": 5, "pros": "Loved the store manager he was great", "cons": "Sometimes shifts can be boring if nothing to do", "advice": "Keep up the good work"}, {"title": "If you want a career in retail, start here. But be warned.", "text": "Pros Good staff discount on own-brand (30%) and branded (10%) items. Customers vary, but are usually enjoyable to serve. Can be a good business for a lengthy retail career (for those brave enough). Cons Very poor average pay, particularly for low-level employees and even management. No extra pay for working Sundays or Bank Holidays (including Boxing Day and New Years Day). Unfair break system; working 6 1/2+ hours entitles employee to 30 minutes break. Anything less = only 15 minutes. Overly demanding expectations for low-level employees, including the currently enforced methods of interacting with customers (which serve no benefit).", "rating": 3, "pros": "Good staff discount on own-brand (30%) and branded (10%) items.", "cons": "Very poor average pay, particularly for low-level employees and even management.", "advice": null}, {"title": "Online application, Webcam interview, Formal Interview", "text": "Pros Salary, Discounts, Opportunity to learn Cons Only just started working for the company", "rating": 3, "pros": "Salary, Discounts, Opportunity to learn", "cons": "Only just started working for the company", "advice": null}, {"title": "Team Leader", "text": "Pros Good place to work as ur first job. Quick progression if your manager and area manager likes you lol Cons As management you will have to work a lot of Free hours. I went to assistant manager position but then stepped down because company has a clause in their contract which require ASMs and Managers to work Unpaid hours, every week as nessessity of business. Its a joke honestly. I have seen managers working 60 hours where as they get paid for only 39. Its horrible. Discount on branded products you get only 10%. Sometimes student discount works out more than staff discount so its a joke aswell. Advice to Management Advise to directors. Please think of working staff as human being aswell. While you guys filled your pockets with almost a hundred million profit last year, it would be nice and ethical to lookafter your customer facing teams aswell. Oh one more thing. If a customer brings any complain and you ring customer support to support you they will put you into spot light saying \"its upto the manager on duty\" Its a joke", "rating": 1, "pros": "Good place to work as ur first job. Quick progression if your manager and area manager likes you lol", "cons": "As management you will have to work a lot of Free hours. I went to assistant manager position but then stepped down because company has a clause in their contract which require ASMs and Managers to work Unpaid hours, every week as nessessity of business. Its a joke honestly. I have seen managers working 60 hours where as they get paid for only 39. Its horrible.", "advice": "Advise to directors. Please think of working staff as human being aswell."}, {"title": "Poor moral and lack of trust of the workforce", "text": "Pros The main reason people remain with the business is the people they work with and the relationships they build. Unfortunately staff turnover is very high. Cons Very poor culture within the business. Dissatisfaction at all levels. Stores asked to deliver ridiculous targets whilst hours are reduced on a regular basis. A high level of arrogance exists amongst senior management and they seem to not want a culture change. Store management continually having to work excessive hours just to deliver the basics. People do not matter here - the share holders are the only ones that matter. How does a business that delivers record profits not improve the life's of the workforce ? Advice to Management Listen to the river ! Push for a culture change because you recognise it needs to change. Stop sticking your head in the sand and support store teams. May be it's time to do things differently ? May be you will find you get better results ?", "rating": 1, "pros": "The main reason people remain with the business is the people they work with and the relationships they build. Unfortunately staff turnover is very high.", "cons": "Very poor culture within the business. Dissatisfaction at all levels. Stores asked to deliver ridiculous targets whilst hours are reduced on a regular basis. A high level of arrogance exists amongst senior management and they seem to not want a culture change.", "advice": "Listen to the river !"}, {"title": "Sales advisor", "text": "Pros Lots of hours, 30% off Superdrug own brand, good experience if first job, lots of different jobs within available Cons Poor discount on non brand- 15% (same as NUS) forced to harass every customer if they want a beauty card and if they want to buy any star buys and get negative feedback if you don't", "rating": 3, "pros": "Lots of hours, 30% off Superdrug own brand, good experience if first job, lots of different jobs within available", "cons": "Poor discount on non brand- 15% (same as NUS) forced to harass every customer if they want a beauty card and if they want to buy any star buys and get negative feedback if you don't", "advice": null}, {"title": "Not worth it", "text": "Pros The discount was good especially on those 20% summer events Some of the people are great, too good for the company imo Cons The hours are a joke. Managers get no benefits for their EXCESSIVE overtime. No overtime pay, no days off in lieu nothing! You're expected to work in excess of your hours on a weekly basis. Some managers/peers I've encountered have an autocratic style which does not fit with the \"Superdrug way\". No work/life balance For your mental health I'd implore you not to waste your time by applying here Advice to Management You're not saving lives, you sell shampoos etc...get over yourself!", "rating": 3, "pros": "The discount was good especially on those 20% summer events", "cons": "The hours are a joke. Managers get no benefits for their EXCESSIVE overtime. No overtime pay, no days off in lieu nothing! You're expected to work in excess of your hours on a weekly basis.", "advice": "You're not saving lives, you sell shampoos etc...get over yourself!"}, {"title": "Bad company to work for at management level", "text": "Pros Staff discount.. That would be it! I would give this store 0 stars if possible as it is such a bad company to work for. Cons Not appreciated Expected to do extra hours every single week and never get paid for them or the time back 14hour shift on promotion change- only paid for 7 or 8 hours. This happens every 4 weeks. Again have to do more hours in the lead up to stock take The company is expecting more and more from you whilst cutting store budgets- and then you go to their conference and hear how much money they made- it's sickening Mystery shop has got near impossible to get 100% on (thus no £100 for the store). Mary Gober customer service toolkit is not suitable for all customers. You are expected to go up to every customer and introduce yourself. They expect this plus get your delivery out and all other tasks Plenty more I could complain about. I wouldn't recommend this job to anyone above team leader level as you won't get paid hourly and get taken advantage of. Advice to Management Top management- make more manageable workloads. Store management are being expected to do more and more- no wonder there are so many leaving. The job is not enjoyable anymore. The stores need more hours so managers can leave when they are supposed to do and have a good work/ family life balance. I'm so glad to be out of it after nearly 9 years!", "rating": 1, "pros": "Staff discount.. That would be it! I would give this store 0 stars if possible as it is such a bad company to work for.", "cons": "Not appreciated", "advice": "Top management- make more manageable workloads. Store management are being expected to do more and more- no wonder there are so many leaving. The job is not enjoyable anymore. The stores need more hours so managers can leave when they are supposed to do and have a good work/ family life balance. I'm so glad to be out of it after nearly 9 years!"}, {"title": "Fab", "text": "Pros Friendly management and staff, fab discount, 30% own brand and 10% everything else Cons Short shifts spread across mutiple days", "rating": 5, "pros": "Friendly management and staff, fab discount, 30% own brand and 10% everything else", "cons": "Short shifts spread across mutiple days", "advice": null}, {"title": "Not worth it", "text": "Pros Fun with colleagues that are nice Cons Long hours, hard graft for reward Advice to Management Treat employees better, not just as dirt that can be discarded", "rating": 3, "pros": "Fun with colleagues that are nice", "cons": "Long hours, hard graft for reward", "advice": "Treat employees better, not just as dirt that can be discarded"}, {"title": "Pre reg video interview", "text": "Pros Well reputable firm Has own brand presence Good staff Nation wide Video interview comprises over 3 questions 1- describe when you did team work 2- how you see pharmacy on high streets after 5 years 3-what are your qualities and how they would fit in super drug Cons Was nervous Feel weird recording myself self whilst answering Face to face interview would have been better Wasn't expecting such kind of questions Advice to Management No advice", "rating": 3, "pros": "Well reputable firm", "cons": "Was nervous", "advice": "No advice"}, {"title": "Disrespectful, awful company, power gone managers heads!", "text": "Pros Some friendly staff that share the exact same views because the issues are so bad! We are sick of being picked on for doing a good job. Cons Bad pay for what you do. 12hr to 14hr shifts for normal sales advisors. No out of social hours extra pay unless its midnight. No bank holiday extra pay. No comission for highly forced pressured sales. Horrific area managers and store managers. Threats of no pay from managers when they have no power to do so. Managers in office on mobile phones and tons of cups of tea doing no work. Other store managers visit on days off to talk in bad ways about their staff and starbuys sometimes for 2 hours when they have a store to run and be paid for. Not to sit around. Constant blame. Calling staff lazy for not doing work past their hours when they cant stay. Often doing extra work un paid, holding you hostage if you cant stay they wont sign you out. You HAVE to say hello to EVERY SINGLE customer, AND tell them your name, job title, where youll be, sell them an extra product, ask them to buy anouther extra product at till, make them have a beauty card (otherwise your in trouble) if you dont, youll have cctv pulled up against and figures that they think prove somthing. E.g. manger serves 2 people with a beauty card so they have 100% sales partcipation. We serve 200+ customers many without a beauty card even if you ask if they want one its not good enough because the figures apparently show that you didnt ask your customer. Discusting.  we know what good customer service is because we arent stupid, they will threat not to pay you, treat you like kids with their pathetic training videos. embaress you in front of the customer or bully you by forcing you to stand up in front of team members to act out sales roles then make you feel bad for it. AVOID AVOID AVIOD. Company constantly remind you of how many millions and billions they make not realising how petily paid we are for getting them there. We are NOT valued. It appears a friendly easy job and it used to be.. but its changed and the company is greedy and trying way to hard to over throw boots and steal every customer to convert them to superdrug. They always try to catch you out. Mystery shop, not designed to show obvious good service its used to catch out staff for being pestering. Cctv managers will watch you for ages on camera until you dont greet one person. (Maybe they walked past because they didnt want help, very obvious) but theres being friendly a smile or hello is great but you have to ask if they want help and if not say your name tell them what you do which is by far too silly. And makes doing tasks in store way to hard now. And to top it off if you dont finish your tasks your in trouble. Or called lazy. Or made to stay 'a few extra mins'... unpaid btw' The treatment is awful honestly i could go on for ages. Our customers are asked if they want help so much that they've swore at us and walked put annoyed. Desperatly looking for a better respectful job. Advice to Management Youll get beat down by your area manager, everything is your fault even if its out of your hands. E.g. starbuy sales you could go above and beyound to sell them but obviously you cant force people to buy. But superdrug expect you to levitate a customers wallet and steal the cash im sure. No point in progressing here eaither you get an extra 10p - 30p for most things with way more responsability not worth the hassel.", "rating": 1, "pros": "Some friendly staff that share the exact same views because the issues are so bad! We are sick of being picked on for doing a good job.", "cons": "Bad pay for what you do. 12hr to 14hr shifts for normal sales advisors. No out of social hours extra pay unless its midnight. No bank holiday extra pay. No comission for highly forced pressured sales. Horrific area managers and store managers. Threats of no pay from managers when they have no power to do so.", "advice": "Youll get beat down by your area manager, everything is your fault even if its out of your hands. E.g. starbuy sales you could go above and beyound to sell them but obviously you cant force people to buy. But superdrug expect you to levitate a customers wallet and steal the cash im sure."}, {"title": "Senior Managers in this company are nothing but bullies", "text": "Pros Good staff discounts, the days do go quick cause it's always busy, you get to gain a lot of product knowledge, most of the customers are lovely people who you build a great relationship with and the girls I've worked with have become close friends. Cons Short shifts so they don't have to give you a break, ridiculous standards when it comes to selling star buys (perfume). Management are rude and speak to you whatever way you like number of my colleagues are terrified of our manager and have been reduced to tears. Minimum wage pay for sales assistants. Advice to Management Don't take your mood swings out on your staff. More flexibility with rosters people have life's outside of work.", "rating": 1, "pros": "Good staff discounts, the days do go quick cause it's always busy, you get to gain a lot of product knowledge, most of the customers are lovely people who you build a great relationship with and the girls I've worked with have become close friends.", "cons": "Short shifts so they don't have to give you a break, ridiculous standards when it comes to selling star buys (perfume). Management are rude and speak to you whatever way you like number of my colleagues are terrified of our manager and have been reduced to tears. Minimum wage pay for sales assistants.", "advice": "Don't take your mood swings out on your staff. More flexibility with rosters people have life's outside of work."}, {"title": "Pharmacy Manager", "text": "Pros Decent company to work for with helpful management to an extent Cons Like all large multiplies it's all about targets...stretching targets Advice to Management Give a little more credit where credit is due", "rating": 5, "pros": "Decent company to work for with helpful management to an extent", "cons": "Like all large multiplies it's all about targets...stretching targets", "advice": "Give a little more credit where credit is due"}, {"title": "sales assistant", "text": "Pros good short hours (4 hours) able to take up overtime good discount Cons management not the best pay could be better", "rating": 3, "pros": "good short hours (4 hours)", "cons": "management not the best", "advice": null}, {"title": "No work/life balance", "text": "Pros Discount, conferences, some members of the team. Cons Aggressive area managers, long hours (55 a week and salaried for 39), bullying allowed Advice to Management Put employee happiness first, it's not always about sales.", "rating": 1, "pros": "Discount, conferences, some members of the team.", "cons": "Aggressive area managers, long hours (55 a week and salaried for 39), bullying allowed", "advice": "Put employee happiness first, it's not always about sales."}, {"title": "Sales advisor", "text": "Pros Staff discount is good. Pay is quite good. It can be fun if you're interested in beauty. Extra pay on Sunday. Cons Shifts are never longer than 4 hours because the company doesn't want to pay you for a break. Virtually impossible to get a day off. The online hub makes you feels like your manager lives inside your phone. Unnecessary pressure to sell star buys. Too competitive. Advice to Management Calm down. Stop shouting. Stop with the self praise.", "rating": 3, "pros": "Staff discount is good.", "cons": "Shifts are never longer than 4 hours because the company doesn't want to pay you for a break.", "advice": "Calm down. Stop shouting. Stop with the self praise."}, {"title": "Poor", "text": "Pros None whatsoever. And I mean that Cons Long targets and on your feet all day Advice to Management No help expects us to wrk like robots", "rating": 3, "pros": "None whatsoever. And I mean that", "cons": "Long targets and on your feet all day", "advice": "No help expects us to wrk like robots"}, {"title": "Great people", "text": "Pros People who work there and company culture brilliant and fun Lots of autonomy in roles due to reasonably flat structure Laid back, not corporate environment Performing well and expanding Cons Low pay Small teams, heavy workload Little progression once you move to mid senior level Face fits sometimes over actual ability Advice to Management See cons", "rating": 3, "pros": "People who work there and company culture brilliant and fun", "cons": "Low pay", "advice": "See cons"}, {"title": "Time of my life. More than a job.", "text": "Pros Staff discount. Good holidays and pay. Close knit staff that were like family. Management i had was very accommodating when it came to me needing time off at short notice. I only left as new manager took over and she wasn't as nice and brought a negative tone to the shop and staff. Cons Having to work late on promotion change and not aloud to leave until it was all done, even if that meant being there until 11pm usually unpaid. Told you would get paid for it or time back but never did.", "rating": 5, "pros": "Staff discount.", "cons": "Having to work late on promotion change and not aloud to leave until it was all done, even if that meant being there until 11pm usually unpaid. Told you would get paid for it or time back but never did.", "advice": null}, {"title": "Opinion", "text": "Pros Good discount Good team Time goes fast always something to do Cons Not enough staff Hard work Small contracted hours but do lots more Advice to Management Give more contracted hours and more staff...would have a better store.", "rating": 3, "pros": "Good discount", "cons": "Not enough staff", "advice": "Give more contracted hours and more staff...would have a better store."}, {"title": "Beauty Advisor", "text": "Pros Young staff, ok discount, good makeup deals Cons Poor management, managers dont care about you. Low pay rate. Advice to Management Be nicer and pay more!", "rating": 1, "pros": "Young staff, ok discount, good makeup deals", "cons": "Poor management, managers dont care about you. Low pay rate.", "advice": "Be nicer and pay more!"}, {"title": "Good place to work", "text": "Pros Lots of great ways to climb the ladder in the business. Can be very rewarding versus other retailers as your given more scope to action things. Great people to work with. Cons Can be hard work and extra time needed to do the best job. Advice to Management Keep your focus on developing people", "rating": 5, "pros": "Lots of great ways to climb the ladder in the business. Can be very rewarding versus other retailers as your given more scope to action things. Great people to work with.", "cons": "Can be hard work and extra time needed to do the best job.", "advice": "Keep your focus on developing people"}, {"title": "alright", "text": "Pros good benefits and discounts. good staff and team. Cons staff shortages and lots of work", "rating": 5, "pros": "good benefits and discounts. good staff and team.", "cons": "staff shortages and lots of work", "advice": null}, {"title": "You get out of it what you put in.", "text": "Pros Team you work with. Okay pay. Incentives within store. Making a difference to some customers Seeing a positive from something you have done Job stability Ability to work upwards Cons Pressure - there is a lot of pressure and it's like a pyramid and by the time It gets to sales advisors it's hard work. Lack of hours for staff - not enough hours allocated per store so store level take the slack. Management work a lot of hours over their contract. Meaning more pressure on staff to complete jobs when not enough time or people. There are far better paid jobs in this field of work. Advice to Management I'm lucky that I have a manager that appreciate's the work we all put in. However the stresses that are put on her and therefore us is silly. The hours cuts every year. The push on star buys, registrations, own brand sales on top on daily chores and being a security guard gets on top of you sometimes.", "rating": 5, "pros": "Team you work with.", "cons": "Pressure - there is a lot of pressure and it's like a pyramid and by the time It gets to sales advisors it's hard work.", "advice": "I'm lucky that I have a manager that appreciate's the work we all put in. However the stresses that are put on her and therefore us is silly. The hours cuts every year. The push on star buys, registrations, own brand sales on top on daily chores and being a security guard gets on top of you sometimes."}, {"title": "Above minimum wage pay", "text": "Pros 30% discount off own brand and exclusive 10% of branded Occasional competitions within the company; prizes including a weeks pay, new car etc. Cons Have to push star buys and loyalty cards to every customer to meet the weekly quota, which can be a little bit annoying. Advice to Management Hire at least one more person to work in he first aisle to prevent/reduce theft of stock. Allow sales advisors to process returns and voids so there is a less of a build up of queues.", "rating": 5, "pros": "30% discount off own brand and exclusive", "cons": "Have to push star buys and loyalty cards to every customer to meet the weekly quota, which can be a little bit annoying.", "advice": "Hire at least one more person to work in he first aisle to prevent/reduce theft of stock. Allow sales advisors to process returns and voids so there is a less of a build up of queues."}, {"title": "Superdrug", "text": "Pros Good team but not much else. Cons Managers been in same position for many years which didn't make for a good culture. Store budgets very low so management expected to work a lot of unpaid overtime to make up the time on the rotas.", "rating": 3, "pros": "Good team but not much else.", "cons": "Managers been in same position for many years which didn't make for a good culture. Store budgets very low so management expected to work a lot of unpaid overtime to make up the time on the rotas.", "advice": null}, {"title": "LOVE IT", "text": "Pros Great people, great discount, great working environment Cons None that I can think of Advice to Management None - continue what your doing", "rating": 5, "pros": "Great people, great discount, great working environment", "cons": "None that I can think of", "advice": "None - continue what your doing"}, {"title": "Fab place to work!", "text": "Pros Really great people, lovely working environment, interesting work and lots of opportunity Cons Perhaps too busy at times Advice to Management Keep doing all you are doing", "rating": 5, "pros": "Really great people, lovely working environment, interesting work and lots of opportunity", "cons": "Perhaps too busy at times", "advice": "Keep doing all you are doing"}, {"title": "Good part time job", "text": "Pros Good employee discount (30% on own brand) Management a good laugh Cons Minimum wage Constant pressure to meet sales targets and beauty card registration targets Small contract hours offered Advice to Management Be nice to employees and try and offer bigger contracts although this may be difficult for wage budget", "rating": 3, "pros": "Good employee discount (30% on own brand)", "cons": "Minimum wage", "advice": "Be nice to employees and try and offer bigger contracts although this may be difficult for wage budget"}, {"title": "Very pooh training is very sad indeed over 50% of all managers that join the campany leave in the 1st 5 months !!!!", "text": "Pros 30% discount on own brand products the pay is ok if u come into the campany .. campany whats to be the best at what they offer there customers Cons Long hours always doing over your hours 55 to 60 a week .. paid for 39hours only .. need to put it up to 48hr or something like that .. wost experience in my working life Advice to Management Take a look at why most managers leave in the there 1st 5 month .. re look at training at what stores u put then in the train", "rating": 1, "pros": "30% discount on own brand products the pay is ok if u come into the campany .. campany whats to be the best at what they offer there customers", "cons": "Long hours always doing over your hours 55 to 60 a week .. paid for 39hours only .. need to put it up to 48hr or something like that .. wost experience in my working life", "advice": "Take a look at why most managers leave in the there 1st 5 month .. re look at training at what stores u put then in the train"}, {"title": "just fine", "text": "Pros Short hours, relaxed and friendly environment Cons Poor management led to a high turnover of staff, very poor pay", "rating": 3, "pros": "Short hours, relaxed and friendly environment", "cons": "Poor management led to a high turnover of staff, very poor pay", "advice": null}, {"title": "Do not work at Superdrug is you can't handle stress or pressure.", "text": "Pros Personally I think Superdrug is a great place to work if you love perfume,makeup and skincare.I love all three so helping people discover the right products for them is a joy for me. My Superdrug has an incredibly lovely team,everyone works together and is relatively on the same level ( with the exception of our manager) Staff discount is fantastic,I get everything so cheap which makes things easier at home. Lunch and breaks are given very generously on long shifts Cons Superdrug is near constant stress and pressure.My first day left me welling up with tears because they left me on the till all on my own,with little to no knowledge of what I was doing,and it was also a pretty busy day. All of the paperwork required for me starting was sent off unbelievably late,which prevented my name being put on payroll.I worked a whole two months before I was actually paid,which made me so angry.I couldn't believe they where that disorganised. The team leader was a big bully who had no interest in adapting to changes within the company.She would constantly swear on shop floor and speak negatively about other members of staff behind their backs.I reported her to management and nothing was done about the situation. All the company cares about is Star buys and beauty cards,and they pressure you so much into forcing them upon people who really don't care.They believe it makes people want to come back but I believe otherwise.I have failed two mystery shops because I didn't ask the thousand questions you have to squeeze in at till point.As soon as I failed my first one I was pulled into the office and shouted at by my assistant manager,who said I had cost him his bonus and that the 50% result was disgusting.I felt like not coming back to work ever again.I failed another one recently and I was told there would be consequences if it where to happen again. Now I live in dread till the next time ito comes along. It didn't seem to matter to them how well I perform on a daily basis,I usually kick everyone else's butts at selling fragrance and registering cards but as soon as you make one single mistake you a treated like rubbish. I'm also very sick of being called up in the early hours of the morning asking if I can come in or start earlier as they are that god damn unorganised and understaffed.My manager will set up all the rotas for the next couple of weeks and I will make note of them straight away,but then she goes ahead and writes me in on extra days - one without asking permission and two without even notifying me!! What if I had plans that day??? They expect you to not have a life outside of work so that you can show up at their beckoned call! Then when you say no because you have made plans the get mad at you and start acting weird around you when you come in on shift. Management are all over the place with everything,not just the rotas.When cashing up,mistakes are constantly being made,so you end up having to stay way after you shift ends to correct their errors.Sometimes they don't even pay you the extra time you do.Some weeks you have tonnes and tones of hours and others you barely have any.When on shift,you can spend hours just stood there at the till or on first aisle while the others do tasks,because management are useless at rotating. Our store is grotty and dirty and the company won't pay out for updates.Our staff room and staff toilet are filthy and untidy and smell like Mildew.You don't have room to swing a cat in them. The pay is incredibly poor for the work you put in.Running a place on their wages is impossible. Don't even think of having time off sick.They get so arsey with you if you ring in and then you have to go through a return to work meeting.I've only had three days off due to bad illness and they are already giving me warnings. There is also barely any chance to progress whilst working at Superdrug. I have come to hate working here despite my love for the job when I first started. Advice to Management Stop putting so much pressure on staff and create a more relaxed environment.Maybe then staff would actually want to come to work. Allow staff to do their job in their own uniquexperience style instead of stifling it with this Mary Goeber rubbish and unless quotas. Improve working conditions Get more organised with rotas.Put more people in if you think there's any chance you will be under staffed instead of ringing people on their day off at unconceivable hours and getting angry with them when they can't make it.Spread hours out more evenly amongst staff members. Be more encouraging and create a system to reward good work. Hire better people senior staff members. Do not victimise specific members of the team when other people are \"guilty\" of similar things,such as not pushing people at the till.", "rating": 3, "pros": "Personally I think Superdrug is a great place to work if you love perfume,makeup and skincare.I love all three so helping people discover the right products for them is a joy for me.", "cons": "Superdrug is near constant stress and pressure.My first day left me welling up with tears because they left me on the till all on my own,with little to no knowledge of what I was doing,and it was also a pretty busy day.", "advice": "Stop putting so much pressure on staff and create a more relaxed environment.Maybe then staff would actually want to come to work."}, {"title": "good starter job", "text": "Pros easy job to pick up, professional company, good company if looking to develop customer service experience, working promo after hours is fun Cons pay was poor as i was only 16- often doing more work than people older then me, doing the same job but paid a lot less- demotivating Advice to Management bi-annual appraisals", "rating": 3, "pros": "easy job to pick up, professional company, good company if looking to develop customer service experience, working promo after hours is fun", "cons": "pay was poor as i was only 16- often doing more work than people older then me, doing the same job but paid a lot less- demotivating", "advice": "bi-annual appraisals"}, {"title": "All about the money , not the staff .", "text": "Pros Good team of work colleagues Staff discount on own brand Shop is bright and well laid out Good offers available to customers Cons This company do not care about staff, only money. They have cut the hours to run the store to a bare minimum. There is no one available to speak to customers any more and theft has risen. Management ( head office ) don't care. They cut the heating off in staff areas 3 years ago and didn't replace it, you have to wear a coat in the warehouse. Customer service is American Mary Gober and doesn't work, Mystery shopper form gets changed to make it harder to get 100% so bonuses don't get paid. There is no praise when you get things right but all hell breaks loose if you lose an audit point or don't get 100% mystery shopper. Staff are expected to act as store detectives and get questioned if thefts go up.CCTV is used to watch staff as well as customers They wonder why sales drop but customers come into an empty shop now with no one to help them,instead of the happy shop it used to be. Area manager only visits when sales are down. Regional Manager is only interested in sales. Managers are stressed trying to staff their shops on fresh air, they are contracted to work 39.5 hrs but end up working 50 plus just to cover the basic tasks they work 13hr shifts some days due to the lack of hours. I have never seen my team so demotivated or stressed. Advice to Management Invest in your stores by giving hours before your customers as well as staff leave Start treating your staff as a valuable commodity instead of making them act like scripted robots and your sales will increase.", "rating": 3, "pros": "Good team of work colleagues", "cons": "This company do not care about staff, only money. They have cut the hours to run the store to a bare minimum. There is no one available to speak to customers any more and theft has risen. Management ( head office ) don't care. They cut the heating off in staff areas 3 years ago and didn't replace it, you have to wear a coat in the warehouse.", "advice": "Invest in your stores by giving hours before your customers as well as staff leave"}, {"title": "Great Place", "text": "Pros Love the team staff are friendly and approachable business values are great and the company aspires to be the best. You also receive staff discounts and rewards. As an employee I do feel valued and aspire to progress within the company. It's great for customer interaction and you learn a lot about the business environment. Cons Some people may find the tasks competitive Minimum wage pay rate or not very high pay But with the hours you get trust me the money isn't a problem Advice to Management Keep doing what your doing!", "rating": 5, "pros": "Love the team staff are friendly and approachable business values are great and the company aspires to be the best. You also receive staff discounts and rewards. As an employee I do feel valued and aspire to progress within the company. It's great for customer interaction and you learn a lot about the business environment.", "cons": "Some people may find the tasks competitive", "advice": "Keep doing what your doing!"}, {"title": "good job, but low pay", "text": "Pros - meeting new people - discount - learn fast Cons - having to deal with customers stealing - low pay", "rating": 3, "pros": "- meeting new people", "cons": "- having to deal with customers stealing", "advice": null}, {"title": "Sales Advisor Role", "text": "Pros Easy interview. Store manager was lovely. Cons Horrible to work for! Promised 16 hours upon interview and first week of starting but only had 4 hours per week. Team leaders not helpful, hard to approach, staff were stuck up too. I was made to feel out of place by every staff member bar 3 people as the rest were always making snide remarks etc. Team leaders who were doing the rota's never put my name on the sheet, i was placed under 'new', never given shifts but would call me the day before or even on the day to say I was late for a shift i never knew i had. Very unprofessional. I quit after a month of being there, once i quit i was then told i was never going to get the 16 hours they promised until after xmas (8 months away). Would never recommend anyone to work in this store. I felt pressured in the work environment and dreaded going into work. Advice to Management Make new staff more aware of where to find rota's etc. To ensure all new starters feel welcome and feel like they can approach other staff members for help.", "rating": 1, "pros": "Easy interview. Store manager was lovely.", "cons": "Horrible to work for! Promised 16 hours upon interview and first week of starting but only had 4 hours per week. Team leaders not helpful, hard to approach, staff were stuck up too. I was made to feel out of place by every staff member bar 3 people as the rest were always making snide remarks etc. Team leaders who were doing the rota's never put my name on the sheet, i was placed under 'new', never given shifts but would call me the day before or even on the day to say I was late for a shift i never knew i had. Very unprofessional. I quit after a month of being there, once i quit i was then told i was never going to get the 16 hours they promised until after xmas (8 months away). Would never recommend anyone to work in this store. I felt pressured in the work environment and dreaded going into work.", "advice": "Make new staff more aware of where to find rota's etc. To ensure all new starters feel welcome and feel like they can approach other staff members for help."}, {"title": "Superdrug management role review", "text": "Pros Wants to be the best company Good discount/holiday allowance Majority of people you work with are friendly Good internal ladder progression opportunities Cons Expected to work for free week in week out (contracted to 39 hours a week and expected 50 hours give or take a few hours) simply because there is not enough budget hours to get all the jobs done and to have sufficient cover on the shop floor at the same time. Sales go up budget hours go down year after year Mary Gober toolkit great in principle but not so much in practice, each store is different and it's impossible to implement the format to every store Advice to Management Review hours budget so management don't have to be expected to work for free And/Or increase management contracted hours to 45 like a pharmacy manager and with that a pay rise for the difference Review Mary gober toolkit on your average customer to see what works and what doesn't", "rating": 3, "pros": "Wants to be the best company", "cons": "Expected to work for free week in week out (contracted to 39 hours a week and expected 50 hours give or take a few hours) simply because there is not enough budget hours to get all the jobs done and to have sufficient cover on the shop floor at the same time.", "advice": "Review hours budget so management don't have to be expected to work for free"}, {"title": "Upper Management", "text": "Pros Staff discount on products (10% branded, 30% own brand and exclusive). Competitions throughout the year. Yearly bonus depending on performance in key areas. Fast paced career ladder with accessible training. Hub (social network) for all Superdrug staff. Personal radio station for Superdrug. Cons Stupidly low hours to cover stores, esp for workload and standards expected. Majority of stores have outside concessions in for beauty services which are often poorly run and trained. Awful standard of equipment provided to work with. (Till system, back office, guns, internet,etc) Encouraged to only give out 4 hour shifts and contracts to sales staff. Shrinkage is a big issue for Superdrug, little support given. Upper management is salaried at 39 hours, however majority do a lot more which is expected from the company. Often leaving higher management working for free and 3-5 grand a year worse off. Yearly bonus is only for management, sales staff miss out even through they are the backbone of the company. Product and shrinkage training has been made interpersonal with two minute multiple questions on iPads which often don't work. Staff areas are often run down. Advice to Management We have been extremely profitable these last few years, yet hours have reduce and pay does not reflect this. If hours increased we could really concentrate on getting better shrinkage, beautycard, empty handers, standards and most importantly profit. Otherwise I fear we will hit a ceiling. People will leave, customers and staff alike.", "rating": 3, "pros": "Staff discount on products (10% branded, 30% own brand and exclusive).", "cons": "Stupidly low hours to cover stores, esp for workload and standards expected.", "advice": "We have been extremely profitable these last few years, yet hours have reduce and pay does not reflect this. If hours increased we could really concentrate on getting better shrinkage, beautycard, empty handers, standards and most importantly profit. Otherwise I fear we will hit a ceiling. People will leave, customers and staff alike."}, {"title": "Sales Assistant", "text": "Pros Easy work and flexible shifts most weeks. Most staff very friendly. Courses available to undertake whilst you are there. Cons Per hour wage is not very good and and easy work can mean boring, tedious shifts! Bank holiday work is also an inconvenience if relying on public transport. Advice to Management There needs to be more staff on busy weekends and there also needs to be security guards, as lots of shoplifters.", "rating": 3, "pros": "Easy work and flexible shifts most weeks. Most staff very friendly. Courses available to undertake whilst you are there.", "cons": "Per hour wage is not very good and and easy work can mean boring, tedious shifts! Bank holiday work is also an inconvenience if relying on public transport.", "advice": "There needs to be more staff on busy weekends and there also needs to be security guards, as lots of shoplifters."}, {"title": "A company of two halves", "text": "Pros If you're driven, work hard and willing to swallow your pride a lot then you'll get far. Plenty of opportunities for people who aren't willing to complain and will just get on with it. Cons Shifts can be very flexible, at Team Leader level you're not paid much and can be expected to take on nearly all the duties of an Assistant Manager, The management styles can vary greatly from store to store, I was once shouted at on the shop floor by my store manager for not chasing a customer down the street when she set off the door alarms on her way out. I also had an assistant manager tell me I was an idiot infront of a customer when I made a mistake on the till. Advice to Management Your people are your strength, they work incredibly hard to keep everything moving and the company could do better to recognise good customer service on a store level rather than nitpicking and jumping on staff when they make mistakes.", "rating": 3, "pros": "If you're driven, work hard and willing to swallow your pride a lot then you'll get far.", "cons": "Shifts can be very flexible, at Team Leader level you're not paid much and can be expected to take on nearly all the duties of an Assistant Manager,", "advice": "Your people are your strength, they work incredibly hard to keep everything moving and the company could do better to recognise good customer service on a store level rather than nitpicking and jumping on staff when they make mistakes."}, {"title": "Never be a designate manager!!! Always make sure you have a set store.", "text": "Pros Discounts - 30% own brand and exclusive, 10% across everything else Nice staff I enjoyed working on makeup and making sure it was clean and tidy wherever I could Store managers supportive Cons Lack of communication from above Not enough hours provided to have the shop covered Long hours, short breaks. 30 minutes for 11 hours (if I was lucky not to be the only manager in) If someone calls in sick you have to come in regardless of holiday/day off Cleanliness of stores and back of house Constant active selling of \"star buys\" Lack of Security Very old processes with regards to stock control . Delivery just sends things in. No way of too much stocking it Search your bags, pockets and shoes upon leaving the business - made me feel like there was a lack of trust and it was very intrusive Some stores self banking - had to carry large amounts of money to the bank and made me certainly feel uncomfortable walking with at least 500£ in cash with me. Advice to Management My manager was the area manager - communication with your managers is crucial! Kept hearing through other people what was happening and had 4 stores calling me up at the same time saying I was supposedly with them. AM was very disorganised and I spoke to him numerous times about my concerns. End of the day they lost a good worker If the company is doing so well with their profits, invest that in decent back of house ammenities. Some stores had no lights working in the bathroom or heating at all. Also invest in more hours for staff to cover first aisle and to get more people in to cover the shop. So much is put on assistant managers and store managers working 50+ hours a week and not being paid for anything over 38. Increase pay budgets for managers Stock takes can see managers working 7am until early hours of the next morning. Only to return at 7 again. Break of the working time directive 100% Overall the job I did had the potential to be good but fell below the line. Had to leave as I was bored stiff. Shops are dead half the time.", "rating": 3, "pros": "Discounts - 30% own brand and exclusive, 10% across everything else", "cons": "Lack of communication from above", "advice": "My manager was the area manager - communication with your managers is crucial! Kept hearing through other people what was happening and had 4 stores calling me up at the same time saying I was supposedly with them. AM was very disorganised and I spoke to him numerous times about my concerns. End of the day they lost a good worker"}, {"title": "sales advisor", "text": "Pros good working friendly staff benefits good working friendly staff benefits Cons long hours tough targets rubbish hour rates", "rating": 5, "pros": "good working", "cons": "long hours", "advice": null}, {"title": "enjoyable experience", "text": "Pros hours were very flexible Cons store gets extremely busy", "rating": 5, "pros": "hours were very flexible", "cons": "store gets extremely busy", "advice": null}, {"title": "Pharmacy assistant", "text": "Pros Good training Innovative company Flexible working Cons Sometimes bad mangement Need to give more pay to staff Hours can be cut anytime without notice", "rating": 5, "pros": "Good training", "cons": "Sometimes bad mangement", "advice": null}, {"title": "Varys store to store", "text": "Pros Good discount Good ladder climbing Overtime in other stores If you get a good manager can be very flexible and helpful Cons Very head in the clouds Mary Gober training that clearly does not work on the shop floor. Ask the customers. Decreasing hours yet increase in shoppers Bare minimum wages, Team Leader wage is only 30p more than sales advisor Equipment doesn't work, Tills run on a wing and a prayer, HHT's slow tasks down, iPads are pointless and never fixed. Active selling and Beautycards, Customers hate it, Advice to Management Ask REAL customers about Mary Gober toolkit. Ask Real customers if they like the active selling, ask REAL customers if they want to be bombarded by all the questions at the till point. TALK and listen to your staff when they say, This is a terrible idea. Raise wages to similar for all ages, stop hiring staff on 4 hour contracts otherwise they will leave or you will end up hiring schoolkids who couldn't care less.", "rating": 3, "pros": "Good discount", "cons": "Very head in the clouds Mary Gober training that clearly does not work on the shop floor. Ask the customers.", "advice": "Ask REAL customers about Mary Gober toolkit. Ask Real customers if they like the active selling, ask REAL customers if they want to be bombarded by all the questions at the till point. TALK and listen to your staff when they say, This is a terrible idea. Raise wages to similar for all ages, stop hiring staff on 4 hour contracts otherwise they will leave or you will end up hiring schoolkids who couldn't care less."}, {"title": "Not Bad Part Time", "text": "Pros I had a good team at my branch though this can vary. Standard customer service/store assistant work. Reletively good discount benefits. Cons No particular benefits from working on national holidays.", "rating": 5, "pros": "I had a good team at my branch though this can vary. Standard customer service/store assistant work. Reletively good discount benefits.", "cons": "No particular benefits from working on national holidays.", "advice": null}, {"title": "No employee benefits at all", "text": "Pros management were nice get paid every friday which is nice Cons management are too pushy to actively sell - no one wants cheap perfume! Advice to Management Treat staff like human beings", "rating": 1, "pros": "management were nice", "cons": "management are too pushy to actively sell - no one wants cheap perfume!", "advice": "Treat staff like human beings"}, {"title": "Store manager", "text": "Pros The great people you get to work with, Customers you get to know on daily basis Great new products, Good discounts, Potential to earn an annual bonus if you meet company targets Cons Hours being streamlined, workload sometimes to heavy, salaried employees expected to pick up the slack and work 10-15 hours a week for free, Lack of investment in profitable stores, More praise for good performance would go an awful long way Advice to Management We are not robots, try treating us as you would like to be treated.", "rating": 5, "pros": "The great people you get to work with,", "cons": "Hours being streamlined, workload sometimes to heavy, salaried employees expected to pick up the slack and work 10-15 hours a week for free,", "advice": "We are not robots, try treating us as you would like to be treated."}, {"title": "meh", "text": "Pros discount good ish pay i suppos Cons not flexible manager not very nice", "rating": 3, "pros": "discount good ish pay i suppos", "cons": "not flexible manager not very nice", "advice": null}, {"title": "sales advisor", "text": "Pros Staff discount, opportunities to better your position/status, working with super nice people, everything's very professional Cons Shifts can be repetitive and long which is to be expected but can be boring if you're not okay with that sort of thing Advice to Management At the moment, I currently have no advice for management", "rating": 5, "pros": "Staff discount, opportunities to better your position/status, working with super nice people, everything's very professional", "cons": "Shifts can be repetitive and long which is to be expected but can be boring if you're not okay with that sort of thing", "advice": "At the moment, I currently have no advice for management"}, {"title": "Do. Not. Apply.", "text": "Pros Occasional good discount on Superdrug exclusive brands If you love makeup it is a perk to work there Cons Rude managers Constantly expected to ask customers if they want up to 3 different products at the tills - humiliating!! Expected to come in IN YOUR OWN TIME to have 'team meetings' but wouldn't get paid and used to cost me £5 bus fare Lazy supervisors and manages that sit in the office Made to stand at the door (even in winter) to pester customers into buying fragrances At the end of your shift when managers are cashing up tills your expected to wait for them until you can be allowed out of the store up to 25 minutes, fair enough for safety but at least pay us for this time!! Last but not least, MINIMUM WAGE Advice to Management Stop being so tight and trying to save money, treat your staff well!!", "rating": 1, "pros": "Occasional good discount on Superdrug exclusive brands", "cons": "Rude managers", "advice": "Stop being so tight and trying to save money, treat your staff well!!"}, {"title": "Could be so much better!", "text": "Pros *Discount on branded (10%) & Own-brand (30%) products. *Some great team mates! Sadly the Pros end there. Cons *Low hourly contracts. *Minimum wage. *Sparse overtime availability. *Busier stores will not have adequate cover for cashiers / floor staff. *Poorly equipped - HHTs only work sporadically & the iPads even less! The tills are a disgrace - if there is one aspect of a business that should be totally on point this should be it; the very thing that allows said business to take revenue, sadly this is not the case here. The EPOS system within is utterly astounding. For a busy high street chain store (owned by an international group such as A. S. Watson) the tills perform so defectively you find yourself apologising to customers on a daily basis. It's embarrassing. *Expected to interrogate / bombard customers at the till, thinly veiled as 'customer service'. *Team-leaders are not paid much more than a sales adviser despite the greater workload / responsibilities. *Senior management will be expected to work overtime for no extra pay (salaried). *Store managers with a passion for what they do will have that bludgeoned out of them by area managers who don't know how to offer praise. Overall, the company cares more about profit than it does for its staff who generate it. Advice to Management Lead with a carrot, don't hit with a stick.", "rating": 3, "pros": "*Discount on branded (10%) & Own-brand (30%) products.", "cons": "*Low hourly contracts.", "advice": "Lead with a carrot, don't hit with a stick."}, {"title": "Good most of the time", "text": "Pros Good discount first to get reduced stock Cons Long hours around the holidays Repetitive Long hours Advice to Management Don't expect employees who don't drive to work on days there is no public transport. Close on the days if necessary", "rating": 3, "pros": "Good discount", "cons": "Long hours around the holidays", "advice": "Don't expect employees who don't drive to work on days there is no public transport. Close on the days if necessary"}, {"title": "Look elsewhere", "text": "Pros Not many to be honest Cons I have resigned from my assistant manager position. I can't work for someone that does not trust or motivate people. I can't blame the company because perhaps my experience would have been better elsewhere. Advice to Management Have manners. Engage with your colleagues.", "rating": 1, "pros": "Not many to be honest", "cons": "I have resigned from my assistant manager position.", "advice": "Have manners."}, {"title": "sales advior", "text": "Pros ok discount 30% own brand 10% branded Cons never take people on bigger contracts between 4-16 hours in this day in age u cant live on that star buys u get push to sell cos company wants all that extra money as company they don't care about staff all care about team leaders and mangers rest are northing to them they never reward u I left good job to work at this company and I so regret it Advice to Management treat staff more fairly", "rating": 1, "pros": "ok discount 30% own brand", "cons": "never take people on bigger contracts between 4-16 hours in this day in age u cant live on that", "advice": "treat staff more fairly"}, {"title": "Team Leader", "text": "Pros Good staff discount, staff are lovely. Cons Managers treat you as a slave, everything is your fault. Too much pressure to get the ginormous work load done and no appraisal once completed. A day off is not sacred as 9 times out of 10 you get called to cover as they have once again messed up the rota. Advice to Management Treat your staff with respect and they might treat you the same way!", "rating": 1, "pros": "Good staff discount, staff are lovely.", "cons": "Managers treat you as a slave, everything is your fault. Too much pressure to get the ginormous work load done and no appraisal once completed. A day off is not sacred as 9 times out of 10 you get called to cover as they have once again messed up the rota.", "advice": "Treat your staff with respect and they might treat you the same way!"}, {"title": "Bad experience", "text": "Pros The discount Most of the girls were lovely except management! Some nice customers Cons The Management and Supervisors were horrible to work along with. Manager lies twists the truth Advice to Management Be nicer to staff so staff wont leave.", "rating": 3, "pros": "The discount", "cons": "The Management and Supervisors were horrible to work along with.", "advice": "Be nicer to staff so staff wont leave."}, {"title": "Alright", "text": "Pros • 30 % off superdrug exclusives • first access to reduced items and re stocks • if your team is good, then work atmosphere is great Cons • poor pay • they expect too much from you • staff areas are poor, ill kept and incredibly small in some new stores even if the store itself is large • holidays are hard to get Advice to Management Give the staff more flexibility and don't overwork them. Staff should be a priority because when staff are well treated and happy their service in general is better", "rating": 3, "pros": "• 30 % off superdrug exclusives", "cons": "• poor pay", "advice": "Give the staff more flexibility and don't overwork them. Staff should be a priority because when staff are well treated and happy their service in general is better"}, {"title": "Sales Advisor", "text": "Pros It was a fun and friendly environment, working with nice customers and lovely co-workers in a nice area of Glasgow. Cons Sometimes it got a bit repetitive doing the same tasks all day every day, and it was tiresome dealing with difficult and unreasonable customers. Advice to Management The management in my experience at Superdrug treated their staff very well, and with lots of respect. But sometimes they have to listen more to their employees.", "rating": 5, "pros": "It was a fun and friendly environment, working with nice customers and lovely co-workers in a nice area of Glasgow.", "cons": "Sometimes it got a bit repetitive doing the same tasks all day every day, and it was tiresome dealing with difficult and unreasonable customers.", "advice": "The management in my experience at Superdrug treated their staff very well, and with lots of respect. But sometimes they have to listen more to their employees."}, {"title": "Christmas Temp", "text": "Pros Fun friendly people customers nice Hours are suitable and flexible if your a student Cons Very hard at pushing sales feel like your bugging the customers Work was sometimes boring when not on the tills Advice to Management have more of a lead on things", "rating": 5, "pros": "Fun friendly people", "cons": "Very hard at pushing sales feel like your bugging the customers", "advice": "have more of a lead on things"}, {"title": "sales adviser", "text": "Pros great benefits, excellent salary, good work environment, Cons not enough hours, inconsistent work pattern Advice to Management none", "rating": 5, "pros": "great benefits, excellent salary, good work environment,", "cons": "not enough hours, inconsistent work pattern", "advice": "none"}, {"title": "Do not reccomend", "text": "Pros - 30% off exclusives That's all that comes to mind Cons - Awful pay for 16-21 year olds - Low hour contracts so holidays are low paid - Too much pressure put on targets and no reward for meeting them - Promises are made but never kept - Repetitive tasks Advice to Management Stop treating your staff so badly - respect is a two way street. Don't make promises you can't keep. Treat your younger staff as equals. Actually do some work yourself for a change.", "rating": 1, "pros": "- 30% off exclusives", "cons": "- Awful pay for 16-21 year olds", "advice": "Stop treating your staff so badly - respect is a two way street. Don't make promises you can't keep. Treat your younger staff as equals. Actually do some work yourself for a change."}, {"title": "Constant harassment", "text": "Pros Employee's were great fun, shifts were fast paced, a few good managers Customers were sympathetic, someone from upper management may visit once a year. Cons Poorly ran business, often called in to shift; on arrival told they were mistaken, rota's changed 12 hours before shifts with no notification, Pressured sales pitch at tills \"Like a bag? Have a beauty card? Have you seen our offer on X? Would you like to top-up your phone or buy any stamps? How are you today?\" Even if customer was on the phone, speaking with friends or purchasing one item, it was incredibly rushed. Told to never point a customer to items and walk them over, when you walked a customer over you were \"wasting time\" Advice to Management There are too many managers, too much asked of sales staff and too little given in return. in terms of pay or responsibility, cut down management team; serious issues of bullying within the workplace that should be addressed.", "rating": 3, "pros": "Employee's were great fun, shifts were fast paced, a few good managers", "cons": "Poorly ran business, often called in to shift; on arrival told they were mistaken, rota's changed 12 hours before shifts with no notification,", "advice": "There are too many managers, too much asked of sales staff and too little given in return. in terms of pay or responsibility, cut down management team; serious issues of bullying within the workplace that should be addressed."}, {"title": "Good money", "text": "Pros Good pay rate, fair discount on own brand products or exclusives, helpful team members and good chances to grow professionally Cons Poor management, no training given to the new team members, they never let you go home on time even when you have already finished your job and they never pay extra hour when it's requested to stay longer to help management completing tasks.", "rating": 3, "pros": "Good pay rate, fair discount on own brand products or exclusives, helpful team members and good chances to grow professionally", "cons": "Poor management, no training given to the new team members, they never let you go home on time even when you have already finished your job and they never pay extra hour when it's requested to stay longer to help management completing tasks.", "advice": null}, {"title": "Sales advisor", "text": "Pros You do work with some very energetic people, in a lovely atmosphere (depending on your store though) Cons You get no actual time to spend and get to know your team", "rating": 5, "pros": "You do work with some very energetic people, in a lovely atmosphere (depending on your store though)", "cons": "You get no actual time to spend and get to know your team", "advice": null}, {"title": "Standard retail business", "text": "Pros 10% discount, Occasional free goodies, Mostly cheaper than other similar stores on the high street Cons Unrealistic targets of registering beauty cards and selling the daily or weekly 'star buys', Long boring shifts stood at tills with half hour only for lunch whilst only being paid minimum wage makes you feel hugely unappreciated, If management didn't like you, you were not allowed to do other things like help sort deliveries and help perform safe checks, Hard to move up into higher positions Advice to Management Stop having favourites and make work enjoyable and fair for everyone", "rating": 3, "pros": "10% discount,", "cons": "Unrealistic targets of registering beauty cards and selling the daily or weekly 'star buys',", "advice": "Stop having favourites and make work enjoyable and fair for everyone"}, {"title": "Great company", "text": "Pros Friendly staff and work environment Cons I can't think of any Advice to Management n/a", "rating": 5, "pros": "Friendly staff and work environment", "cons": "I can't think of any", "advice": "n/a"}, {"title": "Great", "text": "Pros They have a great staff discount my manager and everyone else is really friendly here Cons A lot of overtime", "rating": 5, "pros": "They have a great staff discount my manager and everyone else is really friendly here", "cons": "A lot of overtime", "advice": null}, {"title": "It has its ups and downs!", "text": "Pros Discounts Uniforms is quite good as well, you can wear what you want as long as it's black The jobs is nice for most of the aspects Cons Really long hours standing. Shifts are not flexible! I found myself doing the same shift for weeks, and it's bad if you also have a life outside the workplace. Not really flexible if you are a student, as you will be called to cover shifts almost all the time cause the shops are badly understaffed. Huge turnover. BIG PRESSURE imposed by manager for selling starbuys and beauty cards. Sometimes you can't talk to your colleagues, depending on the manager that you get! so it can get pretty boring to work for 9 hours and not have a chance to exchange 2 words with someone. No holidays during the Christmas period. Advice to Management Give commissions to people to motivate them more to sell star buys and beauty cards, because the pressure from management is extremely not-motivating and stressful.", "rating": 5, "pros": "Discounts", "cons": "Really long hours standing.", "advice": "Give commissions to people to motivate them more to sell star buys and beauty cards, because the pressure from management is extremely not-motivating and stressful."}, {"title": "Not as bad as you think, but still pretty bad.", "text": "Pros Great discount, friendly tight-knit team. Uniform is fairly lenient, flexible hours. Cons Say good bye to out of work commitments, you will be expected to start work at 6am on delivery days and stay til 10pm once a month. As junior management you will probably work all Sundays too. Service at the till is drilled into you and very repetitive/monotonous. Pay is absolutely awful - 35p an hour above sales assistants!!! All managers care about is passing audit and selling star buys. Advice to Management If you are going to ask your employees to hustle at the tills for sales, at least pay them the commission they deserve. Minimum wage is not enough to live on, you can't treat your employees like numbers, and your pay system is shocking.", "rating": 3, "pros": "Great discount, friendly tight-knit team. Uniform is fairly lenient, flexible hours.", "cons": "Say good bye to out of work commitments, you will be expected to start work at 6am on delivery days and stay til 10pm once a month. As junior management you will probably work all Sundays too. Service at the till is drilled into you and very repetitive/monotonous. Pay is absolutely awful - 35p an hour above sales assistants!!! All managers care about is passing audit and selling star buys.", "advice": "If you are going to ask your employees to hustle at the tills for sales, at least pay them the commission they deserve. Minimum wage is not enough to live on, you can't treat your employees like numbers, and your pay system is shocking."}, {"title": "Taken advantage of.", "text": "Pros Not very many. Good discount, 10% on branded goods and 30% on own brand and exclusive products. Cons Overworked! Every year the company cut the hours stores have to run on each week, leaving the management teams to pick up the slack as they are salaried. Far too much task for store teams every week. The company runs a mystery shop programme and most of the time, there are no staff on the floor to allow you to score realistically. Too much pressure on registering beauty cards and selling star buys as well. Red circled management with regards to pay rises. No pay rise for 8 years so far despite performance reviews that merit getting a pay rise. Advice to Management Start reinvesting hours in to the stores again. More people equals greater sales, better service and reduced shrinkage! It's common sense really! Start listening to the store teams feedback and reacting on it! Fastest growing health and beauty retailer in the UK, start rewarding the teams by reinvesting hours in to stores to allow them to do their job properly!", "rating": 3, "pros": "Not very many. Good discount, 10% on branded goods and 30% on own brand and exclusive products.", "cons": "Overworked! Every year the company cut the hours stores have to run on each week, leaving the management teams to pick up the slack as they are salaried. Far too much task for store teams every week. The company runs a mystery shop programme and most of the time, there are no staff on the floor to allow you to score realistically. Too much pressure on registering beauty cards and selling star buys as well. Red circled management with regards to pay rises. No pay rise for 8 years so far despite performance reviews that merit getting a pay rise.", "advice": "Start reinvesting hours in to the stores again. More people equals greater sales, better service and reduced shrinkage! It's common sense really! Start listening to the store teams feedback and reacting on it! Fastest growing health and beauty retailer in the UK, start rewarding the teams by reinvesting hours in to stores to allow them to do their job properly!"}, {"title": "Superdrug Sales Advisor", "text": "Pros Brilliant work enviroment Very flexible Great team - made lots of friends Cons Not as much freedom to contribute to ideas Not much overtime out of Christmas season Advice to Management Keep doing what you're doing, brilliant", "rating": 5, "pros": "Brilliant work enviroment", "cons": "Not as much freedom to contribute to ideas", "advice": "Keep doing what you're doing, brilliant"}, {"title": "Good first job", "text": "Pros Often flexible with hours. Relaxed atmosphere. Paid weekly which is very useful. The work is very straightforward so it is easy to get a good understanding of the job quickly. Training is provided but if you need any help everyone is willing to answer any questions you may have. Cons Wage is a little low but decent enough to give a little extra in your pocket per week. There is sometimes a high turn over at certain points throughout the year so sometimes there were times when there were not enough staff working.", "rating": 5, "pros": "Often flexible with hours.", "cons": "Wage is a little low but decent enough to give a little extra in your pocket per week.", "advice": null}, {"title": "Not Bad, but could be improved", "text": "Pros Excellent progression opportunities Possibility to work overtime Cons Low wage Extremely fast paced and stressful environment", "rating": 3, "pros": "Excellent progression opportunities", "cons": "Low wage", "advice": null}, {"title": "Good first job experience", "text": "Pros - many things to do; always busy. - friendly staff. - big discount on own brands. - lots of retail skills easily learnt. Cons - on your feet all day. - short breaks. - management has you doing everything from tills to cleaning. - little consideration for students who also have college / uni to go to. Advice to Management - less demanding with shifts. - come on the tills when you can see the shop is busy. - form relationships with younger staff rather than talk down to them.", "rating": 3, "pros": "- many things to do; always busy.", "cons": "- on your feet all day.", "advice": "- less demanding with shifts."}, {"title": "Sales Advisor", "text": "Pros -friendly co-workers-small store so every one was close -fun environment -reasonable discount Cons -low pay for the amount of work put in- only £4.68 for under 18 -random hours-doesn't comply with contracted hours -unprofessional management -pressure to sell and recruit beauty cards -no extra pay for bank holidays or christmas Advice to Management more organized and professional regarding hours and supporting staff", "rating": 3, "pros": "-friendly co-workers-small store so every one was close", "cons": "-low pay for the amount of work put in- only £4.68 for under 18", "advice": "more organized and professional regarding hours and supporting staff"}, {"title": "Average", "text": "Pros Good to work with variety of products. Not too bad employee discount. Cons Very target based, too many questions at the till", "rating": 3, "pros": "Good to work with variety of products. Not too bad employee discount.", "cons": "Very target based, too many questions at the till", "advice": null}, {"title": "Super Nothing", "text": "Pros Reasonable discount which increases time to time and is higher on own label, staff communication events, Christmas parties off site. Cons Poorly maintained head office opposite sewage farm, oppressive searches at exit, unsupportive middle management, threats of 'when xx sees this' Advice to Management Listen to and support others.", "rating": 3, "pros": "Reasonable discount which increases time to time and is higher on own label, staff communication events, Christmas parties off site.", "cons": "Poorly maintained head office opposite sewage farm, oppressive searches at exit, unsupportive middle management, threats of 'when xx sees this'", "advice": "Listen to and support others."}, {"title": "Superdrug Sales Advisor role", "text": "Pros good team; superdrug radio keep spirits up while on the shop floor Cons low hourly rates; management overworked", "rating": 3, "pros": "good team; superdrug radio keep spirits up while on the shop floor", "cons": "low hourly rates; management overworked", "advice": null}, {"title": "Best team", "text": "Pros staff discount, occasional freebies, training Cons active selling, big focus on customer service and beautycard registrations", "rating": 5, "pros": "staff discount, occasional freebies, training", "cons": "active selling, big focus on customer service and beautycard registrations", "advice": null}, {"title": "potential but doesnt look after staff", "text": "Pros It's a great company that is on a constant time, fast growing and always improving. It makes their customers number one priority and gives its staff opportunity to grow and go up the ladder. Cons They need to look into some members of staff a training or investigation especially the members of management. There are some that abuse their position of power and when a complaint is done nothing ever comes out of it. There is so much problems caused or witnessed by members of management that could easily resolved but unfortunately nothing is done. The is also discrimation, bullying, favouritism and double standards. I thought everyone is suppose to be treated equally. It's either we get suppressed and keep quiet and keep on suffering or we speak up and either have nothing done about the situation and get treated badly because we complained or we leave the company because we are fed up of all the nonsense that goes on. This is not why we come to work, to be stressed and belittled. Superdrug needs to look into taking care of their staff and listen and do something about a complaint because there are only a few that are brave enough to speak up about what is truly going on in the different stores. Advice to Management Need to be more professional, and treat all their staff equally.", "rating": 3, "pros": "It's a great company that is on a constant time, fast growing and always improving. It makes their customers number one priority and gives its staff opportunity to grow and go up the ladder.", "cons": "They need to look into some members of staff a training or investigation especially the members of management. There are some that abuse their position of power and when a complaint is done nothing ever comes out of it. There is so much problems caused or witnessed by members of management that could easily resolved but unfortunately nothing is done. The is also discrimation, bullying, favouritism and double standards. I thought everyone is suppose to be treated equally. It's either we get suppressed and keep quiet and keep on suffering or we speak up and either have nothing done about the situation and get treated badly because we complained or we leave the company because we are fed up of all the nonsense that goes on. This is not why we come to work, to be stressed and belittled. Superdrug needs to look into taking care of their staff and listen and do something about a complaint because there are only a few that are brave enough to speak up about what is truly going on in the different stores.", "advice": "Need to be more professional, and treat all their staff equally."}, {"title": "nice place to work", "text": "Pros good team, flexible hours,customer service,different days of work, Cons poor management, poor training,difficult customers ,long shifts", "rating": 3, "pros": "good team, flexible hours,customer service,different days of work,", "cons": "poor management, poor training,difficult customers ,long shifts", "advice": null}, {"title": "Work Experience - Barkingside", "text": "Pros As a then-14 year old, it was uneasy to work in an environment different from secondary school but the staff were very friendly and helped make the transition easier. The school organised a temporary placement of 2 weeks and it was very enjoyable. > Friendly Staff > Located on High Road, several stores and fast food chains nearby. Cons > Break Room was quite small and limited. > Store Atmosphere is very dry, not much going on.", "rating": 3, "pros": "As a then-14 year old, it was uneasy to work in an environment different from secondary school but the staff were very friendly and helped make the transition easier. The school organised a temporary placement of 2 weeks and it was very enjoyable.", "cons": "> Break Room was quite small and limited.", "advice": null}, {"title": "Superdrug feeling", "text": "Pros Great training and development, great \"win as one Superdrug\" attitude. Cons Very little cons any retail is hard you have to be passionate about retail to be in it Advice to Management Compliancy, organisational and leadership skills are essential for this job", "rating": 5, "pros": "Great training and development, great \"win as one Superdrug\" attitude.", "cons": "Very little cons any retail is hard you have to be passionate about retail to be in it", "advice": "Compliancy, organisational and leadership skills are essential for this job"}, {"title": "Minimum Wage, Maximum Effort.", "text": "Pros Some nice folk to work with, and occasionally a good song would come on. Cons Very pretentious customer service standards without the wages to match it, resulting in exhaustion and low morale. Advice to Management If the shop is quiet, please let me take a moment in the staff room with a glass or water or a cigarette outside, break or no break. You can't afford to treat people the demanding way that you do on minimum wage.", "rating": 3, "pros": "Some nice folk to work with, and occasionally a good song would come on.", "cons": "Very pretentious customer service standards without the wages to match it, resulting in exhaustion and low morale.", "advice": "If the shop is quiet, please let me take a moment in the staff room with a glass or water or a cigarette outside, break or no break. You can't afford to treat people the demanding way that you do on minimum wage."}, {"title": "Stressful", "text": "Pros There is a Friendly atmosphere amongst staff and the discount scheme is actually very good. The training was very useful, particularly the till training and uniform is good. Cons A lot of pressure to sell and Managers put you under a lot of pressure to up sell at the till. Given forms to fill in daily about what you have sold. Stressful work environment. Advice to Management Put less pressure on staff and make the working environment a little more relaxed the staff might not dread coming to work.", "rating": 3, "pros": "There is a Friendly atmosphere amongst staff and the discount scheme is actually very good. The training was very useful, particularly the till training and uniform is good.", "cons": "A lot of pressure to sell and Managers put you under a lot of pressure to up sell at the till. Given forms to fill in daily about what you have sold. Stressful work environment.", "advice": "Put less pressure on staff and make the working environment a little more relaxed the staff might not dread coming to work."}, {"title": "Okay-ish", "text": "Pros Discount Enjoyable Can be enjoyable depending who you are with Cons Shops not given enough hours The Pay could be better Managers expect too much Advice to Management Be more realistic, you expect stores to constantly active sell, watch the shop floor, stock up when you give stores hardly any hours to do so.", "rating": 3, "pros": "Discount", "cons": "Shops not given enough hours", "advice": "Be more realistic, you expect stores to constantly active sell, watch the shop floor, stock up when you give stores hardly any hours to do so."}, {"title": "Former Assistant Manager", "text": "Pros Staff Discount Card Friendly Staff to work with Good customers Chance to advance to management within store Good training with right manager Cons Not enough hours for stores: Managers & Assistant Managers work 50 hour weeks, but get paid for 39. Don't get that time back and I've had to take an unpaid holiday even though I worked 70+ hours in week before Christmas and only got paid for 39 hours. Only two staff in some times, customers do not get the service they deserve because of this. Area managers hopeless, do not listen to people below. They just swan in and out and don't actually do a great deal. Have favourites, who tend to be better treated. Also have asked members of staff to lie when a store was under investigation to save own skin. Some members of staff were on 3 hour contracts, which the manager then wanted to cut to 2.5 hour contracts?! What's the point of a person coming in for 2.5 hours a week. Bonuses are a joke, don't actually know of anyone obtaining them in my area. Advice to Management Treat your staff better and your customers better. Reward your staff for hard work. Review Area Managers and make them work for the the high pay they're on.", "rating": 3, "pros": "Staff Discount Card", "cons": "Not enough hours for stores:", "advice": "Treat your staff better and your customers better."}, {"title": "Superdrug", "text": "Pros Company is fast paced, has great products & majority of stores have great atmosphere with team & environment. Definitely going places within sector. Good company to work for. Cons Value of team sometimes overlooked. Hours are long & budget for team hours is reduced so creates pressure to perform with limited resource, especially around shrinkage & service. Process can be time consuming. Not really family friendly with regards to hours if full time. Advice to Management Brilliant team to work in, need to be flexible to keep up with demands of role. You get out what you put in & are able to achieve a great bonus if you're on target. Not so great if you have children & want to work in management.", "rating": 5, "pros": "Company is fast paced, has great products & majority of stores have great atmosphere with team & environment. Definitely going places within sector. Good company to work for.", "cons": "Value of team sometimes overlooked. Hours are long & budget for team hours is reduced so creates pressure to perform with limited resource, especially around shrinkage & service. Process can be time consuming. Not really family friendly with regards to hours if full time.", "advice": "Brilliant team to work in, need to be flexible to keep up with demands of role. You get out what you put in & are able to achieve a great bonus if you're on target. Not so great if you have children & want to work in management."}, {"title": "Good people, awful environment, processes and systems", "text": "Pros Upbeat people who really do care about the Superdrug brand and work really hard to make it successful.... Nice to get lots of freebies too and regular fun events in the canteen Cons Old fashioned approach to work life balance or even just better ways of doing things - and outdated systems-horrible office but they are soon to move Advice to Management Invest in better systems and technology so that people don't burn out and leave so quickly", "rating": 1, "pros": "Upbeat people who really do care about the Superdrug brand and work really hard to make it successful.... Nice to get lots of freebies too and regular fun events in the canteen", "cons": "Old fashioned approach to work life balance or even just better ways of doing things - and outdated systems-horrible office but they are soon to move", "advice": "Invest in better systems and technology so that people don't burn out and leave so quickly"}, {"title": "sales consoltent", "text": "Pros good job opportunity to promote Cons none but somtimes not enough shift", "rating": 1, "pros": "good job opportunity to promote", "cons": "none but somtimes not enough shift", "advice": null}, {"title": "Mostly a horrible experience", "text": "Pros 30% own brand discount good. If you want more hours they can usually give them to you. Usually some staff you can get along with Cons They put you on small contracts then work you for the maximum amount of hours possible, don't consult you before adding to your rota. They push too hard for the star buys and beauty card targets to be reached but offer no incentive for staff, while not caring about the customer service as customers hate being asked these questions. You can turn up to work expecting to finish at 12 and be asked to stay til past 6 with no notice, and if you say no you will be treated badly by management. If you have other engagements such as college or Uni, they will work you every hour that you are not busy so you have no free time, and expect you to have no problem with this. Also the new training systems are ridiculous, they expect you to do a whole online course which might as well be a qualification (but isn't) of stupid obvious questions and then ask you about the chemical ingredients of their own brand products. Why would anybody need to know this?! Advice to Management Upper management need to listen to those below them, people who are working in the shop and dealing with the customers every day. Stop being selfish trying to push unrealistic targets when you don't know how the day to day runnings go.", "rating": 3, "pros": "30% own brand discount good.", "cons": "They put you on small contracts then work you for the maximum amount of hours possible, don't consult you before adding to your rota.", "advice": "Upper management need to listen to those below them, people who are working in the shop and dealing with the customers every day. Stop being selfish trying to push unrealistic targets when you don't know how the day to day runnings go."}, {"title": "Hated it", "text": "Pros The salary they offer is good, and are flexible with timings, i was able to work around my uni schedule. Cons They treat u like crap. The job itself is boring, most of the time if you're not working at tills, you're standig around doing nothing", "rating": 1, "pros": "The salary they offer is good, and are flexible with timings, i was able to work around my uni schedule.", "cons": "They treat u like crap. The job itself is boring, most of the time if you're not working at tills, you're standig around doing nothing", "advice": null}, {"title": "Sales Advisor", "text": "Pros There are friendly staff and management, good training and development from the beginning along with ongoing support, the company in general is well organised Cons Whilst there I found there was a lot to be updated to compete within the modern market however this seems to have been completed now. Advice to Management Keep bringing the company forward with modern management, products and advertising and keep up the great team atmosphere and friendly approach to new starters.", "rating": 5, "pros": "There are friendly staff and management, good training and development from the beginning along with ongoing support, the company in general is well organised", "cons": "Whilst there I found there was a lot to be updated to compete within the modern market however this seems to have been completed now.", "advice": "Keep bringing the company forward with modern management, products and advertising and keep up the great team atmosphere and friendly approach to new starters."}, {"title": "superdrug", "text": "Pros nice people discount nothing else much Cons management isn't up to scratch customers assume you're an idiot because you work there - attached stigma poor pay rate - especially for under 18's in certain stores, the tills are awful disorganised Advice to Management stop being idiots", "rating": 1, "pros": "nice people", "cons": "management isn't up to scratch", "advice": "stop being idiots"}, {"title": "Something has got to give, overworked, underpaid.", "text": "Pros Friendly team to work with, decent staff discount. Helpful ipad training learning about different products and how they work etc. Cons Far too little hours allocated to stores. Management are breaking their backs as they are salaried and are constantly working 50+ hours a week as they are the only ones who can do so as it doesn't cost the company. I don't think any of the upper managers have ever worked in store and don't realise how much stores are struggling. Team morale is at an all time low due to everyone being exhausted. Constantly phoned on your days off to cover. Always end up staying at the end of the day to cash the tills up which takes 20 minutes and you don't get paid for this. Constantly pressured to force starbuys on customers at the till, no incentives, but if you don't hit targets you're in trouble. The pay is terrible for the pressure everyone is under. I've never felt so down in my whole life and sooner or later everyone is going to break and end up leaving. Things have to change. Advice to Management Give stores more hours, pay them what they deserve and learn to respect you're in-store staff more as at the end of the day, they're the ones making you money!!", "rating": 1, "pros": "Friendly team to work with, decent staff discount. Helpful ipad training learning about different products and how they work etc.", "cons": "Far too little hours allocated to stores. Management are breaking their backs as they are salaried and are constantly working 50+ hours a week as they are the only ones who can do so as it doesn't cost the company. I don't think any of the upper managers have ever worked in store and don't realise how much stores are struggling. Team morale is at an all time low due to everyone being exhausted. Constantly phoned on your days off to cover. Always end up staying at the end of the day to cash the tills up which takes 20 minutes and you don't get paid for this. Constantly pressured to force starbuys on customers at the till, no incentives, but if you don't hit targets you're in trouble. The pay is terrible for the pressure everyone is under. I've never felt so down in my whole life and sooner or later everyone is going to break and end up leaving. Things have to change.", "advice": "Give stores more hours, pay them what they deserve and learn to respect you're in-store staff more as at the end of the day, they're the ones making you money!!"}, {"title": "Superdrug", "text": "Pros Good staff discount and loyalty programme, lots of locations, the majority of the people who work for the company do it for the product they work with. Cons Management don't understand what happens on the sales floor and how few hours there are to look after customers and provide the high level of customers service most colleagues would like to deliver as there are not enough bodies to physically do the job Advice to Management Its all well and good investing millions in customer service initiatives and training but when there is no one to deliver said service its pointless, redress the balance", "rating": 3, "pros": "Good staff discount and loyalty programme, lots of locations, the majority of the people who work for the company do it for the product they work with.", "cons": "Management don't understand what happens on the sales floor and how few hours there are to look after customers and provide the high level of customers service most colleagues would like to deliver as there are not enough bodies to physically do the job", "advice": "Its all well and good investing millions in customer service initiatives and training but when there is no one to deliver said service its pointless, redress the balance"}, {"title": "No work life balance", "text": "Pros Staff discount, Friendly colleagues, Superdrug live radio in store to try and keep spirits up. Cons Expected to work very long days everyday with no time given back and with little or no breaks. All management seem to do this and I was belittled for going home after a 9 hour shift with no lunch break being told \"It's alright for some\". In my first week I was not given a rota and worked in 3 stores, No opportunity to plan my life. First day consisted of 8 hours training on an Ipad and that was about it. Company seem to appoint young managers with no family responsibilities so they can work ridiculous hours. Stock system is a joke, Deliveries usually consist of stock that isn't needed and has to be stored in a very small warehouse. Absolutely no \"Superdrug Feeling\" Advice to Management Managers cannot be worked to the bone, there needs to be a work life balance. Store colleagues are killing themselves to make the stores run. Fix it!", "rating": 1, "pros": "Staff discount, Friendly colleagues, Superdrug live radio in store to try and keep spirits up.", "cons": "Expected to work very long days everyday with no time given back and with little or no breaks. All management seem to do this and I was belittled for going home after a 9 hour shift with no lunch break being told \"It's alright for some\". In my first week I was not given a rota and worked in 3 stores, No opportunity to plan my life. First day consisted of 8 hours training on an Ipad and that was about it. Company seem to appoint young managers with no family responsibilities so they can work ridiculous hours. Stock system is a joke, Deliveries usually consist of stock that isn't needed and has to be stored in a very small warehouse. Absolutely no \"Superdrug Feeling\"", "advice": "Managers cannot be worked to the bone, there needs to be a work life balance. Store colleagues are killing themselves to make the stores run. Fix it!"}, {"title": "Supermug", "text": "Pros Comfortable uniform and quite flexible Cons I was made to do security duties, none of which where in my job description during the winter months.", "rating": 3, "pros": "Comfortable uniform and quite flexible", "cons": "I was made to do security duties, none of which where in my job description during the winter months.", "advice": null}, {"title": "Good company, good salary, good benefits", "text": "Pros Supportive line manager, whenever I needed support or someone to ask a question/rely on, I could always contact my manager or my regional peers. Although there are very clear policies and procedures and they are strict, you never feel constricted as a store manager, we take pride in our shops and we treat them as our own, we take ownership and responsibility. Cons Workload, at times it gets crammed with paperwork, and there are certain months that there are a lot of tasks/paperwork needing to be completed. And you have to be smart with your staffing hours budget as it is tight and there are days when you there aren't enough hours in a day", "rating": 5, "pros": "Supportive line manager, whenever I needed support or someone to ask a question/rely on, I could always contact my manager or my regional peers. Although there are very clear policies and procedures and they are strict, you never feel constricted as a store manager, we take pride in our shops and we treat them as our own, we take ownership and responsibility.", "cons": "Workload, at times it gets crammed with paperwork, and there are certain months that there are a lot of tasks/paperwork needing to be completed. And you have to be smart with your staffing hours budget as it is tight and there are days when you there aren't enough hours in a day", "advice": null}, {"title": "Superdrug", "text": "Pros Superdrug is a very good place to work for experience in retail, some of the jobs that you are required to do are easy such as stocking shelves, working the tills, helping with delivery and helping customers. Cons Sometimes there are not enough hours in your shift to complete all the tasks, when your on the tills you are required to ask every customer if they are interested in fragrances which I think can be very pressurising and most customers can find it overwhelming to be asked so many questions at the till. Advice to Management I would advise management to be smart with their shop spacing, in smaller stores there is a lot of space that could be utilised and more product could be put out on the shop floor.", "rating": 3, "pros": "Superdrug is a very good place to work for experience in retail, some of the jobs that you are required to do are easy such as stocking shelves, working the tills, helping with delivery and helping customers.", "cons": "Sometimes there are not enough hours in your shift to complete all the tasks, when your on the tills you are required to ask every customer if they are interested in fragrances which I think can be very pressurising and most customers can find it overwhelming to be asked so many questions at the till.", "advice": "I would advise management to be smart with their shop spacing, in smaller stores there is a lot of space that could be utilised and more product could be put out on the shop floor."}, {"title": "Beauty Consultant", "text": "Pros Always something to do, team work Cons too much push posture on customers due to star buys, very poor salary, banking holiday, sunday not double paid", "rating": 3, "pros": "Always something to do, team work", "cons": "too much push posture on customers due to star buys, very poor salary, banking holiday, sunday not double paid", "advice": null}, {"title": "Far too pedantic.", "text": "Pros Discount was ok and most of the other managers on the area were lovely. They supported when it was needed and a good team effort. Cons Area manager and a select few store managers were nasty and I would label them as bullies. Absolutely awful way to run the area and you would only progress if you were part of the area managers inner circle. If I had the patience I would have taken things further to a formal complaint but nothing would change. Brown nose and it gets you everywhere. Advice to Management Assess the way you speak to staff. Never accuse them of going down \"the victim route\" when they bring up a problem with a manager that others had also expressed previously. Disgraceful treatment.", "rating": 3, "pros": "Discount was ok and most of the other managers on the area were lovely. They supported when it was needed and a good team effort.", "cons": "Area manager and a select few store managers were nasty and I would label them as bullies. Absolutely awful way to run the area and you would only progress if you were part of the area managers inner circle. If I had the patience I would have taken things further to a formal complaint but nothing would change. Brown nose and it gets you everywhere.", "advice": "Assess the way you speak to staff. Never accuse them of going down \"the victim route\" when they bring up a problem with a manager that others had also expressed previously. Disgraceful treatment."}, {"title": "Beauty Advisor", "text": "Pros good staff, nice job you dont get bother cause there is a lot to do Cons wage is too low, no room for progression in the company, not too many hours a week.", "rating": 3, "pros": "good staff, nice job you dont get bother cause there is a lot to do", "cons": "wage is too low, no room for progression in the company, not too many hours a week.", "advice": null}, {"title": "Fun!", "text": "Pros Always something to do Flexible working hours Great discount Cons Normally always short staffed, never left on time Once you say yes to covering an extra shift, management alway put you on that shift despite you doing it one off as a favour or to get some extra cash Advice to Management Hire more people, 2 or 3 people facing up the entire store is too much work", "rating": 5, "pros": "Always something to do", "cons": "Normally always short staffed, never left on time", "advice": "Hire more people, 2 or 3 people facing up the entire store is too much work"}, {"title": "Neutral", "text": "Pros Staff discount on products was a benerfit Cons Lack of training meant hard to progress", "rating": 3, "pros": "Staff discount on products was a benerfit", "cons": "Lack of training meant hard to progress", "advice": null}, {"title": "Managers only care about how they look", "text": "Pros Good base to start in retail Cons Stupid money for what you do, managers only care about how many star buys you sell and how many cards you regester and thats the only way youll get praised. Don't care if you get praised on customer service from customer and don't take time to get to know you. Advice to Management If you respect your workers and be kind to them theyll deliever.", "rating": 1, "pros": "Good base to start in retail", "cons": "Stupid money for what you do, managers only care about how many star buys you sell and how many cards you regester and thats the only way youll get praised. Don't care if you get praised on customer service from customer and don't take time to get to know you.", "advice": "If you respect your workers and be kind to them theyll deliever."}, {"title": "Too much focus on registrations and starbuys", "text": "Pros Good discount and nice colleagues Cons Management praise employees who force customers into registering beautycards and purchasing starbuys. Little emphasis placed on customer service at till and no bonuses offered for hitting or exceeding targets, only negative conversations if targets are not hit.", "rating": 3, "pros": "Good discount and nice colleagues", "cons": "Management praise employees who force customers into registering beautycards and purchasing starbuys. Little emphasis placed on customer service at till and no bonuses offered for hitting or exceeding targets, only negative conversations if targets are not hit.", "advice": null}, {"title": "Don't work here if you want a life", "text": "Pros Really want to say more here but I can't. The team are friendly and that helps your shift go quicker and the discount is ok I guess. Cons Pay is terrible!! Even if you worked over 20 hours you barely get £100. Constantly phoned by management at early hours on your day off to ask if you can cover. There is too much pressure to sell Starbuys and register beauty cards with absolutely no incentive and if you don't meet their unrealistically high target then you get negative talks by management. Management aren't organised at all the rotas are a mess and you never know what shift you're working as they change it daily this makes planning a life impossible as you end up coming into work on the wrong days as they never give you an updated version of the weekly rota. If you work any overtime sometimes they don't pay you for this overtime. Constantly short staffed usually one person is left on tills for 4 hours straight as the team leaders and managers are useless at rotating. The team leaders all have this attitude of entitlement and constantly look down on everyone else, they never go on tills as they feel it's beneath them only if an assistant manager asks them to. Team leaders are rude and create bad atmosphere feels very threatening and almost bullying. When you don't meet their targets of for example registering 20 cards EVERYDAY then you are taken to the office to have a \"talk\" so basically a bollocking even though you ask every customer. Weekends are the worst as nobody wants to work Sunday so they make the same people work EVERY Sunday as they don't complain and they only get half an hour break for working over 8 hours legally it should be an hour. Honestly never ever work here! Advice to Management Pay your staff better Hire better people for team leader positions Set achievable targets and not stupidly high ones Many staff hate working for you but they are too scared to speak up about development Don't bully your staff into buying the star buys at the end of their shift just so your figures go up", "rating": 1, "pros": "Really want to say more here but I can't. The team are friendly and that helps your shift go quicker and the discount is ok I guess.", "cons": "Pay is terrible!! Even if you worked over 20 hours you barely get £100.", "advice": "Pay your staff better"}, {"title": "A shoddy company to work for", "text": "Pros I wish i could say lots here but i simply cant. Good team members, 30% own brand discount, that's about it. Cons Low pay - even for team leaders and assistant managers!! Constant pressure to sell \"starbuys\" and give out \"beautycards\" Micro managed Constant cutting back on store hours making things difficult for staff. Contracted 39 hours for management and no paid overtime (almost all managers work overtime for nothing.... Its disgusting!!!) Advice to Management Start paying your employees a better wage!! Stop the pressure on selling star buys, or if not at least give bonuses! Stop micro managing! Give managers freedom. Pay for overtime for ALL. Stop cutting back on store hours, it makes work harder for employees while having no incentive. Superdrug has a high staff turnover......I wonder why.", "rating": 3, "pros": "I wish i could say lots here but i simply cant. Good team members, 30% own brand discount, that's about it.", "cons": "Low pay - even for team leaders and assistant managers!!", "advice": "Start paying your employees a better wage!! Stop the pressure on selling star buys, or if not at least give bonuses!"}]