[{"title": "Full-stack Developer", "text": "Pros Learn a lot of new things in this year an had a great company experience with adorable peoples. Cons As a client facing company the work hour flexibility, and possibility to do remote work is missing a bit Advice to Management Keep pushing your employee to the top", "rating": 5, "pros": "Learn a lot of new things in this year an had a great company experience with adorable peoples.", "cons": "As a client facing company the work hour flexibility, and possibility to do remote work is missing a bit", "advice": "Keep pushing your employee to the top"}, {"title": "Recruiting Company with a Plan", "text": "Pros +has an overall plan on how to differentiate itself in the market and achieve success +flat hierarchy and company leaders very approachable, happy to offer advice or even training +young company with good energy and effort put into maintaining its culture +plenty of room for company to grow, means future will have advancement potential Cons -still finding out how to achieve its goals, so day to day strategy and KPIs shift as company figures out what does and doesn't work, not good for people who cant or don't want to adapt -like most startups expect to work late regularly -office close to capacity and though they have avoided packing people in like some startups do, there will likely be an office move in the near future Advice to Management Keep a bit more of an open ear to the team when they say something Is or Isnt working, seems like it takes some time before they are taken seriously.", "rating": 5, "pros": "+has an overall plan on how to differentiate itself in the market and achieve success", "cons": "-still finding out how to achieve its goals, so day to day strategy and KPIs shift as company figures out what does and doesn't work, not good for people who cant or don't want to adapt", "advice": "Keep a bit more of an open ear to the team when they say something Is or Isnt working, seems like it takes some time before they are taken seriously."}, {"title": "Would not recommend", "text": "Pros The location of the office is quite cool... Cons Some people seem frustrsted and hostile there. Management always \"knows\" best and employees have almost no voice (Which i assume leads to being hostile). A culture of smart, innovative startup is forced, but it's just a sugarcoat. From welcoming to farewell, I had only cringing conversations with the management. Felt personal, immature and unprofessional. Advice to Management Stop belittling people. Be transparent. Learn how to be leaders. Gain the real respect of your team, not only because you are the boss.", "rating": 1, "pros": "The location of the office is quite cool...", "cons": "Some people seem frustrsted and hostile there. Management always \"knows\" best and employees have almost no voice (Which i assume leads to being hostile).", "advice": "Stop belittling people."}, {"title": "Not a great place", "text": "Pros The office is centrally located and the team makes a huge effort to create a great place to work. Everyone is super smart and there is great collaboration Cons Management, working conditions & environment, salary Advice to Management Be humble, listen more and mind your words", "rating": 1, "pros": "The office is centrally located and the team makes a huge effort to create a great place to work. Everyone is super smart and there is great collaboration", "cons": "Management, working conditions & environment, salary", "advice": "Be humble, listen more and mind your words"}, {"title": "Great Workplace", "text": "Pros Very strong, driven people who still like to have fun while working. Top 5% performers in their respective fields. Solid management. Cons Can't really think of any - you will probably spend less time at home because it is so much fun to work here ;-)", "rating": 5, "pros": "Very strong, driven people who still like to have fun while working. Top 5% performers in their respective fields. Solid management.", "cons": "Can't really think of any - you will probably spend less time at home because it is so much fun to work here ;-)", "advice": null}, {"title": "Passionate and highly capable team", "text": "Pros everyone in the team is extremely good, dedicated and passionate. all team members work independently but can rely on each other anytime. great office location. founders have a long-term vision and focus on sustainable growth. Cons sometimes workload is quite high", "rating": 5, "pros": "everyone in the team is extremely good, dedicated and passionate.", "cons": "sometimes workload is quite high", "advice": null}, {"title": "Really motivated colleagues", "text": "Pros It's a great team to work with. Everyone is really motivated and wants to pull their weight. The founders are also really open to new ideas and experiment, meaning you can learn a lot at this company. Cons I would have liked some more regular after-work social events. It would be particularly helpful for new hires. However, the monthly team lunch is also a good chance to get to know the team.", "rating": 5, "pros": "It's a great team to work with. Everyone is really motivated and wants to pull their weight. The founders are also really open to new ideas and experiment, meaning you can learn a lot at this company.", "cons": "I would have liked some more regular after-work social events. It would be particularly helpful for new hires. However, the monthly team lunch is also a good chance to get to know the team.", "advice": null}, {"title": "Dat sind Macher!", "text": "Pros Tolle Arbeitsatmosphäre, gemeinsames Schaffen und Teilen Cons ZU WENIG RAUM! Bitte umziehen und riesengrosse Tische im neuen Büro;) Advice to Management Auch weiterhin immer ein Ohr für uns zu haben und unsere Ideen umzusetzen...der Rest kommt von alleine:)", "rating": 5, "pros": "Tolle Arbeitsatmosphäre, gemeinsames Schaffen und Teilen", "cons": "ZU WENIG RAUM! Bitte umziehen und riesengrosse Tische im neuen Büro;)", "advice": "Auch weiterhin immer ein Ohr für uns zu haben und unsere Ideen umzusetzen...der Rest kommt von alleine:)"}, {"title": "gute Arbeitsatmosphäre", "text": "Pros Mitarbeiter aus 12 Nationen haben ein Ziel, sehr gute Dynamik, sehr zielorientiert, viel Spass, gute Arbeit mit Salesforce, gutes Startup Feeling, jeder kann sich einbringen Cons man sollte natürlich der englischen Sprache mächtig sein Advice to Management sich auf den Salesbereich mehr fokussieren, bessere Koordinierung der einzelnen Bereiche untereinander", "rating": 5, "pros": "Mitarbeiter aus 12 Nationen haben ein Ziel, sehr gute Dynamik, sehr zielorientiert, viel Spass, gute Arbeit mit Salesforce, gutes Startup Feeling, jeder kann sich einbringen", "cons": "man sollte natürlich der englischen Sprache mächtig sein", "advice": "sich auf den Salesbereich mehr fokussieren, bessere Koordinierung der einzelnen Bereiche untereinander"}, {"title": "Personalvermittlung im jungen Umfeld", "text": "Pros Nettes junges und internationales Team, empfehlenswert für Juniors, die erste Erfahrungen sammeln wollen Cons Sehr alte und einfache Ausstattung des Büros, lange Arbeitszeiten, extrem niedrige Gehälter", "rating": 1, "pros": "Nettes junges und internationales Team, empfehlenswert für Juniors, die erste Erfahrungen sammeln wollen", "cons": "Sehr alte und einfache Ausstattung des Büros, lange Arbeitszeiten, extrem niedrige Gehälter", "advice": null}, {"title": "Ein super Arbeitsumfeld", "text": "Pros Die typischen flachen Strukturen und dynamischen aber strukturierten Arbeitsprozesse wie man sie aus einem StartUp kennt, werden hier vorgelebt. Das Team ist sehr international aufgestellt und hat einen starken, fast schon familiären Zusammenhalt. (regelmäßige Teamevents usw.) Man erhält Einblicke in alle Arbeitsbereiche und kann von fähigen und motivierten Kollegen und Gründern viel lernen. Alles in allem ein etablierter Arbeitgeber, der weiterhin wächst und sich erfolgreich am Markt etabliert. Durch die gute Vernetzung in alle Business Bereiche ein weiteres Plus und jederzeit weiterzuempfehlen! Cons derzeit keine Gründe die gegen eine Bewerbung bei Taledo sprechen Advice to Management Den eingeschlagenen Weg und Strategie weitergehen!", "rating": 5, "pros": "Die typischen flachen Strukturen und dynamischen aber strukturierten Arbeitsprozesse wie man sie aus einem StartUp kennt, werden hier vorgelebt. Das Team ist sehr international aufgestellt und hat einen starken, fast schon familiären Zusammenhalt. (regelmäßige Teamevents usw.)", "cons": "derzeit keine Gründe die gegen eine Bewerbung bei Taledo sprechen", "advice": "Den eingeschlagenen Weg und Strategie weitergehen!"}]