[{"title": "Great First Job and Overall Nice Place to Work", "text": "Pros -Endless room for growth and promotions. -Work / life balance is very fair if you manage your time wisely. Employees are expected to be responsive via email at all hours, but it's not necessary to stay in the office late. -Lateral moves within the company are also encouraged. Management likes to hire internally, so it's easy to switch to another department if you'd like. -There are plenty of perks like free breakfast food and snacks, company socials with drinks and food, and lots of team building and management training. -Once you have been at the company long enough, there are great opportunities to travel internationally and work in other offices (i.e. London, Hong Kong, Shanghai, Beijing, or Mumbai). Cons -Can be difficult to feel like everyone at the company is on the same team - there's a great deal of internal competition. -Management's focus and priorities change often, and you must be willing to switch your own focus at the drop of a hat to accommodate their goals. Advice to Management Continue to be transparent with employees, even as the company grows and faces pressure from investors. Pay all employees fairly and make sure bonuses are allocated appropriately. When it comes to budget cuts, employees' compensation should not be compromised.", "rating": 5, "pros": "-Endless room for growth and promotions.", "cons": "-Can be difficult to feel like everyone at the company is on the same team - there's a great deal of internal competition.", "advice": "Continue to be transparent with employees, even as the company grows and faces pressure from investors. Pay all employees fairly and make sure bonuses are allocated appropriately. When it comes to budget cuts, employees' compensation should not be compromised."}, {"title": "experience depends which vertical you're in", "text": "Pros this job is what you make of it, within the context of your vertical/team. i'd say that anyone who does not get placed in consulting for connections is going to have a decent time overall. the forum team probably has it best--a lot of growth opportunities, not bound to client deadlines, always learning, pitch your own ideas. people who work here overall are very outgoing and friendly. if you make an effort, have a slight interest in the stuff you work on, and have good people skills, you'll do well at third bridge and probably have a pretty good time. Cons severely underpaid, healthcare plan sucks for anyone who has needs above an annual checkup, there can be unnecessary drama sometimes, the legal team generally is incompetent, being managed by young people hired from within can have some serious shortcomings (additionally this means that any sort of \"mentoring\" is very limited), people can be hit or miss--again depends largely on your team. many of the negative reviews on here are not fair, especially given the expectation that this is a job in finance and many of your coworkers are white millennials from fairly privileged backgrounds. all in all not a bad place to start your career. Advice to Management just pay people more. seriously.", "rating": 5, "pros": "this job is what you make of it, within the context of your vertical/team.", "cons": "severely underpaid, healthcare plan sucks for anyone who has needs above an annual checkup, there can be unnecessary drama sometimes, the legal team generally is incompetent, being managed by young people hired from within can have some serious shortcomings (additionally this means that any sort of \"mentoring\" is very limited), people can be hit or miss--again depends largely on your team. many of the negative reviews on here are not fair, especially given the expectation that this is a job in finance and many of your coworkers are white millennials from fairly privileged backgrounds. all in all not a bad place to start your career.", "advice": "just pay people more. seriously."}, {"title": "A good company but one that can improve", "text": "Pros 1. Good salary and employee benefits 2. Nice, neat and clean work environment situated in modern facilities 3. Good career progression from Research Analyst to VP status and beyond (you get out how much effort you put in) 4. A company that is exploring on how to go beyond the boundaries of just financial research - so growing! 5. Nice team gatherings and food for employees 6. Super smart people from top grad schools and consulting companies - but they are super nice and friendly as well Cons 1. Lot of hard work (but every company has that) 2. Pay is OKish..but can improve (for NY it is fine and I suppose for the London and Hong Kong markets is also OK as they are the most expensive places) Advice to Management There is a strong tendency for the company to grow talent from within and that may be an issue (maybe not)...but worth exploring on hiring highly experienced and educated middle-level managers who can bring along a different flavour to management than those who are not so experienced in management but have risen through the ranks (nothing wrong with that either). Exit and one month interviews need to be open and employees should be asked on why they are really leaving (easy to say but difficult to do)- perhaps set up an internal counselling officer who can be there for employees to go to for confidential advice every now and then?", "rating": 5, "pros": "1. Good salary and employee benefits", "cons": "1. Lot of hard work (but every company has that)", "advice": "There is a strong tendency for the company to grow talent from within and that may be an issue (maybe not)...but worth exploring on hiring highly experienced and educated middle-level managers who can bring along a different flavour to management than those who are not so experienced in management but have risen through the ranks (nothing wrong with that either)."}, {"title": "An awesome place for professional and personal growth", "text": "Pros Very simply - you get out what you put in. If you value forming relationships with the extremely smart people who work here, invest in helping to grow the company and take time to get to know your clients/take an intellectual interest in the companies you are researching, you will have an amazing experience. For those who have claims of \"favoritism\" or the company being against them - it's simply not true. Every person who works here, from the MD of the company to TLs to VPs started in the same position, as a research analyst. All those in a leadership person are self-made and are passionate about the company, you don't necessarily find that anywhere else. Third Bridge has been a paramount place for my professional, personal and intellectual development. I have faced challenges here like I never faced in other internships, jobs or schools, and have had experiences people with10+ years in the workplace at other jobs are only just getting. Cons As you can see from this website, there are some cons that come with hiring straight out of college. You do get a small(!) handful of people who have not yet ironed out certain professionalism kinks and believe they should have everything handed to them on a silver platter. However, this is worth the risk as there are many people who take full advantage of the opportunity that they are given. Advice to Management Continue to adjust as the company grows, seems like things are falling into place.", "rating": 5, "pros": "Very simply - you get out what you put in. If you value forming relationships with the extremely smart people who work here, invest in helping to grow the company and take time to get to know your clients/take an intellectual interest in the companies you are researching, you will have an amazing experience.", "cons": "As you can see from this website, there are some cons that come with hiring straight out of college. You do get a small(!) handful of people who have not yet ironed out certain professionalism kinks and believe they should have everything handed to them on a silver platter. However, this is worth the risk as there are many people who take full advantage of the opportunity that they are given.", "advice": "Continue to adjust as the company grows, seems like things are falling into place."}, {"title": "A company going through Awkward Adolescence phase", "text": "Pros - Great place to start a professional career, with relatively quick progression opportunities. - I agree with previous reviews and hard work is recognised in the firm and there are great opportunities to develop useful soft skills that can be transferrable (client management, people management skills etc) - You are encouraged to pursue self development and enrichment programmes. You will be subsidised for language courses, CFA exams and given decent support. - The office is modern, with incredible view. A lot has been invested to ensure we have the latest and best equipment to make our jobs easier. - Some bright, intelligent and young colleagues. Great transition from college life to a work place. - Great monthly socials, complimentary beers and snacks on Fridays Cons - The quality of middle management varies WILDLY. There are great managers and VPs, and at the same time, some extraordinary dreadful ones. Favouritism and Nepotism is common occurrence unfortunately; and some of the behaviour from middle management towards junior staff is frankly disgraceful. - The work is tedious and boring. It is a quasi recruiting role and the main KPI is amount of cold calls made; and new experts recruited to the network. The research work is very superficial and next to no analytical work is required. - There are very limited technical or transferrable skill sets that you can take from this job. When you boil it down, this job consists of just call scheduling for more accomplished people. - The compliance framework can be a joke. Most of what we do is find someone who is willing to provide insider information; and sell it to our clients. A House of Cards that can come down at any moment... - The main pain point of the company is the outdated performance metric system, called the \"triangulator\". As the Co-Founder and Former COO of the company admitted, this system that he created for fun has become a \"monster\". A whole thesis paper can be devoted to evaluate and assess how this ridiculous system is the fundamental reason why retention rate is so low, and why staff turn over rate is so high. - The compensation scheme is outdated and not competitive comparing to the rest of the industry. The OTE bonus can be ridiculous and a new joiner on his/her 2nd month can earn more than a higher ranked employee who has been here for a year. Advice to Management - The triangulator made sense when the company had 200/300 employees. It must be changed and updated to reflect the growth & size of the company. Most, if not all recognises this pain point. Middle management are just cheerleaders who get behind it no matter what and the leadership seems unwilling or unable to make the changes required.  - The selling point of Third Bridge is its \"robust compliance\". LMAO - The business model is evidently working well given the rapid and meteoric growth. But employee turn over rate would remain high if changes are not made. Your motto is \"It is about us\" so please make it so. - Recognise that brilliant performers/researchers do not necessarily mean they would be good managers. You must have a higher standard and do not be afraid to have outside hires with more managerial experience.", "rating": 3, "pros": "- Great place to start a professional career, with relatively quick progression opportunities.", "cons": "- The quality of middle management varies WILDLY. There are great managers and VPs, and at the same time, some extraordinary dreadful ones. Favouritism and Nepotism is common occurrence unfortunately; and some of the behaviour from middle management towards junior staff is frankly disgraceful.", "advice": "- The triangulator made sense when the company had 200/300 employees. It must be changed and updated to reflect the growth & size of the company. Most, if not all recognises this pain point. Middle management are just cheerleaders who get behind it no matter what and the leadership seems unwilling or unable to make the changes required."}, {"title": "Endless Opportunities For Those Who Choose To Take Them", "text": "Pros -This job is what you make it. If you willing to put in hard work, take the time to propose strong ideas, care enough to ask hard questions, and use the people around you as resources, there is virtually no limit to your ability to grow in this role. -The company provides as many resources as possible to the employees to learn and develop, both professionally and personally, including funds towards classes, bespoke trainings and courses held in-office, and a general willingness to devote money and time to employees who seek out help, advice, mentorship and support. -Ability to manage both large books of businesses and people at an early start. Within even a few months, you are already trusted with a book of business with top 100 investment firms in the word. Within a year, you are trusted with training and sometimes hiring. Cons -Being a client facing business with tough competition, you are expected to be responsive to your clients even beyond working hours. -It's still a company in its growth phase, and that comes with kinks that need to be worked out. A lot of systems and processes are still being developed, which causes frequent changes in workflow. Advice to Management Create a focused end goal, and don't get distracted by the \"initiative -of-the-day.\"", "rating": 5, "pros": "-This job is what you make it. If you willing to put in hard work, take the time to propose strong ideas, care enough to ask hard questions, and use the people around you as resources, there is virtually no limit to your ability to grow in this role.", "cons": "-Being a client facing business with tough competition, you are expected to be responsive to your clients even beyond working hours.", "advice": "Create a focused end goal, and don't get distracted by the \"initiative -of-the-day.\""}, {"title": "Sinking Ship", "text": "Pros Senior Leadership of this company is a group of very intelligent people- former bankers from top banks in the US and UK. Cons -There are no actual hard skills to learn while being with this company. You will become an expert in cold calling and finding people’s contact information online. That is it. - There is no real research done, but rather recruiting people to speak to the company’s clients that know what they’re talking about. Very misleading for college undergrads being recruited out of school who want to be part of actual research. - There is an underlying sub culture of hate toward management and the company by the majority of employees. They realize they are underpaid and being outperformed by competitors in the expert network industry. Middle and upper management have their heads too far up their butts to see this. -The senior leadership I had described above is so out of reach with its actual work force, they do not know the type of environment middle management has created (toxic). - Base pay for incoming “analysts” is $48000 with “uncapped” bonus potential. This is extremely under market and “bonuses” are rarely hit. - There is a constant turnover of employees. I’ve been here about a year and have seen more people leave the company than i can imagaine counting. - Management is very “cliquey” and sometimes unapproachable. -If you want to get promoted at a faster you have to kiss a lot of butt to do so. -There is a terrible work/life balance as your expected to answer client emails throughout the night and stay very late when work load is piled up. For the extremely underpaid salary that you make at this company, the hours are simply not worth it. - Employees are treated like children. For example there is a sign in sheet to the bathrooms because there is an employee who keeps leaving feces on the floor intentionally. -Constantly micromanaged by tiers of micromanagers. It is how the company operates and something that is holding back a lot of employees from their full potential. - The proprietary software the company uses is trash. Upper management spends too much time, effort, and money developing this product with people who barely know a thing and are extremely under qualified to be leading software development. There is constant outages with this internal software and glitches that are fixed on a daily basis which slows down the entire work force. -With too many people leaving the company and a bad environment being created, there is no chance the company has what it takes to compete with its major competitors. It will be swallowed up in the next 5-7 years unless big changes are coming. - C levels have left the company recently. You do the math here. Advice to Management 1. Invest in the company. Hire ACTUAL business people to help run things instead of taking ideas from people who have been there long enough to get promoted to TL or VP. Half of them have liberal arts degrees. 2. Pay your people more. Young professionals are money motivated. There is no shot you can develop leaders in the company if there aren’t enough people who stay with Third Bridge long enough because their salary is so under market value. The smart people are leaving before they can become leaders in the company. 3. Get rid of the software system the company uses and invest heavily in this aspect of the business. It is the companies aqilies heel. 4. Get your heads out of your butts.", "rating": 1, "pros": "Senior Leadership of this company is a group of very intelligent people- former bankers from top banks in the US and UK.", "cons": "-There are no actual hard skills to learn while being with this company. You will become an expert in cold calling and finding people’s contact information online. That is it.", "advice": "1. Invest in the company. Hire ACTUAL business people to help run things instead of taking ideas from people who have been there long enough to get promoted to TL or VP. Half of them have liberal arts degrees."}, {"title": "Theres A LOT of improvements that needs to be done", "text": "Pros It is a good place to start your career since you'll have exposure to many different markets and clients. That being said, It's like a lottery of what type of clients you get and what team you are in. Some of the best managers and worst managers I've seen. I was lucky enough to be a part of a great team and had a great manager. Office is in a convenient location. I like to think that the C-Level executives are truly nice people.. but they don't know whats going on in middle management.. or don't care enough to do something about it. nice monthly bonuses if you hit your target and accelerators \"unlimited\" sick days Career path (A1, A2, Associate, SRA...and then you leave, get fired or become a TL) which is about 2 yrs all together assuming you're hitting targets and making the right ppl happy. Cons - Obsessed with giving feedback - but they take receive constructive criticism well or ever change, despite all these reviews - middle management (TLs and VPs) are quite \"toxic\" - no year end bonuses - cold calling specialists - extremely high turnover - move desks every month - you cannot be even 1 min late to work, or leave even 1 min early - someone poops on the girls bathroom floor - lose motivation quickly - make you employees feel like they matter (Yes, EVEN the A1s and A2s) - college frat feel, everyone has a clique, and if you don't have one, you won't last long - pushes out the same people (basically the people who care enough to speak up) and keeps everyone that are willingly to be middle management's puppets - As soon as someone gets promoted to TL, they think they're too good to be friends with you (but honestly, probably brained washed by middle management) Advice to Management Read and re-read my cons.... and then actually do something about it. Well, Do something more than calling everyone into a meeting to tell them NOT to post negative reviews on glassdoor. Most of us write here because its anonymous and we won't get retaliated being honest and expressing how we feel about working at Third Bridge. That's why every candidate you're about to interview looks at this, and will hopefully prepare them for whats to come.", "rating": 3, "pros": "It is a good place to start your career since you'll have exposure to many different markets and clients. That being said, It's like a lottery of what type of clients you get and what team you are in. Some of the best managers and worst managers I've seen. I was lucky enough to be a part of a great team and had a great manager.", "cons": "- Obsessed with giving feedback", "advice": "Read and re-read my cons.... and then actually do something about it. Well, Do something more than calling everyone into a meeting to tell them NOT to post negative reviews on glassdoor. Most of us write here because its anonymous and we won't get retaliated being honest and expressing how we feel about working at Third Bridge. That's why every candidate you're about to interview looks at this, and will hopefully prepare them for whats to come."}, {"title": "A Meritocracy that Fosters Growth", "text": "Pros - Meritocracy when it comes to advancement in the company (additional responsibilities are provided as you continue to exemplify development and zeal) - Great opportunity to gain managerial experience early in one's career - Training is constant to continually prepare you for next levels of the job, and improve general professionalism competencies - Team structures are aligned so that it creates collaboration and support among peers, rather than unhealthy competition - Researcher role allows for direct contact with clients very early on - Company allows every employee transparency on company initiatives, changes, challenges, and an opportunity to voice ideas/concerns - Peers are driven and motivated to go above and beyond; those that do are rewarded with further opportunities - Projects vary incredibly across industries and client strategies, which is very helpful for those that are not entirely certain of their long-term career goals, or want to explore different sectors Cons - Researcher incentives can be further updated to align with changing team structures and project strategies - Not ideal for people that don't work well with others - Clients can be very demanding during busy business cycles Advice to Management We're constantly trying new initiatives and ways to approach our work, allowing us to remain an agile and innovative player in our space. Let's make sure we're aligning how we evaluate researchers to these changes as much as possible to make sure people are properly motivated and incentivized.", "rating": 5, "pros": "- Meritocracy when it comes to advancement in the company (additional responsibilities are provided as you continue to exemplify development and zeal)", "cons": "- Researcher incentives can be further updated to align with changing team structures and project strategies", "advice": "We're constantly trying new initiatives and ways to approach our work, allowing us to remain an agile and innovative player in our space. Let's make sure we're aligning how we evaluate researchers to these changes as much as possible to make sure people are properly motivated and incentivized."}, {"title": "Research Associate", "text": "Pros - okay $ - awesome environment - manage your own accounts Cons - bonus relies on other's on team - management is young", "rating": 5, "pros": "- okay $", "cons": "- bonus relies on other's on team", "advice": null}, {"title": "Not a bad place to start a career", "text": "Pros Good People to work with Cons Not the most thrilling work", "rating": 3, "pros": "Good People to work with", "cons": "Not the most thrilling work", "advice": null}, {"title": "Research Analyst", "text": "Pros -Met some very good friends that I'm still in touch with, some very smart, nice people etc. that made coming to work on a daily basis (even though the job was not for me) VERY much a fun experience. -Management recognizes hard work and commitment if you express it, and will help you progress internally to the degree they are able to. -Lots of social events -Job can be a TON of fun when things go well; you work in teams and it feels like a game. I found myself working with some very close friends, which makes it feel like college and made me excited to show up to work some days. -Monthly performance reviews (if you like your manager, as I did) are very useful for professional development. -Soft skill development (client service, communications, teamwork, problem solving, project management) had a HUGE impact on my ability to get my next job and will be generally useful through career. I know it sounds like fluff but it is not. Cons Two categories of cons: The first is for you as an employee, the second is for the company more broadly (which will impact you as an employee). Category 1 -WARNING: THE TITLE OF THIS JOB IS EXTREMELY MISLEADING. If you take this role you are NOT a research analyst, but rather a recruiter who occasionally does some very shallow research when the need arises. In the interview, you do a \"value chain\" breakdown for a given industry but rarely actually break down a value chain for an industry in practice. -You are a call scheduler. Get used to it. This means that 10000 and 1/2 factors outside of your control can impact how many calls you set up in a given month and yes it will affect your bonus if things don't go right. -You don't make overtime. This would be fine if the company were serious about its commitment to \"work life balance,\" but when they want you to work on weekends /stay late so that they can hit their bonuses, they struggle to show \"what's in it for you\" if you are (remarkably) not naturally motivated by how many calls you set up for clients. -Instead of overtime, there is the world's most convoluted bonus structure aimed at getting you to prioritize short-term call-generation quotas that are evaluated by each month. Makes you competitive with everyone you work with and really brings out the worst in people. -Many people you work with are really just not that bright. I had a book on my desk and an AVP who noticed said \"wow! You read a lot of books!\" (emphasis on books). Someone else thought Yemen was in Central Europe. And guess what? They do very well at the job. Proves that you don't need brains to do well. Category 2 -Mismatch between client best interests and personal target hitting. Clients (at least in funds) don't care about doing a 10 mediocre calls with you a week or 5 good ones, as long as they're the right ones. But 10 calls brings in more revenue for the company so guess which one you're incentivized towards. -Obsession with numbers in an industry that is extremely hard to quantify. Metrics for everything. Targets and goals by which you are evaluated, 80% of which are outside of your control ---> makes for some dumb strategy / strategic thinking. -Lol @ compliance to \"prevent private information from being shared on the calls.\" -Sales / account mgmt is as though someone copy/ pasted the same low-IQ white guy 20 times and put some khakis on him. Except for like 2 people or so. -Culture of competition breeds gossip on all levels of management, which makes for a \"cliquey\" high school culture at times with no transparency. Extremely frustrating. Advice to Management Change title of job to \"Recruitment Analyst\" or \"Expert Network Analyst.\" Align clients' longer term interests with your own not just for the review of management but also for the people on the ground as well, i.e., if you must have a target system, make it quarterly or annual. Make it possible to receive promotions or other \"awards\" etc. without relying so heavily on numbers. Reduce the culture of cliquy-ness by increased transparency / stop obsessing over appearances of uniformity. Reduce turnover by making it alright to be a Research Analyst / Senior Associate for longer periods of time without giving the impression that you need to move up or get out. This would entail pay raises (I know, \"margins are important,\" etc. but the rest of the financial sector does them so my sympathy is limited). Would reduce client dissatisfaction with having new faces every five minutes to work with.", "rating": 3, "pros": "-Met some very good friends that I'm still in touch with, some very smart, nice people etc. that made coming to work on a daily basis (even though the job was not for me) VERY much a fun experience.", "cons": "Two categories of cons: The first is for you as an employee, the second is for the company more broadly (which will impact you as an employee).", "advice": "Change title of job to \"Recruitment Analyst\" or \"Expert Network Analyst.\""}, {"title": "Former employee", "text": "Pros - compensation is fair for an entry level position - people are nice and very social - opportunities for growth - nice office/ perks - exposure to institutional clients Cons - can seem like there is an \"in crowd\" at certain points - there is a target/quota system, so if you wanted something in data crunching this might not be the best position for you. Advice to Management Great management team. I would recommend this position to a friend.", "rating": 5, "pros": "- compensation is fair for an entry level position", "cons": "- can seem like there is an \"in crowd\" at certain points", "advice": "Great management team. I would recommend this position to a friend."}, {"title": "Great Place to Learn", "text": "Pros Exposed to interesting client base Cons micromanaging, no work/life balance, expected to answer clients at all hours,", "rating": 5, "pros": "Exposed to interesting client base", "cons": "micromanaging, no work/life balance, expected to answer clients at all hours,", "advice": null}, {"title": "Pain & Suffering in Times Sq, NY", "text": "Pros -Amazing view -Snack room and fully-stocked kitchen -Great AC -A select amount of decent people Cons -Judgmental management disguised as friendly mentors -Very relaxed about certain inappropriate things (extremely loud conversations, soccer balls being kicked around when people are trying to work) but they scold you for random things if they don't like you (Example: Once, I had a meeting with my boss because I arrived at nine o' ONE) -Do not allow you to use headphones -Very homogeneous and dangerous culture - I've experienced workplace racism as well as overheard homophobic comments -Work is boring and tedious, all you do is harass people over the phone. Basically a telemarketing job Advice to Management Not sure - this company culture could be beyond repair", "rating": 1, "pros": "-Amazing view", "cons": "-Judgmental management disguised as friendly mentors", "advice": "Not sure - this company culture could be beyond repair"}, {"title": "Good job, wrong fit", "text": "Pros Offices are largely young, recent college grads with lots of energy and a great work ethic. Kitchen/social space includes breakfast foods and snacks and drinks, frequent team and company socials encourage sense of camaraderie, employees start with three weeks of PTO, and unlimited sick days. Cons It feels like much more of a sales position than a research position. It's almost exclusively composed of outreach, and requires a personality unconcerned with bothering people. Persistence and a certain amount of luck are key, here, and if you're not willing or able to put in hours of footwork outside of usual working hours, you will have a hard time meeting monthly targets. It's not a bad job, it just wasn't right for me. Advice to Management Encourage a better work-life balance among your employees, and don't penalize those who prioritize effective teamwork over individual success.", "rating": 3, "pros": "Offices are largely young, recent college grads with lots of energy and a great work ethic. Kitchen/social space includes breakfast foods and snacks and drinks, frequent team and company socials encourage sense of camaraderie, employees start with three weeks of PTO, and unlimited sick days.", "cons": "It feels like much more of a sales position than a research position. It's almost exclusively composed of outreach, and requires a personality unconcerned with bothering people. Persistence and a certain amount of luck are key, here, and if you're not willing or able to put in hours of footwork outside of usual working hours, you will have a hard time meeting monthly targets. It's not a bad job, it just wasn't right for me.", "advice": "Encourage a better work-life balance among your employees, and don't penalize those who prioritize effective teamwork over individual success."}, {"title": "Not a real job", "text": "Pros You get to work with a lot of people your own age - its a good transition from college Cons You basically expire (in managements eyes) after ~1.5 - 2 years", "rating": 3, "pros": "You get to work with a lot of people your own age - its a good transition from college", "cons": "You basically expire (in managements eyes) after ~1.5 - 2 years", "advice": null}, {"title": "Account Management Associate", "text": "Pros Nice people throughout the building. Everyone is friendly, young, smart. level of intelligence in the building is high, from the CEO down to the RA1s. Ability to make good money on the Account management side. A lot of responsibility from day 1. Ability to talk to high level accounts and clients on a regular basis. In this industry you can learn as much as you want, it just depends how much you care. Very cool to see your client make a multi million dollar investment a few days after you set them up on a call. Interesting sub-industry to be in as traditional wall street sell side and brokerage jobs shrink in population and $ potential. Attention to detail when dealing with clients is higher than competition (from the mouths of clients). Understand the importance of client services and custom experience for each client. Cons Overall low pay among researchers crushes morale. Lack of established professionals (aka Adults, people to learn from, aspire to, mentors) fosters a lack of urgency - at least for me. Not as 'entrepreneurial' as they see themselves. Certain metrics, team structures, priorities, methodology, are dated + confusing. Advice to Management Our client users are sectorized and look through a very specific and thorough lens -- why don't we? If you seek to separate yourselves as a 'research partner', then allow your research teams the time and freedom to learn about the clients, sectors, topics they cover. Sectorize and specialize research teams and afford them the opportunity to cover the details of the knowledge they are actually 'brokering'. Take a step back and consider how your researchers are actually \"partners in research\". From where I was standing it seemed like they mostly recruited on Linked and set up appointments - leaving little time to learn about the topic in an effort to 'add value' as you claim they do. The intelligence and potential in that office is very high - channel the entrepreneurial spirit of third bridge and allow your smart, young, energetic employees to make big suggestions and changes. They are in the foxhole every day - they know how to improve procedure, listen up! - Stop Quarterly Pivoting for salespeople. - Cough up and pay a third party to rebuild the intranet and bring the User Portal to this decade. Enough is enough.", "rating": 3, "pros": "Nice people throughout the building. Everyone is friendly, young, smart. level of intelligence in the building is high, from the CEO down to the RA1s.", "cons": "Overall low pay among researchers crushes morale.", "advice": "Our client users are sectorized and look through a very specific and thorough lens -- why don't we?"}, {"title": "Research Analyst", "text": "Pros - teaches great people skills - good young post-grad work environment Cons - innate distrust of employees (will check your logs to see how often/how many people you contact) - constant micromanagement (they created a mandatory tool called Capacity Management which outlines everything you do for the day down to 15 min increments) - narrows down success to one number (your target) which can be unrealistic if there's an industry downturn (like in hedgefunds now) or slow project flow. If you hit target they tell you you're doing everything perfectly, but if you don't, everything on your monthly review will say \"needs improvement\". - only promotes people quickly if you act as a blind \"cheerleader\" for the company, which is where most of these 5 star \"amazing-there's-nothing-wrong\" reviews are coming from Advice to Management I wanted to experience the more open environment of a small company - but the \"feedback culture\" is only welcoming to top-down feedback. Listen to ALL your employees because our criticism is constructive. This target business is silly - you cant expect the same system that worked for a 10 person company to work for a 200 person single office.", "rating": 3, "pros": "- teaches great people skills", "cons": "- innate distrust of employees (will check your logs to see how often/how many people you contact)", "advice": "I wanted to experience the more open environment of a small company - but the \"feedback culture\" is only welcoming to top-down feedback. Listen to ALL your employees because our criticism is constructive."}, {"title": "Not the best", "text": "Pros They pay for you to go out with your co-workers Cons This place is not the best. I graduated from Penn State and I have a degree in econ but they only make me do calls. Like, I deserve more. They get mad when you travel. Advice to Management Managers sucks, they are all so superficial and will deny you promotions based", "rating": 1, "pros": "They pay for you to go out with your co-workers", "cons": "This place is not the best. I graduated from Penn State and I have a degree in econ but they only make me do calls. Like, I deserve more. They get mad when you travel.", "advice": "Managers sucks, they are all so superficial and will deny you promotions based"}, {"title": "Not the best", "text": "Pros They pay for you to go out with your co-workers Cons This place is not the best. I graduated from Penn State and I have a degree in econ but they only make me do calls. Like, I deserve more. They get mad when you travel. Advice to Management Managers sucks, they are all so superficial and will deny you promotions based", "rating": 1, "pros": "They pay for you to go out with your co-workers", "cons": "This place is not the best. I graduated from Penn State and I have a degree in econ but they only make me do calls. Like, I deserve more. They get mad when you travel.", "advice": "Managers sucks, they are all so superficial and will deny you promotions based"}, {"title": "BEWARE", "text": "Pros - young people who are all very social - first job opportunities - Rapid Company growth but not personal growth - Pay/subsidize company trips here and there Cons - you act like a company slave - No support - Passive Aggressive management - Terrible place to work - Miserable going to work everyday - Management has no idea whats going on with the bottom line. - Extremely extremely high turnover rate and many people leave every month... for a reason Advice to Management communicate with employees more than once a quarter and understand whats really going on - on the floor", "rating": 3, "pros": "- young people who are all very social", "cons": "- you act like a company slave", "advice": "communicate with employees more than once a quarter and understand whats really going on - on the floor"}, {"title": "Disappointing", "text": "Pros Young culture and environment with a lot of smart people Can teach you a lot about industries if you have the time to learn Cons Management is extremely distrustful of their employees and blames them for anything that goes wrong. If you hit target one month they praise you and if you don't the next month you've regressed and haven't worked hard enough. Target systems do not account for short months, economic impact, or holidays. Management does not seem to know how to scale a business and does a poor job receiving feedback or criticism. Things change very slowly and the attitude is overwhelmingly \"this is just how things are done\" rather than having the will to innovate. Perhaps this is why margins are so low in the business. Depending on your team leader, you can either have a good or abysmal experience. Team leaders very much play favorites and you're expected to be a cheerleader for the firm. Any criticism of the business or business model is dismissed. The firm rarely hires management level or senior level people from other firms and only promotes internally. While it can be beneficial for career progression, this creates a very closed ecosystem without a lot of outside opinions with a lot of confirmation bias. Advice to Management Hire your consulting clients to look at organizational structure or business or hire an outside perspective to help innovate because currently the business is not built to scale.", "rating": 1, "pros": "Young culture and environment with a lot of smart people", "cons": "Management is extremely distrustful of their employees and blames them for anything that goes wrong. If you hit target one month they praise you and if you don't the next month you've regressed and haven't worked hard enough.", "advice": "Hire your consulting clients to look at organizational structure or business or hire an outside perspective to help innovate because currently the business is not built to scale."}, {"title": "Research Analyst", "text": "Pros There is room for growth quickly if you hit numerical targets. There are a lot of young people and socials. You get a lot of responsibility. Cons It's essentially recruiting. There is not a very good work life balance. Management is young and inexperienced. Things are constantly changing. Advice to Management Focus more on people and less on profits. Stick with the company initiatives you put in place and follow through on them. Promote a work life balance.", "rating": 3, "pros": "There is room for growth quickly if you hit numerical targets. There are a lot of young people and socials. You get a lot of responsibility.", "cons": "It's essentially recruiting. There is not a very good work life balance. Management is young and inexperienced. Things are constantly changing.", "advice": "Focus more on people and less on profits. Stick with the company initiatives you put in place and follow through on them. Promote a work life balance."}, {"title": "Analyst", "text": "Pros Location, the snacks, great office view Cons long hours, little pay", "rating": 5, "pros": "Location, the snacks, great office view", "cons": "long hours, little pay", "advice": null}, {"title": "Collegiate Culture, Low Compensation", "text": "Pros - Diversity of people - Clients are top investment firms and consulting companies - Great entry into consulting / primary research Cons - Low compensation - Projects given have a high turnover high - Lack of incentives for Analysts", "rating": 3, "pros": "- Diversity of people", "cons": "- Low compensation", "advice": null}, {"title": "Great team atmosphere", "text": "Pros The people I worked with are great Cons My boss and his boss were not on the same page", "rating": 3, "pros": "The people I worked with are great", "cons": "My boss and his boss were not on the same page", "advice": null}, {"title": "Research Analyst", "text": "Pros Strong team ethic, vast exposure to private equity firms, consulting firms, and hedge funds. Cons Frequently asked to work overtime, must be available to speak with clients until midnight and early in the AM, must constantly worry about hitting target to stay there. Target is reviewed monthly and if you don't hit then they fire you. It's at-will employment so what can you do.", "rating": 5, "pros": "Strong team ethic, vast exposure to private equity firms, consulting firms, and hedge funds.", "cons": "Frequently asked to work overtime, must be available to speak with clients until midnight and early in the AM, must constantly worry about hitting target to stay there. Target is reviewed monthly and if you don't hit then they fire you. It's at-will employment so what can you do.", "advice": null}, {"title": "Good place to begin your career", "text": "Pros Great atmosphere, ability to make good money Cons Client tendencies are out of your control and you are paid accordingly", "rating": 5, "pros": "Great atmosphere, ability to make good money", "cons": "Client tendencies are out of your control and you are paid accordingly", "advice": null}, {"title": "Consultant", "text": "Pros Great opportunity to Q&A, generous compensation. Cons Frequency of contracts per calendar year.", "rating": 5, "pros": "Great opportunity to Q&A, generous compensation.", "cons": "Frequency of contracts per calendar year.", "advice": null}, {"title": "Analyst", "text": "Pros casual to intense working days snacks great view Cons needs better senior leaderships-can be a college scene, screaming/drinking fast pace projects wasting your time no valuable analytical skill gain low pay", "rating": 3, "pros": "casual to intense working days", "cons": "needs better senior leaderships-can be a college scene, screaming/drinking", "advice": null}, {"title": "Very unique company", "text": "Pros Working at Third Bridge has been the best experience I can imagine. The culture is extremely unusual; warm, supportive, with a management that is invested in its employees. Cons Not a con, but a note- definitely important to develop good relationships with those around you. Each person is not only responsible for the quality of his/her work, but for the quality of the energy and teamwork he/she brings to the table.", "rating": 5, "pros": "Working at Third Bridge has been the best experience I can imagine. The culture is extremely unusual; warm, supportive, with a management that is invested in its employees.", "cons": "Not a con, but a note- definitely important to develop good relationships with those around you. Each person is not only responsible for the quality of his/her work, but for the quality of the energy and teamwork he/she brings to the table.", "advice": null}, {"title": "Great Place", "text": "Pros Personal development and tons of perks from great bonus structure to free food and ping pong. Cons Cant think of any really. Advice to Management keep it up", "rating": 5, "pros": "Personal development and tons of perks from great bonus structure to free food and ping pong.", "cons": "Cant think of any really.", "advice": "keep it up"}, {"title": "Good first job", "text": "Pros -Opportunity to learn about several different industries and an understanding of the market and landscape -Frequent and immediate feedback helps to improve your own processes and professional development Cons -Breadth is really great to start, but depth of research tapers out and work can become redundant -Can be difficult to participate or facilitate initiatives as side projects necessary for promotion while keeping up with current book of business Advice to Management Ask for feedback beyond \"do you have any feedback?\" to get to tangible issues with concrete problems", "rating": 5, "pros": "-Opportunity to learn about several different industries and an understanding of the market and landscape", "cons": "-Breadth is really great to start, but depth of research tapers out and work can become redundant", "advice": "Ask for feedback beyond \"do you have any feedback?\" to get to tangible issues with concrete problems"}, {"title": "Research Analyst", "text": "Pros With the exception of upper management, everyone who worked there was 22-30, so there is certainly a young vibe to the company. The frequent socials are always a good time. If you work there long enough to be promoted to a Research Analyst II, you get to deal with clients directly, which is good exposure. It's also easy to make this role seem more impressive than it actually is on a resume. Cons Little work-life balance due to tough monthly quotas. \"Research Analyst\" is a misnomer, as you're doing very little research of your own; instead, most of your time is spent looking up experts on LinkedIn, tracking down their contact information, and attempting to persuade them over the phone to consult with your client. The company is structured as a series of teams, each with their own leader. Depending on the team you're assigned, it can make or break your experience at the company, as these are the people you'll spend 95% of your day with. As you can imagine, some teams are better than others. Advice to Management Stop focusing on hiring more people and put effort into creating a company culture that inspires your current employees to not want to leave after a year and a half (the average time an employee spent at the company, at least while I was there).", "rating": 3, "pros": "With the exception of upper management, everyone who worked there was 22-30, so there is certainly a young vibe to the company. The frequent socials are always a good time. If you work there long enough to be promoted to a Research Analyst II, you get to deal with clients directly, which is good exposure. It's also easy to make this role seem more impressive than it actually is on a resume.", "cons": "Little work-life balance due to tough monthly quotas. \"Research Analyst\" is a misnomer, as you're doing very little research of your own; instead, most of your time is spent looking up experts on LinkedIn, tracking down their contact information, and attempting to persuade them over the phone to consult with your client. The company is structured as a series of teams, each with their own leader. Depending on the team you're assigned, it can make or break your experience at the company, as these are the people you'll spend 95% of your day with. As you can imagine, some teams are better than others.", "advice": "Stop focusing on hiring more people and put effort into creating a company culture that inspires your current employees to not want to leave after a year and a half (the average time an employee spent at the company, at least while I was there)."}, {"title": "Great Place to Start", "text": "Pros Surrounded by lots of young, smart, energetic people; engaging and challenging work; good benefits; flat management structure; office functions as a meritocracy Cons Training is good, but varies depending upon which associate or team leader you get for each module. Parts of it could be more standardized. On the whole though the firm does an excellent job of preparing its analysts for the job. Advice to Management Continue to differentiate yourself from competitors and expand whilst maintaining the young, interactive start-up feel. Make sure to not lose the spark that differentiates Third Bridge as the firm continues to grow.", "rating": 5, "pros": "Surrounded by lots of young, smart, energetic people; engaging and challenging work; good benefits; flat management structure; office functions as a meritocracy", "cons": "Training is good, but varies depending upon which associate or team leader you get for each module. Parts of it could be more standardized. On the whole though the firm does an excellent job of preparing its analysts for the job.", "advice": "Continue to differentiate yourself from competitors and expand whilst maintaining the young, interactive start-up feel. Make sure to not lose the spark that differentiates Third Bridge as the firm continues to grow."}, {"title": "COLLEGE GRADS BEWARE", "text": "Pros They only hire kids directly out of college, about 10 per month. You will make friends. Cons The job is awful, and Third Bridge is misleading about what the \"Research Analyst\" role actually entails. This is a Recruiting role, there is no research involved. Every day consists of sending out email blasts and making cold calls in order to recruit people to consult for Third Bridge. They track the number of email blasts you send and the number of cold calls you make, and you're scolded if either of these numbers is too low. You have a \"target\" number of people you need to recruit every month, and your performance is 100% measured by whether or not you hit this target. If you do not hit the target in your first four months you are fired. If you've been there a while and miss the quota two months in a row you are put on probation, which means if you don't hit target the following month you're fired. They hire an incredible number of people because they fire a lot of people, and those who don't get fired rarely stay for more than a year. To be clear, the possibility of being fired after only a few months is very real. Advice to Management Management is intentionally misleading about what the role is, and what their growth strategy is (rapid hiring and rapid firing). Unless you are attempting to launch a career in Telephone Recruiting, do NOT apply for this job.", "rating": 1, "pros": "They only hire kids directly out of college, about 10 per month. You will make friends.", "cons": "The job is awful, and Third Bridge is misleading about what the \"Research Analyst\" role actually entails. This is a Recruiting role, there is no research involved. Every day consists of sending out email blasts and making cold calls in order to recruit people to consult for Third Bridge. They track the number of email blasts you send and the number of cold calls you make, and you're scolded if either of these numbers is too low. You have a \"target\" number of people you need to recruit every month, and your performance is 100% measured by whether or not you hit this target. If you do not hit the target in your first four months you are fired. If you've been there a while and miss the quota two months in a row you are put on probation, which means if you don't hit target the following month you're fired. They hire an incredible number of people because they fire a lot of people, and those who don't get fired rarely stay for more than a year. To be clear, the possibility of being fired after only a few months is very real.", "advice": "Management is intentionally misleading about what the role is, and what their growth strategy is (rapid hiring and rapid firing). Unless you are attempting to launch a career in Telephone Recruiting, do NOT apply for this job."}, {"title": "Research", "text": "Pros - Truly a place that is invested in your personal development and prepares you for a successful career no matter what field you end up in. - You learn a ton about every industry under the sun. Things you didn't even know even existed before. - You can see in real time the effects of you helping clients with their research (e.g. Company A buys Company B in the news) Cons - Claim to have open channel of communication, anyone can talk to anyone,\"flat company\" but this is not true. You have to be mindful of what you say and who you say it to. - Immature environment at times - very frat like and gossipy. Barely anyone over the age of 25 on the research floor. - It is not clear what is needed to advance - very muddy. Advice to Management You're in a growing phase right now but get a grip on whats happening around you", "rating": 5, "pros": "- Truly a place that is invested in your personal development and prepares you for a successful career no matter what field you end up in.", "cons": "- Claim to have open channel of communication, anyone can talk to anyone,\"flat company\" but this is not true. You have to be mindful of what you say and who you say it to.", "advice": "You're in a growing phase right now but get a grip on whats happening around you"}, {"title": "Good way to start your career", "text": "Pros - Client facing role very early on during your time with the company - Opportunities to advance quickly (promotions are very much based on merit) - Great culture and fun group of people to work with Cons - Targets take hard work to achieve, which can be stressful at the end of the month (though the majority of people do reach them) Advice to Management - Continue investing in and hiring high quality employees", "rating": 5, "pros": "- Client facing role very early on during your time with the company", "cons": "- Targets take hard work to achieve, which can be stressful at the end of the month (though the majority of people do reach them)", "advice": "- Continue investing in and hiring high quality employees"}, {"title": "Research analyst", "text": "Pros Respond quickly. Friendly environment and it is a good platform for fresh students Cons Without sponsorship for graduate students in the U.S.A. However, it is a good opportunity for fresh students to learn the field.", "rating": 5, "pros": "Respond quickly.", "cons": "Without sponsorship for graduate students in the U.S.A. However, it is a good opportunity for fresh students to learn the field.", "advice": null}, {"title": "Amazing company, friends, opportunity for growth and personal development.", "text": "Pros The people, the emphasis on your growth, quick promotions given results, target-driven. It's an amazing learning experience in general, very good work-life balance and great connections. Cons \"Expert network\" industry is hard to describe to people, it's an obscure space that many still don't understand. As the company grows more and more, I'm sure this will get better.", "rating": 5, "pros": "The people, the emphasis on your growth, quick promotions given results, target-driven. It's an amazing learning experience in general, very good work-life balance and great connections.", "cons": "\"Expert network\" industry is hard to describe to people, it's an obscure space that many still don't understand. As the company grows more and more, I'm sure this will get better.", "advice": null}, {"title": "Good company to start a career", "text": "Pros The company is full of intelligent young recent graduates. You develop a lot of good project management skills. You get a speak a lot of interesting people on the phone. Cons The employee turnover can be a bit much at times. It feels like someone is leaving the company once a week. The progression within the company is dependent on your ability to hit a sales target. At times this can create a stressful environment. Advice to Management Continue to hire from good schools. Increase employee retention initiatives. Increase salary to better align with living expenses in New York city.", "rating": 5, "pros": "The company is full of intelligent young recent graduates. You develop a lot of good project management skills. You get a speak a lot of interesting people on the phone.", "cons": "The employee turnover can be a bit much at times. It feels like someone is leaving the company once a week. The progression within the company is dependent on your ability to hit a sales target. At times this can create a stressful environment.", "advice": "Continue to hire from good schools. Increase employee retention initiatives. Increase salary to better align with living expenses in New York city."}, {"title": "Good experience, not a job you'll likely be super passionate about.", "text": "Pros Great training program. I feel like management and the research team does a pretty good job of making sure you are prepared on all aspects for you to have the potential to be successful. The company is growing. Your job is secure for 2 years unless you suck at your job. 90% of people are really out going, energetic people. This can be a con if a hyper work environment is not your thing. Team oriented environment. You get the opportunity to collaborate with team members across all offices. The company is actively trying to make it easier for cross department communication. I feel like this actually increased in the time I worked there because this wasn't necessarily the case when I started. Bonus structure is definitely a plus. Intro to business, on the investment side. I did not study business in college and have very little knowledge of how investment banks, hedge funds, etc. worked. Third Bridge (Cognolink) definitely made it so that you could actually understand what you were working on. They have an in house learning module that you can use in your spare time to catch up on some business 101 you may have missed. International travel. If you do well at the company, they have a great incentive program that will let you travel to one of the of other offices for 2 weeks all expenses paid. Two year program (pro). This is what they call their research program more or less. They say you can make this job into anything you want it be if you decide to transition out. I do agree with this to a certain extent. If you are interested in working for a bit and going back to school, going to work for a related business firm, or if this a short term gig for you, then this is definitely a good fit. You gain a lot of client management, \"research\", networking, and sales related skills. Snacks. The kitchen was always stocked with bagels, fruit, health bars, cheese sticks, sodas, coffee, tea, etc. Cons They pay isn't unreasonable but just understand before going in that you can probably get paid better at one of their competitors. Management will tell you that they pay what most of the industry pays but I don't necessarily agree having transitioned to a similar firm. Two year program (con). Basically the philosophy, and their study, shows that if you don't get into upper management or become a Team Leader in two years then they will help you \"find a new opportunity.\" That's not to say the company isn't growing and there aren't positions available to move into, but its my opinion that this is partially how they keep costs low (which is actually smart). I understand being candid with employees is a plus but you basically have to decide early on if you're going to stay with the company or you're going to seek other opportunities in a year or two. There isn't a whole lot of time to \"decide\" if this is the best fit for you because it either is or you'll be helped out. Culturally, I feel the company is now too big to act like a start-up. Company happy hours are fun, but for the most part people go to these with the intention of getting very intoxicated. The environment can feel like a cliquey, fraternity at times. Upper management can appear to be an exclusive club. Though they were easy to talk to and bring your concerns to, it often felt like your concerns would not be kept private among upper management and the others on the research floor. Its kind of a teacher's pet atmosphere. If you're good at your job and management likes you, you are set. But if that's not the case, than its very obvious to everyone. Advice to Management I don think I really have anything meaningful to add, and to be honest I'm indifferent to the companies advancement. If I did, I'm sure its nothing they haven't already heard.", "rating": 3, "pros": "Great training program. I feel like management and the research team does a pretty good job of making sure you are prepared on all aspects for you to have the potential to be successful.", "cons": "They pay isn't unreasonable but just understand before going in that you can probably get paid better at one of their competitors. Management will tell you that they pay what most of the industry pays but I don't necessarily agree having transitioned to a similar firm.", "advice": "I don think I really have anything meaningful to add, and to be honest I'm indifferent to the companies advancement. If I did, I'm sure its nothing they haven't already heard."}, {"title": "Start up feel for an established company", "text": "Pros Great social environment Welcoming employees - friendly and inclusive Driven work culture where hard work is rewarded and celebrated Quick promotion opportunities Free breakfast, fruit and treats - great to start the day fully fuelled. Management have listened to their employees and implemented changes recently - refreshing to be with a company that implements change on behalf of their staff. Cons I haven't seen any cons as yet Advice to Management Keep listening to your employees, their your most valuable asset", "rating": 5, "pros": "Great social environment", "cons": "I haven't seen any cons as yet", "advice": "Keep listening to your employees, their your most valuable asset"}, {"title": "Telephone Researcher Job Review", "text": "Pros Flexible working hours, friendly people, good location. Cons Sometimes the other callers spoke on the phone really loud, which made it distracting to do calls. Also, it's a hard job because you're basically doing cold calling. You really do have to try hard to get people to talk to you. Advice to Management N/A", "rating": 5, "pros": "Flexible working hours, friendly people, good location.", "cons": "Sometimes the other callers spoke on the phone really loud, which made it distracting to do calls. Also, it's a hard job because you're basically doing cold calling. You really do have to try hard to get people to talk to you.", "advice": "N/A"}, {"title": "Unique fast growth company with opportunities to grow", "text": "Pros - The company is constantly looking for go-getting leaders to shape the culture, work ethic and teams of the future. If you are the sort of person to put your hand up to take on new challenges, you will do well at the firm. - Good exposure to both industries and investors, and a great place if interested in how the buyside works and how research providers add value - Great people, by far the best asset of the company. You can easily make friends for life and work with smart, motivated individuals. - Dedicated management team who display enthusiasm and passion for the company's future growth Cons - With fast growth, comes the need to adjust to changes made by management towards achieving the longer-term goals for the firm. Depending on your attitude, you can see this as a learning experience as a professional in a high growth firm - Certain parts of the business (the main revenue drivers) see greater focus than others, and can create issues with being under-capacity in middle/ back office functions Advice to Management Keep things fresh. Continue your display of passion and conviction behind the company. Retain top talent that is committed to securing the success of the company's future.", "rating": 5, "pros": "- The company is constantly looking for go-getting leaders to shape the culture, work ethic and teams of the future. If you are the sort of person to put your hand up to take on new challenges, you will do well at the firm.", "cons": "- With fast growth, comes the need to adjust to changes made by management towards achieving the longer-term goals for the firm. Depending on your attitude, you can see this as a learning experience as a professional in a high growth firm", "advice": "Keep things fresh. Continue your display of passion and conviction behind the company. Retain top talent that is committed to securing the success of the company's future."}, {"title": "The opportunity to grow", "text": "Pros I joined Third Bridge as a 25 year old in London and I'm now 35, having worked across 6 different roles in 3 countries and traveled to all of Third Bridge's offices. I never would have imagined when joining the Third Bridge team in 2008 that I would be here 10 years later and that I would asked to do the things that I've done. The reason I've stayed for 10 years is that the business has continued to provide opportunities that have helped me grow and I'm still having fun. Cons Third Bridge is a meritocracy and so opportunity comes with hard work. At times I've really had to give it my all and I've sacrifice personal time to achieve my carrer goals. Advice to Management Please continue to focus on attracting and retaining high quality talent. The people that we work with are what make the difference...", "rating": 5, "pros": "I joined Third Bridge as a 25 year old in London and I'm now 35, having worked across 6 different roles in 3 countries and traveled to all of Third Bridge's offices. I never would have imagined when joining the Third Bridge team in 2008 that I would be here 10 years later and that I would asked to do the things that I've done. The reason I've stayed for 10 years is that the business has continued to provide opportunities that have helped me grow and I'm still having fun.", "cons": "Third Bridge is a meritocracy and so opportunity comes with hard work. At times I've really had to give it my all and I've sacrifice personal time to achieve my carrer goals.", "advice": "Please continue to focus on attracting and retaining high quality talent. The people that we work with are what make the difference..."}, {"title": "Great culture and work-life balance", "text": "Pros - Manager is really effective at encouraging sales in a constructive and helpful manner. - Really good culture, colleagues are great , get along with them well and willing to help one another - Company promotes work-life social balance and have monthly social outing plans for fun bonding activities with colleagues - Products are really unique and can add value for clients and there are many smart people behind in developing them. - Overall the environment makes me motivated to do well for the company Cons - Not sufficient leave days however (below average for a company in the finance industry)", "rating": 5, "pros": "- Manager is really effective at encouraging sales in a constructive and helpful manner.", "cons": "- Not sufficient leave days however (below average for a company in the finance industry)", "advice": null}, {"title": "Good company for new grads", "text": "Pros 1. Modern, neat and clean offices 2. It may seem daunting at first but this company is good for newcomers because you meet a lot of people who are in a similar situation to you (i.e. they just came out of university) 3. Good perks (free food and team outings every now and then) 4. People are professional and are willing to help- no selfish backstabbers here. 5. I would say a good company to grow your career in and one where you can progress provided you are hitting your targets Cons 1. Sales is tough anywhere...no exception here 2. Regardless what some bad apples say, it is not a call center. I worked as an intern at another investment bank and I would say that the experience at Third Bridge is def much better because you do get the rewarded. 3. The recruitment process did take a long time 4. Sometimes I felt the management was not experienced enough, maybe because they have been promoted internally and not from the outside. 5. No one really knows us outside of the industry Advice to Management 1. Please consider hiring staff from outside of the company (especially those who are management level because that can lead to issues) 2. Too many people with ideas but not much progress in terms of actual execution- I guess the same in GLG, AlphaSights as well", "rating": 5, "pros": "1. Modern, neat and clean offices", "cons": "1. Sales is tough anywhere...no exception here", "advice": "1. Please consider hiring staff from outside of the company (especially those who are management level because that can lead to issues)"}, {"title": "A nice company to work for", "text": "Pros 1. Professional and friendly colleagues who are always willing to help 2. Well structured HR process, including a proper induction for new employees and a caring team 3. You are provided with the opportunities to grow your ideas and create your own success to make an impact - like in any other company 4. Top notch facilities and a nice work environment (Wi-Fi works, AC is great, well-stocked kitchens for employees and a neat and clean work environment with lovely views across to the City) 5. Nice location in the heart of London 6. A healthy mix of employees from all different backgrounds, whether it is in regards to industry background, ethnicity and so on. And it is also good to know that not everyone is super smart or from top schools/universities- it is good to have a healthy mix of employees Cons Con is probably not a nice word to describe the following but things that can improve: 1. Salary can be lower than industry average 2. Resources can be limited in some departments (i.e. tools to get the job done, and certain ways of working are more in line with the traditional ways of the way the City works etc.) 3. Brand awareness needs to be increased - people are not really aware of who Third Bridge is Advice to Management You have invested heavily in infrastructure and the people- the key thing that is missing is how to fully utilize the talent and join the dots because it seems there are too many cooks in the kitchen and everyone has their own great ideas but execution is an issue and sometimes it is difficult to bring all the ideas together because everyone is doing their own thing to build success (which is fine, but it all needs to come together). Someone needs to project manage the whole process in an Agile way.", "rating": 5, "pros": "1. Professional and friendly colleagues who are always willing to help", "cons": "Con is probably not a nice word to describe the following but things that can improve:", "advice": "You have invested heavily in infrastructure and the people- the key thing that is missing is how to fully utilize the talent and join the dots because it seems there are too many cooks in the kitchen and everyone has their own great ideas but execution is an issue and sometimes it is difficult to bring all the ideas together because everyone is doing their own thing to build success (which is fine, but it all needs to come together). Someone needs to project manage the whole process in an Agile way."}, {"title": "Good and stable company to work for", "text": "Pros - Nice and friendly colleagues who are willing help anytime and always show professionalism and integrity - Global reach - so chance is that you will get to travel on business - Plenty of career opportunities and plenty of support for you to excel - Great work location - Training is provided on an on-going basis - Team outings so get to socialise and make friends for life! - Finally, you LEARN a lot. Best job for a recent grad. Highly recommended Cons - I cannot think of any - All I can say is that you are what you want to be. There are going to be unhappy/happy people in EVERY company - ignore the unhappy ones. Advice to Management Ignore those with negative energy and just keep doing what you are doing!", "rating": 5, "pros": "- Nice and friendly colleagues who are willing help anytime and always show professionalism and integrity", "cons": "- I cannot think of any", "advice": "Ignore those with negative energy and just keep doing what you are doing!"}, {"title": "Research Analyst", "text": "Pros Good place to start a career after university and develop skills necessary to succeed long term at the company or elsewhere. Strong investment in each employee's success and personal development. Lovely friendly company culture. Spacious and modern office with world-class facilities including high-speed W-Fi, complimentary well-stocked kitchen, showers and cycle storage and neat and clean toilets etc. Pretty much everything you need to get your work done. Cons No major cons. Young company with some growing pains that are always addressed through communication to responsive leadership. Advice to Management Keep up your level of care and investment in employees. Don't let growth compromise who you hire. Make sure recruitment process reaches a diverse audience.", "rating": 5, "pros": "Good place to start a career after university and develop skills necessary to succeed long term at the company or elsewhere.", "cons": "No major cons. Young company with some growing pains that are always addressed through communication to responsive leadership.", "advice": "Keep up your level of care and investment in employees. Don't let growth compromise who you hire. Make sure recruitment process reaches a diverse audience."}, {"title": "Great company to work for", "text": "Pros - Great location - Friendly and professional team who are always there to help and are team and clinet focused - Great in-house facilitates (stocked kitchen, fast and uninterrupted Wi-Fi, great modern and clean offices - Everything you need to get the work done! Cons - can be a bit quiet at times like a library but I suppose that’s a good thing Advice to Management Keep up the great work...London needs companies like this!", "rating": 5, "pros": "- Great location", "cons": "- can be a bit quiet at times like a library but I suppose that’s a good thing", "advice": "Keep up the great work...London needs companies like this!"}, {"title": "Good place where you can grow your career", "text": "Pros I took this job because I liked the fact that it is not so much cut throat as some of the Vanilla big ones in the City- but the company offers some AMAZING career growth opportunities and experience to rival even the big companies in Wall Street. 1. The company values hard work and rewards you with world-class opportunities to grow your career 2. Excellent, clean and neat world-class working facilities - I would say no different to what you get in any Fortune 100 company 3. Excellent benefits (pension, health, insurance, holidays and birthday/wedding treats!) 4. Good, professional and friendly managers who support you all the way through your work here at Third Bridge 5. Even though a lot of staff are exceedingly highly educated (mostly IVY league/Oxbridge/MBA top 0.01% of their class), there is no sense of peer competitiveness, everyone works together with each and that is the beautiful thing. Team work is essential here and thankfully no selfishness (which I was afraid of). Cons 1. Some of the managers have been internally promoted- lack of experience and not being able to see outside of \"Third Bridge\" Advice to Management Probably good to hire a few external people who have experience of managing people and leading teams. Some of the senior staff have been internally promoted from within and while that can be a good thing- think about the amazing amount of experience your company can gain from hiring external manager who have worked in this industry but are more experienced. After all, change can be a good thing! But above else, I would not be surprised if this company becomes one of the big 4 one day...", "rating": 5, "pros": "I took this job because I liked the fact that it is not so much cut throat as some of the Vanilla big ones in the City- but the company offers some AMAZING career growth opportunities and experience to rival even the big companies in Wall Street.", "cons": "1. Some of the managers have been internally promoted- lack of experience and not being able to see outside of \"Third Bridge\"", "advice": "Probably good to hire a few external people who have experience of managing people and leading teams. Some of the senior staff have been internally promoted from within and while that can be a good thing- think about the amazing amount of experience your company can gain from hiring external manager who have worked in this industry but are more experienced. After all, change can be a good thing! But above else, I would not be surprised if this company becomes one of the big 4 one day..."}, {"title": "I like it...nice company!", "text": "Pros - Good working environment with a positive vibe - Overall, very pleasant people - even the difficult ones - Treats employees equally, whether front or back office - You learn a lot and there is a lot to learn for newcomers. Kudos has to be given to the two founders for finding a niche business model that works for everyone and it is bringing fruits for the company. - Good employees who are willing to help and new grad-friendly. Everyone is super nice and will always be there to help you to learn so don't be afraid to ask questions. - Ignore the people with negative energy (you get one or two in every company, everywhere in the world, but here it really is like a family and becoming a big family now!) Cons - 9am-6pm (could be more like 9-5 if possible?) Advice to Management Consider looking at how you can raise the name of the company globally- whenever I tell people I am calling from Third Bridge, the responses are like \"Who?\", \"What do you guys do?\"", "rating": 5, "pros": "- Good working environment with a positive vibe", "cons": "- 9am-6pm (could be more like 9-5 if possible?)", "advice": "Consider looking at how you can raise the name of the company globally- whenever I tell people I am calling from Third Bridge, the responses are like \"Who?\", \"What do you guys do?\""}, {"title": "Marketing Manager", "text": "Pros 1. Good working location 2. Good company benefits 3. Supportive and professional staff who have the same vision to grow the company into a world-class brand in the research industry 4. Very good learning and development program for newcomers to the industry Cons 1. Not really a con but it is a SME and moving towards becoming international Advice to Management Keep up the good work...work on that brand awareness!", "rating": 5, "pros": "1. Good working location", "cons": "1. Not really a con but it is a SME and moving towards becoming international", "advice": "Keep up the good work...work on that brand awareness!"}, {"title": "Research Associate", "text": "Pros Good culture Excellent pay and bonuses Interesting work Lots of different clients in the financial services space Cons Long hours Monotonous work Pressure of targets Advice to Management Do something to retain your employees and career progression could be improved", "rating": 3, "pros": "Good culture", "cons": "Long hours", "advice": "Do something to retain your employees and career progression could be improved"}, {"title": "Worst Job I Ever Had", "text": "Pros Flexible schedule, I was working 3 days a week and it was never an issue to switch which days those were if something came up Cons They lure you in with the idea of an almost immediate salary increase upon working a set number of hours, but they don't tell you exactly how your days will be spent. It was a group of multinational telemarketers. It would have been an easier transition into the job itself to know exactly how the days would be spent, and that it was largely isolating yourself to ensure that we would be making the right amount of complete calls as we had to check into our manager every day and let them know. Advice to Management A complete structural overhaul to be a more honest company to both your employees and to the people who trust your evaluations.", "rating": 3, "pros": "Flexible schedule, I was working 3 days a week and it was never an issue to switch which days those were if something came up", "cons": "They lure you in with the idea of an almost immediate salary increase upon working a set number of hours, but they don't tell you exactly how your days will be spent. It was a group of multinational telemarketers. It would have been an easier transition into the job itself to know exactly how the days would be spent, and that it was largely isolating yourself to ensure that we would be making the right amount of complete calls as we had to check into our manager every day and let them know.", "advice": "A complete structural overhaul to be a more honest company to both your employees and to the people who trust your evaluations."}, {"title": "Okay first job - uninspiring work", "text": "Pros - Intelligent and ambitious colleagues - Fast paced work - Strong culture, tight-knit workforce - Good first job, broad exposure to financial services Cons - Uninspiring work, quickly becomes repetitive - Not clear what job it sets you up for next - Can be very political, easy for managers to have favourites Advice to Management Continue to explore ways to keep workforce engaged after the first year", "rating": 3, "pros": "- Intelligent and ambitious colleagues", "cons": "- Uninspiring work, quickly becomes repetitive", "advice": "Continue to explore ways to keep workforce engaged after the first year"}, {"title": "Great company to start your career", "text": "Pros - young team - good monetary bonuses -great location Cons - work life balance -salary -repetitive work", "rating": 5, "pros": "- young team", "cons": "- work life balance", "advice": null}, {"title": "Its...okay", "text": "Pros I can't think of a pro. earn the money to survive in London I guess Cons weird work time calculation. starting the work a bit too early. lose motivation easily cuz what you need to do is keep calling people. can't learn much on this post.", "rating": 3, "pros": "I can't think of a pro. earn the money to survive in London I guess", "cons": "weird work time calculation.", "advice": null}, {"title": "Research Analyst", "text": "Pros good salary for entry-level graduates Cons limited career development, but the training system is quite good.", "rating": 5, "pros": "good salary for entry-level graduates", "cons": "limited career development, but the training system is quite good.", "advice": null}, {"title": "Don't take it for granted", "text": "Pros - Great team of international, ambitious people (I made a lot of life-long friends) - Big focus on training and development (e.g. personal development budget for courses) - Excellent culture and perks (e.g. snacks/drinks, private healthcare, away days, secondments in other offices, and an annual ski trip) Cons - Some people took it for granted (a few people who joined without any prior work experience had quite unrealistic expectations) - Quite a lot of growing pains (the rapid growth was exciting, but it meant that internal systems/procedures were always struggling to catch up) - Departments became a bit insular (it was harder and harder to meet new people) Advice to Management There are so many great people working for you – help make sure they all meet each other!", "rating": 5, "pros": "- Great team of international, ambitious people (I made a lot of life-long friends)", "cons": "- Some people took it for granted (a few people who joined without any prior work experience had quite unrealistic expectations)", "advice": "There are so many great people working for you – help make sure they all meet each other!"}, {"title": "Long working hours", "text": "Pros Great people to work together Cons long working hours, boring working", "rating": 3, "pros": "Great people to work together", "cons": "long working hours, boring working", "advice": null}, {"title": "Only as an internship or while looking for something else", "text": "Pros some nice colleagues great offices CEO and founder are nice, but completely uninvolved with the management of connections Cons Pay is miserable for the first 6 months. It gets better with time but still not great You will learn all there is to learn in the first 4 months. After that it is all a micromanagement course. Most managers are very intellectually limited - specially in the consulting vertical Upper management loves saying they listen to their employees to quickly act and make conditions better but actually they just ignore them. (e.g extremely outdated target system) My Advice: only work at TB as an intern or while you re looking for another job that will actually allow you to get some real experience- especially if you went to a top university Advice to Management The job requires 0 brain cells - as someone else previously mentioned -, this makes employees easily replaceable so I don't think Management is trying to improve their retention rates. Easiest way to improve TB = increase salaries to match what recent grads from top universities expect. If you re not willing to do this then hire people without a degree.", "rating": 3, "pros": "some nice colleagues", "cons": "Pay is miserable for the first 6 months. It gets better with time but still not great", "advice": "The job requires 0 brain cells - as someone else previously mentioned -, this makes employees easily replaceable so I don't think Management is trying to improve their retention rates."}, {"title": "Good People, Horrible Pay", "text": "Pros - Really fun environment, everyone is genuinely great and the atmosphere is young and fun- monthly socials and yearly ski trips, summer away days, good opportunities to visit the other offices. Cannot stress enough how well management has done in recruiting great people to the workplace - Opportunities to move up quickly, get management experience within a year (not something common in other jobs) - Exposure to a wide range of clients, you learn a lot of valuable interpersonal, sales, client facing skills as well as time management skills/project management skills Cons - SALARY. Competitors have a 30k base salary and higher monthly bonuses, whereas the base salary for new joiners has not changed with inflation.. ever. Joiners are overqualified and underpaid, and when management is challenged on this they brush it off saying salary is \"competitive\". Perhaps competitive for London but not for the industry Third Bridge is in (the expert network industry). The New York office workers are paid much higher than those in London even given similar costs of living. - Additionally, regardless of the monthly bonuses, individuals doing well in their job (i.e. Hitting target) might not get the higher bonuses due to their vertical not hitting target. Many experienced employees will leave because of this. Advice to Management Your employees work hard and long hours to deliver on this job, but are paid much too little - I honestly believe your retention issues would be much lesser would salary be in line with competitors who are experiencing less of these problems.", "rating": 3, "pros": "- Really fun environment, everyone is genuinely great and the atmosphere is young and fun- monthly socials and yearly ski trips, summer away days, good opportunities to visit the other offices. Cannot stress enough how well management has done in recruiting great people to the workplace", "cons": "- SALARY. Competitors have a 30k base salary and higher monthly bonuses, whereas the base salary for new joiners has not changed with inflation.. ever.", "advice": "Your employees work hard and long hours to deliver on this job, but are paid much too little - I honestly believe your retention issues would be much lesser would salary be in line with competitors who are experiencing less of these problems."}, {"title": "Great people, potential for career progression, sometimes monotonous work", "text": "Pros The people who work at Third Bridge are genuinely really great; lots of graduates and like-minded young people. People are from different backgrounds and there are loads of different languages spoken in the office. If you are good at the role then you can earn a good bonus and be promoted very quickly. Fun socials and lovely office building in a good location. Cons To begin with the Research Analyst role is basically recruitment and involves a lot of cold calling which can be very repetitive and monotonous especially if you are not promoted after a few months. There is a lot of focus on hitting targets which can be overwhelming and detrimental to performance. Although the hours are 9-6, most people work a lot later than that. A lot of focus on company profits.", "rating": 3, "pros": "The people who work at Third Bridge are genuinely really great; lots of graduates and like-minded young people. People are from different backgrounds and there are loads of different languages spoken in the office. If you are good at the role then you can earn a good bonus and be promoted very quickly. Fun socials and lovely office building in a good location.", "cons": "To begin with the Research Analyst role is basically recruitment and involves a lot of cold calling which can be very repetitive and monotonous especially if you are not promoted after a few months. There is a lot of focus on hitting targets which can be overwhelming and detrimental to performance. Although the hours are 9-6, most people work a lot later than that. A lot of focus on company profits.", "advice": null}, {"title": "Great first job", "text": "Pros - get to work with great people. - culture is fun and social - learn new skills to help get next role - bonus can be good - get to visit other company offices Cons - Research job can get repetitive - Salary is not the best, better if you get bonus Advice to Management promoting people internally for TL or VP jobs is not always the best way. Should think about looking outside of company for good managers.", "rating": 5, "pros": "- get to work with great people.", "cons": "- Research job can get repetitive", "advice": "promoting people internally for TL or VP jobs is not always the best way. Should think about looking outside of company for good managers."}, {"title": "Avoid if possible", "text": "Pros - Colleagues are all young and that makes for a fun atmosphere a lot of the time. - As a result, it’s a good extension of university, and an easy transition into working life. - Kitchens are very well stocked (lifesaver). - You do pick up basic sales skills, learn how to deal with difficult people, and work out how to manage your time in a way that you never have had to before (although some might argue that you pick the latter up no matter where you work). Cons - The work gets boring very quickly, you most definitely do not need a degree to do it. - You don’t learn anything, and at times you might feel like your brain cells are dying. - Expectations vary from team to team and can be ridiculous (given the pay). - Progression is largely based on luck, you can work incredibly hard and still not get promoted. - Whether you do well or not month on month will inevitably affect how you are feeling outside of work because a) it’s all anyone talks about and b) it affects your salary. - The people managing you have no management experience (other reviews have called this ‘the blind leading the blind’, I’d say that’s pretty accurate). - Most of the brightest hires leave within a year. As a result, the majority (not all) of the people you answer to are not the sharpest. These are the people who then micromanage you. - The micromanagement is unbelievable, and insulting. You often find yourself being treated like a child by someone who only has a few months more experience than you. Advice to Management - Hire some people with actual management experience to be VPs and TLs. - Stop hiring grads from top universities, all you do is make them miserable and you really do not need to have the brightest people in the country working for you, let them do something worthwhile. - Change the job title from ‘research analyst’ to ‘analyst’. The way the industry works means that no one ever has the time to research anything. - Sort out client allocations. The account managers have quarterly targets for each client, why is this not used to make sure everyone in the Connections team gets a fair amount of business and a fair shot of hitting their targets? - If your employees ask questions like the one above in a Q&A session, don’t threaten to move them to another team. You haven’t answered the question and you come across as childish. - Sort out identity crisis #1 (internal): are you a serious workplace or a company full of kids? The VPs and TLs expect everyone to take their jobs seriously but how can employees do that if you put on monthly socials where everyone gets trashed and then have TLs coming in at 11am the next day? - Sort out identity crisis #2 (external): the clients are never going to see Third Bridge as a research partner, because the people who stay at Third Bridge long enough to meet clients just aren’t that impressive. Stop thinking so highly of yourselves, and go for a different angle. Maybe go for the start-up angle and let everyone wear jeans every day (bet everyone would love that). You will be taken more seriously if you present yourself as a different thing altogether than as anything close to a hedge fund/PE firm/big consulting firm.", "rating": 3, "pros": "- Colleagues are all young and that makes for a fun atmosphere a lot of the time.", "cons": "- The work gets boring very quickly, you most definitely do not need a degree to do it.", "advice": "- Hire some people with actual management experience to be VPs and TLs."}, {"title": "Unhealthy work culture, boring job", "text": "Pros nice office, median age in the early twenties (a bit of a kidzania vibe), colleagues often relatively amicable and international, potential for fast career progression (albeit in a minority of cases) Cons • Misleading job title: There is no analysis in the research analyst position. Most of what you’ll be doing is browsing LinkedIn, browsing the internal database, and cold calling/emailing prospective experts. • Low pay: Third Bridge brands itself as the premium expert network, but pays its employees less than competitors (alpha sights have 5k more annual base). • Bonus system: Somewhat arbitrary and random, your work performance is hugely affected by which vertical/team you are in, who your boss is and what projects you work on. End result is hard work doesn’t necessarily pay off. • Bonus system 2: The target driven system is rather angsty, a section of your screen is devoted to showing you how much more you need to hit at all times. You do get something of a hamster in his wheel kind of vibe. • Bonus system 3: For every dollar you generate, you get paid back a cent…Woof! • THE WORK CULTURE: Apologies for the caps, but this needs emphasis. The work culture at TB is downright unhealthy. Expect institutionalised micromanagement, and constant surveillance and chasing from your bosses. To give you an idea, every single hour of work has to be accounted for, to the minute. And you get no say in what you actually spend your time on. Essentially, you come in the morning, get your orders, input them in the system, get monitored all day, and before leaving you must show proof that you did all the tasks initially inputted. Its beyond Kafkaian. • The hours: Not incredibly long (9 to 6:30) but zero flexibility and very intense. When they say 9am it’s 9am not 9:02. You will get told of for coming one or two minutes late. You will also never, ever, have time to check your phone or have a chat during work hours. • The work culture, part 2: As of June, listening to music (even with earphones) has been outlawed. So don’t expect to put on a tune whilst you’re scrolling down 15 pages of LinkedIn profiles. Beyond Kafkaian. • The work culture, part 3: There is a lot of backstage politicking and factions within the workforce. There is also a culture of secrecy, often for utterly mundane things (e.g. a colleague leaving) Advice to Management There is little point offering suggestions for TB to change because strict micromanagement, using overqualified graduates and low retention rates are part and parcel of the business model. Unfortunately, this means that for most employees, Third Bridge isn’t ‘about us’.", "rating": 3, "pros": "nice office, median age in the early twenties (a bit of a kidzania vibe), colleagues often relatively amicable and international, potential for fast career progression (albeit in a minority of cases)", "cons": "• Misleading job title: There is no analysis in the research analyst position. Most of what you’ll be doing is browsing LinkedIn, browsing the internal database, and cold calling/emailing prospective experts.", "advice": "There is little point offering suggestions for TB to change because strict micromanagement, using overqualified graduates and low retention rates are part and parcel of the business model. Unfortunately, this means that for most employees, Third Bridge isn’t ‘about us’."}, {"title": "Deplorable", "text": "Pros Friendly and like minded people Very international Cons I try to keep the list of cons as concise as possible: =>TERRIBLE SALARY: You will be working long hours constantly (45+ hours a week as a minimum) and paid no more than 25k before tax in your first couple of months. Third Bridge says it pays its employees a competitive wage but this is a complete lie: Both OTE and base salary are far lower than industry average. You need to stay at least 8-9 months before you earn a decent bonus (if you are doing well and have not resigned). By this point, you will have helped the company make 10x the amount they paid you. =>MINCROMANAGED: You will have a review every single month which will often be complete character assassination. Some employees have been told to change their personality while others have been told that their bathroom breaks are a little too long. These reviews are usually just there for Third Bridge to pressure you into bringing more revenue in while cutting costs. This brings me to my next point: =>PRESSURE ON COST-CUTTING: Your employees find it unbelievably hypocritical that you are asking them to keep costs as low as possible while paying them as little as possible. The CEO loves to brag about how great EBITDA and margins are but feels no remorse about paying his over-qualified staff a minimal wage. =>NO WORK LIFE BALANCE: You will be expected to work long hours and every minute of your day will be accounted for. If you decide to leave at 6 every day, you will be managed out. The same applies if you do not come into work at least 10 minutes early each day. =>MANAGEMENT: There are a few good people in managerial positions. However, all managers on the research floor have simply climbed through the ranks. The result is that those who are team leaders at Third Bridge are those that thrived in the toxic environment and stayed long enough to get promoted. They usually got promoted because they were the only ones left. ---------- ---------- FINAL NOTE: Overall this is not a real job. You are neither a researcher, nor an analyst. If you are a creative person or if you have an ounce of intellectual curiosity you will quickly get very bored. You will be repeating the same steps across every single ‘research’ project: -‘Project’ comes in. This consists of a list of companies and a few qualifying questions -You check the internal data base to see if anyone is available to answer those questions/has worked at those companies. If so you schedule a conference call which you are not allowed to join. - If not, you will have to scan through pages of Linkedin/other recruitment tools and spam/cold call as many people as possible until someone agrees to have a discussion on that industry with your client for as little as possible, while charging the client an exuberant rate. -Repeat. It is not uncommon that confidential information is shared during these conversations and you will often feel like Third Bridge and its competitors are operating in somewhat of a grey area. Advice to Management If you are made an offer by Third Bridge, you are almost certainly overqualified. Third Bridge takes advantage of motivated students from top schools because they know that they will learn to do the job quickly and efficiently and that they are a commodity that is easy to replace. There is no point suggesting anything to top management. They are not interested in improving the retention or listening to their employees because these pains are an integral part of the operating model. The only positive thing about third bridge is that it can only get better from there.", "rating": 1, "pros": "Friendly and like minded people", "cons": "I try to keep the list of cons as concise as possible:", "advice": "If you are made an offer by Third Bridge, you are almost certainly overqualified. Third Bridge takes advantage of motivated students from top schools because they know that they will learn to do the job quickly and efficiently and that they are a commodity that is easy to replace. There is no point suggesting anything to top management. They are not interested in improving the retention or listening to their employees because these pains are an integral part of the operating model. The only positive thing about third bridge is that it can only get better from there."}, {"title": "Micro managed", "text": "Pros Nice co-workers for the most part, very intelligent and kind people. Cons 1. Another company who does the same thing offers 30k as a start salary. Everything is dependent on the bonus at TB which you only get if tou hit the target. 2. Talking about targets, depending on the vertical you are in they can be extremely difficult because of odd clients and other circumstances outside your control. This is not accounted for in your target and you will often get put down for not reaching your target in the monthly feedback session, which for some teamleaders are just a way to exert power over you. 3. As mentioned in other reviews, teamleaders are responsible for managing 8-9 people, despite having no experience whatsoever and no talent for managing people. Some TLs use their position to manage you out if they dont like you. Company knows about it too, but no one does anything against this sort of power abuse. 4. In the beginning you are just used to recruit new people and you are not allowed to use internal people. So you're just slaving away cold calling people, while associates recruit maybe one person a month but hit their targets because they are allowed to use the internal system. 5. Micro managed to the max. People will go through your every piece of communication with the specialist and measure your performance on how much you hassle specialists. Stay away as faaaaar as possible. Especially if you do not want to be a recruiter, which is just what the position is. Zero brain cells engaged and you do better if you turn of all thinking and just do what you're told. Research and analysis is something completely absent from this position. Advice to Management The position is a recruitment consultant position, advertise it as such!", "rating": 1, "pros": "Nice co-workers for the most part, very intelligent and kind people.", "cons": "1. Another company who does the same thing offers 30k as a start salary. Everything is dependent on the bonus at TB which you only get if tou hit the target.", "advice": "The position is a recruitment consultant position, advertise it as such!"}, {"title": "Soulless work environment. Is bearable if making money is your sole motive.", "text": "Pros Really nice co-workers Good pay Working alongside offices in other locations Cons The company calls itself a primary research agency which is completely false. It is basically a call center where you have to continuously call up people and persuade them to help with your \"project.\" There is no analysis nor any brain work required for the job. It can get depressing and monotonous with no mental stimulation. The work environment is terrible. It's very difficult to get personal leave approved and you have to provide multiple reasons for taking leave. Even a sick leave is often cross questioned. It is a target driven organisation so if you are not converting enough phone calls you may have issues dealing with the pressure. Lastly, irrespective of the career progression the job remains pretty much the same unless you are sitting in the head office.", "rating": 1, "pros": "Really nice co-workers", "cons": "The company calls itself a primary research agency which is completely false. It is basically a call center where you have to continuously call up people and persuade them to help with your \"project.\" There is no analysis nor any brain work required for the job. It can get depressing and monotonous with no mental stimulation. The work environment is terrible. It's very difficult to get personal leave approved and you have to provide multiple reasons for taking leave. Even a sick leave is often cross questioned. It is a target driven organisation so if you are not converting enough phone calls you may have issues dealing with the pressure. Lastly, irrespective of the career progression the job remains pretty much the same unless you are sitting in the head office.", "advice": null}, {"title": "Glorified call centre", "text": "Pros You get to chat to a lot of people over the phone. So that's cool, if you're into it. Cons Hourly pay, measured lunch breaks. Unrelenting...", "rating": 3, "pros": "You get to chat to a lot of people over the phone. So that's cool, if you're into it.", "cons": "Hourly pay, measured lunch breaks. Unrelenting...", "advice": null}, {"title": "Research", "text": "Pros Great company values. Excellent team spirit. Cons Low base salary. Work can be repetitive.", "rating": 3, "pros": "Great company values. Excellent team spirit.", "cons": "Low base salary. Work can be repetitive.", "advice": null}, {"title": "Research analyst", "text": "Pros The employees are really nice and there is a good ambience. You can progress really fast and people are generally supportive. The office view is great. Cons The work can be a bit repetitive and the hours are long. The starting salary is low and it takes time to manage to have a decent bonus.", "rating": 5, "pros": "The employees are really nice and there is a good ambience. You can progress really fast and people are generally supportive. The office view is great.", "cons": "The work can be a bit repetitive and the hours are long. The starting salary is low and it takes time to manage to have a decent bonus.", "advice": null}, {"title": "Stay very very far away", "text": "Pros The people are fun, very social and young, everyone is under 30 and for most its the first job out of uni. You get to speak with very interesting people, CEOs etc of huge multinational companies Cons where to start.. 1. Pay is awful, you are essentially expected to make 10-13k a month for the first 3 months for the company. Dependant on your role RA1, RA2, Associate, Senior Associate you are expected to make 13k, 25k, 36k, 40k ish for the company PER MONTH and you barely see 30k a year which is very unfair, yes there are bonuses but they do not compare and are often very low. In a very good month as an Associate you would make maybe 1k. 2. Team leaders are young, usually become a TL after a year or two in the role are all around 25 and managing 6-8 people. Literally \"the blind leading the blind\". VPs are no better. 3. New initiatives are constantly being rolled out, never standardized and never around long enough to see if they actually work or not 4. Very high turnover rate 5. Boring and very repetitive work 6. Mircomanaged to the max, you have to show what you are working on every hour of the day and the whole office can see it. 7. Constantly giving \"feedback\". 90% of the time you don't know what you're supposed to do with it, the feedback you give is never really taken seriously (note all glassdoor reviews for example, nothing has changed and management is fully aware of them). Team Leaders have to give feedback monthly, even if you are doing things well they have to find things wrong and give feedback on it. 8. No loyalty. You are never safe from being fired people that have been there for over 2 years that have consistently performed are terrified of not hitting targets for even a month or two in fear of being fired. Advice to Management -Hire less intelligent people. By hiring people from top tier universities they get bored with mind numbing work. The job requires 0 brain cells. - Increase salaries - Better management TLs AND VPs.", "rating": 1, "pros": "The people are fun, very social and young, everyone is under 30 and for most its the first job out of uni.", "cons": "where to start..", "advice": "-Hire less intelligent people. By hiring people from top tier universities they get bored with mind numbing work. The job requires 0 brain cells."}, {"title": "think twice before applying", "text": "Pros - good first job if you don't know what to do - opportunity to pick up good sales/soft skills quickly - fun, young and friendly environment Cons - terrible pay given the long hours and high stress - TB grossly mis-sells the role - this is more akin to recruitment/call centre work than a genuine research position - monotonous to the point of mind-numbing - a poor use of a university degree - aggressively target-focused Advice to Management - if you want to increase your retention rates, incentivize them to stay in what is an extremely drudgey job by paying them more.", "rating": 3, "pros": "- good first job if you don't know what to do", "cons": "- terrible pay given the long hours and high stress", "advice": "- if you want to increase your retention rates, incentivize them to stay in what is an extremely drudgey job by paying them more."}, {"title": "Not Quite What It Seems", "text": "Pros Great social life Everyone is friendly Cons Many have better opportunities than others Learning stops after a short while", "rating": 3, "pros": "Great social life", "cons": "Many have better opportunities than others", "advice": null}, {"title": "Great first job straight out of uni - stay away if you don't like target-driven environments", "text": "Pros - As most other reviews mention, the people at Third Bridge make the company. Your colleagues will almost all be interesting, intelligent, fun and just overall nice to be around. - The job offers quick progression as long as you perform strongly. You can expect to be promoted every 3-4 months. The promotions do not fundamentally change the job but they do come with an increase in responsibilities, opportunities to learn and of course with more earning potential. - Although not on par with the traditionally high-earning jobs in consulting or banking, you can make a really good amount of money in OTE. - A good opportunity to learn vital soft skills. If you're keen to learn, you'll quickly pick up proficiency in negotiating, project management, client relationship management, and also gain confidence in speaking, both on the phone and in person.  - Upper and mid-level management are approachable and do care about feedback. You can genuinely walk up to very senior members of staff and have a chat about the company, share feedback, etc. Implementing the feedback is a bit more complicated as this is now a 600-strong company rather than a startup, but the atmosphere of openness with most managers is a breath of fresh air. - Great office, complimentary socials. Cons - A large amount of the work is very dull, especially if you have just come from an interesting course at a strong university (which 90% of colleagues will have). For project managers, the job is divided into two broad parts - recruiting experts to add them to Third Bridge's expert network, and sharing profiles of both new and existing experts with clients, in order to organise calls between the client and the expert. And that's it. You don't participate in the calls, and therefore learn very little about the projects themselves. This is exacerbated by the fact that, depending on the vertical, projects can be very, very short-term (sometimes literally hours), which means you will inevitably have to spend less time learning about the project focus and more time making sure you send/recruit as experts as possible. For Research Analysts (the position you will most likely join Third Bridge as), you don't even do the client relationship part. This means that, 8 hours a day, you will be essentially doing recruitment, reaching out and cold messaging/calling experts. The good news is that, if you manage to hit your target three months in a row, you will immediately be promoted to Project Manager. The bad news is that no target, no promotion - and most people do not make it more than 5-6 months at Research Analyst level without bailing if they are not promoted. - The target system: if you do not enjoy working in a target-driven environment where 20-25% of your effective salary (and up to 50% at more senior research positions) depends on your hitting your \"Triangulator target\", you should honestly not work here (at least in Connections - Forum and Intelligence are a different story). Target is the single most important aspect of working at Third Bridge and is what most people talk about when discussing work. - In line with the above point, if you don't enjoy the \"pressure to sell\" (in this case, to either push your client to organise calls or to chase prospective experts to join the network), this is not the job for you. If you cannot see yourself enjoying, or at least tolerating, large amounts of cold calling/messaging, or if you think this skill is not worth learning for you, again, you should seriously reconsider working here. You will spend a good 50% of your time at work on the phone. This is not for everyone. - The downside to working at a company filled with young, smart and ambitious people is that gossip is rife at Third Bridge. 95% of it is harmless, but there are bad apples at the company who will take it too far, and unfortunately, if they are strong performers or senior, well-liked members of a team, there is little chance that they will face disciplinary action. - Although this has also changed in the past few months, you have very little say in which vertical/team you will end up in. For context, the Connections business is divided into teams working for either Consulting Firms, PE Firms or Hedge Funds. Your experience will vary drastically depending on which vertical or which team you are put on. - Currently the compensation package is too weighted towards OTE and not base pay. This means that many employees' life is strongly affected by whether they hit target month-on-month (this often depends more on events outside of their control, rather than their individual performance).  - Long hours: if you want to succeed, it is almost impossible to do so while sticking to the 9-6 hours. Advice to Management - Explain the role more clearly in order to avoid recruiting people who leave after less than 6 months, as these are the cases that most harm morale. - Re-work the compensation package to make it less weighted towards target performance, and so that it is more in line with competitors in the market.", "rating": 5, "pros": "- As most other reviews mention, the people at Third Bridge make the company. Your colleagues will almost all be interesting, intelligent, fun and just overall nice to be around.", "cons": "- A large amount of the work is very dull, especially if you have just come from an interesting course at a strong university (which 90% of colleagues will have). For project managers, the job is divided into two broad parts - recruiting experts to add them to Third Bridge's expert network, and sharing profiles of both new and existing experts with clients, in order to organise calls between the client and the expert. And that's it.", "advice": "- Explain the role more clearly in order to avoid recruiting people who leave after less than 6 months, as these are the cases that most harm morale."}, {"title": "Good people doing repetetive work under inconsistent management", "text": "Pros Summary: Acceptable first job, especially if you're interested in a commercial/business career. It will make you work fast and efficiently, at the cost of engagement with the actual research and independence. Superficial and repetitive, work at Third Bridge does not in itself motivate. Instead the company relies on bonuses, the prospect of promotion, and the threat of bad feedback as incentives, largely ignoring the supposed values. Positives: atmosphere, experience, money As mentioned in many reviews, Third Bridge has a nice, international atmosphere, due to the large number of bright, likeminded graduates the firm hires. This is a big factor, as you will work with plenty of people you will enjoy hang out with. There are also some perks like snacks/drinks on Friday and socials. As a first job out of uni, its a good place to gain office experience as well as a crash course in business language and industry knowledge. The fast paced nature of the job pushes people to learn to organise their time very well. There is also an aspect of client relationship management, which is good experience. This is helpful for later job interviews. Bonuses are available for good performance, which means you can make quite good money. Third Bridge also promotes people relatively quickly, which in theory creates the potential for gaining leadership experience early. Cons Negatives: leadership, opaque decision making, boring work, micromanagement The word research is misleading, recruitment describes it better. Engagement with content is minimal, there are strong disincentives to actually learning about the topics, because it costs valuable time. Workload is consistently high and together with the target system generates strong incentives to work overtime. This is not compulsory and a minority of people does manage to leave on time consistently. Giving responsibilities to young people can lead to people managing others who have very little experience and not in every case obvious talent for this. Therefore new hires have very different experiences as some managers prioritise short term results over long term development and treat people they like of the same rank widely differently. This is especially true when somebody does not hit their targets, which will be blamed on the individual, regardless of external factors such as the amount of work coming in. The inconsistent treatment applies to other aspects as well, for example leaving the company. Ineffective middle/upper management has in the past failed to address issues of leadership and above average pressure on individuals or teams. The numbers based target system as well as frequent feedback are supposed to ensure transparency and commons standards, but are applied inconsistently. In fact, I often felt as if transparency stops with management: Decisions are taken in closed meeting with most employees being told afterwards or find out when information slowly leaks through the company. In addition to the individual management issues outlined above, there is a general tendency in Third Bridge to micromanage processes in order to maximise narrow, company specific measures of efficiency. Competent employees have been told when and how to communicate dozens of times a day, making them perform worse. Despite a supposed culture of openness and developing people, feedback on the way the firm is run does not seem to be implemented beyond cosmetic measures. You will hear a lot about the values, but I did not feel they were central to the way Third Bridge works. Advice to Management Standardise procedures, especially with regard to feedback, progression and HR Focus on long term development instead of micromanaging individual behaviours Recognise factors beyond employees control and different circumstance more strongly Control low level and middle mangement better Communicate decisions clearly and timely", "rating": 3, "pros": "Summary:", "cons": "Negatives: leadership, opaque decision making, boring work, micromanagement", "advice": "Standardise procedures, especially with regard to feedback, progression and HR"}, {"title": "'Only if no other alternative'", "text": "Pros - By all means: the people you work with. Are all graduates of top universities, multi-lingual and global minded. - Nice office (good location, clean and new). - Opportunity to learn to know a lot of new industries. Cons - The work is really, and I mean really, boring, but at the same time it is very stressful. - You need to work against - sometimes ridiculous - short deadlines, but your success has a lot to do with how much people you want to cold call in an hour. - You better like cold calling, because that is the only way you will be succeed. - There is an insane amount of gossip on the work chat, mainly by the more 'senior' members. - Don't think this is a job in finance, it is a call center job. - Not very vertical is the same and beware if you are send to the 'wrong' one. You have also no choice at all in that. Advice to Management - Get rid of (or at least change) the Triangulator, you try to force an objective system on an often subjective reality. There is no objective way to get around work flow, good/bad angles, working on long term strategy, etc. - Trust your researchers more, currently they have to account in 15 minute increments for their time, tag all communication, etc. And on top of that both PM and Team Leaders are looking over your shoulder. - Don't hire the type of qualified people you do, or give them more responsibility.", "rating": 3, "pros": "- By all means: the people you work with. Are all graduates of top universities, multi-lingual and global minded.", "cons": "- The work is really, and I mean really, boring, but at the same time it is very stressful.", "advice": "- Get rid of (or at least change) the Triangulator, you try to force an objective system on an often subjective reality. There is no objective way to get around work flow, good/bad angles, working on long term strategy, etc."}, {"title": "Analyst - Intelligence", "text": "Pros Company: - Fantastic company, great culture, inspirational senior management with a vision you can buy into Role: - extremely interesting and constantly engaging - lots of responsibility from an early stage - good bonus Cons None that I can think Advice to Management Keep doing what you're doing!", "rating": 5, "pros": "Company:", "cons": "None that I can think", "advice": "Keep doing what you're doing!"}, {"title": "so-so", "text": "Pros - unique exposure to a broad variety of industries and sectors that one would otherwise never come in contact with or learn about. This is often an untapped resource as many focus only on the next project/call/client and miss the bigger picture of the research while trying to hit monthly targets - early access to senior level clients and C-level experts to build your own professional network and develop a lot of soft skills from client/customer communication, negotiation, team work, multitasking to leadership, coaching and presentation skills at later stages towards Senior Associate stages and beyond. This your own hands and you will be given all the resources to meet clients and arrange events IF you ask and present your case sensibly - quick progression in research if both performance and soft skills align making it possible for some to reach a managerial/supervisory role within 2-3 years - very friendly and open culture where employees across different levels and divisions get along and work closely together to build a great atmosphere - management (both senior and mid-level) stays approachable and are easily accessible with a lot of positive drive from the founders and C-level Cons - work/life balance is often very poor and varies massively depending on the type of client, their deadline and most importantly competitiveness of the project as constant responsiveness and speed are key in beating competitors and as well as earning a bigger bonus. This mostly leads to additional work outside of official work hours, occasionally including weekends and is encouraged and often needed to hit targets. At higher levels it is expected to work heavily on providing constant training and development sessions on top of day-to-day responsibilities, which leads to more additional and often redundant work - compensation is well below average for the industry and sector, especially considering that mostly bi/trilingual graduates from top tier universities are hired. This is one of the reasons for the turnover of staff over time (especially in the first 6-12 months) - leadership and standards/processes vary wildly across different divisions and teams which often leaves above-average employees having to make up the difference in work and performance for underachievers that receive preferential treatment or are simply not trained properly - While a lot of emphasis is placed on giving feedback upward , not a lot of this feedback is ever put into action and rather discussed ad nauseam behind closed doors Advice to Management - increase compensation and revise incentive schemes to retain the right people - get rid of disruptive and toxic influences - improve hiring process to screen for the right kind of people that thrive in a high-pressure environment with targets instead of trying to make do with below-average candidates -consider hiring mid-management/team leaders externally as a lot of internal promotions lack experience and managerial skill to lead, develop and retain a team - rethink job roles to give analysts more responsibility from the start of their progression", "rating": 3, "pros": "- unique exposure to a broad variety of industries and sectors that one would otherwise never come in contact with or learn about. This is often an untapped resource as many focus only on the next project/call/client and miss the bigger picture of the research while trying to hit monthly targets", "cons": "- work/life balance is often very poor and varies massively depending on the type of client, their deadline and most importantly competitiveness of the project as constant responsiveness and speed are key in beating competitors and as well as earning a bigger bonus. This mostly leads to additional work outside of official work hours, occasionally including weekends and is encouraged and often needed to hit targets. At higher levels it is expected to work heavily on providing constant training and development sessions on top of day-to-day responsibilities, which leads to more additional and often redundant work", "advice": "- increase compensation and revise incentive schemes to retain the right people"}, {"title": "Research Analyst", "text": "Pros Good working environment. Management team is young and energetic. Cons Jobs can be repetitive overtime.", "rating": 5, "pros": "Good working environment. Management team is young and energetic.", "cons": "Jobs can be repetitive overtime.", "advice": null}, {"title": "Stressful cold-calling hell", "text": "Pros -The people are all like-minded graduates, very fun to hang out and have a drink with (which you will find you need to, often...) -Job progression is very quick if you play your cards right -Salary is pretty good, and if you hit your targets you get huge bonuses -Lots of free food and booze (which will make you fat but it helps distract you from how awful the job is for a while) Cons -Work is repetitive and stressful -Management move people about with no care as to how it will impact their working life -Awful work-life balance: Employees are encouraged by the target system to set up projects and answer client calls WAY outside of office hours, e.g. At 11pm, or on a Sunday. -The competition with other businesses is intense, often you lose out on 'points' which will get you to your target just because someone else is cheaper or has more resources -If you don't hit target, which is mostly down to luck and how willing you are to work 12 hour days, you will get put back on probation with unhelpful improvement targets like \"Hit target\", or \"Be more strategic\" -Often people get sick because the job is so stressful -The turnover rate of employees is very high, sometimes it's over one person per week -Middle management turnover is very high and this leads to young and inexperienced people leading teams of employees -While the career progression is fast, it doesn't really train you for any other roles, it just gives you \"transferable skills\" (most of which you have to embellish heavily to convince another employer you didn't just waste the past year of your life in a job that nobody really understands) -There is WAY too much feedback, most of which is unhelpful and leaves you dreading every single meeting with your manager -People are brought to tears every single week in that office Advice to Management -Hire some people over the age of 30 to manage your staff, the research floor is like the blind leading the blind. -Instead of plying staff with free drinks and parties, how about listening to their issues and genuinely trying to improve work/life balance? -Take a look at your costing, you're getting outpriced by GLG and Alphasights.", "rating": 1, "pros": "-The people are all like-minded graduates, very fun to hang out and have a drink with (which you will find you need to, often...)", "cons": "-Work is repetitive and stressful", "advice": "-Hire some people over the age of 30 to manage your staff, the research floor is like the blind leading the blind."}, {"title": "Research Interviewer", "text": "Pros Get exposed to many different industries, colleagues are nice and nice working environment Cons It is a slow learning process, not for people who seeks for growth Advice to Management Management team is young and energetic.", "rating": 3, "pros": "Get exposed to many different industries, colleagues are nice and nice working environment", "cons": "It is a slow learning process, not for people who seeks for growth", "advice": "Management team is young and energetic."}, {"title": "The irony of the job description....", "text": "Pros The people you work with Exposure to interesting clients and experts early on Cons 'First job out of college not what you thought it would be? Boring? No real responsibility? Just a cog in a wheel? If you are ready to leave dull and join something special.... ' then don't be highly mislead into joining a company which certainly doesn't do what it says on the tin.", "rating": 1, "pros": "The people you work with", "cons": "'First job out of college not what you thought it would be? Boring? No real responsibility? Just a cog in a wheel? If you are ready to leave dull and join something special.... ' then don't be highly mislead into joining a company which certainly doesn't do what it says on the tin.", "advice": null}, {"title": "Research Analyst", "text": "Pros Highly ambitious environment, friendly workforce, amazing culture, very helpful when you have trouble and generally a fun, engaging and ambitious place to be in. Culture is very team focused! Cons Highly demanding at times. When you tend to have 5-6 projects and it gets stressful, you may have to put in extra hours. Wish the salary was higher.", "rating": 5, "pros": "Highly ambitious environment, friendly workforce, amazing culture, very helpful when you have trouble and generally a fun, engaging and ambitious place to be in. Culture is very team focused!", "cons": "Highly demanding at times. When you tend to have 5-6 projects and it gets stressful, you may have to put in extra hours. Wish the salary was higher.", "advice": null}, {"title": "Come for self-development, stay for the bonuses", "text": "Pros - Clear and transparent bonus, incentive and promotion system - Emphasis on constructive feedback and personal self-development opportunities - Gain exposure to many different industries, get first-hand chances to speak to industry experts - Great colleagues, many different backgrounds, all well educated - Despite taking months to advance, never threatened with being fired. Manager looks at progression and willingness to improve. Cons - Luck plays a large part in the job - Some experts might treat you as a glorified call center employee - Hard to find purpose in research for financial services. A well-done job can be good for the company's bottom line (and your bonus) but have achieved nothing purposeful for society. Advice to Management Doing a great job in keeping the company culture alive despite tremendous growth.", "rating": 5, "pros": "- Clear and transparent bonus, incentive and promotion system", "cons": "- Luck plays a large part in the job", "advice": "Doing a great job in keeping the company culture alive despite tremendous growth."}, {"title": "Not for everyone", "text": "Pros - Good opportunity to develop soft skills: written communication, phone skills, client / customer facing experience, research experience, as well as some managerial skills (once promoted to Associate / Senior Associate). Do not expect hard skills from this role (exception if you do extra-curricular studies / courses Third Bridge can sponsor). - Easy to sell your experience to a range of future employers due to hybrid research / client-facing role. - Great colleagues and social atmosphere; I cannot emphasise this enough - Decent first job if you aren't sure what you want to get into (given the Research Analyst progression has a \"soft cap\" around the 1.5 / 2 year mark). It can be especially good if you end up in the right team, but beware the caveats below. - Ambitious and dedicated Senior Management team (C-levels); the co-founders are still highly involved and have an obvious passion for what they do, and they remain approachable to all members of staff. Cons - Poor compensation: compared to its main competitors, and even worse when compared to financial services in general (this is offset by the bonus scheme, but as others have mentioned this can largely be down to luck on a particular month, or which division / team you end up in). - Mediocre work / life balance: you will be working on projects for time-sensitive clients that work long hours, and the company more or less explicitly expects you to do the same. Core hours are 9-6 but most will come in at least 30 mins early and leave at least 30 mins late if not later if a project comes in end of day. You will be expected to stay as long as it takes. - Stressful: you will constantly be under pressure to meet monthly revenue targets. If you don't meet them for 3-4 months in a row (regardless of reason), your job is likely at risk. - Inexperienced middle-management: most managers up to Team Leader or even VP level have had Third Bridge as a first job and have simply worked their way up. As a result, most will be very inexperienced managers, which can cause all sorts of problems from a lack of professionalism, to an inability to motivate team members, to excessive micro-management and discrepancies in the treatment of team members. - Inconsistent treatment of employees: some will be fast-tracked to promotion, while others get managed out (put on performance improvement plans that they are unlikely to pass, since criteria are set and evaluated by one person - their line manager). There are examples of people not hitting targets but being promoted anyway, while others get threatened with being fired for similar results. - Heterogeneous experience for the same role: your experience at the company is highly dependent on which division / team you end up in. Some enjoy better pay due to a more favourable bonus-earning situation (smaller teams with larger income potential), better working hours (due to differences in client base), and thus more relaxed managers and better job security. - Dubious HR practices: more than a few people leaving the company have had their last months' salary withheld because there was no explicit arrangement to guarantee it (even though it's in the contract). Advice to Management Consider hiring management level staff from outside the company - this will increase managerial credibility and bring in new ideas. Improve compensation: either revise the monthly target system, or increase base salary. Revise HR practices: make exit procedure and expectations clear rather than having someone find out end of month that they haven't received their pay after quitting. HR should also be more than just an admin function - they currently have no support to offer someone worried about their job security or not getting along with their team / manager.", "rating": 3, "pros": "- Good opportunity to develop soft skills: written communication, phone skills, client / customer facing experience, research experience, as well as some managerial skills (once promoted to Associate / Senior Associate). Do not expect hard skills from this role (exception if you do extra-curricular studies / courses Third Bridge can sponsor).", "cons": "- Poor compensation: compared to its main competitors, and even worse when compared to financial services in general (this is offset by the bonus scheme, but as others have mentioned this can largely be down to luck on a particular month, or which division / team you end up in).", "advice": "Consider hiring management level staff from outside the company - this will increase managerial credibility and bring in new ideas."}, {"title": "Great company", "text": "Pros People are really friendly in all offices Management team are really approachable Lots of emphasis on learning Chances to travel and work in the other offices Growing company which means there are lots of opportunities Cons Needs to be a better work/life balance Advice to Management Continue to listen to the younger members of the team", "rating": 5, "pros": "People are really friendly in all offices", "cons": "Needs to be a better work/life balance", "advice": "Continue to listen to the younger members of the team"}, {"title": "Decent first job, but leave at the earliest", "text": "Pros The work environment is positive and the company has a good vibe to it. The job is very easy to do and even a fool should be able to sail through it. Cons The actual job is incredibly stupid and a real waste of your time. The website doesn't explain the job clear enough but this is essentially a call centre job. Third Bridge arranges phone conversations between people who need information (like say an investment fund) and people who have that information (say an executive at a rival company that the fund is looking to buy). Your job as the research associate is to facilitate the phone call. That's it. So you find relevant people on Linkedin, try getting a phone number, then get them to agree and then set up the call. That's all there is. You do not participate in on the call and you learn nothing on finance/strategy or anything of that sort. All you learn is cold calling and some call centre skills. I didn't know all of this when I joined (which explains why I left early) but anyone with even a bit of self respect / career ambitions should stay clear of this call centre company. Advice to Management I really have none for the company does well where it can - creating a positive and friendly atmosphere. But while many people say they should improve the quality of work for its research associates, I don't think they can. A call centre is a call centre and at the end of the day, they need people to pick up the phone and start making calls and nothing can change that.", "rating": 3, "pros": "The work environment is positive and the company has a good vibe to it. The job is very easy to do and even a fool should be able to sail through it.", "cons": "The actual job is incredibly stupid and a real waste of your time. The website doesn't explain the job clear enough but this is essentially a call centre job. Third Bridge arranges phone conversations between people who need information (like say an investment fund) and people who have that information (say an executive at a rival company that the fund is looking to buy). Your job as the research associate is to facilitate the phone call. That's it. So you find relevant people on Linkedin, try getting a phone number, then get them to agree and then set up the call. That's all there is. You do not participate in on the call and you learn nothing on finance/strategy or anything of that sort. All you learn is cold calling and some call centre skills.", "advice": "I really have none for the company does well where it can - creating a positive and friendly atmosphere. But while many people say they should improve the quality of work for its research associates, I don't think they can. A call centre is a call centre and at the end of the day, they need people to pick up the phone and start making calls and nothing can change that."}, {"title": "Research Analyst", "text": "Pros This organisation is youthful, the people are pleasant, the location is good. The soft skills you learn are pretty invaluable. Cons Lacks real hard skills. Poor management. Poor progression scale. Poor wages. Advice to Management Be closer to your team, listen to their issues. There is no one right way.", "rating": 3, "pros": "This organisation is youthful, the people are pleasant, the location is good. The soft skills you learn are pretty invaluable.", "cons": "Lacks real hard skills. Poor management. Poor progression scale. Poor wages.", "advice": "Be closer to your team, listen to their issues. There is no one right way."}, {"title": "Research Analyst", "text": "Pros Friendly and young co-workers, very international Cons The everyday tasks are very uninteresting. It is basically a fancy call centre. Bonus can be unfair", "rating": 1, "pros": "Friendly and young co-workers, very international", "cons": "The everyday tasks are very uninteresting. It is basically a fancy call centre.", "advice": null}, {"title": "Horrid company", "text": "Pros There are no pros! The only pro to come away with is your a much better person than anyone working there Cons • Very poor management • Some may have the right attributes on paper, however social skills such as \"manners\" there is none • all of the extras they advertise you will get - rubbish • Unless you are in high places you won't get recognised • Full of people with issues • \"Some\" members of the HR team are very unprofessional, little tip for those when working in human resources, you need to approachable, helpful, understanding and the middle man, all of which are non of the above, apart from one! Advice to Management Get some sort of form of management, it does help within a company.", "rating": 1, "pros": "There are no pros! The only pro to come away with is your a much better person than anyone working there", "cons": "• Very poor management", "advice": "Get some sort of form of management, it does help within a company."}, {"title": "Research Analyst", "text": "Pros Potential to make a lot of money if you are money motivated. Great young and intelligent people. Great perks Cons Not much career progression High pressure at times Basic pay isnt great Advice to Management Change the consulting vertical completely", "rating": 3, "pros": "Potential to make a lot of money if you are money motivated.", "cons": "Not much career progression", "advice": "Change the consulting vertical completely"}, {"title": "Research Associate", "text": "Pros I am very happy with the company Cons There is nothing I would change about it Advice to Management I have no advice to provide to the management", "rating": 5, "pros": "I am very happy with the company", "cons": "There is nothing I would change about it", "advice": "I have no advice to provide to the management"}, {"title": "Great company", "text": "Pros - Great people, fab culture - Lots of opportunities for early responsibility - Interesting work, interesting clients - Lots of variety in projects Cons - Work becomes a little repetitive after a while", "rating": 5, "pros": "- Great people, fab culture", "cons": "- Work becomes a little repetitive after a while", "advice": null}, {"title": "Good working conditions but a bit monotonous", "text": "Pros The management are great and very accommodating to working with your other scheduled commitments. The office is very sunny and well-appointed. A nice office to spend time in actually. The work is not difficult and sometimes very rewarding, despite being a bit repetitive. I think there are a lot of opportunities to move up in the company, as well, but I wasn't there long enough to take advantage of them. Cons The work you'll do as a telephone researcher is very repetitive. If you have the gift of the gab and like to talk on the phone for 4 hours at a time, it's a very easy and rewarding way to pay the bills. If you prefer to be a bit more active and move around at work, as I do, you may find it a challenge. Advice to Management Provide more training from day one. I was basically given a quick overview of how to interview contacts and a tutorial on how to use the software, then left to my own devices. It certainly got better over time but it was a maddening first week. Also, find more ways to break up the shift activities. 4-5 hours of continuous calling is a bit much.", "rating": 3, "pros": "The management are great and very accommodating to working with your other scheduled commitments. The office is very sunny and well-appointed. A nice office to spend time in actually. The work is not difficult and sometimes very rewarding, despite being a bit repetitive. I think there are a lot of opportunities to move up in the company, as well, but I wasn't there long enough to take advantage of them.", "cons": "The work you'll do as a telephone researcher is very repetitive. If you have the gift of the gab and like to talk on the phone for 4 hours at a time, it's a very easy and rewarding way to pay the bills. If you prefer to be a bit more active and move around at work, as I do, you may find it a challenge.", "advice": "Provide more training from day one. I was basically given a quick overview of how to interview contacts and a tutorial on how to use the software, then left to my own devices. It certainly got better over time but it was a maddening first week. Also, find more ways to break up the shift activities. 4-5 hours of continuous calling is a bit much."}, {"title": "Mind boggling", "text": "Pros Very bright people, some nice ones too. Free beers on a Friday afternoon and enjoyable monthly socials. Cons It simply does not live up to expectations. You don't learn about the financial industry because the financial establishments that hire you (that do not 'partner' with you, be honest please) only tell you the bare minimum about the projects or products they're looking into. As a research analyst, your job will be to conduct very fast paced Contract Recruitment. That really is all. I think it's unfair that prospective employees are told otherwise. Advice to Management Think about why your staff turnover (of entry level employees) is so very high, compared to any other company. Try to live up to the game of buzzword bingo you play throughout your recruitment process. Saying the words \"investment\", \"secret\" and \"international\" as well as promising an insight into the fields of finance is, frankly, just a lot of empty noise. Please stop promising that Research Analyst and Recruitment Consultant are anything but synonymous. In addition, some of your mid-high management (VPs and even some Team Leaders) seem to have a culture of secrecy and gossip that comes across as unnecessary, mean and thoroughly unhelpful. You're an agency, not a trading firm. You need to come back down to earth.", "rating": 3, "pros": "Very bright people, some nice ones too.", "cons": "It simply does not live up to expectations.", "advice": "Think about why your staff turnover (of entry level employees) is so very high, compared to any other company. Try to live up to the game of buzzword bingo you play throughout your recruitment process. Saying the words \"investment\", \"secret\" and \"international\" as well as promising an insight into the fields of finance is, frankly, just a lot of empty noise. Please stop promising that Research Analyst and Recruitment Consultant are anything but synonymous."}, {"title": "Overall it's not too bad, but keep calling all the time.", "text": "Pros The wage is not too bad. They offer a various of training which can make you learn something from them. Your coworkers are from everywhere, Germany, USA, India, UK, China, Japan.... very international. The company has a good reputation which makes it great for graduates to consider having this as their first jobs. Cons You have make some contributions to the company, you must have a few completed calling every day and make sure you don't spend too much time on translation, otherwise they might think you don't have a good productive at your work and may consider not to hire you anymore. Cold calling everyday, and you can't really have a break between two long callings because they will think you don't maximum your time on calling which is not true. Briefing doesn't get paid which is unfair. Advice to Management Please pay briefing time to employees as this is part of their jobs. Be more patient to your employees if they can't make great reports at the very beginning. Be more flexible for employees who want to take a leave , because everyone knows that this is just a temporary job.", "rating": 5, "pros": "The wage is not too bad. They offer a various of training which can make you learn something from them. Your coworkers are from everywhere, Germany, USA, India, UK, China, Japan.... very international. The company has a good reputation which makes it great for graduates to consider having this as their first jobs.", "cons": "You have make some contributions to the company, you must have a few completed calling every day and make sure you don't spend too much time on translation, otherwise they might think you don't have a good productive at your work and may consider not to hire you anymore. Cold calling everyday, and you can't really have a break between two long callings because they will think you don't maximum your time on calling which is not true. Briefing doesn't get paid which is unfair.", "advice": "Please pay briefing time to employees as this is part of their jobs. Be more patient to your employees if they can't make great reports at the very beginning. Be more flexible for employees who want to take a leave , because everyone knows that this is just a temporary job."}, {"title": "Great first job", "text": "Pros - Interesting projects each day - Work with top global PE firms, Hedgefunds, Consulting firms - Own your accounts and take clients out monthly - Financially incentivised each month - Fast promotion rate - Very sociable office - Opportunity to do qualifications (IMC/CFA) alongside work - AMAZING CEO Cons - Work/Life balance - Monthly targets can sometimes be out of your control - Need to hire externally for new management Advice to Management Perhaps consider hiring external people rather than internal promotions, for most employees this is their first job and alternative industry exposure will help freshen things up and iron out problems.", "rating": 5, "pros": "- Interesting projects each day", "cons": "- Work/Life balance", "advice": "Perhaps consider hiring external people rather than internal promotions, for most employees this is their first job and alternative industry exposure will help freshen things up and iron out problems."}, {"title": "RA Review", "text": "Pros You will have chances to learn knowledge of every single industries. Good for college graduates to learn industrial knowledge. The job is not that hard and there are rarely any technical skills needed. Cons You don't have many chances to dig into the core part of consulting or PE industry. Expert network industry is a pretty young industry. Advice to Management Higher level people in the company don't look like your boss. Maybe some elites should be recruited into the company and in charge.", "rating": 3, "pros": "You will have chances to learn knowledge of every single industries. Good for college graduates to learn industrial knowledge. The job is not that hard and there are rarely any technical skills needed.", "cons": "You don't have many chances to dig into the core part of consulting or PE industry. Expert network industry is a pretty young industry.", "advice": "Higher level people in the company don't look like your boss. Maybe some elites should be recruited into the company and in charge."}, {"title": "Pro for pros", "text": "Pros That went well all along, 2 phone call job done they knwo what are they doing and how to do it well Cons So far so good....keep going that way", "rating": 5, "pros": "That went well all along, 2 phone call job done they knwo what are they doing and how to do it well", "cons": "So far so good....keep going that way", "advice": null}, {"title": "Avoid", "text": "Pros -Diverse workforce, there are some very smart and interesting people -Opportunities to learn and get involved as the company is still growing -IT infrastructure up to date, new IT equipment for all new starters Cons -No career progression. Let's be realistic, departments are small, they might change your title at some point but you will do the same. -Low salary, long hours, don't expect too many benefits. Study support amount is granted depending on who's applying and there is no such thing as maternity leave. -Overspent on the research team (the other departments basically seem to be irrelevant). It was tedious to listen about the research team's achievements over and over again while the other departments get no acknowledgement at all. -Inefficient processes and systems that don't work -If you are on the research team and looking to have young colleagues -great, but if not - you will be stuck dealing with young spoiled researchers who will keep making the same mistakes until you want to shoot yourself. Advice to Management Take a break from glorifying the research team and pay attention to the other departments maybe, they do exist. While some favoured researchers sip cocktails in exotic locations, other employees get 2-3 lunches on the company. Also, spend more time training researchers as the whole company is stuck fixing their errors. And why aim at top universities for a cold calling job? Those ambitious people easily get bored with the tedious job and leave.", "rating": 1, "pros": "-Diverse workforce, there are some very smart and interesting people", "cons": "-No career progression. Let's be realistic, departments are small, they might change your title at some point but you will do the same.", "advice": "Take a break from glorifying the research team and pay attention to the other departments maybe, they do exist. While some favoured researchers sip cocktails in exotic locations, other employees get 2-3 lunches on the company. Also, spend more time training researchers as the whole company is stuck fixing their errors. And why aim at top universities for a cold calling job? Those ambitious people easily get bored with the tedious job and leave."}, {"title": "Anonymous Employee", "text": "Pros Interesting people. Everyone is really friendly and the management team are engaged and approachable. Cons Huge staff turnover. Constant work pressure.", "rating": 5, "pros": "Interesting people. Everyone is really friendly and the management team are engaged and approachable.", "cons": "Huge staff turnover. Constant work pressure.", "advice": null}, {"title": "50% Turnover - Graduates Beware", "text": "Pros The other graduates you start with are genuinely amazing. The work social life is active and the perks are good (trips abroad, free drinks etc.). The job looks good on paper, making you relatively employable when looking for other jobs Cons No matter the amount of fun people around and perks, this job is mindlessly boring. For the first 3 months you will simply be copy pasting linkedin profile information into the internal system, as well as cold calling. After you start project managing your will continue with the profile copying and cold calling, but also answer emails and call your clients. All in all your job is endless admin, with little to no thinking or analysis behind it. You have no job security. New graduates frequently get fired in their first few months. Senior employees can easily be put back on probation due to matters which are beyond their control. The target system is completely commission based and favours certain parts of the business (funds and private equity) and does not take external factors, such as seasonality, properly in to account. The stress due to the targets monthly makes numerous employees ill and is very counter-productive. Management has shown no willingness to amend it. Currently, there is a trend of barely 50% of each intake lasting for more than 1 year. If you do intend to start working here, I greatly recommend to continue searching for other jobs.", "rating": 3, "pros": "The other graduates you start with are genuinely amazing. The work social life is active and the perks are good (trips abroad, free drinks etc.).", "cons": "No matter the amount of fun people around and perks, this job is mindlessly boring. For the first 3 months you will simply be copy pasting linkedin profile information into the internal system, as well as cold calling. After you start project managing your will continue with the profile copying and cold calling, but also answer emails and call your clients. All in all your job is endless admin, with little to no thinking or analysis behind it.", "advice": null}, {"title": "Research Asociate", "text": "Pros Small team, access to key stakeholders in the company. Lots of responsibility Cons Start up, still finding its feet, needs to be established . Work very repetitive.", "rating": 3, "pros": "Small team, access to key stakeholders in the company. Lots of responsibility", "cons": "Start up, still finding its feet, needs to be established . Work very repetitive.", "advice": null}, {"title": "Has (quite extreme) ups and downs", "text": "Pros Great team, friendly people, good social side, fantastic office, enjoyable when going well Cons Very high pressure, often quite stressful, and some teams tend to work longer hours than others (depends on client base). The highly prized company culture is at risk through rapid company growth. Advice to Management Stop being so quick to put people back on probation. It's running the risk of pushing away a lot of very bright, talented individuals. The high pressure environment is becoming counter productive.", "rating": 3, "pros": "Great team, friendly people, good social side, fantastic office, enjoyable when going well", "cons": "Very high pressure, often quite stressful, and some teams tend to work longer hours than others (depends on client base). The highly prized company culture is at risk through rapid company growth.", "advice": "Stop being so quick to put people back on probation. It's running the risk of pushing away a lot of very bright, talented individuals. The high pressure environment is becoming counter productive."}, {"title": "AVOID", "text": "Pros They pretend to care about you Cons You are treated as disposable. 2 months of not hitting the target you are out. 10+ hours of daily work. No career opportunities. Do not trust management. Advice to Management Change your culture and take duty of care for your employees. Without them you are nothing!", "rating": 1, "pros": "They pretend to care about you", "cons": "You are treated as disposable. 2 months of not hitting the target you are out. 10+ hours of daily work. No career opportunities. Do not trust management.", "advice": "Change your culture and take duty of care for your employees. Without them you are nothing!"}, {"title": "The framework is there but certain changes are needed to kick on", "text": "Pros Genuinely fantastic people. There was not one person in that office that I wouldn't have been happy to go for a drink with. The company does an excellent job in hiring personable, intelligent and interesting people. When you are busy the time will fly by because you have so much do. In my personal experience, my managers cared about my development and what I wanted from the role. They spent time to understand what they could do to make my time at the company better. Great C-Level team and Directors (In London, I can't speak for NY). They all have very interesting backgrounds, they are accessible, they share their experiences and they get involved in social events. You learn a little about a lot. You won't become a subject matter expert but you will develop an understanding of companies and industries you had no idea existed. A lot of people are moaning about the job - It is what it is. If you had researched the role prior to joining you'd know what will be required of you on a day to day basis. However, the company does need to be more transparent and explicitly outline what the role will involve. Cons The work can be very repetitive. Once you are project managing it gets very hard to develop new skills, you hit the ceiling very fast unless you want to be a Team Leader. Targets: The target system needs to be amended. It is not considerate of workflow, or cyclicality on an individual or team basis. This in turn has people stressing about job security, and it goes a long way in undermining what is a good atmosphere and culture. Advice to Management Restructure the target system - it was a continual source of angst, frustration and stress. It will result in disaffection amongst the intelligent people you have spent a lot of time and money recruiting.", "rating": 3, "pros": "Genuinely fantastic people. There was not one person in that office that I wouldn't have been happy to go for a drink with. The company does an excellent job in hiring personable, intelligent and interesting people.", "cons": "The work can be very repetitive. Once you are project managing it gets very hard to develop new skills, you hit the ceiling very fast unless you want to be a Team Leader.", "advice": "Restructure the target system - it was a continual source of angst, frustration and stress. It will result in disaffection amongst the intelligent people you have spent a lot of time and money recruiting."}, {"title": "Research Analyst", "text": "Pros Amazing co-workers. Good exposure to clients if you're lucky enough to make it that far. Aim at roles in Hedge Funds or PE though. Client exposure in consulting is limited. Cons Huge staff turnover. No clear directions on what makes you stay or go. If your boss dislikes you, you are done. Role is boring. Does not let you use your own mind like advertised, you are basically a recruiter who does a lot of copy pasting on Linked In. If you're stubborn and can stick it out it can be a great stepping stone, but be careful. Most people there look for other jobs while there, this is their Business Model, so you should too. Advice to Management You have loads of great, smart people who are willing to work hard for you and help you if you just let them. By improving work security and by empowering your employees, you will gain better results. And why not be more flexible with where people are placed? If someone fits another team better, move them, don't fire them. Save some training money. Finally, stop hiring people based on projected growth rather than project inflow. All your employees are getting miserable because no one has enough work, yet will be fired for not reaching target. It's the most unsustainable business model I have ever seen.", "rating": 3, "pros": "Amazing co-workers. Good exposure to clients if you're lucky enough to make it that far. Aim at roles in Hedge Funds or PE though. Client exposure in consulting is limited.", "cons": "Huge staff turnover. No clear directions on what makes you stay or go. If your boss dislikes you, you are done. Role is boring. Does not let you use your own mind like advertised, you are basically a recruiter who does a lot of copy pasting on Linked In. If you're stubborn and can stick it out it can be a great stepping stone, but be careful. Most people there look for other jobs while there, this is their Business Model, so you should too.", "advice": "You have loads of great, smart people who are willing to work hard for you and help you if you just let them. By improving work security and by empowering your employees, you will gain better results. And why not be more flexible with where people are placed? If someone fits another team better, move them, don't fire them. Save some training money. Finally, stop hiring people based on projected growth rather than project inflow. All your employees are getting miserable because no one has enough work, yet will be fired for not reaching target. It's the most unsustainable business model I have ever seen."}, {"title": "Great environment, great people", "text": "Pros - The people (international/interesting) - Good perks (private healthcare, regular socials, away days, etc) - Willing to invest in your development (easy to get advice from management, can get funding for external courses) Cons - Some people don't really recognise everything that's on offer here, and have a sense of entitlement about it. I think the company puts quite a lot of effort in, even with smaller touches like providing fruit for everyone. It's a shame when people take it for granted. - Things can be a bit bureaucratic now. There are new processes being rolled out all the time, or there's a new platform to use. It's hard to keep track of them all, and it can make things feel a bit impersonal/robotic. Advice to Management Don't let the company's high growth make the roles dry.", "rating": 5, "pros": "- The people (international/interesting)", "cons": "- Some people don't really recognise everything that's on offer here, and have a sense of entitlement about it. I think the company puts quite a lot of effort in, even with smaller touches like providing fruit for everyone. It's a shame when people take it for granted.", "advice": "Don't let the company's high growth make the roles dry."}, {"title": "Awful company", "text": "Pros Benefits. Bonuses. Nights out. Fast promotions. I would recommend if you've done a pointless degree and need anything as a first job. It's a good platform. Cons Long hours. Cold calling. Was mid-sold the role. HR dress it up as if you're getting this massive exposure. You're sat behind your desk cold calling people. Soul destroying job. Advice to Management Stop lying to employees", "rating": 1, "pros": "Benefits. Bonuses. Nights out. Fast promotions. I would recommend if you've done a pointless degree and need anything as a first job. It's a good platform.", "cons": "Long hours. Cold calling. Was mid-sold the role. HR dress it up as if you're getting this massive exposure. You're sat behind your desk cold calling people. Soul destroying job.", "advice": "Stop lying to employees"}, {"title": "Great company", "text": "Pros The people are great, everyone is really friendly and the management team are engaged and very approachable, not sure where else the CEO would hot desk to sit with different teams. They have big plans and because it is still growing quickly, you can get involved and learn about things that are not part of your role; lots of learning opps if you take advantage. Nice perks like daily fruit delivery, yoga classes, drinks in the office on Fridays. Cons You definitely have to be a certain kind of person - the constant change wouldn't suit everyone. To do well (and enjoy it) you have to learn quickly and work hard, and not be afraid of things coming out of left field. Advice to Management Keep doing what you're doing, especially keep working to maintain the culture as the company gets bigger.", "rating": 5, "pros": "The people are great, everyone is really friendly and the management team are engaged and very approachable, not sure where else the CEO would hot desk to sit with different teams. They have big plans and because it is still growing quickly, you can get involved and learn about things that are not part of your role; lots of learning opps if you take advantage. Nice perks like daily fruit delivery, yoga classes, drinks in the office on Fridays.", "cons": "You definitely have to be a certain kind of person - the constant change wouldn't suit everyone. To do well (and enjoy it) you have to learn quickly and work hard, and not be afraid of things coming out of left field.", "advice": "Keep doing what you're doing, especially keep working to maintain the culture as the company gets bigger."}, {"title": "Good Experience", "text": "Pros Very Collegial atmonstphere worth a shot if you are an undergrad Cons Could be better if given a better company culture", "rating": 3, "pros": "Very Collegial atmonstphere worth a shot if you are an undergrad", "cons": "Could be better if given a better company culture", "advice": null}, {"title": "Telephone Researcher", "text": "Pros Great pay and flexible working time with additional free training provided on site. More importantly, you can gain hands on experience within different projects you are given and you can always learn more when you work alongside with senior project manager. Cons Poor working conditions for part time job, the handset and computers we used are quite old and slow. The location is not good either. The third bridge is located on the 6th floor of a commercial building which mixed up with different other companies. Advice to Management Improvement for a better working environment, even for these part time jobbers. Make all employees unite as a whole and prepare more for employees' career progression.", "rating": 5, "pros": "Great pay and flexible working time with additional free training provided on site. More importantly, you can gain hands on experience within different projects you are given and you can always learn more when you work alongside with senior project manager.", "cons": "Poor working conditions for part time job, the handset and computers we used are quite old and slow. The location is not good either. The third bridge is located on the 6th floor of a commercial building which mixed up with different other companies.", "advice": "Improvement for a better working environment, even for these part time jobbers. Make all employees unite as a whole and prepare more for employees' career progression."}, {"title": "good", "text": "Pros you make cold calls and you will experience different industries so it is good to practice you communication skills Cons you do the same thing all the time so you will feel bored after 2 weeks and the job is not so challenging so you didint get improved a lot", "rating": 5, "pros": "you make cold calls and you will experience different industries so it is good to practice you communication skills", "cons": "you do the same thing all the time so you will feel bored after 2 weeks and the job is not so challenging so you didint get improved a lot", "advice": null}, {"title": "Research Analyst", "text": "Pros The company was extremely unethical to make misunderstanding between research jobs and cold callings. The position name should be changed Cons The company should be more transparent and act more professional instead of changing name Cognolink to Third Bridge as it does not make what you do become more clear or not. Just call yourself a calling center. Advice to Management Stop acting horrible in Hong Kong", "rating": 1, "pros": "The company was extremely unethical to make misunderstanding between research jobs and cold callings. The position name should be changed", "cons": "The company should be more transparent and act more professional instead of changing name Cognolink to Third Bridge as it does not make what you do become more clear or not. Just call yourself a calling center.", "advice": "Stop acting horrible in Hong Kong"}, {"title": "Research Analyst", "text": "Pros The company was extremely unethical to make misunderstanding between research jobs and cold callings. The position name should be changed Cons The company should be more transparent and act more professional instead of changing name Cognolink to Third Bridge as it does not make what you do become more clear or not. Just call yourself a calling center. Advice to Management Stop acting horrible in Hong Kong", "rating": 1, "pros": "The company was extremely unethical to make misunderstanding between research jobs and cold callings. The position name should be changed", "cons": "The company should be more transparent and act more professional instead of changing name Cognolink to Third Bridge as it does not make what you do become more clear or not. Just call yourself a calling center.", "advice": "Stop acting horrible in Hong Kong"}, {"title": "Part Time Researcher", "text": "Pros Nice people Nice working environment Clear targets Cons Boring repetitive work Cold calling Lack of training Lack of standardisation with data input Advice to Management Make even part time workers feel like part of the team", "rating": 3, "pros": "Nice people", "cons": "Boring repetitive work", "advice": "Make even part time workers feel like part of the team"}, {"title": "Temporary but Well paid", "text": "Pros For a temporary job position, it is paid well. The workload is a little bit challenging but overall acceptable. Cons I don't have much to complain. Only worked there for a short time so everything seems to be fine.", "rating": 5, "pros": "For a temporary job position, it is paid well. The workload is a little bit challenging but overall acceptable.", "cons": "I don't have much to complain.", "advice": null}, {"title": "Super Kultur, Daily Tasks eher langweilig", "text": "Pros Junge, tolle Leute, schnelle Entwicklung möglich, man lernt Einblicke in die verschiedensten Industrien und die Kultur an sich ist auch super - langweilig wird es nicht! Cons Leider ähneln die täglichen Aufgaben eher die eines Callcenters, man muss einfach Leute immer direkt anrufen - man lernt aus sich rauszugehen aber ständig telefonieren zu müssen, darauf hat man auch nicht immer Lust Advice to Management Bessere Bezahlung für diese Aufgaben", "rating": 5, "pros": "Junge, tolle Leute, schnelle Entwicklung möglich, man lernt Einblicke in die verschiedensten Industrien und die Kultur an sich ist auch super - langweilig wird es nicht!", "cons": "Leider ähneln die täglichen Aufgaben eher die eines Callcenters, man muss einfach Leute immer direkt anrufen - man lernt aus sich rauszugehen aber ständig telefonieren zu müssen, darauf hat man auch nicht immer Lust", "advice": "Bessere Bezahlung für diese Aufgaben"}]