[{"title": "Great people, minimal opportunity", "text": "Pros Great team, manager operated in employees best interest. Cons Lack of opportunity to advance", "rating": 3, "pros": "Great team, manager operated in employees best interest.", "cons": "Lack of opportunity to advance", "advice": null}, {"title": "Struggling to find growth in a contracting industry", "text": "Pros Co-workers are smart and fun Global network of people and fellow Kantar companies Cons Lots of reorganizations hard on morale, and has left teams very thin. Lack of company growth limits opportunity for advancement, raises, and bonuses. Many internal systems are old and slow.", "rating": 3, "pros": "Co-workers are smart and fun", "cons": "Lots of reorganizations hard on morale, and has left teams very thin. Lack of company growth limits opportunity for advancement, raises, and bonuses. Many internal systems are old and slow.", "advice": null}, {"title": "Ambiguous", "text": "Pros Working teams very congenial and helpful Cons Cumbersome bureaucracy; too many rules and forms Advice to Management Learn about the products and the work in the trenches before you make decisions", "rating": 3, "pros": "Working teams very congenial and helpful", "cons": "Cumbersome bureaucracy; too many rules and forms", "advice": "Learn about the products and the work in the trenches before you make decisions"}, {"title": "Vice President", "text": "Pros Great team of people to work with Cons Smaller vendor firms are a serious competition to business Advice to Management Retain your existing people. They are very good at their job.", "rating": 3, "pros": "Great team of people to work with", "cons": "Smaller vendor firms are a serious competition to business", "advice": "Retain your existing people. They are very good at their job."}, {"title": "This is a dying company", "text": "Pros They provide average corporate benefits. Cons Part of a huge holding company that focuses only on quarterly profits.", "rating": 3, "pros": "They provide average corporate benefits.", "cons": "Part of a huge holding company that focuses only on quarterly profits.", "advice": null}, {"title": "Researchers", "text": "Pros Location, part of a large Company Cons Stability, growth, process issues. Many good people left the company. Advice to Management Manage change and listen to employees. Be more thoughtful about change.", "rating": 3, "pros": "Location, part of a large Company", "cons": "Stability, growth, process issues. Many good people left the company.", "advice": "Manage change and listen to employees. Be more thoughtful about change."}, {"title": "Director Focus Group Facility", "text": "Pros The availability of international presence Cons It's a large company and you get lost Advice to Management Make it matter for each employee", "rating": 5, "pros": "The availability of international presence", "cons": "It's a large company and you get lost", "advice": "Make it matter for each employee"}, {"title": "Great place to work", "text": "Pros Great place to learn, lots of people who are willing to help you. Very supportive environment Cons Pay scale is a bit low. Think it would be good if it was increased slightly to retain good talent", "rating": 5, "pros": "Great place to learn, lots of people who are willing to help you. Very supportive environment", "cons": "Pay scale is a bit low. Think it would be good if it was increased slightly to retain good talent", "advice": null}, {"title": "Simple Things", "text": "Pros Work requirements are straight forward and require little supervision. Cons Working evenings and late nights.", "rating": 5, "pros": "Work requirements are straight forward and require little supervision.", "cons": "Working evenings and late nights.", "advice": null}, {"title": "Project Manager", "text": "Pros This company has flexibility for employees. Cons Company's short-sighted; not enough focus on big-picture.", "rating": 3, "pros": "This company has flexibility for employees.", "cons": "Company's short-sighted; not enough focus on big-picture.", "advice": null}, {"title": "Great Company", "text": "Pros Great benefits. Flexible work schedule; could work from home when necessary. Great teams to work with. Good place to build a foundation. Cons Lots of layoffs. Not as collaborative as I would have liked. Very much a top-down organization. Forms and processes are great, but often resulted in more work to get anything accomplished. Advice to Management Clients want to be introduced to their teams early. Having a corporate sponsor is great, but ultimately the people doing the work and crucial to discussions. Foster more of an environment to train current employees, versus hiring haphazardly to fill a void for the moment.", "rating": 3, "pros": "Great benefits. Flexible work schedule; could work from home when necessary. Great teams to work with. Good place to build a foundation.", "cons": "Lots of layoffs. Not as collaborative as I would have liked. Very much a top-down organization. Forms and processes are great, but often resulted in more work to get anything accomplished.", "advice": "Clients want to be introduced to their teams early. Having a corporate sponsor is great, but ultimately the people doing the work and crucial to discussions. Foster more of an environment to train current employees, versus hiring haphazardly to fill a void for the moment."}, {"title": "(TNS Korea) Great place to learn, but very difficult to balance work and Life", "text": "Pros Great place to learn, you can experience various studies and industry in short amount of time Cons Too much overtimes... without paying for it Advice to Management These days young millennials seek Work/Life balance. Instead of trying to find someone who do not care of it, need to read the trend of this change and develop solution", "rating": 3, "pros": "Great place to learn, you can experience various studies and industry in short amount of time", "cons": "Too much overtimes... without paying for it", "advice": "These days young millennials seek Work/Life balance. Instead of trying to find someone who do not care of it, need to read the trend of this change and develop solution"}, {"title": "Traditional research agency requiring transformation", "text": "Pros Friendly team; can get on interesting and experimental projects if you put yourself out there; big clients; international expertise support. Cons Problems facing traditional market research firms today are ubiquitous here; terrible HR; lack of culture and clear strategic direction. Advice to Management Transformation requires clear strategic vision and the right people.", "rating": 3, "pros": "Friendly team; can get on interesting and experimental projects if you put yourself out there; big clients; international expertise support.", "cons": "Problems facing traditional market research firms today are ubiquitous here; terrible HR; lack of culture and clear strategic direction.", "advice": "Transformation requires clear strategic vision and the right people."}, {"title": "Down the tubes they go....", "text": "Pros Global capabilities are well regarded across industries. Cons Horrendously incompetent leadership at all levels of the firm. Important strategic decisions are made by people with no knowledge of how the business works. Constantly laying off people doesn't fix the company's revenue problems. Advice to Management Get it together folks! Leadership needs to start holding senior management accountable for their ineffectiveness. TNS is really losing its luster and clients recognize it. Start fresh in your HR department and clean house!", "rating": 3, "pros": "Global capabilities are well regarded across industries.", "cons": "Horrendously incompetent leadership at all levels of the firm. Important strategic decisions are made by people with no knowledge of how the business works. Constantly laying off people doesn't fix the company's revenue problems.", "advice": "Get it together folks! Leadership needs to start holding senior management accountable for their ineffectiveness. TNS is really losing its luster and clients recognize it."}, {"title": "TNS review", "text": "Pros good benefits, ability to work independently Cons regular change in direction, management", "rating": 5, "pros": "good benefits, ability to work independently", "cons": "regular change in direction, management", "advice": null}, {"title": "Market Research Analyst", "text": "Pros Great company to work for. Good pay and benefits. Get a job if u can Cons No advancement opportunity. The pay keeps increasing but there are no advancement and skill increase with experience", "rating": 5, "pros": "Great company to work for. Good pay and benefits. Get a job if u can", "cons": "No advancement opportunity. The pay keeps increasing but there are no advancement and skill increase with experience", "advice": null}, {"title": "Good learning opportunities, Bad work hours", "text": "Pros Some of the best customized research in the industry. The clients are all leading consumer goods companies which gives a lot of exposure. You get an opportunity to interact with clients, solve problems and present solutions at a very early stage in your career. Cons The work hours are horrible. Can lead to 'no life'. The work profile is very demanding. Compensation is not at par with the industry.", "rating": 5, "pros": "Some of the best customized research in the industry.", "cons": "The work hours are horrible. Can lead to 'no life'.", "advice": null}, {"title": "TNS india private limited hyderabad", "text": "Pros Good working environment, MNC, Good to start in this company if you are interested in MR area Cons Low Salary, hectic working hours", "rating": 5, "pros": "Good working environment, MNC, Good to start in this company if you are interested in MR area", "cons": "Low Salary, hectic working hours", "advice": null}, {"title": "Traditional Marketing research company", "text": "Pros Working with industries leading companies. Had the learning experience from experienced analysts. Cons Traditional business model. Slow progress rate.", "rating": 3, "pros": "Working with industries leading companies. Had the learning experience from experienced analysts.", "cons": "Traditional business model. Slow progress rate.", "advice": null}, {"title": "Intern", "text": "Pros Friendly Employees, Company efforts to adapt is visible. Current projection in terms of revenue is great. Just keep trying to adapt and change. Cons Huge disconnection between workers. very segmented. Need more unity. Advice to Management More unity.", "rating": 5, "pros": "Friendly Employees, Company efforts to adapt is visible. Current projection in terms of revenue is great. Just keep trying to adapt and change.", "cons": "Huge disconnection between workers. very segmented. Need more unity.", "advice": "More unity."}, {"title": "Review", "text": "Pros Good benefits and vacation time Cons Often worked very hard, evenings an weekends with little chancevofcadvancement. Top heavy organization. Advice to Management See your people as individuals, as people not just resources. Be honest and follow through.", "rating": 3, "pros": "Good benefits and vacation time", "cons": "Often worked very hard, evenings an weekends with little chancevofcadvancement. Top heavy organization.", "advice": "See your people as individuals, as people not just resources. Be honest and follow through."}, {"title": "Collegial", "text": "Pros Collegial atmosphere, compensation, flexible work environment Cons Constant change and uncertainty of position", "rating": 3, "pros": "Collegial atmosphere, compensation, flexible work environment", "cons": "Constant change and uncertainty of position", "advice": null}, {"title": "Constant change", "text": "Pros A good corporate culture where attention to employee development is a reality Cons Over the last few years there have been numerous consolidations and senior management turnover. Senior leadership is lacking, inconsistent, short term focused.", "rating": 3, "pros": "A good corporate culture where attention to employee development is a reality", "cons": "Over the last few years there have been numerous consolidations and senior management turnover. Senior leadership is lacking, inconsistent, short term focused.", "advice": null}, {"title": "Research Associate", "text": "Pros Great place to learn and experience various industry projects in a short time Cons overtime work and almost none benefits to it.", "rating": 5, "pros": "Great place to learn and experience various industry projects in a short time", "cons": "overtime work and almost none benefits to it.", "advice": null}, {"title": "Great place to work", "text": "Pros Great co-workers, warm and friendly people, good benefits, flexible work hours. The company takes care of its employees. It also promotes innovation and employee initiative. Cons Like many a large corporation, it was sometimes challenging to get updates from key personnel especially the legal dept. Advice to Management Keep up with the innovative ways", "rating": 5, "pros": "Great co-workers, warm and friendly people, good benefits, flexible work hours. The company takes care of its employees. It also promotes innovation and employee initiative.", "cons": "Like many a large corporation, it was sometimes challenging to get updates from key personnel especially the legal dept.", "advice": "Keep up with the innovative ways"}, {"title": "Good company", "text": "Pros high salary , good management , Cons unlimtied work, high work pressure Advice to Management good job", "rating": 5, "pros": "high salary , good management ,", "cons": "unlimtied work, high work pressure", "advice": "good job"}, {"title": "Research Manager", "text": "Pros Access to best in class researchers, high profile clients, good pay. Cons stuffy corporate vibe, not a lot of youthful energy in the SF office.", "rating": 5, "pros": "Access to best in class researchers, high profile clients, good pay.", "cons": "stuffy corporate vibe, not a lot of youthful energy in the SF office.", "advice": null}, {"title": "vp account exec", "text": "Pros Large global company with colleagues who work well togehter Cons Very disconnected between business units. Poor senior management decisiveness and influence.", "rating": 3, "pros": "Large global company with colleagues who work well togehter", "cons": "Very disconnected between business units. Poor senior management decisiveness and influence.", "advice": null}, {"title": "My experience at TNS has been mostly positive, though the company is undergoing a lot of change at the moment.", "text": "Pros The people here are very intelligent and do their best to work with you and mentor you in your role. Cons The current environment is very hostile, with high employee turnover. We are being told to do more with less - and often working weekends and late hours. While this is fine on an occasional basis - every week is too much pressure. Hopefully this turns around. Advice to Management Truly listen to the employees before they all walk out the door. There are so many good people here...dont let them get away. Be open and honest as to what is going on with the company. Communicate with us regularly.", "rating": 3, "pros": "The people here are very intelligent and do their best to work with you and mentor you in your role.", "cons": "The current environment is very hostile, with high employee turnover. We are being told to do more with less - and often working weekends and late hours. While this is fine on an occasional basis - every week is too much pressure. Hopefully this turns around.", "advice": "Truly listen to the employees before they all walk out the door. There are so many good people here...dont let them get away. Be open and honest as to what is going on with the company. Communicate with us regularly."}, {"title": "Boring job, good pay", "text": "Pros For the work that I was doing, the pay was good. It was really easy tasks that didn't take much thought. Cons There tended to be a decent amount of drama in the workplace. The work was also extremely boring. Advice to Management Dial back the drama", "rating": 3, "pros": "For the work that I was doing, the pay was good. It was really easy tasks that didn't take much thought.", "cons": "There tended to be a decent amount of drama in the workplace. The work was also extremely boring.", "advice": "Dial back the drama"}, {"title": "Varied work, many opportunities, lots of red tape", "text": "Pros Interesting work Great company to grow at Great people Cons Jack of all trades, master of none.", "rating": 5, "pros": "Interesting work", "cons": "Jack of all trades, master of none.", "advice": null}, {"title": "Place to be if you know very little about research", "text": "Pros Free Wolf shirts. Great cafeteria. Cons Most of IT are dopes. Advice to Management Hire IT people that know what they are doing.", "rating": 3, "pros": "Free Wolf shirts. Great cafeteria.", "cons": "Most of IT are dopes.", "advice": "Hire IT people that know what they are doing."}, {"title": "Large company, but fragmented", "text": "Pros Access to large- scale, cross- country, strategic projects Although a large company, it has many sub-units and each has a bit of different environment, so you can find one that fits you, it is not terribly uniform. Cons Very hierarchical, and slow to react to change. Terrible work-life balance when I was there, heard it's improved though.", "rating": 3, "pros": "Access to large- scale, cross- country, strategic projects", "cons": "Very hierarchical, and slow to react to change.", "advice": null}, {"title": "On the rise", "text": "Pros Change of management, greater focus on business strength and innovation in the industry Cons Short on internal resources at this time. Advice to Management More emphasis on internal resources to turn company around", "rating": 5, "pros": "Change of management, greater focus on business strength and innovation in the industry", "cons": "Short on internal resources at this time.", "advice": "More emphasis on internal resources to turn company around"}, {"title": "It's been good although there is definitely a glass ceiling.", "text": "Pros You can dress however you want and work from home when necessary. Cons There's limited chance for advancement Advice to Management Good luck!", "rating": 3, "pros": "You can dress however you want and work from home when necessary.", "cons": "There's limited chance for advancement", "advice": "Good luck!"}, {"title": "Customer First, Employee Last", "text": "Pros Compensation and benefits are fairly good. Cons The employees are not treated professionally. Technology is a very small part of the company. The company does not have proper policies for employee career development. Advice to Management You should pay attention to the way your Managers manage people. They should have proper training on principles of management, delegation and motivating people.", "rating": 3, "pros": "Compensation and benefits are fairly good.", "cons": "The employees are not treated professionally. Technology is a very small part of the company. The company does not have proper policies for employee career development.", "advice": "You should pay attention to the way your Managers manage people. They should have proper training on principles of management, delegation and motivating people."}, {"title": "Beware of Brits bearing money", "text": "Pros None - they can't do it right Cons Bought companies it doesn't know how to run and destroyed them - chased off all the decent employees at all levels - is top heavy with management and can't keep people to do the actual work - doesn't understand the necessity of doing basic functions to maintain the background data and information needed to continue functioning Advice to Management Get over your self and get to work - quit \"doing meetings\"", "rating": 3, "pros": "None - they can't do it right", "cons": "Bought companies it doesn't know how to run and destroyed them - chased off all the decent employees at all levels - is top heavy with management and can't keep people to do the actual work - doesn't understand the necessity of doing basic functions to maintain the background data and information needed to continue functioning", "advice": "Get over your self and get to work - quit \"doing meetings\""}, {"title": "market research interviewer", "text": "Pros There are always shifts when asked. Cons 1.monotonus 2.repetitive 3.catty working environment Advice to Management none", "rating": 3, "pros": "There are always shifts when asked.", "cons": "1.monotonus", "advice": "none"}, {"title": "Global company that requires a lot", "text": "Pros Global environment Relaxed working condition. Flexible working hours Cons Earn what you work for. Requires you to attract clients, sustain and also do the researching part Salary and bonus depends on which team you are part of Advice to Management Better sharing of the workload and effective working conditions", "rating": 3, "pros": "Global environment", "cons": "Earn what you work for.", "advice": "Better sharing of the workload and effective working conditions"}, {"title": "Good exposure to market research but bad process", "text": "Pros - Able to expose to different industries and different type of surveys - Able to build your foundation in market research - Able to train your resilience Cons - Process not organised - Lack of work-life balance - Heavy workload due to demanding client requests and rectifying errors Advice to Management Relook into process to ensure the quality", "rating": 3, "pros": "- Able to expose to different industries and different type of surveys", "cons": "- Process not organised", "advice": "Relook into process to ensure the quality"}, {"title": "Client Manager", "text": "Pros Interesting projects - never the same Cons A lot of stress, not very generous payment", "rating": 5, "pros": "Interesting projects - never the same", "cons": "A lot of stress, not very generous payment", "advice": null}, {"title": "Cati Interviewer", "text": "Pros Excellent Support by team members. Cons Work was not of my interest.", "rating": 3, "pros": "Excellent Support by team members.", "cons": "Work was not of my interest.", "advice": null}, {"title": "Suitable for first work", "text": "Pros Have changes to work with client in different industries Cons Low salary, no overtime payment Advice to Management Should change faster in a digital-leading environment", "rating": 5, "pros": "Have changes to work with client in different industries", "cons": "Low salary, no overtime payment", "advice": "Should change faster in a digital-leading environment"}, {"title": "Great place to learn", "text": "Pros Great people and working environment Opportunities to learn Flexible hours Cons Young management or with no experience Lack of mentoring . You need to know how to work without clear guidance Your salary does not reflect your position Advice to Management Pay more your employees to avoid big turnover", "rating": 5, "pros": "Great people and working environment", "cons": "Young management or with no experience", "advice": "Pay more your employees to avoid big turnover"}, {"title": "Finance Manager", "text": "Pros Good benefits Good location - downtown on both subway lines Challenging work Cons Lots of requirements dictated by global parent in UK not necessarily aligned with local market. Lack of transparency of strategy by global management team.", "rating": 3, "pros": "Good benefits", "cons": "Lots of requirements dictated by global parent in UK not necessarily aligned with local market.", "advice": null}, {"title": "Ok Place to work", "text": "Pros Worked at the Bangalore office. -Great team Cons -Less Pay -Low scope for increments -Endless working hours Advice to Management The office needs some renovation and there should be some importance given to work life balance", "rating": 3, "pros": "Worked at the Bangalore office.", "cons": "-Less Pay", "advice": "The office needs some renovation and there should be some importance given to work life balance"}, {"title": "Global company with localised attitudes and often disjointed politics", "text": "Pros Individuals are decent people Those actually doing the work support each other in the main Decent, modern office in London Bridge Cons Unnecessary office politics and cliques creating tension Very high workloads so minimal work/life balance Inbuilt blame culture Management teams detached from workload Constant changes to business focus Culture not supportive or focused on personal development Advice to Management Realise that a supported, happy team will work harder and more effectively", "rating": 1, "pros": "Individuals are decent people", "cons": "Unnecessary office politics and cliques creating tension", "advice": "Realise that a supported, happy team will work harder and more effectively"}, {"title": "Great company but no mentoring", "text": "Pros Great people Good solutions Opportunities to learn Social and fun Cons No mentoring from senior staff or line managers You are responsible for your own progression - not much guidance or support Sometimes frustrating working on massive projects that are uninspiring", "rating": 5, "pros": "Great people", "cons": "No mentoring from senior staff or line managers", "advice": null}, {"title": "Miserable workplace", "text": "Pros Employees are mostly young and cheerful. Cons New management have changed TNS from a happy work environment to miserable place to work. The treatment of staff is as if they were children, which is nothing short of patronising and condemning. Advice to Management Treat your staff with respect and perceive the benefits .", "rating": 1, "pros": "Employees are mostly young and cheerful.", "cons": "New management have changed TNS from a happy work environment to miserable place to work. The treatment of staff is as if they were children, which is nothing short of patronising and condemning.", "advice": "Treat your staff with respect and perceive the benefits ."}, {"title": "Great place if with an ambition to learn quickly", "text": "Pros Collaborative team, and respect for independency Cons Poor work and life balance, Advice to Management Pay attention on maintaining the clients with higher job quality", "rating": 3, "pros": "Collaborative team, and respect for independency", "cons": "Poor work and life balance,", "advice": "Pay attention on maintaining the clients with higher job quality"}, {"title": "Consultant", "text": "Pros Global network, awesome colleagues, international environment. Relocation opportunities. Cons Quite low salary, long hours, unpaid overtime, sometimes click-y culture, slow progression.", "rating": 3, "pros": "Global network, awesome colleagues, international environment. Relocation opportunities.", "cons": "Quite low salary, long hours, unpaid overtime, sometimes click-y culture, slow progression.", "advice": null}, {"title": "procurment", "text": "Pros early finish on Fridays afternoons Cons hard to get to by car as on busy roundabout and nowhere to eat Advice to Management more career progression on site catering", "rating": 3, "pros": "early finish on Fridays afternoons", "cons": "hard to get to by car as on busy roundabout and nowhere to eat", "advice": "more career progression on site catering"}, {"title": "Disappointing", "text": "Pros Global company which is up to date with technology and world wide developments Cons Very low pay Insulting promotions in terms of salary Benefits are basic No work life balance No proper recognition for any achievements Discriminatory mafia environment Always overloaded with work that you are never appreciated for", "rating": 3, "pros": "Global company which is up to date with technology and world wide developments", "cons": "Very low pay", "advice": null}, {"title": "Senior Director", "text": "Pros Open discussion with seniors are not a problem Cons Do not expect any work and life balance based on what kind of clients you meet", "rating": 3, "pros": "Open discussion with seniors are not a problem", "cons": "Do not expect any work and life balance based on what kind of clients you meet", "advice": null}, {"title": "General View", "text": "Pros The company is good and the advantage is that the company is geographically divided so you can work across segments Cons Nothing to specifically speak about Advice to Management They should conduct training on tools", "rating": 3, "pros": "The company is good and the advantage is that the company is geographically divided so you can work across segments", "cons": "Nothing to specifically speak about", "advice": "They should conduct training on tools"}, {"title": "intern experience", "text": "Pros work at home, flexibility, opportunities to involved with multiple aspects of marketing research Cons works come at any time; formal employees don't care who the interns are", "rating": 5, "pros": "work at home, flexibility, opportunities to involved with multiple aspects of marketing research", "cons": "works come at any time; formal employees don't care who the interns are", "advice": null}, {"title": "Senior account manager", "text": "Pros Very welcoming understanding cosmopolitan good salary and friendly colleagues Cons Very stressful working over nights and weekends Advice to Management Dont overload your employees all the time because they proved to be reliable and trustworthy", "rating": 3, "pros": "Very welcoming understanding cosmopolitan good salary and friendly colleagues", "cons": "Very stressful working over nights and weekends", "advice": "Dont overload your employees all the time because they proved to be reliable and trustworthy"}, {"title": "Research Executive", "text": "Pros Great managers and projects to learn from and own from start to end. The grad scheme is very good. Cons Long hours, stressful environment (depending on the team) but the remuneration isn't appropriate. Advice to Management Trying to change the business -- becoming more a consulting business is a great idea but requieres the necessary training and does not happen overnight.", "rating": 3, "pros": "Great managers and projects to learn from and own from start to end. The grad scheme is very good.", "cons": "Long hours, stressful environment (depending on the team) but the remuneration isn't appropriate.", "advice": "Trying to change the business -- becoming more a consulting business is a great idea but requieres the necessary training and does not happen overnight."}, {"title": "Senior Director", "text": "Pros Had a great office culture which unfortunately changed due to new leadership and restructuring. Cons Very clichy. If you were not part of the clich then you would be left out.", "rating": 5, "pros": "Had a great office culture which unfortunately changed due to new leadership and restructuring.", "cons": "Very clichy. If you were not part of the clich then you would be left out.", "advice": null}, {"title": "field interviewer", "text": "Pros How supervisors and managers help in your beginnings. Good interviewing strategies very respectful with the respondents. Brilliant use of sampling techniques. Cons The only problems for the interviewer are those related with the fact that some areas are more difficult and even though they consider it, it might be worth to pay closer attention to the difficulties in specific areas.", "rating": 5, "pros": "How supervisors and managers help in your beginnings. Good interviewing strategies very respectful with the respondents. Brilliant use of sampling techniques.", "cons": "The only problems for the interviewer are those related with the fact that some areas are more difficult and even though they consider it, it might be worth to pay closer attention to the difficulties in specific areas.", "advice": null}, {"title": "Senior Research manager", "text": "Pros Salary is only one advantage Cons Dont know meaning of work life balance Advice to Management nothing", "rating": 1, "pros": "Salary is only one advantage", "cons": "Dont know meaning of work life balance", "advice": "nothing"}, {"title": "Research Director", "text": "Pros Great Company that has great people Cons Nothing specific overall a great company", "rating": 5, "pros": "Great Company that has great people", "cons": "Nothing specific overall a great company", "advice": null}, {"title": "Needs some stability and LESS politics", "text": "Pros The people in general are great and it can be a fun place to work and make friends Cons Constant change in leadership, vision, structure - each one is definitely the 'right' 'answer until the next one comes along and all the promises of the previous one are forgotten Too much politics including at senior level where it's obvious some people are just saying the right thing to please those above them and will change it for the next CEO to come along Too little investment in systems etc shortsighted", "rating": 3, "pros": "The people in general are great and it can be a fun place to work and make friends", "cons": "Constant change in leadership, vision, structure - each one is definitely the 'right' 'answer until the next one comes along and all the promises of the previous one are forgotten", "advice": null}, {"title": "Good MR Firm", "text": "Pros Very supportive support function team and good learning & developments Cons Immediate managers are not that encouraging Advice to Management require more motivation", "rating": 3, "pros": "Very supportive support function team and good learning & developments", "cons": "Immediate managers are not that encouraging", "advice": "require more motivation"}, {"title": "Opportunity as a fresher", "text": "Pros Opportunity to learn Good for people starting the careers Friendly environment to work There is new skills you can learn Cons Too much work No flexible working hours Salary is low not paid as per industry average for entry level employees Advice to Management Please make sure there is a time limit for working hours", "rating": 3, "pros": "Opportunity to learn", "cons": "Too much work", "advice": "Please make sure there is a time limit for working hours"}, {"title": "Salary range for SRE", "text": "Pros overload of work so fast learning no proper team so on job training Cons no work life balance hectic life overload of work no structure Advice to Management be more concerned about employees", "rating": 3, "pros": "overload of work so fast learning", "cons": "no work life balance", "advice": "be more concerned about employees"}, {"title": "Coding Research analyst", "text": "Pros overall very very friendly environment Cons lesser opportunities to work from home not con specifically Advice to Management NA", "rating": 5, "pros": "overall very very friendly environment", "cons": "lesser opportunities to work from home not con specifically", "advice": "NA"}, {"title": "Work hard, learn a lot but forget about work life balance", "text": "Pros Big business Big clients Big brand Cons Very poor benefits No work life balance - expect to give your life to the business Too stuck in traditional research culture - dinosaur Advice to Management Strategize better and plan better to retain people", "rating": 5, "pros": "Big business", "cons": "Very poor benefits", "advice": "Strategize better and plan better to retain people"}, {"title": "Worst leadership and no effort to grow employees", "text": "Pros There is effort made towards arranging time to time excursions and in-office entertainment with a foosball table and all - a welcome distraction from the long long hours the work demands Cons The leadership of some teams, specifically Qualitative is the worst there ever is The idea is to only have work horses and overwork a few resources and not grow them Slow on promotions, promotions are promised, hikes are promised but not delivered Very clout based, uninspiring senior management rolls off a lot of heads to save their own jobs Extreme attrition rate of some very talented people Advice to Management The atmosphere is extremely demotivating, because no matter how many recreational parties you attend, one has to come back to work and feel inspired - which is seriously lacking No concern or effort made towards keeping good talent behind - The HR is non-existent There is no culture to speak about in TNS among research companies. The bad work culture is a well know fact across the research industry. The senior management needs to work really hard to change this impression.", "rating": 3, "pros": "There is effort made towards arranging time to time excursions and in-office entertainment with a foosball table and all - a welcome distraction from the long long hours the work demands", "cons": "The leadership of some teams, specifically Qualitative is the worst there ever is", "advice": "The atmosphere is extremely demotivating, because no matter how many recreational parties you attend, one has to come back to work and feel inspired - which is seriously lacking"}, {"title": "Nice offices but that's about it!", "text": "Pros Nice offices and great location for London office Cons Shocking culture, poor pay, poor work life balance, weak leadership, petty politics Advice to Management Get rid of old guard", "rating": 3, "pros": "Nice offices and great location for London office", "cons": "Shocking culture, poor pay, poor work life balance, weak leadership, petty politics", "advice": "Get rid of old guard"}, {"title": "A high performance driven, no nonsense environment.", "text": "Pros The exposure to different projects and opportunities for rapid career growth through learning Cons The people can be seemingly cold due to the high performance culture", "rating": 5, "pros": "The exposure to different projects and opportunities for rapid career growth through learning", "cons": "The people can be seemingly cold due to the high performance culture", "advice": null}, {"title": "Market Research Interviewer", "text": "Pros Flexible shift patterns Pay well if you can meet targets. Decent Management Cons Interviews can vary from 10 to 30 minutes in length dependant upon what people answer and still get paid the same per interview. can be very demanding Work in all weather conditions Zero hour - you are only required if they need you (which is most of the time) Advice to Management Make Targets More Realistic Better pay for longer interviews.", "rating": 5, "pros": "Flexible shift patterns", "cons": "Interviews can vary from 10 to 30 minutes in length dependant upon what people answer and still get paid the same per interview.", "advice": "Make Targets More Realistic"}, {"title": "Good experience but political environment", "text": "Pros - mutlicultural team - good global clients Cons - org structure not empowering - political environment", "rating": 3, "pros": "- mutlicultural team", "cons": "- org structure not empowering", "advice": null}, {"title": "Great Environment But Horrible Salaries", "text": "Pros Great work life balance, you will be challenged and learn a lot. Lots of staff events Cons Salaries are way below average, lots of favoritism. It doesn't matter how hard you work, you wont reap benefits if you not in favor with management. Advice to Management Salaries should be looked at. The amount of work that is expected of employees does not match salaries given.", "rating": 3, "pros": "Great work life balance, you will be challenged and learn a lot. Lots of staff events", "cons": "Salaries are way below average, lots of favoritism. It doesn't matter how hard you work, you wont reap benefits if you not in favor with management.", "advice": "Salaries should be looked at. The amount of work that is expected of employees does not match salaries given."}, {"title": "Sr. Analyst", "text": "Pros Company wise it is very Employee Friendly and flexible. Cons Professionally There is shortage of growth in career prospective.", "rating": 5, "pros": "Company wise it is very Employee Friendly and flexible.", "cons": "Professionally There is shortage of growth in career prospective.", "advice": null}, {"title": "Anonymous", "text": "Pros Great place to network with various departments, learn as much as you want, a real opportunity to develop and grow without feeling comfortable...i.e. you will be continuously learning and doing challenging activities Cons None that will make you want to leave. This is truly one of rare & great places to work.", "rating": 5, "pros": "Great place to network with various departments, learn as much as you want, a real opportunity to develop and grow without feeling comfortable...i.e. you will be continuously learning and doing challenging activities", "cons": "None that will make you want to leave. This is truly one of rare & great places to work.", "advice": null}, {"title": "Ok", "text": "Pros Variety, Clients, Projects, Young, Accessible Cons Low pay, maybe too junior, unhappy juniors, canteen", "rating": 3, "pros": "Variety, Clients, Projects, Young, Accessible", "cons": "Low pay, maybe too junior, unhappy juniors, canteen", "advice": null}, {"title": "TNS GLOBAL - Telephone interview", "text": "Pros Flexible, Good wage, Free drinks during work hours, Consistent feedback, Friendly staff. Cons Shut down hull branch, Sometimes unrealistic targets.", "rating": 5, "pros": "Flexible,", "cons": "Shut down hull branch,", "advice": null}, {"title": "TNS Indonesia Review", "text": "Pros - High profile clients. - Family like atmosphere. - Seniors (best in class researchers) who are willing to guide juniors. - Great place for learning (university like workplace) for various research methods and industries. - Outside of office activities. - Good health insurance benefit if compared to Nielsen. Cons - Low compensation compared to other agency in the industry. - Career advancement seems to put more weight on tenure instead of merit. - A bit unbalanced load management between teams. - There's a bit sense of supporting expatriate more than the local smarts. Advice to Management Better integrated system to manage workloads. Support the 'stars' so as to not dimming out eventually.", "rating": 3, "pros": "- High profile clients.", "cons": "- Low compensation compared to other agency in the industry.", "advice": "Better integrated system to manage workloads. Support the 'stars' so as to not dimming out eventually."}, {"title": "Senior Research Executive", "text": "Pros Exposure is good, lots of opportunities to learn consulting skills, analytical skills and communication skills. Love the culture as well as the people Cons No work-life balance. Usually work till very late during peak seasons. Poor compensation package. Advice to Management Investment more on the junior staff and give a more competitive salary package given the hard work they have done.", "rating": 3, "pros": "Exposure is good, lots of opportunities to learn consulting skills, analytical skills and communication skills. Love the culture as well as the people", "cons": "No work-life balance. Usually work till very late during peak seasons. Poor compensation package.", "advice": "Investment more on the junior staff and give a more competitive salary package given the hard work they have done."}, {"title": "Excellent place to start your career", "text": "Pros - Young, energetic work environment - Ample opportunities for growth - Mostly flat structure, despite a hierarchy system in place Cons Sometimes there's focus on quantity over quality of work.", "rating": 5, "pros": "- Young, energetic work environment", "cons": "Sometimes there's focus on quantity over quality of work.", "advice": null}, {"title": "Project executive", "text": "Pros Big company with opportunities to grow. Cons Management young or with lack of experience.", "rating": 5, "pros": "Big company with opportunities to grow.", "cons": "Management young or with lack of experience.", "advice": null}, {"title": "Review", "text": "Pros Good proprietary tools. Good colleagues Cons Poor work life balance Uncooperative HR dept Mundane and repetitive work Compensation below industry standard. No benefits/perks provided High attrition rate Over burdened workforce Advice to Management Please focus on employee's growth and learning as well if you expect them to deliver", "rating": 1, "pros": "Good proprietary tools. Good colleagues", "cons": "Poor work life balance", "advice": "Please focus on employee's growth and learning as well if you expect them to deliver"}, {"title": "market research interviewer", "text": "Pros lovely job in the summer; very nice meeting different people. surveys were interesting supervisors were understanding and there was always plenty of work Cons can be a very miserable job in the winter out in all types of weather. quite often you need to work long hours to get all your interviews completed on time Advice to Management keep the staff motivated especially when you are working from your nice cosy wee home and your workers are out there bearing up in the wet and windy outdoors all night", "rating": 3, "pros": "lovely job in the summer; very nice meeting different people. surveys were interesting supervisors were understanding and there was always plenty of work", "cons": "can be a very miserable job in the winter out in all types of weather. quite often you need to work long hours to get all your interviews completed on time", "advice": "keep the staff motivated especially when you are working from your nice cosy wee home and your workers are out there bearing up in the wet and windy outdoors all night"}, {"title": "Summer Internship", "text": "Pros Laid back, Steep learning, Friendly Co workers, Flexible work Culture Cons Enough work to kill you, attrition rate is too high. If you end up at a time when there is no one to guide you will have a tough time. No real perks.", "rating": 5, "pros": "Laid back, Steep learning, Friendly Co workers, Flexible work Culture", "cons": "Enough work to kill you, attrition rate is too high. If you end up at a time when there is no one to guide you will have a tough time. No real perks.", "advice": null}, {"title": "One of the best companies I ever worked in", "text": "Pros Good team, interesting job, pleasant corporate atmosphere. Convinient office. Cons Small salary. Need a good Database Architecht to setup processes. Advice to Management Please, hire a good Database Architecht to setup processes.", "rating": 5, "pros": "Good team, interesting job, pleasant corporate atmosphere. Convinient office.", "cons": "Small salary. Need a good Database Architecht to setup processes.", "advice": "Please, hire a good Database Architecht to setup processes."}, {"title": "Good for graduates and no good for career development", "text": "Pros Big name and WPP affliates Cons Lack of innovation, slow response", "rating": 3, "pros": "Big name and WPP affliates", "cons": "Lack of innovation, slow response", "advice": null}, {"title": "Nice working there", "text": "Pros Good exposure. Got to learn a lot meeting clients, making presentation. Cons Low salary. Sometime lot of work pressure because of clients", "rating": 5, "pros": "Good exposure. Got to learn a lot meeting clients, making presentation.", "cons": "Low salary. Sometime lot of work pressure because of clients", "advice": null}, {"title": "Delivery Associate", "text": "Pros - Various projects to work on from different clients from around the world - Friendly environment - Events perks Cons - Long hours/overtime work - Low compensation compared to other market - Slow position advancement - Little opportunities", "rating": 3, "pros": "- Various projects to work on from different clients from around the world", "cons": "- Long hours/overtime work", "advice": null}, {"title": "Qualitative", "text": "Pros Big Company Reputed organisation Get to work with big clients Cons Bad Management Mediocre work No work life balance Dirty Office politics", "rating": 3, "pros": "Big Company", "cons": "Bad Management", "advice": null}, {"title": "Acceptable for a temporary job", "text": "Pros Relaxed environment and good management. Cons Low wages. Low job security.", "rating": 5, "pros": "Relaxed environment and good management.", "cons": "Low wages. Low job security.", "advice": null}, {"title": "Research associate", "text": "Pros get to meet a lot of people from many areas. Cons too much work. time consuming.", "rating": 5, "pros": "get to meet a lot of people from many areas.", "cons": "too much work. time consuming.", "advice": null}, {"title": "decent student job but poor training", "text": "Pros decent shift patterns, 4 hour bursts Cons poor training, unfriendly managers, poor atmosphere Advice to Management Maybe hire more personable managers? probably help with morale", "rating": 3, "pros": "decent shift patterns, 4 hour bursts", "cons": "poor training, unfriendly managers, poor atmosphere", "advice": "Maybe hire more personable managers? probably help with morale"}, {"title": "localised MNC in very not internationalised region, somewhat outdated business", "text": "Pros In terms of career opportunity and office culture, it is better than many other companies in Korea Cons * Job is more about translation and many admin task rather than doing 'research'; it makes their employee to be translators rather than to be researchers. * Traditional and somewhat outdated business; researchers only use excel and SPSS; the company more cares about superficial things (e.g: they give huge effort to beautify their deliverable by having visual specialist team) rather than concentrates on essential thing (the most of its research mostly rely on simple frequency research or interview script) * Poor senior management with bearing outdated mindset:lack of understanding of diversity although their company is MNC; lack of willingness to adopt new trend of research and industry; lack of understanding of working life balance of their employee Advice to Management Please get yourself out from the outdated mindset and please aware current trend of research and technology.", "rating": 3, "pros": "In terms of career opportunity and office culture, it is better than many other companies in Korea", "cons": "* Job is more about translation and many admin task rather than doing 'research'; it makes their employee to be translators rather than to be researchers.", "advice": "Please get yourself out from the outdated mindset and please aware current trend of research and technology."}, {"title": "Good company to work for", "text": "Pros Lots of very intelligent people Varied work Supportive team members Good work life balance Opprtunity to get involved in lots of different things Reputable company Cons Icareer progression slow and hard to climb the ladder. Easy to get lost in a big company. Lots of admin Advice to Management Increase wages to keep your best staff. Great place to work but just not feasible to stay here with the level of wages so low", "rating": 5, "pros": "Lots of very intelligent people", "cons": "Icareer progression slow and hard to climb the ladder. Easy to get lost in a big company.", "advice": "Increase wages to keep your best staff."}, {"title": "Immense learning but no concept of work life balance", "text": "Pros Lots to learn. Opportunity to handle projects from start to finish at a junior level as well. Exposure to varied projects, clients, categories. Cons No personal life - High attrition due to this Expected to work round the clock, through weekends High pressure job Salaries not at part with the demanding job Advice to Management Need to give employees some sort of break and not burden one resource with work that is actually to be done by 3 resources.", "rating": 3, "pros": "Lots to learn.", "cons": "No personal life - High attrition due to this", "advice": "Need to give employees some sort of break and not burden one resource with work that is actually to be done by 3 resources."}, {"title": "Account manager", "text": "Pros Great learning for Market researchers Cons Remunerations is not up to industry standards Advice to Management Provide pay closer to competition", "rating": 5, "pros": "Great learning for Market researchers", "cons": "Remunerations is not up to industry standards", "advice": "Provide pay closer to competition"}, {"title": "tns", "text": "Pros international reach, good platform, good clients Cons usually OT, salary is not high Advice to Management less OT", "rating": 5, "pros": "international reach, good platform, good clients", "cons": "usually OT, salary is not high", "advice": "less OT"}, {"title": "Research Executive", "text": "Pros Fast learning opportunities to become expert in marketing research Cons Very heavy work hours (sometimes expected to work on weekends)", "rating": 3, "pros": "Fast learning opportunities to become expert in marketing research", "cons": "Very heavy work hours", "advice": null}, {"title": "Ok company", "text": "Pros Less politics, open culture etc. Cons Not great learning, less training", "rating": 3, "pros": "Less politics, open culture etc.", "cons": "Not great learning, less training", "advice": null}, {"title": "Commercial Director", "text": "Pros Great international opportunities. Good office. Cons Management should enhance more transparency.", "rating": 5, "pros": "Great international opportunities. Good office.", "cons": "Management should enhance more transparency.", "advice": null}, {"title": "Boring work, fun people", "text": "Pros Colleagues were lovely and great fun. TNS at London Bridge also hosts free office drinks last Friday of every month which were always a blast. Relaxed work environment, good location. Cons The work was very dull and not particularly well paid.", "rating": 3, "pros": "Colleagues were lovely and great fun. TNS at London Bridge also hosts free office drinks last Friday of every month which were always a blast. Relaxed work environment, good location.", "cons": "The work was very dull and not particularly well paid.", "advice": null}, {"title": "Flexible, great for summer", "text": "Pros Flexible hours - great for summer work Paid for training - big plus Short shift pattern - Could finish well before 5pm some days Cons Outdated technology - very old computers that weren't very user-friendly", "rating": 5, "pros": "Flexible hours - great for summer work", "cons": "Outdated technology - very old computers that weren't very user-friendly", "advice": null}, {"title": "Research Executive", "text": "Pros Great people & working environment. You get a lot of responsibility and autonomy even as a junior, including lots of client contact. Cons Working hours can be long in busy periods, which is not really reflected in the pay. There's also a tendency to be tied to an account once your on it, with not a lot of option to get exposure to more things unless you choose to up your own workload. Advice to Management Continue exploring innovative ways to utilise technology within the research and encourage clients to adopt. Re-evaluate trackers that have been running for a long time to see if there are ways they can be radicalised to produce more valuable insight.", "rating": 5, "pros": "Great people & working environment. You get a lot of responsibility and autonomy even as a junior, including lots of client contact.", "cons": "Working hours can be long in busy periods, which is not really reflected in the pay. There's also a tendency to be tied to an account once your on it, with not a lot of option to get exposure to more things unless you choose to up your own workload.", "advice": "Continue exploring innovative ways to utilise technology within the research and encourage clients to adopt. Re-evaluate trackers that have been running for a long time to see if there are ways they can be radicalised to produce more valuable insight."}, {"title": "Good place to start your market research career.", "text": "Pros Experienced managers. Open and learning environment. Cons Low salary and less career opportunities.", "rating": 3, "pros": "Experienced managers.", "cons": "Low salary and less career opportunities.", "advice": null}, {"title": "Research Manager", "text": "Pros Member of Kantar Network, data & insights arm of WPP's world largest marketing communications holding group puts you in the core of the biggest companies to do find new insights that helps companies grow based on innovation. As part of the client service team you can work directly with the best companies around the globe in order to help them achieve their main objectives by providing actionable recommendations. As member of Kantar TNS you can have full support from teams all arround the world that will help to share knowledge on best practices to tackle different request maded by clients so you can be the best option to answer their business questions. Cons As part of the Business to Business side of the market research industry, salary and compensations tend to be lower than being on the client side. Sometimes workloads turn exhausting and it's very common to stay long hours at the office. Not a formal home-office plans are implemented as of now despite moving within the city turns impossible very easily.", "rating": 5, "pros": "Member of Kantar Network, data & insights arm of WPP's world largest marketing communications holding group puts you in the core of the biggest companies to do find new insights that helps companies grow based on innovation. As part of the client service team you can work directly with the best companies around the globe in order to help them achieve their main objectives by providing actionable recommendations. As member of Kantar TNS you can have full support from teams all arround the world that will help to share knowledge on best practices to tackle different request maded by clients so you can be the best option to answer their business questions.", "cons": "As part of the Business to Business side of the market research industry, salary and compensations tend to be lower than being on the client side. Sometimes workloads turn exhausting and it's very common to stay long hours at the office. Not a formal home-office plans are implemented as of now despite moving within the city turns impossible very easily.", "advice": null}, {"title": "Operation Director Middle East KWP", "text": "Pros Flexible working hours, you can find good people Cons No culture diversity, lot of politics based on nationalities Advice to Management Create culture diversity", "rating": 3, "pros": "Flexible working hours, you can find good people", "cons": "No culture diversity, lot of politics based on nationalities", "advice": "Create culture diversity"}, {"title": "I don't see things getting better", "text": "Pros Amazing clients, always interesting work in the social practice, huge talent in the staff, good progression opportunities. Some great people at the top and some not so great. Cons The Kantar/WPP umbrella should be a benefit but feels like a curse for what could be a great company. Consistently and woefully understaffed for the revenue targets which means people are constantly overworked, exhausted and ill. Great progression opportunities but without corresponding pay - more work, more pressure, no reward. Pay situation is improving slowly but pay remains low compared to others in the industry. HR, finance and IT systems and processes are hugely unhelpful and waste an enormous amount of people's valuable time. Advice to Management Pay the people you value well, and set targets that are reasonable for the people you have.", "rating": 3, "pros": "Amazing clients, always interesting work in the social practice, huge talent in the staff, good progression opportunities. Some great people at the top and some not so great.", "cons": "The Kantar/WPP umbrella should be a benefit but feels like a curse for what could be a great company. Consistently and woefully understaffed for the revenue targets which means people are constantly overworked, exhausted and ill. Great progression opportunities but without corresponding pay - more work, more pressure, no reward. Pay situation is improving slowly but pay remains low compared to others in the industry. HR, finance and IT systems and processes are hugely unhelpful and waste an enormous amount of people's valuable time.", "advice": "Pay the people you value well, and set targets that are reasonable for the people you have."}, {"title": "Market Researcher", "text": "Pros Good people Opportunities to know Fortune 500 company's insights Cons Long hours Big Pressure Low pay (considering the hours)", "rating": 5, "pros": "Good people", "cons": "Long hours", "advice": null}, {"title": "Market Research Interviewer", "text": "Pros Very Good Working Environment. Friendly Staff and middle management. Cons Working in all weather conditions, targets are demanding, pay is postponed. Advice to Management Pay employees on time. Treat market research interviewers as employees.", "rating": 3, "pros": "Very Good Working Environment. Friendly Staff and middle management.", "cons": "Working in all weather conditions, targets are demanding, pay is postponed.", "advice": "Pay employees on time. Treat market research interviewers as employees."}, {"title": "Good as first job", "text": "Pros Good training and opportunities to learn more about market research. If you ask people are very willing to help out Cons You don't have much support unless ask. Can get bored so need to check in with manager regularly to ensure you having a productive day Advice to Management Regular updates between managers and staff", "rating": 3, "pros": "Good training and opportunities to learn more about market research. If you ask people are very willing to help out", "cons": "You don't have much support unless ask. Can get bored so need to check in with manager regularly to ensure you having a productive day", "advice": "Regular updates between managers and staff"}, {"title": "Too much change", "text": "Pros Some good people and good variety of projects Cons Constant change. If it isn't the CEO changing it's a restructure and if you want a job with a pay rise this isn't the place to go.", "rating": 3, "pros": "Some good people and good variety of projects", "cons": "Constant change. If it isn't the CEO changing it's a restructure and if you want a job with a pay rise this isn't the place to go.", "advice": null}, {"title": "Standard", "text": "Pros A multinational company with good infrastructure to work on most departments. Nice easy-going work environment, coffee friendly and open to expose your ideas. Cons It used to outsource most of its workforce, which would make you have to discuss with someone that you haven't met or worked with to solve any issues you want. Advice to Management The career path isn't clear to all stages and it takes long to do so. The IT and Operations are constantly overwhelmed and working extra hours to fulfill the needs and achieve goals.", "rating": 3, "pros": "A multinational company with good infrastructure to work on most departments. Nice easy-going work environment, coffee friendly and open to expose your ideas.", "cons": "It used to outsource most of its workforce, which would make you have to discuss with someone that you haven't met or worked with to solve any issues you want.", "advice": "The career path isn't clear to all stages and it takes long to do so. The IT and Operations are constantly overwhelmed and working extra hours to fulfill the needs and achieve goals."}, {"title": "Balance in workload needs to be improved", "text": "Pros Employees are amazing, in the research department bosses are very professional and have tons of experience! Pleasure to work with. Cons Random layoffs in the supporting departments last year, causing problems in many projects. Workload is often unbalanced. Advice to Management Please do not only favor the more senior employees in supporting functions like fieldwork!", "rating": 3, "pros": "Employees are amazing, in the research department bosses are very professional and have tons of experience! Pleasure to work with.", "cons": "Random layoffs in the supporting departments last year, causing problems in many projects. Workload is often unbalanced.", "advice": "Please do not only favor the more senior employees in supporting functions like fieldwork!"}, {"title": "Good place to learn", "text": "Pros Multicultural Training & learning opportunities Cons Gets stagnant after 2 years Advice to Management Need to value talent & focus on retention", "rating": 5, "pros": "Multicultural", "cons": "Gets stagnant after 2 years", "advice": "Need to value talent & focus on retention"}, {"title": "research associate", "text": "Pros its is gud place to start working Cons needs to give som training for freshers. plz dont expect for a baby,,juts getting married Advice to Management please concenrate increasing employee satisfaction than just profit", "rating": 3, "pros": "its is gud place to start working", "cons": "needs to give som training for freshers. plz dont expect for a baby,,juts getting married", "advice": "please concenrate increasing employee satisfaction than just profit"}, {"title": "Many other better agencies to work for", "text": "Pros Young, dynamic culture of diverse nationalities, generally fun environment to work in. Cons Poor training for junior associates, many managers/ senior management just desire to fulfill their own agenda. No structured training in place, no career advancement if you have no connections, no work life balance. Advice to Management -", "rating": 3, "pros": "Young, dynamic culture of diverse nationalities, generally fun environment to work in.", "cons": "Poor training for junior associates, many managers/ senior management just desire to fulfill their own agenda. No structured training in place, no career advancement if you have no connections, no work life balance.", "advice": "-"}, {"title": "Standard Research Company", "text": "Pros Showing desire to change and improve Cons Poor leadership and strategy experience avalaible", "rating": 3, "pros": "Showing desire to change and improve", "cons": "Poor leadership and strategy experience avalaible", "advice": null}, {"title": "Review", "text": "Pros Good place to gain experience and improve marketing knowledge in action working with the successful brands. Cons There is a different environment in different offices; some fail to follow the leading offices both in relation with innovation and success which results in a comparatively poorer employee experience Advice to Management Catching up with other TNS offices and other successful market research companies. From a broader perpective, controlling every office closely and guiding them to succeed and become leader in their countries.", "rating": 3, "pros": "Good place to gain experience and improve marketing knowledge in action working with the successful brands.", "cons": "There is a different environment in different offices; some fail to follow the leading offices both in relation with innovation and success which results in a comparatively poorer employee experience", "advice": "Catching up with other TNS offices and other successful market research companies. From a broader perpective, controlling every office closely and guiding them to succeed and become leader in their countries."}, {"title": "Client Services", "text": "Pros Great monthly staff parties with free food and drink Cons I was over 4 months harassed by a manager that had worked for the company for over 20 years. Fellow colleagues warned me about her, and although she repeatedly made fun of me infront of senior staff (mostly my nationality and coming to this country was an issue, but also far fetch assumptions about my private life) and always being the clueless in projects, no one ever interfered. Close to non existent training in my training role. Which is ironic, as my manager assumed I didn't know how to right click or how a 5 year university degree made me able to know right from left. I had a great HR advisor, but when we together put forward my concerns to senior management I was quickly labeled a trouble maker, and they 'helped' by going though all senior management to ask if I also had a problem with them. The least professional approach I've ever experienced in all my years as a professional, and my most horrible work experience to date. Advice to Management Don't let incompetent managers micromanage your staff without a proper university degree/knowledge of the general world. Senior HR staff turns employees complaints against them.", "rating": 1, "pros": "Great monthly staff parties with free food and drink", "cons": "I was over 4 months harassed by a manager that had worked for the company for over 20 years.", "advice": "Don't let incompetent managers micromanage your staff without a proper university degree/knowledge of the general world. Senior HR staff turns employees complaints against them."}, {"title": "Research Executive", "text": "Pros Flexible working hours, friendly colleagues Cons long working hours, expect OT Advice to Management Hire more people or better manage the projects between teams so that workload can be shared equally.", "rating": 3, "pros": "Flexible working hours, friendly colleagues", "cons": "long working hours, expect OT", "advice": "Hire more people or better manage the projects between teams so that workload can be shared equally."}, {"title": "AVP", "text": "Pros market leader, domain expertise, cutting edge Cons poor HR, poor compensation, slow / no redressal Advice to Management display consistency, take a stand", "rating": 5, "pros": "market leader, domain expertise, cutting edge", "cons": "poor HR, poor compensation, slow / no redressal", "advice": "display consistency, take a stand"}, {"title": "Telephone interviewer", "text": "Pros Flexible working, choose on a weekly basis which shifts to book for next week. Shifts range from 9am-9pm monday to friday and available 10-5.30pm on saturday and sunday. Only have to work minimum of three shifts a week (each shift is around 3.5 hours) Cons When the work load is low, it is becomes hard to be given shifts and can go weeks at a time with no shifts at all. Advice to Management To stop employing large quantities of staff when the workload is minimal, meeting long time workers were left with no shifts to make way to train new staff.", "rating": 5, "pros": "Flexible working, choose on a weekly basis which shifts to book for next week. Shifts range from 9am-9pm monday to friday and available 10-5.30pm on saturday and sunday.", "cons": "When the work load is low, it is becomes hard to be given shifts and can go weeks at a time with no shifts at all.", "advice": "To stop employing large quantities of staff when the workload is minimal, meeting long time workers were left with no shifts to make way to train new staff."}, {"title": "good company to work for", "text": "Pros learning environment,good culture,senior management helpful Cons salary not on time,working on weekend", "rating": 3, "pros": "learning environment,good culture,senior management helpful", "cons": "salary not on time,working on weekend", "advice": null}, {"title": "Senior Executive", "text": "Pros Flexible Dynamic working environment Challenging and wide knowledge exposure Cons Long working hour Compensation and package Advice to Management n/a", "rating": 5, "pros": "Flexible", "cons": "Long working hour", "advice": "n/a"}, {"title": "research", "text": "Pros nice people, nice office & cool environment. Cons quite many paper works. lack of interaction sometime Advice to Management more interaction between stakeholders would stimulate better biz", "rating": 5, "pros": "nice people, nice office & cool environment.", "cons": "quite many paper works. lack of interaction sometime", "advice": "more interaction between stakeholders would stimulate better biz"}, {"title": "field Interviewer", "text": "Pros No good points I can recall. Hated the job. Promised work discussed at initial training did not materialise. Management too distant Cons Poor supply of work. Weak management with little experience of actual interviewing. Low pay. Bonuses virtually impossible to earn. Questionnaires are poorly structured to the point of being ridiculous. Mention TNS on doorstep and public refused to take part because interviews were long and boring. Work all weathers, (trainer advised us to keep a supply of dry clothes in our vehicles in case we got caught in rain!) Advice to Management Understand that the management wouldn't need to exist without the door-to-door foot sloggers, and have more consideration to the needs of the interviewers. Be more available when interviewers need to contact managers. Don't just take days off and leave nobody to cover your area without telling the interviewers first", "rating": 1, "pros": "No good points I can recall. Hated the job. Promised work discussed at initial training did not materialise. Management too distant", "cons": "Poor supply of work. Weak management with little experience of actual interviewing. Low pay. Bonuses virtually impossible to earn. Questionnaires are poorly structured to the point of being ridiculous. Mention TNS on doorstep and public refused to take part because interviews were long and boring. Work all weathers, (trainer advised us to keep a supply of dry clothes in our vehicles in case we got caught in rain!)", "advice": "Understand that the management wouldn't need to exist without the door-to-door foot sloggers, and have more consideration to the needs of the interviewers. Be more available when interviewers need to contact managers. Don't just take days off and leave nobody to cover your area without telling the interviewers first"}, {"title": "TNS UK", "text": "Pros Great working environment, great people, interesting projects in a fast-paced working environment. I've learned so much already! Cons Some travel involved in the work, and at times work load and pace of work can be quite hectic. Advice to Management I haven't really worked there long enough to make an informed assessment of management, but I'm pretty happy with the management I've worked with so far.", "rating": 5, "pros": "Great working environment, great people, interesting projects in a fast-paced working environment. I've learned so much already!", "cons": "Some travel involved in the work, and at times work load and pace of work can be quite hectic.", "advice": "I haven't really worked there long enough to make an informed assessment of management, but I'm pretty happy with the management I've worked with so far."}, {"title": "Research consultant", "text": "Pros Great team, lovely people, willing to educate people from all backgrounds Cons Low pay, slow careerprogress. Focus on tennure rather that accomplishments for promotions. Advice to Management Reward people because they are good, not because they've already been working there xx years", "rating": 5, "pros": "Great team, lovely people, willing to educate people from all backgrounds", "cons": "Low pay, slow careerprogress. Focus on tennure rather that accomplishments for promotions.", "advice": "Reward people because they are good, not because they've already been working there xx years"}, {"title": "Worst working experience", "text": "Pros People you get connected and became friends with. Cons A lot of politics going around the office, disapproves highly of leadership team and work ethics from top management, directors and HR. Salary is below average norm within the region. Proposals are very costly hence losing a lot of business.", "rating": 1, "pros": "People you get connected and became friends with.", "cons": "A lot of politics going around the office, disapproves highly of leadership team and work ethics from top management, directors and HR. Salary is below average norm within the region. Proposals are very costly hence losing a lot of business.", "advice": null}, {"title": "Decent Job - If you're good", "text": "Pros Flexible shift work - cancel when you need to Chance to speak to a wide range of people over the phone Relatively social Bonus on some projects Cons Zero hour contract - can sometimes get no shifts, depending on performance etc. Barely above living wage Impersonal relationship with management - very much about targets, rather than the person Very restrictive work environment and atmosphere Only 30 min break in between most shifts Advice to Management Consider consulting interviewers more regarding decisions affecting them. Perhaps consider increasing pay.", "rating": 3, "pros": "Flexible shift work - cancel when you need to", "cons": "Zero hour contract - can sometimes get no shifts, depending on performance etc.", "advice": "Consider consulting interviewers more regarding decisions affecting them."}, {"title": "Great Culture", "text": "Pros Great people and a culture that is better than other agencies. Cons Access to senior management can be limited.", "rating": 5, "pros": "Great people and a culture that is better than other agencies.", "cons": "Access to senior management can be limited.", "advice": null}, {"title": "Worst Company I have ever worked for! Don't join!", "text": "Pros Fun loving culture. Other than that I can't think of anything good. Cons Very slow salary increase. Political environment. Employees who are good with their words will be recognized/appreciated as compared to employees who work hard. Advice to Management Open your eyes to see who are the real contributors.", "rating": 1, "pros": "Fun loving culture. Other than that I can't think of anything good.", "cons": "Very slow salary increase. Political environment. Employees who are good with their words will be recognized/appreciated as compared to employees who work hard.", "advice": "Open your eyes to see who are the real contributors."}, {"title": "Just awful", "text": "Pros The pay is not that bad Cons The management is so unprofessional, everyone gets shouted at for no reason, the interviews are very badly translated and they want the employees to stick to the script no matter how long, stupid and out of date it may be. they make no effort to make the interviews interesting and nice, or to at least update them, still the expect everyone to deliver Advice to Management take a chill pill dude", "rating": 1, "pros": "The pay is not that bad", "cons": "The management is so unprofessional, everyone gets shouted at for no reason, the interviews are very badly translated and they want the employees to stick to the script no matter how long, stupid and out of date it may be. they make no effort to make the interviews interesting and nice, or to at least update them, still the expect everyone to deliver", "advice": "take a chill pill dude"}, {"title": "Good place to start a career", "text": "Pros Great training (both classroom and on the job) for people just starting out in their careers. Many intelligent, helpful people to learn from and in some ways a fun place to work, with monthly drinks etc. Cons So much corporate bureaucracy - endless form-filling, unnecessary meetings and changing company strategies. Hours vary greatly between departments, with some very long hours due to high workloads. Internal office politics often seems to get in the way of the work. Advice to Management Let people get on with their jobs, and pay a better wage if you want to keep good staff.", "rating": 3, "pros": "Great training (both classroom and on the job) for people just starting out in their careers. Many intelligent, helpful people to learn from and in some ways a fun place to work, with monthly drinks etc.", "cons": "So much corporate bureaucracy - endless form-filling, unnecessary meetings and changing company strategies. Hours vary greatly between departments, with some very long hours due to high workloads. Internal office politics often seems to get in the way of the work.", "advice": "Let people get on with their jobs, and pay a better wage if you want to keep good staff."}, {"title": "Interviewer", "text": "Pros Early training was pretty good and support was there on a day to basis. Good job if you like the open air and don't mind what the weather is like. Cons Reward system means that you could end up spending 8 hours getting people to do interviews but not getting paid - or paid very little (below minimum wage). The result is that you could be driven to cut corners in interviews or falsify records. Company wrongly held back pay for several months running without discussing the reason and took a lot of time and investigation by myself to get the pay sent through. Each day required a lot of preparation taking time that was not paid. Communication about the daily work allocated was poor.", "rating": 3, "pros": "Early training was pretty good and support was there on a day to basis. Good job if you like the open air and don't mind what the weather is like.", "cons": "Reward system means that you could end up spending 8 hours getting people to do interviews but not getting paid - or paid very little (below minimum wage). The result is that you could be driven to cut corners in interviews or falsify records.", "advice": null}, {"title": "HRBS that is connected to people and business", "text": "Pros Good people central organization, young and dynamic culture Cons Challenging working environment with dynamic phase Advice to Management continue to connect with people in engagement", "rating": 5, "pros": "Good people central organization, young and dynamic culture", "cons": "Challenging working environment with dynamic phase", "advice": "continue to connect with people in engagement"}, {"title": "Nice place to be", "text": "Pros There are certainly a few good things at TNS in London: Friendly atmosphere, good people, flexible attitudes to work, good location Cons There's not a lot of technical know-how outside of dedicated IT teams. Management slow to recognise good work. Low pay. Ever changing company strategies and initiatives Advice to Management Stick to a philosophy", "rating": 3, "pros": "There are certainly a few good things at TNS in London: Friendly atmosphere, good people, flexible attitudes to work, good location", "cons": "There's not a lot of technical know-how outside of dedicated IT teams. Management slow to recognise good work. Low pay. Ever changing company strategies and initiatives", "advice": "Stick to a philosophy"}, {"title": "Project manager", "text": "Pros Fun, intellectual and building friendships among colleagues Cons Work load can really be too much so you need to be strategic Advice to Management making time to understand realities of the field", "rating": 3, "pros": "Fun, intellectual and building friendships among colleagues", "cons": "Work load can really be too much so you need to be strategic", "advice": "making time to understand realities of the field"}, {"title": "general", "text": "Pros They can let you work as full time employee even they hire you part time casual. They are well managed Cons increment is not good, needs to be more par with other ocmpanies", "rating": 5, "pros": "They can let you work as full time employee even they hire you part time casual. They are well managed", "cons": "increment is not good, needs to be more par with other ocmpanies", "advice": null}, {"title": "A good grounding into the business world", "text": "Pros Lots of variety Great atmosphere on the grad scheme Friday night end of month beers were great Similar people with similar outlooks on life. A great introduction into the agency world. Cons Not enough opportunity to get close to clients. Much of the work early in my TNS career was data crunching. Limited opportunities to progress after a while.", "rating": 5, "pros": "Lots of variety", "cons": "Not enough opportunity to get close to clients.", "advice": null}, {"title": "Good dynamic company", "text": "Pros invest greatly in people development, career progression and culture. Mkt leader with high acumen on engagement with clients Central of expertise in combining Research and Consultancy Great transparent culture that the community is dynamic, forward thinking and encourages innovative approach Cons High commitment towards deliverable and hence people tend to be focused and at times lack ability to mingle Advice to Management Continue to invest in people", "rating": 5, "pros": "invest greatly in people development, career progression and culture.", "cons": "High commitment towards deliverable and hence people tend to be focused and at times lack ability to mingle", "advice": "Continue to invest in people"}, {"title": "Terrible Work Culture", "text": "Pros Great proprietary tools Culture and initiatives of global company Cons Zero work-life balance Huge dissonance between salary and work load Wide Range of salary for same role Negligible benefits or perks Not enough training or support systems in place Resource crunch High attrition rate Advice to Management Indulging in employee benefits & work-life balance can go a long way in retaining employees", "rating": 1, "pros": "Great proprietary tools", "cons": "Zero work-life balance", "advice": "Indulging in employee benefits & work-life balance can go a long way in retaining employees"}, {"title": "TNS India", "text": "Pros Good proprietary tools e.g. TRI*M. Good company culture. Cons Career growth limited with less raise year on year.The analysis team has office at a different location,which is a trouble as you have to interact on telephone or mail.Low involvement of higher managers in client servicing.Lot of expectations from junior managers. Less training facilities for the regular customer satisfaction tools. Advice to Management Increase training on proprietary tools e.g. TRI*M. Should have an analysis team local or provide researchers tools to do their own data crunching", "rating": 3, "pros": "Good proprietary tools e.g. TRI*M. Good company culture.", "cons": "Career growth limited with less raise year on year.The analysis team has office at a different location,which is a trouble as you have to interact on telephone or mail.Low involvement of higher managers in client servicing.Lot of expectations from junior managers.", "advice": "Increase training on proprietary tools e.g. TRI*M. Should have an analysis team local or provide researchers tools to do their own data crunching"}, {"title": "Client Services Executive", "text": "Pros Great environment of fun-loving colleagues Company often organises events to rally colleagues together Cons Lack of support from senior management", "rating": 3, "pros": "Great environment of fun-loving colleagues", "cons": "Lack of support from senior management", "advice": null}, {"title": "Good opportunities to start a career", "text": "Pros There are Interesting projects and clients Cons Unclear and continuously changing strategy. Not a proper thought leader", "rating": 3, "pros": "There are Interesting projects and clients", "cons": "Unclear and continuously changing strategy. Not a proper thought leader", "advice": null}, {"title": "Company rating", "text": "Pros Nice people. Great location and offices. Cons Career opportunities. low retention of staff. Salaries. Lack of continuity in management.", "rating": 3, "pros": "Nice people. Great location and offices.", "cons": "Career opportunities. low retention of staff. Salaries. Lack of continuity in management.", "advice": null}, {"title": "Decent co to work", "text": "Pros Good company to work with Cons Managment should have more clarity on Future Plans", "rating": 3, "pros": "Good company to work with", "cons": "Managment should have more clarity on Future Plans", "advice": null}, {"title": "Research Executive at TNS", "text": "Pros Diverse client, dynamic projects, friendly and supportive team, collaboration is valued, junior employees are empowered, given responsibility and ownership of tasks. Cons It can have long hours and the workload is unbalanced and sometimes unpredictable. You work for a client and the client is the king, so sometimes you have to argue with unreasonable clients. Pay is not high for the level of stress and workload. Advice to Management Increase pay and provide better bonuses aligned to company and team performance. Limit number of projects people work on. Incentivise client development among employees, invest in innovations,", "rating": 3, "pros": "Diverse client, dynamic projects, friendly and supportive team, collaboration is valued, junior employees are empowered, given responsibility and ownership of tasks.", "cons": "It can have long hours and the workload is unbalanced and sometimes unpredictable. You work for a client and the client is the king, so sometimes you have to argue with unreasonable clients. Pay is not high for the level of stress and workload.", "advice": "Increase pay and provide better bonuses aligned to company and team performance. Limit number of projects people work on. Incentivise client development among employees, invest in innovations,"}, {"title": "GOOD", "text": "Pros Team work and targets achieved gives a nice experience Cons salaries are not as expected Advice to Management NA", "rating": 3, "pros": "Team work and targets achieved gives a nice experience", "cons": "salaries are not as expected", "advice": "NA"}, {"title": "Research Manager", "text": "Pros Reasonably interesting work but often can be pointless as company has not kept itself up to date and invested in modernisation. Cons Really poor salary and not sure whether it provides the right level of career development Advice to Management Increase salary and provide performance bonuses", "rating": 3, "pros": "Reasonably interesting work but often can be pointless as company has not kept itself up to date and invested in modernisation.", "cons": "Really poor salary and not sure whether it provides the right level of career development", "advice": "Increase salary and provide performance bonuses"}, {"title": "Good for location, bad work-life balance", "text": "Pros Good mix of interesting clients and great location in More London Place (consumer team). People who work there (apart from directors) are generally good at their jobs and eager to share knowledge as well as have a drink or two outside work Cons Directors in particular do not care about people there and often under price jobs to get a contract and then expect middle/junior members of the team to work many extra hours for free to make up for this. This leads ot terrible work-life balance and little opportunity for advancement. Often any promotion will not be given to those that deserve them at all. Mainly young guys who haven't done the work to deserve them. Surprisingly sexist organisation. Advice to Management Review your equal opportunities framework with middle and junior staff and actually take the feedback on board. Look at the high turnover of this staff and take exit interview feedback to improve the business. Your revenue/profit would benefit from happier/less sleep deprived employees", "rating": 3, "pros": "Good mix of interesting clients and great location in More London Place (consumer team). People who work there (apart from directors) are generally good at their jobs and eager to share knowledge as well as have a drink or two outside work", "cons": "Directors in particular do not care about people there and often under price jobs to get a contract and then expect middle/junior members of the team to work many extra hours for free to make up for this. This leads ot terrible work-life balance and little opportunity for advancement. Often any promotion will not be given to those that deserve them at all. Mainly young guys who haven't done the work to deserve them. Surprisingly sexist organisation.", "advice": "Review your equal opportunities framework with middle and junior staff and actually take the feedback on board. Look at the high turnover of this staff and take exit interview feedback to improve the business. Your revenue/profit would benefit from happier/less sleep deprived employees"}, {"title": "Great for autonomy and a challenge, poor culture and treatment of staff", "text": "Pros access to high profile clients and projects, autonomy to take on challenges and push yourself (though the extent you are supported is dependent on rare, good line managers), Cons Staff are cogs in a money making machine and not supported, project teams of one or two internal staff with an army of freelancers is common, contract says 35 hours and reality is a sustained 45 hours Advice to Management sort out how you staff projects, pay better, create a collaborative and team-based culture, acknowledge staff for achievements", "rating": 3, "pros": "access to high profile clients and projects, autonomy to take on challenges and push yourself (though the extent you are supported is dependent on rare, good line managers),", "cons": "Staff are cogs in a money making machine and not supported, project teams of one or two internal staff with an army of freelancers is common, contract says 35 hours and reality is a sustained 45 hours", "advice": "sort out how you staff projects, pay better, create a collaborative and team-based culture, acknowledge staff for achievements"}, {"title": "Great place to learn research", "text": "Pros A good place to learn research and work with major account Cons Very slow career when it comes to small market Advice to Management retain brilliant people", "rating": 5, "pros": "A good place to learn research and work with major account", "cons": "Very slow career when it comes to small market", "advice": "retain brilliant people"}, {"title": "Good place to work", "text": "Pros Truly global. But glad I left when I did. Cons Still learning to work in matrix. Advice to Management Communicate more and stabilise the senior management.", "rating": 5, "pros": "Truly global. But glad I left when I did.", "cons": "Still learning to work in matrix.", "advice": "Communicate more and stabilise the senior management."}, {"title": "Good company", "text": "Pros Very relaxed atmosphere, nice people Cons It is very relaxed and a little bit slow, finances aren't great. Feels a bit like a slow death. Low pay Advice to Management Innovate. Get rid of coasting staff, set tougher targets", "rating": 3, "pros": "Very relaxed atmosphere, nice people", "cons": "It is very relaxed and a little bit slow, finances aren't great. Feels a bit like a slow death. Low pay", "advice": "Innovate. Get rid of coasting staff, set tougher targets"}, {"title": "No Culture", "text": "Pros Gains exposure to large company, within a even larger group - WPP Cons Lack of culture, the office felt dead, teams were in silos, over administration as being part of WPP, company did not seem to have any positive forward directon Advice to Management Work at improving culture and communication, group should be spearheading the groups direction, not simply reacting to it", "rating": 3, "pros": "Gains exposure to large company, within a even larger group - WPP", "cons": "Lack of culture, the office felt dead, teams were in silos, over administration as being part of WPP, company did not seem to have any positive forward directon", "advice": "Work at improving culture and communication, group should be spearheading the groups direction, not simply reacting to it"}, {"title": "Market research intern", "text": "Pros Get to learn a lot when you are really interested din Market research. People are welcoming. Cons If you do not have any interest in market research, the work is really tedious and boring.", "rating": 3, "pros": "Get to learn a lot when you are really interested din Market research. People are welcoming.", "cons": "If you do not have any interest in market research, the work is really tedious and boring.", "advice": null}, {"title": "TNS UK Ltd, London", "text": "Pros Camaraderie and teamwork is good Cons Hours can be long amongst juniors and middle management, and go unrecognised. Frequent leadership and vision changes.", "rating": 3, "pros": "Camaraderie and teamwork is good", "cons": "Hours can be long amongst juniors and middle management, and go unrecognised.", "advice": null}, {"title": "Waste of potential", "text": "Pros -Free hot chocolate -training provided -student friendly environment -pay is good for students Cons -The hot chocolate tastes like dirt -your training \"WILL NOT\" prepare you for the job,operating systems and how draining your job will be. -micromanagement on every detail of your work, from the pace of your speech,to the length of your toilet breaks, you are constantly monitored and treated as a number/value not a human being. -management,will look down on you as though you are worthless and will give you little respect, as again you are a number/value not a human being. -0 hour contract leaves very little ability to plan your week and form commitments due to the inability to know your shifts until a week in advance,sometimes giving you 2 days notice of your next shift. -during \"flash\" surveys,in which a company needs an agreed amount of completed surveys, you are given very high strike rates to achieve and if you are not achieving your strike rates you will be penalised on the spot, being asked to \"beg\" was an instruction given to improve it. -the atmosphere is bleak,there is a lack of enthusiasm and to be brutally honest it feels like a place where potential comes to die. Advice to Management Managers need to start to respect your employees,you have targets to meet that's understandable, but your employees are the only way you get those targets,they're not just values or numbers on a page,they're human. With all due respect it is a call centre,you are not a ceo, nor in a position of any real power to anyone in the outside world.Your job is irrelevant without the employees in a position below you so don't treat them like they're scum beneath you.", "rating": 3, "pros": "-Free hot chocolate", "cons": "-The hot chocolate tastes like dirt", "advice": "Managers need to start to respect your employees,you have targets to meet that's understandable, but your employees are the only way you get those targets,they're not just values or numbers on a page,they're human."}, {"title": "TNS", "text": "Pros Offers a good work/life balance Cons Maybe a lack of growth opportunities", "rating": 3, "pros": "Offers a good work/life balance", "cons": "Maybe a lack of growth opportunities", "advice": null}, {"title": "Research Executive", "text": "Pros Work culture, senior management, team work Cons Salaries are below than market standards", "rating": 3, "pros": "Work culture, senior management, team work", "cons": "Salaries are below than market standards", "advice": null}, {"title": "They have the best Qualitative researchers", "text": "Pros You will have the best mentors. Teams support each other and there is a great opportunity for career advancement. Cons They don't offer competitive salary but they compensate it with great health benefits. Despite that, you can get the great learnings and work experience. Advice to Management Continue on acknowledging the hard work of your employees.", "rating": 5, "pros": "You will have the best mentors. Teams support each other and there is a great opportunity for career advancement.", "cons": "They don't offer competitive salary but they compensate it with great health benefits. Despite that, you can get the great learnings and work experience.", "advice": "Continue on acknowledging the hard work of your employees."}, {"title": "TNS Melbourne", "text": "Pros One of the biggest players in the market; some really good people and managers. No/not much politics. Work life balance is good for some, depending on the team/manager. Cons Low pay; poor career progression; no love from the management; hard work are not paid off; would avoid working here, although I heard other offices could be very different so may still worth a try. Advice to Management Review performance management, salary levels and benefits so your employees actually feel happy working here.", "rating": 3, "pros": "One of the biggest players in the market; some really good people and managers. No/not much politics. Work life balance is good for some, depending on the team/manager.", "cons": "Low pay; poor career progression; no love from the management; hard work are not paid off; would avoid working here, although I heard other offices could be very different so may still worth a try.", "advice": "Review performance management, salary levels and benefits so your employees actually feel happy working here."}, {"title": "They are preparing to improve but I was there during the changes, I saw a bad phase.", "text": "Pros Really friendly bunch of people, relaxed atmosphere, nice location and there are some enjoyable bits to each role as well. Nice clients too. Good opportunities to work with international clients and large corporate clients. New management and CEO are very good! Monthly drinks in the office towards the end of the month. Cons Work/Life balance can be bad due to lots of small bits requiring attention. The time taken to do all these small bits, that would be difficult to pass onto someone else, means late evenings are a regular. Working there feels like being in a hamster wheel - lots of work and no significant achievement Progression is weak and difficult. Excellent work is not recognised. Market Research isn't the most rewarding of sectors either financially or in a \"feel good\" sense. A lot of corporate rubbish and debates about small things waste a lot of time. Management often feel like they are only talking to other directors in meetings. Lower ranked employees struggle to find relevance in the discussions. Employees don't feel positive about the company in general. Advice to Management You have a seriously good core employee base. Work on making employees as a whole feel how valued they are and help the lower employees to branch out so they can actually express themselves and show their abilities.", "rating": 3, "pros": "Really friendly bunch of people, relaxed atmosphere, nice location and there are some enjoyable bits to each role as well. Nice clients too.", "cons": "Work/Life balance can be bad due to lots of small bits requiring attention. The time taken to do all these small bits, that would be difficult to pass onto someone else, means late evenings are a regular.", "advice": "You have a seriously good core employee base. Work on making employees as a whole feel how valued they are and help the lower employees to branch out so they can actually express themselves and show their abilities."}, {"title": "Fun work, slow growth", "text": "Pros Very fun work, dynamic, across industries - the organization is fairly flat and you get ample opportunities to grow, present your work, manage client relationships and experiment with the field of research Cons Extremely slow growth, with lax HR systems - appraisals get delayed by more than 6 months, no rewards and recognition policies, low increments Advice to Management Put in place systems to keep employees happy and help them feel rewarded at work, high attrition and low motivation levels are a result of this lack of career growth and sense of achievement", "rating": 3, "pros": "Very fun work, dynamic, across industries - the organization is fairly flat and you get ample opportunities to grow, present your work, manage client relationships and experiment with the field of research", "cons": "Extremely slow growth, with lax HR systems - appraisals get delayed by more than 6 months, no rewards and recognition policies, low increments", "advice": "Put in place systems to keep employees happy and help them feel rewarded at work, high attrition and low motivation levels are a result of this lack of career growth and sense of achievement"}, {"title": "Field Officer Quality Assurance, Eastern Uganda (Teso, Lango & Karamoja Sub-Regions)", "text": "Pros TNS Global is a multi-cultural Co. employing people from all corners of the country. It also provides good working environment and exposes young researchers to the real research activity in the different rural and urban areas. it also employs at some occasions electronic data collection systems like PDAs among others Cons TNS global Uganda is a good Company however it experiences challenges caused by power struggles, poor training sessions before researchers begin real field activity, inadequate facilitation for field workers (this is biggest challenge affecting most of us who do work in remote parts of the country, they tend to calculate our transport fairs like for those in urban/central which is too wrong and ends affecting us) Advice to Management I have always advised the management to provide proper training to interviewer/ researcher for every new project that comes in to ease our work as QCs/ Quality control Officers. they also need to allocate enough facilitation to upcountry researchers who keep running short of transport due to high transport cost in rural areas.", "rating": 5, "pros": "TNS Global is a multi-cultural Co. employing people from all corners of the country. It also provides good working environment and exposes young researchers to the real research activity in the different rural and urban areas. it also employs at some occasions electronic data collection systems like PDAs among others", "cons": "TNS global Uganda is a good Company however it experiences challenges caused by power struggles, poor training sessions before researchers begin real field activity, inadequate facilitation for field workers (this is biggest challenge affecting most of us who do work in remote parts of the country, they tend to calculate our transport fairs like for those in urban/central which is too wrong and ends affecting us)", "advice": "I have always advised the management to provide proper training to interviewer/ researcher for every new project that comes in to ease our work as QCs/ Quality control Officers. they also need to allocate enough facilitation to upcountry researchers who keep running short of transport due to high transport cost in rural areas."}, {"title": "Project Service", "text": "Pros Excellent company to work for, good for fresh graduates - young team - culture diversity - thorough onboarding programs and frequent meetings to empower staff - open culture - work hard and play hard - clear career path Cons - frequent changes in top management - salary growth is slow - work long hours Advice to Management improve staff benefits", "rating": 5, "pros": "Excellent company to work for, good for fresh graduates", "cons": "- frequent changes in top management", "advice": "improve staff benefits"}, {"title": "The culture is good", "text": "Pros it is very flexible, you can do what you like to do, and also it will increase your efficiency Cons so far so good and sometimes you have to talk with other people in different department Advice to Management so far i feel it is more turn over due to some reasons, maybe salary issue", "rating": 5, "pros": "it is very flexible, you can do what you like to do, and also it will increase your efficiency", "cons": "so far so good and sometimes you have to talk with other people in different department", "advice": "so far i feel it is more turn over due to some reasons, maybe salary issue"}, {"title": "TNS", "text": "Pros Flexible week to week due to zero hour contract Simple, easy work once trained Cons Zero hours contract No free parking Advice to Management A lot of college students work for TNS which in my opinion leads to a slightly patronising nature from the management towards employees.", "rating": 3, "pros": "Flexible week to week due to zero hour contract", "cons": "Zero hours contract", "advice": "A lot of college students work for TNS which in my opinion leads to a slightly patronising nature from the management towards employees."}]