[{"title": "Great concept, hope it works out", "text": "Pros The idea of multiple international phone numbers Cons Close minded leadership to US standards. Corporate America does not run on T-Mobile Advice to Management Build new relationships with other providers Be honest about the service provided in the US", "rating": 3, "pros": "The idea of multiple international phone numbers", "cons": "Close minded leadership to US standards.", "advice": "Build new relationships with other providers"}, {"title": "Don't bother, you'll eventually be \"downsized\".", "text": "Pros Compelling technologies and service offerings. Cons N Y Client Services has too much control and does not collaborate effectively. Advice to Management Pay commission.", "rating": 1, "pros": "Compelling technologies and service offerings.", "cons": "N Y Client Services has too much control and does not collaborate effectively.", "advice": "Pay commission."}, {"title": "A shame, really", "text": "Pros Family type atmosphere Excited CEO (at the time) A feeling we were doing something different, industry changing Cons Lots of VC money Poor management of where VC spent Annual mass layoffs - don't let them fool you into thinking it wont happen again, its happened 3 times in 3 years. Advice to Management Should make a focused effort to be acquired, once and for all.", "rating": 3, "pros": "Family type atmosphere", "cons": "Lots of VC money", "advice": "Should make a focused effort to be acquired, once and for all."}, {"title": "Good product and people, poor", "text": "Pros The technology and concept is great and they are very flexible and care about their employees. Cons There have been poor business decisions made that have lead to its current state.", "rating": 3, "pros": "The technology and concept is great and they are very flexible and care about their employees.", "cons": "There have been poor business decisions made that have lead to its current state.", "advice": null}, {"title": "Too many changes", "text": "Pros Good benefits, good pay, great people Cons Too many changes at the top level, they can't make up their mind or stick to a gameplan so results suffer and then layoffs happen.", "rating": 5, "pros": "Good benefits, good pay, great people", "cons": "Too many changes at the top level, they can't make up their mind or stick to a gameplan so results suffer and then layoffs happen.", "advice": null}, {"title": "Great Product, Management is non existent...", "text": "Pros Fantastic product, great brand once it gets established, huge opportunities and potential to be a global solution. Relaxed culture and atmosphere. Cons Operations are clueless, minimal training offered, average salary, sales are non existent. It has been a downward slope over the last 2-3 years. Advice to Management Make a decision on the the vision of the company - For too long the company has 'floated' along with no real success", "rating": 3, "pros": "Fantastic product, great brand once it gets established, huge opportunities and potential to be a global solution. Relaxed culture and atmosphere.", "cons": "Operations are clueless, minimal training offered, average salary, sales are non existent. It has been a downward slope over the last 2-3 years.", "advice": "Make a decision on the the vision of the company - For too long the company has 'floated' along with no real success"}, {"title": "Great product needing better market execution", "text": "Pros Product concepts are very marketable with significant benefits to anyone that regularly communicates with others in certain \"local\" countries and/or extensive global travelers. Cons Sales, marketing, and fulfillment practices Advice to Management see above", "rating": 3, "pros": "Product concepts are very marketable with significant benefits to anyone that regularly communicates with others in certain \"local\" countries and/or extensive global travelers.", "cons": "Sales, marketing, and fulfillment practices", "advice": "see above"}, {"title": "Awesome Place To Work", "text": "Pros Cutting-edge technology and start up culture is great Cons Sales climate is tough because target customer has a deep relationship with larger providers", "rating": 5, "pros": "Cutting-edge technology and start up culture is great", "cons": "Sales climate is tough because target customer has a deep relationship with larger providers", "advice": null}, {"title": "What a mess.", "text": "Pros Global company, great benefits, dedicated employees. Cons Management is clueless, product offerings useless in US. Advice to Management Sell patents to Google.", "rating": 1, "pros": "Global company, great benefits, dedicated employees.", "cons": "Management is clueless, product offerings useless in US.", "advice": "Sell patents to Google."}, {"title": "Great Product, Internally needs help.", "text": "Pros Great product Roaming cost will drop Cons Internally, the company was focused on the wrong things instead of trying to improve there current service.", "rating": 3, "pros": "Great product", "cons": "Internally, the company was focused on the wrong things instead of trying to improve there current service.", "advice": null}, {"title": "Director", "text": "Pros Advanced and timely technology solution for the global mobile/cellular industry. Offers tremendous feature/benefit opportunity Cons Corporate edict was a powerful message that all companies should adopt. However very seldom followed by executive committee and middle management Advice to Management Listen to your field representatives, sales and business partners.", "rating": 1, "pros": "Advanced and timely technology solution for the global mobile/cellular industry. Offers tremendous feature/benefit opportunity", "cons": "Corporate edict was a powerful message that all companies should adopt.", "advice": "Listen to your field representatives, sales and business partners."}, {"title": "Sales Couldn", "text": "Pros Sales delivered innovative opportunities to management. Cons Analysts had no clue what was and wasn't profitable pricing...killed every deal brought to management Advice to Management Listen to advice", "rating": 1, "pros": "Sales delivered innovative opportunities to management.", "cons": "Analysts had no clue what was and wasn't profitable pricing...killed every deal brought to management", "advice": "Listen to advice"}, {"title": "Company has no leadership and does not understand the marketplace", "text": "Pros Working on leading edge technology Cons Never utilize leading edge technology Advice to Management Get a better understanding of the markets you are entering, so you want have to make massive layoffs in the future.", "rating": 1, "pros": "Working on leading edge technology", "cons": "Never utilize leading edge technology", "advice": "Get a better understanding of the markets you are entering, so you want have to make massive layoffs in the future."}, {"title": "Well intended product with questionable US execution", "text": "Pros Innovative product and offering - supportive executive team in the UK - responsive to employee input and feedback. The founder is a brilliant man and makes you want to root for the companies success. Cons Poor approach to the US market. Some product shortcomings which seem to stem from T-Mobile dependency in the US. Advice to Management Take a more methodical approach and be realistic in timelines for achievement. The US is a large geography and Truphone is playing into a very small segment of users. Virtual coverage can be much more efficient than physical offices. Take a deep breath and go win business instead of trying to manufacture a business out of physical presence and aggressive employee population growth.", "rating": 3, "pros": "Innovative product and offering - supportive executive team in the UK - responsive to employee input and feedback. The founder is a brilliant man and makes you want to root for the companies success.", "cons": "Poor approach to the US market. Some product shortcomings which seem to stem from T-Mobile dependency in the US.", "advice": "Take a more methodical approach and be realistic in timelines for achievement. The US is a large geography and Truphone is playing into a very small segment of users. Virtual coverage can be much more efficient than physical offices. Take a deep breath and go win business instead of trying to manufacture a business out of physical presence and aggressive employee population growth."}, {"title": "Great company with unique product offering", "text": "Pros Awesome company. Refreshing environment. Everyone is respectful to each other. Cool CEO is very engaged wnd cares about his employees. Loved working at this company. Cons Long budget approval process restricts workflow. Cumbersome PO approval process. Too many financial spend obstacles in place even after budget approval was received. Company doesnt offer tuition reimbursement or career advancement training at this time. Personnel issues not addressed by HR. Advice to Management Reduce the budgetary approval process and financial spend restrictions. Keep employees informed of board/investor input and concerns more prosctively. Address HR issues and grievances. Offer career advancement training reimbursement.", "rating": 5, "pros": "Awesome company. Refreshing environment. Everyone is respectful to each other. Cool CEO is very engaged wnd cares about his employees. Loved working at this company.", "cons": "Long budget approval process restricts workflow. Cumbersome PO approval process. Too many financial spend obstacles in place even after budget approval was received. Company doesnt offer tuition reimbursement or career advancement training at this time. Personnel issues not addressed by HR.", "advice": "Reduce the budgetary approval process and financial spend restrictions. Keep employees informed of board/investor input and concerns more prosctively. Address HR issues and grievances. Offer career advancement training reimbursement."}, {"title": "inside sale executive", "text": "Pros Great company to work with Cons The US is a tougher market than Europe", "rating": 5, "pros": "Great company to work with", "cons": "The US is a tougher market than Europe", "advice": null}, {"title": "Leadership thinks this product is a must have for companies to conduct business when in truth it is a novel idea at best.", "text": "Pros Very few PROS to share. No real pros from my position as a Account Manager 401k Benefits Travel Opportunities Cons 1) Pay there was no consistent pay scale 2) Used second rate cellular network in the US 3) Management EXTREMELY OVER CONFIDENT with only 1 product offering. 4) Leadership has restructured 3 years in a row that led to layoffs. Advice to Management Sell intellectual property.", "rating": 3, "pros": "Very few PROS to share. No real pros from my position as a Account Manager", "cons": "1) Pay there was no consistent pay scale", "advice": "Sell intellectual property."}, {"title": "No future in the US!", "text": "Pros Truphone offers a wonderful benefits package, excellent 401k, and employee recognition awards/gifts. Cons Truphone is unstable and will most like shutdown the US locations due to improper handling of their financials. Advice to Management The management team can be segregated towards non management. I have felt not welcomed or left out in some company gatherings.", "rating": 3, "pros": "Truphone offers a wonderful benefits package, excellent 401k, and employee recognition awards/gifts.", "cons": "Truphone is unstable and will most like shutdown the US locations due to improper handling of their financials.", "advice": "The management team can be segregated towards non management. I have felt not welcomed or left out in some company gatherings."}, {"title": "Excellent, hard working team hampered by incompetent leadership", "text": "Pros Benefits were good, pay was good, work environment was good. The team as a whole were excellent folks - people you'd love to work with. Cons Leadership had no clue. often resorted to insults and expletives as standard operating procedure (aka Motivation). Mass hiring in mid 2014 was not thought out, and as a result, layoffs and closing of US offices by end of year 2014. No \"lead from the front\" leaders here. Just yes-men anxious to cash out when this company sells. Advice to Management Listen to your team, don't hire dozens of people without a real plan. Mass hirings and then layoffs within 6 months is inexcusable.", "rating": 1, "pros": "Benefits were good, pay was good, work environment was good. The team as a whole were excellent folks - people you'd love to work with.", "cons": "Leadership had no clue. often resorted to insults and expletives as standard operating procedure (aka Motivation). Mass hiring in mid 2014 was not thought out, and as a result, layoffs and closing of US offices by end of year 2014. No \"lead from the front\" leaders here. Just yes-men anxious to cash out when this company sells.", "advice": "Listen to your team, don't hire dozens of people without a real plan. Mass hirings and then layoffs within 6 months is inexcusable."}, {"title": "Good concept, not well organized. Unable to deliver on promises.", "text": "Pros phone with multiple international phone numbers low cost insurance reasonable vacation days Cons low pay unclear vision must work in office", "rating": 3, "pros": "phone with multiple international phone numbers", "cons": "low pay", "advice": null}, {"title": "Bad Experience", "text": "Pros Company is currently restructuring, would not consider any opportunity offered Cons Lack of accountability, leadership from CEO down is poor Advice to Management Stop letting the UK HQ determine what is best for the US market.", "rating": 1, "pros": "Company is currently restructuring, would not consider any opportunity offered", "cons": "Lack of accountability, leadership from CEO down is poor", "advice": "Stop letting the UK HQ determine what is best for the US market."}, {"title": "Lots of ups and downs", "text": "Pros lots to learn due to (unintentional) start-up style management, great team Cons bad management, extra work is not rewarded accordingly", "rating": 3, "pros": "lots to learn due to (unintentional) start-up style management, great team", "cons": "bad management, extra work is not rewarded accordingly", "advice": null}, {"title": "Team Leader", "text": "Pros Good people and very colaborative Cons They are more worried about being \"politically correct\" then getting the actual job done, they seem on occasion to still being in a dream world, they are in to much of a financial trouble to afford that luxury. Advice to Management Mature... a lot.... before you sink...", "rating": 3, "pros": "Good people and very colaborative", "cons": "They are more worried about being \"politically correct\" then getting the actual job done, they seem on occasion to still being in a dream world, they are in to much of a financial trouble to afford that luxury.", "advice": "Mature... a lot.... before you sink..."}, {"title": "Cool start-up", "text": "Pros Innovative, very cool USP Cons Clueless management, no clear strategy", "rating": 3, "pros": "Innovative, very cool USP", "cons": "Clueless management, no clear strategy", "advice": null}, {"title": "Moving forward", "text": "Pros Positive and energetic office environment. Great time to be with Truphone, with the balance sheet restructure and brilliant products, very bright future ahead. Cons No team building or training out of the office", "rating": 5, "pros": "Positive and energetic office environment.", "cons": "No team building or training out of the office", "advice": null}, {"title": "An exciting time to be here", "text": "Pros I joined when the company was going through a restructuring and and a fair amount of changes. However it's been nothing but positive for me since the get go and it's a genuinely exciting time to be a part of this team. Great people. Great location. A relaxed but driven work culture. They're relaxed about what time you arrive/leave, just as long as you get the job done. Exactly the way it should be. Most importantly, everyone seems really driven to see this company succeed. Cons The last two companies I worked for supplied beers in the office on Friday afternoon. This is something severely lacking here. Advice to Management Keep moving in this positive direction. So far so good. But seriously, beers on a Friday would be super.", "rating": 5, "pros": "I joined when the company was going through a restructuring and and a fair amount of changes. However it's been nothing but positive for me since the get go and it's a genuinely exciting time to be a part of this team.", "cons": "The last two companies I worked for supplied beers in the office on Friday afternoon. This is something severely lacking here.", "advice": "Keep moving in this positive direction. So far so good."}, {"title": "Proud to be part of such an innovative company", "text": "Pros Innovative culture Great people Appetite to disrupt the global connectivity ecosystem Supportive investors Ambitious CEO Huge investment in technology Big brand partners (Apple) & customers (Netflix, Tesla) London-headquartered global organisation Cons In the biggest time of transition in Truphone, our biggest challenge is lack of time... We have very ambitious plans in: Mobile Recording (a no-brainer product for financial services to comply with MiFID II regulation) B2B enterprise and consumer SIMs through our seamless global network Powering Apple iPads with eSIMs to enable customers to be local when travelling Own IoT platform that is already shaking up the connected car industry Advice to Management I'm part of management. We're focused on delivering excellent solutions for customers across our product portfolio, whilst continuing to invest in future-proofing pur business in new areas. Exciting times!", "rating": 5, "pros": "Innovative culture", "cons": "In the biggest time of transition in Truphone, our biggest challenge is lack of time... We have very ambitious plans in:", "advice": "I'm part of management. We're focused on delivering excellent solutions for customers across our product portfolio, whilst continuing to invest in future-proofing pur business in new areas."}, {"title": "Don't be fooled by the spin.", "text": "Pros Very hard to fulfill a twenty word minimum when I cannot recall a single pro except for the hardworking staff Cons Oldest startup in the world Millions of dollars wasted. Warning to employees - don't trust, watch your back, mass recruiting followed by mass redundancy is the Truphone mode of operation. Advice to Management Stop lying", "rating": 1, "pros": "Very hard to fulfill a twenty word minimum when I cannot recall a single pro except for the hardworking staff", "cons": "Oldest startup in the world", "advice": "Stop lying"}, {"title": "Nice people trying their hardest, despite management", "text": "Pros Some loyal staff working really hard to keep things going. Some really nice services that customers love and a great vision for the future. Cons Very administrative, hierarchical micro-management. Somehow combined with a lack of direction or consistency. Awful CEO who depresses those who really care about customers. Advice to Management Sack the CEO. He is incredibly arrogant, dismissive to staff and totally divorced from the realities of service levels to customers.", "rating": 3, "pros": "Some loyal staff working really hard to keep things going. Some really nice services that customers love and a great vision for the future.", "cons": "Very administrative, hierarchical micro-management. Somehow combined with a lack of direction or consistency. Awful CEO who depresses those who really care about customers.", "advice": "Sack the CEO. He is incredibly arrogant, dismissive to staff and totally divorced from the realities of service levels to customers."}, {"title": "Great place to work!", "text": "Pros Great Product that I have ever come across for Business users Cons Can not think of any at the moment", "rating": 5, "pros": "Great Product that I have ever come across for Business users", "cons": "Can not think of any at the moment", "advice": null}, {"title": "Avoid. Sinking Ship. Unsave Job.", "text": "Pros -Nice Location -Great People (who left) -Free Coffee -Good entry job Cons -3 redundancies in 3 year - was participating in the last annual business meeting. Management does misinterpret the customers especially in the growing markets where they want to grow -My daily work is mainly to terminate accounts and call upset customers, because the products are not working reliable. -Know how left the company - Introducing in the middle of the reorganisation new products - Sometimes its just about ripping off the customers with charges for which they are not covered with a complicated product. -Measuring for how long you are on \"Comfort Break\", which means toilet times or grabing a coffee. -Treating former employees like s*it -Global company, which causes that no one knows what the others are doing. Advice to Management Retire, you made your money. Young people who studied and want to make career are using this job as entry. They are getting soon disillusioned and leave, while others with less skills stay and getting promoted. They are agreeing and implement every poor management decision. These managers are also treating their employees hard and have not the required skills to lead a team. Promote the right people!", "rating": 1, "pros": "-Nice Location", "cons": "-3 redundancies in 3 year", "advice": "Retire, you made your money. Young people who studied and want to make career are using this job as entry. They are getting soon disillusioned and leave, while others with less skills stay and getting promoted. They are agreeing and implement every poor management decision. These managers are also treating their employees hard and have not the required skills to lead a team. Promote the right people!"}, {"title": "Lots of potential", "text": "Pros Great products and services. Friendly colleagues and a relaxed office environment. The new leadership team has the ability to turn it into a success. Cons A challenging past with lots of difficult changes has left some people feeling disillusioned and there are pockets of negativity. Advice to Management Provide clear communication about what's needed to be successful. Inspire your teams!", "rating": 3, "pros": "Great products and services. Friendly colleagues and a relaxed office environment. The new leadership team has the ability to turn it into a success.", "cons": "A challenging past with lots of difficult changes has left some people feeling disillusioned and there are pockets of negativity.", "advice": "Provide clear communication about what's needed to be successful. Inspire your teams!"}, {"title": "A lightbulb that shone too brightly", "text": "Pros Lovely people, great views, games room, option to work from home if you are laptop based. Some trickles of the old culture that brought people spirits up and did a better job of hiding the inconvient truth. Cons 3 restructures involving redundancies, almost in a timely annual roll over. Exec, CEO and HR doesn't care about people, in fact, they BLAMED it's people (attrition) for the last one. They also made us sit down for an hour listening to how good 2016 was before moving on to the next reorg annoucement. HR as a function is distant. If you raise concerns with Truphone's prized projects, you are shut down or put in the front firing line on the next lay off season. You are given more responsibilities than what your original job spec (and poor salary) detail. Most of the higher ups are marketing dreamers with no clue about the actual market. There's a serious disconnect between management and the peons. Advice to Management This is not a cost saving exercise. Sometimes you need to refresh the management. Do the right thing and finish the job!", "rating": 1, "pros": "Lovely people, great views, games room, option to work from home if you are laptop based. Some trickles of the old culture that brought people spirits up and did a better job of hiding the inconvient truth.", "cons": "3 restructures involving redundancies, almost in a timely annual roll over. Exec, CEO and HR doesn't care about people, in fact, they BLAMED it's people (attrition) for the last one. They also made us sit down for an hour listening to how good 2016 was before moving on to the next reorg annoucement.", "advice": "This is not a cost saving exercise. Sometimes you need to refresh the management. Do the right thing and finish the job!"}, {"title": "Avoid, avoid, avoid....", "text": "Pros Nice office, some lovely colleagues, decent pay package (although that is likely to change given all the recent changes) Cons No strategic direction what so ever, most of the executive team are clueless, and a product portfolio which is becoming more and more irrelevant Advice to Management I'd change it to \"advice to the investors\": appoint a CEO with genuine ambition, business nous and people skills. Not just another BT dinosaur with no real merit please...", "rating": 1, "pros": "Nice office, some lovely colleagues, decent pay package (although that is likely to change given all the recent changes)", "cons": "No strategic direction what so ever, most of the executive team are clueless, and a product portfolio which is becoming more and more irrelevant", "advice": "I'd change it to \"advice to the investors\": appoint a CEO with genuine ambition, business nous and people skills. Not just another BT dinosaur with no real merit please..."}, {"title": "good people bad choices", "text": "Pros great bunch of people to work with. fun as well Cons upper management making to many bad choices. yearly redundancy Advice to Management keep people, keep knowledge and experience. grow the company and stop looking for short term gains at the cost of staff.", "rating": 3, "pros": "great bunch of people to work with. fun as well", "cons": "upper management making to many bad choices. yearly redundancy", "advice": "keep people, keep knowledge and experience. grow the company and stop looking for short term gains at the cost of staff."}, {"title": "Headless Chicken", "text": "Pros Nice office Kind people to work with Fun place to work Cons No development opportunities Poor communication from Management Average of one Redundancy per year Extremely difficult to grow within the company Some decision seems to be made with out thinking Advice to Management Look more after your people Be more open and communicative", "rating": 3, "pros": "Nice office", "cons": "No development opportunities", "advice": "Look more after your people"}, {"title": "Just Terrible", "text": "Pros Nice office A wonderful study in how to waste hundreds of millions of pounds Some nice people Nothing else that comes to mind Cons CEO HR Proposition is a fantastic answer to questions that people don't ask. The MNOs have all the answers and Truphone is irrelevant. Advice to Management Give up", "rating": 1, "pros": "Nice office", "cons": "CEO", "advice": "Give up"}, {"title": "Cronies at the top, no trust", "text": "Pros A working mutli IMSI SIM with no limits is unique and very impressive but it's been made irrelevant through tariffing by the main operators. The big guys also hold the key because Truphone are so dependent on them for their national wholesale rates. Cons What a waste, shocking incompetence from the past and present Exec team who mismanaged investors money and played with people's lives. Stubborn, controlling, HR and Finance led at a time when the skills needed were and still are Sales and Marketing, and not from a consumer mindset. No trust, cannot listen, know best and get on with it, steer well clear if you want to be successful Advice to Management Start again, drop the ego and keep HR as far away from sales as possible, preferably in another country", "rating": 1, "pros": "A working mutli IMSI SIM with no limits is unique and very impressive but it's been made irrelevant through tariffing by the main operators. The big guys also hold the key because Truphone are so dependent on them for their national wholesale rates.", "cons": "What a waste, shocking incompetence from the past and present Exec team who mismanaged investors money and played with people's lives. Stubborn, controlling, HR and Finance led at a time when the skills needed were and still are Sales and Marketing, and not from a consumer mindset. No trust, cannot listen, know best and get on with it, steer well clear if you want to be successful", "advice": "Start again, drop the ego and keep HR as far away from sales as possible, preferably in another country"}, {"title": "Good Culture", "text": "Pros Great Culture and it truly feels like a family when going to work. Everyone knows everyone even if the company had a lot of people Cons Higher management don't seem to know what they are doing as the company keeps going in redundancies. It has been 3 times now.", "rating": 5, "pros": "Great Culture and it truly feels like a family when going to work. Everyone knows everyone even if the company had a lot of people", "cons": "Higher management don't seem to know what they are doing as the company keeps going in redundancies. It has been 3 times now.", "advice": null}, {"title": "Old start up", "text": "Pros Some nice offices and some good people. Granted a lot of autonomy and freedom. Chances to get involved in a wide range of work. Cons Lacking governance, everyone is off doing their own thing. Projects come flying in from left field with little notice and not enough time to plan and execute. Resulting in a lot of rework, wasted money and frustrations. Seems like a lot of decisions are made to plump up CVs. Don't do enough to hold on to staff, and the 3rd redundancy in as many years makes for poor morale. Advice to Management Stick with a plan, the amount of money and effort put into a strategy just to have it shelved is frustrating. The same old issues arise every few months but new toys take precedence.", "rating": 3, "pros": "Some nice offices and some good people. Granted a lot of autonomy and freedom.", "cons": "Lacking governance, everyone is off doing their own thing. Projects come flying in from left field with little notice and not enough time to plan and execute. Resulting in a lot of rework, wasted money and frustrations. Seems like a lot of decisions are made to plump up CVs.", "advice": "Stick with a plan, the amount of money and effort put into a strategy just to have it shelved is frustrating. The same old issues arise every few months but new toys take precedence."}, {"title": "Receive you well, good people, but a downhill company", "text": "Pros Pay well, good group of people, nice office, games room Cons Redundancies year after year! Poor pay rise! Company still not making any profit, so your job is always on the line - don't come here if you are looking for stability. try showing more revenue by cutting down on staff rather than getting more sales Advice to Management You need to be loyal to your employees!", "rating": 3, "pros": "Pay well, good group of people, nice office, games room", "cons": "Redundancies year after year! Poor pay rise! Company still not making any profit, so your job is always on the line - don't come here if you are looking for stability. try showing more revenue by cutting down on staff rather than getting more sales", "advice": "You need to be loyal to your employees!"}, {"title": "More Redundancies and More Job Losses", "text": "Pros Great team of people at the coal face who continue to keep the company running and the lights on. Strong HR team . Average Salary and benefits. Cons Another depressing round of job losses thinly disguised as another restructuring exercise. Critical functions being off shored and despite the CEO telling everyone it is Not a head count reduction, it certainly looks like one. Expensive office location that is becoming emptier by the day. Zero investment in it's people , and a completely demotivated workforce who are either being made redundant or resigning . It is such a shame as this was a great company with a disruptive and and exciting value proposition. We seem to be losing more customers than we are keeping. Advice to Management Trust your people to do their jobs. Make them want to be part of the solution. Focus where the Business is most successful . Develop a positive and motivating culture fast before there is nothing and no one left.", "rating": 1, "pros": "Great team of people at the coal face who continue to keep the company running and the lights on. Strong HR team . Average Salary and benefits.", "cons": "Another depressing round of job losses thinly disguised as another restructuring exercise. Critical functions being off shored and despite the CEO telling everyone it is Not a head count reduction, it certainly looks like one.", "advice": "Trust your people to do their jobs. Make them want to be part of the solution. Focus where the Business is most successful . Develop a positive and motivating culture fast before there is nothing and no one left."}, {"title": "Amazing experience.", "text": "Pros Very good place to work, you can learn a lot of technologies and improove your knowledge. Very innovative company. Been there for almost 3y. Cons Sometimes work life balance can be difficult during high peaks of work, aside of that, i have no cons.", "rating": 5, "pros": "Very good place to work, you can learn a lot of technologies and improove your knowledge. Very innovative company. Been there for almost 3y.", "cons": "Sometimes work life balance can be difficult during high peaks of work, aside of that, i have no cons.", "advice": null}, {"title": "AVOID - Inestable and badly managed", "text": "Pros I'd say there aren't many, but if I have to think positive, colleagues are friendly. Fancy office. Cool product. Cons Redundancies every year. Terribly managed, people not valued and achievements/performance not recognized by managers. The company can't sustain itself, loads of money needed from investors. When numbers don't work the way they want, they start cutting down people. In the 2017 redundancy they're getting rid of critical jobs and people with unique knowledge, which will make your job a lot harder if you're to apply at Truphone after the redundancy is complete. Rude and inexperienced managers with ridiculously high salaries and bonuses. Veteran employees' loyalty not rewarded. Advice to Management Do a redundancy at management level only, bring in new managers with experience and new ideas. Current CEO is contradictory. At first he said there wouldn't be any more redundancies, and he's already initiated two. Said 4G wasn't important, for that reason many customers started fleeing from our network.", "rating": 1, "pros": "I'd say there aren't many, but if I have to think positive, colleagues are friendly. Fancy office. Cool product.", "cons": "Redundancies every year. Terribly managed, people not valued and achievements/performance not recognized by managers. The company can't sustain itself, loads of money needed from investors. When numbers don't work the way they want, they start cutting down people. In the 2017 redundancy they're getting rid of critical jobs and people with unique knowledge, which will make your job a lot harder if you're to apply at Truphone after the redundancy is complete. Rude and inexperienced managers with ridiculously high salaries and bonuses. Veteran employees' loyalty not rewarded.", "advice": "Do a redundancy at management level only, bring in new managers with experience and new ideas. Current CEO is contradictory. At first he said there wouldn't be any more redundancies, and he's already initiated two. Said 4G wasn't important, for that reason many customers started fleeing from our network."}, {"title": "Truphone Ltd Review", "text": "Pros good location. some friendly and fun employees. Cons poor leadership unstable business strategy and financials", "rating": 1, "pros": "good location. some friendly and fun employees.", "cons": "poor leadership", "advice": null}, {"title": "Truphone is singing its swansong", "text": "Pros The coffee machine. The 20% of the people who do all of the work. Cons Third restructure in as many years. Executives who have failed time and time again. Toxic Culture. Zero investment in its people. Outsourcing critical jobs to unqualified and inexperienced workers in other countries. Advice to Management Resign. You have failed miserably.", "rating": 1, "pros": "The coffee machine. The 20% of the people who do all of the work.", "cons": "Third restructure in as many years. Executives who have failed time and time again. Toxic Culture. Zero investment in its people. Outsourcing critical jobs to unqualified and inexperienced workers in other countries.", "advice": "Resign. You have failed miserably."}, {"title": "Lack of direction leading to redundancies", "text": "Pros Nice new office location in canary wharf. Cons Poor direction aiming sales only to business when a lot could have been made with travelling consumers. Over active marketing department going overboard with the product. There is no need for chocolates and perfume when delivering a mobile phone. Advice to Management Open up the possibility of marketing to consumer market.", "rating": 1, "pros": "Nice new office location in canary wharf.", "cons": "Poor direction aiming sales only to business when a lot could have been made with travelling consumers.", "advice": "Open up the possibility of marketing to consumer market."}, {"title": "Truphone review", "text": "Pros Great collegues and the possibility to learn alot in other areas / fields. Cons You are expected to stay after shift ends without extra pay or any time bank, offering 2 ou 3 hours per day to the company is common practice.", "rating": 5, "pros": "Great collegues and the possibility to learn alot in other areas / fields.", "cons": "You are expected to stay after shift ends without extra pay or any time bank, offering 2 ou 3 hours per day to the company is common practice.", "advice": null}, {"title": "Don't listen to all the bad reviews - make your own opinion!", "text": "Pros I know before I start this, some may read my review and think I am being biased as I am still a current employee. But hear me out and then make your own opinion. As a current employee, I have worked at Truphone for just over a year now. It is a small company, learning to be bigger and better and this is a tough road. We have a new CEO, who has come in with bright ideas and with enthusiasm and promise of change and he has changed some areas extensively. which has created changes in our structure. As humans, we are reluctant to change. Something that always happens and there is no avoiding it, but generally people don’t like change. But we are all still paid to do our jobs. This CEO has come in with energy and purpose another thing people are not always warm to. There have been comments on Glassdoor of bad management and leadership which may be true in some cases but Truphone now has a fresh new team of directors on the Exec, who are open-minded, energetic with fresh ideas., strong focus and taking people with them. Truphone has a great product, fantastic ideas and it wants enthusiastic energetic people to work for them. From a personal side, the one thing I can say about Truphone is this. Never have I ever been accepted more from a company than I have at Truphone. They embrace people with enthusiasm, they embrace people with ideas and those that think out of the box. It is not a company for wallflowers I will give you that, but it is a company that if you have ideas and you want to have them heard, this is the company for you. Some comments suggest that the CEO is unapproachable which is not true. He has an open-door policy you just need to step through it! In fact, all the directors have an open-door policy and they welcome ideas from everyone and anyone. The work is interesting and varied, the people are very bright and fantastic to work with. It is a multinational, multi-cultural company and if you want to have fun and get paid for it this is the company for you. So, believe what you want, listen to the bad reviews, or make your own opinion. This is my opinion and I really enjoy working here. You make of it what you put into it. And my favourite motto – if you enjoy what you do, you will never have to work a day in your life. Cons Sometimes could be a bit more transparent with new ideas and ongoings. But this could be said about any company. Advice to Management Don't give up and be discouraged. You are doing a good job, its not easy pleasing everyone.", "rating": 5, "pros": "I know before I start this, some may read my review and think I am being biased as I am still a current employee. But hear me out and then make your own opinion.", "cons": "Sometimes could be a bit more transparent with new ideas and ongoings. But this could be said about any company.", "advice": "Don't give up and be discouraged. You are doing a good job, its not easy pleasing everyone."}, {"title": "Not a bad place to work", "text": "Pros Interesting work Great support from manager Cons Poor teamwork in some areas Advice to Management Don't try to run before you can walk", "rating": 5, "pros": "Interesting work", "cons": "Poor teamwork in some areas", "advice": "Don't try to run before you can walk"}, {"title": "Fun place to work", "text": "Pros Great fun Relaxed dress code Never pushed too hard Cons No prospects in a saturated market Silo approach to running the business - everyone wantEd their own kingdom Advice to Management Find a way to sell or license the technology", "rating": 3, "pros": "Great fun", "cons": "No prospects in a saturated market", "advice": "Find a way to sell or license the technology"}, {"title": "Good ideas badly managed - what could have been...", "text": "Pros Great culture. Very multicultural. Moved into a great new facility. Load of young, hard-working talent. Cons Made half the staff redundant after continually failing to hit ridiculous sales targets. Then, a year later, made a load more redundant. There were some good ideas years ago, but they failed to make good on them and now the multinationals have pretty much implemented them all. A real shame. Advice to Management Promote the best and brightest. Don't resort to cronyism. Don't have affairs with young and impressionable staff members.", "rating": 3, "pros": "Great culture. Very multicultural. Moved into a great new facility. Load of young, hard-working talent.", "cons": "Made half the staff redundant after continually failing to hit ridiculous sales targets. Then, a year later, made a load more redundant. There were some good ideas years ago, but they failed to make good on them and now the multinationals have pretty much implemented them all. A real shame.", "advice": "Promote the best and brightest. Don't resort to cronyism. Don't have affairs with young and impressionable staff members."}, {"title": "Software Development", "text": "Pros - You will be encouraged to write clean, SOLID code and to favour automation over repetition. - Some interesting intellectual property / problems to solve / projects to work on. - Friendly co-workers within a pleasant office space. Cons - A surprisingly large head count but with worryingly few techies (too many talkers, not enough doers). - Too much red tape.", "rating": 5, "pros": "- You will be encouraged to write clean, SOLID code and to favour automation over repetition.", "cons": "- A surprisingly large head count but with worryingly few techies (too many talkers, not enough doers).", "advice": null}, {"title": "a very interesting experience", "text": "Pros Canary Wharf office- great view; free coffee? Team Leaders are ok Cons you never know when redundancy will hit again ;) - during 2.5 years of my service - that happened twice, management inside CS - if you love dictatorship with a smile (or sometimes even without) then the place is for you, lack of career opportunities, Advice to Management in CS: be a leader not just a boss", "rating": 3, "pros": "Canary Wharf office- great view; free coffee?", "cons": "you never know when redundancy will hit again ;) - during 2.5 years of my service - that happened twice,", "advice": "in CS: be a leader not just a boss"}, {"title": "Vibrant culture and very demanding", "text": "Pros Vibrant culture in the Portuguese office where everyone has a can-do attitude, without lack of energy. The service is very disruptive in terms of business and one can learn a lot in terms of engineering practices. Cons Very demanding and stressful in overall terms; the company at the time was still not profitable. Advice to Management Find a quick way to make the business viable otherwise it's a shame loosing such a great concept.", "rating": 5, "pros": "Vibrant culture in the Portuguese office where everyone has a can-do attitude, without lack of energy.", "cons": "Very demanding and stressful in overall terms; the company at the time was still not profitable.", "advice": "Find a quick way to make the business viable otherwise it's a shame loosing such a great concept."}, {"title": "Innovative forward thinking telco business", "text": "Pros The company had a great business model to accommodate the demands of using your mobile phone when travelling the globe, to lock down bill shock. Great people, and good working environment. Cons Unfortunately I was recruited to early, and there were no terms of engagement to go to market and collect orders from channel customers when I joined and lacked proper processes. The infrastructure was not in place and was lacking direction during my time. Advice to Management Put in place a plan to match expectation from investors and a business model that would enable sales to hit the ground running. Thus enabling sales to earn commission and order processing and on boarding teams to get customers onto the Truphne Network to benefit from the service provide.", "rating": 3, "pros": "The company had a great business model to accommodate the demands of using your mobile phone when travelling the globe, to lock down bill shock. Great people, and good working environment.", "cons": "Unfortunately I was recruited to early, and there were no terms of engagement to go to market and collect orders from channel customers when I joined and lacked proper processes. The infrastructure was not in place and was lacking direction during my time.", "advice": "Put in place a plan to match expectation from investors and a business model that would enable sales to hit the ground running. Thus enabling sales to earn commission and order processing and on boarding teams to get customers onto the Truphne Network to benefit from the service provide."}, {"title": "Good Concept, lack of execution", "text": "Pros Great Network and Product Concept Great technical level people Good Salarys Cons Lack of medium /l ong term plan Lack of transition from concept to a repeatable Product Advice to Management Assure that has been done successfully once, can be done again", "rating": 3, "pros": "Great Network and Product Concept", "cons": "Lack of medium /l ong term plan", "advice": "Assure that has been done successfully once, can be done again"}, {"title": "They pretend to hire a excellent student rather a good professional.", "text": "Pros location, time/shift, coffee area, the view. Cons They pretended to hire someone and teach and train that person in less than 2 weeks, without giving the chance to work within the platform, where you really get practices and learn about what the job is about. Very unprofessional and lack of clarity in order to conduct a department.", "rating": 3, "pros": "location, time/shift, coffee area, the view.", "cons": "They pretended to hire someone and teach and train that person in less than 2 weeks, without giving the chance to work within the platform, where you really get practices and learn about what the job is about.", "advice": null}, {"title": "Sinking ship", "text": "Pros Nice office. Have met some great ppl along the way. Cons Lack of clear long-term plan. Internal departments and overall strategy are not joined up. Multiple rounds of redundancies reflective of poor financial state.", "rating": 3, "pros": "Nice office. Have met some great ppl along the way.", "cons": "Lack of clear long-term plan. Internal departments and overall strategy are not joined up. Multiple rounds of redundancies reflective of poor financial state.", "advice": null}, {"title": "The Good The Bad & The Ugly", "text": "Pros Great pay, fantastic people, excellent commission, good incentives, global offices. Cons Terrible discipline, unrealistic targets, poor pricing structure, lack of vision from former management. Hiring & then redundancies X 2. Advice to Management Cut down costs, revise plans from scratch, become disciplined, stop wasting money!", "rating": 5, "pros": "Great pay, fantastic people, excellent commission, good incentives, global offices.", "cons": "Terrible discipline, unrealistic targets, poor pricing structure, lack of vision from former management. Hiring & then redundancies X 2.", "advice": "Cut down costs, revise plans from scratch, become disciplined, stop wasting money!"}, {"title": "Rise and Fall and Fall again..", "text": "Pros None. Not anymore sadly. Truphone was a dynamic, go ahead organisation with the energy of a start up....its taken less than 18 months of utter failure by its former leadership to virtually kill it. Such a shame. Cons Where to start ? A former team of Execs (now bar a couple all gone) on hugely inflated salaries who were poster children for \"how did they get where they were\" ? Muddled business strategy that has consistently failed to deliver and lead to 2 downsizing excercises ( i.e cut heads) in just over a year ? A new CEO and Exec team members pretty much staking all on one big deal trying to clear the mess of the previous regime and cutting costs as much as they can? A hugely disengaged and demotivated workforce just waiting for the next bout of turbulence ? I could go on and on but the best advice I could give anyone is a) if you are offered a job at Truphone-dont. Its just simply a matter of time and b) Look out for a slew of positive reviews in about a month or so and be very suspicious. Advice to Management None.", "rating": 1, "pros": "None. Not anymore sadly. Truphone was a dynamic, go ahead organisation with the energy of a start up....its taken less than 18 months of utter failure by its former leadership to virtually kill it. Such a shame.", "cons": "Where to start ?", "advice": "None."}, {"title": "Don't Go Near It With A Bargepole!", "text": "Pros Nice location, nice offices (probably cost a fortune). Some lovely all-suffering staff. Cons A great product completely ruined by a succession of highly incompetent C level execs. As well as some fairly creepy mid level managers. Send in the clowns, They'd do a better job. As for working there, you will spend your time scratching your head wondering why on earth you left your last job, even if that job was going to the Job Centre... Advice to Management Leave, you've blown it shamelessly and shamefully. Investors: sell quick (if you can) !!", "rating": 1, "pros": "Nice location, nice offices (probably cost a fortune). Some lovely all-suffering staff.", "cons": "A great product completely ruined by a succession of highly incompetent C level execs. As well as some fairly creepy mid level managers. Send in the clowns, They'd do a better job. As for working there, you will spend your time scratching your head wondering why on earth you left your last job, even if that job was going to the Job Centre...", "advice": "Leave, you've blown it shamelessly and shamefully."}, {"title": "Terrible management", "text": "Pros Location . Cons Terrible leadership. Lack of understanding of the business from Managment. They still think they work in BT but they actually work on an MVNO that needs lots of development. They should stop giving empty speeches and get to work, or leave. HR is completely useless Advice to Management Fire your friends and let people that understand the business run it. I am not rating the current CEO as I haven't worked under him, but the previous one was a big joke.", "rating": 1, "pros": "Location .", "cons": "Terrible leadership.", "advice": "Fire your friends and let people that understand the business run it."}, {"title": "Lesson learned? No!", "text": "Pros Work life balance Compensation & Benefits are ok Cons A bunch of incompetent middle management ruined the whole company Sales & Marketing Teams are not doing their job, keep earning high salary but not bringing in new business. Technical Support Team believes that they're among the best of the world, which is absolutely not the case Advice to Management Learn your lesson! Same thing happen again and again. Not only your customers are losing confidence, your good employees as well!", "rating": 1, "pros": "Work life balance", "cons": "A bunch of incompetent middle management ruined the whole company", "advice": "Learn your lesson! Same thing happen again and again. Not only your customers are losing confidence, your good employees as well!"}, {"title": "6 months in", "text": "Pros Some great people, very friendly, work well as a team when focused on a common objective. Able to achieve major success when all pulling together. Cons Poor leadership and lack of clear vision and strategy by executive team. Executive repeatedly fail to achieve the true potential of the people employed due to their lack of ability. Advice to Management Investors need to replace a number of the executive team with experienced leaders with a strong entrepreneurial style, and a track record of driving profitable growth. Executive need to be leaders of people who will rapidly create a credible and compelling strategy for growth that staff will grasp and support.", "rating": 3, "pros": "Some great people, very friendly, work well as a team when focused on a common objective. Able to achieve major success when all pulling together.", "cons": "Poor leadership and lack of clear vision and strategy by executive team. Executive repeatedly fail to achieve the true potential of the people employed due to their lack of ability.", "advice": "Investors need to replace a number of the executive team with experienced leaders with a strong entrepreneurial style, and a track record of driving profitable growth. Executive need to be leaders of people who will rapidly create a credible and compelling strategy for growth that staff will grasp and support."}, {"title": "Marketing", "text": "Pros Great people, challenging work atmosphere, great offices, can get things done quickly Cons Poor leadership, no clear company objectives/direction, one thing that remained consistent was 'change' Advice to Management Develop a 5/10 year plan and communicate clear objectives and strategy and stick to it!", "rating": 3, "pros": "Great people, challenging work atmosphere, great offices, can get things done quickly", "cons": "Poor leadership, no clear company objectives/direction, one thing that remained consistent was 'change'", "advice": "Develop a 5/10 year plan and communicate clear objectives and strategy and stick to it!"}, {"title": "Only consider with caution or desperate need for a job - you can do better!", "text": "Pros None basically! There were some very good people, but they did the smart thing of moving on...more will follow, me included! Cons Senior management woefully inadequate Strategy 5 years behind the market Disillusioned it has killer products backed with IPR Financially vulnerable HR pressures new starters to write positive reviews here!", "rating": 1, "pros": "None basically! There were some very good people, but they did the smart thing of moving on...more will follow, me included!", "cons": "Senior management woefully inadequate", "advice": null}, {"title": "Great Potential but Fails in every department", "text": "Pros Great people, nice office. People are willing to pass on knowledge and help you out. Cons Everyone tries to help but lack of clarity and all departments. You spend all of your time in meetings and no time to do any real work. No clear processes. Lack of Agility, lack of automated deployment, lack of automated testing, lack of continuous delivery. Lack of experience and leadership in the management roles. I am still waiting for my first 1-2-1 meeting with my manager. Noone wants to tackle the real challenges and hide behind trying to deliver smaller pet projects Advice to Management Listen to your people and set some clear st", "rating": 1, "pros": "Great people, nice office. People are willing to pass on knowledge and help you out.", "cons": "Everyone tries to help but lack of clarity and all departments. You spend all of your time in meetings and no time to do any real work. No clear processes. Lack of Agility, lack of automated deployment, lack of automated testing, lack of continuous delivery.", "advice": "Listen to your people and set some clear st"}, {"title": "It's a Joke", "text": "Pros Nothing to say actually apart from few hard working people. Decent locality and a posh office. Tru SIM and MVR is a great product. Cons Senior management need to wake up. Bureaucracy at its best. Dirty politics in technical , test, and change management teams. Never let the good guys come on top. No pay rises for hard working but pay rises for smooth talkers and their favourites. And many more just avoid this company. Advice to Management Wake up big guys. Tru SIM is a great product, encourage the right people, delegate to right people, fire the useless drama artists, they add nothing to the business but cost you loads. Don't join this company up until next two years, if it dribbles on.", "rating": 1, "pros": "Nothing to say actually apart from few hard working people.", "cons": "Senior management need to wake up.", "advice": "Wake up big guys. Tru SIM is a great product, encourage the right people, delegate to right people, fire the useless drama artists, they add nothing to the business but cost you loads."}, {"title": "Management Nightmare", "text": "Pros Great product, great team, good benefits, Great social environment. Cons Management is a mess, UK HQ enforces its agenda on different countries completely ignoring local particularities. Advice to Management Take your head out of the sand already. You are letting great specialists leave and it does not even bother you. Stop being ignorant.", "rating": 3, "pros": "Great product, great team, good benefits,", "cons": "Management is a mess, UK HQ enforces its agenda on different countries completely ignoring local particularities.", "advice": "Take your head out of the sand already. You are letting great specialists leave and it does not even bother you. Stop being ignorant."}, {"title": "Fab, friendly culture! :)", "text": "Pros Truphone is a great company to work for located in easily accessible and vibrant Canary Wharf. Although based in a very cooperate area Truphone has its own unique vibe about it. Everybody is extremely approachable and friendly almost like a little family! Cons The only con is possibly a slight lack of communication from hierarchy from time to time however this is nothing major!", "rating": 5, "pros": "Truphone is a great company to work for located in easily accessible and vibrant Canary Wharf. Although based in a very cooperate area Truphone has its own unique vibe about it. Everybody is extremely approachable and friendly almost like a little family!", "cons": "The only con is possibly a slight lack of communication from hierarchy from time to time however this is nothing major!", "advice": null}, {"title": "Great place to work!", "text": "Pros A simple pro is the office, located on thr 21st floor of the Citi Tower building at Canary Wharf in London. It's very high spec, quiet work environment (not noisy at all) , and obviously has an amazing view of London. Working in CS, I like the fact the teams are quite small, +- 6 people per language team. I also like it's multi-language. The learning pace is very calm, no rush and you can really do things at your own pace. Management is excellent, no annoying call times where they stand next to your desk trying to rush you onto the next call. Most of the work is e-mail bases / case driven. You do get phone calls, but 10 on a full shift is quite a lot! Because the teams are small, your colleagues feel like family, which is nice. Truphone is pretty innovative with their products, they have something that other telecom providers don't have. It's mostly aimed at the business market, so the customers you do talk to are nice and polite, no yelling people. There's always radio playing in the background and a lot of laughter, which makes working here very enjoyable. They are a relatively young company, so there's a lot of room to brainstorm for new ideas, which they actually take seriously. Some ideas you might have, might actually be implemented, which I find really cool to see and really missed working for other companies in the past. Also there's plenty of opportunity to grow in the company given they're still so young, which is great for career opportunities. CS works in shift patterns, where you will always be on the same shift for 1 week, i.e. 8 to 17:00 or 9 to 18:00. Opening times are 07:00 till 20:00 so you'll be working anytime between then. 07:00 means getting out of bed early, but as you'll be on this same shift all week, it's easy to get used to and plan your personal life around it, which is a really big pro for me. So far any leave I applied for was approved, which is a huge plus. Working in a small team is a big beneficial factor with this. Cons I feel in terms of tooling to do the job right they could develop a little more, but they are actually continuously working on creating better tooling for CS agents to do their job, and in the short period of time I have been working here I have already seen vast improvements compared to the beginning, so it's not really that much of a con, I'm just being fussy. Advice to Management Currently I do not have specific advice to the management.", "rating": 5, "pros": "A simple pro is the office, located on thr 21st floor of the Citi Tower building at Canary Wharf in London. It's very high spec, quiet work environment (not noisy at all) , and obviously has an amazing view of London.", "cons": "I feel in terms of tooling to do the job right they could develop a little more, but they are actually continuously working on creating better tooling for CS agents to do their job, and in the short period of time I have been working here I have already seen vast improvements compared to the beginning, so it's not really that much of a con, I'm just being fussy.", "advice": "Currently I do not have specific advice to the management."}, {"title": "A company that continues to go no where!", "text": "Pros Truphone has some great people and really good concepts of where it wants to go. Cons Sadly Truphone isn't going to get where it needs to be in the marketplace anytime soon! It's selfish outlook on not only employee's and other arms of the business is short sighted. During my time of employment here I wasn't able to get anything useful done or out of Truphone, the environment and culture are great, but the ethos and practicality for getting things done is a very backward way of thinking. Advice to Management This isn't a corperate company, its a small company with some great people who are being disabled from innovating and carrying out their jobs.", "rating": 1, "pros": "Truphone has some great people and really good concepts of where it wants to go.", "cons": "Sadly Truphone isn't going to get where it needs to be in the marketplace anytime soon! It's selfish outlook on not only employee's and other arms of the business is short sighted.", "advice": "This isn't a corperate company, its a small company with some great people who are being disabled from innovating and carrying out their jobs."}, {"title": "Challenging Company...", "text": "Pros the product is very innovating and customer love to ear about it. Almost a start up with lots of new processes and action going on. Lots of opportunities to grow professionally and grab new challenges. Cons a bit disorganized, in the middle of acting as a start-up or as a heavy telco incunbent, too many people like to have a say in too many matters, decisions tend to take longer to mature than in other environments Advice to Management do not complicate so much, listen more to customers, listen more to the field people, trust, trust, trust each other more.", "rating": 5, "pros": "the product is very innovating and customer love to ear about it.", "cons": "a bit disorganized, in the middle of acting as a start-up or as a heavy telco incunbent, too many people like to have a say in too many matters, decisions tend to take longer to mature than in other environments", "advice": "do not complicate so much, listen more to customers, listen more to the field people, trust, trust, trust each other more."}, {"title": "Fast paced and fun company", "text": "Pros Genuinely friendly and cooperative coworkers. The company sets up every one on Lync and people are really good about responding to questions and helping out even when they have never met you before. There are some social activities and clubs as well that keep the atmosphere positive and fun. The offices are pretty nice. Great views at Canary Warf and generally good facilities. (Coffee is provided, which ranks way too high as a benefit for me personally). People are passionate about their roles and usually make time to explain what they do and what's happening in their department if you catch them at lunch. Things are always changing which keeps work varied and is at about the right pace (not every 30 seconds like a start up - not 6 months to change a tiny part of the website like big corporations). Cons Your days will quickly become full, but so is everyone else's so people are understanding and supportive. If you do become overwhelmed, so long as you keep people informed you will get the help or adjusted timelines.", "rating": 5, "pros": "Genuinely friendly and cooperative coworkers. The company sets up every one on Lync and people are really good about responding to questions and helping out even when they have never met you before. There are some social activities and clubs as well that keep the atmosphere positive and fun.", "cons": "Your days will quickly become full, but so is everyone else's so people are understanding and supportive. If you do become overwhelmed, so long as you keep people informed you will get the help or adjusted timelines.", "advice": null}, {"title": "Great Place, Great People", "text": "Pros Very friendly environment. Everyone is supportive of everyone regardless of department, job title, age etc Plenty of room to progress within your chosen career. If you show commitment, this will be rewarded greatly Colleagues become close friends Cons Still a new business and changes constantly happen (for the better) Advice to Management Keep inspiring and encouraging", "rating": 5, "pros": "Very friendly environment. Everyone is supportive of everyone regardless of department, job title, age etc", "cons": "Still a new business and changes constantly happen (for the better)", "advice": "Keep inspiring and encouraging"}, {"title": "Great people. Exciting Times", "text": "Pros this company manages to attract great people to it. Everyone is all hands to the pump and helpful and friendly. A strong community spirit exists. Great product and service. Lots of technically competent ideas and now a lovely office space for all that brain power. Cons Can be a bit disorganised at times but it's new and vibrant and still finding its feet. It isn't marketed as well as it could be. Advice to Management Branding needs sorting out", "rating": 5, "pros": "this company manages to attract great people to it. Everyone is all hands to the pump and helpful and friendly. A strong community spirit exists. Great product and service. Lots of technically competent ideas and now a lovely office space for all that brain power.", "cons": "Can be a bit disorganised at times but it's new and vibrant and still finding its feet. It isn't marketed as well as it could be.", "advice": "Branding needs sorting out"}, {"title": "What can i say...if you know your gonna make and impact...then make sure you do !", "text": "Pros - Environment, stunning office - Down to earth workforce, well 99% - Excellent working hours - Multicultural (read into this as you may (wink) Cons - Feels like a sinking ship at times - Constant internal restructuring - Stale product- needs more traction / marketing - More Native English speakers at lower business functions. Advice to Management - Innovate - Invest in Tru VOIP App, its a sad one man show - More Native English speakers feels like Malaga/terminal 5 at times - James & Steve are as good as it gets (Axe the rest) - Replenish the flanks, service delivery / sales are a joke and you know it", "rating": 5, "pros": "- Environment, stunning office", "cons": "- Feels like a sinking ship at times", "advice": "- Innovate"}, {"title": "Poor management and structure", "text": "Pros Some very intelligent people Good social environment Cons Illogical structure No clear direction Management not willing to listen to and trust employees Advice to Management Listen to and trust your employees - you've hired experts, now let them do their jobs!", "rating": 3, "pros": "Some very intelligent people", "cons": "Illogical structure", "advice": "Listen to and trust your employees - you've hired experts, now let them do their jobs!"}, {"title": "Trying to act like a start-up, but just a smaller British Telecom", "text": "Pros - From what I hear, the salary is decent relative to competitors within the sector. - There were some genuinely smart and nice people working there, but most - if not all - have left. - Use of company mobile is unlimited for personal international and roaming calls/data. Cons - Lack of vision. The \"strategy\" changes by the week. - He who shouts loudest gets heard. That is how meetings are run and decisions made. - Middle managers each trying to create their own \"fiefdom\" and interested in their own personal gain rather than that of the company or even of the team. - Deceitful environment. For example, a colleague once advised me not to inform other teams of certain things. He said that \"withholding information gives you power.\" Sadly, this is the norm. - Trying to present themselves as cutting edge, but in fact the competition has caught up. In addition, CEO and many execs come from BT - and run the company in a similar slow and lumbering fashion. - Global layoff of 25% in early 2015 because the company was not breaking even. Slow sales could not cover high costs. Advice to Management Keep trying to get bought out or at least sell of the network business (based in Portugal). The commercial proposition holds little, or no, value. All of this the exec board already knows but does not share with the rest of the company.", "rating": 3, "pros": "- From what I hear, the salary is decent relative to competitors within the sector.", "cons": "- Lack of vision. The \"strategy\" changes by the week.", "advice": "Keep trying to get bought out or at least sell of the network business (based in Portugal). The commercial proposition holds little, or no, value. All of this the exec board already knows but does not share with the rest of the company."}, {"title": "good needs to get great", "text": "Pros Working at Truphone gives a great insight into the world of MVNO's and a complex product. You can get to work with excellent developers and engineers, there are some excellent middle managers as well. The work/life balance is good, some weekend work, but the effort is recognized by the execs which is good. Cons The business really needs to start making a big impact int he market space - it has such unique product, but doesnt have, in my opnion, the marketing and sales strategy right to leverage it. There CEO and COO are great guys but they need to get ideas into realistic actions, whilst keeping the funding going. At the moment its just not tight enough across the teams, which is a shame, as they are great people. Some people need to be less protective about their domains and start opening up to ideas. I didnt feel that HR had much to offer other than standard processes, anything from the CIPD and best practice might be there on paper, but its not there in actuality. Advice to Management You have a great product, great people. Yoiu are making the right steps to connect (in particular the COO) but you need that more often. Lets see execs in regular meetings, so they can get familar whats going on the ground. I hope Truphone does well, its investors and the people sticking behind that deserve as much as its a tough time for them now.", "rating": 3, "pros": "Working at Truphone gives a great insight into the world of MVNO's and a complex product.", "cons": "The business really needs to start making a big impact int he market space - it has such unique product, but doesnt have, in my opnion, the marketing and sales strategy right to leverage it. There CEO and COO are great guys but they need to get ideas into realistic actions, whilst keeping the funding going. At the moment its just not tight enough across the teams, which is a shame, as they are great people.", "advice": "You have a great product, great people. Yoiu are making the right steps to connect (in particular the COO) but you need that more often. Lets see execs in regular meetings, so they can get familar whats going on the ground."}, {"title": "Could do better", "text": "Pros Some really great people. I have made some great friends. Really nice office. Struggling to fill 20 word minimum word count. Cons Lack of transparency. Top level management seem incompetent lack of communication between teams General lack of belief in the company Advice to Management Some mid level managers doing great work. need to do more to motivate employees and convince them Truphone is worth fighting for.", "rating": 3, "pros": "Some really great people. I have made some great friends.", "cons": "Lack of transparency.", "advice": "Some mid level managers doing great work. need to do more to motivate employees and convince them Truphone is worth fighting for."}, {"title": "Pompous culture with incompetent people", "text": "Pros Lots of inspirational quotes on the walls. Cons Despite being a startup most of the people come from a large corporate background, so the culture is very slow and generally there's an undeserved air of pomposity and long-windedness. It was easy to see why they had a load of redundancies because most of the people I met seemed to have based their careers on posturing, over-complicating and spewing incoherent jargon rather than being effective. Advice to Management Cut the deadwood, don't encourage the best people to leave by making redundancies unpredictable and unconnected to merit.", "rating": 1, "pros": "Lots of inspirational quotes on the walls.", "cons": "Despite being a startup most of the people come from a large corporate background, so the culture is very slow and generally there's an undeserved air of pomposity and long-windedness. It was easy to see why they had a load of redundancies because most of the people I met seemed to have based their careers on posturing, over-complicating and spewing incoherent jargon rather than being effective.", "advice": "Cut the deadwood, don't encourage the best people to leave by making redundancies unpredictable and unconnected to merit."}, {"title": "Was a great company to work for but failure by senior leaders led to mass redundancies and change in culture.", "text": "Pros Unique product on the market and the ability to add more USPS if the management was right at the top. Cons Senior management messed up and lost great employees. Company culture has vanished and lack of belief in the company now. Advice to Management Change at the top needed", "rating": 3, "pros": "Unique product on the market and the ability to add more USPS if the management was right at the top.", "cons": "Senior management messed up and lost great employees. Company culture has vanished and lack of belief in the company now.", "advice": "Change at the top needed"}, {"title": "Truphone has no direction!!", "text": "Pros Nothing good that I can quote here, except it is located in Canary Wharf????? Cons Overstaffed, Direction less, and struggling with Management crisis Advice to Management Hire a consultancy firm to streamline whole organization, decide what you want to do and move forward aggressively!!", "rating": 1, "pros": "Nothing good that I can quote here, except it is located in Canary Wharf?????", "cons": "Overstaffed, Direction less, and struggling with Management crisis", "advice": "Hire a consultancy firm to streamline whole organization, decide what you want to do and move forward aggressively!!"}, {"title": "Runied by senior management", "text": "Pros WAS an amazing company with amazing people, great culture and respect. Fun and vibrant Cons Completely ruined by senior and mid level management. Some fantastic members of staff who were so passionate about the company and employees were lost and let go in a mass redundancy without a care for those of us remaining. Lots of 'friends' of the senior management were brought in and ruined the teams, culture and vibrancy. Those who wanted to work hard and help make the comany good again were overlooked. Advice to Management Respect, listen and care for your staff", "rating": 1, "pros": "WAS an amazing company with amazing people, great culture and respect. Fun and vibrant", "cons": "Completely ruined by senior and mid level management. Some fantastic members of staff who were so passionate about the company and employees were lost and let go in a mass redundancy without a care for those of us remaining. Lots of 'friends' of the senior management were brought in and ruined the teams, culture and vibrancy. Those who wanted to work hard and help make the comany good again were overlooked.", "advice": "Respect, listen and care for your staff"}, {"title": "Incompetence is everywere", "text": "Pros Very nice product. There's more than enough money to spend. Cons The lack of skills is strong in all areas like Management, Infrastructure, Project Management, Quality Assurance, and Software Development. Most of the seniors produce amateur work and are stuck in time. Most of the management processes belong to the 90's. (Agile is just a funny word) Allot of people are just using space and wasting time while still getting money for it, but no one fires them. The worst ones are the individuals that have been there for more than 5 or 6 years. They have no interest in changing for the better (because them they would have to work for their money). The good professionals, the ones that really know how to do something and actually care, are either running away as fast as they can or are sent away because they don't cope with the incompetence around them. It's very political... The CEO is completely in the dark. That's why it's more important to be friends with important (and usually useless) people than to do your work. I could have helped Truphone (as many other colleagues that I know of), but now I'm just counting the days until I find another job and leave. Advice to Management The advice is for the CEO not Management, because Management is the real problem. Mr Steve, the people you trust the most (specially in the IT department) are the ones that are hiding everything that is wrong in the company, from you! The professionals that have the experience and knowledge to do something have their hands tied up and because of that, end up leaving. Please do something for Truphone and let the very last good professionals that still exist in the company, help Truphone and you.", "rating": 1, "pros": "Very nice product.", "cons": "The lack of skills is strong in all areas like Management, Infrastructure, Project Management, Quality Assurance, and Software Development. Most of the seniors produce amateur work and are stuck in time.", "advice": "The advice is for the CEO not Management, because Management is the real problem."}, {"title": "Nice company & culture - failed at Sales", "text": "Pros Very nice company culture and environment. I remember Truphone as a happy and colourful place with some very competent people around. Posh office in Canary Wharf, and a very innovative product portfolio. I delivered a number of successful projects, and witnessed them come alive. A fulfilling experience! Cons Sales couldn't deliver as estimated; hence the downsizing etc. A more aggressive strategy is required. Too 'nice and naive' at times; but again that type of approach could affect the good working culture. A balance is required. Advice to Management Don't let bureaucracy kill the spirit of Truphone. Remain small-ish, smart, and protect the good org culture.", "rating": 5, "pros": "Very nice company culture and environment. I remember Truphone as a happy and colourful place with some very competent people around. Posh office in Canary Wharf, and a very innovative product portfolio. I delivered a number of successful projects, and witnessed them come alive. A fulfilling experience!", "cons": "Sales couldn't deliver as estimated; hence the downsizing etc. A more aggressive strategy is required. Too 'nice and naive' at times; but again that type of approach could affect the good working culture. A balance is required.", "advice": "Don't let bureaucracy kill the spirit of Truphone. Remain small-ish, smart, and protect the good org culture."}, {"title": "Truphone, Clever but not Smart", "text": "Pros Great enjoyable company with a fresh outlook on the industry., It was good to work for a company willing to be distributive in such a cost driven market place Cons The senior leadership believe its amazing product that every company should have, My explainaintion is its something you see in \"Stuff\" magazine and say that's cool but never end up buying it. This is a perfect example of clever people not knowing how to execute their technology. Advice to Management Listen to the market and look closer at what are the actual USP's, its not what you think", "rating": 3, "pros": "Great enjoyable company with a fresh outlook on the industry., It was good to work for a company willing to be distributive in such a cost driven market place", "cons": "The senior leadership believe its amazing product that every company should have, My explainaintion is its something you see in \"Stuff\" magazine and say that's cool but never end up buying it. This is a perfect example of clever people not knowing how to execute their technology.", "advice": "Listen to the market and look closer at what are the actual USP's, its not what you think"}, {"title": "Great Start up....", "text": "Pros Great Culture and working environment Very talented staff Cons Always seem to be chasing the market even though they had a good product", "rating": 3, "pros": "Great Culture and working environment Very talented staff", "cons": "Always seem to be chasing the market even though they had a good product", "advice": null}, {"title": "Sales", "text": "Pros When I started in there was a great culture to the company, They were doing some really good thing with technology and looked to be going places. They received a massive cash injection from new backers in early 2013 and somehow managed to squander it, In December 2014 it was announced that Truphone had made a loss in excess of £90 Million and needed to make savings. £55 million of that cost was staff costs. In February 2015 over 50% of the staff were made redundant, however the C Level execs and senior managers that lead the company to the £90 Million loss are still there living off of their ridiculously high salaries and not making much of a change. I am sorry to say this but i feel that the company will not be here in 12 months time Cons COO has not got a clue on how to deliver a solution, Changes his mind on what he is going to deliver which then leaves a number of unfinished products, upgrades and systems. Unable to provide customers with: on-line billing portal, Multi Media Messaging 4G Advice to Management Get rid of the Sales Director and recruit a decent sales team", "rating": 3, "pros": "When I started in there was a great culture to the company, They were doing some really good thing with technology and looked to be going places. They received a massive cash injection from new backers in early 2013 and somehow managed to squander it,", "cons": "COO has not got a clue on how to deliver a solution, Changes his mind on what he is going to deliver which then leaves a number of unfinished products, upgrades and systems.", "advice": "Get rid of the Sales Director and recruit a decent sales team"}, {"title": "IT Manager", "text": "Pros A fantastic idea Technology is solid Cons Poor market offerings HR is directionless Advice to Management Listen to customers", "rating": 3, "pros": "A fantastic idea", "cons": "Poor market offerings", "advice": "Listen to customers"}, {"title": "Good work experience", "text": "Pros Great work-life balance, average benefits and good salary. My personal experience wasn't challenging but work environment was friendly and relaxed no matter the work load. Cons Lack of direction and effective planning. Not sure about the future of the company, considering the choices made the past few months. Advice to Management Transparent sharing of information regarding the future.", "rating": 3, "pros": "Great work-life balance, average benefits and good salary. My personal experience wasn't challenging but work environment was friendly and relaxed no matter the work load.", "cons": "Lack of direction and effective planning. Not sure about the future of the company, considering the choices made the past few months.", "advice": "Transparent sharing of information regarding the future."}, {"title": "Truphone 2015", "text": "Pros Interesting Business with really nice offices and a dynamic working environment Cons Was working at Truphone for a while. They got something like £250 million in VC funding and spent it. The amount of staff recruitment was breathtaking and then after 1000 staff were recruited worldwide the money ran out with only 300 customers and 25000 active sim cards. The company has just shrunk by over 50% and will shrink again. Staff who question the deployment of the strategy are got rid of and that only leaves the yes men to continue patting each other on their backs and spending the VC money.", "rating": 1, "pros": "Interesting Business with really nice offices and a dynamic working environment", "cons": "Was working at Truphone for a while. They got something like £250 million in VC funding and spent it. The amount of staff recruitment was breathtaking and then after 1000 staff were recruited worldwide the money ran out with only 300 customers and 25000 active sim cards. The company has just shrunk by over 50% and will shrink again. Staff who question the deployment of the strategy are got rid of and that only leaves the yes men to continue patting each other on their backs and spending the VC money.", "advice": null}, {"title": "Interesting company with great working atmosphere, although facing some organizational diffuclites", "text": "Pros - interesting product - usually really great approach to workers and customers - vibrant, friendly and creative atmosphere - amazing team from and all over the world - relatively good salary Cons - after a year of being a great employer, company started having some organizational difficulties what results in the more stressful working environment - not too many opportunities to grow for entrance level workers Advice to Management To be more consistent in communication and actions. Starting some programmes and not informing employees about their development and changes is really annoying and destructive for the engagement and trust.", "rating": 5, "pros": "- interesting product", "cons": "- after a year of being a great employer, company started having some organizational difficulties what results in the more stressful working environment", "advice": "To be more consistent in communication and actions."}, {"title": "Young business gaining maturity at a fast pace.", "text": "Pros Great opportunity to become serious about work discipline. Relatively apolitical work environment. Emphashis on the adoption of novel methodologies and tools. Cons Slightly bureaucratic. Distant top management attitude. Advice to Management Put in place the mechanisms to improve ownership across every area within the company.", "rating": 5, "pros": "Great opportunity to become serious about work discipline. Relatively apolitical work environment. Emphashis on the adoption of novel methodologies and tools.", "cons": "Slightly bureaucratic. Distant top management attitude.", "advice": "Put in place the mechanisms to improve ownership across every area within the company."}, {"title": "Company unlikely to survive in the long term due to Mobile Market Changes", "text": "Pros Very nice swanky head office in Canary wharf - cool and trendy brand feel Pay was good Seemed very organised and professional Very London metroplitan elite centric Cons massive international expansion without having much traction in existing markets, now closing these offices and laying the staff off Totally dependent on investor financing due to having totally out of control costs and not much actual revenue Unable to compete on price with existing suppliers, can't lower prices until has more customers ! Chicken and egg ! Fundamental miss understanding of how the majority of customers use their phones in the real world. ie. most people do not travel that much Roaming rates are falling massively anyway , negating its key benefit Lots of key features are missing form the product - eg. an online portal , 4G Not that much interest in multiple numbers anyway Advice to Management Truphone is supposedly a start up !! However it has been around for years and has lost nearly £300M of investors money and yet has very few customers. Is the market not telling you to stop what you are doing ? Seek out an existing mobile network as a buyer for the intelectual property to use the multi number solution.", "rating": 3, "pros": "Very nice swanky head office in Canary wharf - cool and trendy brand feel", "cons": "massive international expansion without having much traction in existing markets, now closing these offices and laying the staff off", "advice": "Truphone is supposedly a start up !! However it has been around for years and has lost nearly £300M of investors money and yet has very few customers. Is the market not telling you to stop what you are doing ?"}, {"title": "the experience enabled me to grow as a professional through hard work and the autonomy that was given to me", "text": "Pros lots of autonomy and responsibility the ability to make a direct impact on the direction of the company very cool proposition Cons grown to quickly and transformed and created silo working in many areas poor execution in many areas resulting in focus lapses Advice to Management adopt more innovate ways of doing business and avoid the traditional 'old fashioned' ones be bold and more aggressive in driving the focus", "rating": 5, "pros": "lots of autonomy and responsibility", "cons": "grown to quickly and transformed and created silo working in many areas", "advice": "adopt more innovate ways of doing business and avoid the traditional 'old fashioned' ones"}, {"title": "Not too bad", "text": "Pros Interesting challenges. Great technology stack. Cons The career progression is impossible. Management will hire someone from the street rather promote someone talented withing the company.", "rating": 3, "pros": "Interesting challenges. Great technology stack.", "cons": "The career progression is impossible. Management will hire someone from the street rather promote someone talented withing the company.", "advice": null}, {"title": "Working at Trephine", "text": "Pros This is the best place to work. There is so much to learn. The people are friendly and the environment is awesome. My time with this company has been one of the best. Cons As a start up company , there are some challenges with processes and structures but that is why the right people have been employed to make it better", "rating": 5, "pros": "This is the best place to work. There is so much to learn. The people are friendly and the environment is awesome. My time with this company has been one of the best.", "cons": "As a start up company , there are some challenges with processes and structures but that is why the right people have been employed to make it better", "advice": null}, {"title": "Deceptive and Dishonorable", "text": "Pros Lots of promises from the outset, like private healthcare, growth opportunities and so on. My 2 interviews were deep, detailed and an hour long each and were the best interviews of my life. My future manager met me socially to brief me on the company twice before starting. My manager and I got on great and I was very excited to work at Truphone. Cons In reality, the office was one full of bickering individuals who rarely seemed to have a positive word to say to each other. There was also an office culture of grilling employees for knowledge and dismissal of points made by less senior staff. Working days were longer than ideal as I have a young family. I happened to join during a week working with suppliers meaning days of 12-14 hours were necessary to nail down details. My manager promised \"flexibility\" before I joined, but later humiliated me when I arrived at 9:15 telling me I was \"late\". Indeed, after one week, my \"ongoing\" contract was terminated. I was told it due to \"irreconcilable differences of culture\" between myself and the employer and that simply my \"face didn't fit\". This is preposterous as it should be noted I am a disabled employee (as described by statute) and I notified this to the manager in my first interview (bouts of depression for around a decade, rarely serious and I can usually continue working) and he told me not to worry about it as Truphone was such a positive working atmosphere. Therefore, by instantly dismissing me without due cause they are mocking disability laws which are meant to protect staff. A hard lesson learned, and as ever - don't trust the seductive lies of a chummy manager who then betrays you without mercy. Advice to Management Treat staff, especially new employees, with respect and be honest. It sickens me my manager can \"pal up\" with me in prior (unpaid) meetings before starting the job. only to get rid of me within a week on very week grounds.", "rating": 1, "pros": "Lots of promises from the outset, like private healthcare, growth opportunities and so on. My 2 interviews were deep, detailed and an hour long each and were the best interviews of my life. My future manager met me socially to brief me on the company twice before starting. My manager and I got on great and I was very excited to work at Truphone.", "cons": "In reality, the office was one full of bickering individuals who rarely seemed to have a positive word to say to each other. There was also an office culture of grilling employees for knowledge and dismissal of points made by less senior staff.", "advice": "Treat staff, especially new employees, with respect and be honest. It sickens me my manager can \"pal up\" with me in prior (unpaid) meetings before starting the job. only to get rid of me within a week on very week grounds."}, {"title": "Forward looking company, but slowing down", "text": "Pros Truphone has a very innovative spirit. It helps that they are the first VoIP app in most app stores, but they still follow through with that drive for innovation, using their unique product line to provide features that are unmatched in the telecoms industry. Cons Unfortunately, this innovation has seemed to slow down over the years. The company has lost its startup spirit.", "rating": 5, "pros": "Truphone has a very innovative spirit. It helps that they are the first VoIP app in most app stores, but they still follow through with that drive for innovation, using their unique product line to provide features that are unmatched in the telecoms industry.", "cons": "Unfortunately, this innovation has seemed to slow down over the years. The company has lost its startup spirit.", "advice": null}, {"title": "Very Old Startup", "text": "Pros Location, concept is good, easy to get into Cons Senior Management can't make decisions (neither can the exec), no company values, no direction, archaic management style, if your face doesn't fit they you may as well leave. Reminds me of an old boys school. Advice to Management Decide what you want to do and stick to it. Do more to hold on to key staff. Do more to improve moral!", "rating": 1, "pros": "Location, concept is good, easy to get into", "cons": "Senior Management can't make decisions (neither can the exec), no company values, no direction, archaic management style, if your face doesn't fit they you may as well leave. Reminds me of an old boys school.", "advice": "Decide what you want to do and stick to it. Do more to hold on to key staff. Do more to improve moral!"}, {"title": "Ein Startup mit gutem Produkt, aber die Netzqualität fehlt", "text": "Pros Ein Startup mit gutem Produktkonzept. Leider funktioniert das Netz nicht sonderlich gut und stabil. Als MNVO ist die Firma von der Radionetz-Verfügbarkeit des lokalen Anbieters stark abhängig. Entscheidungsfreiheit und die leistungsbezogene Bezahlung sind sehr zu schätzen. Cons Gesättigte Märkte und der Entfall des EU Roaming machen das stark konkurrenzgetriebene Geschäft noch schwieriger. Work-Life-Balance ist nicht vorrangig. Advice to Management Man soll das Know-How in der Firma halten. Das Management muss bestrebt sein die Moral hoch zu halten.", "rating": 3, "pros": "Ein Startup mit gutem Produktkonzept. Leider funktioniert das Netz nicht sonderlich gut und stabil. Als MNVO ist die Firma von der Radionetz-Verfügbarkeit des lokalen Anbieters stark abhängig.", "cons": "Gesättigte Märkte und der Entfall des EU Roaming machen das stark konkurrenzgetriebene Geschäft noch schwieriger. Work-Life-Balance ist nicht vorrangig.", "advice": "Man soll das Know-How in der Firma halten. Das Management muss bestrebt sein die Moral hoch zu halten."}]