[{"title": "Good company but...", "text": "Pros - Company events - Nice colleagues - Part of Rocket Internet Cons - Not really helpful to understand your mistake - High turnover", "rating": 3, "pros": "- Company events", "cons": "- Not really helpful to understand your mistake", "advice": null}, {"title": "Great project, unforgettable family", "text": "Pros great environment, fast learning, growing responsabilities, hands on, all opinions considered, bonus, ambitious people and project, know how sharing Cons Not financially stable yet, too much trial and error Advice to Management Keep being smart guys, great future ahead!", "rating": 5, "pros": "great environment, fast learning, growing responsabilities, hands on, all opinions considered, bonus, ambitious people and project, know how sharing", "cons": "Not financially stable yet, too much trial and error", "advice": "Keep being smart guys, great future ahead!"}, {"title": "You can make a difference", "text": "Pros If you want to thrive in an ambitious international team you will find a good opportunity to mix a nice atmosphere with industrious people. Cons As any startup does, sometimes the lack of communication is the weak link. Advice to Management Keep moving forward", "rating": 5, "pros": "If you want to thrive in an ambitious international team you will find a good opportunity to mix a nice atmosphere with industrious people.", "cons": "As any startup does, sometimes the lack of communication is the weak link.", "advice": "Keep moving forward"}, {"title": "Only ok", "text": "Pros fast paced, hands on, you learn a lot and are given a lot of responsibility, nice team Cons bad management, no encouragement, long hours, poor pay, financially unstable company Advice to Management learn how to manage", "rating": 3, "pros": "fast paced, hands on, you learn a lot and are given a lot of responsibility, nice team", "cons": "bad management, no encouragement, long hours, poor pay, financially unstable company", "advice": "learn how to manage"}, {"title": "Great and ambitious company", "text": "Pros Nice international team Very flexible Flat hierarchy You make the difference Nice environment and location Cons Lack of communication among the teams A lot of stuff changes quickly without a good plan", "rating": 5, "pros": "Nice international team", "cons": "Lack of communication among the teams", "advice": null}, {"title": "FANTASTIC experience", "text": "Pros Fast learning, great personal experience, great team A lot of responsibility, easy to step up in the career Cons Base compensation is quite limited", "rating": 5, "pros": "Fast learning, great personal experience, great team", "cons": "Base compensation is quite limited", "advice": null}, {"title": "Where hardwork meets fun", "text": "Pros Cool atmosphere. Ambitious company. Responsibilities from day 1. Cons Lack of communication between the departments. Advice to Management Keep going", "rating": 5, "pros": "Cool atmosphere.", "cons": "Lack of communication between the departments.", "advice": "Keep going"}, {"title": "Ambition gets rewarded", "text": "Pros -you get a lot responsibility -flat hierarchy -your voice gets valued -deep learning curve - own impact Cons - no structure - one has to be very flexible Advice to Management communicate", "rating": 5, "pros": "-you get a lot responsibility", "cons": "- no structure", "advice": "communicate"}, {"title": "Solid!", "text": "Pros Good Team, good atmosphere, international environment Cons Long working hour but it's fun anyway", "rating": 5, "pros": "Good Team, good atmosphere, international environment", "cons": "Long working hour but it's fun anyway", "advice": null}]