[{"title": "Fantastic recruitment company", "text": "Pros Excellent work ethic, great training, good commission structure, flexible management style - generally a fun and rewarding place to work. Cons Would be good to have some other offices outside the UK perhaps", "rating": 5, "pros": "Excellent work ethic, great training, good commission structure, flexible management style - generally a fun and rewarding place to work.", "cons": "Would be good to have some other offices outside the UK perhaps", "advice": null}, {"title": "Not the best", "text": "Pros A very sociable environment Cons 15min lunch break, little training after first few weeks. Bad management", "rating": 3, "pros": "A very sociable environment", "cons": "15min lunch break, little training after first few weeks. Bad management", "advice": null}, {"title": "Not a professional place to work", "text": "Pros - Can sometimes be fun - Venn Group is suitable potentially for graduates who just want to have a bit of fun for awhile and have a graduate job on their CV, but most people get sick of it before 1 year Cons - Really immature working environment, very unprofessional behaviour throughout the company - Stuck in a really old school way of doing things: suits, barely any breaks, silly targets that will have you making calls just for the sake of making calls - Unfair rewarding system dependent on which clients and teams you get - Not particularly welcoming to feedback - Very high turnover - Lack of in depth specialist knowledge, particularly when making calls just to hit targets as oppose to acting as a specialist and offering advice & expert knowledge Advice to Management Take more time to actually educate people about job roles etc Encourage more in depth meaningful discussion as oppose to just hitting targets Take away emphasis on partying and work hard play hard type vibe (probably due to stress) Give more flexibility to staff Become more modern & forward thinking Put a stop to immature and unprofessional behaviour in the office", "rating": 3, "pros": "- Can sometimes be fun", "cons": "- Really immature working environment, very unprofessional behaviour throughout the company", "advice": "Take more time to actually educate people about job roles etc"}, {"title": "Recruitment Consultant", "text": "Pros From the MD to the team managers there is a huge emphasis on personal development at the heart of Venn, and you are always supported, encouraged and trained if you need/ask for it. Your treated like a real person not like a number in a organisation, and if you want to progress internally you will have every opportunity to do just that! Everybody at work treats each others with respect and it is a great environment to work in! I have an incredible Director who is incredibly knowledgeable and experienced who will bend over backwards to support everyone in our office in terms of both their career development, and to ensure people succeed. In my whole career I have never had a Mentor/Director who has been as supportive as I do at Venn Group. Cons Formal suit wear every day, regardless if you're meeting a client. (Creating a pretentious & uptight environment) Sometimes managers go OTE about the most ridiculous things in the world to make themselves feel good at their job and is counter productive to team morale! Advice to Management I think we would actually be more productive if we had a smart casual dress code! I think we need to promote a more work centric environment which is more about commercial productivity & need to transform into a millennial trendy smart agency, not be a recruitment agency stuck in the 1950's like our IT infrastructure!", "rating": 5, "pros": "From the MD to the team managers there is a huge emphasis on personal development at the heart of Venn, and you are always supported, encouraged and trained if you need/ask for it. Your treated like a real person not like a number in a organisation, and if you want to progress internally you will have every opportunity to do just that! Everybody at work treats each others with respect and it is a great environment to work in! I have an incredible Director who is incredibly knowledgeable and experienced who will bend over backwards to support everyone in our office in terms of both their career development, and to ensure people succeed. In my whole career I have never had a Mentor/Director who has been as supportive as I do at Venn Group.", "cons": "Formal suit wear every day, regardless if you're meeting a client. (Creating a pretentious & uptight environment)", "advice": "I think we would actually be more productive if we had a smart casual dress code! I think we need to promote a more work centric environment which is more about commercial productivity & need to transform into a millennial trendy smart agency, not be a recruitment agency stuck in the 1950's like our IT infrastructure!"}, {"title": "Extreme Micromanagement", "text": "Pros Great start in recruitment. Fairly rigorous interview process which helps you make an informed choice. Good office environment with friendly colleagues. Cons Micromanaged to the point of feeling gaslighted. Every call and email you make is scrutinised. You will be asked for regular updates on exactly what you are doing and how you are doing it. A hugely process driven, rather than results driven environment. If you like your hand being held every step of the way and are scared of trying to take the initiative then Venn is a good fit. It took me a very long time to adapt to being treated like an adult in my later jobs after my experiences here. Advice to Management Give employees more freedom.", "rating": 3, "pros": "Great start in recruitment.", "cons": "Micromanaged to the point of feeling gaslighted. Every call and email you make is scrutinised. You will be asked for regular updates on exactly what you are doing and how you are doing it. A hugely process driven, rather than results driven environment.", "advice": "Give employees more freedom."}, {"title": "A place to grow", "text": "Pros Rewarded for hard work, genuinely caring and supportive, and progression is there if you want it. I started at Venn Group in 2001 and progressed to an Associate Director, in that time I started a family and Venn was supportive and accommodating enabling me to balance work and home. Cons No obvious cons and ears where always open for problems Advice to Management Keep promoting from within", "rating": 5, "pros": "Rewarded for hard work, genuinely caring and supportive, and progression is there if you want it.", "cons": "No obvious cons and ears where always open for problems", "advice": "Keep promoting from within"}, {"title": "Mixed Opinions", "text": "Pros Great training for when you first start. Lenient compared to most agencies. Good xmas party and socializing events! Cons Heavy targets, micro management, old fashioned systems and office, old school way of doing recruitment, team commission, very strict uniform. Advice to Management Reward high billers rather than giving half the commission to non-billers, stop with the micro-management. Give staff more benefits and get with the times more! I have now worked at three recruitment agencies including Venn and it's shown me how old fashioned they are!", "rating": 3, "pros": "Great training for when you first start. Lenient compared to most agencies. Good xmas party and socializing events!", "cons": "Heavy targets, micro management, old fashioned systems and office, old school way of doing recruitment, team commission, very strict uniform.", "advice": "Reward high billers rather than giving half the commission to non-billers, stop with the micro-management. Give staff more benefits and get with the times more! I have now worked at three recruitment agencies including Venn and it's shown me how old fashioned they are!"}, {"title": "Interim HR Business Partner", "text": "Pros Great company to work with -very professional Cons Cannot think of one Advice to Management If they are not in your network currently then I suggest you add them to it!", "rating": 5, "pros": "Great company to work with -very professional", "cons": "Cannot think of one", "advice": "If they are not in your network currently then I suggest you add them to it!"}, {"title": "The best type of Recruitment", "text": "Pros No ridiculous/arbitrary KPIs and targets Company works to results, methods are irrelevant Cons Team commission is a great and rewarding structure, but it does mean some employees can do no work and still benefit Advice to Management Ensure Workers are working effectively to deserve commission packets", "rating": 5, "pros": "No ridiculous/arbitrary KPIs and targets", "cons": "Team commission is a great and rewarding structure, but it does mean some employees can do no work and still benefit", "advice": "Ensure Workers are working effectively to deserve commission packets"}, {"title": "Lied throughout the interview", "text": "Pros Good initial training. Bustling office space in the heart of London. Fun social scene, one Friday every month. Cons Managers are distant. Poor salary. Not much room to progress in your career. Male dominated, and the atmosphere reflects that. HUGE turnover of staff. Saw one person leave every other week. Will cancel your monthly commission if you fail to hit all 6 of your targets. I missed one target by 1 and lost out on £300. Incredibly strict schedule, they advertise 90 minute lunch breaks, but you can only be away from your desk for 45 minutes maximum. They say it's 8.30-6, but they expect you there 8.10, and will pull you aside to talk about your 'work ethic' if you leave any earlier than 6.15. Advice to Management Learn to interact with your staff. Just because you are the manager, it doesn't mean you can act arrogantly. Listen to your peers.", "rating": 1, "pros": "Good initial training. Bustling office space in the heart of London. Fun social scene, one Friday every month.", "cons": "Managers are distant.", "advice": "Learn to interact with your staff."}, {"title": "not bad", "text": "Pros good company culture - young environment. growth from within encouraged. Cons not clear how much you'll actually earn", "rating": 3, "pros": "good company culture - young environment. growth from within encouraged.", "cons": "not clear how much you'll actually earn", "advice": null}, {"title": "Great Company", "text": "Pros I recently left Venn Group after a great 2.5 years that saw me progress through the company. It was a difficult decision to choose to leave but I decided it was the right time to try a new career. One of the main reasons I was successful at Venn Group was because of the great support network that is central to the team based ethos. Having a team behind you who are there to guide you every step of the way through your career certainly helped me. This is very unique in the recruitment industry but is ultimately why I was able to enjoy my time at Venn Group. The training provided is not only thorough but also innovative and engaging and is what best prepared me for a career in recruitment. The mix of theory based and practical learning is key in ensuring employees are ready for both the client and candidate facing sides of the role. The open plan office structure is a great way for new employees to engage with senior people throughout the business from day one. Again, I think this is rare within most companies for employees to speak to their CEO’s/Directors on a daily basis. The social culture at Venn Group is great, as there are many team nights out, company charity days and month end work nights out. Working with great people who I was more than happy to engage with both in and out of the office environment was fantastic. I am very grateful for the opportunities, guidance and support that I had whilst I worked there. Cons Long Hours - this is the nature of the recruitment industry/ most jobs though!", "rating": 5, "pros": "I recently left Venn Group after a great 2.5 years that saw me progress through the company. It was a difficult decision to choose to leave but I decided it was the right time to try a new career.", "cons": "Long Hours - this is the nature of the recruitment industry/ most jobs though!", "advice": null}, {"title": "All Good reviews are faked", "text": "Pros - Will make you appreciate your next role so much more Cons - The overall rating of Venn Group is a joke if you go to the very last reviews you start to see some real reviews that give you a true insight into how the company is run. They obviously clocked on and would hear managers getting other to write reviews and then read them over beforehand - terrible management - even when doing well made to feel like was never enough - listening in on every call - just aim at getting grads in who don't know any better - terrible money - 3 months before you see a penny of commission even if you start billing straight away - KPI are way too high you will just end up making calls to hit a target and feel like an idiot on the phone Advice to Management - Praise hard work - give lunch breaks - have an honest relationship with staff", "rating": 1, "pros": "- Will make you appreciate your next role so much more", "cons": "- The overall rating of Venn Group is a joke if you go to the very last reviews you start to see some real reviews that give you a true insight into how the company is run. They obviously clocked on and would hear managers getting other to write reviews and then read them over beforehand", "advice": "- Praise hard work"}, {"title": "Great start to recruitment", "text": "Pros Excellent quality of training Great office environment Very supportive team culture Cons Training can be slightly generalised.", "rating": 5, "pros": "Excellent quality of training", "cons": "Training can be slightly generalised.", "advice": null}, {"title": "Excellent start", "text": "Pros Friendly atmosphere Excellent career potential Great location Clear, helpful management Effective training Have joined from another recruitment company recently and so far so good. Venn Group has a brilliant atmosphere and really prospers excellence. The newly introduced pathways and milestones makes it really clear what I need to achieve to progress within the company The social side of the company is also a great benefit, there are fully paid for team nights and whole company nights which are great fun. Good environment filled with other graduates Cons Long hours but that is typical of recruitment", "rating": 5, "pros": "Friendly atmosphere", "cons": "Long hours but that is typical of recruitment", "advice": null}, {"title": "What a great company", "text": "Pros I've worked at Venn Group for over 5 months now, and cannot recommend it enough. The people are great, real sense of community. Loads of great benefits to working for Venn. The managers have so much time for everyone, and no one is ever made to feel unwelcome. Recruitment as a career has the potential to be so great, or so terrible. This entirely comes down to the company culture and the way in which colleagues interact. At Venn because we work in teams, and commission is shared, everyone is on your side. Cannot recommend enough Cons The only slight downside is the long days, but this flies by as you are always busy, and there's so many different sides to the job. Also the potential to earn huge amounts makes up for this. Advice to Management Keep listening to your staff and making everyone feel so valued.", "rating": 5, "pros": "I've worked at Venn Group for over 5 months now, and cannot recommend it enough. The people are great, real sense of community. Loads of great benefits to working for Venn. The managers have so much time for everyone, and no one is ever made to feel unwelcome.", "cons": "The only slight downside is the long days, but this flies by as you are always busy, and there's so many different sides to the job. Also the potential to earn huge amounts makes up for this.", "advice": "Keep listening to your staff and making everyone feel so valued."}, {"title": "Training", "text": "Pros The training is great from day one and even if you have no previous sales experience you are able to get on well because of the guidance and support you receive. The team environment is also really beneficial as you are all working together and are able to help one another when required. Cons In this job you do need to be very motivated, driven and ambitious for money or career progression, if you aren't then this may not be the right environment for you. Advice to Management Continue to invest in the training and development of your staff", "rating": 5, "pros": "The training is great from day one and even if you have no previous sales experience you are able to get on well because of the guidance and support you receive.", "cons": "In this job you do need to be very motivated, driven and ambitious for money or career progression, if you aren't then this may not be the right environment for you.", "advice": "Continue to invest in the training and development of your staff"}, {"title": "Management", "text": "Pros Having worked for Venn Group for a number of years, in my experience they have always particularly focused on their people and are prepared to invest in you from day one. Each and every career matters and they are prepared to support you in getting started. The Pathways & Milestones Scheme is really competitive in the market and offers transparency of opportunity, as well as career ownership at all levels. Cons Prior to the Pathways & Milestones Scheme there wasn't as much transparency of career path, but this is something that the company has recognised and responded to with a robust and exciting scheme. The company is constantly evolving and this is a process that all employees are party to.", "rating": 5, "pros": "Having worked for Venn Group for a number of years, in my experience they have always particularly focused on their people and are prepared to invest in you from day one. Each and every career matters and they are prepared to support you in getting started.", "cons": "Prior to the Pathways & Milestones Scheme there wasn't as much transparency of career path, but this is something that the company has recognised and responded to with a robust and exciting scheme. The company is constantly evolving and this is a process that all employees are party to.", "advice": null}, {"title": "Executive Consultant", "text": "Pros Venn Group first and foremost provide market leading training to all consultants continuously throughout their career. This training includes on and off desk training and is always tailored to individuals and their learning needs. Beyond this, setting an encouraging environment by recruiting as teams rather than individuals helps consultants gain knowledge and experience at a faster rate. The progression within the company is laid out for you on day one and they show great transparency on what it takes to achieve your career goals as well as monetary goals. Venn Group have also created a fantastic brand which consultants can feel proud of and helps secure business in various sectors. I couldn't recommend Venn Group highly enough. Cons If you are not motivated by money or career progression, this might not be the organisation for you. Advice to Management Continue with your fantastic training programme and on-going development of your consultants.", "rating": 5, "pros": "Venn Group first and foremost provide market leading training to all consultants continuously throughout their career. This training includes on and off desk training and is always tailored to individuals and their learning needs. Beyond this, setting an encouraging environment by recruiting as teams rather than individuals helps consultants gain knowledge and experience at a faster rate.", "cons": "If you are not motivated by money or career progression, this might not be the organisation for you.", "advice": "Continue with your fantastic training programme and on-going development of your consultants."}, {"title": "Great Company", "text": "Pros The people. Venn group has an overall very relaxed atmosphere and I feel like the staff above me truly care and are willing to go the extra mile to provide me with what I need. Cons Only down side to Venn is very long days. Once you get into the swing of the hours they aren't too bad but at first it's difficult. Advice to Management Keep up with the good motivation.", "rating": 5, "pros": "The people. Venn group has an overall very relaxed atmosphere and I feel like the staff above me truly care and are willing to go the extra mile to provide me with what I need.", "cons": "Only down side to Venn is very long days. Once you get into the swing of the hours they aren't too bad but at first it's difficult.", "advice": "Keep up with the good motivation."}, {"title": "Awful environment", "text": "Pros Collegues can be nice, some of them Cons Was not made fully aware of what role involved if I was would not have taken role. Long hours for very little pay All emails and phone calls monitored Hectic office, clapping when someone has placed makes it impossible to hear on the phone. High targets for what is cold calling. Worst job I have ever had.", "rating": 1, "pros": "Collegues can be nice, some of them", "cons": "Was not made fully aware of what role involved if I was would not have taken role.", "advice": null}, {"title": "Recruitment administrator", "text": "Pros Very corporate environment Can lack empathy Cons Work Politics Can be hostile Not trustworthy", "rating": 1, "pros": "Very corporate environment", "cons": "Work Politics", "advice": null}, {"title": "Fantastic office with a great culture", "text": "Pros Excellent opportunity for growth combined with a well thought out training structure that guides you and encourages you to learn. Strong autonomy, great team atmosphere, great commission scheme A lot of changes have been implemented recently and they seem to be furthering the company in the right direction Cons As with all recruitment- you will be putting in extra hours when necessary but you'll be doing it because you want to rather than under the crack of a whip Advice to Management Keep doing what you're doing", "rating": 5, "pros": "Excellent opportunity for growth combined with a well thought out training structure that guides you and encourages you to learn. Strong autonomy, great team atmosphere, great commission scheme", "cons": "As with all recruitment- you will be putting in extra hours when necessary but you'll be doing it because you want to rather than under the crack of a whip", "advice": "Keep doing what you're doing"}, {"title": "Excellent company to work for!", "text": "Pros Excellent team environment to work in. Venn Group has a great new commission scheme with achievable targets and rewards for progression. Opportunities to grow your network through exciting meetings. Great social events and evenings. Excellent support from senior members and peers. Great training programme for new starters. Cons At this point in my career I feel that there are no cons to working for Venn Group.", "rating": 5, "pros": "Excellent team environment to work in. Venn Group has a great new commission scheme with achievable targets and rewards for progression. Opportunities to grow your network through exciting meetings. Great social events and evenings. Excellent support from senior members and peers. Great training programme for new starters.", "cons": "At this point in my career I feel that there are no cons to working for Venn Group.", "advice": null}, {"title": "Great Company", "text": "Pros Venn Group is a great company that has one of the best incentive schemes that I have ever seen a company offer. They care about your progression and mould training to each specific person. The environment is fantastic and the fact that you work as part of a team really makes you feel a part of something. There is a great social side to role and we are constantly going out for drinks or nights out. When you're busy it feels almost as if you are in Wall Street and when you're not you are given advice and targets for personal business development. 10/10, would recommend. Cons There are no apparent downsides to working at Venn Group Advice to Management Keep focusing on your consultants development, they really appreciate it.", "rating": 5, "pros": "Venn Group is a great company that has one of the best incentive schemes that I have ever seen a company offer. They care about your progression and mould training to each specific person. The environment is fantastic and the fact that you work as part of a team really makes you feel a part of something. There is a great social side to role and we are constantly going out for drinks or nights out. When you're busy it feels almost as if you are in Wall Street and when you're not you are given advice and targets for personal business development. 10/10, would recommend.", "cons": "There are no apparent downsides to working at Venn Group", "advice": "Keep focusing on your consultants development, they really appreciate it."}, {"title": "Good for a year or so before start noticing \"behind the scenes", "text": "Pros Had a great team (if you are lucky) lots of laughs. Great social aspect. Lovely and modern office. Cons Empty promises, micromanagement, passive agressive environment. Consulants literally fighting over placements. Praise by management for doing sneaky things to other consultants for small placements. Good for a year or so before start noticing \"behind the scenes\". Becomes demotivating. No progression unless bill lots. One of the main benfits for \"small team incentives\" was taken away.", "rating": 3, "pros": "Had a great team (if you are lucky) lots of laughs. Great social aspect. Lovely and modern office.", "cons": "Empty promises, micromanagement, passive agressive environment. Consulants literally fighting over placements. Praise by management for doing sneaky things to other consultants for small placements. Good for a year or so before start noticing \"behind the scenes\".", "advice": null}, {"title": "Great place to work, learn and develop", "text": "Pros - Great atmosphere in the Bristol Office - Team basis means you are always supported - Commission structure is excellent - Real opportunities for progression - Supportive Management Cons Hours are longer than your typical 9 - 5 but that is very much the industry norm. Advice to Management Keepdoing what you're doing!", "rating": 5, "pros": "- Great atmosphere in the Bristol Office", "cons": "Hours are longer than your typical 9 - 5 but that is very much the industry norm.", "advice": "Keepdoing what you're doing!"}, {"title": "Highly professional yet highly enjoyable", "text": "Pros Working at Venn provides all of the professional aspects of office life yet it feels like you are working amongst a group of friends. The office is always brimmed with positivity and the support you need to succeed. There is no hierachy as such, all staff, no matter the seniority, are always very approachable and always offering advice. Venn Group makes a high pressure profession feel like an enjoyable experience rather than a stressful one. Plus there is now also the option to take an hour for lunch, allowing staff to do some activities they may not usually have had time for. Cons The hours are long, however it rarely feels that way. Advice to Management Venn Group always listen to their employees and are constantly making changes in order to improve. Continue to do this and the staff will remain happy.", "rating": 5, "pros": "Working at Venn provides all of the professional aspects of office life yet it feels like you are working amongst a group of friends. The office is always brimmed with positivity and the support you need to succeed.", "cons": "The hours are long, however it rarely feels that way.", "advice": "Venn Group always listen to their employees and are constantly making changes in order to improve. Continue to do this and the staff will remain happy."}, {"title": "Venn Group", "text": "Pros Venn Group strongly emphasise the importance of teamwork and cooperation which really helps create a positive working environment - an atmosphere that is otherwise hard to come by in recruitment. New starters are always given the necessary training and support needed to progress their careers, while experienced consultants are given excellent performance-based benefits. Cons If you're thinking of joining Venn Group, be prepared for a vigorous interview and trial shift period - but it's worth it in the end!", "rating": 5, "pros": "Venn Group strongly emphasise the importance of teamwork and cooperation which really helps create a positive working environment - an atmosphere that is otherwise hard to come by in recruitment. New starters are always given the necessary training and support needed to progress their careers, while experienced consultants are given excellent performance-based benefits.", "cons": "If you're thinking of joining Venn Group, be prepared for a vigorous interview and trial shift period - but it's worth it in the end!", "advice": null}, {"title": "A steep but enjoyable learning curve", "text": "Pros A strong team based culture that runs rich amongst the office (Milton Keynes in this instance). The ability to share ideas or discuss anything with senior management at any point. Team based commission. Strong learning and development initiatives. Incentive based rewards scheme that credits top performers. The list goes on... Cons None from my end. Some people may see the hours as a con, but the right person for this job will appreciate that putting in the graft will yield excellent results. If you're scared of working long hours recruitment probably isn't for you. Advice to Management Keep as engaged with your staff as you were with me and you'll be fine.", "rating": 5, "pros": "A strong team based culture that runs rich amongst the office (Milton Keynes in this instance). The ability to share ideas or discuss anything with senior management at any point. Team based commission. Strong learning and development initiatives. Incentive based rewards scheme that credits top performers. The list goes on...", "cons": "None from my end. Some people may see the hours as a con, but the right person for this job will appreciate that putting in the graft will yield excellent results. If you're scared of working long hours recruitment probably isn't for you.", "advice": "Keep as engaged with your staff as you were with me and you'll be fine."}, {"title": "A great company to work for", "text": "Pros Team support like no other commission structure atmosphere opportunities Cons Not a con about the company more so about the industry has to be the hours Advice to Management Make the midlands housing team training a company wide program - something that every new consultant should be doing", "rating": 5, "pros": "Team support like no other", "cons": "Not a con about the company more so about the industry has to be the hours", "advice": "Make the midlands housing team training a company wide program - something that every new consultant should be doing"}, {"title": "An Excellent Company To Work For", "text": "Pros Venn Group provide a sector leading training programme that puts you in stead for a career in recruitment, this does not finish and development and training continues throughout. A work hard ethos that provides financial reward, the working environment is both interesting and fun and there is never a dull moment. The team setup of the company creates a supportive culture that assists in development of consultants and business development. An excellent social aspect of Venn Group provides additional benefits and there is the added bonus of BUPA Healthcare, generous holiday entitlements as well as dinners and outings for meeting targets. Having worked for Venn Group for 11 years I can genuinely say they are a brilliant company who have allowed me to develop my career, earn excellent money and have supported me both professionally and personally during both the hard times and the good . Cons Long hours, but that is an industry specific gripe. I would love to have a subsidised canteen, although that is something that died off in the 1980s. Advice to Management Although as your career progresses you are given more autonomy it would be good to have more flexibility in managing your day. Continue with the excellent training and support that is provided day in day out.", "rating": 5, "pros": "Venn Group provide a sector leading training programme that puts you in stead for a career in recruitment, this does not finish and development and training continues throughout. A work hard ethos that provides financial reward, the working environment is both interesting and fun and there is never a dull moment.", "cons": "Long hours, but that is an industry specific gripe.", "advice": "Although as your career progresses you are given more autonomy it would be good to have more flexibility in managing your day."}, {"title": "Go somewhere else", "text": "Pros the social aspect of Venn group can be very good - as it is a small office everyone does genuinely get on - whether that be a Christmas party, fizzy Friday or a few beers after work Cons 15 minute lunch break High turnover of staff - a lot won't stay past 3 months Realistically won't be making any commission for around 6 months - very team dependent with how much commission you'll get Hire people just for numbers with no regards to how they'll get on with team Micro management Senior managers coming in drunk/rude to people Office itself is very outdated Advice to Management The industry isn't the same as it was when the now managers where on the sales floor - you don't necessarily know it all", "rating": 3, "pros": "the social aspect of Venn group can be very good - as it is a small office everyone does genuinely get on - whether that be a Christmas party, fizzy Friday or a few beers after work", "cons": "15 minute lunch break", "advice": "The industry isn't the same as it was when the now managers where on the sales floor - you don't necessarily know it all"}, {"title": "Great Management, Great Team, Great Atmosphere", "text": "Pros excellent development and training. I am going through the Graduate Training Program, which is very informative and has helped me to get to grips with the role quickly. Moreover, the team structure is really helpful- everyone wants to help you and help you do well. I love the corporate atmosphere and the professionalism with which the company adheres to. In addition, there is ample opportunity to progress and develop your own career- which managers help you to do. Cons long hours- however these do go quick! Advice to Management continue to provide excellent training.", "rating": 5, "pros": "excellent development and training. I am going through the Graduate Training Program, which is very informative and has helped me to get to grips with the role quickly. Moreover, the team structure is really helpful- everyone wants to help you and help you do well. I love the corporate atmosphere and the professionalism with which the company adheres to.", "cons": "long hours- however these do go quick!", "advice": "continue to provide excellent training."}, {"title": "8 months and still smiling", "text": "Pros Its not like being at work, I'm surrounded by a group of people I consider my friends, in a job that comes naturally due to great training. We have a laugh, and get the job done. The nights out at the end of each month are also a massive bonus, great way to relax, and paid for. I get my evenings, weekends and bank holidays, a decent lunch break, and a good wage. Cons Less obvious benefits for the admin team than others with regards to commission, venture points, potential for progression opportunities etc. Advice to Management Keep up the good work, bring back the massive company Christmas party, and open loads of offices so we have lots more people to join the team and meet.", "rating": 5, "pros": "Its not like being at work, I'm surrounded by a group of people I consider my friends, in a job that comes naturally due to great training.", "cons": "Less obvious benefits for the admin team than others with regards to commission, venture points, potential for progression opportunities etc.", "advice": "Keep up the good work, bring back the massive company Christmas party, and open loads of offices so we have lots more people to join the team and meet."}, {"title": "Work hard, play hard", "text": "Pros Great Training programme Awesome people and fun environment Cons Long hours - but its all worth it.", "rating": 5, "pros": "Great Training programme", "cons": "Long hours - but its all worth it.", "advice": null}, {"title": "Great team spirit and supportive work environment", "text": "Pros Easy going and vibrant teams Team based work Good company perks Supportive senior recruiters Great managers Cons No autonomy The managers are great but love micromanagement Commission structure isn't for everyone Advice to Management Keep it up", "rating": 5, "pros": "Easy going and vibrant teams", "cons": "No autonomy", "advice": "Keep it up"}, {"title": "Good training & structure", "text": "Pros Team environment and organic growth are great. Very supportive if you are willing to follow the plan and will always reward success Cons Not the most contemporary working environment compared to other companies i.e. working hours/attire/lunch breaks/offices. Rigid with structure and targets", "rating": 3, "pros": "Team environment and organic growth are great. Very supportive if you are willing to follow the plan and will always reward success", "cons": "Not the most contemporary working environment compared to other companies i.e. working hours/attire/lunch breaks/offices. Rigid with structure and targets", "advice": null}, {"title": "The best recruitment agency to work for", "text": "Pros Venn Group has a fantastic graduate recruitment consultant training programme which brings all newly starting consultants up to date on everything from candidates rights to work in the UK to how to register a candidate according to the appropriate frame work. This training continues as each consultant progresses through Venn Group and there is plenty of opportunity to progress. Working on a team means you are supported right through your career and ensures there is a great working environment. Cons Venn Group is an extremely sociable environment. You work on a team basis and will regularly get the opportunity to take part in social events outside of work too. If a social environment isn't what you are looking for then this kind of company may not be for you.", "rating": 5, "pros": "Venn Group has a fantastic graduate recruitment consultant training programme which brings all newly starting consultants up to date on everything from candidates rights to work in the UK to how to register a candidate according to the appropriate frame work. This training continues as each consultant progresses through Venn Group and there is plenty of opportunity to progress. Working on a team means you are supported right through your career and ensures there is a great working environment.", "cons": "Venn Group is an extremely sociable environment. You work on a team basis and will regularly get the opportunity to take part in social events outside of work too. If a social environment isn't what you are looking for then this kind of company may not be for you.", "advice": null}, {"title": "Great company, however depends on your team and director", "text": "Pros -If you are lucky, you'll be a part of fun and dynamic environment. -A lot of flexibility: 1h flexi every month (can take out 1h out of working hours), also half days available. And in terms of taking days off, it's very easy. -Great company benefits -Great and extensive training -Genuinely great fun with team Cons -Long working hours -During lunch you are expected to have your food and stretch out and then get back to work - Not only do you have to compete with other agencies, you'll also have to watch your back from internal recruiters (everyone grabs whatever they can) Advice to Management Realise that not 1 frame will fit all of the recruiters. Some are more effective following their own strategy.", "rating": 5, "pros": "-If you are lucky, you'll be a part of fun and dynamic environment.", "cons": "-Long working hours", "advice": "Realise that not 1 frame will fit all of the recruiters. Some are more effective following their own strategy."}, {"title": "Fantastic Company", "text": "Pros Venn Group offer a market leading training programme, that offers everything you need to be successful in your market as long as you are happy to apply everything you learn. in addition, the management and Executive Consultant team are incredibly supportive and will provide on the desk training whenever necessary. Venn Group offers a unique team based approach, which means everyone will be looking for you to succeed, and will be happy to support you along the way. Team commission is easy to understand, billing is very transparent and the billing guidelines are very clearly laid out so you will always understand what is expected of you and how much commission you'll be paid. There are so many other pros, but I'd say a main one for somebody starting out in recruitment is the social aspect. The teams are all fairly young and like-minded - team socialsiing is actively encouraged and quarterly events are held for the business unit you work on. It's a fun environment and your hard work will be rewarded!! Cons There is a strict structure in place, which is a huge benefit when you first start as it helps you plan your day and the KPIs will help you achieve objectives through the day/week/month. But Venn Group could do more to encourage flexible working around this structure as you get more senior in the business.", "rating": 5, "pros": "Venn Group offer a market leading training programme, that offers everything you need to be successful in your market as long as you are happy to apply everything you learn. in addition, the management and Executive Consultant team are incredibly supportive and will provide on the desk training whenever necessary. Venn Group offers a unique team based approach, which means everyone will be looking for you to succeed, and will be happy to support you along the way.", "cons": "There is a strict structure in place, which is a huge benefit when you first start as it helps you plan your day and the KPIs will help you achieve objectives through the day/week/month. But Venn Group could do more to encourage flexible working around this structure as you get more senior in the business.", "advice": null}, {"title": "Accounts Assistant", "text": "Pros Close-knit team, plenty of progression within Sales Cons Micro management, political, overly corporate Advice to Management No business becomes successful without its workforce.", "rating": 3, "pros": "Close-knit team, plenty of progression within Sales", "cons": "Micro management, political, overly corporate", "advice": "No business becomes successful without its workforce."}, {"title": "Good place to start at, but a bad place to stay...", "text": "Pros Training is excellent. It may take a a year to absorb everything you need to know, but that's pretty much the only pro. The Christmas parties were always good, but apart from that there isn't much else to recommend. Once you have been through the training and stayed for 2 years (and received the mandatory promotion to 'Executive Consultant' that comes with the 2 year tenure) you would be best leaving for another company. Better work/life balance, higher salary, higher commission and being treated with respect are all things that you can get more of at other recruitment companies. Cons Some managers behaved like tyrants with carte blanche, and it just seemed to be the norm. It was only when I worked at other agencies that I realised that the constant swearing, belittling, threatening and humiliation of Consultants isn't common place or acceptable (or beneficial in any way). The (regional) office that I worked in was also 20 years behind the rest of the UK in terms of political correctness. My former Director, Senior Manager and Manager would all be sacked from any other corporate office environment, but seemed to revel in their behaviour unchallenged. I also used to get reprimanded for not attending work related social events (that were made compulsory) outside of office hours. Advice to Management Treat your staff as you would like to be treated. Your staff do not owe you their souls just because a good training programme is in place for the first 12 months.", "rating": 3, "pros": "Training is excellent. It may take a a year to absorb everything you need to know, but that's pretty much the only pro. The Christmas parties were always good, but apart from that there isn't much else to recommend. Once you have been through the training and stayed for 2 years (and received the mandatory promotion to 'Executive Consultant' that comes with the 2 year tenure) you would be best leaving for another company. Better work/life balance, higher salary, higher commission and being treated with respect are all things that you can get more of at other recruitment companies.", "cons": "Some managers behaved like tyrants with carte blanche, and it just seemed to be the norm. It was only when I worked at other agencies that I realised that the constant swearing, belittling, threatening and humiliation of Consultants isn't common place or acceptable (or beneficial in any way). The (regional) office that I worked in was also 20 years behind the rest of the UK in terms of political correctness. My former Director, Senior Manager and Manager would all be sacked from any other corporate office environment, but seemed to revel in their behaviour unchallenged. I also used to get reprimanded for not attending work related social events (that were made compulsory) outside of office hours.", "advice": "Treat your staff as you would like to be treated. Your staff do not owe you their souls just because a good training programme is in place for the first 12 months."}, {"title": "Good money, career progression, values it's staff", "text": "Pros Easy to understand commission structure, your personal development is very detailed for your first three months, then continual for your first 12 months, and continues beyond this at your request. Working in a regional office really feels like a family, as you are part of a 24 person 'mini business' within the larger landscape of Venn as a whole. Cons Can be difficult to convert a first interview all the way through into an offer. As they give complete training to their staff in the art of recruitment, it is relatively easy to secure a first interview. They therefore interview lots and lots of people, and can be selective in who they end up hiring.", "rating": 5, "pros": "Easy to understand commission structure, your personal development is very detailed for your first three months, then continual for your first 12 months, and continues beyond this at your request. Working in a regional office really feels like a family, as you are part of a 24 person 'mini business' within the larger landscape of Venn as a whole.", "cons": "Can be difficult to convert a first interview all the way through into an offer. As they give complete training to their staff in the art of recruitment, it is relatively easy to secure a first interview. They therefore interview lots and lots of people, and can be selective in who they end up hiring.", "advice": null}, {"title": "Interim Specialists - Team based recruitment", "text": "Pros Team based environment - fun, friendly and hardworking. Team based working supports their Graduate Training Programme and ensures that all new employees can learn on the job from a supportive team, as well as off the desk with the excellent training team. There are regular team nights and unit nights out which facilitate a balanced and enjoyable work/social life. Cons No holiday incentives or qualifications provided. Unlike other companies you do not get an hour lunch which would be useful for going to the gym, etc. Advice to Management Look at other ways of incentivising the workforce to ensure they stay motivated. Continue the growth allowing more organic growth internally.", "rating": 5, "pros": "Team based environment - fun, friendly and hardworking. Team based working supports their Graduate Training Programme and ensures that all new employees can learn on the job from a supportive team, as well as off the desk with the excellent training team. There are regular team nights and unit nights out which facilitate a balanced and enjoyable work/social life.", "cons": "No holiday incentives or qualifications provided. Unlike other companies you do not get an hour lunch which would be useful for going to the gym, etc.", "advice": "Look at other ways of incentivising the workforce to ensure they stay motivated. Continue the growth allowing more organic growth internally."}, {"title": "Excellent company - highly recommended", "text": "Pros Venn Group offers great prospects for career progression and employees are constantly encouraged to realise their potential. The training programme is comprehensive and the company invests a lot of time and effort in providing necessary training to new starters as well as to existing employees. In addition, the working environment is great and there is a very open door culture. You feel comfortable approaching managers and directors and everyone is friendly and supportive. You are expected to work hard and you are certainly rewarded for your efforts. The team working basis is great especially if you thrive in a team environment and the split between the team and individual commission is fair and promotes a collaborative way of working. In short, I would certainly recommend working for Venn! Cons No cons of working here so far!", "rating": 5, "pros": "Venn Group offers great prospects for career progression and employees are constantly encouraged to realise their potential. The training programme is comprehensive and the company invests a lot of time and effort in providing necessary training to new starters as well as to existing employees.", "cons": "No cons of working here so far!", "advice": null}, {"title": "A place you will progress if you are happy to take on advice", "text": "Pros The majority of the teams really do have each others back and the training offered is second to none on the market. Cons Long hours, little lunch break and a plethora of candidates and clients who will drive you crazy - but if you're interested in recruitment, everywhere is the same. Advice to Management Don't forget what the company was originally about - inclusive, office sharing ideals and giving back to the teams that graft to earn approval.", "rating": 5, "pros": "The majority of the teams really do have each others back and the training offered is second to none on the market.", "cons": "Long hours, little lunch break and a plethora of candidates and clients who will drive you crazy - but if you're interested in recruitment, everywhere is the same.", "advice": "Don't forget what the company was originally about - inclusive, office sharing ideals and giving back to the teams that graft to earn approval."}, {"title": "Perfect place to make a career", "text": "Pros Career progression is great. Company are honest and open. Always looking to grow and expand. Team environment encourages staff retention. Cons Not as ruthless as some competitors (not always a bad thing) Advice to Management Keep up the good work", "rating": 5, "pros": "Career progression is great. Company are honest and open. Always looking to grow and expand. Team environment encourages staff retention.", "cons": "Not as ruthless as some competitors (not always a bad thing)", "advice": "Keep up the good work"}, {"title": "Venn Group - Honest Review", "text": "Pros First and foremost, it must be said that the training programme at Venn Group's is exemplary. Those looking to start a career in recruitment would be hard pressed to find a company that invests so much time and effort in training new staff, with the internal training team/senior management offering invaluable advice and expertise in all things recruitment. The team-based environment offers a very supportive working atmosphere to thrive in and there is always someone at hand to answer any questions you may have or offer any advice. This collaborative way of working also promotes a very social environment in which you'll make great friends and enjoy some great nights out! I've read a few reviews that highlight that some of Venn's processes are a little outdated but the company is definitely showing signs of progression. For example, in certain areas of the business the lunch break process (or lack thereof) has been re-reviewed and taking an hour is now looked upon favourably, allowing consultants to stay refreshed ahead of a productive afternoon. The hours can be long (8-6) but in any recruitment company, you will directly \"get out what you put in\" so this is not out of the ordinary. The company is also very open to flexible hours (within reason) so you never feel \"stuck at work\". Most importantly, anyone starting out at Venn will learn invaluable skills that can propel their career forward whether they decide to progress through the company or move on to pastures new. A great company in very many ways! Cons For those wishing to progress to management, the career options at Venn Group are fantastic but there is currently very few opportunities for those that do not wish to directly line manage staff. This structure can lead to exceptional consultants leaving the company or moving into management despite their skills being best suited for business development. The team based commission scheme is great when starting out but can lead to people to plateau-ing once they are entitled to their 100% share.", "rating": 5, "pros": "First and foremost, it must be said that the training programme at Venn Group's is exemplary. Those looking to start a career in recruitment would be hard pressed to find a company that invests so much time and effort in training new staff, with the internal training team/senior management offering invaluable advice and expertise in all things recruitment.", "cons": "For those wishing to progress to management, the career options at Venn Group are fantastic but there is currently very few opportunities for those that do not wish to directly line manage staff. This structure can lead to exceptional consultants leaving the company or moving into management despite their skills being best suited for business development.", "advice": null}, {"title": "All round brilliant company", "text": "Pros Venn Group is an incredibly friendly and supportive recruitment company. Working as part of a team gives a real sense of belonging and surrounds you with like minded ambitious individuals who genuinely want you to do well. The career progression is structured, clear and transparent The commission structure is clear and transparent The management are approachable and will never turn you down if you want a catch up and are quick to give you their time even though they have large workloads Each business unit and team are ran like a specialist recruitment company so that there is always room to evolve and grown, both as a team and individually Cons Pension contributions are minimum by the company at the moment", "rating": 5, "pros": "Venn Group is an incredibly friendly and supportive recruitment company.", "cons": "Pension contributions are minimum by the company at the moment", "advice": null}, {"title": "Hardworking company that will help you to succeed", "text": "Pros Great location, team ethos, defined career path, achievable commission plan, reputable brand, amazing training, accessible management, excellent values Cons Poor starting salary, micro management (managers are assigned 2 -4 staff on average) No defined career path for those who don't want to manage people", "rating": 5, "pros": "Great location, team ethos, defined career path, achievable commission plan, reputable brand, amazing training, accessible management, excellent values", "cons": "Poor starting salary, micro management (managers are assigned 2 -4 staff on average)", "advice": null}, {"title": "Honest appraisal", "text": "Pros - Excellent training scheme - Good career progression - Strong chemistry amongst colleagues - Good incentive schemes Cons - Long days (to be expected within this industry)", "rating": 5, "pros": "- Excellent training scheme", "cons": "- Long days (to be expected within this industry)", "advice": null}, {"title": "Recruitment Consultant", "text": "Pros great atmosphere. supportive teams. sociable environment. superb support system Cons Can't think of anything here. Advice to Management Nothing", "rating": 5, "pros": "great atmosphere. supportive teams. sociable environment. superb support system", "cons": "Can't think of anything here.", "advice": "Nothing"}, {"title": "Venn Group - great company", "text": "Pros Venn Group is truly unique in its team based approach compared to the rest of the industry. This along with the meritocratic style makes it an incredibly supportive environment where everyone is in it together to succeed. As a company Venn Group is always looking forwards and where it can progress. Venn is also well regarded across the industry for its training, and quite rightly. New consultants are heavily invested in to give them the best start to their career in recruitment as possible, made up with a mix of on and off the desk training. The hours can be seen as quite long compared to the standard 9-5, but compared to the rest of the industry (and sales as a whole) they really aren't that bad and with no company phones or access to emails out of the office, staff are encouraged to truly switch off whilst not at work allowing you to make the most of your own time. Cons Despite the focus of quality over quantity there are certain KPIs for everyone to work to. However, at the end of the day it is a sales role and so everyone needs to have their targets. The KPIs are very realistic and the management work with everyone to make sure they are as reasonable as possible.", "rating": 5, "pros": "Venn Group is truly unique in its team based approach compared to the rest of the industry. This along with the meritocratic style makes it an incredibly supportive environment where everyone is in it together to succeed. As a company Venn Group is always looking forwards and where it can progress.", "cons": "Despite the focus of quality over quantity there are certain KPIs for everyone to work to. However, at the end of the day it is a sales role and so everyone needs to have their targets. The KPIs are very realistic and the management work with everyone to make sure they are as reasonable as possible.", "advice": null}, {"title": "The ethical recruiters", "text": "Pros Great team environment, very collaborative and very ethical in comparison to other recruitment organisations. Strong social scene also to wind down after the long and stressful days! Cons Reasonably strict on KPIs and structure to begin with, however this does get more relaxed when you prove you can perform and become more senior. Bit slow when it comes to embracing newer recruitment techniques. Advice to Management Be a bit more flexible and give high performers a bit more freedom to do things in their own way. No major concerns though, it's a very stable and well-run company.", "rating": 5, "pros": "Great team environment, very collaborative and very ethical in comparison to other recruitment organisations. Strong social scene also to wind down after the long and stressful days!", "cons": "Reasonably strict on KPIs and structure to begin with, however this does get more relaxed when you prove you can perform and become more senior. Bit slow when it comes to embracing newer recruitment techniques.", "advice": "Be a bit more flexible and give high performers a bit more freedom to do things in their own way. No major concerns though, it's a very stable and well-run company."}, {"title": "Rec Con - Good place to start out", "text": "Pros For someone starting out in recruitment you can count on the 'industry leading training scheme' being as advertised. The grad training scheme is excellent and Jocy's sessions were always fun and informative. I definitely learned a lot from her. The working environment itself is very hit and miss but one thing Venn does well is instill a good work ethic in all of its employees. Because of the team based environment you don't find any 'slackers' and consultants, as well as managers, will generally do all they can to help you out. The social side of the job was pretty solid. You won't be short of people to grab a beer, or 5, with after work. Cons The work life balance was horrendous. I know that this is 'standard practice' in recruitment but it felt like a pretty thankless task even if you were in the office past 7pm, which wasn't uncommon. Lunch breaks are also non existent - you're lucky to get 10 minutes away from your desk during the day. And god forbid you actually try to leave the office on time - leaving at 6pm is not the done thing at Venn. KPI's, KPI's, KPI's. Completely archaic and counterproductive. This isn't an industry wide practice anymore but Venn Group don't seem interested in evolving on this. There was always the promise that management wanted to listen to the concerns of employees so that the company could progress and make Venn a better place to work but in reality this wasn't the case. The consultants face to face feedback session with the CEO also seems pointless - I would assume the same concerns come up year on year but nothing is ever done. Staff turnover is very high - I was at Venn for over a year and the amount of staff that came and went in that time was staggering. Advice to Management Listen to your employees. Try and offer a better work life balance.", "rating": 3, "pros": "For someone starting out in recruitment you can count on the 'industry leading training scheme' being as advertised. The grad training scheme is excellent and Jocy's sessions were always fun and informative. I definitely learned a lot from her.", "cons": "The work life balance was horrendous. I know that this is 'standard practice' in recruitment but it felt like a pretty thankless task even if you were in the office past 7pm, which wasn't uncommon. Lunch breaks are also non existent - you're lucky to get 10 minutes away from your desk during the day. And god forbid you actually try to leave the office on time - leaving at 6pm is not the done thing at Venn.", "advice": "Listen to your employees. Try and offer a better work life balance."}, {"title": "Executive Consultant - honest review", "text": "Pros Good place to learn the ropes of recruitment. Embeds sales process and work ethic well. Commission scheme works well for those starting out, as teams share profits (though only a tiny percentage of them compared to most commission schemes). Profile, the CRM, works well and is better than those used at many other agencies. Well known in the market place. Cons Utterly ridiculous PR, internally and externally. The LinkedIn template intro, forced on all but the most robust consultants, is flat out incorrect, and looks ridiculous to anyone who knows the recruitment market even slightly: \"Venn Group is the UK’s only company dedicated to the provision of contract and interim staff to organisations in both the private and public sectors\" Pretends to be a finance agency, when 70% of profits come from IT. Claims to be a temp specialist, but all the teams place perm staff - often then splitting the invoices to make it appear like a temp placement. The internal propaganda that Venn is the best agency to work out, has leading commissioning etc. is unrelenting, and in most cases a lie. Official hours of 8.30 to 6.00 are in reality 8.00 to 6.30 minimum, with anything less brought up in appraisals. Lunch breaks are non-existent. Consultants under most managers/directors are micromanaged down to the words said in calls and emails. Bullying culture pervades throughout the company. Promotion is erratic, HR claims to have process but in reality it comes down to how much directors like the consultant, or if they have threatened to leave - which is the fastest promotion route at Venn. Management have little to no interest in changing processes or behaviours. The yearly 'consultation' between Deirdra Moynihan and experienced consultants is a face exercise, with the same points raised year after year, without action taken. Advice to Management Treat people like people. Treat adults like adults.", "rating": 3, "pros": "Good place to learn the ropes of recruitment. Embeds sales process and work ethic well.", "cons": "Utterly ridiculous PR, internally and externally.", "advice": "Treat people like people. Treat adults like adults."}, {"title": "Great place to work and grow your career", "text": "Pros Good team environment. Excellent development of consultants. Strong senior decision making. Opportunity to progress. Cons Some times a dated approach to market.", "rating": 5, "pros": "Good team environment. Excellent development of consultants. Strong senior decision making. Opportunity to progress.", "cons": "Some times a dated approach to market.", "advice": null}, {"title": "Great Company", "text": "Pros I really enjoyed 1 year working for Venn Group based in the Bristol Office. Best elements I found were the training and support given by the management and the endless incentives put in place to motivate and reward the consultants. I also found the management to be understanding of my personal situation at all times including when I was moving house and learning to drive as well as my reasons for leaving and I was also given flexibility to succeed as a consultant. The atmosphere in the office is great and the environment is very social. As a company I would highly recommend them as the first point of call for anybody looking to start a career in recruitment. Cons hours, but that is standard for recruitment and Venn Group’s aren’t excessive compared to some Advice to Management I would say keep doing what your doing in terms of the support network, incentives and appraisals. The managers are one of the major factors that makes the Bristol office a great environment to work in.", "rating": 5, "pros": "I really enjoyed 1 year working for Venn Group based in the Bristol Office. Best elements I found were the training and support given by the management and the endless incentives put in place to motivate and reward the consultants. I also found the management to be understanding of my personal situation at all times including when I was moving house and learning to drive as well as my reasons for leaving and I was also given flexibility to succeed as a consultant. The atmosphere in the office is great and the environment is very social. As a company I would highly recommend them as the first point of call for anybody looking to start a career in recruitment.", "cons": "hours, but that is standard for recruitment and Venn Group’s aren’t excessive compared to some", "advice": "I would say keep doing what your doing in terms of the support network, incentives and appraisals. The managers are one of the major factors that makes the Bristol office a great environment to work in."}, {"title": "Recruitment Agency or Military School ?", "text": "Pros They provide an excellent year long training programme. Cons Upon job offer, hiring manager stated that I must relocate. They would not allow me to travel 50 minutes in from outside london. Most live within zone 5. No legitimate reason was provided. Management style is very strict. Arrive 45 minutes before start time (8:30). Take lunch (10 minutes max), when told. Eat at your desk. Take calls in between, mouth full or not. Do not dare leave your desk to go home at 6pm (finish time). First to leave and go home is clapped out and cheered with the utmost sarcasm of course. Unacceptable to leave any time before 6:45pm. Targeted at 20 calls per session to clients. Session times are 9-12 and then 2-5. Strict call times, 10 minute breaks and long hours are not communicated at job offer stage. The moment a colleague/manager gets a whiff of any recruitment consultant looking for a role elsewhere, they dismiss you for \"lack of trust\". Advice to Management Loosen up and follow legislations around break times and working hours, particularly when staff are working near enough 11 hour days!", "rating": 1, "pros": "They provide an excellent year long training programme.", "cons": "Upon job offer, hiring manager stated that I must relocate. They would not allow me to travel 50 minutes in from outside london. Most live within zone 5. No legitimate reason was provided.", "advice": "Loosen up and follow legislations around break times and working hours, particularly when staff are working near enough 11 hour days!"}, {"title": "Manager", "text": "Pros This is an excellent training ground to get into recruitment that offers career opportunities if you wish to progress through the company Cons The company has an effective but quite rigid corporate structure. Has it lost a little of its entrepreneurial spirit as its grown to the size it is today? Advice to Management Keep up the good work", "rating": 5, "pros": "This is an excellent training ground to get into recruitment that offers career opportunities if you wish to progress through the company", "cons": "The company has an effective but quite rigid corporate structure. Has it lost a little of its entrepreneurial spirit as its grown to the size it is today?", "advice": "Keep up the good work"}, {"title": "Recruitment consultant", "text": "Pros I recently started working at Venn Group and I have felt like part of the team from very early on. I could not ask for a better group of people to work with; they have all been so welcoming and willing to help whenever I have questions or concerns. While we all work extremely hard we also genuinely get on well and it makes coming to work enjoyable. The training at Venn has also been really good so far; with regular training sessions with other new starters, and on the desk training from my manager and team. Although they do expect you to get stuck in from the very beginning they have always been there to offer guidance and I have never felt like I am being judged if I make a mistake, instead I am given constructive criticism and ideas on how I can improve. Cons I have not experienced any cons yet. Advice to Management Keep up the good work! The environment makes coming to work enjoyable each day.", "rating": 5, "pros": "I recently started working at Venn Group and I have felt like part of the team from very early on. I could not ask for a better group of people to work with; they have all been so welcoming and willing to help whenever I have questions or concerns. While we all work extremely hard we also genuinely get on well and it makes coming to work enjoyable.", "cons": "I have not experienced any cons yet.", "advice": "Keep up the good work! The environment makes coming to work enjoyable each day."}, {"title": "Great Company to Work for", "text": "Pros If you are looking to start your career as a recruitment consultant then Venn Group is the place for you. It has a really good training structure and a great atmosphere for people interested in being social and making friends. The company care about your thoughts and are interested in the progression of the company as well as you as a person. Cons There are long hours, but that is the same as any other recruitment company. Advice to Management Keep up the good work and atmosphere and you will keep attracting the best talent.", "rating": 5, "pros": "If you are looking to start your career as a recruitment consultant then Venn Group is the place for you. It has a really good training structure and a great atmosphere for people interested in being social and making friends. The company care about your thoughts and are interested in the progression of the company as well as you as a person.", "cons": "There are long hours, but that is the same as any other recruitment company.", "advice": "Keep up the good work and atmosphere and you will keep attracting the best talent."}, {"title": "Starting out at Venn Group!", "text": "Pros - Venn group look after their colleagues - you instantly become part of a welcoming, supportive team who support and train you developing your talent within the company. - The company is team based - you are working collectively and receive commission collectively! - The office is open planned and filled with a lot of energy. - You are thoroughly interviewed from the get go so you get a real feel of the company. Cons I have nothing bad to say about Venn Group! Advice to Management N/A", "rating": 5, "pros": "- Venn group look after their colleagues - you instantly become part of a welcoming, supportive team who support and train you developing your talent within the company.", "cons": "I have nothing bad to say about Venn Group!", "advice": "N/A"}, {"title": "Rigid and Outdated", "text": "Pros The company has a good training programme, which will set you up and provide all the basics to become a successful recruitment consultant and your next job in recruitment will be easy to secure. The 'team-basis' working structure is good, it promotes unity with your immediate colleagues and means that commission tends to be stable. The company's profile is strong and they have secured good exposure and customer/candidate base in certain business sectors. Cons Consultants are micro-managed on a monthly, weekly, daily, hourly and on call-by-call basis, sometimes to the point that you can't go to the bathroom without asking for permission! If you like being micro-managed and spoon fed your every word and move, then you'll love it there. Most children get more freedom and autonomy in primary school than here. The basic pay is rubbish (well below industry norms) when you realise the amount of hours you are expected to put in. The commission structure is not progressive (well below industry norms), goal posts seem to shift regularly and you will quickly hit a glass ceiling of earning potential. Teams are extremely fluid so you will never feel any stability or job security. The 'revolving door' spins very fast. There is no lunch break as such, 15 minutes at best to grab food and eat at your desk, any longer and you will be heavily scrutinised. Calling in sick is asking for trouble, genuinely ill people will come to work, will never be sent home inevitably infecting the rest of the office. There is a bullying culture which seems to stem from the top down through the ranks all the way to consultant level. New ideas are rarely listened to, disagreeing or having an opinion is not advised and any real change takes years to happen. Management rule with scare tactics and intimidation rather than empowerment and inspiration. Culture varies hugely from office to office all depending on who is running the show. Would NOT Recommend working in the Bristol office. Advice to Management Get off your high-horse, listen to your staff, treat people as individuals and adults.", "rating": 1, "pros": "The company has a good training programme, which will set you up and provide all the basics to become a successful recruitment consultant and your next job in recruitment will be easy to secure.", "cons": "Consultants are micro-managed on a monthly, weekly, daily, hourly and on call-by-call basis, sometimes to the point that you can't go to the bathroom without asking for permission! If you like being micro-managed and spoon fed your every word and move, then you'll love it there. Most children get more freedom and autonomy in primary school than here.", "advice": "Get off your high-horse, listen to your staff, treat people as individuals and adults."}, {"title": "Consultant", "text": "Pros good training career progression transparent management structure Cons micro management within some teams", "rating": 5, "pros": "good training", "cons": "micro management within some teams", "advice": null}, {"title": "Awful culture, extremely demanding", "text": "Pros The best thing about having worked for Venn Group is that I know exactly how NOT to run a company as a result. Cons It's so clear that all these \"I can't think of any cons\" reviews are entirely fake. Your contract will say that you work 9-5, but you'll work 8.15-6.30 as standard (and often more) It's quite chauvinistic with girls forced to wear high heels. Totally unethical company where if you don't have a candidate suitable for a job, you place a \"ghost\", in other words you pretend you have someone perfect for the role and then frantically search for someone to fit the bill. It's disgusting really. Quite clear that they hire graduates because no self-respecting professional would work there. They also know grads are too unsure of themselves to speak up about the awful culture (no lunch breaks, encouraged to squeal on your mates) or unethical practices. Advice to Management Give your employees a lunch break. Stop with the endless focus on cold calling. Quit ghosting. Be better people.", "rating": 1, "pros": "The best thing about having worked for Venn Group is that I know exactly how NOT to run a company as a result.", "cons": "It's so clear that all these \"I can't think of any cons\" reviews are entirely fake.", "advice": "Give your employees a lunch break. Stop with the endless focus on cold calling. Quit ghosting. Be better people."}, {"title": "Career Development", "text": "Pros Training & Development, Career Progression, Financial Security, Team Work, Social Life, Corporate & Social Responsibility, Professional Reputation Cons I have not experienced a negative side to working at Venn Group", "rating": 5, "pros": "Training & Development, Career Progression, Financial Security, Team Work, Social Life, Corporate & Social Responsibility, Professional Reputation", "cons": "I have not experienced a negative side to working at Venn Group", "advice": null}, {"title": "Fantastic training, great place to work!", "text": "Pros Continuous training and development, a very supportive environment, encouraged to progress by managers and directors, annual pay review and good team commission structure. There are plenty of other benefits and rewards such as team nights out, an end of month 'fizzy Friday' and fantastic Christmas parties where Venn group really go all out to recognise the hard work of all their employees! Cons I personally don't have any from the 3 years that I worked in the Manchester office and I would defiantly recommend anyone looking to get into recruitment to get in touch", "rating": 5, "pros": "Continuous training and development, a very supportive environment, encouraged to progress by managers and directors, annual pay review and good team commission structure. There are plenty of other benefits and rewards such as team nights out, an end of month 'fizzy Friday' and fantastic Christmas parties where Venn group really go all out to recognise the hard work of all their employees!", "cons": "I personally don't have any from the 3 years that I worked in the Manchester office and I would defiantly recommend anyone looking to get into recruitment to get in touch", "advice": null}, {"title": "Good training with micro-management", "text": "Pros - Great learning environment, as training is well structured and tracked - Regular catch ups with HR and managers - Managers and Directors are very available for advice, guidance on calls and BD, very approachable - People are all very friendly and nice - Great place to start out in recruitment - Hours are ok. 8:30 (8am Mondays) - 6pm. Lunch is very much at your desk and anything longer than a 15min walk out to get it is frowned upon. Cons - Commission is shared which makes it hard for high billing consultants to excel, especially if they have no interest in progressing to management - Managers basically sit on top of you. KPIs are strict - A lot of people leave, or it seems a lot do as teams are small when someone moves on it throws off the team. Also when people quit for another recruitment job (rather than going traveling for example) it is never announced, they just kind of disappear. Advice to Management - Give your staff the opportunity to make their own decisions and create their own future in the business rather than smothering them - Try not to put good talent off recruitment as a whole industry, there are many other companies in the industry that don't require smashing the phone for 10-hours a day and having no responsibility.", "rating": 3, "pros": "- Great learning environment, as training is well structured and tracked", "cons": "- Commission is shared which makes it hard for high billing consultants to excel, especially if they have no interest in progressing to management", "advice": "- Give your staff the opportunity to make their own decisions and create their own future in the business rather than smothering them"}, {"title": "Hell.", "text": "Pros Easy to get a job, they'll take anyone, if you're desperate for a few months money, apply. Cons Draconian uniform policy. Staff sent home for not being clean shaven or wearing brown shoes, felt like school/prison. No Lunch Break - you're allowed to 'pop out' for 10 minutes but any longer than that and you receive a disciplinary. Forced to Pester - You're made to cold call people for 10/12 hours a day, when they plead down the phone to stop calling them, you're made to call them back, this is basically harassing people, made me feel very uncomfortable and get upset. When I handed in my resignation, I was told I was useless, pathetic, would never make it in life and that I should be ashamed of myself. I wish I'd have recorded it so I could upload the proof, what an awful organisation. Advice to Management Stop bullying staff, treat your staff with respect, then maybe you wouldn't lose half of your new staff within 6 months.", "rating": 1, "pros": "Easy to get a job, they'll take anyone, if you're desperate for a few months money, apply.", "cons": "Draconian uniform policy. Staff sent home for not being clean shaven or wearing brown shoes, felt like school/prison.", "advice": "Stop bullying staff, treat your staff with respect, then maybe you wouldn't lose half of your new staff within 6 months."}, {"title": "Excellent Company to work for", "text": "Pros Great environment, constant learning process, always feel challenged and motivated. This role is for people who have a strong work ethic, ambition and desire to learn and progress within the company. It is surprising to see some of the more negative reviews but then this may be a reason why they no longer work for us.. Cons I don’t feel there are any ‘cons’ working at Venn Group, but like any company we don’t say that we are perfect. Venn works hard to listen to its employees with monthly appraisals, consultation days with the CEO (where you can voice your views and improvements on the company) making improvements to staff benefits every year (recently dress code, maternity pay and candidate incentives. Advice to Management Keep investing in and training your staff - everyone likes to be challenged at work so keep it up!", "rating": 5, "pros": "Great environment, constant learning process, always feel challenged and motivated. This role is for people who have a strong work ethic, ambition and desire to learn and progress within the company. It is surprising to see some of the more negative reviews but then this may be a reason why they no longer work for us..", "cons": "I don’t feel there are any ‘cons’ working at Venn Group, but like any company we don’t say that we are perfect. Venn works hard to listen to its employees with monthly appraisals, consultation days with the CEO (where you can voice your views and improvements on the company) making improvements to staff benefits every year (recently dress code, maternity pay and candidate incentives.", "advice": "Keep investing in and training your staff - everyone likes to be challenged at work so keep it up!"}, {"title": "Love working here!!", "text": "Pros I worked at Venn from 2008-2012, went travelling and have now returned and I wouldn't want to work for any other company. I love the training programmes at Venn, they provide all types of training for all staff whether you are learning to become a consultant or working in support. I love that Venn Group are very sociable and they reward their staff with team/unit nights out, charity day/nights and amazing Christmas parties. I always feel that I get the support where and when needed and with this support it has helped me grow within the company. Cons From my own personal experience I don't have any cons", "rating": 5, "pros": "I worked at Venn from 2008-2012, went travelling and have now returned and I wouldn't want to work for any other company.", "cons": "From my own personal experience I don't have any cons", "advice": null}, {"title": "Actual review", "text": "Pros Nothing. I really mean NOTHING Cons All of the positive (1 star or more) reviews on this website are written by management. Although it has been a while since I worked here, this place still gives me nightmares! Not being allowed to sit down, being told off for going to the toilet / taking longer than 20 minutes during designated 1 hour lunch breaks. Rubbish pay, terrifying CEO and the \"best\" place to work in London. Advice to Management Wearing hats to cover up your horns is a good idea.", "rating": 1, "pros": "Nothing. I really mean NOTHING", "cons": "All of the positive (1 star or more) reviews on this website are written by management.", "advice": "Wearing hats to cover up your horns is a good idea."}, {"title": "Recruitment Consultant", "text": "Pros Good graduate programme - very clear structured programme and very helpful for when you graduate. Monthly social - very good! Good work environment, productive and helpful - good for starting job when you graduate to teach you skills to take with you as you further your career Cons Management - far too demanding - very KPI driven on metrics in comparison to other agencies Long hours worked, not much of work/social life balance", "rating": 3, "pros": "Good graduate programme - very clear structured programme and very helpful for when you graduate.", "cons": "Management - far too demanding - very KPI driven on metrics in comparison to other agencies", "advice": null}, {"title": "Great Company To Work For", "text": "Pros Having worked at a few consultancies I can honestly say that Venn are quite simply better than any in the industry. They really care about each individual and invest time in to your career and personal development. They care!! Team - The team set up enables anyone new to recruitment to be part of things from day one. Working in a team enables you to learn from experienced consultant and offers support on a daily basis. Working in a team also means that the environment is fun and enjoyable which goes a long way when things get tough Management - The management are superb and approachable. The Directors and the Managers know every individual and all are treated equally. Simply put, if you put the time in then the management will invest their time in you. I can't remember a day working at Venn where I wasn't laughing and having fun with my colleagues, it's an amazing place to work Cons If you leave, you'll find it hard pushed to find anywhere better!! Advice to Management Don't change.", "rating": 5, "pros": "Having worked at a few consultancies I can honestly say that Venn are quite simply better than any in the industry. They really care about each individual and invest time in to your career and personal development. They care!!", "cons": "If you leave, you'll find it hard pushed to find anywhere better!!", "advice": "Don't change."}, {"title": "Excellent training and supportive environment!", "text": "Pros When I began my career search, all I was really looking for was a company that provided excellent training and opportunity for career progression...and I have not been disappointed! There is so much to learn in recruitment and Venn Group structure the training in such a way that I knew exactly what the objective was at each stage of my development. From the basics at the very beginning to more complex sales and negotiation techniques after my first year, I always felt comfortable with the pace at which I was learning and developing into a better consultant. I hope to achieve much more in the future and can think of no better company to do that with! Cons You do have to go outside your comfort zone at times in recruitment which isn't always the easiest! Some situations call for a different approach to what you're used to...but even if it was tough at the time, I knew that overall it would make me into a better consultant. And there was always somebody there to advise if I was struggling! Advice to Management Keep doing what you're doing! It's working and the amount of people who have been in the company long term and continue to be successful is proof of that!", "rating": 5, "pros": "When I began my career search, all I was really looking for was a company that provided excellent training and opportunity for career progression...and I have not been disappointed!", "cons": "You do have to go outside your comfort zone at times in recruitment which isn't always the easiest!", "advice": "Keep doing what you're doing! It's working and the amount of people who have been in the company long term and continue to be successful is proof of that!"}, {"title": "Good company, poor recognition.", "text": "Pros - Good office environment - Good job benefits - Good training for newer staff Cons - Lots of empty promises - Management underappreciate employees and take for granted", "rating": 5, "pros": "- Good office environment", "cons": "- Lots of empty promises", "advice": null}, {"title": "The best recruitment company in the UK!", "text": "Pros Having worked for several different recruitment consultancies Venn Group stands head and shoulders above the rest. The team based approach to recruitment provides a supportive and social atmosphere where people genuinely want you to succeed. The managers are all approachable and due to the open plan office they are really hands on and there’s no being dictated to by someone you’ve never met. Cons As with any recruitment job it can be frustrating at times but that is just the nature of the role. Having a team around you though makes such a massive difference and makes the job 100x more enjoyable. Advice to Management Keep doing what you’re doing. They are quick to recognise success and will be the first to encourage you after you’ve had an off day.", "rating": 5, "pros": "Having worked for several different recruitment consultancies Venn Group stands head and shoulders above the rest. The team based approach to recruitment provides a supportive and social atmosphere where people genuinely want you to succeed. The managers are all approachable and due to the open plan office they are really hands on and there’s no being dictated to by someone you’ve never met.", "cons": "As with any recruitment job it can be frustrating at times but that is just the nature of the role. Having a team around you though makes such a massive difference and makes the job 100x more enjoyable.", "advice": "Keep doing what you’re doing. They are quick to recognise success and will be the first to encourage you after you’ve had an off day."}, {"title": "Amazing company to work for!", "text": "Pros The training and support given from my manager and senior manager has been incredible. As this is my first recruitment job this was very important to me in the beginning. The commission structure is really good. I also love the team aspect as you can build real friendships with your colleagues and there is a really great social scene. Everybody works really, really hard but always up for a good laugh in the office so there is never a dull day. Cons Some days can be frustrating if candidates let you down, but that's the nature of recruitment. However because we have that team focus, a bad day never seems so bad because you can always have a good laugh with your team and go for a drink at the end of the day. Advice to Management Keep up the good work.", "rating": 5, "pros": "The training and support given from my manager and senior manager has been incredible. As this is my first recruitment job this was very important to me in the beginning. The commission structure is really good. I also love the team aspect as you can build real friendships with your colleagues and there is a really great social scene. Everybody works really, really hard but always up for a good laugh in the office so there is never a dull day.", "cons": "Some days can be frustrating if candidates let you down, but that's the nature of recruitment. However because we have that team focus, a bad day never seems so bad because you can always have a good laugh with your team and go for a drink at the end of the day.", "advice": "Keep up the good work."}, {"title": "Great entry into recruitment . horrible money (very low commission)", "text": "Pros If your worried recruitment is horrible, venn group is the best way to enter the market. Great training programme, very friendly, massive drinking/social culture, supportive team and they stick with you in tough times Cons Long hours but to be expected. very bad commission compared to the market. so when you get good and have 6months to a year on your belt. RUN! no more space for management or progression. oh and the bullabout we only hire from within is bull. directors are almost al external. Advice to Management make the commission better, all your great seller are leaving becoz of it.", "rating": 3, "pros": "If your worried recruitment is horrible, venn group is the best way to enter the market. Great training programme, very friendly, massive drinking/social culture, supportive team and they stick with you in tough times", "cons": "Long hours but to be expected. very bad commission compared to the market. so when you get good and have 6months to a year on your belt. RUN!", "advice": "make the commission better, all your great seller are leaving becoz of it."}, {"title": "Great Company, Good People", "text": "Pros Great Company with good prospects for all new employees. All of the progression opportunities are taken from within which makes it a very friendly company as everyone knows everyone. It's ideal for people looking for a stable environment and willing to work hard to gain a better understanding of the market and move up. Cons Long Hours - but that's recruitment. The first six months is a very steep learning curve however the trainers are spectacular and really do help all of the new starters through probation. Advice to Management I left as I wasn't sure on my personality fitting with the incredible demand. I was very well looked after and I would encourage anyone to go to this company looking for work as they really do look after their own.", "rating": 5, "pros": "Great Company with good prospects for all new employees. All of the progression opportunities are taken from within which makes it a very friendly company as everyone knows everyone. It's ideal for people looking for a stable environment and willing to work hard to gain a better understanding of the market and move up.", "cons": "Long Hours - but that's recruitment. The first six months is a very steep learning curve however the trainers are spectacular and really do help all of the new starters through probation.", "advice": "I left as I wasn't sure on my personality fitting with the incredible demand. I was very well looked after and I would encourage anyone to go to this company looking for work as they really do look after their own."}, {"title": "Bullying Culture...Poor Salary For Hours Spent", "text": "Pros To be fair for a newbie, the training on offer is good. And that is that. This needs to be 20words so... Cons Poor Salary If you have a life outside of work...forget it. Lunch break? Obviously not Bullying culture from management and want to be managers Advice to Management Start listening to staff who leave... Start supporting and stop bullying And maybe a lunch break at the very least?", "rating": 1, "pros": "To be fair for a newbie, the training on offer is good.", "cons": "Poor Salary", "advice": "Start listening to staff who leave..."}, {"title": "Horrible management and working environment", "text": "Pros Good social scene. That's it. Cons I don't know where to begin. Bullying and intimidation became the norm in the office I worked in. I was yelled at and towered over by manager, both literally and figuratively. Voiced my concerns in my appraisal (where you are encouraged to criticise your colleagues), only to be told that it was their way or the highway and I was in the wrong. I was also made to take an extra day's holiday for my father's funeral. New ideas are squashed as the old guard get treated like kings and continue unreprimanded. It is also frowned upon to take more than fifteen minutes at lunch or leave at 6pm. I don't think I have enough bad words to say about the company. Advice to Management Listen to your staff and look to your managers as to why good staff leave.", "rating": 1, "pros": "Good social scene. That's it.", "cons": "I don't know where to begin. Bullying and intimidation became the norm in the office I worked in. I was yelled at and towered over by manager, both literally and figuratively. Voiced my concerns in my appraisal (where you are encouraged to criticise your colleagues), only to be told that it was their way or the highway and I was in the wrong. I was also made to take an extra day's holiday for my father's funeral. New ideas are squashed as the old guard get treated like kings and continue unreprimanded. It is also frowned upon to take more than fifteen minutes at lunch or leave at 6pm. I don't think I have enough bad words to say about the company.", "advice": "Listen to your staff and look to your managers as to why good staff leave."}, {"title": "Standard old school recruitment firm", "text": "Pros Good training on the basics of recruitment and a good social scene (most employees are recent grads). Cons KPIs - quantity over quality. Very little freedom / autonomy - treated like school kids, lunch break non-existent, anything over 15 mins gets scrutinised. Commission / success a lot easier to achieve when on NHS teams over C&I and FS teams. Poor starting basic salary in comparison to competitors. Frowned upon if you leave the office at 6pm. Advice to Management Give consultants a bit more autonomy.", "rating": 3, "pros": "Good training on the basics of recruitment and a good social scene (most employees are recent grads).", "cons": "KPIs - quantity over quality. Very little freedom / autonomy - treated like school kids, lunch break non-existent, anything over 15 mins gets scrutinised. Commission / success a lot easier to achieve when on NHS teams over C&I and FS teams. Poor starting basic salary in comparison to competitors. Frowned upon if you leave the office at 6pm.", "advice": "Give consultants a bit more autonomy."}, {"title": "There are much better recruitment companies out there", "text": "Pros Good training is provided and for graduates it's nice to work with people of a similar age and background Cons You are micromanaged to an unbelievable level, you are forced to get in early and stay late for no apparent reason, you are encouraged to slate your colleagues in your regular appraisals, you are basically treated like a child.", "rating": 3, "pros": "Good training is provided and for graduates it's nice to work with people of a similar age and background", "cons": "You are micromanaged to an unbelievable level, you are forced to get in early and stay late for no apparent reason, you are encouraged to slate your colleagues in your regular appraisals, you are basically treated like a child.", "advice": null}, {"title": "Awful place to work", "text": "Pros Pay not bad but not much else to be honest Cons Lots of bullying im the workplace and a very high turnover of staff as a result. Management are very lazy while staff have to work extremely long hours. Advice to Management Stop bullying.", "rating": 1, "pros": "Pay not bad but not much else to be honest", "cons": "Lots of bullying im the workplace and a very high turnover of staff as a result. Management are very lazy while staff have to work extremely long hours.", "advice": "Stop bullying."}, {"title": "Driven, focused and fun place to work", "text": "Pros Extremely well managed, every decision is well planned and thought through. Communication between the owners, directors and consultants is excellent. Training is very good and continues throughout your career. Superb coffee machine! Cons Hours can be long but ultimately comparable to other industries, the team approach allows good flexibility if you need to get out on time Advice to Management Keep it up!", "rating": 5, "pros": "Extremely well managed, every decision is well planned and thought through.", "cons": "Hours can be long but ultimately comparable to other industries, the team approach allows good flexibility if you need to get out on time", "advice": "Keep it up!"}, {"title": "A fantastic start to my career", "text": "Pros Great working atmosphere, fun people, decent social life, management that treat you like friends rather than just as employees, very fast salary increases in your first year, a much more stable salary than other agencies. Cons Not a whole lot to write here. Hours are long without much lunch break but not disproportionately to other agencies. The commission structure means that it can be seen as difficult to motivate people who have been there a long time and already reached the billing limit for full team commission. Advice to Management Keep doing what you're doing, particularly on the social side of things. Money is great when you start but can potentially flatten out once you reach a certain level. I think loyalty bonuses and pay increases could be more regular or offer higher increases.", "rating": 5, "pros": "Great working atmosphere, fun people, decent social life, management that treat you like friends rather than just as employees, very fast salary increases in your first year, a much more stable salary than other agencies.", "cons": "Not a whole lot to write here. Hours are long without much lunch break but not disproportionately to other agencies. The commission structure means that it can be seen as difficult to motivate people who have been there a long time and already reached the billing limit for full team commission.", "advice": "Keep doing what you're doing, particularly on the social side of things. Money is great when you start but can potentially flatten out once you reach a certain level. I think loyalty bonuses and pay increases could be more regular or offer higher increases."}, {"title": "An agency that has the human touch...", "text": "Pros They placed me in a great company in central London and, after being overlooked by other agencies, I now feel wanted. Elizabeth Fajardo looks 'after me' and makes you feel you're not just another cog in the wheel. Cons None, so far (is that five words yet?)", "rating": 5, "pros": "They placed me in a great company in central London and, after being overlooked by other agencies, I now feel wanted. Elizabeth Fajardo looks 'after me' and makes you feel you're not just another cog in the wheel.", "cons": "None, so far (is that five words yet?)", "advice": null}, {"title": "Energetic, inspiring and forward-looking", "text": "Pros Great team atmosphere, good rewards provided that you work at it, management very approachable including Directors. Best training in the sector. Great social life including lots of events organised by the company. Good at social responsibility (apprenticeships, loads of charity work), and diversity (good gender/ethnic mix in senior management, charismatic female CEO). Cons Not a place for people lacking initiative or work ethic. Not surprised to see a few bad reviews from people who clearly couldn't hack it. If you want a quiet life or a free ride, this is obviously not the company for you - go somewhere else. Advice to Management Keep bringing on the talent - really good to see that everyone in management is 'home-grown'. Whatever it is, you must be doing something right to have kept growing all through the recession.", "rating": 5, "pros": "Great team atmosphere, good rewards provided that you work at it, management very approachable including Directors. Best training in the sector. Great social life including lots of events organised by the company. Good at social responsibility (apprenticeships, loads of charity work), and diversity (good gender/ethnic mix in senior management, charismatic female CEO).", "cons": "Not a place for people lacking initiative or work ethic. Not surprised to see a few bad reviews from people who clearly couldn't hack it. If you want a quiet life or a free ride, this is obviously not the company for you - go somewhere else.", "advice": "Keep bringing on the talent - really good to see that everyone in management is 'home-grown'. Whatever it is, you must be doing something right to have kept growing all through the recession."}, {"title": "Supportive", "text": "Pros - Training - Supportive management - People - Social / culture - Structured hours (can't work from home) Cons - No opportunity to be autonomous - Must jump through hoops to get anywhere, when it could be more advantageous to give people the opportunity to run with it - Money (inflexible and the bonus system is convoluted)", "rating": 3, "pros": "- Training", "cons": "- No opportunity to be autonomous", "advice": null}, {"title": "Fast paced, fun and a steep, but manageable learning curve.", "text": "Pros Enormous support throughout your career, and supportive coaching at each management level. Lots of ambitious individuals, but a great balance with team ethos - creates real camaraderie in the office. Cons Not suited to those who aren't happy to share their successes - so important that each individual understands that the company is greater than the sum of it's parts. Advice to Management Continue to highlight those who are exceptional achievers and team players, and reward them accordingly.", "rating": 5, "pros": "Enormous support throughout your career, and supportive coaching at each management level. Lots of ambitious individuals, but a great balance with team ethos - creates real camaraderie in the office.", "cons": "Not suited to those who aren't happy to share their successes - so important that each individual understands that the company is greater than the sum of it's parts.", "advice": "Continue to highlight those who are exceptional achievers and team players, and reward them accordingly."}, {"title": "Fun, team driven company that looks after it employees", "text": "Pros Great earning potential, celebrated team success, full inclusion from day one, great intensive 2 week training program done internally at your office, management support all day, ability to pick what team you feel best with joining and chance to change in the future to expand market knowledge Cons Fast paced so not for the careful or questioning characters, 8.30-6pm day so definitely one of the longer days on the market and your almost expected to work longer (47hr week minimum) Advice to Management My experience with the management was great. Really helpful and always ready to listen, even as far up as the directors. I think greater emphasis on training within the individual teams would be useful at a very early stage would be good. Maybe better or more training emphasis on marketing would be advantageous from an early point.", "rating": 5, "pros": "Great earning potential, celebrated team success, full inclusion from day one, great intensive 2 week training program done internally at your office, management support all day, ability to pick what team you feel best with joining and chance to change in the future to expand market knowledge", "cons": "Fast paced so not for the careful or questioning characters, 8.30-6pm day so definitely one of the longer days on the market and your almost expected to work longer (47hr week minimum)", "advice": "My experience with the management was great. Really helpful and always ready to listen, even as far up as the directors. I think greater emphasis on training within the individual teams would be useful at a very early stage would be good. Maybe better or more training emphasis on marketing would be advantageous from an early point."}, {"title": "Honest Appraisal of Working for Venn Group.", "text": "Pros Annual pay reviews reflect what you put in and bring to the table - once you have established yourself as a Consultant and perform consistently you will earn good money. Cons You may need to stick at it and persevere for a year or so before you see the full financial rewards associated with building success - some unsuccessful consultants have seemingly been shocked by this.", "rating": 5, "pros": "Annual pay reviews reflect what you put in and bring to the table - once you have established yourself as a Consultant and perform consistently you will earn good money.", "cons": "You may need to stick at it and persevere for a year or so before you see the full financial rewards associated with building success - some unsuccessful consultants have seemingly been shocked by this.", "advice": null}, {"title": "A great company to begin a successful career", "text": "Pros - Decent starting salary - Exceptional training programme (recognised at the 2014 Recruiter Awards) - Great team ethos, you are taught your market within a specialist team who really understand their job - Good perks: free Christmas party, top biller lunches and various other awards Cons The same cons as within any sales role, there is pressure on you to be successful and employees have to be able to maintain levels of motivation when having a difficult week. Advice to Management Great feedback and training that's given to staff, this has really helped me reach my goals and they are really helping me push beyond them!", "rating": 5, "pros": "- Decent starting salary", "cons": "The same cons as within any sales role, there is pressure on you to be successful and employees have to be able to maintain levels of motivation when having a difficult week.", "advice": "Great feedback and training that's given to staff, this has really helped me reach my goals and they are really helping me push beyond them!"}, {"title": "Fast paced, fun and so much better than I imagined!", "text": "Pros I have been working at Venn Group for 11 weeks and I can honestly say coming here is the best career move I have ever made. I previously worked for a local authority doing a 9-5 so yes the hours are longer but you soon get used to them and it becomes the norm. The way this company is run is excellent. They are firm but fair and when I say fair, I mean generous. Hard work is thoroughly rewarded with bonuses, top performers lunches, vennture points (used to buy yourself gifts and experiences) and verbal recognition from the directors is given to those that deserve it. Yes it's target driven, but it's a sales environment, what do people expect?? It's a fun place to work. Although hard work is expected you can still have a laugh and have fun with your colleagues. My team and everyone I have come across at Venn Group has made me feel very welcome and it already seems like I have been here ages as everyone has been so welcoming. The social aspect of life at Venn is great. There is always someone wanting to go for a drink after work and social events are put on regularly whether it's within your team or for the whole company. This includes many events and fundraising activities for charity. Fizzy Fridays, held at the end of the month are a winner and a great way to get to know people. I have found that Venn really do listen to their employees holding regular consultation days with members of staff to listen to their opinions and ideas. In the small amount of time I have been here many changes have taken place following a consultation day held in December. Venn value their employees opinions and they listen! I do feel some of the reviews on here are very one sided and I would hope that potential employees would take all the reviews on here into consideration and if you were still unsure, speak with the internal recruitment team and make your own mind up! Cons It would be nice if the pension scheme was better and the company contributed to this more but I have come from an organisation where the pension scheme is extremely generous so the difference between the two, for me personally, is quite vast. Advice to Management Great management team. All managers are really approachable and great fun to work with.", "rating": 5, "pros": "I have been working at Venn Group for 11 weeks and I can honestly say coming here is the best career move I have ever made. I previously worked for a local authority doing a 9-5 so yes the hours are longer but you soon get used to them and it becomes the norm.", "cons": "It would be nice if the pension scheme was better and the company contributed to this more but I have come from an organisation where the pension scheme is extremely generous so the difference between the two, for me personally, is quite vast.", "advice": "Great management team. All managers are really approachable and great fun to work with."}, {"title": "Met my expectations", "text": "Pros The training is excellent. Hard work is rewarded, the target system is fair and senior management thoroughly support the progression of their staff. Cons The role requires people who can remain calm under pressure, as no day is the same, you will be expected to manage multiple tasks at times and also work to deadlines.", "rating": 5, "pros": "The training is excellent. Hard work is rewarded, the target system is fair and senior management thoroughly support the progression of their staff.", "cons": "The role requires people who can remain calm under pressure, as no day is the same, you will be expected to manage multiple tasks at times and also work to deadlines.", "advice": null}, {"title": "Recruitment", "text": "Pros Enjoy working here. There is an outstanding training schedule in place - this includes training from both my Manager and team mates. Cons The hours can be long - but the harder you work the more you get out of it.", "rating": 5, "pros": "Enjoy working here. There is an outstanding training schedule in place - this includes training from both my Manager and team mates.", "cons": "The hours can be long - but the harder you work the more you get out of it.", "advice": null}, {"title": "learning curve!", "text": "Pros The training is superb, always looking to improve your performance with constant training and appraisals. Everyone is good fun, with a work hard, play hard mentality. Cons The hours can be quite long, with lots of things going on at the same time! Worth it though, the more you put in, the more you get out!", "rating": 5, "pros": "The training is superb, always looking to improve your performance with constant training and appraisals. Everyone is good fun, with a work hard, play hard mentality.", "cons": "The hours can be quite long, with lots of things going on at the same time! Worth it though, the more you put in, the more you get out!", "advice": null}, {"title": "Good company to work for, decent benefits and remuneration", "text": "Pros - Very supportive management, especially in your first year - Good team based commission scheme (as opposed to individual) - means that your 'take home' is pretty consistent, very handy if you want to apply for a mortgage or other finance - Decent holiday package, especially after you have been there for a few years - Real prospects of career progression, most of their offices are growing so plenty of opportunities if you are committed Cons - The hours are quite long, but they are perfectly up front about this when interviewing - recruitment isn't for everyone - Some people may find the first 12 months quite process driven (although this may be a positive for some), although more autonomy is allowed after 12 - 18 months", "rating": 5, "pros": "- Very supportive management, especially in your first year", "cons": "- The hours are quite long, but they are perfectly up front about this when interviewing - recruitment isn't for everyone", "advice": null}, {"title": "Great place to learn and be the best!", "text": "Pros The training I have received has been second to none, I have worked for other recruitment companies, but have to say the level of detail and inclusion I have felt here makes Venn really stand out amongst it's peers. Salary is competitive, benefits are in line with the industry and if you hit your targets the commission really is very good. Management team is strong and fully understand the companies goals and objectives - That definitely filters down! Cons Work life balance is good and you do get time to have a break - I guess it would be good if those breaks could be more often, however if you want to be a success in this industry, you need to put the hours in! Advice to Management Carry on doing what you are doing please!", "rating": 5, "pros": "The training I have received has been second to none, I have worked for other recruitment companies, but have to say the level of detail and inclusion I have felt here makes Venn really stand out amongst it's peers. Salary is competitive, benefits are in line with the industry and if you hit your targets the commission really is very good. Management team is strong and fully understand the companies goals and objectives - That definitely filters down!", "cons": "Work life balance is good and you do get time to have a break - I guess it would be good if those breaks could be more often, however if you want to be a success in this industry, you need to put the hours in!", "advice": "Carry on doing what you are doing please!"}, {"title": "Great experience!", "text": "Pros Great place to learn how to do the job. The training is outstanding and there is continual progression, regardless of your level or experience. The fact that the company has meritocratic approach to progression is very motivational, it inspires potential managers and there is a genuine belief that if you work hard you will be given your opportunity to progress. The commission is also very fair, the 75% team 25% individual rewards high achievers without completely taking away the merits of working as a team. Cons The hours can be long, however this is an industry standard. The work hard play hard culture of the business means that the days fly by so you don't really notice the hours. Advice to Management Management is flexible which is appreciated.", "rating": 5, "pros": "Great place to learn how to do the job. The training is outstanding and there is continual progression, regardless of your level or experience. The fact that the company has meritocratic approach to progression is very motivational, it inspires potential managers and there is a genuine belief that if you work hard you will be given your opportunity to progress. The commission is also very fair, the 75% team 25% individual rewards high achievers without completely taking away the merits of working as a team.", "cons": "The hours can be long, however this is an industry standard. The work hard play hard culture of the business means that the days fly by so you don't really notice the hours.", "advice": "Management is flexible which is appreciated."}, {"title": "Very Happy!", "text": "Pros When I first joined Venn Group, I was looking for a recruitment company that would offer me extensive training (I'd never worked in sales previously), excellent earning potential and real opportunity to progress quickly and I have not been disappointed. The training is superb, my earnings have increased considerably year-on-year and I have been given both the opportunity and the support required to progress. Cons Some think the hours are long but that's not necessarily true when compared to other professions such as law and banking. At least working in recruitment means that you get financially rewarded for those the 'extra' hours! Advice to Management Keep doing what you're doing - I've felt fully supported throughout my time at Venn Group.", "rating": 5, "pros": "When I first joined Venn Group, I was looking for a recruitment company that would offer me extensive training (I'd never worked in sales previously), excellent earning potential and real opportunity to progress quickly and I have not been disappointed. The training is superb, my earnings have increased considerably year-on-year and I have been given both the opportunity and the support required to progress.", "cons": "Some think the hours are long but that's not necessarily true when compared to other professions such as law and banking. At least working in recruitment means that you get financially rewarded for those the 'extra' hours!", "advice": "Keep doing what you're doing - I've felt fully supported throughout my time at Venn Group."}, {"title": "Fantastic company to build your career", "text": "Pros The best part of working for Venn Group is the training structure and office atmosphere. Venn Group also offers brilliant benefits for instance the ride-to-work scheme and Venture points. Cons As is with all recruitment companies the hours are long but you get out what you put in.", "rating": 5, "pros": "The best part of working for Venn Group is the training structure and office atmosphere. Venn Group also offers brilliant benefits for instance the ride-to-work scheme and Venture points.", "cons": "As is with all recruitment companies the hours are long but you get out what you put in.", "advice": null}, {"title": "Good working environment but very sales focussed", "text": "Pros Very social and friendly company with a work hard play hard mentality. Working in close teams creates good morale and the managers are predominantly very good. They offer lots of support and training, particularly for new employees and are quick to act if you have any issues. Cons As with all recruitment companies - long hours, few breaks and pressure to hit targets. Be very sure that you want to work in a sales role as this is the main element in recruitment.", "rating": 5, "pros": "Very social and friendly company with a work hard play hard mentality. Working in close teams creates good morale and the managers are predominantly very good. They offer lots of support and training, particularly for new employees and are quick to act if you have any issues.", "cons": "As with all recruitment companies - long hours, few breaks and pressure to hit targets. Be very sure that you want to work in a sales role as this is the main element in recruitment.", "advice": null}, {"title": "Dishonest and a firm fan of bullying culture", "text": "Pros The commission was good if you work for the right team. Cons Dishonest management No flexibility Poor insight into the firm at interview stage Long hours Scandal a plenty across the firm involving those at Director level Inappropriate conduct from management during social events Advice to Management Just stop", "rating": 1, "pros": "The commission was good if you work for the right team.", "cons": "Dishonest management", "advice": "Just stop"}, {"title": "Fantastic Employer", "text": "Pros Very good training and excellent long term career progression. Too many people jump ship too early but many come back to Venn Group having learnt the grass insn't greener on the other side. Sure you can probably change jobs every few years for more money but if you really want a long term career in recruitment then you need to ideally stay at one place for many years to learn the whole process from junior consultant to senior management and beyond and Venn Group is an excellent place to do that. Most of the negative reviews are I suspect from people who were not good enough at recruitment and blame Venn Group for own inadequacies. Very open and approachable directors. Cons Some think the hours are long but they are not compared to some industries such as lawyers. At the end of the day it is a commission based job which is why we also chose recruitment and the more you put in the more you get out like most sales jobs. Advice to Management Continue to be flexible with your staff requests - it really is appreciated.", "rating": 5, "pros": "Very good training and excellent long term career progression. Too many people jump ship too early but many come back to Venn Group having learnt the grass insn't greener on the other side. Sure you can probably change jobs every few years for more money but if you really want a long term career in recruitment then you need to ideally stay at one place for many years to learn the whole process from junior consultant to senior management and beyond and Venn Group is an excellent place to do that. Most of the negative reviews are I suspect from people who were not good enough at recruitment and blame Venn Group for own inadequacies. Very open and approachable directors.", "cons": "Some think the hours are long but they are not compared to some industries such as lawyers. At the end of the day it is a commission based job which is why we also chose recruitment and the more you put in the more you get out like most sales jobs.", "advice": "Continue to be flexible with your staff requests - it really is appreciated."}, {"title": "Hard work and persistence are rewarded by attractive paycheques and enviable social life", "text": "Pros This job was my first exposure to a wholly corporate environment, following roles in retail and hospitality. The most impressive part was the depth of training and support given from the outset: it never felt as if I was left to anything I couldn’t manage. The financial rewards were evident after passing the probationary period as I started noticing the extra commission in my paycheque. You do work hard for the rewards, with long hours compared to traditional office roles, but you also benefit from a great bunch of colleagues and a fun, ‘play hard’ social life. Cons Long hours, compared to traditional office roles, though they are similar to other sales role and markedly less than some other recruiters. Advice to Management Some more inter-office competitions and social events wouldn't go amiss.", "rating": 5, "pros": "This job was my first exposure to a wholly corporate environment, following roles in retail and hospitality. The most impressive part was the depth of training and support given from the outset: it never felt as if I was left to anything I couldn’t manage.", "cons": "Long hours, compared to traditional office roles, though they are similar to other sales role and markedly less than some other recruiters.", "advice": "Some more inter-office competitions and social events wouldn't go amiss."}, {"title": "Brilliant.", "text": "Pros Trainig,motivation,great team work. Excellent pay structure with commission Cons Long hours but who cares when incentivised Advice to Management Great management structure. All are approachable from CEO down", "rating": 5, "pros": "Trainig,motivation,great team work.", "cons": "Long hours but who cares when incentivised", "advice": "Great management structure. All are approachable from CEO down"}, {"title": "Very KPI focused and a high turnover of staff", "text": "Pros I made some great friends here Team based commission structure which can be beneficial as there isn't a cut throat culture as there is in some agencies Cons The salary in comparison to other agencies is not great. I started on a 20K basic. and after 3 years was on 25K basic They are very KPI focussed, you have to make 20 business development calls to clients a day which are monitored constantly... Plus getting leads from candidates, sending CVs to client, sending e-shots and others. Communication from management is not clear or honest Team commission- If you are a high biller it can be frustrating watching your commission go to your team mates Advice to Management Treat employees as adults!", "rating": 3, "pros": "I made some great friends here", "cons": "The salary in comparison to other agencies is not great. I started on a 20K basic. and after 3 years was on 25K basic", "advice": "Treat employees as adults!"}, {"title": "Good company to work for", "text": "Pros The salary is very good for graduates, especially with commission. The people are great, and working in teams with team based commission creates a good working atmosphere. The managers and directors are very approachable, and although there are monthly targets they are very realistic. Cons The hours are very long, and you are often expected to stay even later without getting paid for it. Although the salary and team commission is great for graduates, for experienced consultants it is well below industry average. Also the job and commission is very different dependent on which team you are on, and I think you should be told about this beforehand. Advice to Management Reward the more experienced consultants with higher basic salaries and better commission, also make the training more structured and consistent.", "rating": 5, "pros": "The salary is very good for graduates, especially with commission. The people are great, and working in teams with team based commission creates a good working atmosphere. The managers and directors are very approachable, and although there are monthly targets they are very realistic.", "cons": "The hours are very long, and you are often expected to stay even later without getting paid for it. Although the salary and team commission is great for graduates, for experienced consultants it is well below industry average. Also the job and commission is very different dependent on which team you are on, and I think you should be told about this beforehand.", "advice": "Reward the more experienced consultants with higher basic salaries and better commission, also make the training more structured and consistent."}, {"title": "Great fun place to work", "text": "Pros You will work somewhere that is like a family. They really know how to have fun. There are good benefits and they are flexible if you need time off for family reasons. I have thoroughly enjoyed my time working at Venn Group especially the charity day and the summer and christmas away day. Cons The hours are quite long for the consultants and I believe that they would benefit from allowing consultants a bit more freedom with their time. Advice to Management Consistency between Senior Management is key and perhaps a little lacking.", "rating": 5, "pros": "You will work somewhere that is like a family. They really know how to have fun.", "cons": "The hours are quite long for the consultants and I believe that they would benefit from allowing consultants a bit more freedom with their time.", "advice": "Consistency between Senior Management is key and perhaps a little lacking."}, {"title": "Great recruitment company to work for", "text": "Pros Management are really approachable - from team managers through to directors. They have worked their way up in the company from consultant level, so the daily input on your performance (getting advice on how to improve as well as getting praise when something has gone well) is invaluable as they were once in your shoes! You feel that it’s really in their interests to support you and get you billing as much as you can. In addition, everyone sits in an open plan office which creates a great atmosphere; overall I find the working environment very motivating. The training is great, with a mixture of on the desk training and ‘classroom’ based training. In the first few months, the graduate training programme includes regular sessions which give you a good grounding to kick start your career with Venn Group. Training continues beyond your early months, with refresher courses and more advanced training supporting you as you progress. The social side is great too, there is always someone to go to the pub with after a hard day, there are regular team socials and each month the company celebrates how well it has done with “Fizzy Friday” where champagne and beer is provided! Cons The job can be demanding with monthly targets to hit and long hours, plus dealing with people is always unpredictable and stressful! However, as long as you are prepared for this and are money motivated then it is worth it. Be sure to consider this carefully before embarking on a career in recruitment.", "rating": 5, "pros": "Management are really approachable - from team managers through to directors. They have worked their way up in the company from consultant level, so the daily input on your performance (getting advice on how to improve as well as getting praise when something has gone well) is invaluable as they were once in your shoes! You feel that it’s really in their interests to support you and get you billing as much as you can. In addition, everyone sits in an open plan office which creates a great atmosphere; overall I find the working environment very motivating.", "cons": "The job can be demanding with monthly targets to hit and long hours, plus dealing with people is always unpredictable and stressful! However, as long as you are prepared for this and are money motivated then it is worth it. Be sure to consider this carefully before embarking on a career in recruitment.", "advice": null}, {"title": "Excellent company to work for!", "text": "Pros If you want a company that looks after its staff, has a competitive commission structure recognising team and individual efforts as well as an industry leading training programme, then this is the company for you. Working in an open planned environment with bright, competitive and ambitious people topped with organic growth from only promoting from within will mean you are given all the tools you need to succeed in your career. It also helps that Venn Group is an incredibly sociable company, there are always nights out planned and ‘fizzy Friday’ is never that far away at the end of the month..! Cons Working in Recruitment is not easy, it is incredibly hard work to meet the demands of the job on a daily basis and is definitely not for everyone so think carefully about the role when you are starting to look. We have a great internal recruitment team here who will guide you through the recruitment process ensuring you are making the right decisions in your career. Like any successful company our size we are not perfect but work hard to constantly evolve. Staff have regular consultation days with the Chief Executive where they have the opportunity to voice changes they would like to see both internally and externally – as a company they have made some significant changes off the back of these meetings which is great to see.", "rating": 5, "pros": "If you want a company that looks after its staff, has a competitive commission structure recognising team and individual efforts as well as an industry leading training programme, then this is the company for you. Working in an open planned environment with bright, competitive and ambitious people topped with organic growth from only promoting from within will mean you are given all the tools you need to succeed in your career. It also helps that Venn Group is an incredibly sociable company, there are always nights out planned and ‘fizzy Friday’ is never that far away at the end of the month..!", "cons": "Working in Recruitment is not easy, it is incredibly hard work to meet the demands of the job on a daily basis and is definitely not for everyone so think carefully about the role when you are starting to look. We have a great internal recruitment team here who will guide you through the recruitment process ensuring you are making the right decisions in your career. Like any successful company our size we are not perfect but work hard to constantly evolve. Staff have regular consultation days with the Chief Executive where they have the opportunity to voice changes they would like to see both internally and externally – as a company they have made some significant changes off the back of these meetings which is great to see.", "advice": null}, {"title": "The worst job I have ever had!", "text": "Pros The team members were great Cons The money is well bellow industry standard Team commission is terrible They bully you and tell you how bad you are, then you resign for a better job, tell you that you will fail but then counter offer you to stay They have a floored business plans Their culture is to hit you with a stick and reward you will the crumbs of a carrot Advice to Management Change your attitude to your employees, pay them more, change the business plan, working late doesnt mean you make more money", "rating": 1, "pros": "The team members were great", "cons": "The money is well bellow industry standard", "advice": "Change your attitude to your employees, pay them more, change the business plan, working late doesnt mean you make more money"}, {"title": "Worst company ever", "text": "Pros at first seems a very well controlled business, but not when you actually get offered a job then the dramas begin Cons the company is a con convinced me in to a job that was miles away from what was discussed, changes like the weather do not trust them with a barge pole, changed pay rate at own will. decided to leave when they would not co-operate. Advice to Management should be ashamed to be a manger and with emplyees that lie just to cover the roles", "rating": 1, "pros": "at first seems a very well controlled business, but not when you actually get offered a job then the dramas begin", "cons": "the company is a con convinced me in to a job that was miles away from what was discussed, changes like the weather do not trust them with a barge pole, changed pay rate at own will. decided to leave when they would not co-operate.", "advice": "should be ashamed to be a manger and with emplyees that lie just to cover the roles"}, {"title": "Long hours, bad management", "text": "Pros Good salary for a grad with no experience Cons Long hours and terrible motivational tehcniques from managers - would often shout & bully Advice to Management Create a sense of morale and get employee engagement by NOT bullying", "rating": 3, "pros": "Good salary for a grad with no experience", "cons": "Long hours and terrible motivational tehcniques from managers - would often shout & bully", "advice": "Create a sense of morale and get employee engagement by NOT bullying"}]