[{"title": "Life & Career Changing", "text": "Pros -Interns that take initiative can transition into employees -Opportunities for growth and development -Internal Mobility -Cool corporate culture and office vibe -Fun employee perks -Supportive Management -Flexible work arrangements Cons The main office is located in Times Square, which can be a challenging area to work because of traffic/tourists, but at least it has access to most public transportation.", "rating": 5, "pros": "-Interns that take initiative can transition into employees", "cons": "The main office is located in Times Square, which can be a challenging area to work because of traffic/tourists, but at least it has access to most public transportation.", "advice": null}, {"title": "Positive Summer Intern Experience", "text": "Pros - Good pay - Easy workload - Easygoing work environment Cons - Lack of tasks given - Not much of a challenge Advice to Management - Give technical interns more practical tasks", "rating": 5, "pros": "- Good pay", "cons": "- Lack of tasks given", "advice": "- Give technical interns more practical tasks"}, {"title": "Great place to work!", "text": "Pros Great benefits. Great people. Summer Fridays! Cons Low salary compared to industry. Internal mobility is limited", "rating": 5, "pros": "Great benefits. Great people. Summer Fridays!", "cons": "Low salary compared to industry. Internal mobility is limited", "advice": null}, {"title": "Summer Internship at Viacom, New York", "text": "Pros -frequent events for employees -receptive and responsive HR department Cons -Times Square location can be annoying -Frequent layoffs and restructuring can create culture of fear and instability", "rating": 5, "pros": "-frequent events for employees", "cons": "-Times Square location can be annoying", "advice": null}, {"title": "good", "text": "Pros people are willing to teach Cons skeptical about company growth prospect", "rating": 5, "pros": "people are willing to teach", "cons": "skeptical about company growth prospect", "advice": null}, {"title": "Great Company Overall", "text": "Pros Great team energy and collaboration Amazing benefits Cons Consistent reorganizations of teams makes it difficult to grasp the direction of your team. Advice to Management Provide more clarity to teams and reevaluate the strengths within existing teams before adding unnecessary and under-qualified recruits.", "rating": 5, "pros": "Great team energy and collaboration", "cons": "Consistent reorganizations of teams makes it difficult to grasp the direction of your team.", "advice": "Provide more clarity to teams and reevaluate the strengths within existing teams before adding unnecessary and under-qualified recruits."}, {"title": "Great culture and benefits, poor outlook and product quality.", "text": "Pros The people are great, the benefits are great, and it's fun to make a big impact on global entertainment brands. Cons The future of the company is poor, so morale isn't high. Product groups tend to focus more on satisfying deadlines and internal stakeholders rather than shipping high quality products. Advice to Management Focus on quality and competitors and define a future for the company.", "rating": 3, "pros": "The people are great, the benefits are great, and it's fun to make a big impact on global entertainment brands.", "cons": "The future of the company is poor, so morale isn't high. Product groups tend to focus more on satisfying deadlines and internal stakeholders rather than shipping high quality products.", "advice": "Focus on quality and competitors and define a future for the company."}, {"title": "Experience", "text": "Pros Strong business performance. Merit based promotion. Competitive compensation creative environment Cons Few if any cons to express", "rating": 5, "pros": "Strong business performance. Merit based promotion. Competitive compensation creative environment", "cons": "Few if any cons to express", "advice": null}, {"title": "Love it here", "text": "Pros Fun environment, good pay, interesting projects. The corporate culture is exciting and Viacom does serious work to boost company morale. Cons Long hours / More work, with not enough people to do.", "rating": 5, "pros": "Fun environment, good pay, interesting projects. The corporate culture is exciting and Viacom does serious work to boost company morale.", "cons": "Long hours / More work, with not enough people to do.", "advice": null}, {"title": "Viacom", "text": "Pros Great benefits, tons of vacation time, casual dress code Cons Huge company, lots of red tape", "rating": 5, "pros": "Great benefits, tons of vacation time, casual dress code", "cons": "Huge company, lots of red tape", "advice": null}, {"title": "Executive Assistant", "text": "Pros Fun with lots of benefits for employees. Very entertaining atmosphere Cons Having to work for people with diva attitudes Advice to Management Please be open to seeing all candidates!", "rating": 5, "pros": "Fun with lots of benefits for employees. Very entertaining atmosphere", "cons": "Having to work for people with diva attitudes", "advice": "Please be open to seeing all candidates!"}, {"title": "Great company to work for", "text": "Pros Great flexibility for working hours Good salary Great benefits Generous PTO Cons A bit too bureaucratic sometimes", "rating": 5, "pros": "Great flexibility for working hours", "cons": "A bit too bureaucratic sometimes", "advice": null}, {"title": "Internship", "text": "Pros Culture, Community, Location, Prestige, Opportunities Cons Can get lost in the shuffle, not a lot of room for salary negotiation,", "rating": 5, "pros": "Culture, Community, Location, Prestige, Opportunities", "cons": "Can get lost in the shuffle, not a lot of room for salary negotiation,", "advice": null}, {"title": "assistant", "text": "Pros location, people, and hardworking environment Cons I cannot think of any cons Advice to Management none", "rating": 5, "pros": "location, people, and hardworking environment", "cons": "I cannot think of any cons", "advice": "none"}, {"title": "Inventory Analyst", "text": "Pros Great room for growth and a lot to learn. The company usually promotes within which is good. Also offers classes to learn. Cons Too much company restructuring. Stop keeping higher ups at a high salary and firing entry level for a lower rate Advice to Management Make better moves when restructuring", "rating": 5, "pros": "Great room for growth and a lot to learn. The company usually promotes within which is good. Also offers classes to learn.", "cons": "Too much company restructuring. Stop keeping higher ups at a high salary and firing entry level for a lower rate", "advice": "Make better moves when restructuring"}, {"title": "intern", "text": "Pros great people, great work environment Cons the pay is not very high, and the program is short Advice to Management great job!", "rating": 5, "pros": "great people, great work environment", "cons": "the pay is not very high, and the program is short", "advice": "great job!"}, {"title": "Positive Experience", "text": "Pros Great working environment and exciting new age projects. Cons Some elements of outdated project execution practices.", "rating": 5, "pros": "Great working environment and exciting new age projects.", "cons": "Some elements of outdated project execution practices.", "advice": null}, {"title": "Viacom Media Inc. Review", "text": "Pros The people are great, good PTO, relaxed environment, fun work events Cons Pay stinks, long hours, brands are getting worse Advice to Management Increase pay, work on making the brands better", "rating": 5, "pros": "The people are great, good PTO, relaxed environment, fun work events", "cons": "Pay stinks, long hours, brands are getting worse", "advice": "Increase pay, work on making the brands better"}, {"title": "Technology Management Clueless", "text": "Pros Cool industry, company has lots of cool and fun events for employees Cons Management is short sighted, letting go of good people, promoting people who are popular but have a history of failure Advice to Management Promote people who deliver and succeed.", "rating": 3, "pros": "Cool industry, company has lots of cool and fun events for employees", "cons": "Management is short sighted, letting go of good people, promoting people who are popular but have a history of failure", "advice": "Promote people who deliver and succeed."}, {"title": "Viacom Staff", "text": "Pros Casual Environment, Variety of Employees and Contacts Cons Senior Management, Bureaucracy, Lack of Direction", "rating": 3, "pros": "Casual Environment, Variety of Employees and Contacts", "cons": "Senior Management, Bureaucracy, Lack of Direction", "advice": null}, {"title": "Good job", "text": "Pros Great people. Good snacks. Happy Cons Long hours, long elevator rides", "rating": 5, "pros": "Great people. Good snacks. Happy", "cons": "Long hours, long elevator rides", "advice": null}, {"title": "Great Benefits, Very Political", "text": "Pros Great benefits, great employee perks, fun work environment. Cons Extremely competitive. People often promoted based on seniority, not qualifications.", "rating": 3, "pros": "Great benefits, great employee perks, fun work environment.", "cons": "Extremely competitive. People often promoted based on seniority, not qualifications.", "advice": null}, {"title": "Good Company", "text": "Pros Good work environment and great brands to represent Cons Low pay and lack of leadership from sr management Advice to Management care more about the professional development of the young employees", "rating": 3, "pros": "Good work environment and great brands to represent", "cons": "Low pay and lack of leadership from sr management", "advice": "care more about the professional development of the young employees"}, {"title": "Alright", "text": "Pros I loved my job, working for Neopets. Cons Viacom doesn't pay much attention to it's smaller projects. Advice to Management Maybe let employees know you're planning to sell the project they've been working on for years.", "rating": 5, "pros": "I loved my job, working for Neopets.", "cons": "Viacom doesn't pay much attention to it's smaller projects.", "advice": "Maybe let employees know you're planning to sell the project they've been working on for years."}, {"title": "Client Service Representative", "text": "Pros Great content and channels. Great managers who are willing to help you grow. Cons Low pay, short staffed, and heavy account loads Advice to Management Keep on working to guide and lead from internal positions", "rating": 5, "pros": "Great content and channels. Great managers who are willing to help you grow.", "cons": "Low pay, short staffed, and heavy account loads", "advice": "Keep on working to guide and lead from internal positions"}, {"title": "Summer Associate", "text": "Pros Very diverse and inclusive environment Cons Issues with upper management and internal communication.", "rating": 3, "pros": "Very diverse and inclusive environment", "cons": "Issues with upper management and internal communication.", "advice": null}, {"title": "Analyst", "text": "Pros Culture, great environment, great team, good benefits, and fun company to work for. Cons Promotions are tough, working in Time Square, TV media is tough industry to work in due to the declines in linear TV.", "rating": 5, "pros": "Culture, great environment, great team, good benefits, and fun company to work for.", "cons": "Promotions are tough, working in Time Square, TV media is tough industry to work in due to the declines in linear TV.", "advice": null}, {"title": "Client Service Representative", "text": "Pros SO many work perks, a really young and energized office. There are so many fun activities to do during the day to get away from your desk. All of the people are great - have made lifelong friendships Cons Hard to move up internally - company does not do a great job of keeping talent within the company. Long hours and very low pay Advice to Management Create a better system to notify employees of new open positions", "rating": 5, "pros": "SO many work perks, a really young and energized office. There are so many fun activities to do during the day to get away from your desk. All of the people are great - have made lifelong friendships", "cons": "Hard to move up internally - company does not do a great job of keeping talent within the company. Long hours and very low pay", "advice": "Create a better system to notify employees of new open positions"}, {"title": "Finance", "text": "Pros Enough PTO offered so that you can take time for your health needs, your family’s health needs, kids’ school events, and have enough for an actual vacation. Cons The pay is miserably low for employees under the executive level. Executive pay, benefits and perks are extraordinary. Read the proxy disclosures. Advice to Management Narrow the gap in pay between top levels and the rest of the organization.", "rating": 3, "pros": "Enough PTO offered so that you can take time for your health needs, your family’s health needs, kids’ school events, and have enough for an actual vacation.", "cons": "The pay is miserably low for employees under the executive level. Executive pay, benefits and perks are extraordinary. Read the proxy disclosures.", "advice": "Narrow the gap in pay between top levels and the rest of the organization."}, {"title": "Fun company, not great benefits", "text": "Pros The company is pretty fun to work for. There are a lot of perks to the job - young, energetic staff, traveling to shoot locations, meeting celebrities, getting cool swag. Cons The hours are long and sometimes thankless, the benefits are almost non-existent to freelancers, and it is definitely not a family oriented company. It can also be hard to advance within the company, unless you leave and come back to a higher position. Advice to Management Look to promote within the company, rather than always looking for outside people to fill positions.", "rating": 5, "pros": "The company is pretty fun to work for. There are a lot of perks to the job - young, energetic staff, traveling to shoot locations, meeting celebrities, getting cool swag.", "cons": "The hours are long and sometimes thankless, the benefits are almost non-existent to freelancers, and it is definitely not a family oriented company. It can also be hard to advance within the company, unless you leave and come back to a higher position.", "advice": "Look to promote within the company, rather than always looking for outside people to fill positions."}, {"title": "Exciting brands, dated corporate culture", "text": "Pros Great benefits, PTO policy, summer Fridays. Fun activities always going on in NYHQ. Great things going on within each brand, but very hard to feel part of it when you work in the shared services department. People are friendly and the office is casual. The new renovated floors are great workspaces if you're lucky enough to be in one. Cons Low salaries, very dated corporate culture. Job titles and hierarchy count for everything. People in senior positions have worked here for 10-20 years and are very protective of their VP titles, status and corner offices. Lots of reporting deadlines and repetitive work. Advice to Management Delegation is empowering!! Break down the rigid lines of hierarchy, remove closed door meetings and communicate information more frequently from the top down. Your teams will shine when you give them to power to do so! Bob is a great new leader so hopefully things will change.", "rating": 3, "pros": "Great benefits, PTO policy, summer Fridays. Fun activities always going on in NYHQ. Great things going on within each brand, but very hard to feel part of it when you work in the shared services department. People are friendly and the office is casual. The new renovated floors are great workspaces if you're lucky enough to be in one.", "cons": "Low salaries, very dated corporate culture. Job titles and hierarchy count for everything. People in senior positions have worked here for 10-20 years and are very protective of their VP titles, status and corner offices. Lots of reporting deadlines and repetitive work.", "advice": "Delegation is empowering!! Break down the rigid lines of hierarchy, remove closed door meetings and communicate information more frequently from the top down. Your teams will shine when you give them to power to do so! Bob is a great new leader so hopefully things will change."}, {"title": "Good place to work", "text": "Pros Great benefits and they are good at internal promotions. Cons Hours can sometimes be long", "rating": 5, "pros": "Great benefits and they are good at internal promotions.", "cons": "Hours can sometimes be long", "advice": null}, {"title": "Viacom, Company At The Crossroads", "text": "Pros The company has great benefits and takes care of its employees. Firm believer in diversity when it comes to hiring. Forward thinking and fun work environment that promotes and rewards creativity. Cons The company is great to its employees... until the numbers don't add up and the managers don't hit their budgets. Then the layoffs come and it can be brutal. Diversity in the work place does not include age. Once you hit 50 your days are numbered. There's never been a retirement party at Viacom. NIckelodeon is on firm ground, but the rest of their cable networks are on thin ice. The rise of Netflix, Hulu and the cord cutting amongst their former core audience has created a downward spiral, not helped by the poor programming development over the past decade across the board. The current CEO has two years to turn it around. Advice to Management CEO is making all the right decisions with the exception of tossing people out just because they've been with the company too long. Yes some need to go, but others have valuable experience that can't be replaced.", "rating": 5, "pros": "The company has great benefits and takes care of its employees.", "cons": "The company is great to its employees... until the numbers don't add up and the managers don't hit their budgets. Then the layoffs come and it can be brutal.", "advice": "CEO is making all the right decisions with the exception of tossing people out just because they've been with the company too long. Yes some need to go, but others have valuable experience that can't be replaced."}, {"title": "Pay your employees market value!!!!", "text": "Pros Fun brands to work for, work life balance is great, excellent health insurance, lots of fun \"soft\" perks like access to Paramount Movies before they're in theaters. It's a great place to start a career. Cons Not a great place for your career to develop after reaching middle management level. It's very cliquish, as a result, promotions are often due to who you're friends with rather than your performance. However really the biggest con of working at Viacom is the deplorable salary. Even when you consider bonuses, Viacom's pay is SIGNIFICANTLY lower than other media companies. Upon leaving for another media company, I earned a 40% raise, even though the new role was for a lower title. If Viacom wants to retain talent it works so hard to develop in entry level roles, they need to pay better. Advice to Management Stop spending thousands of dollars on Jacques Torres chocolate to give to employees chocolate on Valentines day, and other ridiculously unnecessary and expensive \"soft\" perks, and pay employees what they deserve.", "rating": 3, "pros": "Fun brands to work for, work life balance is great, excellent health insurance, lots of fun \"soft\" perks like access to Paramount Movies before they're in theaters. It's a great place to start a career.", "cons": "Not a great place for your career to develop after reaching middle management level. It's very cliquish, as a result, promotions are often due to who you're friends with rather than your performance. However really the biggest con of working at Viacom is the deplorable salary. Even when you consider bonuses, Viacom's pay is SIGNIFICANTLY lower than other media companies. Upon leaving for another media company, I earned a 40% raise, even though the new role was for a lower title. If Viacom wants to retain talent it works so hard to develop in entry level roles, they need to pay better.", "advice": "Stop spending thousands of dollars on Jacques Torres chocolate to give to employees chocolate on Valentines day, and other ridiculously unnecessary and expensive \"soft\" perks, and pay employees what they deserve."}, {"title": "Was a great place to work, but....", "text": "Pros Great Work/Life Balance. Good vacation time, company perks with the brands. Cons Constant downsizing...and without merit. One person doing a job of 4 people!! Advice to Management Get your act together. You have awesome and talentex people working for you. Quit screwing them over!", "rating": 5, "pros": "Great Work/Life Balance. Good vacation time, company perks with the brands.", "cons": "Constant downsizing...and without merit. One person doing a job of 4 people!!", "advice": "Get your act together. You have awesome and talentex people working for you. Quit screwing them over!"}, {"title": "ok", "text": "Pros the department that I worked with were like a family to me. Cons Too much physical work. Not challenging for me in a way that I felt useful.", "rating": 3, "pros": "the department that I worked with were like a family to me.", "cons": "Too much physical work. Not challenging for me in a way that I felt useful.", "advice": null}, {"title": "Specialist Commercial Operations", "text": "Pros benefits, PTO, people, flexibility, culture Cons salary, location, management, growth, culture", "rating": 5, "pros": "benefits, PTO, people, flexibility, culture", "cons": "salary, location, management, growth, culture", "advice": null}, {"title": "Work environment", "text": "Pros Amazing people to surround yourself with. Cons Time difference with East coast dealings nit always the best.", "rating": 5, "pros": "Amazing people to surround yourself with.", "cons": "Time difference with East coast dealings nit always the best.", "advice": null}, {"title": "An ok place as your first job out of college", "text": "Pros good benefits. good location makes for an easy commute Cons nothing creative takes place in the tech teams. just maintenance and support. very boring. Therefore, there is very little opportunity to develop your career or learn something new.", "rating": 3, "pros": "good benefits.", "cons": "nothing creative takes place in the tech teams. just maintenance and support. very boring.", "advice": null}, {"title": "ok", "text": "Pros has great benefits and perks Cons expect a lot from perma lance employees", "rating": 3, "pros": "has great benefits and perks", "cons": "expect a lot from perma lance employees", "advice": null}, {"title": "The past few years at Viacom have been very chaotic.", "text": "Pros Viacom is a global company. Therefore there is much opportunity to get involved in many initiatives. The company is entertainment and media focused, so it had a relatively relaxed and liberal culture. Many good people work there despite the recent troubles of the company. Cons In recent years working at the company has been chaotic and insecure. Recent well publicized battles among senior leadership, reorganization and reductions in staff have made working at Viacom difficult.", "rating": 5, "pros": "Viacom is a global company. Therefore there is much opportunity to get involved in many initiatives. The company is entertainment and media focused, so it had a relatively relaxed and liberal culture. Many good people work there despite the recent troubles of the company.", "cons": "In recent years working at the company has been chaotic and insecure. Recent well publicized battles among senior leadership, reorganization and reductions in staff have made working at Viacom difficult.", "advice": null}, {"title": "Executive Assistant", "text": "Pros Benefits work perks great people great hours A Real Family Cons Salary could match the financial districts assistant salaries Times Square", "rating": 5, "pros": "Benefits", "cons": "Salary could match the financial districts assistant salaries", "advice": null}, {"title": "Great Company!", "text": "Pros Great benefits including flexible schedules. Cons Higher ups tend to stay making room to grow difficult.", "rating": 5, "pros": "Great benefits including flexible schedules.", "cons": "Higher ups tend to stay making room to grow difficult.", "advice": null}, {"title": "ad operations specialist", "text": "Pros the benefits and events are wonderful and great way to network Cons depending the dept, growth can be limited", "rating": 3, "pros": "the benefits and events are wonderful and great way to network", "cons": "depending the dept, growth can be limited", "advice": null}, {"title": "Terrible Management, lacking any leadership", "text": "Pros You have the opportunity to work with some amazing people all over the globe. Cons No work/life balance. Tennessee office loves a brown noser so be prepared to only be noticed for your strong Christian social skills and not for your work ethic. They hold payments from vendors for a couple of months out of the year so you're going to get berated by vendors and other offices because you can't tell them why the payments aren't being released- No reason. Just trying to meet a boardroom quota. Advice to Management Need new HR in NY office or get HR in the Tennessee office that actually does their job. See jaded upper management out the door, there's no reasoning with that mess.", "rating": 1, "pros": "You have the opportunity to work with some amazing people all over the globe.", "cons": "No work/life balance. Tennessee office loves a brown noser so be prepared to only be noticed for your strong Christian social skills and not for your work ethic. They hold payments from vendors for a couple of months out of the year so you're going to get berated by vendors and other offices because you can't tell them why the payments aren't being released- No reason. Just trying to meet a boardroom quota.", "advice": "Need new HR in NY office or get HR in the Tennessee office that actually does their job. See jaded upper management out the door, there's no reasoning with that mess."}, {"title": "SR FINANCIAL ANALYST", "text": "Pros Company culture is great. Hours are not as bad but depends on the team you are currently working with. Cons Low Pay and there is unusually high turnover.", "rating": 3, "pros": "Company culture is great. Hours are not as bad but depends on the team you are currently working with.", "cons": "Low Pay and there is unusually high turnover.", "advice": null}, {"title": "Senior Product Manager", "text": "Pros Investing substantial money in improving facilities Exposure to big Technology partner contacts Cons In light of the various reorganization and layoffs, understanding ones role and the roles of others is very challenging. Job descriptions, where even available, are often inaccurate Culture of finger pointing as opposed to proactive problem solving Process to achieve work ever evolving and a moving target. Yet, despite this, we’re still given insane deadlines Rapid change causes peers to be divisive and aggressive Advice to Management It’s important to look out for your team when reorg and layoff happen. Too often management is more concerned about their own longevity", "rating": 3, "pros": "Investing substantial money in improving facilities", "cons": "In light of the various reorganization and layoffs, understanding ones role and the roles of others is very challenging. Job descriptions, where even available, are often inaccurate", "advice": "It’s important to look out for your team when reorg and layoff happen. Too often management is more concerned about their own longevity"}, {"title": "Great if you have the right internal connections", "text": "Pros Awesome benefits. Flexible hours (but you work a lot). Very fair compensation. Fun environment. The most diverse company I (or any of my friends have worked for) Cons If you're not cozy with the 'in' crowd, it would be tough to navigate", "rating": 3, "pros": "Awesome benefits. Flexible hours (but you work a lot). Very fair compensation. Fun environment. The most diverse company I (or any of my friends have worked for)", "cons": "If you're not cozy with the 'in' crowd, it would be tough to navigate", "advice": null}, {"title": "great place to work", "text": "Pros Good pay & good benefits, you could tell that the company actually cared about you, they have a lot of groups for you to join and workout classes & cafeteria in the building. Cons Just the normal stuff at a large company, sometimes things are slower to happen and there are politics involved.", "rating": 5, "pros": "Good pay & good benefits, you could tell that the company actually cared about you, they have a lot of groups for you to join and workout classes & cafeteria in the building.", "cons": "Just the normal stuff at a large company, sometimes things are slower to happen and there are politics involved.", "advice": null}, {"title": "Middle Manager", "text": "Pros The culture is fun and relaxed Cons The changes is direction and leadership are chaotic", "rating": 3, "pros": "The culture is fun and relaxed", "cons": "The changes is direction and leadership are chaotic", "advice": null}, {"title": "Good company, great benefits", "text": "Pros The benefits are great - I get more time off than I can use. Work arrangements can be flexible and most teams have a good working dynamic. Cons It's huge, and that causes complications. Currently, the teams don't always work well across divisions, but they are trying to fix that. Advice to Management Beware of bad managers causing good talent to leave.", "rating": 3, "pros": "The benefits are great - I get more time off than I can use. Work arrangements can be flexible and most teams have a good working dynamic.", "cons": "It's huge, and that causes complications. Currently, the teams don't always work well across divisions, but they are trying to fix that.", "advice": "Beware of bad managers causing good talent to leave."}, {"title": "Senior Software Engineer", "text": "Pros Progressive, New Technologies, Casual, Relaxed Environment Cons Nothing much comes to mind.", "rating": 3, "pros": "Progressive, New Technologies, Casual, Relaxed Environment", "cons": "Nothing much comes to mind.", "advice": null}, {"title": "Coordinator", "text": "Pros Great perks! Laid back environment. Good hours! Cons all the typical cons of working within a giant corporation", "rating": 5, "pros": "Great perks! Laid back environment. Good hours!", "cons": "all the typical cons of working within a giant corporation", "advice": null}, {"title": "Marketing Design Intern", "text": "Pros Great atmosphere to be in. Cons Job security is a bit unstable, need to really get yourself in there.", "rating": 5, "pros": "Great atmosphere to be in.", "cons": "Job security is a bit unstable, need to really get yourself in there.", "advice": null}, {"title": "Pros/Cons", "text": "Pros The atmosphere at this company is great, and they have a good benefits program. Cons It's hard to grow and move up the ladder. Development feels stifled.", "rating": 5, "pros": "The atmosphere at this company is great, and they have a good benefits program.", "cons": "It's hard to grow and move up the ladder. Development feels stifled.", "advice": null}, {"title": "fun place", "text": "Pros casual work culture, flexible timings Cons bad pay, dont have vision to compete with top players", "rating": 3, "pros": "casual work culture, flexible timings", "cons": "bad pay, dont have vision to compete with top players", "advice": null}, {"title": "Great place to work, business challenges ahead", "text": "Pros A wonderful culture that allows you to have great creative freedom. Cons The business is rapidly changing and we need to accelerate our ability to adapt. No room for advancement.", "rating": 5, "pros": "A wonderful culture that allows you to have great creative freedom.", "cons": "The business is rapidly changing and we need to accelerate our ability to adapt.", "advice": null}, {"title": "Company Undergoing Reorganization", "text": "Pros * Good benefits * Diverse workforce * Good amenities (ex. company cafeteria with subsidized food) * 20 days paid vacation Cons * lots of uncertainty with reorg * not a lot of transparency around the process * not a lot of clarity about what the future is for the company (ex. doubling down on cable or venturing into paid subscriptions) * lots of people have been laid off * work can be boring as the interesting stuff like apps get farmed out while staff primarily works on websites Advice to Management Be more transparent with what the plan is moving forward with the reorg.", "rating": 3, "pros": "* Good benefits", "cons": "* lots of uncertainty with reorg", "advice": "Be more transparent with what the plan is moving forward with the reorg."}, {"title": "tax", "text": "Pros very nice good place to work Cons no cons good place to work", "rating": 5, "pros": "very nice good place to work", "cons": "no cons good place to work", "advice": null}, {"title": "Work Hard, Get Places", "text": "Pros Internal growth is there if you work hard for it Great people Great intranet Cons Permalance culture is strong here", "rating": 5, "pros": "Internal growth is there if you work hard for it", "cons": "Permalance culture is strong here", "advice": null}, {"title": "Amazing Place", "text": "Pros Great place to work!! Collaborative and creative environment. Cons Salaries seem to be a bit lower than other entertainment companies.", "rating": 5, "pros": "Great place to work!! Collaborative and creative environment.", "cons": "Salaries seem to be a bit lower than other entertainment companies.", "advice": null}, {"title": "Great company", "text": "Pros Great company to work in. Lots of events for people in the 30's. Cons Promotions are difficult to come by in the IT world.", "rating": 5, "pros": "Great company to work in. Lots of events for people in the 30's.", "cons": "Promotions are difficult to come by in the IT world.", "advice": null}, {"title": "A Good Launching Pad For Better Things", "text": "Pros - Great learning experience for entering the world of production. - Supervisors helped a great deal in advice and guidance. - Free food on occasions. Cons - No job security. - Difficult to become a staff employee. Advice to Management Increase morale of employees by adding benefits and make veteran employees staff and not in perpetual freelance limbo.", "rating": 5, "pros": "- Great learning experience for entering the world of production.", "cons": "- No job security.", "advice": "Increase morale of employees by adding benefits and make veteran employees staff and not in perpetual freelance limbo."}, {"title": "Manager", "text": "Pros Work life balance is good. Employee perks are great. Culture is excellent! Cons Salaries are a little below standard living costs in some positions.", "rating": 5, "pros": "Work life balance is good. Employee perks are great. Culture is excellent!", "cons": "Salaries are a little below standard living costs in some positions.", "advice": null}, {"title": "Intern", "text": "Pros I had a great experience. I had the opportunity to present what I had been working on the whole semester to the department. Cons Sometimes I didn't have anything to work on. Advice to Management Have meetings with the interns. Try to include them more.", "rating": 5, "pros": "I had a great experience. I had the opportunity to present what I had been working on the whole semester to the department.", "cons": "Sometimes I didn't have anything to work on.", "advice": "Have meetings with the interns. Try to include them more."}, {"title": "Content Distrubution Intern", "text": "Pros An amazing company, treat employees awesome Cons Treated like just another intern", "rating": 5, "pros": "An amazing company, treat employees awesome", "cons": "Treated like just another intern", "advice": null}, {"title": "Excellent Company Culture", "text": "Pros - Benefits - Paid time off ( vacation / sick days ) - Company culture - Appreciation of employees / perks - Excellent programs, courses and classes offered to employees Cons - Difficult to advance within departments - Low starting salaries - Challenging corporate systems in place that make easy tasks like submitting expenses...incredibly difficult and time consuming Advice to Management Have more opportunity for your internal assistants / managers to move up within departments and networks. I wanted to stay here and continue working for Viacom but after a year of looking / waiting there still wasn't a full-time opportunity to grow....and I had to look outside of the company.", "rating": 5, "pros": "- Benefits", "cons": "- Difficult to advance within departments", "advice": "Have more opportunity for your internal assistants / managers to move up within departments and networks. I wanted to stay here and continue working for Viacom but after a year of looking / waiting there still wasn't a full-time opportunity to grow....and I had to look outside of the company."}, {"title": "Viacom employment- good place to work", "text": "Pros Good benefits, time off and work/life balance. Cons Not much room to advance in company", "rating": 5, "pros": "Good benefits, time off and work/life balance.", "cons": "Not much room to advance in company", "advice": null}, {"title": "Depends on the team, but I loved mine", "text": "Pros Relaxed environment, dress code, fun groups of people Smart colleagues (for the most part) who will challenge you in a good way Benefits were sufficient and work life balance mostly good (summer Fridays!) Cons \"Internal mobility\" was promised, but not that easy Even as someone on the business side, I felt the old CEO was not \"creative\" focused Constant changes can impact morale Advice to Management Let the creative juices drive the business. Don't hold on to antiquated business models, but focus on what's next.", "rating": 5, "pros": "Relaxed environment, dress code, fun groups of people", "cons": "\"Internal mobility\" was promised, but not that easy", "advice": "Let the creative juices drive the business. Don't hold on to antiquated business models, but focus on what's next."}, {"title": "Great Company", "text": "Pros I loved the people I worked with here. And the culture was very fun and exciting. Cons Due to the infighting between Sr Management and the Owners we were always waiting for other shoe to drop. Tension was so thick you could cut it with a knife! Advice to Management Try not to let your own personal goals conflict with those of the well being of employees and the business!!", "rating": 5, "pros": "I loved the people I worked with here. And the culture was very fun and exciting.", "cons": "Due to the infighting between Sr Management and the Owners we were always waiting for other shoe to drop. Tension was so thick you could cut it with a knife!", "advice": "Try not to let your own personal goals conflict with those of the well being of employees and the business!!"}, {"title": "Good Company", "text": "Pros Cool office, great cafeteria, awesome location Cons sometimes I have literally nothing to do", "rating": 5, "pros": "Cool office, great cafeteria, awesome location", "cons": "sometimes I have literally nothing to do", "advice": null}, {"title": "Perks without some efficiencies", "text": "Pros Work environment, facilities, resources, travel, perks. Cons Red tape, takes HR forever to get things done, poor policies for studio employees. You need to really prod them hard for promotions and raises.", "rating": 5, "pros": "Work environment, facilities, resources, travel, perks.", "cons": "Red tape, takes HR forever to get things done, poor policies for studio employees. You need to really prod them hard for promotions and raises.", "advice": null}, {"title": "Director", "text": "Pros Great office parties and can drink during the day. Generous T & Es. Casual dress code. Large amount of vacation time, Summer Fridays and great health care benefits. Cons Very low salary, but I think this is typical for entertainment industry Very open office environment", "rating": 5, "pros": "Great office parties and can drink during the day. Generous T & Es. Casual dress code.", "cons": "Very low salary, but I think this is typical for entertainment industry", "advice": null}, {"title": "Enjoyed it", "text": "Pros Nice company to work for! Cons I have none at this time.", "rating": 5, "pros": "Nice company to work for!", "cons": "I have none at this time.", "advice": null}, {"title": "Human Resources", "text": "Pros Creative fun environment, broad based organization Cons Frequent change in leadership, culture", "rating": 5, "pros": "Creative fun environment, broad based organization", "cons": "Frequent change in leadership, culture", "advice": null}, {"title": "Disappointed in lack of growth opportunities and transparency", "text": "Pros Great culture, work perks, incredible benefits, centrally located Cons Turnover and restructures, poor managers with no training/bad behavior that gets no course correction, promotions and advancement for those with bad attitudes, no growth or development for the \"little guys\" Advice to Management Reward good employees - not just the squeaky wheels. Be kind to you people and don't leave them in the dark (where appropriate). It's not too late to fix this, but you'll continue to lose valuable employees if you don't act soon.", "rating": 3, "pros": "Great culture, work perks, incredible benefits, centrally located", "cons": "Turnover and restructures, poor managers with no training/bad behavior that gets no course correction, promotions and advancement for those with bad attitudes, no growth or development for the \"little guys\"", "advice": "Reward good employees - not just the squeaky wheels. Be kind to you people and don't leave them in the dark (where appropriate). It's not too late to fix this, but you'll continue to lose valuable employees if you don't act soon."}, {"title": "Great Culture!", "text": "Pros Fun and supportive culture where the employees are respected and cared about. Cons Hard to move up the ladder because employees rarely leave.", "rating": 5, "pros": "Fun and supportive culture where the employees are respected and cared about.", "cons": "Hard to move up the ladder because employees rarely leave.", "advice": null}, {"title": "Delivery (Yield) Analyst", "text": "Pros Great culture, fun work environment Cons Within the AdOps team, there are too many responsibilities within Yield. There should be a separation between campaign management and yield.", "rating": 1, "pros": "Great culture, fun work environment", "cons": "Within the AdOps team, there are too many responsibilities within Yield. There should be a separation between campaign management and yield.", "advice": null}, {"title": "Bills are paid", "text": "Pros Cool office, young vibes. Odd corporate structure. Cons Too many chiefs, not enough Indians.", "rating": 3, "pros": "Cool office, young vibes. Odd corporate structure.", "cons": "Too many chiefs, not enough Indians.", "advice": null}, {"title": "Not a bad company to work for", "text": "Pros strong company, great benefits, lots of teamwork. Company is good to their employees, fun environment to work in, lots of prestige, location in miami is great Cons Extremely political, very much a \"boys club\", constantly going through waves of lay offs; workforce is very young which does not provide enough expertise", "rating": 3, "pros": "strong company, great benefits, lots of teamwork. Company is good to their employees, fun environment to work in, lots of prestige, location in miami is great", "cons": "Extremely political, very much a \"boys club\", constantly going through waves of lay offs; workforce is very young which does not provide enough expertise", "advice": null}, {"title": "Financial Analyst", "text": "Pros recognizable name in media in NYC Cons company is in financial trouble", "rating": 3, "pros": "recognizable name in media in NYC", "cons": "company is in financial trouble", "advice": null}, {"title": "Company in Transition, Proceed with Caution", "text": "Pros Exciting industry to be in and lots of interesting projects Cons Middle management is often times overworked and understaffed Advice to Management Very top heavy company. Very few worker bees so executives tend to abuse middle-level management", "rating": 3, "pros": "Exciting industry to be in and lots of interesting projects", "cons": "Middle management is often times overworked and understaffed", "advice": "Very top heavy company. Very few worker bees so executives tend to abuse middle-level management"}, {"title": "Inventory Manager", "text": "Pros I loved my job for the people and what I was able to learn while at Viacom over the course of 7 years. My management was hands down, the best in the industry. Cons Viacom does not pay to industry standard. Politics also play a large role within the field of Inventory Management/Pricing, therefore, getting a raise even when overly warranted is nearly impossible. Advice to Management Pay to industry standard and weed out the employees who do not truly do handle do their jobs properly. Value the employees you have who want to stay but deserve more.", "rating": 5, "pros": "I loved my job for the people and what I was able to learn while at Viacom over the course of 7 years. My management was hands down, the best in the industry.", "cons": "Viacom does not pay to industry standard. Politics also play a large role within the field of Inventory Management/Pricing, therefore, getting a raise even when overly warranted is nearly impossible.", "advice": "Pay to industry standard and weed out the employees who do not truly do handle do their jobs properly. Value the employees you have who want to stay but deserve more."}, {"title": "Manager", "text": "Pros There is great work/life balance. There are many perks. Viacom is a fun place to work. There is lots of opportunity for growth. Cons The salary tends to be on the lower scale when comparing against competitors.", "rating": 5, "pros": "There is great work/life balance. There are many perks. Viacom is a fun place to work. There is lots of opportunity for growth.", "cons": "The salary tends to be on the lower scale when comparing against competitors.", "advice": null}, {"title": "Decent", "text": "Pros Free swag if you're in the consumer products division and good benefits and absence policy. Cons Transparency is an issue sometimes.", "rating": 3, "pros": "Free swag if you're in the consumer products division and good benefits and absence policy.", "cons": "Transparency is an issue sometimes.", "advice": null}, {"title": "Director", "text": "Pros Great progressive place to work. Cons There are no cons, thank you.", "rating": 5, "pros": "Great progressive place to work.", "cons": "There are no cons, thank you.", "advice": null}, {"title": "Decent starter job", "text": "Pros The perks are great Happy hours Cons Hard to move up old school management Advice to Management Focus and grow young talent.", "rating": 5, "pros": "The perks are great", "cons": "Hard to move up", "advice": "Focus and grow young talent."}, {"title": "Account Executive", "text": "Pros young culture, growth opportunities, team environment Cons no work life balance, lack of leadership", "rating": 3, "pros": "young culture, growth opportunities, team environment", "cons": "no work life balance, lack of leadership", "advice": null}, {"title": "Viacom", "text": "Pros There are good employee benefits. Cons There is little to no upward mobility. Advice to Management Find some compassion and respect for your employees", "rating": 1, "pros": "There are good employee benefits.", "cons": "There is little to no upward mobility.", "advice": "Find some compassion and respect for your employees"}, {"title": "Manager, Programming", "text": "Pros Great Benefits, Tons of PTO days, Summer Fridays, Generous Maternity Leave Policy, Casual/Fun Culture Cons Slow to promote valuable employees that deserve promotions", "rating": 5, "pros": "Great Benefits, Tons of PTO days, Summer Fridays, Generous Maternity Leave Policy, Casual/Fun Culture", "cons": "Slow to promote valuable employees that deserve promotions", "advice": null}, {"title": "Vice President", "text": "Pros Perks, people, environment, opportunity for mobility Cons Political, gossip, wage equality, inconsistent focus", "rating": 5, "pros": "Perks, people, environment, opportunity for mobility", "cons": "Political, gossip, wage equality, inconsistent focus", "advice": null}, {"title": "Great place to work!", "text": "Pros Great benefits and people really make it a great place to work. Surprises and events add to the experience and allow employees to share in the company culture. Cons There are no cons that I would like to report at this time. Thank you. IMO, your career is what you make it, what you put in is what you get out.", "rating": 5, "pros": "Great benefits and people really make it a great place to work. Surprises and events add to the experience and allow employees to share in the company culture.", "cons": "There are no cons that I would like to report at this time. Thank you. IMO, your career is what you make it, what you put in is what you get out.", "advice": null}, {"title": "web developer", "text": "Pros it was great company to work Cons not a great benefits, no salaray increase Advice to Management no advice to management at this time", "rating": 3, "pros": "it was great company to work", "cons": "not a great benefits, no salaray increase", "advice": "no advice to management at this time"}, {"title": "n/a", "text": "Pros it is a fun environment Cons the system needs some help", "rating": 3, "pros": "it is a fun environment", "cons": "the system needs some help", "advice": null}, {"title": "Graphic Designer", "text": "Pros Great top management, borderless opportunities, standard but not fab benefits. Access to people who listen. Cons Middle managers obstruct growth for self-preservation. High competition for every position creates insecurity and lower pay ceiling. HR is employer loyal. Can't be counted on. Advice to Management Listen and be flexible. Great ideas surround you. Old models fail because of rigidity. Long days are expected. Heavy workload translates to employee mismanagement of time.", "rating": 5, "pros": "Great top management, borderless opportunities, standard but not fab benefits. Access to people who listen.", "cons": "Middle managers obstruct growth for self-preservation. High competition for every position creates insecurity and lower pay ceiling. HR is employer loyal. Can't be counted on.", "advice": "Listen and be flexible. Great ideas surround you. Old models fail because of rigidity. Long days are expected. Heavy workload translates to employee mismanagement of time."}, {"title": "Massive Company, but Generally Good", "text": "Pros Excellent benefits and a chance to work television/media. How good or bad the company is depends a great deal on what division/sub-division/team you're working for. Cons It's a huge company and different divisions don't necessarily work well together. The bureaucracy can be mind-boggling at times. Executives are always chasing the next big thing or following a new trend, so direction isn't consistent direction from year to year.", "rating": 5, "pros": "Excellent benefits and a chance to work television/media. How good or bad the company is depends a great deal on what division/sub-division/team you're working for.", "cons": "It's a huge company and different divisions don't necessarily work well together. The bureaucracy can be mind-boggling at times. Executives are always chasing the next big thing or following a new trend, so direction isn't consistent direction from year to year.", "advice": null}, {"title": "Sales Service Executive", "text": "Pros People are fun, go to most of the events when they are in your city Cons Awful office politics. CSR's and SSE's have zero power or control, and then you are promoted to Account Executive and can do whatever you want", "rating": 1, "pros": "People are fun, go to most of the events when they are in your city", "cons": "Awful office politics. CSR's and SSE's have zero power or control, and then you are promoted to Account Executive and can do whatever you want", "advice": null}, {"title": "Good place to start", "text": "Pros Great people work and the perks are top notch. Generous PTO and benefits. The work life balance is great and they really take care of you if you're working late(free diners and company car ride home). Management is great and really care to know their employees. Highly recommended if your looking for a start in Media. Cons Upper Management is a mess. They have refused to transition in a more digital presence and the creative department isn't what MTV once was. If you're looking to make normal industry salary any level, don't look here. Salary is not great for entry level positions. Advice to Management Get a creative department that made the products of Viacom great. They are losing talent and have failed to pivot towards a digital effective platform.", "rating": 3, "pros": "Great people work and the perks are top notch. Generous PTO and benefits. The work life balance is great and they really take care of you if you're working late(free diners and company car ride home). Management is great and really care to know their employees. Highly recommended if your looking for a start in Media.", "cons": "Upper Management is a mess. They have refused to transition in a more digital presence and the creative department isn't what MTV once was. If you're looking to make normal industry salary any level, don't look here. Salary is not great for entry level positions.", "advice": "Get a creative department that made the products of Viacom great. They are losing talent and have failed to pivot towards a digital effective platform."}, {"title": "Working at Viacom", "text": "Pros Benefits are good, work life balance depends on the group Cons work life balance depends on the group", "rating": 5, "pros": "Benefits are good, work life balance depends on the group", "cons": "work life balance depends on the group", "advice": null}, {"title": "Too soon to tell if it'll stay afloat", "text": "Pros Lots of changes are happening but lots of the old guard still remain and need to be removed Does have lots of compensations but may be extremely difficult to find them all if you don't know the right person New CEO who actually cares about the company Cons Damage from previous CEO may have been too much for the company in the long run If you enjoy turf wars with small kingdoms of inept rules then you're in! Always likes to setup shop in the most expensive cities because they believe talent won't want to work in cheap suburbs when they really would. Just try and find a place to live around their London office. Advice to Management Management, you should find another job and hire competent replacements for yourselves who actually know what they're doing. Nothing is stranger than to find out that your VPs in tech have degrees in Theatre; at least the drama is good.", "rating": 3, "pros": "Lots of changes are happening but lots of the old guard still remain and need to be removed", "cons": "Damage from previous CEO may have been too much for the company in the long run", "advice": "Management, you should find another job and hire competent replacements for yourselves who actually know what they're doing. Nothing is stranger than to find out that your VPs in tech have degrees in Theatre; at least the drama is good."}, {"title": "Intern", "text": "Pros Great culture, friendly people Cons Sometimes felt too big Advice to Management Have more structure in internship program", "rating": 5, "pros": "Great culture, friendly people", "cons": "Sometimes felt too big", "advice": "Have more structure in internship program"}, {"title": "Viacom", "text": "Pros Good opportunity for growth, employee support, access to opportunities. Cons Low salary at the beginning", "rating": 5, "pros": "Good opportunity for growth, employee support, access to opportunities.", "cons": "Low salary at the beginning", "advice": null}, {"title": "Intern", "text": "Pros Casual comfortable environment yet extremely professional. They treat their employees wonderfully. Along with the benefits there are many perks that come along with working there! Cons If you aren't able to keep up with a deadline driven environment then I would say this job isn't for you. Advice to Management Keep up the great work!", "rating": 5, "pros": "Casual comfortable environment yet extremely professional. They treat their employees wonderfully. Along with the benefits there are many perks that come along with working there!", "cons": "If you aren't able to keep up with a deadline driven environment then I would say this job isn't for you.", "advice": "Keep up the great work!"}, {"title": "Good luck", "text": "Pros Easy to negotiate high salary Cons No budget when high get that salary. Could be fired at any point because Viacom changes leadership monthly.", "rating": 3, "pros": "Easy to negotiate high salary", "cons": "No budget when high get that salary. Could be fired at any point because Viacom changes leadership monthly.", "advice": null}, {"title": "Great opportunities, but a dog eat dog corporation", "text": "Pros lots of cool things to do, good learning experience Cons management is only out for themselves, many unqualified for their positions Advice to Management start caring about your employees, you can't run a ship on your own", "rating": 3, "pros": "lots of cool things to do, good learning experience", "cons": "management is only out for themselves, many unqualified for their positions", "advice": "start caring about your employees, you can't run a ship on your own"}, {"title": "MTV", "text": "Pros Great people, busy work, involved in a lot of projects so get amazing work experience. Cons Org is constantly changing, large org, too many people to closely take care of. Advice to Management Take better care of your people.", "rating": 5, "pros": "Great people, busy work, involved in a lot of projects so get amazing work experience.", "cons": "Org is constantly changing, large org, too many people to closely take care of.", "advice": "Take better care of your people."}, {"title": "Director", "text": "Pros Great benefits, excellent support system and internal mobility is strongly encouraged (though in some departments more than others). Overall, a great company to work for. Cons The drastic changes over the last couple of years have made job stability there hard to predict. They laid off hundreds of people world wide last summer, and laid off more in some of the brands earlier this year. These lay offs come with no warning, and it is scary to think you can just wake up one day at Viacom, and you will be laid off. I understand it is a corporation, but at least sometimes, you see the lay offs coming in other corporate settings so you can play ahead. You never see them coming at Viacom. Advice to Management A more robust and structured mentor system. They should only recruit mentors that are willing and able to dedicate time to the program.", "rating": 5, "pros": "Great benefits, excellent support system and internal mobility is strongly encouraged (though in some departments more than others). Overall, a great company to work for.", "cons": "The drastic changes over the last couple of years have made job stability there hard to predict. They laid off hundreds of people world wide last summer, and laid off more in some of the brands earlier this year. These lay offs come with no warning, and it is scary to think you can just wake up one day at Viacom, and you will be laid off. I understand it is a corporation, but at least sometimes, you see the lay offs coming in other corporate settings so you can play ahead. You never see them coming at Viacom.", "advice": "A more robust and structured mentor system. They should only recruit mentors that are willing and able to dedicate time to the program."}, {"title": "Content Distribution", "text": "Pros Great culture Great people You will work on some cool projects and with brands that have a global footprint Summer fridays Cons The pay is extremely low at all levels of the organization relative to the industry. Advice to Management Increase salaries by 20% across the board to compete. I loved the job and the company... but in the end I valued money in my bank account more...", "rating": 3, "pros": "Great culture", "cons": "The pay is extremely low at all levels of the organization relative to the industry.", "advice": "Increase salaries by 20% across the board to compete. I loved the job and the company... but in the end I valued money in my bank account more..."}, {"title": "Great Company but no Benefits", "text": "Pros -Amazing, young co-workers -Fun events, perks and treats all the time Cons Up the pay Freelancers are literally doing everything Advice to Management If you can just keep your freelancers for more than a year, it'd be great.", "rating": 3, "pros": "-Amazing, young co-workers", "cons": "Up the pay", "advice": "If you can just keep your freelancers for more than a year, it'd be great."}, {"title": "It went well", "text": "Pros The culture was great to be a part of Cons The culture was still a lil too non diverse Advice to Management Be confident!", "rating": 5, "pros": "The culture was great to be a part of", "cons": "The culture was still a lil too non diverse", "advice": "Be confident!"}, {"title": "relaxed atmosphere, pay could be better", "text": "Pros - relaxed atmosphere (maybe too much!) - smart colleagues - opportunities to grow, travel Cons - pay is on the lower side - some execs are a little nutty", "rating": 5, "pros": "- relaxed atmosphere (maybe too much!)", "cons": "- pay is on the lower side", "advice": null}, {"title": "SE Review", "text": "Pros Flexible work hours 5 weeks vacation 10 holidays Cons Very disorganized Not a great tech culture", "rating": 3, "pros": "Flexible work hours", "cons": "Very disorganized", "advice": null}, {"title": "VP Creative Director", "text": "Pros Exciting projects and work environment. Cons Mercurial management practices with little accountability made it difficult to get anything done.", "rating": 1, "pros": "Exciting projects and work environment.", "cons": "Mercurial management practices with little accountability made it difficult to get anything done.", "advice": null}, {"title": "A 5 Year Review", "text": "Pros Inexpensive Healthcare, Maternity/Paternity Leave, New Mother Room, Discounted Fitness Classes, Subsidized Cafeteria, Tuition Reimbursement Cons Less Competitive Salaries, Performance Review Process,", "rating": 5, "pros": "Inexpensive Healthcare, Maternity/Paternity Leave, New Mother Room, Discounted Fitness Classes, Subsidized Cafeteria, Tuition Reimbursement", "cons": "Less Competitive Salaries, Performance Review Process,", "advice": null}, {"title": "Good company that lost its way", "text": "Pros When I started there was great morale and unity. Good benefits. Cons HR department was lacking. You weren't always comfortable going to them to advocate for you. A lot of talk and no action. Advice to Management make sure managers are advocating for direct reports rather than just worrying about their own jobs.", "rating": 5, "pros": "When I started there was great morale and unity. Good benefits.", "cons": "HR department was lacking. You weren't always comfortable going to them to advocate for you. A lot of talk and no action.", "advice": "make sure managers are advocating for direct reports rather than just worrying about their own jobs."}, {"title": "viacom", "text": "Pros Positive, inclusive, helpful, creative, beautiful space Cons Has a reputation of giving low salaries", "rating": 5, "pros": "Positive, inclusive, helpful, creative, beautiful space", "cons": "Has a reputation of giving low salaries", "advice": null}, {"title": "Technical Manager", "text": "Pros Relatively stress free work environment, with constant opportunity to learn new technologies. If you're curious about Technology, you're encouraged to learn. Cons The business continues to work in silos, which makes it difficult to properly support them. Especially when BU leadership continues to exhibit nepotism and cliquishness. Advice to Management You've done a good job at breaking down the silos in IT, keep persisting to break down the silos among the business units.", "rating": 5, "pros": "Relatively stress free work environment, with constant opportunity to learn new technologies. If you're curious about Technology, you're encouraged to learn.", "cons": "The business continues to work in silos, which makes it difficult to properly support them. Especially when BU leadership continues to exhibit nepotism and cliquishness.", "advice": "You've done a good job at breaking down the silos in IT, keep persisting to break down the silos among the business units."}, {"title": "Project Coordinator", "text": "Pros Great benefits and supportive coworkers. Tuition reimbursement is a huge plus, they offer 10K a year. Great vacation days for someone in the entry level position - 24 PTO days you can use them as you wish. Cons Upward mobility is a challenge, but then again it's a challenge everywhere you go.", "rating": 5, "pros": "Great benefits and supportive coworkers. Tuition reimbursement is a huge plus, they offer 10K a year. Great vacation days for someone in the entry level position - 24 PTO days you can use them as you wish.", "cons": "Upward mobility is a challenge, but then again it's a challenge everywhere you go.", "advice": null}, {"title": "Great", "text": "Pros Great Company, Great Work life balance Cons Hard to move up internally", "rating": 5, "pros": "Great Company, Great Work life balance", "cons": "Hard to move up internally", "advice": null}, {"title": "Media research.", "text": "Pros Great benefits, access to top resources, and work with great people. Company is moving forward with some cutting edge ideas. Cons Reactive environment and management does not always put people's interest first, but hopefully that will change. Old school management is unfamiliar with newer ways of analyzing data, however seems invested in moving in growing in this area.", "rating": 5, "pros": "Great benefits, access to top resources, and work with great people. Company is moving forward with some cutting edge ideas.", "cons": "Reactive environment and management does not always put people's interest first, but hopefully that will change. Old school management is unfamiliar with newer ways of analyzing data, however seems invested in moving in growing in this area.", "advice": null}, {"title": "great people", "text": "Pros the people at Viacom are really great - everyone is talented and has some side project or interest. with the new CEO things are changing a bit for the better, too Cons they need to decide which direction we're going in and keep to it for a while. they didn't really know what to do. Advice to Management transparency and make it very clear what the company, team and employee goals are", "rating": 3, "pros": "the people at Viacom are really great - everyone is talented and has some side project or interest. with the new CEO things are changing a bit for the better, too", "cons": "they need to decide which direction we're going in and keep to it for a while. they didn't really know what to do.", "advice": "transparency and make it very clear what the company, team and employee goals are"}, {"title": "Ad Ops Specialist", "text": "Pros Amazing people and great team Cons Very college like environment", "rating": 5, "pros": "Amazing people and great team", "cons": "Very college like environment", "advice": null}, {"title": "Good", "text": "Pros Fun job, positive work environment, people are friendly, pay is okay, advancement is encouraged, many Office perks like happy hour Cons Pay isn't great, assistants are undervalued, company is almost TOO big so you tend to get lost in the shuffle Advice to Management Pay more", "rating": 5, "pros": "Fun job, positive work environment, people are friendly, pay is okay, advancement is encouraged, many Office perks like happy hour", "cons": "Pay isn't great, assistants are undervalued, company is almost TOO big so you tend to get lost in the shuffle", "advice": "Pay more"}, {"title": "Viacom Lacks Unity but overall nice", "text": "Pros Beautiful work space, friendly environment, lots of opportunities to network. Cons Can seem \"click\"ish, not a lot of integrated brands, some brands valued more than others. Advice to Management Continue to encourage unity and discourage brand favoritism", "rating": 3, "pros": "Beautiful work space, friendly environment, lots of opportunities to network.", "cons": "Can seem \"click\"ish, not a lot of integrated brands, some brands valued more than others.", "advice": "Continue to encourage unity and discourage brand favoritism"}, {"title": "Former Excessed Emplloyee Feedback", "text": "Pros Status to say you work for the brand. Cons They don't try to keep valuable people around. They are transparent enough. They are too stuck in their ways to embrace new ideas Advice to Management Don't be so slow to promote people- listen to those in the trenches and pay attention to the media trends. It's one of the reasons the whole Viacom brand is floundering.", "rating": 3, "pros": "Status to say you work for the brand.", "cons": "They don't try to keep valuable people around.", "advice": "Don't be so slow to promote people- listen to those in the trenches and pay attention to the media trends. It's one of the reasons the whole Viacom brand is floundering."}, {"title": "Marketing Intern", "text": "Pros Get to work with super creative people Cons The fact that it is in Times Sqaure", "rating": 5, "pros": "Get to work with super creative people", "cons": "The fact that it is in Times Sqaure", "advice": null}, {"title": "Design Intern", "text": "Pros The job helps me to get a deeper understanding about the design project cycle and flow in large size company. Cons Corporate culture is not very lively, and the lack of creative output in a project.", "rating": 5, "pros": "The job helps me to get a deeper understanding about the design project cycle and flow in large size company.", "cons": "Corporate culture is not very lively, and the lack of creative output in a project.", "advice": null}, {"title": "don't", "text": "Pros can be fun, good pay and full benefits (only if you are a full time employee) Cons terrible management, people are dispensable and get fired all the time, massive 'restructuring' happening on a near constant basis, little room for upward mobility and pay increases, made me lie about what hours I worked to not accrue overtime Advice to Management communicate, care, and grow your employees rather than treating them like they're immediately replaceable. both personal friends I have that worked/work there warned me about this prior to applying, and they were dead right.", "rating": 3, "pros": "can be fun, good pay and full benefits (only if you are a full time employee)", "cons": "terrible management, people are dispensable and get fired all the time, massive 'restructuring' happening on a near constant basis, little room for upward mobility and pay increases, made me lie about what hours I worked to not accrue overtime", "advice": "communicate, care, and grow your employees rather than treating them like they're immediately replaceable. both personal friends I have that worked/work there warned me about this prior to applying, and they were dead right."}, {"title": "Manager finance", "text": "Pros Good work life balance, fun company, great people to work with, excellent learning environment. Young atmosphere, casual dress for work. Cons Pay is much lower than industry average. Low pay, rarely promotes people. Big discrepancy between higher management pay and middle management. Advice to Management More incentives to be promoted", "rating": 5, "pros": "Good work life balance, fun company, great people to work with, excellent learning environment.", "cons": "Pay is much lower than industry average. Low pay, rarely promotes people. Big discrepancy between higher management pay and middle management.", "advice": "More incentives to be promoted"}, {"title": "Viacom is Awesome", "text": "Pros Access to the latest technology, travel opportunities, talented coworkers, benefits, nice workspaces, convenient locations, good pay, flexible work schedules. Fun place to work for the most part! Cons Outdated organizational structure, upper level management slow to embrace latest trends, favoritism showed to lazy, spoiled employees while others work harder and smarter. Bullying and fear of reprisal is used to keep employees quiet. Apathy. Advice to Management Restructure the business for the 21st century and de-centralize creative decisions to take advantage of new ideas coming from different groups in the organization.", "rating": 5, "pros": "Access to the latest technology, travel opportunities, talented coworkers, benefits, nice workspaces, convenient locations, good pay, flexible work schedules. Fun place to work for the most part!", "cons": "Outdated organizational structure, upper level management slow to embrace latest trends, favoritism showed to lazy, spoiled employees while others work harder and smarter. Bullying and fear of reprisal is used to keep employees quiet. Apathy.", "advice": "Restructure the business for the 21st century and de-centralize creative decisions to take advantage of new ideas coming from different groups in the organization."}, {"title": "Tough environment", "text": "Pros Viacom offers a great deal of vacation days Cons Management is tough and rigid at times", "rating": 3, "pros": "Viacom offers a great deal of vacation days", "cons": "Management is tough and rigid at times", "advice": null}, {"title": "Great company but limited pay", "text": "Pros Viacom has great perks which include PTO days, Summer Days, activities for employees and children, working remotely. Great people and variety of personalities. Cons Viacom does not pay what other companies pay, after a certain amount of years your time with the company is limited, constant layoffs and company politics. Advice to Management Employees should be paid what the industry pays and their shouldn't be an expiration date past a certain amount of years when devoting your time and loyalty.", "rating": 5, "pros": "Viacom has great perks which include PTO days, Summer Days, activities for employees and children, working remotely. Great people and variety of personalities.", "cons": "Viacom does not pay what other companies pay, after a certain amount of years your time with the company is limited, constant layoffs and company politics.", "advice": "Employees should be paid what the industry pays and their shouldn't be an expiration date past a certain amount of years when devoting your time and loyalty."}, {"title": "Intern", "text": "Pros A lot of opportunities at Viacom. Cons Nothing I can think of.", "rating": 5, "pros": "A lot of opportunities at Viacom.", "cons": "Nothing I can think of.", "advice": null}, {"title": "Coordinator", "text": "Pros Great with overtime, 401K, health care, inclusive environment Cons Not the most competitive network to work for.", "rating": 5, "pros": "Great with overtime, 401K, health care, inclusive environment", "cons": "Not the most competitive network to work for.", "advice": null}, {"title": "Stable Job, Bureaucratic and Slow Movin", "text": "Pros Good benefits, good work culture. Cons The company is bureaucratic, slow moving, and trails the industry in terms of technical aptitude. The pay is way below market.", "rating": 3, "pros": "Good benefits, good work culture.", "cons": "The company is bureaucratic, slow moving, and trails the industry in terms of technical aptitude. The pay is way below market.", "advice": null}, {"title": "EVP", "text": "Pros Moneys the reason to work there Cons Morale is low because of corporate scandals Advice to Management Fresh blood is needed ASAP", "rating": 3, "pros": "Moneys the reason to work there", "cons": "Morale is low because of corporate scandals", "advice": "Fresh blood is needed ASAP"}, {"title": "sigh... viacom is what's wrong with the media industry", "text": "Pros great office location? really that's all i can think of and there's a 20 word minimum Cons corporate overlords run the place ,and what was once a vibrant hotbed of creativity is now milking the consumer for every cent they can get Advice to Management fire the upper management and adjust to the new world of ott video. channels and appointment viewing are dead.", "rating": 1, "pros": "great office location? really that's all i can think of and there's a 20 word minimum", "cons": "corporate overlords run the place ,and what was once a vibrant hotbed of creativity is now milking the consumer for every cent they can get", "advice": "fire the upper management and adjust to the new world of ott video. channels and appointment viewing are dead."}, {"title": "Alan Blaut", "text": "Pros Excalibur has the most interesting clients in the world. Cons Very demanding place to work, fast paced and deal driven. Advice to Management Very busy shop, they should hire more staff.", "rating": 5, "pros": "Excalibur has the most interesting clients in the world.", "cons": "Very demanding place to work, fast paced and deal driven.", "advice": "Very busy shop, they should hire more staff."}, {"title": "great for recent grads", "text": "Pros Good work/life balance. Good coworkers, great locations. tons of job opportunities under the viacom umbrella Cons Nobody was full time. Need to hire more full time workers Advice to Management Hire more full time employees", "rating": 3, "pros": "Good work/life balance. Good coworkers, great locations. tons of job opportunities under the viacom umbrella", "cons": "Nobody was full time. Need to hire more full time workers", "advice": "Hire more full time employees"}, {"title": "Software Engineer Intern", "text": "Pros Great office place, smart people around and interesting projects. Cons Interns are not treated well. They don't even have enough space for interns.", "rating": 3, "pros": "Great office place, smart people around and interesting projects.", "cons": "Interns are not treated well. They don't even have enough space for interns.", "advice": null}, {"title": "Lot of fun", "text": "Pros Great company culture! There is always an event, a talk, a class going on. It's a world class entertainment company and it feels like that. Cons Hard to get approval to miss work to attend some events sometimes. 1000's of Project based employees with no benefits. That sucks. Advice to Management Start converting more high quality employees over to staff sooner before they leave.", "rating": 5, "pros": "Great company culture! There is always an event, a talk, a class going on. It's a world class entertainment company and it feels like that.", "cons": "Hard to get approval to miss work to attend some events sometimes. 1000's of Project based employees with no benefits. That sucks.", "advice": "Start converting more high quality employees over to staff sooner before they leave."}, {"title": "Inventory Manager", "text": "Pros Great work life balance. Relaxed company culture. Cons Salary growth limited. Highly competitive among teams.", "rating": 5, "pros": "Great work life balance. Relaxed company culture.", "cons": "Salary growth limited. Highly competitive among teams.", "advice": null}, {"title": "Manager", "text": "Pros Good job to have with them Cons To many work ours to work", "rating": 3, "pros": "Good job to have with them", "cons": "To many work ours to work", "advice": null}, {"title": "Amazing Company", "text": "Pros I loved everything that this company has to offer, from Thursday happy hour in the building, to a festive atmosphere for every holiday. Cons I have nothing bad to say about this company! Advice to Management Keep doing what you're doing and continue to have trust in your employees cause great things come from it", "rating": 5, "pros": "I loved everything that this company has to offer, from Thursday happy hour in the building, to a festive atmosphere for every holiday.", "cons": "I have nothing bad to say about this company!", "advice": "Keep doing what you're doing and continue to have trust in your employees cause great things come from it"}, {"title": "Viacom", "text": "Pros They really look at your strengths and are willing to make adjustments to your position. You may start out filling a particular position and later move up to something more challenging. Cons At times the amount of work to do can keep you very busy. The workflow can have peaks and valleys. Advice to Management Employees like to feel valued. Employees like to know they have options in their careers so allow them to move up in the company.", "rating": 5, "pros": "They really look at your strengths and are willing to make adjustments to your position. You may start out filling a particular position and later move up to something more challenging.", "cons": "At times the amount of work to do can keep you very busy. The workflow can have peaks and valleys.", "advice": "Employees like to feel valued. Employees like to know they have options in their careers so allow them to move up in the company."}, {"title": "Human Resources Intern", "text": "Pros Such a great internship! The really engage in their interns and the managers teach you a lot about the department you are working in. They also have a lot of activities for the interns to interact and build their career for the future. Cons There are no cons for this internship.", "rating": 5, "pros": "Such a great internship! The really engage in their interns and the managers teach you a lot about the department you are working in. They also have a lot of activities for the interns to interact and build their career for the future.", "cons": "There are no cons for this internship.", "advice": null}, {"title": "Intern", "text": "Pros Really great company culture. Human Resources and recruiters work hard to help interns get a job after college. Opportunities to have more responsibility if you ask for it. Cons Commuting to Times Square everyday can get frustrating. Some days are really slow and you don't receive a lot of work.", "rating": 5, "pros": "Really great company culture. Human Resources and recruiters work hard to help interns get a job after college. Opportunities to have more responsibility if you ask for it.", "cons": "Commuting to Times Square everyday can get frustrating. Some days are really slow and you don't receive a lot of work.", "advice": null}, {"title": "Manager", "text": "Pros People, projects, benefits, opportunities, diversity Cons Depending on supervisors work/life balance can be a struggle", "rating": 5, "pros": "People, projects, benefits, opportunities, diversity", "cons": "Depending on supervisors work/life balance can be a struggle", "advice": null}, {"title": "Frauds and cowards", "text": "Pros If you're into working 5 years for a minimal title change and no raise, this is the place for you! Cons Aging, ineffective dinosaurs with a strangle hold on leadership positions and no grasp on the practices or realities of the creative industry at large. Advice to Management Dismantle and sell the entire operation as this problem is endemic, distributed throughout the entire conglomerate.", "rating": 1, "pros": "If you're into working 5 years for a minimal title change and no raise, this is the place for you!", "cons": "Aging, ineffective dinosaurs with a strangle hold on leadership positions and no grasp on the practices or realities of the creative industry at large.", "advice": "Dismantle and sell the entire operation as this problem is endemic, distributed throughout the entire conglomerate."}, {"title": "Viacom is Trying To Embrace Start-Up Culture, But It Has A Long Way To Go", "text": "Pros It's relieving to be in a casually dressed work environment and see young people everywhere. It made me feel like I could bring myself to work. If you find a good boss, your experience will be great. If not, well you may hate Viacom. My bosses and I were super tight. They truly looked out for me. Cons Even though I loved my bosses, the office vibe felt pretty cold. The cliques made me think of high school. Viacom does try to have a start-up feel on the surface, but they cannot duplicate the culture. Advice to Management Get people to collaborate more.", "rating": 3, "pros": "It's relieving to be in a casually dressed work environment and see young people everywhere. It made me feel like I could bring myself to work. If you find a good boss, your experience will be great. If not, well you may hate Viacom. My bosses and I were super tight. They truly looked out for me.", "cons": "Even though I loved my bosses, the office vibe felt pretty cold. The cliques made me think of high school. Viacom does try to have a start-up feel on the surface, but they cannot duplicate the culture.", "advice": "Get people to collaborate more."}, {"title": "Client Service Representative", "text": "Pros Good young environment with fun people. Great days-off policy. Good benefits for an entry level position. Great exposure to big clients and high-volume advertising executions. Cons Depending on your team, you can work nearly 60 or 40 hours. Workload sharing or distribution is nearly non existent. Viacom does not have the next role of promotion available at their office and as a result do little to prepare CSRs to succeed beyond their current role. Advice to Management Share workloads evenly. Try to create a mentoring/investment program to keep internal candidates. Moral is low and CSRs feel unappreciated. Beyond fun events and benefits, employees do not often enjoy the role or hope to stay with the company long.", "rating": 3, "pros": "Good young environment with fun people. Great days-off policy. Good benefits for an entry level position. Great exposure to big clients and high-volume advertising executions.", "cons": "Depending on your team, you can work nearly 60 or 40 hours. Workload sharing or distribution is nearly non existent. Viacom does not have the next role of promotion available at their office and as a result do little to prepare CSRs to succeed beyond their current role.", "advice": "Share workloads evenly. Try to create a mentoring/investment program to keep internal candidates. Moral is low and CSRs feel unappreciated. Beyond fun events and benefits, employees do not often enjoy the role or hope to stay with the company long."}, {"title": "Content Editor", "text": "Pros Career Development Benefits Colleagues Salary Friendly and hospitable environment with tons of amenities the company is filled with both good benefits and good people. the work environment is good and the management team is very engaged. Cons Employees really do not have the opportunity to develop unless you come into a managerial role. Advice to Management Stay the course and keep this fantastic culture where people can do their best work.", "rating": 5, "pros": "Career Development", "cons": "Employees really do not have the opportunity to develop unless you come into a managerial role.", "advice": "Stay the course and keep this fantastic culture where people can do their best work."}, {"title": "Great Company", "text": "Pros Atmosphere, events, culture, and subsidized food pricing Cons Coffee machines are often broken", "rating": 5, "pros": "Atmosphere, events, culture, and subsidized food pricing", "cons": "Coffee machines are often broken", "advice": null}, {"title": "Solid place to work", "text": "Pros Overall solid place to work. Great coworkers and fun atmosphere. Summer Fridays. Things are busy at quarter change but other that, it's not bad at all. Cons Getting in and out of their Times Square office sucks, especially around the holidays. Pay isn't great until you reach a pretty senior level. Advice to Management Check in more often with your underlings. At times it seems like there is a stark divide between AEs and above, and everyone beneath them.", "rating": 3, "pros": "Overall solid place to work. Great coworkers and fun atmosphere. Summer Fridays. Things are busy at quarter change but other that, it's not bad at all.", "cons": "Getting in and out of their Times Square office sucks, especially around the holidays. Pay isn't great until you reach a pretty senior level.", "advice": "Check in more often with your underlings. At times it seems like there is a stark divide between AEs and above, and everyone beneath them."}, {"title": "Promotions", "text": "Pros If you're in Sales/Marketing you will be promoted continuously despite work load. It's all about how you look and come off to the rest of the network and the people you work within the company. Cons Operations will promote less unless you fight for it with HR and go straight to the exec level Advice to Management Show respect to your employees by rewarding them for their work. Look around at the other departments and how they value their employees.", "rating": 3, "pros": "If you're in Sales/Marketing you will be promoted continuously despite work load. It's all about how you look and come off to the rest of the network and the people you work within the company.", "cons": "Operations will promote less unless you fight for it with HR and go straight to the exec level", "advice": "Show respect to your employees by rewarding them for their work. Look around at the other departments and how they value their employees."}, {"title": "review", "text": "Pros work life balance, smart co workers, great brand recognition, great learning oppotunities Cons limited upward mobility, long time for promotions", "rating": 5, "pros": "work life balance, smart co workers, great brand recognition, great learning oppotunities", "cons": "limited upward mobility, long time for promotions", "advice": null}, {"title": "Not a good atmosphere", "text": "Pros Media in NY, a large company, the other people at the company Cons current content offerings are lacking, bad management, no direction for the company. The permalance system sucks and takes advantage of your employees. Working in times square sucks. Advice to Management Decide on a plan and stick with it.", "rating": 3, "pros": "Media in NY, a large company, the other people at the company", "cons": "current content offerings are lacking, bad management, no direction for the company. The permalance system sucks and takes advantage of your employees. Working in times square sucks.", "advice": "Decide on a plan and stick with it."}, {"title": "director", "text": "Pros great place to work...benefits are great as well as the people Cons not enough career growth for non management positions. salary is on the low end Advice to Management too many layoffs leaves staff feeling uneasy", "rating": 5, "pros": "great place to work...benefits are great as well as the people", "cons": "not enough career growth for non management positions. salary is on the low end", "advice": "too many layoffs leaves staff feeling uneasy"}, {"title": "VP FP&A", "text": "Pros The people are terrific, smart, and fun to work with. Cons Current restructuring environment lowers morale", "rating": 5, "pros": "The people are terrific, smart, and fun to work with.", "cons": "Current restructuring environment lowers morale", "advice": null}, {"title": "Coordinator", "text": "Pros Benefits are decent. My group is awesome, but it's a huge company. It really depends who you work for. People are very passionate about the job. Cons It's corporate and has the bureaucracies inherent to that sort of infrastructure. Some staffers are there to just collect a paycheck, both realizing it's a decent job, but love to complain about it. Advice to Management My management and Sr. leadership team are awesome.", "rating": 5, "pros": "Benefits are decent. My group is awesome, but it's a huge company. It really depends who you work for.", "cons": "It's corporate and has the bureaucracies inherent to that sort of infrastructure.", "advice": "My management and Sr. leadership team are awesome."}]