[{"title": "Business Development Intern", "text": "Pros Great, international work environment Cons Mature start up: therefore starting to take on corporate policies that slow everything down... Advice to Management Young, eager and very organized", "rating": 5, "pros": "Great, international work environment", "cons": "Mature start up: therefore starting to take on corporate policies that slow everything down...", "advice": "Young, eager and very organized"}, {"title": "Innovative Online Marketing Company with International Atmosphere", "text": "Pros Many different nationalities, nice office with central location, part of the Axel Springer group. Good opportunities to learn the E-commerce space and the company is open to innovation. Flexible working hours and some limited home working. Cons Stakeholder management can often be difficult as goals are often not aligned or realistic. Advice to Management Keep up the friendly atmosphere.", "rating": 5, "pros": "Many different nationalities, nice office with central location, part of the Axel Springer group. Good opportunities to learn the E-commerce space and the company is open to innovation. Flexible working hours and some limited home working.", "cons": "Stakeholder management can often be difficult as goals are often not aligned or realistic.", "advice": "Keep up the friendly atmosphere."}, {"title": "IT", "text": "Pros English speaking company, flexi time, rather relaxed enovironment, free fruit and cereal Cons poor management decisions, bad employees are not demoted/fired but rather waiting and hoping they leave, low salaries, little opportunities to grow or personal development. Good employees overworked.", "rating": 3, "pros": "English speaking company, flexi time, rather relaxed enovironment, free fruit and cereal", "cons": "poor management decisions, bad employees are not demoted/fired but rather waiting and hoping they leave, low salaries, little opportunities to grow or personal development. Good employees overworked.", "advice": null}, {"title": "Awesome atmosphere / Crummy code", "text": "Pros People are awesome: average 30 y.o., 50 nationalities, friendly and easy going Free drinks, coffee, cappuccino, fresh fruit, cereals Well equipped kitchens where you can cook your own meal, and people will likely joining you Flexible working-hours, compulsory presence 10am-4pm Cons Old technologies JSP + jQuery + CSS (no frameworks like Bootstrap) Old codebase, meaning that lots of features were self developed instead of using frameworks or products out there (probably because they didn't exist back in the days) Code quality is often moved to the background in favor of having new features released quickly, which is equal to.. Lack of architectural long-term sight", "rating": 3, "pros": "People are awesome: average 30 y.o., 50 nationalities, friendly and easy going", "cons": "Old technologies JSP + jQuery + CSS (no frameworks like Bootstrap)", "advice": null}, {"title": "Working at VM", "text": "Pros Super, helpful and nice colleagues, great office. Interesting job. Cons We ll d on e!", "rating": 5, "pros": "Super, helpful and nice colleagues, great office. Interesting job.", "cons": "We ll d on e!", "advice": null}, {"title": "A blast from the past", "text": "Pros - Office location - Vacation days - Some really cool people - Perks and team events Cons - Old technology stack, loads of legacy code and tech debt - Little innovation, e-commerce is shrinking more and more - Not the highest standards and practices of software development - Pay below the grade, low salary reviews - Promotions based on affinity, not meritocracy - Frequent swings of direction and poor management decisions - Top talent leaving the company for better opportunities elsewhere Advice to Management - Some employees are trying to keep this ship afloat, give them value while others are just for the pay in the end of the month - Listen to employees of all levels and just not store their ideas in notebooks, keep them alive and make them products - Revamp the entire technology stack - Mobile focus always comes first, change it - Plan expansions more carefully, consider peopleware before software - Improve communication channels and make them consistent - Create employee retention plans and career roadmaps", "rating": 3, "pros": "- Office location", "cons": "- Old technology stack, loads of legacy code and tech debt", "advice": "- Some employees are trying to keep this ship afloat, give them value while others are just for the pay in the end of the month"}, {"title": "Good place to learn everything about e-commerce", "text": "Pros - Good team atmosphere - Nice on boarding, not only within the department, but as well presentations from the other departments - Good place to learn about all topics in e-commerce - Flat structure - If you have some patience there are good career growing opportunities, as well to get your first management position - You get space to take initiative and work on your own projects next to your daily job tasks, if projects are approved by the management. Cons - Internal workshops could be organized more often - Provide more budget/time for external workshops/conferences/meetings Advice to Management - More clear explanation of long term strategy to all the layers of the company", "rating": 5, "pros": "- Good team atmosphere", "cons": "- Internal workshops could be organized more often", "advice": "- More clear explanation of long term strategy to all the layers of the company"}, {"title": "Nice Company", "text": "Pros - new technologies - data driven - nice work environment - idea lab Cons - not too inovative - slow process Advice to Management - please give Ideas more time - focus on the long term impact", "rating": 5, "pros": "- new technologies", "cons": "- not too inovative", "advice": "- please give Ideas more time"}, {"title": "Software engineer", "text": "Pros Very friendly atmosphere in general, great people from many parts of the world. Nice office space and very comfortable working environment. Management/agile practices within teams are getting noticeably better. Cons Cross-department communication can get terribly inefficient, leading to stressful situations at times. Seemingly no clear definition where company is heading - widely announced company goals and decisions sometimes seem chaotic and lacking rationale. Salaries are apparently below average on the market.", "rating": 5, "pros": "Very friendly atmosphere in general, great people from many parts of the world.", "cons": "Cross-department communication can get terribly inefficient, leading to stressful situations at times.", "advice": null}, {"title": "Need to realize \"We're a start-up\" no longer works as an excuse for incompetence", "text": "Pros International work environment, a lot of social activities to get involved in, nice colleagues Cons Salary is below industry standard and while it was good for Berlin five years ago, it isn't today - and hiring salaries have actually gotten lower since then, it seems. Communication is a mess, both within departments and between them. Efforts have been made to improve interdepartmental communication which has led to a massive amount of constantly changing processes. Within the Quality Department information is mostly passed on at random, if at all. There are a lot of opportunities for extra responsibilities and project management - but you must prove that you can do the job before you're allowed any training for it, and often trainings are offered by invitation only, depending on who managers would like to see advance, not to anyone who might be interested. It takes too long to adapt when best practices change: \"Targets are set for the rest of 2017, so those targets must be met even if they no longer make sense.\" You can say that in November, not in June. There's a very nice referral scheme, but I couldn't in good conscience recommend this job to anyone I liked enough to want to work with them. Advice to Management Get better at communicating. Not just monthly all-hands meetings, but day to day stuff. Promote more qualified people to middle management/team lead positions. Be more clear about procedures for things like job title promotions. Either stop saying you're \"adaptable\" or start actually adapting.", "rating": 3, "pros": "International work environment, a lot of social activities to get involved in, nice colleagues", "cons": "Salary is below industry standard and while it was good for Berlin five years ago, it isn't today - and hiring salaries have actually gotten lower since then, it seems.", "advice": "Get better at communicating. Not just monthly all-hands meetings, but day to day stuff."}, {"title": "Good atmosphere, but chaos and low salaries", "text": "Pros Good, laid back, atmosphere and young people Cons Lack of direction, the company is moving to a more oppressive model", "rating": 3, "pros": "Good, laid back, atmosphere and young people", "cons": "Lack of direction, the company is moving to a more oppressive model", "advice": null}, {"title": "Lovely, stress free environment, forget about challenges", "text": "Pros Absolutely international, it's pretty easy to make new friends. The work can be interesting at the beginning, great work-life balance, no stress at all. Not even a tiny little stress came up in my two years. Cons Horribly untrained and uneducated middle managers in one or two departments, low salaries. Forget about challenges or about a real career at this firm. Most of the people leave within 2 years.", "rating": 3, "pros": "Absolutely international, it's pretty easy to make new friends. The work can be interesting at the beginning, great work-life balance, no stress at all. Not even a tiny little stress came up in my two years.", "cons": "Horribly untrained and uneducated middle managers in one or two departments, low salaries. Forget about challenges or about a real career at this firm. Most of the people leave within 2 years.", "advice": null}, {"title": "QA Manager", "text": "Pros 4 weeks of workshops, learning with tools fruits every MO, WED Social life (sports, arts, movie night, hackathon, pingpong) Cons bad luck with bad manager (they sometimes hire people unqualified and without any technical background) Advice to Management choose leaders based on experience from your own employees", "rating": 5, "pros": "4 weeks of workshops, learning with tools", "cons": "bad luck with bad manager (they sometimes hire people unqualified and without any technical background)", "advice": "choose leaders based on experience from your own employees"}, {"title": "Stable company in terms of StartUp terms.", "text": "Pros Back then company was doing very well financially and we had all kinds of toys and benefits. Cons \"Senior\" management consisted partly of previous interns which was there since the company was founded. Which is understandable to some degree, however creates a very strange dynamic when the people they are then overseeing have more experience and performance in the field.", "rating": 5, "pros": "Back then company was doing very well financially and we had all kinds of toys and benefits.", "cons": "\"Senior\" management consisted partly of previous interns which was there since the company was founded. Which is understandable to some degree, however creates a very strange dynamic when the people they are then overseeing have more experience and performance in the field.", "advice": null}, {"title": "Stay away", "text": "Pros Free cereals, free beer, international team, nice common room Cons I got laid off along with several other people from my department due to the company's poor planning decisions. The job itself (QM) was dull, the working environment was somewhat stressful and I felt like I was being watched constantly. Opportunities in terms of professional growth are poor. The salaries are way below average. All in all, if you value your career, I'd recommend you to stay away.", "rating": 1, "pros": "Free cereals, free beer, international team, nice common room", "cons": "I got laid off along with several other people from my department due to the company's poor planning decisions. The job itself (QM) was dull, the working environment was somewhat stressful and I felt like I was being watched constantly. Opportunities in terms of professional growth are poor. The salaries are way below average. All in all, if you value your career, I'd recommend you to stay away.", "advice": null}, {"title": "Once upon a time.. VM was a good company", "text": "Pros - International environment - Flexible working hours - Friendly people - Good for people who like to get comfortable doing the same thing over and over - No stress - Used to be growing and there was a sense of achievement - You could learn a lot as a junior(only) - Good beer and fruits - Office well connected to public transportation Cons - Micro management everywhere. - Low salaries - No people management - Top management don't trust the people they hire, so they end up telling them what to do step by step - Almost no challenges - High rotation rate, key people resigning everywhere - No reward for sense of initiative or creativity - Very few seniors to learn from Advice to Management - Hire good people and don't tell them how they do their job - CTO seems to come to work just to say no to people and feel good about it - Be transparent about your decision making, because it affects the whole company - Communicate better - Work on your trust, if people don't trust you, they can't follow you - Listen to why people resign - Seek feedback about your heads of departments, some of them are really not appreciated in the company - It's better to pay higher salaries than hiring tens of new people every year - Even the MDs don't believe the company can survive and they are starting other ventures inside the company.. - There is always a clash between CEO/CTO and the \"innovative\" initiatives of employees", "rating": 3, "pros": "- International environment", "cons": "- Micro management everywhere.", "advice": "- Hire good people and don't tell them how they do their job"}, {"title": "en masse firing", "text": "Pros Like any other company: free coffee and fruits. Cons I was fired along with 10 other people at once due to financial difficulties.... this action speaks for itself. It's no secret around the working community about what happened at this company. Ask and be well informed before applying.", "rating": 1, "pros": "Like any other company: free coffee and fruits.", "cons": "I was fired along with 10 other people at once due to financial difficulties.... this action speaks for itself. It's no secret around the working community about what happened at this company. Ask and be well informed before applying.", "advice": null}, {"title": "Unfortunately, the good times are over", "text": "Pros - international & young environment - fruit & cereals for free, kicker, table tennis - finally good organized office management team - helpful HR team there was a time were this company was awesome, small, you knew everyone, the attitude was relaxed, we had great fun Cons - not enough experienced people to increase the learning curve - sometimes you get very specified knowledge (related to the product or internal tools), that can't be applied elsewhere - general lack of trust - micro management - low salaries - wrong hiring decisions - people with not enough knowledge are put into high level positions (sometime just because they happen to be there and there was no other use for them) - very bad communication/misunderstandings, all directions (top-down, down-top, in between departments) - too many people resigning - if someone leaves the company no one is interested in 1. the reasons or 2. in keeping them - the company grew too fast, people were hired like crazy, without the proper initial training time - the business model is bluntly based on google ranking and clickouts, which is not working anymore now, hence the money is running low and they had to fire a lot of people again - everyone (especially c-level) is clinging to this outdated business model while moving closer to the rim of the abyss with open eyes - business decision not always well thought through - offices can get very noisy, because everyone is expected to be open for questions at anytime, so there will always be someone walking in/out chatting, this makes effective concentrated work very difficult (concepts like home office are not wanted => see lack of trust) - sadly an enormous amount of talking behind the back is going on, which mirrors the lack of transparency Advice to Management - don't be be stubborn and resistant to advice, you are still too often thinking in terms of start-up, were you could manage every single process - hire experienced people, especially for the mid executive level and let them do their job - if you hire someone, TRUST him/her, if you don't trust them, don't hire them in the first place - leave structural decisions to someone who knows how to run big companies, get consultants - no one blames you for not knowing how to run a 300 people business, it just grew around you over time, but people will blame you for just toying around with them and try to figure out things by try & error - be transparent in your decision making processes, don't present employees with a fait accompli", "rating": 3, "pros": "- international & young environment", "cons": "- not enough experienced people to increase the learning curve", "advice": "- don't be be stubborn and resistant to advice, you are still too often thinking in terms of start-up, were you could manage every single process"}, {"title": "Great place to work for", "text": "Pros Friendly atmosphere with people from all over the world. Cons I do not see any cons.", "rating": 5, "pros": "Friendly atmosphere with people from all over the world.", "cons": "I do not see any cons.", "advice": null}, {"title": "Not professional, position based on relationship,but good beers and fruits", "text": "Pros The events, parties, beers, fruits, kickers, yoga and salsa class. Cons I was excited at the beginning as I was responsible for a new and big project of market. They always talked about growing and expanding, but then after some months putting my blood to the project, they decided to cancel it and lay off some other people. Of course it was very frustrating, cause why did they even bother to hire people in full-time position, people who might left their old job, or even moved from other city/country, and just to fire them after some months? Why did not they just hire interns if they are not sure about their business strategy? Cause they just like playing with people's life here... Again, they keep laying off people in three batches. Some people in the affected markets got transferred to other positions in the company, but they are not even qualified nor having experience for the position - only because they know the right person. There is also no transparency between top management and employees. Advice to Management Be more transparent, think carefully about your business strategy.", "rating": 1, "pros": "The events, parties, beers, fruits, kickers, yoga and salsa class.", "cons": "I was excited at the beginning as I was responsible for a new and big project of market. They always talked about growing and expanding, but then after some months putting my blood to the project, they decided to cancel it and lay off some other people.", "advice": "Be more transparent, think carefully about your business strategy."}, {"title": "Visual Meta", "text": "Pros People are amazing. Managers are good listeners. VM is a place where you will find something to learn. Cons Evolution perspectives are quite limited. If you want one of your ideas to be done, you have to be patient.", "rating": 3, "pros": "People are amazing. Managers are good listeners.", "cons": "Evolution perspectives are quite limited.", "advice": null}, {"title": "Work was good, but", "text": "Pros The colleagues were great and the environment created by them was nice. The work was good, challenging and fun. Cons The management is a little difficult to work with. They promise one thing when you hold a meeting with them, but go back on their words a few weeks later when they make bad decisions. Advice to Management Keep your word and don't change your tone because you guys cannot handle a little bit of pressure. Learn to receive trust and respect from your employees.", "rating": 3, "pros": "The colleagues were great and the environment created by them was nice. The work was good, challenging and fun.", "cons": "The management is a little difficult to work with. They promise one thing when you hold a meeting with them, but go back on their words a few weeks later when they make bad decisions.", "advice": "Keep your word and don't change your tone because you guys cannot handle a little bit of pressure. Learn to receive trust and respect from your employees."}, {"title": "Think twice before accepting their offer", "text": "Pros - Overall young and friendly environment to work in. - Possibility to attend interesting workshops. - Chances to learn a lot about a growing business. Cons - Short-sighted and ruthless management. Advice to Management - Learn to value your employees and treat them well with respect and transparency. - Don't hire employees if you are already aware that the business \"is not growing enough\" just to release them few months or even few days later.", "rating": 1, "pros": "- Overall young and friendly environment to work in.", "cons": "- Short-sighted and ruthless management.", "advice": "- Learn to value your employees and treat them well with respect and transparency."}, {"title": "System administrator", "text": "Pros - International and young environment - Flexible - Possibility to attend to workshops, ... Cons - No chance to have a career - Low salaries - Lack of communication - The responsability is handled between a few persons - No time to implement own ideas Advice to Management It was good", "rating": 3, "pros": "- International and young environment", "cons": "- No chance to have a career", "advice": "It was good"}, {"title": "Needs some improvements", "text": "Pros Good relationships between colleagues, Managing Directors are available to be approached, a strong (even if not always well managed) will to professionalize the work. Cons The internal communication in the company needs to be reviewed, both for cultural and feel good resons as well as for inter department work. The demand from the employees should be more. Advice to Management Pay more attention to the work of the employees and reward accordingly; Clarify and promote the goals of each role; Improve the internal communication in the company - hire someone!", "rating": 3, "pros": "Good relationships between colleagues, Managing Directors are available to be approached, a strong (even if not always well managed) will to professionalize the work.", "cons": "The internal communication in the company needs to be reviewed, both for cultural and feel good resons as well as for inter department work. The demand from the employees should be more.", "advice": "Pay more attention to the work of the employees and reward accordingly; Clarify and promote the goals of each role; Improve the internal communication in the company - hire someone!"}, {"title": "Work at visual-meta", "text": "Pros everyone tries to help the company it self will give you any aid when it comes to learning new stuff the atmosphere is great Cons rare career advancments it is not that common that someone would become a team leader for example", "rating": 5, "pros": "everyone tries to help the company it self will give you any aid when it comes to learning new stuff", "cons": "rare career advancments", "advice": null}, {"title": "Nice company with international team", "text": "Pros - International team - Flexible hours to start the day, 7 to 10 - Company growing fast Cons - Many ppl are just interns on a minimal wage, high rotation - Possibilities of growth limited", "rating": 5, "pros": "- International team", "cons": "- Many ppl are just interns on a minimal wage, high rotation", "advice": null}, {"title": "Nice place to work as long as you have no real ambition. The product suggests too much labor-powered routine.", "text": "Pros - nice colleagues from all over Europe - friendly management - pleasant office environment at the center of berlin - great company events Cons - the product itself is not exciting, to say the least. - career opportunities are limited, if present at all - it's all about clicks, CPCs, traffic and sales. - although described as a startup, from the inside it looks like and operates as a large company with ver 100 employees. - the salaries are rather low Advice to Management Try to improve the technology of the product so that it does not demand that much manual labour.", "rating": 3, "pros": "- nice colleagues from all over Europe", "cons": "- the product itself is not exciting, to say the least.", "advice": "Try to improve the technology of the product so that it does not demand that much manual labour."}, {"title": "Amazing growth opportunities, both professionally and personally.", "text": "Pros Relaxing environment and nice colleagues located in the heart of one of the biggest cities in the world Cons there should be more charity/volunteering events", "rating": 5, "pros": "Relaxing environment and nice colleagues located in the heart of one of the biggest cities in the world", "cons": "there should be more charity/volunteering events", "advice": null}, {"title": "Never go there if you would like to grow or learn more", "text": "Pros Great HR dep., great company atmosphere and employee care. Satisfying benefits. Cons Well, I would have tons of cons, i. e.: you could never push your concrete ideas and beleifes forward. The boss is self-satisfied. Even though you would be hired to bring new and fresh ideas from your native country market you won't be allowed to do so. I could write many other things. Advice to Management Try to listen to your employees. They have something to say. And lot of them are mot as happy as they are acting.", "rating": 1, "pros": "Great HR dep., great company atmosphere and employee care. Satisfying benefits.", "cons": "Well, I would have tons of cons, i. e.: you could never push your concrete ideas and beleifes forward. The boss is self-satisfied. Even though you would be hired to bring new and fresh ideas from your native country market you won't be allowed to do so. I could write many other things.", "advice": "Try to listen to your employees. They have something to say. And lot of them are mot as happy as they are acting."}, {"title": "Lovely people, no career growth", "text": "Pros - English classes provided by the employer - flexible working hours - young co-workers full of energy - lovely office stuff, company breakfast - good as a career starting point Cons - communication between management and employees does not work well, feedback is not being accepted - internal PR does not exist - not much understanding for country specific problems - almost no support for additional education (fairs, conferences, meeting with business partners in the country you represent etc.) - not a good option if you want to develop and grow (in the terms of building a career) Advice to Management What I really missed is the support for people, who were/are eager to learn and work hard for the company. /// Regarding the events, everybody loved the movie evenings, but after the organizator left the company, it stopped. Could the office management start to take care of it? I think that employees would appreciate comeback of this event a lot.", "rating": 3, "pros": "- English classes provided by the employer", "cons": "- communication between management and employees does not work well, feedback is not being accepted", "advice": "What I really missed is the support for people, who were/are eager to learn and work hard for the company."}, {"title": "great workplace and great atmosphere!", "text": "Pros young , dynamic and successful. Goal oriented but at the same time keeping the people in the first place. Positive and smiling environment where one can perform without stress. Cons it's quite difficult to move forward on a career perspective. There weren't many chances for workshops or to acquire further knowledge.", "rating": 5, "pros": "young , dynamic and successful. Goal oriented but at the same time keeping the people in the first place. Positive and smiling environment where one can perform without stress.", "cons": "it's quite difficult to move forward on a career perspective. There weren't many chances for workshops or to acquire further knowledge.", "advice": null}, {"title": "I learn a lot here", "text": "Pros The young and friendly team Cons I don't know about one yet", "rating": 3, "pros": "The young and friendly team", "cons": "I don't know about one yet", "advice": null}, {"title": "Tolles Team, eine angemessene Bezahlung und sehr viele perks!", "text": "Pros Ich habe als Praktikantin angefangen und wurde danach als Werkstudent übernommen. Ich wurde immer aktiv in das unternehmerische Geschehen eingebunden. Man hat einen großen Einfluss bei dem was man macht und die eigene Meinung wird von den Kollegen und den Teamleads geschätzt. Der Zusammenhalt ist sehr groß. immer werden verschiedene Events veranstaltet. Friday beers jede Woche und sehr viele Parties mit viel internationalem Essen und Getränken, Movie nights, Ausflüge etc. Es gibt auch einen Quiet room in dem man sich ausruhen kann. Zusätzlich gibt es auch immer frisches Obst, Cereal, Kaffee Milch und damit hat man schon für das Frühstück gesorgt, was auch ganz nett ist. Das unternehmen an sich ist sehr international und es wird fast nur Englisch gesprochen, was für mich aber sehr positiv war. Alles in allem bin ich sehr zufrieden mit dem Unternehmen und habe es auch schon anderen empfohlen. Die Bezahlung als Werkstudent ist relativ hoch und die Arbeit immer interessant und abwechslungsreich. Cons Was etwas negativ war, dass vor dem Praktikum noch die Stelle an der Stelle an die ich mich beworben habe, mehrmals Änderungen vorgenommen wurden. Und als Praktikant ist die Bezahlung nicht wirklich hoch, deshalb ist es schwierig damit in Berlin zu leben aber durch die 40 Stunden Woche kann man auch keinen Nebenjob annehmen und ist somit auf externe Hilfe angewiesen. Advice to Management Keep up the good work :)", "rating": 5, "pros": "Ich habe als Praktikantin angefangen und wurde danach als Werkstudent übernommen. Ich wurde immer aktiv in das unternehmerische Geschehen eingebunden. Man hat einen großen Einfluss bei dem was man macht und die eigene Meinung wird von den Kollegen und den Teamleads geschätzt. Der Zusammenhalt ist sehr groß. immer werden verschiedene Events veranstaltet. Friday beers jede Woche und sehr viele Parties mit viel internationalem Essen und Getränken, Movie nights, Ausflüge etc. Es gibt auch einen Quiet room in dem man sich ausruhen kann. Zusätzlich gibt es auch immer frisches Obst, Cereal, Kaffee Milch und damit hat man schon für das Frühstück gesorgt, was auch ganz nett ist. Das unternehmen an sich ist sehr international und es wird fast nur Englisch gesprochen, was für mich aber sehr positiv war. Alles in allem bin ich sehr zufrieden mit dem Unternehmen und habe es auch schon anderen empfohlen. Die Bezahlung als Werkstudent ist relativ hoch und die Arbeit immer interessant und abwechslungsreich.", "cons": "Was etwas negativ war, dass vor dem Praktikum noch die Stelle an der Stelle an die ich mich beworben habe, mehrmals Änderungen vorgenommen wurden. Und als Praktikant ist die Bezahlung nicht wirklich hoch, deshalb ist es schwierig damit in Berlin zu leben aber durch die 40 Stunden Woche kann man auch keinen Nebenjob annehmen und ist somit auf externe Hilfe angewiesen.", "advice": "Keep up the good work :)"}, {"title": "Good company for juniors", "text": "Pros Good and healthy work atmosphere, smart people, many team events. The company got more and more structured and you can get a lot of technical knowledge in the field of e-commerce if you decide to join them. Financially speaking, it is very correct compared to many start ups in Berlin. Cons Interesting career evolution do happen but rarely. Apart from IT, salaries are not attractive and no bonus if you overreach your goals. As a consequence, most people leave the company after 2 or 3 years and they recruit mainly juniors. It’s hard to feel challenged after 1.5 years there mainly because you’re not rewarded accordingly Advice to Management It’s high time to reinvent the product which could be much more attractive and interactive, think long-term, be really risk-taking.", "rating": 3, "pros": "Good and healthy work atmosphere, smart people, many team events. The company got more and more structured and you can get a lot of technical knowledge in the field of e-commerce if you decide to join them. Financially speaking, it is very correct compared to many start ups in Berlin.", "cons": "Interesting career evolution do happen but rarely. Apart from IT, salaries are not attractive and no bonus if you overreach your goals. As a consequence, most people leave the company after 2 or 3 years and they recruit mainly juniors. It’s hard to feel challenged after 1.5 years there mainly because you’re not rewarded accordingly", "advice": "It’s high time to reinvent the product which could be much more attractive and interactive, think long-term, be really risk-taking."}, {"title": "ganz nett für Berufseinsteiger, Keine Entwicklungsmöglichkeiten, Gehälter eher unterdurchschnittlich", "text": "Pros als Berufseinsteiger kann man viel Lernen Cons keine Vision vom Produkt Dinge werden immer nur halbherzig umgesetzt kein Mut zur Innovation schlechte Bezahlung", "rating": 3, "pros": "als Berufseinsteiger kann man viel Lernen", "cons": "keine Vision vom Produkt", "advice": null}, {"title": "internationales team", "text": "Pros sehr internationales team, was die arbeit spannend macht und einem sehr viele einflüsse gibt. es wird eine gute infrastruktur zur anwendungsentwicklung bereitgestellt. Cons man bekommt manchmal das gefühl, entscheidungen werden ad hoc gefällt. auch wenn dem nicht so sein mag, liegt es sicher zum teil an fehlender transparenz. Advice to Management das management sieht die firma nach wie vor als start-up/familie. das macht die atmosphäre zwar etwas lockerer, aber steht in widerspruch zu der gegebenen intransparenz", "rating": 5, "pros": "sehr internationales team, was die arbeit spannend macht und einem sehr viele einflüsse gibt.", "cons": "man bekommt manchmal das gefühl, entscheidungen werden ad hoc gefällt. auch wenn dem nicht so sein mag, liegt es sicher zum teil an fehlender transparenz.", "advice": "das management sieht die firma nach wie vor als start-up/familie. das macht die atmosphäre zwar etwas lockerer, aber steht in widerspruch zu der gegebenen intransparenz"}, {"title": "Gesichtslose Marketing-Maschine", "text": "Pros - Freiheit an der Arbeit - Internationales Team - Flexible Arbeitszeit Cons - Keine Kultur, Werte oder Ziele, die das Team zusammenbringt und Motivieren - Steriles Arbeitsklima - Top-down Management ohne Raum für Inputs oder neue Ideen - Niedrige Gehälter - Schlechte Kommunikation, dauernd Misverständnisse zwischen Teams und den Management Teams - Keine Belohnung für gute Leistungen = sehr schlecht für die Motivation Advice to Management - \"Treat your employees well\": belohn gute Leistungen, investiere in eure Mitarbeiter, biete Perks an - Sei offen für Kritik, Feedback und Veränderungen von euren Mitarbeitern", "rating": 3, "pros": "- Freiheit an der Arbeit", "cons": "- Keine Kultur, Werte oder Ziele, die das Team zusammenbringt und Motivieren", "advice": "- \"Treat your employees well\": belohn gute Leistungen, investiere in eure Mitarbeiter, biete Perks an"}, {"title": "Praktischer Ansatz im Online-Marketing", "text": "Pros Sowohl als Praktikant als auch als voller Angestellter hat man die Chance, Fähigkeiten in allen Bereichen des Online-Marketings weiterzuentwickeln. Sowohl Management als auch Belegschaft sind sehr jung und dynamisch und regen dich zu harter Arbeit an, aber behalten auch den Spaß an der Arbeit im Auge (Filme, Firmenfeiern, Tischfußball, Tischtennis, voll ausgestattete Küche mit Cerealien, Kaffee und Tee und was sonst noch zur Entspannung hilft.) Die Firma ist sehr gut strukturiert, mit einem detaillierten Berichtssystem, so dass dein Vorgesetzter genau weiß, was du tust. Insgesamt ist die Firma ergebnisorientiert. Both as an intern and as a full employee you have the chance to develop your skills in all of the fields of online marketing. Both the management and the employees are quite young and dynamic, pushing you to work hard but also keeping an eye on the fun part of the work (movies, company parties, kicker, ping pong, fully furnished kitchen with cereals coffee and tee and whatever can help you to be relaxed. The company is very well structured, with a detailed reporting system, so that your manager knows exactly what you're doing. Overall the company is result-oriented. Cons Es ist immer noch ein junges und in schnellem Wachstum begriffenes Unternehmen. Man stößt ständig auf Änderungen in der Struktur, die einen überraschen können. Still it's a young company which is experiencing fast growth. Everyday you can find changes in the structure which can surprise you. Advice to Management Holt öfter Feedback von den Teams in den einzelnen Ländern ein. Ask more often feedbacks from the national teams.", "rating": 5, "pros": "Sowohl als Praktikant als auch als voller Angestellter hat man die Chance, Fähigkeiten in allen Bereichen des Online-Marketings weiterzuentwickeln.", "cons": "Es ist immer noch ein junges und in schnellem Wachstum begriffenes Unternehmen. Man stößt ständig auf Änderungen in der Struktur, die einen überraschen können.", "advice": "Holt öfter Feedback von den Teams in den einzelnen Ländern ein."}]