[{"title": "Zu wenig Personal", "text": "Pros Tariflohn (TvöD), Mitarbeiterangebote, großes Unternehmen mit Versetzungsmöglichkeiten an andere Standorte in der Stadt. Cons Teilweise wenig Personal auf den Stationen, Pflegedienstleitung reagiert nicht auf Missstände (bspw. überlastetes Pflegepersonal) - selbst wenn darauf aufmerksam gemacht wird. Wenn man seine private Telefonnummer \"für Notfälle\" bei seiner Station abgibt, wird man in seinem Frei mit Anrufen terrorisiert, ob man den einspringen könnte. Advice to Management - Freizeit ist Freizeit -> Verbot einführen private Telefonnummern der Mitarbeiter auf Stationen zu sammeln - Pflegedienstleitungen sollen mehr Präsenz zeigen und ein offenes Ohr haben für Sorgen des Pflegepersonals - Zuschüsse beim öffentlichen Verkehrsmitteln für Mitarbeiter - Stichwort: Anreize schaffen um die Arbeit in dieser schwierigen Situation im Gesundheitswesen für Pflegekräfte attraktiv zu gestalten - Druck seitens der Geschäftsführung auf politische Akteure ausüben, dass Zustände für Pflege und Patienten so nicht weiter geht.", "rating": 3, "pros": "Tariflohn (TvöD), Mitarbeiterangebote, großes Unternehmen mit Versetzungsmöglichkeiten an andere Standorte in der Stadt.", "cons": "Teilweise wenig Personal auf den Stationen, Pflegedienstleitung reagiert nicht auf Missstände (bspw. überlastetes Pflegepersonal) - selbst wenn darauf aufmerksam gemacht wird. Wenn man seine private Telefonnummer \"für Notfälle\" bei seiner Station abgibt, wird man in seinem Frei mit Anrufen terrorisiert, ob man den einspringen könnte.", "advice": "- Freizeit ist Freizeit -> Verbot einführen private Telefonnummern der Mitarbeiter auf Stationen zu sammeln"}, {"title": "Arbeitgeber mit Stärken & Schwächen", "text": "Pros TvÖD-Gehalt, VBL, Entgeltumwandlung für Altersvorsorge möglich, div. Fachgebiete, 7 Kliniken und div. weitere Einrichtungen; eine Geschäftsfüherin (Fr. Dr. Grebe) zum Anfassen Cons zum Teil alte \"Öffentlicher-Dienst-Mentalität\", Krankenhaus-IT auf dem Niveau von 1985 = keine elektronische Patietenakte, kein PDMS; unglücklicher Zustand durch Zentralisierung (Einkauf, Personalservice); ein Betriebsrat, der sich NICHT um die Arbeitnehmer, sondern eher um eigene Befindlichkeiten kümmert Advice to Management siehe Kontras", "rating": 5, "pros": "TvÖD-Gehalt, VBL,", "cons": "zum Teil alte \"Öffentlicher-Dienst-Mentalität\",", "advice": "siehe Kontras"}, {"title": "bin sehr zufrieden!", "text": "Pros Einarbeitung,Gehalt,Weiterbildungsmöglichkeiten,offene Atmosphäre ( in der Führungsebene) Cons bis jetzt nichts negatives erlebt... Advice to Management mehr Transparenz auch an das \"kleine\" Volk,wenn die Fürhrungskräfte nichts weitergeben,bekommen die anderen nichts mit...", "rating": 5, "pros": "Einarbeitung,Gehalt,Weiterbildungsmöglichkeiten,offene Atmosphäre ( in der Führungsebene)", "cons": "bis jetzt nichts negatives erlebt...", "advice": "mehr Transparenz auch an das \"kleine\" Volk,wenn die Fürhrungskräfte nichts weitergeben,bekommen die anderen nichts mit..."}, {"title": "Sehr gut", "text": "Pros Man fühlt sich bie Vivantes sicher. Cons bis jetzthabe ich keine nachteil bei Vivantes Advice to Management Kommunikations soll weiterhin verstärkt werden", "rating": 5, "pros": "Man fühlt sich bie Vivantes sicher.", "cons": "bis jetzthabe ich keine nachteil bei Vivantes", "advice": "Kommunikations soll weiterhin verstärkt werden"}, {"title": "Über Vivantes", "text": "Pros Sicherer Arbeitsplatz mit Mitbestimmung, gutes Team und langjähriges Knowhow. Dabei eine flexible Arbeitszeitplanung und Möglichkeiten zum Wissensgewinn. Cons Relativ starre hierarchische Strukturen, wenig Entwicklungsmöglichkeiten. Personalmangel wie überall in der Pflege und viele überholte Praktiken. Viele unzufriedene Kollegen, dadurch Unruhe in den einzelnen Teams. Advice to Management Mehr Partizipation durch die Mitarbeiter, Personalentwicklung mehr ausbauen und motivierte und geeignete Mitarbeiter besser bzw. Überhaupt fördern. Hierarchien abbauen und mehr Entscheidungsgewalt zu den Mitarbeitern der Basis geben.", "rating": 5, "pros": "Sicherer Arbeitsplatz mit Mitbestimmung, gutes Team und langjähriges Knowhow. Dabei eine flexible Arbeitszeitplanung und Möglichkeiten zum Wissensgewinn.", "cons": "Relativ starre hierarchische Strukturen, wenig Entwicklungsmöglichkeiten. Personalmangel wie überall in der Pflege und viele überholte Praktiken. Viele unzufriedene Kollegen, dadurch Unruhe in den einzelnen Teams.", "advice": "Mehr Partizipation durch die Mitarbeiter, Personalentwicklung mehr ausbauen und motivierte und geeignete Mitarbeiter besser bzw. Überhaupt fördern. Hierarchien abbauen und mehr Entscheidungsgewalt zu den Mitarbeitern der Basis geben."}, {"title": "Super", "text": "Pros Supper nette vorgesetzte flexible arbeitzeiten 2 wochenenden im monat frei gute bezahlung Cons Bezahlte Parkplatz für Mitarbeiter Preisgünstiges essen für die Mitarbeiter Belohungen fürs einspringen Advice to Management mehr Weiterbildung Mehr Ausbildung möglichkeiten und mehr rücksicht auf die family", "rating": 5, "pros": "Supper nette vorgesetzte", "cons": "Bezahlte Parkplatz für Mitarbeiter", "advice": "mehr Weiterbildung"}, {"title": "Ich arbeite sehr gerne bei Vivantes", "text": "Pros Die Arbeit macht meistens sehr viel Spaß. Das Personal ist nett und zuvorkommend. Sehr gute Bezahlung vor allem pünktlich. Cons Das Misstrauen und die Hochnäsigkeit der Führungskräfte in manchen Bereichen. Advice to Management öfter mal Danke sagen an alle Mitarbeiter und Bereiche. Bitte vergesst nicht das Graue und Blaue Personal. Denn ohne uns würde es Vivantes auch nicht so gut gehen.", "rating": 5, "pros": "Die Arbeit macht meistens sehr viel Spaß. Das Personal ist nett und zuvorkommend. Sehr gute Bezahlung vor allem pünktlich.", "cons": "Das Misstrauen und die Hochnäsigkeit der Führungskräfte in manchen Bereichen.", "advice": "öfter mal Danke sagen an alle Mitarbeiter und Bereiche. Bitte vergesst nicht das Graue und Blaue Personal. Denn ohne uns würde es Vivantes auch nicht so gut gehen."}, {"title": "Außen hui innen pfui", "text": "Pros Gehalt wird immer pünktlich bezahlt Cons Vergiß Arbeitsschutz, Pausen oder normale Arbeitszeiten. Oft arbeitet man mit ungelernten Kräften, hohe Krankenstände unfähige Ärzte frisch vom Studium. Unzureichende Patientenversorgung, unfähige Vorgesetzte, keine Parkplätze Pausenräume für Mitarbeiter, Dreck der von ungelernten Putkräften von links nach rechts gewischt wird. Standarts gibt es aber werden nicht eingehalten, Ausschreibungen sind fingiert Advice to Management Umsetzung der Standarts, In allen Häusern gleiche Doku, Wertschätzung des Personals das das Geld generiert (Pflegekräfte)...", "rating": 1, "pros": "Gehalt wird immer pünktlich bezahlt", "cons": "Vergiß Arbeitsschutz, Pausen oder normale Arbeitszeiten. Oft arbeitet man mit ungelernten Kräften, hohe Krankenstände unfähige Ärzte frisch vom Studium. Unzureichende Patientenversorgung, unfähige Vorgesetzte, keine Parkplätze Pausenräume für Mitarbeiter, Dreck der von ungelernten Putkräften von links nach rechts gewischt wird. Standarts gibt es aber werden nicht eingehalten, Ausschreibungen sind fingiert", "advice": "Umsetzung der Standarts, In allen Häusern gleiche Doku, Wertschätzung des Personals das das Geld generiert (Pflegekräfte)..."}, {"title": "sehr Zufrieden", "text": "Pros Komunikativ,Verständnisvoll,diskusion möglich,Familienbezogen,Sozial,Flexibel,Ideenreich,Motivierend,Altesteilzeit möglich,wechsel zwischen den Kliniken möglich,Fortbildungsförderer,Weiterbildung,Verschiedene Arbeitszeitmodelle, Cons Zu schnelle Entscheidungen-Umsetzungen, viele Überstunden,wenig Freizeit,weniger Geld usw.zu viele Kämpfe für die eigene Abteilung..... Advice to Management Arbeitsintensität am Ort Überprüfen ,mehr Personal wo nötig,", "rating": 5, "pros": "Komunikativ,Verständnisvoll,diskusion möglich,Familienbezogen,Sozial,Flexibel,Ideenreich,Motivierend,Altesteilzeit möglich,wechsel zwischen den Kliniken möglich,Fortbildungsförderer,Weiterbildung,Verschiedene Arbeitszeitmodelle,", "cons": "Zu schnelle Entscheidungen-Umsetzungen, viele Überstunden,wenig Freizeit,weniger Geld usw.zu viele Kämpfe für die eigene Abteilung.....", "advice": "Arbeitsintensität am Ort Überprüfen ,mehr Personal wo nötig,"}, {"title": "ich arbeite gern hier", "text": "Pros VBL, TVÖD, nette Kollegen (Pflege, Ärzte, uvm.) Cons Pflegeschlüssel und zu wenig Personal. Wofür aber Vivantes nichts kann. Advice to Management Gleichheit für Ost- und Weststandorte. Selbe Arbeit, selber Ausbildungsstand, selbe Regeln, selbe Erwartungen, keine sinnvolle Begründung von Unterschieden.", "rating": 5, "pros": "VBL, TVÖD, nette Kollegen (Pflege, Ärzte, uvm.)", "cons": "Pflegeschlüssel und zu wenig Personal. Wofür aber Vivantes nichts kann.", "advice": "Gleichheit für Ost- und Weststandorte. Selbe Arbeit, selber Ausbildungsstand, selbe Regeln, selbe Erwartungen, keine sinnvolle Begründung von Unterschieden."}, {"title": "Schade, nicht mehr dabei", "text": "Pros großes Unternehmen, viele nette KollegInnen Cons manche Vorgesetzte haben vergessen, dass Sklavenhaltung seit 1899 verboten ist Advice to Management mehr Informationen, ergibt mehr Zusammenhalt", "rating": 5, "pros": "großes Unternehmen, viele nette KollegInnen", "cons": "manche Vorgesetzte haben vergessen, dass Sklavenhaltung seit 1899 verboten ist", "advice": "mehr Informationen, ergibt mehr Zusammenhalt"}, {"title": "Macht richtig Spass", "text": "Pros Interessante Unterrichtgestaltung; man sammelt viel Erfahrung in der Praxiszeit; die Bezahlung ist der Hammer!!! Cons Mehr Pflegepersonal würde das Arbeitsklima verbessern Advice to Management Hören Sie auf die Krankenhäuser als Geschäft zu sehen, sondern als ein richtiges Krankenhaus, in dem es genug Pflegepersonal gibt.", "rating": 5, "pros": "Interessante Unterrichtgestaltung; man sammelt viel Erfahrung in der Praxiszeit; die Bezahlung ist der Hammer!!!", "cons": "Mehr Pflegepersonal würde das Arbeitsklima verbessern", "advice": "Hören Sie auf die Krankenhäuser als Geschäft zu sehen, sondern als ein richtiges Krankenhaus, in dem es genug Pflegepersonal gibt."}, {"title": "in ordnung", "text": "Pros nette kolegen, moderne einricchtungen, und super sauber Cons giebt es nichts was ich jetz nennen könnte", "rating": 5, "pros": "nette kolegen, moderne einricchtungen, und super sauber", "cons": "giebt es nichts was ich jetz nennen könnte", "advice": null}, {"title": "Krankenpfleger", "text": "Pros keine es geht dem Konzern nur um seinen eigenen Profit Cons Menschen verachtende Arbeitsbedingungen, schlechte Hygiene, schlechtes Arbeitsklima", "rating": 1, "pros": "keine", "cons": "Menschen verachtende Arbeitsbedingungen, schlechte Hygiene, schlechtes Arbeitsklima", "advice": null}, {"title": "Sehr angenehmes Arbeitsklima obwohl sehr großes Krankenhaus", "text": "Pros Vivantes Klinikum im Friedrichshain ist gut gelegen und es gibt alle nötigen Fachbereiche. Je nach Fachbereich ist der Arbeitsaufwand natürlich verschieden, aber meine Einblicke waren insgesamt sehr positiv geprägt. Außerdem ist die Mensa gut und hat ein großes Salatbuffet. Cons Die Größe ist manchmal etwas schwierig, außerdem wird es gerade um-/ausgebaut, sodass der Geräuschpegel an manchen Stellen schon nicht mehr ganz legal sein kann.", "rating": 5, "pros": "Vivantes Klinikum im Friedrichshain ist gut gelegen und es gibt alle nötigen Fachbereiche. Je nach Fachbereich ist der Arbeitsaufwand natürlich verschieden, aber meine Einblicke waren insgesamt sehr positiv geprägt. Außerdem ist die Mensa gut und hat ein großes Salatbuffet.", "cons": "Die Größe ist manchmal etwas schwierig, außerdem wird es gerade um-/ausgebaut, sodass der Geräuschpegel an manchen Stellen schon nicht mehr ganz legal sein kann.", "advice": null}]