[{"title": "General Manager", "text": "Pros Great company to work for, I have been with Wagamama for over 14 years and still in love with the company values and culture. We have created an atmosphere where our staff wants to come to work rather than they have to. we win together and we lose together Cons As yet we don't have senior managers annual celebration, but it is on the way as we are developing in USA", "rating": 5, "pros": "Great company to work for, I have been with Wagamama for over 14 years and still in love with the company values and culture. We have created an atmosphere where our staff wants to come to work rather than they have to. we win together and we lose together", "cons": "As yet we don't have senior managers annual celebration, but it is on the way as we are developing in USA", "advice": null}, {"title": "Front of the house", "text": "Pros Really good, free food every time you work. They don't care about tattoos, piercings or weird hair. Restaurants are quite aesthetically pleasing and great locations in boston. Cons The sidework takes FOREVER! You work really, really hard for not a lot of money. In doing the hourly math, I wasn't even making minimum wage after all was said and done. Pooled tip system as well, so if you work with lazy people, your pay won't differ any from theirs. Advice to Management Be more in touch with hard you make the servers work versus how little they are making...", "rating": 3, "pros": "Really good, free food every time you work. They don't care about tattoos, piercings or weird hair. Restaurants are quite aesthetically pleasing and great locations in boston.", "cons": "The sidework takes FOREVER! You work really, really hard for not a lot of money. In doing the hourly math, I wasn't even making minimum wage after all was said and done. Pooled tip system as well, so if you work with lazy people, your pay won't differ any from theirs.", "advice": "Be more in touch with hard you make the servers work versus how little they are making..."}, {"title": "Great potential, but managers ruin the job.", "text": "Pros Can meet some cool people, free food Cons pool tips & managers overstaff so they don't need to work managers don't care about you or your money managers don't hold servers accountable for their work managers hide in office managers talk down to you and treat you like children Advice to Management go back to your roots. let your servers work hard and make money. work hard for them and make them want to work hard for you. don't talk to your employees like children, talk to them like the educated adults that they are. when a manager is accused of making servers uncomfortable with sexual comments, fire them. don't promote people who don't deserve it - make sure they are ready for management. ask your servers how they feel, open up conversation. stop trying to run the business in the us like it is in the uk. it is not the same thing. it will not work. you will keep closing down stores and failing.", "rating": 1, "pros": "Can meet some cool people, free food", "cons": "pool tips & managers overstaff so they don't need to work", "advice": "go back to your roots. let your servers work hard and make money. work hard for them and make them want to work hard for you. don't talk to your employees like children, talk to them like the educated adults that they are."}, {"title": "manager", "text": "Pros great environment where you can have fun but also develop Cons none really best job I have had in a long time Advice to Management none", "rating": 5, "pros": "great environment where you can have fun but also develop", "cons": "none really best job I have had in a long time", "advice": "none"}, {"title": "wagamama usa", "text": "Pros In wagamama our guests get everything the very moment it is ready, cooked from scratch. It is a new kind of eating experience in our lovely hectic nyc. Here we have no heat lamps, no microwaves and the quality of our ingredients is as fresh as possible delivered from source to table. From employees prospective i can say, and i am sure many will agree, that wagamama has tons of resources and systems for constant training and development which are offered to all members of the team. This aspect was quite new and very impressive for me since there are many companies where development of staff is not the main focus. In wagamama staff hears all the time \"our people are as important to wagamama, as good food is important to our guests\". As part of this team you are being treated as a very special person already. There is a full team taking care of each aspect of this business including an HR department which is always helpful, effective and attentive.If anyone considers this field as a career, there is no doubt, that wagamama would be a great place to be at now. Its structure has a great number of opportunities for each of the employees. Aiming to be the best at what we do, wagamama is striving to be proactive, better every day (kaizen) and we have big plans and bright future in usa. Cons There are many changes with staff right now because we are building a new team who will grow into a usa crew for our multiple locations. It is not a con because only strong and the most focused staff members can handle the fast pace of our flow. Under pressure some people focus and some of them fold;)", "rating": 5, "pros": "In wagamama our guests get everything the very moment it is ready, cooked from scratch. It is a new kind of eating experience in our lovely hectic nyc. Here we have no heat lamps, no microwaves and the quality of our ingredients is as fresh as possible delivered from source to table.", "cons": "There are many changes with staff right now because we are building a new team who will grow into a usa crew for our multiple locations. It is not a con because only strong and the most focused staff members can handle the fast pace of our flow. Under pressure some people focus and some of them fold;)", "advice": null}, {"title": "Sold the dream but doesnt live up to the hype", "text": "Pros Great location and beautiful restaurant. Cool concept and easy job. Perfect for people with no experience or PT student gig etc. Cons Most of the current staff is young (Cliquey) and has no previous serving experience. Wagamama policy is a tip-pooled system and average tip outs and way below NYC industry standard. Most of the management loves to micromanage you, and for the money, you are making it is NOT worth it. Advice to Management Follow your own Kaizen policy and get rid of tip pooling, and hire managers with NYC experience that are more hands on and knows how to support the staff instead of micromanaging.", "rating": 3, "pros": "Great location and beautiful restaurant. Cool concept and easy job. Perfect for people with no experience or PT student gig etc.", "cons": "Most of the current staff is young (Cliquey) and has no previous serving experience. Wagamama policy is a tip-pooled system and average tip outs and way below NYC industry standard. Most of the management loves to micromanage you, and for the money, you are making it is NOT worth it.", "advice": "Follow your own Kaizen policy and get rid of tip pooling, and hire managers with NYC experience that are more hands on and knows how to support the staff instead of micromanaging."}, {"title": "Wagamama review", "text": "Pros Great co-workers and some nice and understanding managers Cons Horrible higher ups, they sell you a story on how much you'll make and grow", "rating": 3, "pros": "Great co-workers and some nice and understanding managers", "cons": "Horrible higher ups, they sell you a story on how much you'll make and grow", "advice": null}, {"title": "Wagamama", "text": "Pros Flexible schedule and decent money Cons Bad management and high employee turnover", "rating": 3, "pros": "Flexible schedule and decent money", "cons": "Bad management and high employee turnover", "advice": null}, {"title": "Overall \"ok\" experience", "text": "Pros Awesome co-workers, popular restaurant so you will make great tips. Cons Management is extremely out of touch.", "rating": 1, "pros": "Awesome co-workers, popular restaurant so you will make great tips.", "cons": "Management is extremely out of touch.", "advice": null}, {"title": "just start to work", "text": "Pros Great brand to work Well ,paid paid, break also Cons Happy to work with wagamama Love it Advice to Management Great to work Well paid Hard work", "rating": 5, "pros": "Great brand to work", "cons": "Happy to work with wagamama", "advice": "Great to work"}, {"title": "At least you get free meals", "text": "Pros You get an amazing free meal every shift Cons Got screwed by the management, who refused to share tips with me Advice to Management Treat your employees better", "rating": 3, "pros": "You get an amazing free meal every shift", "cons": "Got screwed by the management, who refused to share tips with me", "advice": "Treat your employees better"}, {"title": "I worked extremely hard and was 100% committed worked 6 and even 7dayss a week when we were shorthanded we consistently", "text": "Pros Great product and made me proud to serve top quality food Cons Did not pay managers fairly and promoted inexperienced managers to Gm positions so they didn't need to keep mature experienced Gms Advice to Management Be careful how you operate in the US age discrimination is against the law", "rating": 1, "pros": "Great product and made me proud to serve top quality food", "cons": "Did not pay managers fairly and promoted inexperienced managers to Gm positions so they didn't need to keep mature experienced Gms", "advice": "Be careful how you operate in the US age discrimination is against the law"}, {"title": "Noodles", "text": "Pros Nothing not worth the trouble Cons Cheap company lies lies lies", "rating": 1, "pros": "Nothing not worth the trouble", "cons": "Cheap company lies lies lies", "advice": null}, {"title": "Good for money", "text": "Pros Unique server position. Team mentality. No hostess, bartender, server division, everyone does everything. A good amount of money and you can get hired with no serving experience. Usually walk out with $100 for a pm shift. I've made over $300 working from about noon to 10 pm. (Although that's rare and not even worth the money). Cons Pooled tips allow some people to be lazy and others to do everything. Most don't take advantage but the few that do seem to be able to stick around for a very long time. The team work thing can result in miscommunications being a much bigger deal than they need to be. Also, there is never anyone specific to blame when something goes wrong so a lot of time is spent going over basics because one person messes up repeatedly.", "rating": 3, "pros": "Unique server position. Team mentality. No hostess, bartender, server division, everyone does everything. A good amount of money and you can get hired with no serving experience.", "cons": "Pooled tips allow some people to be lazy and others to do everything. Most don't take advantage but the few that do seem to be able to stick around for a very long time. The team work thing can result in miscommunications being a much bigger deal than they need to be. Also, there is never anyone specific to blame when something goes wrong so a lot of time is spent going over basics because one person messes up repeatedly.", "advice": null}, {"title": "senior sou chef", "text": "Pros At 1st they value you as a person but the culture got change when the company become more American. Cons The upper management don't see the real picture hope they see it now", "rating": 5, "pros": "At 1st they value you as a person but the culture got change when the company become more American.", "cons": "The upper management don't see the real picture hope they see it now", "advice": null}, {"title": "Pay is awesome", "text": "Pros The pay was incredible for the type of restaurant Wagamamma is. Wagamamma has very quick turnover, and although individual bills rarely get to be too pricey, few linger very long in the restaurant and there are always customers ordering drinks. Plus, because it is more of a fast-food oriented place, the level of service expected by customers is not as demanding as other restaurants. People do not expect great service, and if one gives it to them, customers tip like crazy. Cons This is not an easy job. The restaurant is always busy and servers' side work is the most extensive of any restaurant that I've worked. If you are standing still, expect a chore to be delegated to you within 30 seconds. Management has proven to be somewhat disorganized in my experience.", "rating": 5, "pros": "The pay was incredible for the type of restaurant Wagamamma is. Wagamamma has very quick turnover, and although individual bills rarely get to be too pricey, few linger very long in the restaurant and there are always customers ordering drinks. Plus, because it is more of a fast-food oriented place, the level of service expected by customers is not as demanding as other restaurants. People do not expect great service, and if one gives it to them, customers tip like crazy.", "cons": "This is not an easy job. The restaurant is always busy and servers' side work is the most extensive of any restaurant that I've worked. If you are standing still, expect a chore to be delegated to you within 30 seconds. Management has proven to be somewhat disorganized in my experience.", "advice": null}, {"title": "wagamama boston", "text": "Pros uk-based noodle house in US, solid training initially, fast paced, clean environment to work, good teamwork, food is tasty and benefits were above average for hospitality industry. Cons although large company overseas, still very small in US, not enough brand recognition yet, still getting their US legs under them, but dedicated people in place. Advice to Management i filled out appropriate pros and cons for wagamama, but i do not think they need my advice on how to run their company any differently.", "rating": 3, "pros": "uk-based noodle house in US, solid training initially, fast paced, clean environment to work, good teamwork, food is tasty and benefits were above average for hospitality industry.", "cons": "although large company overseas, still very small in US, not enough brand recognition yet, still getting their US legs under them, but dedicated people in place.", "advice": "i filled out appropriate pros and cons for wagamama, but i do not think they need my advice on how to run their company any differently."}, {"title": "Would Not Choose Any Where Else To Work", "text": "Pros You feel apart of a family and that your best interest is at heart. Its such a vibrant and colour place to work the atmosphere is euphoric . Cons Wagamma is a very fast pace business and sometimes it can be overwhelming. Advice to Management Keep building a relationship with the whole team. I sometimes feel like BOH and FOH are not seen as one team but separately and it sucks.", "rating": 5, "pros": "You feel apart of a family and that your best interest is at heart. Its such a vibrant and colour place to work the atmosphere is euphoric .", "cons": "Wagamma is a very fast pace business and sometimes it can be overwhelming.", "advice": "Keep building a relationship with the whole team. I sometimes feel like BOH and FOH are not seen as one team but separately and it sucks."}, {"title": "Always amazing staff to help you when your stuck", "text": "Pros Brilliant head chef, Amazing sou chefs, great employes Cons No downsides, I love it Advice to Management Stay as you are because you are absolutely brilliant", "rating": 5, "pros": "Brilliant head chef,", "cons": "No downsides, I love it", "advice": "Stay as you are because you are absolutely brilliant"}, {"title": "team member", "text": "Pros friendly, flexible, lot's of fun Cons I can't use iPack. The letters are too small Advice to Management using iPack shouldn't be obligatory", "rating": 5, "pros": "friendly, flexible, lot's of fun", "cons": "I can't use iPack. The letters are too small", "advice": "using iPack shouldn't be obligatory"}, {"title": "Waitress", "text": "Pros Really fantastic team and work environement Cons Some times it becomes too busy in store to train", "rating": 5, "pros": "Really fantastic team and work environement", "cons": "Some times it becomes too busy in store to train", "advice": null}, {"title": "Busy enviroment", "text": "Pros Very very busy restaurant chain. Sometimes very stresfull especially at the weekend time When people are waiting on the door to get the table. Cons Taking tax from all tips, very busy and stressfull restaurant, easyer to get promotion if you have a friends in management, long hours full of stress Advice to Management Be an example for your staff, show them you know how to support them on the busy shift, be helpfull, be fair to everyone not just to your friends,", "rating": 3, "pros": "Very very busy restaurant chain. Sometimes very stresfull especially at the weekend time When people are waiting on the door to get the table.", "cons": "Taking tax from all tips, very busy and stressfull restaurant, easyer to get promotion if you have a friends in management, long hours full of stress", "advice": "Be an example for your staff, show them you know how to support them on the busy shift, be helpfull, be fair to everyone not just to your friends,"}, {"title": "Great if you can handle the pressure!", "text": "Pros Free meals-but you can only eat the premium ones whilst on probation, after that it's only the regular ones unless you're management Tips are shared (this can be a pro or a con depending on your own performance) Cons hugely stressful environment, shifts poorly organised when I first started- wasn't shown the rota so I had no idea when I was supposed to come in", "rating": 3, "pros": "Free meals-but you can only eat the premium ones whilst on probation, after that it's only the regular ones unless you're management", "cons": "hugely stressful environment, shifts poorly organised when I first started- wasn't shown the rota so I had no idea when I was supposed to come in", "advice": null}, {"title": "Such a fun place to work", "text": "Pros Out of all the jobs in my lifetime, Wagamama is by far the best! Ive had such fun working here and hope it continues! Everyone I work with is super nice and so helpful during my training, if I ever had a problem or question, there would always be someone willing to help me. The money is great and the management will always try to give you more shifts if you need them, and vice versa! FREE FOOD EVERY SHIFT Cons There are not a lot really, just the fact that you can sometimes work till past 12 at night. But if you’re looking at working in hospitality then you should be expecting that or even later. Advice to Management Push for people to progress in the company more!", "rating": 5, "pros": "Out of all the jobs in my lifetime, Wagamama is by far the best! Ive had such fun working here and hope it continues! Everyone I work with is super nice and so helpful during my training, if I ever had a problem or question, there would always be someone willing to help me. The money is great and the management will always try to give you more shifts if you need them, and vice versa!", "cons": "There are not a lot really, just the fact that you can sometimes work till past 12 at night. But if you’re looking at working in hospitality then you should be expecting that or even later.", "advice": "Push for people to progress in the company more!"}, {"title": "First 12 weeks of work", "text": "Pros Most of the other staff are lovely, if I don't understand anything or need help someone offers aid quickly as well as the general vibe of the restaurant being busy and happy Cons If workers are treated unfairly then there is rarely an opportunity to point this out, also you are often asked to work over your rota hours Advice to Management Just remember it's always better to be over staffed than under staffed", "rating": 5, "pros": "Most of the other staff are lovely, if I don't understand anything or need help someone offers aid quickly as well as the general vibe of the restaurant being busy and happy", "cons": "If workers are treated unfairly then there is rarely an opportunity to point this out, also you are often asked to work over your rota hours", "advice": "Just remember it's always better to be over staffed than under staffed"}, {"title": "Wagamama", "text": "Pros Everyones nice, people are honest and supportive by helping you know where you falling and it help me focus on being better Cons Just the hours are slacking abit which i understand isn't entirely Wagamamas fault", "rating": 5, "pros": "Everyones nice, people are honest and supportive by helping you know where you falling and it help me focus on being better", "cons": "Just the hours are slacking abit which i understand isn't entirely Wagamamas fault", "advice": null}, {"title": "Maybe you listen", "text": "Pros Responsibility, freedom, learning to work with different costumers everyday Cons Sharing tips, comunication, opportunities to grow, undervalued, no motivation to the staff Advice to Management Take more care of the staff you have, stop pressuring old staff and push more the new ones, everyone should work the same, we end up sharing tips no? Find equality and motivate your team, give them challenges value them", "rating": 3, "pros": "Responsibility, freedom, learning to work with different costumers everyday", "cons": "Sharing tips, comunication, opportunities to grow, undervalued, no motivation to the staff", "advice": "Take more care of the staff you have, stop pressuring old staff and push more the new ones, everyone should work the same, we end up sharing tips no? Find equality and motivate your team, give them challenges value them"}, {"title": "The perfect job position for a student", "text": "Pros Well paid Flexibility in the working hours Great team Great management team Some benefits in Tivoli Cons Some stressful situations, it is important to know how to deal with stress It works by seasons.", "rating": 5, "pros": "Well paid", "cons": "Some stressful situations, it is important to know how to deal with stress", "advice": null}, {"title": "Good company", "text": "Pros Staff and good direct management Cons Low pay and under staffed at times Advice to Management Keep it uo", "rating": 5, "pros": "Staff and good direct management", "cons": "Low pay and under staffed at times", "advice": "Keep it uo"}, {"title": "Excellent leadership and a growing, caring, culture", "text": "Pros The amazing food, the people are outstanding and like a huge family. The opportunities are constant and all over the country so it keeps it interesting. Cons There are lots of great ideas about career progression but not all of it is put into practise and can feel like a lot of hot air sometimes. Also pay is not competitive compared to the market. Advice to Management Grow from within, cherish those who might not make the most noise but probably make a bigger impact.", "rating": 5, "pros": "The amazing food, the people are outstanding and like a huge family. The opportunities are constant and all over the country so it keeps it interesting.", "cons": "There are lots of great ideas about career progression but not all of it is put into practise and can feel like a lot of hot air sometimes. Also pay is not competitive compared to the market.", "advice": "Grow from within, cherish those who might not make the most noise but probably make a bigger impact."}, {"title": "Awesome", "text": "Pros Positive work place Busy restaurants Great training Clear progression Honestly a real pleasure to head into work every day. Cons As with every hospitality job there are late nights. Advice to Management Keep it up!", "rating": 5, "pros": "Positive work place", "cons": "As with every hospitality job there are late nights.", "advice": "Keep it up!"}, {"title": "Great place to work for.", "text": "Pros People are nice and you got managers support. Staff food is very generous. Salary is good with tips. Getting paid weekly. A lot of opportunities to develop within the company. Generally speaking a great place to work for where you can have a lot of fun on shift. Cons The split shifts. They are a killer and make your day so long. They can have you sitting and waiting before you start your shift, so when it is not busy you are sitting for 1-2 hours and you are not getting paid. That is quite upsetting. Salary is good only with tips. £7.5 is not a got salary. Advice to Management Management is doing a good job. So make sure you keep looking after your people and maybe just try to minimise the impact of people sitting for 1 hour or longer before they start.", "rating": 5, "pros": "People are nice and you got managers support. Staff food is very generous. Salary is good with tips. Getting paid weekly. A lot of opportunities to develop within the company. Generally speaking a great place to work for where you can have a lot of fun on shift.", "cons": "The split shifts. They are a killer and make your day so long. They can have you sitting and waiting before you start your shift, so when it is not busy you are sitting for 1-2 hours and you are not getting paid. That is quite upsetting. Salary is good only with tips. £7.5 is not a got salary.", "advice": "Management is doing a good job. So make sure you keep looking after your people and maybe just try to minimise the impact of people sitting for 1 hour or longer before they start."}, {"title": "Amazing", "text": "Pros I couldn't ask for a better team, we are like a family so it doesn't feel like I'm at work, we have great chemistry and it's great to be around people with the same mentality and goals that I have. It's the best thing that happened to me in the past years.thank you Cons The days off may change Advice to Management Keep challenging us, it's the only way to improve!", "rating": 5, "pros": "I couldn't ask for a better team, we are like a family so it doesn't feel like I'm at work, we have great chemistry and it's great to be around people with the same mentality and goals that I have. It's the best thing that happened to me in the past years.thank you", "cons": "The days off may change", "advice": "Keep challenging us, it's the only way to improve!"}, {"title": "4 month at Wagamama", "text": "Pros Wonderful staff to work with and they’re all lovely and friendly! Cons Working behind the bar can be very stressful Advice to Management Listen to your staff and treat them with as much respect as yourself deserves", "rating": 5, "pros": "Wonderful staff to work with and they’re all lovely and friendly!", "cons": "Working behind the bar can be very stressful", "advice": "Listen to your staff and treat them with as much respect as yourself deserves"}, {"title": "Clashing Management - no unanimous instructions", "text": "Pros Friendly team Love the food Welcoming ‘culture’ Cons I had multiple supervisors/managers on any given shift and they couldn’t seem to agree on how lower level foh staff should do things. I just wanted to do my job (in a very high volume branch) but often got caught in the middle of seemingly personal spats. Advice to Management Unity makes everything run smoother", "rating": 3, "pros": "Friendly team", "cons": "I had multiple supervisors/managers on any given shift and they couldn’t seem to agree on how lower level foh staff should do things. I just wanted to do my job (in a very high volume branch) but often got caught in the middle of seemingly personal spats.", "advice": "Unity makes everything run smoother"}, {"title": "waiter", "text": "Pros great staff who really help you progress Cons can be long hours as you may get tired Advice to Management more bonuses and more shifts also great management", "rating": 5, "pros": "great staff who really help you progress", "cons": "can be long hours as you may get tired", "advice": "more bonuses and more shifts also great management"}, {"title": "Working for Wagamama's", "text": "Pros Kaizen Philosophy does make a difference how happy an employee is. The fast pace and the importance of being a team should attract more interest. If you give yourself in, you just improving yourself everyday with Wagamama's, the platform is there! And it does grow you as a person really well Cons Definetely it's hard work, but that hard work should be recognised everyday too, it does have a feeling as if you are nothing special sometimes, even if you been sweating off running the drinks and food or can't even put a sentence together sometimes from serving the customers all day. Another thing, I don't if its only in my restaurant, but no one really cares about the training of new staff, they not welcomed warm and one trying to teach them the best practises, so to become a full team member it is hard for them. Advice to Management My big advice would be to keep more attention to the team, work more with a team, try to boost they motivation and find a nice approach to them, make it open and a warm relationship. Use the incentive's, team meetings, specific role trainings more.", "rating": 5, "pros": "Kaizen Philosophy does make a difference how happy an employee is.", "cons": "Definetely it's hard work, but that hard work should be recognised everyday too, it does have a feeling as if you are nothing special sometimes, even if you been sweating off running the drinks and food or can't even put a sentence together sometimes from serving the customers all day. Another thing, I don't if its only in my restaurant, but no one really cares about the training of new staff, they not welcomed warm and one trying to teach them the best practises, so to become a full team member it is hard for them.", "advice": "My big advice would be to keep more attention to the team, work more with a team, try to boost they motivation and find a nice approach to them, make it open and a warm relationship. Use the incentive's, team meetings, specific role trainings more."}, {"title": "Fun and happy place to work", "text": "Pros Excellent staff and excellent place to work Cons Nothing really bad to say", "rating": 5, "pros": "Excellent staff and excellent place to work", "cons": "Nothing really bad to say", "advice": null}, {"title": "Free food!", "text": "Pros Free food, passionate team, lovely people, really good career prospects Cons Week end working, evenings too", "rating": 5, "pros": "Free food, passionate team, lovely people, really good career prospects", "cons": "Week end working, evenings too", "advice": null}, {"title": "Foh", "text": "Pros Passion for foods, love costumes Cons Way Too long lunch breaks Advice to Management No breaks", "rating": 5, "pros": "Passion for foods, love costumes", "cons": "Way Too long lunch breaks", "advice": "No breaks"}, {"title": "Horrendous", "text": "Pros Good money, good tips that’s it Cons Absolutely abmissal, the managers treat you like rubbish, if you don’t hit some targets some days you get shunned but when you do hit targets you never get praise. As long as they get their bonus they don’t care about your health. Long hours, expect to start at 11am and not finish until midnight more than 3 or 4 times a week. Never actually knowing what time you’ll finish either, you can be rota’d in for a 12-7 but not finish until midnight. Sometimes they send you out on 3 hour long lunch breaks because they’re quiet. But expect you to be around so if it does get busy you have to rush back out there. Holidays were always a nightmare, you don’t know you’ve got them until the week before. The rotas were always out on a Friday, so you wouldn’t know if you were working Monday until the Friday. Which is ridiculous. The managers don’t want to help on the floor, they’re above that.", "rating": 1, "pros": "Good money, good tips that’s it", "cons": "Absolutely abmissal, the managers treat you like rubbish, if you don’t hit some targets some days you get shunned but when you do hit targets you never get praise. As long as they get their bonus they don’t care about your health.", "advice": null}, {"title": "Not the worst job in life but they treat you like trash", "text": "Pros There is quite good salary, but you share with colleagues equally, which means if you are a hard worker, you will work for lazy ones and be paid the same. Managers are acting like they did already enough, so they are not helping, but the company instead of paying them more, is giving them bigger percent of your tips, it may happen, you will work with 3 of them on the shift and guess what, you will be the only one who's running. The budgets for restaurants are so high, that even if it's crazy busy all day long, it will never be enough. This place works almost like factory, factory to make money, money. Always a mess with rotas, holidays. Never finishing on time, they do even sth like 'dots' which means you never know what time you will finish, maybe 8pm, maybe 11pm. Policy about customers is depressing, but I believe that is what buys customers these time. They don't train you even if you are good, they are just lying to you, to keep you there, best, working for free, doing e-learning at home, preparing extras at home also, just to hear that they don't have time for you. It's not that managers are the problem here, this company don't care about them too. They are also hiring anyone, without thinking if it is going to be possible to work with them later on. I wouldn't recommend this job to anyone. Maybe before this place was different, but now I can't see any good parts of working there. Cons As above, because I don't see any good parts of work there. Advice to Management Don't be scared to help your people, don't stay focussed only on your own position, try to train people more and at least in half know what is happening in your restaurant. As the last one, don't forget about communication, which fails all of the time", "rating": 1, "pros": "There is quite good salary, but you share with colleagues equally, which means if you are a hard worker, you will work for lazy ones and be paid the same. Managers are acting like they did already enough, so they are not helping, but the company instead of paying them more, is giving them bigger percent of your tips, it may happen, you will work with 3 of them on the shift and guess what, you will be the only one who's running. The budgets for restaurants are so high, that even if it's crazy busy all day long, it will never be enough. This place works almost like factory, factory to make money, money. Always a mess with rotas, holidays. Never finishing on time, they do even sth like 'dots' which means you never know what time you will finish, maybe 8pm, maybe 11pm. Policy about customers is depressing, but I believe that is what buys customers these time. They don't train you even if you are good, they are just lying to you, to keep you there, best, working for free, doing e-learning at home, preparing extras at home also, just to hear that they don't have time for you. It's not that managers are the problem here, this company don't care about them too. They are also hiring anyone, without thinking if it is going to be possible to work with them later on. I wouldn't recommend this job to anyone. Maybe before this place was different, but now I can't see any good parts of working there.", "cons": "As above, because I don't see any good parts of work there.", "advice": "Don't be scared to help your people, don't stay focussed only on your own position, try to train people more and at least in half know what is happening in your restaurant. As the last one, don't forget about communication, which fails all of the time"}, {"title": "Kitchen assistant", "text": "Pros This work place has a lot pros, free meals, paid breaks,progression, amazing management staff who at all time take care for their workers, weekly paid salary, monthly paid tips Cons I like and enjoy working here and nothing of cons to say Advice to Management It's Amaizing place to work and Amazing management staff", "rating": 5, "pros": "This work place has a lot pros, free meals, paid breaks,progression, amazing management staff who at all time take care for their workers, weekly paid salary, monthly paid tips", "cons": "I like and enjoy working here and nothing of cons to say", "advice": "It's Amaizing place to work and Amazing management staff"}, {"title": "Good", "text": "Pros Flexible rota Discount for food Free food at work Friendly collegues Good tips Cons No career opportunities Very busy Long hours", "rating": 5, "pros": "Flexible rota", "cons": "No career opportunities", "advice": null}, {"title": "Front Of House", "text": "Pros Fun, busy, good pay, friendly Cons Long hours, not a lot of praise, Advice to Management Split up hours more evenly rather than having one person working a lot longer than others. Give more praise for positive feedback", "rating": 5, "pros": "Fun, busy, good pay, friendly", "cons": "Long hours, not a lot of praise,", "advice": "Split up hours more evenly rather than having one person working a lot longer than others. Give more praise for positive feedback"}, {"title": "Good Place to Work", "text": "Pros Free Food! Friendly work place to work Cons Long hours, and sometimes restaurants overcrowded", "rating": 5, "pros": "Free Food! Friendly work place to work", "cons": "Long hours, and sometimes restaurants overcrowded", "advice": null}, {"title": "Server", "text": "Pros Lovely and welcoming team, great opportunities, fun, rewarding Cons Absolutely none whatsoever, it's fabulous Advice to Management Keep doing what yo doing", "rating": 5, "pros": "Lovely and welcoming team, great opportunities, fun, rewarding", "cons": "Absolutely none whatsoever, it's fabulous", "advice": "Keep doing what yo doing"}, {"title": "the machine", "text": "Pros free food, tips, big team Cons heartless management. boring food, day in day out the same food over and over, cheap labor. underpaid and tips make up for it unfortunately Advice to Management look after your staff with equal respect. count tips with normal staff present we dont trust you. allow cash tips to be kept by individuals", "rating": 3, "pros": "free food, tips, big team", "cons": "heartless management. boring food, day in day out the same food over and over, cheap labor. underpaid and tips make up for it unfortunately", "advice": "look after your staff with equal respect. count tips with normal staff present we dont trust you. allow cash tips to be kept by individuals"}, {"title": "Kitchen assistant", "text": "Pros Wagamama is a serious company. The manager and work colleages are the most professional And accommodating people I have had the pleasure to meet. I have left my family in wagamama. It has changed my life Cons During my time working in wagamama I have not encountered any cons Advice to Management Keep doing what you are doing because you look after your staff brilliantly", "rating": 5, "pros": "Wagamama is a serious company. The manager and work colleages are the most professional And accommodating people I have had the pleasure to meet. I have left my family in wagamama. It has changed my life", "cons": "During my time working in wagamama I have not encountered any cons", "advice": "Keep doing what you are doing because you look after your staff brilliantly"}, {"title": "Nope, nope, nope", "text": "Pros The food is pretty tasty, and the central location gives access to many after-work adventures. Cons If you're lucky to get a good manager then you will have a great time at Wagamama, if not then it will be nightmarish. Advice to Management No.", "rating": 3, "pros": "The food is pretty tasty, and the central location gives access to many after-work adventures.", "cons": "If you're lucky to get a good manager then you will have a great time at Wagamama, if not then it will be nightmarish.", "advice": "No."}, {"title": "good pay annoying customers", "text": "Pros selective free staff food and tips (after four weeks + of training) Cons tips are taxed as well as shared, often poor management and majority of customers can be rude and unfair towards staff. Advice to Management To understand and respect work colleagues more.", "rating": 3, "pros": "selective free staff food and tips (after four weeks + of training)", "cons": "tips are taxed as well as shared, often poor management and majority of customers can be rude and unfair towards staff.", "advice": "To understand and respect work colleagues more."}, {"title": "It's a great place to start learning new skills at a high standard dinner", "text": "Pros Amazing team, helpful staff, Execellent skills Cons You can't be lazy at this place Advice to Management Keep the good work on!", "rating": 5, "pros": "Amazing team, helpful staff, Execellent skills", "cons": "You can't be lazy at this place", "advice": "Keep the good work on!"}, {"title": "Best company I’ve worked for", "text": "Pros As general manager you have full power over your restaurant , budgets and staff development Such empowerment makes you want to do your best at every step of journey Cons Long hours , work load -need to be super organised to comply with short deadlines Advice to Management More benefits for long serving employees", "rating": 5, "pros": "As general manager you have full power over your restaurant , budgets and staff development", "cons": "Long hours , work load -need to be super organised to comply with short deadlines", "advice": "More benefits for long serving employees"}, {"title": "Line Chef", "text": "Pros fantastic foods friendly staff and fresh juices Cons very busy never stop cooking", "rating": 5, "pros": "fantastic foods friendly staff and fresh juices", "cons": "very busy never stop cooking", "advice": null}, {"title": "Waitress", "text": "Pros Free food. That is all Cons They are not acting legal. They kept my original NINO and they are refusing to give it back to me. They say they don't have it anymore. I stopped working there 3 weeks ago and I didn't got my money yet. Worst job ever. I started training to be a waitress but 3 weeks later I was just cleaning tables and haven't served a plate to a table yet. That's just not right. Anyway I will take legal actions against them. This happend in wagamama white city, london Advice to Management Act legal.", "rating": 1, "pros": "Free food. That is all", "cons": "They are not acting legal. They kept my original NINO and they are refusing to give it back to me. They say they don't have it anymore. I stopped working there 3 weeks ago and I didn't got my money yet. Worst job ever. I started training to be a waitress but 3 weeks later I was just cleaning tables and haven't served a plate to a table yet. That's just not right. Anyway I will take legal actions against them. This happend in wagamama white city, london", "advice": "Act legal."}, {"title": "not anymore an option to consider if you want to work in hospitality", "text": "Pros the hectic, fun, engaging teamwork.The freedom to express your personality Cons little consideration for team members needs and well being from the management", "rating": 3, "pros": "the hectic, fun, engaging teamwork.The freedom to express your personality", "cons": "little consideration for team members needs and well being from the management", "advice": null}, {"title": "review", "text": "Pros good team, good teamwork, good pay for managers( not for line chefs) Cons low pay for line chefs, low tips for BOH team Advice to Management increase hourly pay for BOH team (linechefs) more tips for BOH team all wagamamas loosing bof team members because of this", "rating": 5, "pros": "good team, good teamwork, good pay for managers( not for line chefs)", "cons": "low pay for line chefs, low tips for BOH team", "advice": "increase hourly pay for BOH team (linechefs)"}, {"title": "Junio FOH Manager on training", "text": "Pros Wagamama gives you the opportunity to progress It’s a big and strong company Cons During this two years and a half I’m working for Wagamama I’ve seen Managers that they didn’t and they don’t deserve the role and very unfair things to members of the team and also hiring people that really there are no made for this kind of job", "rating": 5, "pros": "Wagamama gives you the opportunity to progress", "cons": "During this two years and a half I’m working for Wagamama I’ve seen Managers that they didn’t and they don’t deserve the role and very unfair things to members of the team and also hiring people that really there are no made for this kind of job", "advice": null}, {"title": "One of the best..,", "text": "Pros From my initial interview to now I feel I have been supported all the way. My training from being an external candidate was the best I’d received in the industry. Very well ran company. Cons Hard to find any?!", "rating": 5, "pros": "From my initial interview to now I feel I have been supported all the way. My training from being an external candidate was the best I’d received in the industry. Very well ran company.", "cons": "Hard to find any?!", "advice": null}, {"title": "Great place for a career", "text": "Pros Wagamama is a growing company that really looks after its team, providing great career pathways Cons The area managers and above can be a little out of the loop when it comes to day to day opperation", "rating": 5, "pros": "Wagamama is a growing company that really looks after its team, providing great career pathways", "cons": "The area managers and above can be a little out of the loop when it comes to day to day opperation", "advice": null}, {"title": "Amazing company to work for", "text": "Pros Employee motivated company, upbeat, enthusiastic and fun! Been with the company 6 years now and I still love it. I have had fluid progression and promotions since starting at the bottom of the ladder. So many opportunities, I travelled around the UK with the openings team, training new teams to reflect the brands amazing positivity. Cons Long hours- but well worth it Advice to Management N/a", "rating": 5, "pros": "Employee motivated company, upbeat, enthusiastic and fun! Been with the company 6 years now and I still love it.", "cons": "Long hours- but well worth it", "advice": "N/a"}, {"title": "A good experience overall", "text": "Pros Good benefits, A great working environment, Helpful Management, Nice pay Cons Long working hours, Tiring incredibly short break (30 min for 9 hour shifts) Advice to Management too many managers who require more training.", "rating": 5, "pros": "Good benefits,", "cons": "Long working hours,", "advice": "too many managers who require more training."}, {"title": "Promotes progression - no progression", "text": "Pros Pay is alright for the hours worked Team was super friendly Management were friendly and not intimidating Free food was amazing Training and induction were okay swapping shifts can be beneficial Cons Working weekends and evenings favoritism - leading to different treatment of staff for better or worse Promote progression but make it very difficult and daunting to progress unless you brown nose and/ or consistently do things far above your regular responsibilities Leading to and UNPAID 'team leader roll' which they can dangle in front of your nose and snatch away whenever they please. Company loyalty and consistent hard work mean nothing Non existent 1-1's or help with career development or PDPs. Virtually no team meetings Never felt like the company or higher management gave two monkeys about lower level employees and got told by a manager that I was easily replaced. (Which is true but not exactly what you like to hear after 2 and 1/2 years of loyal and consistent employment) Advice to Management Listen to and respect your employees feelings more more 1-1's and PDPs clearer personal and team objectives Don't promote great career progression if you can't deliver", "rating": 3, "pros": "Pay is alright for the hours worked", "cons": "Working weekends and evenings", "advice": "Listen to and respect your employees feelings more"}, {"title": "progressive, employee focussed company", "text": "Pros very focussed on work life balance and good training and develpoment throughout the company. Cons some senior managers had clear 'favourites' and therfore occasionally overlooked others skills and qualities", "rating": 5, "pros": "very focussed on work life balance and good training and develpoment throughout the company.", "cons": "some senior managers had clear 'favourites' and therfore occasionally overlooked others skills and qualities", "advice": null}, {"title": "Not bad", "text": "Pros Pay is wonderful, they’re really understanding when you’re sick Cons Sharing tips! Some people barely even work but still get the tips YOU have earned for you good service. Why do I have to share the rewards from my good service? That’s something Wagamama really needs to think about, not fair at all Advice to Management Step up because so much goes on behind the scenes that you guys should know about but you don’t", "rating": 5, "pros": "Pay is wonderful, they’re really understanding when you’re sick", "cons": "Sharing tips! Some people barely even work but still get the tips YOU have earned for you good service. Why do I have to share the rewards from my good service? That’s something Wagamama really needs to think about, not fair at all", "advice": "Step up because so much goes on behind the scenes that you guys should know about but you don’t"}, {"title": "Easy and Simple", "text": "Pros Very straightforward work Relaxed atmosphere Paid weekly instead of monthly Very accommodating to student workers Cons not enough shifts available sometimes", "rating": 5, "pros": "Very straightforward work", "cons": "not enough shifts available sometimes", "advice": null}, {"title": "My experience at wagamama nottingham", "text": "Pros Strong team mentality, heaps of support, big advocates for respect and equality amongst staff and customers. Huge potential to progress. Cons Hugh intensity during busy periods- manageable but not for the faint hearted.", "rating": 5, "pros": "Strong team mentality, heaps of support, big advocates for respect and equality amongst staff and customers. Huge potential to progress.", "cons": "Hugh intensity during busy periods- manageable but not for the faint hearted.", "advice": null}, {"title": "Line chef", "text": "Pros If you good at ur jobs u get more hours Cons Pay an management not good at they jobs. Like appreciate the people that working for them Advice to Management Appreciate the the people more. Because we make the food.", "rating": 3, "pros": "If you good at ur jobs u get more hours", "cons": "Pay an management not good at they jobs. Like appreciate the people that working for them", "advice": "Appreciate the the people more. Because we make the food."}, {"title": "-", "text": "Pros - meet nice people - days where it’s enjoyable - food! - opportunities Cons - can be stressful - gets boring sometimes Advice to Management For some not all, try and be more supportive/understanding for staffs sake.", "rating": 3, "pros": "- meet nice people", "cons": "- can be stressful", "advice": "For some not all, try and be more supportive/understanding for staffs sake."}, {"title": "kitchen porter", "text": "Pros you can get free food Cons tough job when u work in the evening weekend and if u have a family. Long hours, cant spend my time with my family Advice to Management weekend on and another weekend off, keep the rota balance.", "rating": 3, "pros": "you can get free food", "cons": "tough job when u work in the evening weekend and if u have a family. Long hours, cant spend my time with my family", "advice": "weekend on and another weekend off, keep the rota balance."}, {"title": "definitely underpaid.", "text": "Pros great work colleagues you can get promoted quick Cons I work in one of the busiest branches. We are definitely underpaid for all the hard work we do... If not the tips it would not be worth getting out of bed! All the tips are shared and for some reason managers get higher percentage of tips than the normal staff! All the tips are taxed, even when we are left cash on the table.", "rating": 3, "pros": "great work colleagues", "cons": "I work in one of the busiest branches. We are definitely underpaid for all the hard work we do... If not the tips it would not be worth getting out of bed!", "advice": null}, {"title": "Super easy and fun after training!", "text": "Pros Training was well delivered, meant you were given a proper starting to the job. Tips were a nice bonus to decent wage. Incentives at busy periods of work, e.g. On busy Saturdays there were competitions set to win some nice prizes. Cons Long hours, be prepared to be on your feet for many hours at a time especially on busy days. Sometimes the split shifts could be a pain but could work if you lived nearby restaurant. Advice to Management Make sure to compliment your staff and ensure them they are doing an awesome job especially during busy times when it can become stressful.", "rating": 5, "pros": "Training was well delivered, meant you were given a proper starting to the job.", "cons": "Long hours, be prepared to be on your feet for many hours at a time especially on busy days.", "advice": "Make sure to compliment your staff and ensure them they are doing an awesome job especially during busy times when it can become stressful."}, {"title": "Nice company to work for", "text": "Pros Good tips, friendly approach, big menu Cons Long hours sometimes, extra hours not paid for managers.", "rating": 5, "pros": "Good tips, friendly approach, big menu", "cons": "Long hours sometimes, extra hours not paid for managers.", "advice": null}, {"title": "Enjoyable journey", "text": "Pros Great support and training, great career progression Cons Management 48 hours contract, a 44 or 45 hour contract would be nice as an option for those with busy lives", "rating": 5, "pros": "Great support and training, great career progression", "cons": "Management 48 hours contract, a 44 or 45 hour contract would be nice as an option for those with busy lives", "advice": null}, {"title": "Worst job ever", "text": "Pros None whatsoever . Free food perhaps. Cons Discrimination whilst I was pregnant, no praise whatsoever. Expected to work like a slave for rubbish pay. Employers talk to you like dirt Advice to Management Close down the whole thing.", "rating": 1, "pros": "None whatsoever . Free food perhaps.", "cons": "Discrimination whilst I was pregnant, no praise whatsoever. Expected to work like a slave for rubbish pay. Employers talk to you like dirt", "advice": "Close down the whole thing."}, {"title": "Amazing experience", "text": "Pros Friendly environment Good pay Easy to communicate with other team members Cons The system could be improved by organising the shifts better", "rating": 5, "pros": "Friendly environment", "cons": "The system could be improved by organising the shifts better", "advice": null}, {"title": "Could you work for a better company?!?", "text": "Pros Where do I start!! From the amazing pay to the friendly and welcoming staff. From day one on my trial shift the Wagamama crew made me feel like family,from helping me learn all my dish numbers to teaching me table numbers. I honestly couldn't ask for a better job ❤️ Cons We receive our rota on paper or via our private Facebook group and it's not always put up the same time every week. If there was some sort of system in place that could allow us to check it online that would be great!!! Advice to Management Honestly, keep doing what you're doing I love every second of my job and all my managers are so friendly and caring", "rating": 5, "pros": "Where do I start!!", "cons": "We receive our rota on paper or via our private Facebook group and it's not always put up the same time every week. If there was some sort of system in place that could allow us to check it online that would be great!!!", "advice": "Honestly, keep doing what you're doing I love every second of my job and all my managers are so friendly and caring"}, {"title": "Awesome experience!", "text": "Pros Excellent team, family vibe, the food is amazing (you have to try every dish during the training), to be honest, I really enjoy working here. Cons Sometimes you will get really rude customers but your managers are always there to help you... Advice to Management Keep going!", "rating": 5, "pros": "Excellent team, family vibe, the food is amazing (you have to try every dish during the training), to be honest, I really enjoy working here.", "cons": "Sometimes you will get really rude customers but your managers are always there to help you...", "advice": "Keep going!"}, {"title": "first 8 weeks of working at wagamama", "text": "Pros I have really enjoyed my first few weeks. Getting started and trained to the wagamama way of doing things was very thorough and a good way of learning many new things quickly. Having great support from the trainers helped a lot too. Cons Sometimes information gets a bit lost since people work different shifts, which is understandable in this sort of job. Maybe there should be a clearer way of making sure everyone gets important information, and also encouraging everyone to take responsibility to share information they get from the managers. Also when shifts change on short notice. Advice to Management See what's written in cons. Also, we had great feedback during training, but I feel that feedback from managers are still important after that. It gives a sense of being valuable and appreciated and I think that's the best motivation to wanting to do a good job and keep improving.", "rating": 5, "pros": "I have really enjoyed my first few weeks. Getting started and trained to the wagamama way of doing things was very thorough and a good way of learning many new things quickly. Having great support from the trainers helped a lot too.", "cons": "Sometimes information gets a bit lost since people work different shifts, which is understandable in this sort of job. Maybe there should be a clearer way of making sure everyone gets important information, and also encouraging everyone to take responsibility to share information they get from the managers.", "advice": "See what's written in cons."}, {"title": "Employee review", "text": "Pros Great team support, positive interactive environment Cons Few opportunities beyond benefits Advice to Management Keep up the good work", "rating": 5, "pros": "Great team support, positive interactive environment", "cons": "Few opportunities beyond benefits", "advice": "Keep up the good work"}, {"title": "Front of House", "text": "Pros Management are amazing, pay and tips are great, fabulous discount Cons Gets busy, staying late to clean when customers come in late Advice to Management None", "rating": 5, "pros": "Management are amazing, pay and tips are great, fabulous discount", "cons": "Gets busy, staying late to clean when customers come in late", "advice": "None"}, {"title": "Working at wagamama - it's all about the people", "text": "Pros Strong leaders who genuinely care about their people Passionate teams dedicated to doing a great job Freedom to be bold and innovate Delicious food! Cons Sometimes departments working in silos Lack of overarching strategy", "rating": 5, "pros": "Strong leaders who genuinely care about their people", "cons": "Sometimes departments working in silos", "advice": null}, {"title": "Front of house", "text": "Pros Great food! Very good tips. The weekly pay! Shifts are designed great with some short shifts and some splits. Working with everyone is the most fun! Cons Not a lot to say on Cons. Think the only problem I have at my Wagamamas is the constant having to go up and down the stairs but otherwise not anything else. Advice to Management Carry on with the great work. Fun working with you all!", "rating": 5, "pros": "Great food! Very good tips.", "cons": "Not a lot to say on Cons.", "advice": "Carry on with the great work. Fun working with you all!"}, {"title": "Overall a great place to work", "text": "Pros Amazing coworkers, great brand, inclusive work culture Cons Personal development can be on the slow side", "rating": 5, "pros": "Amazing coworkers, great brand, inclusive work culture", "cons": "Personal development can be on the slow side", "advice": null}, {"title": "Waitress", "text": "Pros Tips Fun Food great colleagues individuality food on break Cons Poor Management Poor Staff treatment promise of moving up never happens long work hours always short staffed", "rating": 3, "pros": "Tips", "cons": "Poor Management", "advice": null}, {"title": "review of front of house staff role", "text": "Pros Pay and tips is fantastic, staff is mostly friendly as well as the customers. Extends knowledge of cuisine and experience in hospitality Cons extremely long hours with no certainty of when you finish, managers are manipulative in their rota hours and not very understanding with life out side of wagamamas. Hours are not flexible and make staff feel unvalued and 'replaceable'. Take risks when understaffed which effects employees. Advice to Management be more flexible, fair and understand your staff. Also before relieving support staff after opening a restaurant make sure you actually have enough staff to run the restaurant.", "rating": 3, "pros": "Pay and tips is fantastic, staff is mostly friendly as well as the customers. Extends knowledge of cuisine and experience in hospitality", "cons": "extremely long hours with no certainty of when you finish, managers are manipulative in their rota hours and not very understanding with life out side of wagamamas. Hours are not flexible and make staff feel unvalued and 'replaceable'. Take risks when understaffed which effects employees.", "advice": "be more flexible, fair and understand your staff. Also before relieving support staff after opening a restaurant make sure you actually have enough staff to run the restaurant."}, {"title": "Good company in the catering sector", "text": "Pros weekly pay, training, staff food, social life, some managers provide good training and support, Cons working on weekends, no salary increase for years unless you step up, easy to burn out on 48 hours/week high pressure customer facing management job. Advice to Management carrier progression if you work hard and if you are in good relationship with your managers. cycle to work scheme, work/life balance improvements please", "rating": 5, "pros": "weekly pay, training, staff food, social life, some managers provide good training and support,", "cons": "working on weekends, no salary increase for years unless you step up, easy to burn out on 48 hours/week high pressure customer facing management job.", "advice": "carrier progression if you work hard and if you are in good relationship with your managers. cycle to work scheme, work/life balance improvements please"}, {"title": "Wagamama work", "text": "Pros free food and lots of room for progression Cons Long Hours, too many managers!", "rating": 3, "pros": "free food and lots of room for progression", "cons": "Long Hours, too many managers!", "advice": null}, {"title": "Chef", "text": "Pros Great people to work with, amazing food and pleasant atmosphere. Cons The wage of a chef could be better. Advice to Management Keep caring your staff.", "rating": 5, "pros": "Great people to work with, amazing food and pleasant atmosphere.", "cons": "The wage of a chef could be better.", "advice": "Keep caring your staff."}, {"title": "Worst management/", "text": "Pros No pros except for good tips if it's busy. Cons The tips are legal rights of the servers so it's not that the company is doing any favour. They pay minimum wage and expect first class service from servers then on top you're like a slave in the company if it's busy then you run like mental then if it's not busy you work like a lowest class slave and if your managers are racist then bless you, only He can save you. Just stay away there's no progression in career but yes can only work for people who wants some quick money for the time being.", "rating": 1, "pros": "No pros except for good tips if it's busy.", "cons": "The tips are legal rights of the servers so it's not that the company is doing any favour. They pay minimum wage and expect first class service from servers then on top you're like a slave in the company if it's busy then you run like mental then if it's not busy you work like a lowest class slave and if your managers are racist then bless you, only He can save you. Just stay away there's no progression in career but yes can only work for people who wants some quick money for the time being.", "advice": null}, {"title": "more than meets the eye", "text": "Pros free food and excellent pay(after tronc) makes up for the 'you're just a number' attitude that they are trying so hard to deny Cons cares very little about the be you be wagamama motto they so proudly promote. be you be a robot is more accurate. Advice to Management treat your staff and managers like people rather than the robots you'd rather replace them with.", "rating": 3, "pros": "free food and excellent pay(after tronc) makes up for the 'you're just a number' attitude that they are trying so hard to deny", "cons": "cares very little about the be you be wagamama motto they so proudly promote. be you be a robot is more accurate.", "advice": "treat your staff and managers like people rather than the robots you'd rather replace them with."}, {"title": "company", "text": "Pros good company, free lunch, fair wage, good tip, managers are reasonable Cons some colleagues aren't good with team work", "rating": 5, "pros": "good company, free lunch, fair wage, good tip, managers are reasonable", "cons": "some colleagues aren't good with team work", "advice": null}, {"title": "Shrinking Standards, opportunities and allowances", "text": "Pros Staff food, tips and Colleagues Cons Wagamama tends to shrink its allowances/rewards to staff. Poor management. Huge amount of managers on shift. Split shifts are long and exhausting so are the shifts. Poor pay for the amount of work/ knowledge required from minimum pay workers. Advice to Management Managers should be trained in human resources as many lack people skills. Disrespectful approach towards team members isnt uncommon. Management tends to loose interest in their job thus make it hard to achieve team goals. I have personally experienced many unpleasant situations involving management. I have worked in many different branches and noticed these negative patterns appearing regardless to location. I love the values of Wagamama, the concept, the food. the problem is and always was the management.", "rating": 1, "pros": "Staff food, tips and Colleagues", "cons": "Wagamama tends to shrink its allowances/rewards to staff. Poor management. Huge amount of managers on shift. Split shifts are long and exhausting so are the shifts. Poor pay for the amount of work/ knowledge required from minimum pay workers.", "advice": "Managers should be trained in human resources as many lack people skills. Disrespectful approach towards team members isnt uncommon. Management tends to loose interest in their job thus make it hard to achieve team goals. I have personally experienced many unpleasant situations involving management. I have worked in many different branches and noticed these negative patterns appearing regardless to location. I love the values of Wagamama, the concept, the food. the problem is and always was the management."}, {"title": "Good luck", "text": "Pros Its good if you like eating the cheapest meals on the menu for free every day Cons They will have you starting at 7am, finishing at 1-2am, then back in at 7. You will only get two twenty minute breaks if you're in all day. The money is rubbish and so is the food once you see behind the curtain - a lot of flies in the place I worked. Sometimes the amount of food thrown away would require two people to lift the bags, sad when Cardiff has so many homeless. Awful company who invest way, way more into the expansion of the company than ensuring their staff have a comfortable lifestyle. Advice to Management Slow down on the expansion and focus more on using better ingredients (all of the meat and fish comes in frozen, yet is advertised as fresh, not sure how theyre getting away with that) and treating your staff like humans - not machines.", "rating": 1, "pros": "Its good if you like eating the cheapest meals on the menu for free every day", "cons": "They will have you starting at 7am, finishing at 1-2am, then back in at 7. You will only get two twenty minute breaks if you're in all day. The money is rubbish and so is the food once you see behind the curtain - a lot of flies in the place I worked. Sometimes the amount of food thrown away would require two people to lift the bags, sad when Cardiff has so many homeless. Awful company who invest way, way more into the expansion of the company than ensuring their staff have a comfortable lifestyle.", "advice": "Slow down on the expansion and focus more on using better ingredients (all of the meat and fish comes in frozen, yet is advertised as fresh, not sure how theyre getting away with that) and treating your staff like humans - not machines."}, {"title": "Great but invades your life", "text": "Pros Good company spirit and likes to reward staff with little simple things that go far enough to keep them happy Cons Always changing their minds/moving the goal posts to suit themselves. Company seems to forget about the managers higher you go Advice to Management Think ideas through before implementing", "rating": 3, "pros": "Good company spirit and likes to reward staff with little simple things that go far enough to keep them happy", "cons": "Always changing their minds/moving the goal posts to suit themselves. Company seems to forget about the managers higher you go", "advice": "Think ideas through before implementing"}, {"title": "Front of house team member", "text": "Pros - good pay including tips - great team - free food Cons Crazy hours Didn't get told our rota until 3 days before so couldn't plan for week ahead Advice to Management Management need to speak to everyone with the same level of respect", "rating": 3, "pros": "- good pay including tips", "cons": "Crazy hours", "advice": "Management need to speak to everyone with the same level of respect"}, {"title": "Happy Wagamama Employee", "text": "Pros Great friends made Excellent food free when working Good wage with tips Enjoyable working atmosphere Cons Not anything worth saying that you wouldn't find at any company Advice to Management Keep encouraging the staff and listen to what they have to say, happy workers make happy customers", "rating": 5, "pros": "Great friends made", "cons": "Not anything worth saying that you wouldn't find at any company", "advice": "Keep encouraging the staff and listen to what they have to say, happy workers make happy customers"}, {"title": "great carear oppertunities", "text": "Pros friendly family atmosphere, good development opportunities, good bonus scheme, meal on shift, very supportive head office team Cons you need to work some weekends, but this is the same anywhere you go", "rating": 5, "pros": "friendly family atmosphere, good development opportunities, good bonus scheme, meal on shift, very supportive head office team", "cons": "you need to work some weekends, but this is the same anywhere you go", "advice": null}, {"title": "Hard work but Learn Fast and it pays off!", "text": "Pros Great team to work with, new opportunities to learn, staff food, salary and tips. Cons Expectation for all starting Line chefs to learn the entire kitchen and menu within about 2 weeks or less, One or two over zealous chefs that instead of helping out will complain about your every move. Split shifts. Advice to Management Better training for beginners to kitchen including training sessions, hire more staff, improve kitchen areas with more space.", "rating": 5, "pros": "Great team to work with, new opportunities to learn, staff food, salary and tips.", "cons": "Expectation for all starting Line chefs to learn the entire kitchen and menu within about 2 weeks or less, One or two over zealous chefs that instead of helping out will complain about your every move. Split shifts.", "advice": "Better training for beginners to kitchen including training sessions, hire more staff, improve kitchen areas with more space."}, {"title": "They expect you to work overtime for free", "text": "Pros free staff meals, decent tips. Cons never getting paid for overtime although it was clearly not optional and general disrespect towards FOH staff from management. Advice to Management Expecting 110% from staff whilst offering the bare minimum in return is not acceptable.", "rating": 1, "pros": "free staff meals, decent tips.", "cons": "never getting paid for overtime although it was clearly not optional and general disrespect towards FOH staff from management.", "advice": "Expecting 110% from staff whilst offering the bare minimum in return is not acceptable."}, {"title": "bad", "text": "Pros free staff meals and weekly pay Cons no payslips! at all... no clock in/out machines, they still using time sheets! so never get pay for extra time and pay is never proper and accurate. they giving morning shift next day after late shift! if finish midnight, they want you to come next day 7-8am... and 20 minutes break only", "rating": 3, "pros": "free staff meals and weekly pay", "cons": "no payslips! at all... no clock in/out machines, they still using time sheets! so never get pay for extra time and pay is never proper and accurate. they giving morning shift next day after late shift! if finish midnight, they want you to come next day 7-8am... and 20 minutes break only", "advice": null}, {"title": "High pressured", "text": "Pros Great tight knit team Staff training Fresh produce Free meals Fairly flexible Staff parties FOH staff well trained Staff rewards Cons Long hours Always busy 20 things to do at once High pressure Dirty work Long closedowns Huge deliveries when busy Advice to Management More kps Longer breaks", "rating": 3, "pros": "Great tight knit team", "cons": "Long hours", "advice": "More kps"}, {"title": "Front of House Waitress", "text": "Pros Some great people to work with Cons Management was incredibly tough. Poor training", "rating": 1, "pros": "Some great people to work with", "cons": "Management was incredibly tough. Poor training", "advice": null}, {"title": "not bad company for a start", "text": "Pros good, big company, good salary from the beginning Cons lot of side duties, sometimes poorly trained very young managers Advice to Management choose wisely your management", "rating": 5, "pros": "good, big company, good salary from the beginning", "cons": "lot of side duties, sometimes poorly trained very young managers", "advice": "choose wisely your management"}, {"title": "After the 8 month mark, you start to see probelms", "text": "Pros free food on shift free uniform flexible shift Cons Management Unrealistic targets Pressure from Head Office", "rating": 3, "pros": "free food on shift", "cons": "Management", "advice": null}, {"title": "never ever again", "text": "Pros really good tips nice people to work with everyone has so much energy Cons RUDE CUSTOMERS. the know if they gonna say that the foo wasn't good they gonna get something for free... even if they finish everything rude managers. always focusing on bad thing. when the sales were not good the worker with the lowest number of \"spare per head\" could eat ONLY CHICKEN RAMEN!! they cutting your hours when its not busy and you never finish at the time it says on the rota", "rating": 3, "pros": "really good tips", "cons": "RUDE CUSTOMERS. the know if they gonna say that the foo wasn't good they gonna get something for free... even if they finish everything", "advice": null}, {"title": "Head Office Employee", "text": "Pros Incredible company to work for. I've worked in wagamama head office for two years now and have already experienced progression within multiple roles and departments. Great benefits, very well looked after by the company and overall a generally very happy place to work. Cons Truthfully nothing bad about the business at all.", "rating": 5, "pros": "Incredible company to work for. I've worked in wagamama head office for two years now and have already experienced progression within multiple roles and departments. Great benefits, very well looked after by the company and overall a generally very happy place to work.", "cons": "Truthfully nothing bad about the business at all.", "advice": null}, {"title": "Dodgy Manager", "text": "Pros The training is good and most of the managers are cool to work with. Money is better than some other similar employment roles. Cons - The personalities of the managers vary from extremely friendly, to some who cross the line of harassment on a regular basis. Advice to Management I don", "rating": 1, "pros": "The training is good and most of the managers are cool to work with. Money is better than some other similar employment roles.", "cons": "- The personalities of the managers vary from extremely friendly, to some who cross the line of harassment on a regular basis.", "advice": "I don"}, {"title": "Head chef", "text": "Pros The best company for carers prograss and development Cons balance of work and life", "rating": 5, "pros": "The best company for carers prograss and development", "cons": "balance of work and life", "advice": null}, {"title": "marketing", "text": "Pros great benefits, growing business Cons restructuring and redundancies are a monthly habit and 'bottom line' is more important than people. its a financially led business owned by a bank with very little HQ culture and care for it's HQ staff Advice to Management invest in supporting employee's in your HQ as it's treatment of 'people' is shameful for the industry. your business is only as good as it's people", "rating": 1, "pros": "great benefits, growing business", "cons": "restructuring and redundancies are a monthly habit and 'bottom line' is more important than people. its a financially led business owned by a bank with very little HQ culture and care for it's HQ staff", "advice": "invest in supporting employee's in your HQ as it's treatment of 'people' is shameful for the industry. your business is only as good as it's people"}, {"title": "Stressful environment with disorganised management", "text": "Pros - Youthful and diverse working team - Opportunities to develop and work in multiple locations - Complimentary meals and cooking resources Cons - Stressful working environment - Understaffed - Disorganised management and high staff turnover - Difficult to get time off work or scheduled working hours Advice to Management Management needs to be more involved with staff to understand their concerns and issues within the team and working environment. Hierarchy is also a massive issue and needs resolving.", "rating": 3, "pros": "- Youthful and diverse working team", "cons": "- Stressful working environment", "advice": "Management needs to be more involved with staff to understand their concerns and issues within the team and working environment. Hierarchy is also a massive issue and needs resolving."}, {"title": "restaurant manager", "text": "Pros fantastic career development, fun and friendly working environment, clean workplace, encouraged to be your own person Cons nothing that I think is worth writing about!", "rating": 5, "pros": "fantastic career development, fun and friendly working environment, clean workplace, encouraged to be your own person", "cons": "nothing that I think is worth writing about!", "advice": null}, {"title": "what an amazing brand to be a part of", "text": "Pros you really can be yourself. you are surrounded by brilliant and talented people. you are well looked after. there are so many opportunities for development. the food is awesome! Cons I eat too much food and consequently have to do a lot of running! there's always something new to do and you're kept really busy...but I see this as a good thing Advice to Management keep doing what you are doing", "rating": 5, "pros": "you really can be yourself. you are surrounded by brilliant and talented people. you are well looked after. there are so many opportunities for development. the food is awesome!", "cons": "I eat too much food and consequently have to do a lot of running! there's always something new to do and you're kept really busy...but I see this as a good thing", "advice": "keep doing what you are doing"}, {"title": "Great company!", "text": "Pros Very friendly head office team, everyone very welcoming. Cons None so far! Hopefully none ever!", "rating": 5, "pros": "Very friendly head office team, everyone very welcoming.", "cons": "None so far! Hopefully none ever!", "advice": null}, {"title": "Good compared to other similar places but can make your life hard", "text": "Pros - Good money after tips - Benefits included free food (which was decent) and cheap gym (it depends on the branch, though) - Some managers care about you (if you're ill or need a day off to do something important, etc.) and they're compassionate - Mostly nice team, so if you're working in a shift with them it'll be enjoyable - Wagamama has a good culture (in theory) where you're meant to smile and engage in conversations with the customers (most of them like that) Cons - Some managers think they're gods and they can be condescending all the time just because they're at a \"better\" position. That conflicts with Wagamama's culture, since no one can be truly happy and smile to customers when they have a condescending manager on their tail all the time for no reason. That situation sometimes becomes harassment, with some managers fighting you, complaining about every single thing you do and sometimes yelling in front of customers. - Some managers are unreasonable when it comes to giving employees' rights (breaks, holidays, sick day, etc) - Some managers and employees forget that you're still doing training and they're passive agressive whenever you make simple questions like \"where do you store the takeaway lids\" (as if you should start your job there knowing those kind of things) - Nonsense cleaning sometimes necessary - Lots of gossip amongst the employees Advice to Management Managers, please think about the employees for a second and try to make their experience at wagamama more enjoyable. Employees are people with other needs and they're not living exclusively for this job. Simple things like less passive-aggressiveness, kindness or just listening to the employees' needs would make their lives way easier and wouldn't make them leave the workplace after a short time (and I saw that happen a lot in a 4-month period). Most people don't need crazy competitions for a £50 bonus voucher, they need to feel accepted and happy at the workplace, not harassed.", "rating": 3, "pros": "- Good money after tips", "cons": "- Some managers think they're gods and they can be condescending all the time just because they're at a \"better\" position. That conflicts with Wagamama's culture, since no one can be truly happy and smile to customers when they have a condescending manager on their tail all the time for no reason. That situation sometimes becomes harassment, with some managers fighting you, complaining about every single thing you do and sometimes yelling in front of customers.", "advice": "Managers, please think about the employees for a second and try to make their experience at wagamama more enjoyable. Employees are people with other needs and they're not living exclusively for this job. Simple things like less passive-aggressiveness, kindness or just listening to the employees' needs would make their lives way easier and wouldn't make them leave the workplace after a short time (and I saw that happen a lot in a 4-month period). Most people don't need crazy competitions for a £50 bonus voucher, they need to feel accepted and happy at the workplace, not harassed."}, {"title": "full-on fantastic", "text": "Pros There isn't loads of hierarchy so the opportunity to learn and grow is massive with lots of exposure which is good. The team are simply... lovely people. I know this sounds cheesy but really, spending so much time at work means it is very important to work with great people. Being a small, entrepreneurial-minded business, there is lots of scope for big out the box thinking and creativity which is super inspiring. Cons The pace is relentless and so fast that often I feel like I am doing a heck of a lot but not knocking everything out the ballpark. Advice to Management Try to remove yourself from the detail of projects. You have a great team so trust us.", "rating": 5, "pros": "There isn't loads of hierarchy so the opportunity to learn and grow is massive with lots of exposure which is good.", "cons": "The pace is relentless and so fast that often I feel like I am doing a heck of a lot but not knocking everything out the ballpark.", "advice": "Try to remove yourself from the detail of projects. You have a great team so trust us."}, {"title": "Foh", "text": "Pros You can meet great people,yiu working as a team... half price food on staff sales,if ur menager agree flexible working hours. Cons Hard to get a holiday at Christmas time even if it's only beginning of December. Menagers getting more tip than you even if half of the time they are just standing not doing anything. In our branch after a long time of working for this company if you will said ur honest opinion about something/management team you being \"punished\"-they cutting your hours even if other people with same hours contract having two or three times more than you. Advice to Management I don't know how you choosing people to be in your management team but some of them are \"joke\". They have wrong attitude,don't know how to talk to people,also they are thinking that being a manager making them a \"god\" of everything/everyone. Strat treating people better. We are humans being not a robots.", "rating": 3, "pros": "You can meet great people,yiu working as a team... half price food on staff sales,if ur menager agree flexible working hours.", "cons": "Hard to get a holiday at Christmas time even if it's only beginning of December. Menagers getting more tip than you even if half of the time they are just standing not doing anything.", "advice": "I don't know how you choosing people to be in your management team but some of them are \"joke\". They have wrong attitude,don't know how to talk to people,also they are thinking that being a manager making them a \"god\" of everything/everyone. Strat treating people better. We are humans being not a robots."}, {"title": "Awesome People!", "text": "Pros The people in wagamama are amazing...genuinely lovely, passionate, driven & only want what is best for the company. That is both in head office and in the restaurant. The career prospects and progression opportunities are fantastic and no matter what role you do within the company there are so many different career paths to consider. Wagamama love developing all of their staff. Cons The free food...only because of my waistline!!!!!!!", "rating": 5, "pros": "The people in wagamama are amazing...genuinely lovely, passionate, driven & only want what is best for the company. That is both in head office and in the restaurant.", "cons": "The free food...only because of my waistline!!!!!!!", "advice": null}, {"title": "Great company to work for", "text": "Pros Great people, great food and we strive to be the best. Dynamic company so always learning and wagamama promote a culture where you can enjoy work Cons No company is perfect, but I think we are close, so nothing worth mentioning", "rating": 5, "pros": "Great people, great food and we strive to be the best. Dynamic company so always learning and wagamama promote a culture where you can enjoy work", "cons": "No company is perfect, but I think we are close, so nothing worth mentioning", "advice": null}, {"title": "wagamama", "text": "Pros Great atmosphere, wonderful people, good package and work life balance Cons i want to constantly eat wagamamas", "rating": 5, "pros": "Great atmosphere, wonderful people, good package and work life balance", "cons": "i want to constantly eat wagamamas", "advice": null}, {"title": "a fantastic place to work and be a part of", "text": "Pros work hard, play hard. you can make a difference at wagamama and have a real impact on people Cons none spring to mind which is always a good thing I think! Advice to Management keep doing what you're doing :-)", "rating": 5, "pros": "work hard, play hard. you can make a difference at wagamama and have a real impact on people", "cons": "none spring to mind which is always a good thing I think!", "advice": "keep doing what you're doing :-)"}, {"title": "noodle hq - just be you", "text": "Pros great hq location - heart of soho and leicester square really great bunch of people to work with great free food allowance daily fresh fruit delivery Cons none really, enjoyed every minute", "rating": 5, "pros": "great hq location - heart of soho and leicester square", "cons": "none really, enjoyed every minute", "advice": null}, {"title": "from a general manager", "text": "Pros the opportunity to own your restaurant. they are very caring and offer fantastic help to achieve results. great working conditions and opportunities for career progression Cons difficult to think of any cons - as with any large branded company there are guidelines that everyone has to conform to, this could be conceived as a con but it is also a great plus as it gives a definite process to follow Advice to Management keep the culture alive as we grow and not to lose the feeling of family. as the company expands it is so important to make sure that we all live our behaviours", "rating": 5, "pros": "the opportunity to own your restaurant. they are very caring and offer fantastic help to achieve results. great working conditions and opportunities for career progression", "cons": "difficult to think of any cons - as with any large branded company there are guidelines that everyone has to conform to, this could be conceived as a con but it is also a great plus as it gives a definite process to follow", "advice": "keep the culture alive as we grow and not to lose the feeling of family. as the company expands it is so important to make sure that we all live our behaviours"}, {"title": "great company to work for!", "text": "Pros I learnt so much at wagamama and the people are very welcoming and friendly The food is always amazing :-) Cons If you don't like change don't work for wagamama! The kaizen philosophy helps the business to be the best in the industry", "rating": 5, "pros": "I learnt so much at wagamama and the people are very welcoming and friendly", "cons": "If you don't like change don't work for wagamama! The kaizen philosophy helps the business to be the best in the industry", "advice": null}, {"title": "a fun, focused and fresh place to work!", "text": "Pros before joining the team, I had always admired wagamama. not just the incredible food, excellent service and their fresh approach to healthy and fun dining but also the wagamama brand and culture, which seemed to shine through when visiting the restaurants. when starting, I wasn't disappointed! I felt incredibly welcome from the moment I stepped into the office. the first day nerves vanished within minutes and after 2 months in, I felt as if it had been 2 yrs (in a good way!). I feel valued and excited about my future here. Cons there are no cons....ok maybe the free food - I can't stop eating it! (I told you it wasn't a real con!)", "rating": 5, "pros": "before joining the team, I had always admired wagamama. not just the incredible food, excellent service and their fresh approach to healthy and fun dining but also the wagamama brand and culture, which seemed to shine through when visiting the restaurants.", "cons": "there are no cons....ok maybe the free food - I can't stop eating it! (I told you it wasn't a real con!)", "advice": null}, {"title": "Great Place to Work!", "text": "Pros Fantastic people & working environment! It feels awesome to be surrounded by colleagues that are enthusiastic, supportive and hard working. I feel part of big team that's working toward something meaningful. Cons Not much of a structured induction, but now that I've gotten to know almost everyone, it feels like home. A standard introduction to the company and the team would be beneficial for new starters, so that everyone knows who the new person is and what they do. Advice to Management Everyone with a head office position should work 1 shift in a restaurant every year. Regardless of job function [marketing, finance, compliance, etc.], the individual will benefit from that experience, and the restaurant will feel a stronger connection to the head office.", "rating": 5, "pros": "Fantastic people & working environment! It feels awesome to be surrounded by colleagues that are enthusiastic, supportive and hard working. I feel part of big team that's working toward something meaningful.", "cons": "Not much of a structured induction, but now that I've gotten to know almost everyone, it feels like home. A standard introduction to the company and the team would be beneficial for new starters, so that everyone knows who the new person is and what they do.", "advice": "Everyone with a head office position should work 1 shift in a restaurant every year. Regardless of job function [marketing, finance, compliance, etc.], the individual will benefit from that experience, and the restaurant will feel a stronger connection to the head office."}, {"title": "great start!", "text": "Pros great training package, very detailed and covers everything you need to know for the role. friendly management and staff. brilliant atmosphere to work in. the culture is. communication and organisation of training has been spot on Cons no cons to mention", "rating": 5, "pros": "great training package, very detailed and covers everything you need to know for the role. friendly management and staff. brilliant atmosphere to work in. the culture is. communication and organisation of training has been spot on", "cons": "no cons to mention", "advice": null}, {"title": "best place to work in the whole world ever!", "text": "Pros Brilliant people to work with! Amazing fresh food (and free meals on every shift!). The team I work with is amazing, everyone looks after and encourages each other. There are also really good development opportunities for everyone if you want to progress. Its such a fun place to work and there are really good benefits. Probably the best job I have ever had! Cons No cons! its literally the best job ever and I can't imagine working anywhere else", "rating": 5, "pros": "Brilliant people to work with! Amazing fresh food (and free meals on every shift!). The team I work with is amazing, everyone looks after and encourages each other. There are also really good development opportunities for everyone if you want to progress.", "cons": "No cons! its literally the best job ever and I can't imagine working anywhere else", "advice": null}, {"title": "Great place to work", "text": "Pros No long time in the company but at the moment just good things to say, really supportive team, highest quality standards in everything. Cons No cons, great place to work", "rating": 5, "pros": "No long time in the company but at the moment just good things to say, really supportive team, highest quality standards in everything.", "cons": "No cons, great place to work", "advice": null}, {"title": "worst management ever", "text": "Pros staff food, not bad salary, progress Cons bad management, bad hours of shifts", "rating": 1, "pros": "staff food, not bad salary, progress", "cons": "bad management, bad hours of shifts", "advice": null}, {"title": "Such an amazing, colourful and vibrant place to work!", "text": "Pros A busy environment but the company encourages each individual to be themselves. Cons Shift patterns can mean that a whole day is lost- a morning shift and then back for an evening shift. These can be long and tiring. Advice to Management If split shifts could be axed. But it's great place to be so big up the management.", "rating": 5, "pros": "A busy environment but the company encourages each individual to be themselves.", "cons": "Shift patterns can mean that a whole day is lost- a morning shift and then back for an evening shift. These can be long and tiring.", "advice": "If split shifts could be axed. But it's great place to be so big up the management."}, {"title": "Front of house", "text": "Pros Good salary - low base salary, but tips make it worth it Great food - free food during breaks Nice team - great staff Incentives - some competitions for the staff making the shifts fun and competitive Cons Long breaks between shifts, sometimes 3h breaks, which can prolong the entire shift since its in the middle of it. Advice to Management Better employee management,", "rating": 5, "pros": "Good salary - low base salary, but tips make it worth it", "cons": "Long breaks between shifts, sometimes 3h breaks, which can prolong the entire shift since its in the middle of it.", "advice": "Better employee management,"}, {"title": "Front of House", "text": "Pros Good company benefits, meal for shifts and training Cons Weak management, strange teaching methods, not very flexible with time off", "rating": 3, "pros": "Good company benefits, meal for shifts and training", "cons": "Weak management, strange teaching methods, not very flexible with time off", "advice": null}, {"title": "Job", "text": "Pros Nice place to work. Friendly workforce although they can say all sort of nasty things. Nice chaps and managers that listen to you and are flexible in times of rota Cons Dunno any con. It's a nice place", "rating": 5, "pros": "Nice place to work. Friendly workforce although they can say all sort of nasty things. Nice chaps and managers that listen to you and are flexible in times of rota", "cons": "Dunno any con. It's a nice place", "advice": null}, {"title": "Fantastic", "text": "Pros great people, good company, well-run, good tips Cons split shifts are a joke. should not have to take three unpaid hours in the middle of the day when you have to hang around if you don't live near", "rating": 5, "pros": "great people, good company, well-run, good tips", "cons": "split shifts are a joke. should not have to take three unpaid hours in the middle of the day when you have to hang around if you don't live near", "advice": null}, {"title": "Front of house manager", "text": "Pros Great staff. Its a really nice environment to work in, you work really hard when you're there but it's always fun at the same time! Cons The days can be long and tiring on your body. You def get fit from working there. It's really fast paced so you have to be on the ball all the time. Advice to Management Keep up the good work", "rating": 5, "pros": "Great staff. Its a really nice environment to work in, you work really hard when you're there but it's always fun at the same time!", "cons": "The days can be long and tiring on your body. You def get fit from working there. It's really fast paced so you have to be on the ball all the time.", "advice": "Keep up the good work"}, {"title": "Staff are cattle.", "text": "Pros -The team I worked with were lovely people, but depends entirely on chance. - Free food on shift -50% off take away after your shift(but managers often don't let you because there's not enough containers, found this in all the branches I worked) -Get to move around to different branches if you work in London, which is fun Cons -Only £7.20 an hour for what is a very stressful job, with lots and lots of work outside of your hours. -Lunch rushes and dinner rushes last about two hours and are so busy there's often ques stretching way outside the front door. Sections are very large and you're expected to stay completely on top of everything whilst still making small talk with customers about their day-very very stressful for rubbish pay. -Very shiny, friendly surface- there is this idea that wagamama is such a lovely individual place to work but really they treat you like numbers like any other big company, it's just a business strategy. -Team leaders on huge huge power trips -Managers often so stressed they take it out on their staff -When you want to drink water on shift you have to crouch behind the bar so customers don't see you, as if customers will be put off their food by seeing staff drinking? -Shift patterns crazy- split shifts often require you to take a three hour break, and if the restaurant isn't close to your house this means you have to hang around the area or the restaurant -On long shifts you'll be standing up for up to 12 hours and only get a 20 minute lunch break, in which you have to go to the staff room and change back in to your own clothes because again the customers cant see staff eating? So odd, still don't see the point. -The menu! There are literally hundreds of items and dishes you have to learn the corresponding numbers to, which are not in order, and you have to learn what ingredients are in all of these dishes, and how they are made! If you don't have all of this learnt in your first two-three weeks managers and team leaders get very very annoyed. -There is sometimes not enough hours to go around because management want to cut down on the cost of staff so much, I was forced to take a paid holiday day when they canceled on of my shifts, and it happened to everyone until they managed to get rid of some staff permanently. Advice to Management Don't give your staff 20 mins for lunch and get changed twice! Hire more people so everyone feels supported, 3-5 people doing 100+ covers is horrible. Pay your workers more, if you are peddling the 'we care for our staff so much' vibe then at lest pay them the living wage, which in London is £2.55 more an hour than you pay.", "rating": 3, "pros": "-The team I worked with were lovely people, but depends entirely on chance.", "cons": "-Only £7.20 an hour for what is a very stressful job, with lots and lots of work outside of your hours.", "advice": "Don't give your staff 20 mins for lunch and get changed twice!"}, {"title": "Good place to work as a part-time when you are in college", "text": "Pros Good food Organised Friendly co-workers Good tips Cons Bad management Food price not so cheap for workers", "rating": 3, "pros": "Good food", "cons": "Bad management", "advice": null}, {"title": "Good job for students / different path", "text": "Pros nice environment, nice tips 100% for staff, good temporary job, paid weekly Cons Hospitality cons: long and late hours, weekends and bank holidays at work, the rota is changing all the time", "rating": 5, "pros": "nice environment, nice tips 100% for staff, good temporary job, paid weekly", "cons": "Hospitality cons: long and late hours, weekends and bank holidays at work, the rota is changing all the time", "advice": null}, {"title": "ok in the short term", "text": "Pros - free food if you've worked 6 hours or more (limited choice though) - 50% discount in Wagamamas - tips can be good (1/3 of salary) Cons - weird rotas + you're expected to be extremely flexible all the time - no set number of hours (not very reliable pay-wise) - hardly any proper training, and if so very rushed (depends on your managers); you get a training book which promises good training but in reality it's far from that - company is quite disorganized (mistakes, lack of comunication) - you have to learn all the numbers of drink/dishes by heart (there are TONS), which is very frustrating, time consuming and I still can't see the point of being forced to know them", "rating": 3, "pros": "- free food if you've worked 6 hours or more (limited choice though)", "cons": "- weird rotas + you're expected to be extremely flexible all the time", "advice": null}, {"title": "Happy student part-timer", "text": "Pros I get to work with an amazing bunch of people and super friendly managers. Money is great, especially if you're in a busy branch where the tips are almost half of your salary. Amazing option for students looking for some extra income. Cons After a while work becomes super monotonic, unless you get a promotion.", "rating": 5, "pros": "I get to work with an amazing bunch of people and super friendly managers. Money is great, especially if you're in a busy branch where the tips are almost half of your salary. Amazing option for students looking for some extra income.", "cons": "After a while work becomes super monotonic, unless you get a promotion.", "advice": null}, {"title": "Good for Part-time", "text": "Pros - can always get shifts if need extra money - good team environment in the kitchen - Free food at lunch and break times (helps when you're a student). - Good BOH managers. Cons - General manager was awful, constantly shouting and putting people down for no reason, power-crazed. Clearly under the influence a lot of the time. - Long hours, although thats expected with any kitchen job. Advice to Management - Only because your a General manager doesn't give you the right to be unreasonable and abuse employees.", "rating": 5, "pros": "- can always get shifts if need extra money", "cons": "- General manager was awful, constantly shouting and putting people down for no reason, power-crazed. Clearly under the influence a lot of the time.", "advice": "- Only because your a General manager doesn't give you the right to be unreasonable and abuse employees."}, {"title": "Waitress for 3 years", "text": "Pros good tips, hard working team, can be a fun job Cons horrible and disgusting General manager, used his power to intimidate and scare employees, if you had an issue or element of the job you didn't enjoy he would just tell you to leave and quit. He had favourites and spoke about employees he didn't like and was very vocal expressing that he wanted to get rid of certain employees and get a new team. Consequently shortly after he joined the team alot of people left. Worst general manager ever. Disappointed with how HR have dealt with the many grievances the team made against the manager, am honestly shocked he is still GM in that Wagamama Advice to Management Get a new job", "rating": 3, "pros": "good tips, hard working team, can be a fun job", "cons": "horrible and disgusting General manager, used his power to intimidate and scare employees, if you had an issue or element of the job you didn't enjoy he would just tell you to leave and quit. He had favourites and spoke about employees he didn't like and was very vocal expressing that he wanted to get rid of certain employees and get a new team. Consequently shortly after he joined the team alot of people left. Worst general manager ever. Disappointed with how HR have dealt with the many grievances the team made against the manager, am honestly shocked he is still GM in that Wagamama", "advice": "Get a new job"}, {"title": "Wagamamas!", "text": "Pros Lovely environment, free food after shift, everyone is very helpful, good pay, good hours, all around an enjoyable experience. Cons I wouldn't want to do it forever but it's good if you're looking for something temporary. Advice to Management I didn't get much help from management, rather they just let me get stuck in but the staff helped me on my first day.", "rating": 5, "pros": "Lovely environment, free food after shift, everyone is very helpful, good pay, good hours, all around an enjoyable experience.", "cons": "I wouldn't want to do it forever but it's good if you're looking for something temporary.", "advice": "I didn't get much help from management, rather they just let me get stuck in but the staff helped me on my first day."}, {"title": "ok for a while", "text": "Pros excellent free food, free uniforms, young team, long breaks during quiet time, Cons you will have to clean up everything after your shift, the team leaders were rude, cruel, gossipy and power crazed, long shifts, lack of staff, bad management team, split tips Advice to Management motivate your staff", "rating": 5, "pros": "excellent free food, free uniforms, young team, long breaks during quiet time,", "cons": "you will have to clean up everything after your shift, the team leaders were rude, cruel, gossipy and power crazed, long shifts, lack of staff, bad management team, split tips", "advice": "motivate your staff"}, {"title": "Great company but long hour and Bad rota", "text": "Pros Great company to work, friendly staffs, free food. Cons long hours, bad rota, low pay", "rating": 3, "pros": "Great company to work, friendly staffs, free food.", "cons": "long hours, bad rota, low pay", "advice": null}, {"title": "Very Detailed Review | Hard Work - Slightly Pays Off.", "text": "Pros Free Lunch (e.g. They emphasize on trying everything on the menu but you don't have to.) Friendly Environment (e.g. FOH team come into your pot-wash area regularly and have small talk with you - also getting to know you and gossip lol) Breaks during quiet times. (e.g. If you can't work for long period 7am-3pm, take your break at ~11am/12pm or if you leave it later then you won't be able to unless you have another kp to cover you). Preparing/Serving Desserts (e.g. This is the \"fun\" part of the job, you get a break from the hot pot-wash area and prepare desserts for customers, learning them off by heart can be hard but there is a manual to help. Unfortunately in my experience - not a lot of people decide to buy desserts :( ) High pay-rate (e.g. Starting at £7.20/hr + tips) Get to go to the cool/calm stock area (e.g Another break from the hot pot-wash area, keep stocked up on ice-cream and desserts/sauces) Weekends are really relaxed especially Sunday (e.g. all your deadlines for jobs are shifted by 30mins/1hr so you have more time to do things and take it a lot more slowly). You can choose your days off. Only do this job - If you are looking to progress up to a line-chef/looking for a long-term career (working your way up from the bottom) as soon as you get the hang of the kp role, this job is not easy and you must be ready and willing every day to get all the tasks done asap. You must not be scared of cleaning and getting your hands dirty. You must be willing to wake up early to get to work. Would NOT recommend this as your first job (don't make the mistake I did and do this as you will not enjoy it some days - they made the job sound much nicer on the application page and recruitment day) , it is HARD and it is NOT easy. You have to work quickly and efficiently and be able to multitask! You have to be a quick learner that just needs money for some things. I wouldn't recommend this as a long-term job, try to move up or out of this job because it's not a fun one - I just do my job, go home and get paid every Friday (I guess pay-day is something to look forward to). A full time role as a kp is tough. Cons Early Starts (7am starting times is pretty annoying - I have to wake up at 5am just to get there relatively on-time.) Lots of lifting heavy things (e.g. Oil cartons/Trays/Rice containers etc.) Lots of cleaning (e.g. 80% of the job is Cleaning. Plates all the time during busy times and cleaning used prep trays during the morning). Very difficult to keep up on tasks when you are on your own (e.g. Getting chicken cooked and prep'd , and then cooking rice before 9:30 so it's ready for the chefs) Can get really hot in the pot-wash area (e.g The dishwasher/glass-washer is on all the time and you need to use hot water to wash the stuff, so drink water readily.) You have to change the oil for the deep-fryer which is the worst task of the day (e.g. You need to empty the oil into empty oil cartons and clean out all the crumbs/foodstuffs that have made it to the bottom of the fryer yuck.) Stressful when its a busy day (e.g. Lots of plates and requests from chefs!) Cleaning curry pots (e.g. You get them around mid-day and they are a nightmare to clean so leave them to soak and come back later) Taking the bins from outside into the bin room (e.g. You get people looking at you funny when you do this and the bin room is like a sauna, you have to be quick with this job as it takes up your time for the other jobs.) Majority of employees don't speak fluent english, so there is a language barrier (e.g. Majority of requests they will point at what they want etc.) Only do this job - If you are looking to progress up to a line-chef/looking for a long-term career (working your way up from the bottom) as soon as you get the hang of the kp role, this job is not easy and you must be ready and willing every day to get all the tasks done asap. You must not be scared of cleaning and getting your hands dirty. You must be willing to wake up early to get to work. Would NOT recommend this as your first job (don't make the mistake I did and do this as you will not enjoy it some days - they made the job sound much nicer on the application page and recruitment day) , it is HARD and it is NOT easy. You have to work quickly and efficiently and be able to multitask! You have to be a quick learner that just needs money for some things. I wouldn't recommend this as a long-term job, try to move up or out of this job because it's not a fun one - I just do my job, go home and get paid every Friday (I guess pay-day is something to look forward to). A full time role as a kp is tough. Advice to Management When employing people for this role, employ in pairs because this job is hard enough as it is for one and if you want a fast, optimal service - you need at least 2 people for the job. Provide help when you are free instead of going into the office to take breaks and check emails - every little helps.", "rating": 3, "pros": "Free Lunch (e.g. They emphasize on trying everything on the menu but you don't have to.)", "cons": "Early Starts (7am starting times is pretty annoying - I have to wake up at 5am just to get there relatively on-time.)", "advice": "When employing people for this role, employ in pairs because this job is hard enough as it is for one and if you want a fast, optimal service - you need at least 2 people for the job."}, {"title": "Awful place stay away!", "text": "Pros Free lunches on breaks, free uniform and drinks on shift Cons Very poor magment that do not communicate with one another. Long hours and lack of training. Not worth the money as it is too stressful. Lack of opportunity to progress. Illegial hours Advice to Management Be kind to your employees who work these long hours as it is very physically and mentally demanding. Do not treat your workers like slaves and treat them as human beings.", "rating": 1, "pros": "Free lunches on breaks, free uniform and drinks on shift", "cons": "Very poor magment that do not communicate with one another. Long hours and lack of training. Not worth the money as it is too stressful. Lack of opportunity to progress. Illegial hours", "advice": "Be kind to your employees who work these long hours as it is very physically and mentally demanding. Do not treat your workers like slaves and treat them as human beings."}, {"title": "Great company to work for", "text": "Pros Training, staff, management aprroach, brand itself Cons As in any other restaurant Labor is the main issue Advice to Management Carry on!)", "rating": 5, "pros": "Training, staff, management aprroach, brand itself", "cons": "As in any other restaurant Labor is the main issue", "advice": "Carry on!)"}, {"title": "My experience", "text": "Pros The front of house team members were great and very friendly and helpful Cons Long hours that were far too demanding for everyone, when clearly the issue was lack of staff. The team leaders were rude, cruel, gossipy and power crazy. The manager was rarely in and was frequently stroppy when the workload stopped staff going the extra mile due to the sheer amount of customers and the lack of staff. Advice to Management Just because someone is a good team member doesn't mean they're a good team leader.", "rating": 3, "pros": "The front of house team members were great and very friendly and helpful", "cons": "Long hours that were far too demanding for everyone, when clearly the issue was lack of staff. The team leaders were rude, cruel, gossipy and power crazy. The manager was rarely in and was frequently stroppy when the workload stopped staff going the extra mile due to the sheer amount of customers and the lack of staff.", "advice": "Just because someone is a good team member doesn't mean they're a good team leader."}, {"title": "Meh", "text": "Pros good pay and good food. Cons long hours, not many working on shift and bad managament team Advice to Management Have more people on FOH", "rating": 3, "pros": "good pay and good food.", "cons": "long hours, not many working on shift and bad managament team", "advice": "Have more people on FOH"}, {"title": "chef", "text": "Pros good company to work for. good pay . good hours. very flexibile employment conditions. Cons staff facilities. head office. ceo.director. Advice to Management better working conditions", "rating": 3, "pros": "good company to work for. good pay . good hours. very flexibile employment conditions.", "cons": "staff facilities. head office. ceo.director.", "advice": "better working conditions"}, {"title": "Foh member", "text": "Pros Training is specific and delivered by very competent people, remembering all the menù dishes-number is challenging, but it could turn out funny. Tips are huge, because they're understaffed most of the time. Cons Badly understaffed, costantly pushing about selling and hitting unreal targets. Promotions are a joke, pay increase is ridicolous. Very stressful and draining job. Personally I couldn't stand their policy about staff meals, the three hours long cleaning at night, split-shifts Advice to Management Hire more people, find a better job-life balance for non-manager positions, more breaks during long shifts (20 minutes in 12 hours is a nightmare)", "rating": 3, "pros": "Training is specific and delivered by very competent people, remembering all the menù dishes-number is challenging, but it could turn out funny. Tips are huge, because they're understaffed most of the time.", "cons": "Badly understaffed, costantly pushing about selling and hitting unreal targets. Promotions are a joke, pay increase is ridicolous. Very stressful and draining job. Personally I couldn't stand their policy about staff meals, the three hours long cleaning at night, split-shifts", "advice": "Hire more people, find a better job-life balance for non-manager positions, more breaks during long shifts (20 minutes in 12 hours is a nightmare)"}, {"title": "It might get too fun", "text": "Pros Great environment, amazing team, good tips and always buzzing. You can always find a moment to laugh if you're lucky enough to built a strong bond with the team. It's likely to happen if you're working in a busy branch. Training is sometimes overlooked. Cons Long hours, extra shifts and you could end up working 10 days in a row. Training is overlooked most of the times if you're a valuable member. I guess that if you're a decent server they expect you to know the job in 2 weeks whether, on the other side, with some douches they will just allow them to do whatever they want without performing. Not fair.", "rating": 5, "pros": "Great environment, amazing team, good tips and always buzzing. You can always find a moment to laugh if you're lucky enough to built a strong bond with the team. It's likely to happen if you're working in a busy branch. Training is sometimes overlooked.", "cons": "Long hours, extra shifts and you could end up working 10 days in a row. Training is overlooked most of the times if you're a valuable member. I guess that if you're a decent server they expect you to know the job in 2 weeks whether, on the other side, with some douches they will just allow them to do whatever they want without performing. Not fair.", "advice": null}, {"title": "never ever again, worst nightmare", "text": "Pros good tips- that you had to share btw with other lazy staff and also managers! Cons poor management, brainwashing from Head office, unrealizable tasks from management and HO, the were pushing us too hard to upsell, it was ridiculous. wrong people were becoming team leaders, they were bullies if you did not belong to their ,drama group,, Really bad behaviour towards boh staff. if you called sick they asked you to come to work or.... i believe in all chains the same thing is goin on it depends on management how you treat your staff and my branch was not able to handle. Advice to Management treat people as human beings not as numbers or robots. as you said before i was employed- we dont employ robots or clons. no you dont- u make them from people.", "rating": 3, "pros": "good tips- that you had to share btw with other lazy staff and also managers!", "cons": "poor management, brainwashing from Head office, unrealizable tasks from management and HO, the were pushing us too hard to upsell, it was ridiculous. wrong people were becoming team leaders, they were bullies if you did not belong to their ,drama group,, Really bad behaviour towards boh staff. if you called sick they asked you to come to work or.... i believe in all chains the same thing is goin on it depends on management how you treat your staff and my branch was not able to handle.", "advice": "treat people as human beings not as numbers or robots. as you said before i was employed- we dont employ robots or clons. no you dont- u make them from people."}, {"title": "General Manager", "text": "Pros Worldwide company with lots of development opportunities Cons I can't really think of any", "rating": 5, "pros": "Worldwide company with lots of development opportunities", "cons": "I can't really think of any", "advice": null}, {"title": "Good money, easy job", "text": "Pros Good Money, easy Job, cool workmates, Managers try to help you with rotas and to build a genuine work life Balance. Cons stressful many times, many hours of work, changing timetables, sometimes your Team leader will be treat you in a unrespectful manner, Managers usually do not do that", "rating": 5, "pros": "Good Money, easy Job, cool workmates, Managers try to help you with rotas and", "cons": "stressful many times, many hours of work, changing timetables, sometimes your Team leader will be treat you in a unrespectful manner, Managers usually do not do that", "advice": null}, {"title": "kitchen porter", "text": "Pros busy restaurant but time goes very fast Cons sometimes no breaks too busy Advice to Management sort out breaks", "rating": 5, "pros": "busy restaurant but time goes very fast", "cons": "sometimes no breaks too busy", "advice": "sort out breaks"}, {"title": "Waitress", "text": "Pros Great wage, fantastic management, great staff discounts Cons Very few cons, head office can get involved necessary", "rating": 5, "pros": "Great wage, fantastic management, great staff discounts", "cons": "Very few cons, head office can get involved necessary", "advice": null}, {"title": "Line Chef - Media City", "text": "Pros Worked for almost a year, in Wagamama Media City, great environment filled with hard working people. Decent hours, between 40-50 a week, trained towards a team leader position after six months, breaks and food provided, good place overall. The head chef is a really helpful guy, interested in your progress, always willing to support you and make sure you feel appreciated. Cons Most of the staff in the kitchen is foreign and sometimes it is difficult to communicate because they don't know the language. When I started, my contracted stated Line Chef/Kitchen Porter which meant that at any point in time, because the kitchen is quite small, I will have to be a KP. Sometimes managers try to save money by cutting people from the rota which leads to more work for the rest of the guys. Advice to Management Take more care of new employees, invest more time in their training so that they can take full responsibility of every process in the kitchen.", "rating": 3, "pros": "Worked for almost a year, in Wagamama Media City, great environment filled with hard working people. Decent hours, between 40-50 a week, trained towards a team leader position after six months, breaks and food provided, good place overall. The head chef is a really helpful guy, interested in your progress, always willing to support you and make sure you feel appreciated.", "cons": "Most of the staff in the kitchen is foreign and sometimes it is difficult to communicate because they don't know the language. When I started, my contracted stated Line Chef/Kitchen Porter which meant that at any point in time, because the kitchen is quite small, I will have to be a KP. Sometimes managers try to save money by cutting people from the rota which leads to more work for the rest of the guys.", "advice": "Take more care of new employees, invest more time in their training so that they can take full responsibility of every process in the kitchen."}]