[{"title": "Team Leader", "text": "Pros The benefits of working for the company are great. Cons There restructuring of management leaves the store massively understaffed.", "rating": 5, "pros": "The benefits of working for the company are great.", "cons": "There restructuring of management leaves the store massively understaffed.", "advice": null}, {"title": "Supermarket Assistant (Replenishment)", "text": "Pros Reasonable benfits (salary, leisure reimbursement for gigs, arts etc.) Good intranet Cheap food available on breaks Salary consistent across age groups Cons Extremely inconsistent breaks between employees (deliberate due to hour structuring) Poor branch management Training almost non existent (relying on other staff to ad-hoc teach you) Difficulty booking holidays at times Inability to appropriately schedule overtime - regularly asked to 'add hours' at end of shifts rather than simply sign up to shifts with ability to plan Upward mobility difficult without full time role & very good relationship with managers No floor staff suggestions listened to Advice to Management Better training; restructure; listen to floor staff", "rating": 3, "pros": "Reasonable benfits (salary, leisure reimbursement for gigs, arts etc.)", "cons": "Extremely inconsistent breaks between employees (deliberate due to hour structuring)", "advice": "Better training; restructure; listen to floor staff"}, {"title": "good atmosphere", "text": "Pros great flexibility, good working hours, friendly atmosphere, overall was a great place for part time employment ' only worked Saturdays however Cons sometimes did not get paid when last customers were in store, due to customer service were forced to wait for last remaining customers Advice to Management improve the system of breaks, a shift with less than four hours did not warrant a break. however after staring at a screen for this time it was not healthy.", "rating": 3, "pros": "great flexibility, good working hours, friendly atmosphere, overall was a great place for part time employment ' only worked Saturdays however", "cons": "sometimes did not get paid when last customers were in store, due to customer service were forced to wait for last remaining customers", "advice": "improve the system of breaks, a shift with less than four hours did not warrant a break. however after staring at a screen for this time it was not healthy."}, {"title": "part time work", "text": "Pros good community feel, good training, some good managers although can be hit and miss, flexible hours during exams Cons some managers were difficult to get along with, HR were useless and payments often did not include overtime. Advice to Management keep developing your training strategy and encourage people to be involved in the partnership", "rating": 5, "pros": "good community feel, good training, some good managers although can be hit and miss, flexible hours during exams", "cons": "some managers were difficult to get along with, HR were useless and payments often did not include overtime.", "advice": "keep developing your training strategy and encourage people to be involved in the partnership"}, {"title": "Good organisation values under challenge in some areas", "text": "Pros You own the business as a Partner and have a direct stake in its success Cons A trend towards the idea that consultants are the root to realising future growth ambitions without necessarily unlocking all of the internal talent that exists", "rating": 3, "pros": "You own the business as a Partner and have a direct stake in its success", "cons": "A trend towards the idea that consultants are the root to realising future growth ambitions without necessarily unlocking all of the internal talent that exists", "advice": null}, {"title": "Fanastic Student Employer", "text": "Pros Fantastic place to work as a student, very flexible, excellent benefits and seem to genuinely care about staff. Cons Online training system outdated, difficult to use and could be improved.", "rating": 5, "pros": "Fantastic place to work as a student, very flexible, excellent benefits and seem to genuinely care about staff.", "cons": "Online training system outdated, difficult to use and could be improved.", "advice": null}, {"title": "Sales Assistant", "text": "Pros Bonus Scheme + Good Environment to work in Cons No downsides really ... late night shifts sometimes", "rating": 5, "pros": "Bonus Scheme + Good Environment to work in", "cons": "No downsides really ... late night shifts sometimes", "advice": null}, {"title": "Great", "text": "Pros Great support for full-time student Cons Pay for lunch Bad with paying for overtime", "rating": 5, "pros": "Great support for full-time student", "cons": "Pay for lunch", "advice": null}, {"title": "Supportive", "text": "Pros Largely supportive management, good benefits for permanent employees (Parrtners) Cons Not that easy to become a Partner", "rating": 5, "pros": "Largely supportive management, good benefits for permanent employees (Parrtners)", "cons": "Not that easy to become a Partner", "advice": null}, {"title": "Positive and Friendly", "text": "Pros Everybody that works for the company is very friendly and helpful towards each other. The management and the business in general are very understanding and willing to compromise where necessary for the benefit of partners. The opportunities to progress within the company are made very clear if you show the willingness to work hard. Cons Modern Waitrose appears not to be working in my branch, the sections are being spread thin with less staff members being employed. This means partners are being asked to do more work on multiple sections, without a mention of pay increase.", "rating": 5, "pros": "Everybody that works for the company is very friendly and helpful towards each other. The management and the business in general are very understanding and willing to compromise where necessary for the benefit of partners. The opportunities to progress within the company are made very clear if you show the willingness to work hard.", "cons": "Modern Waitrose appears not to be working in my branch, the sections are being spread thin with less staff members being employed. This means partners are being asked to do more work on multiple sections, without a mention of pay increase.", "advice": null}, {"title": "Customer Service", "text": "Pros Friendly employees and great customers. Some degree of flexibility regarding shifts and good bonus. Employees feel valued despite the large size of the company Cons Not many actually, would recommend", "rating": 5, "pros": "Friendly employees and great customers. Some degree of flexibility regarding shifts and good bonus. Employees feel valued despite the large size of the company", "cons": "Not many actually, would recommend", "advice": null}, {"title": "Great!", "text": "Pros Friendly company with lots of partner benefits Cons Can be called at short term to fill in shifts", "rating": 5, "pros": "Friendly company with lots of partner benefits", "cons": "Can be called at short term to fill in shifts", "advice": null}, {"title": "Enjoyable work experience", "text": "Pros Friendly staff, lots of opportunity to do overtime Cons Can be a physically demanding job", "rating": 5, "pros": "Friendly staff, lots of opportunity to do overtime", "cons": "Can be a physically demanding job", "advice": null}, {"title": "Good company to work for", "text": "Pros Flexible hours Fun staff to work with Cons Sometimes it can be stressful when it is busy", "rating": 5, "pros": "Flexible hours", "cons": "Sometimes it can be stressful when it is busy", "advice": null}, {"title": "Progressive and developmental. Has helped me grow into a good manager.", "text": "Pros Partners, the job itself. Progressive but with cronyism rife. If your face fits you get on. The partnership ethos is one to be admired for all business types. Cons Focus on profit to the detriment of its partners currently . With the management restructure taking shape again after 2010, there are a number of issues that are being worked through. Advice to Management Listen more to those who do, not those that don’t.", "rating": 5, "pros": "Partners, the job itself. Progressive but with cronyism rife. If your face fits you get on. The partnership ethos is one to be admired for all business types.", "cons": "Focus on profit to the detriment of its partners currently . With the management restructure taking shape again after 2010, there are a number of issues that are being worked through.", "advice": "Listen more to those who do, not those that don’t."}, {"title": "Part time", "text": "Pros It was a friendly and enjoyable working environment. Cons There aren't really any I can think of", "rating": 5, "pros": "It was a friendly and enjoyable working environment.", "cons": "There aren't really any I can think of", "advice": null}, {"title": "Working at waitrose", "text": "Pros It's good pay, easy and friendly Cons Managers string you along Advice to Management Don't string staff alone", "rating": 5, "pros": "It's good pay, easy and friendly", "cons": "Managers string you along", "advice": "Don't string staff alone"}, {"title": "Shop Assistant", "text": "Pros Friendly, Flexible, Easy, Sociable, Great Cons Tedious work, Boring, Dull, Traditional, Long hours Advice to Management Listen to employees more", "rating": 3, "pros": "Friendly, Flexible, Easy, Sociable, Great", "cons": "Tedious work, Boring, Dull, Traditional, Long hours", "advice": "Listen to employees more"}, {"title": "Part Time Job- Student", "text": "Pros Great Pay, bonus scheme and friendly colleagues and managers. Being a 'partner' is a positive too. Job available on return from uni over Christmas period. Cons No parking, No availability of position on return from uni over Summer holidays.", "rating": 5, "pros": "Great Pay, bonus scheme and friendly colleagues and managers. Being a 'partner' is a positive too. Job available on return from uni over Christmas period.", "cons": "No parking, No availability of position on return from uni over Summer holidays.", "advice": null}, {"title": "good for a weekend job, not as a career", "text": "Pros great discount both at Waitrose and John Lewis and other additional benefits such as holiday offers, discounts at partner restaurants etc. Cons awful conditions with new 'modern waitrose' scheme, unrealistic expectations, no support with training needs, always having to stay longer hours and as a manager you don't get paid for overtime but it is unrealistic to get the time back ever Advice to Management look after the partners and they will look after customers! at the moment customer comes first, that's why partners are unwilling to work and there's high turnover. Look into the pay gap for Assistant Team Managers as they do pretty much the same thing as Section managers but the gap is atrocious. Some partners are getting paid higher than managers and you expect respect!", "rating": 3, "pros": "great discount both at Waitrose and John Lewis and other additional benefits such as holiday offers, discounts at partner restaurants etc.", "cons": "awful conditions with new 'modern waitrose' scheme, unrealistic expectations, no support with training needs, always having to stay longer hours and as a manager you don't get paid for overtime but it is unrealistic to get the time back ever", "advice": "look after the partners and they will look after customers! at the moment customer comes first, that's why partners are unwilling to work and there's high turnover. Look into the pay gap for Assistant Team Managers as they do pretty much the same thing as Section managers but the gap is atrocious. Some partners are getting paid higher than managers and you expect respect!"}, {"title": "Part Time Supervisor (throughout higher education)(204 Branch)", "text": "Pros Decent benefits & generally friendly staff members. Cons A few very rude customers, who seems to expect the world from you because you work at Waitrose. This got so ridiculous I was once asked to get a certain type of bread in stock for a ladies next visit... She told me I could get it at Sainsburys. I told her to go there - this wasn't the most diplomatic solution I admit. Also the management was atrocious due to inconsistency, and lack of motivation. Only once did I have a manager who wanted to be working as my manager. Advice to Management Stop pushing the idea that everyone is a partner, when you then don't listen to our views, or do nothing about it when you do occasionally give us the time of day. Hire people in management position who are going to have at least a year or two in the role - not people at university. ASM don't work if they are only around at Christmas, as they don't have a rapport with new staff, or any clue whats going on in terms of the ever-changing management.", "rating": 3, "pros": "Decent benefits & generally friendly staff members.", "cons": "A few very rude customers, who seems to expect the world from you because you work at Waitrose. This got so ridiculous I was once asked to get a certain type of bread in stock for a ladies next visit... She told me I could get it at Sainsburys. I told her to go there - this wasn't the most diplomatic solution I admit.", "advice": "Stop pushing the idea that everyone is a partner, when you then don't listen to our views, or do nothing about it when you do occasionally give us the time of day."}, {"title": "Waitrose as a part of the JLP a huge YES! As a Branch (Comely Bank) - NO!", "text": "Pros Very, I mean very understandable people, always ready to help and help you out whatever your situation is (Head Office only!) Year bonus (from your to year lower but it is) Cons So-called 'management' that cannot cope with stress and pass it over to partners Biased approach to some partners People with spasm on their face instead of genuine smile that makes you feel you live in a virtual world Again so-called 'management' promising pies in the sky with development ending up with no support whatsoever. Advice to Management Exchange for some different model or re-programme the current one.", "rating": 3, "pros": "Very, I mean very understandable people, always ready to help and help you out whatever your situation is (Head Office only!)", "cons": "So-called 'management' that cannot cope with stress and pass it over to partners", "advice": "Exchange for some different model or re-programme the current one."}, {"title": "Okay overall but poor management", "text": "Pros Partner discount, overtime often available, often pick up cheap food. Cons Mismanagement, poor discipline that became progressively worse because management couldn't be bothered to deal with. Little chance of progression unless you're management's flavour of the month. Advice to Management Stop hiring people just because they're your friends.", "rating": 3, "pros": "Partner discount, overtime often available, often pick up cheap food.", "cons": "Mismanagement, poor discipline that became progressively worse because management couldn't be bothered to deal with. Little chance of progression unless you're management's flavour of the month.", "advice": "Stop hiring people just because they're your friends."}, {"title": "Waitrose Supermarket Assistant Review", "text": "Pros Great hours, especially for a full-time student. Discounts on John Lewis/Waitrose products. Cons Senior management can sometimes feel too authoritative.", "rating": 5, "pros": "Great hours, especially for a full-time student. Discounts on John Lewis/Waitrose products.", "cons": "Senior management can sometimes feel too authoritative.", "advice": null}, {"title": "Depends on the store", "text": "Pros Partner discount fro John Lewis and Waitrose Bonus Friendly staff Cons Poor management at the lower levels Constant pressure for overtime", "rating": 5, "pros": "Partner discount fro John Lewis and Waitrose", "cons": "Poor management at the lower levels", "advice": null}, {"title": "Rewarding company to work for", "text": "Pros The constant training to better yourself, the opportunity to work in different areas, the discount throughout Waitrose and John Lewis, the annual bonus, the encouragement of management and lovely colleagues. Cons Non, I throughly enjoyed my time working there. Advice to Management Train every staff member on all counters including Bake Off so that there is always someone available to help out when short staffed.", "rating": 5, "pros": "The constant training to better yourself, the opportunity to work in different areas, the discount throughout Waitrose and John Lewis, the annual bonus, the encouragement of management and lovely colleagues.", "cons": "Non, I throughly enjoyed my time working there.", "advice": "Train every staff member on all counters including Bake Off so that there is always someone available to help out when short staffed."}, {"title": "Thoughts On Working At Waitrose", "text": "Pros Experience allowed across multiple roles, and dynamic working, as well as good pay for a college student. Most staff at the same level of power were friendly, and willing to help. Cons Management weren't understanding of personal issues, and seemed to push partners too hard so make themselves look good for their line manager, as well as not being sympathetic for new partners, and not accepting slowness when trying a new job. Advice to Management Be more understanding of people's needs, more patient, and less negative about everything in general. Moaning really makes work feel depressing.", "rating": 3, "pros": "Experience allowed across multiple roles, and dynamic working, as well as good pay for a college student. Most staff at the same level of power were friendly, and willing to help.", "cons": "Management weren't understanding of personal issues, and seemed to push partners too hard so make themselves look good for their line manager, as well as not being sympathetic for new partners, and not accepting slowness when trying a new job.", "advice": "Be more understanding of people's needs, more patient, and less negative about everything in general. Moaning really makes work feel depressing."}, {"title": "Head office roles", "text": "Pros Well organised and structured organisation, and professional. Great brand reputation and company culture and management are very supportive. Business allows you to be autonomous but you do have to seek out opportunities to get recognised. Cons Limited movement upwards but more opportunity side wards as some people stay in the same job/level for years. With having structure and process they are not as agile or quick to make things happen so can be slow Advice to Management Realise talent and give opportunities, be flexible and more agile. Continue with the great culture", "rating": 5, "pros": "Well organised and structured organisation, and professional. Great brand reputation and company culture and management are very supportive. Business allows you to be autonomous but you do have to seek out opportunities to get recognised.", "cons": "Limited movement upwards but more opportunity side wards as some people stay in the same job/level for years. With having structure and process they are not as agile or quick to make things happen so can be slow", "advice": "Realise talent and give opportunities, be flexible and more agile. Continue with the great culture"}, {"title": "A truly caring business with excellent ethical ethos", "text": "Pros - co-owned model means everybody genuinely has a voice in the business - focus on longer term priorities avoids short-sighted snap decision making - great on site facilities at Bracknell based HQ - respectful and friendly culture - generally good work/life balance - excellent perks and benefits incl. 25% off at John Lewis and 15% off at Waitrose - gender diverse workforce Cons - too much analysis paralysis - unnecessary layers of middle management - lack of fresh blood and ideas due to a fairly unchanging workforce - performance management lacks teeth Advice to Management Keep valuing the 'partners'. Allow room for creative innovation but also faster execution of that innovation.", "rating": 5, "pros": "- co-owned model means everybody genuinely has a voice in the business", "cons": "- too much analysis paralysis", "advice": "Keep valuing the 'partners'. Allow room for creative innovation but also faster execution of that innovation."}, {"title": "Great part-time job", "text": "Pros Partnership bonus, great benefits e.g. o2 tickets, great pay for student, nice staff Cons Work could be repetitive, hard to get promotion Advice to Management Rotate sections for staff", "rating": 5, "pros": "Partnership bonus, great benefits e.g. o2 tickets, great pay for student, nice staff", "cons": "Work could be repetitive, hard to get promotion", "advice": "Rotate sections for staff"}, {"title": "Good for college and uni students", "text": "Pros Competitive pay, friendly colleagues, community feel Cons Cost-cutting measures have led to less perks for employees eg. less paid breaks", "rating": 5, "pros": "Competitive pay, friendly colleagues, community feel", "cons": "Cost-cutting measures have led to less perks for employees eg. less paid breaks", "advice": null}, {"title": "Waitrose supermarket assistant", "text": "Pros A friendly atmosphere and positive business structure Cons micro management poor in many cases in areas such as pay and holiday", "rating": 5, "pros": "A friendly atmosphere and positive business structure", "cons": "micro management poor in many cases in areas such as pay and holiday", "advice": null}, {"title": "Good", "text": "Pros Good wage, good people all round Cons Depending on what area you work in, can be fairly demanding", "rating": 5, "pros": "Good wage, good people all round", "cons": "Depending on what area you work in, can be fairly demanding", "advice": null}, {"title": "It's a job", "text": "Pros Flexible working hours. Partnership discount. Fantastic partners Cons Forced to take breaks (unpaid) even when working 6 hours or less. Often finish shift late.", "rating": 3, "pros": "Flexible working hours. Partnership discount. Fantastic partners", "cons": "Forced to take breaks (unpaid) even when working 6 hours or less. Often finish shift late.", "advice": null}, {"title": "Mixed experience", "text": "Pros Excellent initial training, on-the-job skills development, good range of competencies encouraged, good pay, satisfactory hours Cons Changeable employee rotas mean sometimes employees are left on their own (chronic understaffing), little opportunity to progress, management don't always agree on processes Advice to Management If you train a Partner to work in an area, let them work there. Standardise management policy to prevent confusion. Be stricter on Partners who are off sick without evidence.", "rating": 5, "pros": "Excellent initial training, on-the-job skills development, good range of competencies encouraged, good pay, satisfactory hours", "cons": "Changeable employee rotas mean sometimes employees are left on their own (chronic understaffing), little opportunity to progress, management don't always agree on processes", "advice": "If you train a Partner to work in an area, let them work there. Standardise management policy to prevent confusion. Be stricter on Partners who are off sick without evidence."}, {"title": "Delivery Driver", "text": "Pros Decent money. Good amount of responsibility. Cons Pressure to be on time.", "rating": 5, "pros": "Decent money.", "cons": "Pressure to be on time.", "advice": null}, {"title": "Supermarket Assistant", "text": "Pros Money is above average pay Cons Tasks are mundane and repetitive", "rating": 5, "pros": "Money is above average pay", "cons": "Tasks are mundane and repetitive", "advice": null}, {"title": "Not bad", "text": "Pros Friendly and supportive team. Good bonus, Cons Hard work, sometimes is understaffed.", "rating": 5, "pros": "Friendly and supportive team. Good bonus,", "cons": "Hard work, sometimes is understaffed.", "advice": null}, {"title": "Is a great place to work!", "text": "Pros Salary, Work, Colleagues, Bonus, Fun. Cons NO cons to working at Waitrose", "rating": 5, "pros": "Salary, Work, Colleagues, Bonus, Fun.", "cons": "NO cons to working at Waitrose", "advice": null}, {"title": "Enjoyable and valuable", "text": "Pros Strong teamwork and Waitrose are notorious for being a company that cares about its staff. Good place to develop skills Cons Structure of work is sometimes disjointed. Can lead to a confusing and hindered working environment", "rating": 5, "pros": "Strong teamwork and Waitrose are notorious for being a company that cares about its staff. Good place to develop skills", "cons": "Structure of work is sometimes disjointed. Can lead to a confusing and hindered working environment", "advice": null}, {"title": "My honest review of working at waitrose", "text": "Pros Great benefits, helpful colleagues, lots of overtime, flexible working times Cons Some poor senior management especially from operations point of view warehouse illogically set out Bad training (if any at all) Too many chiefs Hard to gain promotion or move higher Routes are scheduled with NO breaks! Given routes that start before shift, so inevitably late to deliveries Verbal abuse by clients for being late etc.. Expect to be given an easy route when you start, which in no way is a true reflection of the work given afterwards Some staff are given preferential treatments on their manifest, so deliver much much less A GPS system which is outdated and Waitrose has not paid for traffic alert, so expect to be directed towards lots of traffic. Old and outdated handheld that persistently crashes and makes the job even more difficult Clothing that makes you sweat so that your underclothing is wet through Expect to carry tons of water up flights of stairs in London apartments with no lift and be treated like a second class citizen Filthy internal vans with mould where the food is Dirty food crates Great benefits, if you can afford them on the very low wages Advice to Management investigate the lack of senior management who seem to have little to no understanding of what's going on or hide it under the table", "rating": 3, "pros": "Great benefits, helpful colleagues, lots of overtime, flexible working times", "cons": "Some poor senior management especially from operations point of view", "advice": "investigate the lack of senior management who seem to have little to no understanding of what's going on or hide it under the table"}, {"title": "Replenishment Partner - Waitrose", "text": "Pros Good working environment Good Pay compared to competitors Good staff discounts within the partnership and with other companies Excellent food cooked for staff in the PDR (Partner Dining Room) Cons Can involve long hours, however this is down to what the partner is ready to commit to Some customers can be extremely rude and arrogant", "rating": 5, "pros": "Good working environment", "cons": "Can involve long hours, however this is down to what the partner is ready to commit to", "advice": null}, {"title": "Supermarket Assistant", "text": "Pros Discount New line just to fill in the 20 word gap. Another new line just to fill the 20 word gap Cons Modern Waitrose- Does Not promote work/lifestyle balance. Progression is often bias on who is more friendly with the managers. Pay review as bias toward the relationship with the manager. Advice to Management Learn to manage. Develop new processes and not just ask for more out of your partners. Be manager and be innovate.", "rating": 5, "pros": "Discount", "cons": "Modern Waitrose- Does Not promote work/lifestyle balance.", "advice": "Learn to manage. Develop new processes and not just ask for more out of your partners. Be manager and be innovate."}, {"title": "Cashier", "text": "Pros Friendly, excellent training (some of the best in retail), competitive wages Cons Staying late to close down unpaid", "rating": 5, "pros": "Friendly, excellent training (some of the best in retail), competitive wages", "cons": "Staying late to close down unpaid", "advice": null}, {"title": "Manager", "text": "Pros Fixed hours early or late shift, good pay with potential to increase hourly rate, and benefit with opportunities for a bonus Cons Change is hard with productivity not at the forefront of the ajenda and poor communication between shifts. Great offers on company benefits are sold out very quickly. Advice to Management Be a more productive business with better communication. Create supervisory roles to bridge gap between partners and managers.", "rating": 5, "pros": "Fixed hours early or late shift, good pay with potential to increase hourly rate, and benefit with opportunities for a bonus", "cons": "Change is hard with productivity not at the forefront of the ajenda and poor communication between shifts. Great offers on company benefits are sold out very quickly.", "advice": "Be a more productive business with better communication. Create supervisory roles to bridge gap between partners and managers."}, {"title": "Waitrose", "text": "Pros Good pay, good bonus, good discounts particularly at John Lewis, long breaks Cons Long hours, boring work, understaffed Advice to Management Start treating part-time staff properly - they'll work better I assure you", "rating": 5, "pros": "Good pay, good bonus, good discounts particularly at John Lewis, long breaks", "cons": "Long hours, boring work, understaffed", "advice": "Start treating part-time staff properly - they'll work better I assure you"}, {"title": "Sales Assistant Fresh Department", "text": "Pros Easy work, management are good. Cons You do the same thing every single working day.", "rating": 3, "pros": "Easy work, management are good.", "cons": "You do the same thing every single working day.", "advice": null}, {"title": "Customer Delivery Driver", "text": "Pros John lewis/ waitrose Discount Partner store Cons some heavy deliveries, customers order large amounts of water due to the free delivery deals, which can be very heavy and time consuming over pack delivery schedule, so dont expect to finish on time", "rating": 3, "pros": "John lewis/ waitrose Discount", "cons": "some heavy deliveries, customers order large amounts of water due to the free delivery deals, which can be very heavy and time consuming", "advice": null}, {"title": "Good job for a full-time student", "text": "Pros They pay a fair amount of money for a part time job. Nice people to work around and get along with. A few activities to get involved in outside of work during the year. Cons No empathy for individuals taking exams or completing coursework during a busy time of the year. Staff are quite forceful in making people do overtime. People murmur too much, this is the case on all levels, particularly on the shop floor. Bonuses have sharply declined from 20 to 10%. Advice to Management Be more compassionate towards students. Don't force overtime upon people.", "rating": 3, "pros": "They pay a fair amount of money for a part time job. Nice people to work around and get along with. A few activities to get involved in outside of work during the year.", "cons": "No empathy for individuals taking exams or completing coursework during a busy time of the year. Staff are quite forceful in making people do overtime. People murmur too much, this is the case on all levels, particularly on the shop floor.", "advice": "Be more compassionate towards students. Don't force overtime upon people."}, {"title": "Good pay for teenager, great benefits and discounts", "text": "Pros Good pay for teenager, as well as good benefits. Very flexible hours and allowed to swap shifts with other co workers Cons Lots of hard manual work, needing to be trained on all aspects of waitrose, constant nagging to train as a manager Advice to Management Management needs to understand that different cages take different amounts of time, such as bulky drinks or, small and time taking little items", "rating": 5, "pros": "Good pay for teenager, as well as good benefits. Very flexible hours and allowed to swap shifts with other co workers", "cons": "Lots of hard manual work, needing to be trained on all aspects of waitrose, constant nagging to train as a manager", "advice": "Management needs to understand that different cages take different amounts of time, such as bulky drinks or, small and time taking little items"}, {"title": "Nice place to work", "text": "Pros Great people, its like a family. Lots of variety especially with the Modern Waitrose initiative Cons Management is not always reliable", "rating": 5, "pros": "Great people, its like a family. Lots of variety especially with the Modern Waitrose initiative", "cons": "Management is not always reliable", "advice": null}, {"title": "waitrose", "text": "Pros amazing great info really helpful. Sarah was amazing how she organised the whole session. Cons nothing at all got straight to the point. Advice to Management give sarah recruitment administrative a pay rise :)", "rating": 5, "pros": "amazing great info really helpful. Sarah was amazing how she organised the whole session.", "cons": "nothing at all got straight to the point.", "advice": "give sarah recruitment administrative a pay rise :)"}, {"title": "Not what they claim to represent", "text": "Pros The interview stage was the only positive experience about this company. It was 30 minutes and the hiring manager was a very nice man. Cons I worked there one day and I quit the first day. Why? Firstly it took 5 weeks between interview stage and starting day. Nobody contacted me in the run up to my start date telling me what time to come in, who to ask for and what to wear. I made endless calls the day before with no luck only to talk to a line manager who did not care and said \"I dont know, come in at 10am alright bye\". This was supposedly my line manager. After calling the whole day that was my answer. Upon arrival of my first day I was brought up to a room and sat at a computer where I had to do my training online. I was left for 6 hours by myself to do this where nobody came back for me or to check on me. There was a lot of difficult stuff to get through with some things I did not understand and nobody around to ask. I was not given training face to face, shown around the building/staff area. I was not given a uniform or shown where to come in the following morning as it was a 7am start before the store even opened. It was a lot of stress and a lot of effort on my part to get people to try and help me even though they were the ones recruiting me that I decided to leave for the lack of efficiency and total unprofessional work ethic of the management. Advice to Management Waitrose supposedly has a history for regarding its staff but that is not true as this place does not care about their staff at all especially new employees. Its a daunting process to start a new job especially one you are not familiar with and I believe new recruits need a helping hand, guidance and plenty of information to get them started. Not wondering around like a headless chicken trying to find someone who is too busy eating their Christmas dinner.", "rating": 3, "pros": "The interview stage was the only positive experience about this company. It was 30 minutes and the hiring manager was a very nice man.", "cons": "I worked there one day and I quit the first day. Why? Firstly it took 5 weeks between interview stage and starting day. Nobody contacted me in the run up to my start date telling me what time to come in, who to ask for and what to wear. I made endless calls the day before with no luck only to talk to a line manager who did not care and said \"I dont know, come in at 10am alright bye\". This was supposedly my line manager. After calling the whole day that was my answer. Upon arrival of my first day I was brought up to a room and sat at a computer where I had to do my training online. I was left for 6 hours by myself to do this where nobody came back for me or to check on me. There was a lot of difficult stuff to get through with some things I did not understand and nobody around to ask. I was not given training face to face, shown around the building/staff area. I was not given a uniform or shown where to come in the following morning as it was a 7am start before the store even opened. It was a lot of stress and a lot of effort on my part to get people to try and help me even though they were the ones recruiting me that I decided to leave for the lack of efficiency and total unprofessional work ethic of the management.", "advice": "Waitrose supposedly has a history for regarding its staff but that is not true as this place does not care about their staff at all especially new employees. Its a daunting process to start a new job especially one you are not familiar with and I believe new recruits need a helping hand, guidance and plenty of information to get them started. Not wondering around like a headless chicken trying to find someone who is too busy eating their Christmas dinner."}, {"title": "Part Time Sales Assistant", "text": "Pros Friendly and warm people, good culture Cons Tedious work, political management structure", "rating": 5, "pros": "Friendly and warm people, good culture", "cons": "Tedious work, political management structure", "advice": null}, {"title": "Good", "text": "Pros Supportive, good, fun, worthwhile, nice Cons Busy, sometimes can seem not very rewarding", "rating": 5, "pros": "Supportive, good, fun, worthwhile, nice", "cons": "Busy, sometimes can seem not very rewarding", "advice": null}, {"title": "Student job", "text": "Pros good job to have whilst a student Cons not everyone works as hard as you Advice to Management praise those who work and those that don't make them work harder", "rating": 5, "pros": "good job to have whilst a student", "cons": "not everyone works as hard as you", "advice": "praise those who work and those that don't make them work harder"}, {"title": "Great for students", "text": "Pros Lots of young people, great pay for students, benefits including ticket subsidies. Cons Can be understaffed at times Advice to Management Address staffing issues", "rating": 5, "pros": "Lots of young people, great pay for students, benefits including ticket subsidies.", "cons": "Can be understaffed at times", "advice": "Address staffing issues"}, {"title": "Waitrose", "text": "Pros Culture, History, Ethos, Values, People Cons Not many opportunities to progress", "rating": 5, "pros": "Culture, History, Ethos, Values, People", "cons": "Not many opportunities to progress", "advice": null}, {"title": "Good company", "text": "Pros Friendly teamwork environment. Bonus, community atmosphere Cons Restrictive uniforms, no nails, flared trousers. Bonus is decreasing.", "rating": 5, "pros": "Friendly teamwork environment. Bonus, community atmosphere", "cons": "Restrictive uniforms, no nails, flared trousers. Bonus is decreasing.", "advice": null}, {"title": "Brilliant company", "text": "Pros yearly bonus was a great incentive Cons none that i can think of Advice to Management push people more to progress", "rating": 5, "pros": "yearly bonus was a great incentive", "cons": "none that i can think of", "advice": "push people more to progress"}, {"title": "Good first job", "text": "Pros Good Pay Good Bonus Scheme Good JLP Discount Overtime Cons Strict Work Motto Tough Goals Advice to Management Reduce hard management style", "rating": 3, "pros": "Good Pay", "cons": "Strict Work Motto", "advice": "Reduce hard management style"}, {"title": "Supermarket assistant", "text": "Pros Amazing place to work felt really welcome. Overtime opportunities allow you to do as much or as little as you want on top of you're contracted hours Cons Not much really there really adaptive", "rating": 5, "pros": "Amazing place to work felt really welcome. Overtime opportunities allow you to do as much or as little as you want on top of you're contracted hours", "cons": "Not much really there really adaptive", "advice": null}, {"title": "Check out", "text": "Pros fantastic company and good values Cons My branch was not particularily well managed Advice to Management Needs much better management and awareness of hours", "rating": 5, "pros": "fantastic company and good values", "cons": "My branch was not particularily well managed", "advice": "Needs much better management and awareness of hours"}, {"title": "Fantastic part time work", "text": "Pros lovely staff, great bonuses and opportunities to grow within the company Cons sometimes too big don't get enough praise or acknowledgement", "rating": 5, "pros": "lovely staff, great bonuses and opportunities to grow within the company", "cons": "sometimes too big don't get enough praise or acknowledgement", "advice": null}, {"title": "Customer Service", "text": "Pros Good for working as a student Cons No clear way to work your way up the management ladder.", "rating": 3, "pros": "Good for working as a student", "cons": "No clear way to work your way up the management ladder.", "advice": null}, {"title": "Amazing", "text": "Pros I love working in a team and being respected and treated fairly Cons I can't think of any Advice to Management Keep doing what you are doing", "rating": 5, "pros": "I love working in a team and being respected and treated fairly", "cons": "I can't think of any", "advice": "Keep doing what you are doing"}, {"title": "Supermarket Assistant", "text": "Pros Staff really warmed to me and were quite easy to work with. Supportive in teaching me the ropes of the store. Cons Irregular work colleagues attending on different days. This meant a shortage of work colleagues on random occasiosn Advice to Management Although difficult, but possibly finding a much better way of making vacancies for employees more accessible to the public. Could help to have cover available when needed.", "rating": 5, "pros": "Staff really warmed to me and were quite easy to work with. Supportive in teaching me the ropes of the store.", "cons": "Irregular work colleagues attending on different days. This meant a shortage of work colleagues on random occasiosn", "advice": "Although difficult, but possibly finding a much better way of making vacancies for employees more accessible to the public. Could help to have cover available when needed."}, {"title": "Great place to work", "text": "Pros Good salary and lovely staff Cons The shop can get very busy", "rating": 5, "pros": "Good salary and lovely staff", "cons": "The shop can get very busy", "advice": null}, {"title": "Supermarket assistant - cashier", "text": "Pros really friendly environment and colleagues Cons can be quite bureaucratic - pay misrepresented numerous times", "rating": 5, "pros": "really friendly environment and colleagues", "cons": "can be quite bureaucratic - pay misrepresented numerous times", "advice": null}, {"title": "Excellent", "text": "Pros Excellent pay. Good benefits. Cons Can't think of any negatives.", "rating": 5, "pros": "Excellent pay. Good benefits.", "cons": "Can't think of any negatives.", "advice": null}, {"title": "Stocker", "text": "Pros Good pay for a school job Cons Expected overtime too much sometimes", "rating": 5, "pros": "Good pay for a school job", "cons": "Expected overtime too much sometimes", "advice": null}, {"title": "Customer Service Assistant (Checkouts)", "text": "Pros Able to work alongside school studies Excellent pay and benefits (annual bonus and occasional gift card perks) Nice colleagues Cons Dependent on line manager Pressure to agree to overtime (difficult when studying for A levels)", "rating": 5, "pros": "Able to work alongside school studies", "cons": "Dependent on line manager", "advice": null}, {"title": "Great benefits, friendly staff and customers", "text": "Pros Salary Bonus Very fun Christmas party. GOod social Cons Hours on the weekend such as late saturdays Advice to Management No more", "rating": 3, "pros": "Salary", "cons": "Hours on the weekend such as late saturdays", "advice": "No more"}, {"title": "Good company with good management", "text": "Pros Used to get a Yearly bonus, which was handy as the money was too low. Otherwise was a good job Cons Had to wear a uniform involving green tie and shirt. But to be honest I didn't mind that but some people used to moan about it", "rating": 5, "pros": "Used to get a Yearly bonus, which was handy as the money was too low. Otherwise was a good job", "cons": "Had to wear a uniform involving green tie and shirt. But to be honest I didn't mind that but some people used to moan about it", "advice": null}, {"title": "Shop Assistant", "text": "Pros Pays reasonably well, get to work as part of a team and gain good experiences. I works around my university time table and allows me to do the things I want too and earn money at the same time. Cons Stressful, a lot of pressure on you to do multiple jobs, managers don't seem to do a lot and there is a lot of them for not many people. There is a divided between day team and night team. Advice to Management Do more", "rating": 5, "pros": "Pays reasonably well, get to work as part of a team and gain good experiences. I works around my university time table and allows me to do the things I want too and earn money at the same time.", "cons": "Stressful, a lot of pressure on you to do multiple jobs, managers don't seem to do a lot and there is a lot of them for not many people. There is a divided between day team and night team.", "advice": "Do more"}, {"title": "Part-Time", "text": "Pros good company to work for good pay good hours Cons Not really anything negative to say", "rating": 5, "pros": "good company to work for", "cons": "Not really anything negative to say", "advice": null}, {"title": "Good for students", "text": "Pros good pay for students AMAZING CHEAP FOOD! THEY LITERALLY HAVE NO BUGGET & PICK ALL THE FOOD UP FROM THE SHOP FLOOR! the food seriously cheap like £1.20 for a roast dinner. Staff are friendly. VERY layed back (maybe too layed back if you wanted to make it a career-but perfect for students) mostly students that work there (ambitious students, at that, so its nice you always seem to have a lot in common with people) Discount card :) Literally worked there a year and hardly had ANY bad customers, like maybe 2 proper rude ones, but that's it. Cons As you'd expect, its waitrose, so t*ts & teeth at all times, Yes sir, soryy sir, so sorry Madam, please allow me madem ;) all the time, but hey, I thought it was funny!", "rating": 5, "pros": "good pay for students", "cons": "As you'd expect, its waitrose, so t*ts & teeth at all times,", "advice": null}, {"title": "Poor management/no care/false promises", "text": "Pros Discount card (including partnership John Lewis and Waitrose), work isn't hard Cons Poor management, working atmosphere isn't great, no culture/people development + bad planning/strategy Advice to Management Take a closer look to #753, staff turnover happens with a reason", "rating": 1, "pros": "Discount card (including partnership John Lewis and Waitrose), work isn't hard", "cons": "Poor management, working atmosphere isn't great, no culture/people development + bad planning/strategy", "advice": "Take a closer look to #753, staff turnover happens with a reason"}, {"title": "Overall a good place to work", "text": "Pros Decent pay for the stage in my life I was at (still in sixth form), plus the partner bonus and discounts were beneficial. Cons Weren't always flexible with my hours even though I was assured before accepting the job that they would be as they knew I was a student.", "rating": 5, "pros": "Decent pay for the stage in my life I was at (still in sixth form), plus the partner bonus and discounts were beneficial.", "cons": "Weren't always flexible with my hours even though I was assured before accepting the job that they would be as they knew I was a student.", "advice": null}, {"title": "Good", "text": "Pros Good job for when studying Fun environment Partnership bonus is a fab way to keep employees engaged Cons Can be dull at low shopper periods Advice to Management Train employees on more than one discipline", "rating": 5, "pros": "Good job for when studying", "cons": "Can be dull at low shopper periods", "advice": "Train employees on more than one discipline"}, {"title": "Good company", "text": "Pros Great values and great staff Cons Can be a bit demanding", "rating": 5, "pros": "Great values and great staff", "cons": "Can be a bit demanding", "advice": null}, {"title": "performance", "text": "Pros excellent,, good , fun , great, Cons lack of promotion, long hours,", "rating": 3, "pros": "excellent,, good , fun , great,", "cons": "lack of promotion, long hours,", "advice": null}, {"title": "Waitrose", "text": "Pros Lovely people, reasonable pay, nice flexibility. Cons Could get a little dull at times.", "rating": 5, "pros": "Lovely people, reasonable pay, nice flexibility.", "cons": "Could get a little dull at times.", "advice": null}, {"title": "Different outlook", "text": "Pros Good pay, good benafits across a wife range of things, fun and happy atmosphere Cons Bad management, management take advantage even after trying to out out your way to help the branch, Advice to Management Be more flexible and support your team rather then bad mouth them all the time", "rating": 5, "pros": "Good pay, good benafits across a wife range of things, fun and happy atmosphere", "cons": "Bad management, management take advantage even after trying to out out your way to help the branch,", "advice": "Be more flexible and support your team rather then bad mouth them all the time"}, {"title": "part time cashier at waitrose", "text": "Pros good benefits like discount card Cons management were sometimes rude and pressurizing", "rating": 5, "pros": "good benefits like discount card", "cons": "management were sometimes rude and pressurizing", "advice": null}, {"title": "Good", "text": "Pros Organised, well trained, efficient, excellent customer service Cons Poorly staffed, modern Waitrose is failing, poor wages, lack of development", "rating": 5, "pros": "Organised, well trained, efficient, excellent customer service", "cons": "Poorly staffed, modern Waitrose is failing, poor wages, lack of development", "advice": null}, {"title": "Will remember with positive memories", "text": "Pros I think the best thing about working for this company is how close you get to all the staff so quickly. You get a great discount for Waitrose (15%) and at John Lewis (25%) after 3 months. Great training and experience, quickly become an expert on your department if you put your all in. Cons My partnership discount card didn’t come for over a month after it was meant to - a common thing you found was if Waitrose needed something from you it had to be your top priority, whilst if you needed something from them it was always brushed under the carpet. Awfully unsociable hours and the rotas would sometimes change without your knowledge. Pay rises may happen at the assessments, but even after 5 months they did not do my 3 month assessment (again, if it’s something to do with an employes interest it is not their priority). Some of the managers are not understanding in the slightest too. Advice to Management Understand that younger staff do have a life outside of their part-time job.", "rating": 5, "pros": "I think the best thing about working for this company is how close you get to all the staff so quickly. You get a great discount for Waitrose (15%) and at John Lewis (25%) after 3 months. Great training and experience, quickly become an expert on your department if you put your all in.", "cons": "My partnership discount card didn’t come for over a month after it was meant to - a common thing you found was if Waitrose needed something from you it had to be your top priority, whilst if you needed something from them it was always brushed under the carpet. Awfully unsociable hours and the rotas would sometimes change without your knowledge. Pay rises may happen at the assessments, but even after 5 months they did not do my 3 month assessment (again, if it’s something to do with an employes interest it is not their priority). Some of the managers are not understanding in the slightest too.", "advice": "Understand that younger staff do have a life outside of their part-time job."}, {"title": "Customer Service Assistant", "text": "Pros Partner Bonus and flexibility. Camaraderie makes workplace an enjoyable environment. Cons Poor management and outdated standards of practice. Advice to Management Promote from within and recognise the potential of part timers, such as students and in order to foster talent retention", "rating": 5, "pros": "Partner Bonus and flexibility. Camaraderie makes workplace an enjoyable environment.", "cons": "Poor management and outdated standards of practice.", "advice": "Promote from within and recognise the potential of part timers, such as students and in order to foster talent retention"}, {"title": "Good company, good values", "text": "Pros Strong core values that resonate throughout he whole business. Cons At the management level you will be paid for a 39 hours week but will be expected to work well into the 50-60 hour mark but potentially longer if you include travel time. Good managers are exploited to work extremely hard and take on a lot of responsibility whilst bad managers coast along seemingly without reprisal. Advice to Management Praise and recognise talent before it leaves and goes somewhere else. Remove stagnant managers. The company is a good one to work for.", "rating": 5, "pros": "Strong core values that resonate throughout he whole business.", "cons": "At the management level you will be paid for a 39 hours week but will be expected to work well into the 50-60 hour mark but potentially longer if you include travel time.", "advice": "Praise and recognise talent before it leaves and goes somewhere else. Remove stagnant managers. The company is a good one to work for."}, {"title": "Great Job", "text": "Pros Big bonus, Friendly coworkers, Flexible hours Cons Overtime is hard to come by when new", "rating": 5, "pros": "Big bonus, Friendly coworkers, Flexible hours", "cons": "Overtime is hard to come by when new", "advice": null}, {"title": "Night Staff", "text": "Pros Premium pay for night staff Lots of overtime available Cons Job role was very monotonous", "rating": 5, "pros": "Premium pay for night staff", "cons": "Job role was very monotonous", "advice": null}, {"title": "Job at Waitrose", "text": "Pros Safe, friendly, great values, dynamic Cons Honestly nothing to add here", "rating": 5, "pros": "Safe, friendly, great values, dynamic", "cons": "Honestly nothing to add here", "advice": null}, {"title": "Great", "text": "Pros Great environment, friendly working area Cons No real cons, thoroughly enjoyable", "rating": 5, "pros": "Great environment, friendly working area", "cons": "No real cons, thoroughly enjoyable", "advice": null}, {"title": "Fantastic", "text": "Pros Kind people, great benefits, good pay Cons Mundane tasks, got boring very quickly", "rating": 5, "pros": "Kind people, great benefits, good pay", "cons": "Mundane tasks, got boring very quickly", "advice": null}, {"title": "Sales Assistant", "text": "Pros Great teamwork and opportunity to try out roles in other departments Cons Time pressure of replenishing stock", "rating": 5, "pros": "Great teamwork and opportunity to try out roles in other departments", "cons": "Time pressure of replenishing stock", "advice": null}, {"title": "Waitrose employee", "text": "Pros Well paid and good benefits including annual bonus Cons Too many levels of management and quite bureaucratic Advice to Management Value and appreciate supporting staff", "rating": 5, "pros": "Well paid and good benefits including annual bonus", "cons": "Too many levels of management and quite bureaucratic", "advice": "Value and appreciate supporting staff"}, {"title": "Customer Service", "text": "Pros Good benefits and managers were friendly Cons Difficult to pick up extra shifts apart from at Christmas", "rating": 5, "pros": "Good benefits and managers were friendly", "cons": "Difficult to pick up extra shifts apart from at Christmas", "advice": null}, {"title": "Great manager", "text": "Pros Annual bonus, flexible hours, friendly environment Cons Limited opportunities for partners lower down in the chain to grow Advice to Management Recognise hard work", "rating": 5, "pros": "Annual bonus, flexible hours, friendly environment", "cons": "Limited opportunities for partners lower down in the chain to grow", "advice": "Recognise hard work"}, {"title": "good", "text": "Pros good bonus and friendly people Cons Working in retail can require you to work early hours and public holidays.", "rating": 5, "pros": "good bonus and friendly people", "cons": "Working in retail can require you to work early hours and public holidays.", "advice": null}, {"title": "Customer Service", "text": "Pros Friendly co-workers, good benefits and top quality products Cons Arrogant customers, inflexible hours and strict with holiday", "rating": 5, "pros": "Friendly co-workers, good benefits and top quality products", "cons": "Arrogant customers, inflexible hours and strict with holiday", "advice": null}, {"title": "Sales assistant", "text": "Pros Great benefits / JL discounts Cons Not much room for career development", "rating": 5, "pros": "Great benefits / JL discounts", "cons": "Not much room for career development", "advice": null}, {"title": "Supermarket assiant", "text": "Pros Good pay, friendly staff, bonus Cons Alot of hard work but very well looked after", "rating": 5, "pros": "Good pay, friendly staff, bonus", "cons": "Alot of hard work but very well looked after", "advice": null}, {"title": "Supermarket Asssitant", "text": "Pros Supportive, easy to work your way up, great benefits and bonus Cons Work can get stressful at busy times but the friendly atmosphere always helps", "rating": 5, "pros": "Supportive, easy to work your way up, great benefits and bonus", "cons": "Work can get stressful at busy times but the friendly atmosphere always helps", "advice": null}, {"title": "Better than other supermarket chains", "text": "Pros Well paid for a supermarket job Good bonuses Cons No big downsides that I can think of", "rating": 5, "pros": "Well paid for a supermarket job", "cons": "No big downsides that I can think of", "advice": null}, {"title": "Supermarket", "text": "Pros Partner Discount is the only best part Cons Odd hours ( No fixed shifts) Advice to Management All are herd of a sheep", "rating": 3, "pros": "Partner Discount is the only best part", "cons": "Odd hours ( No fixed shifts)", "advice": "All are herd of a sheep"}, {"title": "Supermarket Assistant", "text": "Pros The managers are very open with communication and aren't constantly breathing down your neck to get work done. There is some level of independence when working as a partner and Waitrose allows you to handle situations cases by case. Cons The pay rate is lower than other super market chains and specifically in my store there are just not enough employees to handle tasks. Advice to Management Hire more employees", "rating": 5, "pros": "The managers are very open with communication and aren't constantly breathing down your neck to get work done. There is some level of independence when working as a partner and Waitrose allows you to handle situations cases by case.", "cons": "The pay rate is lower than other super market chains and specifically in my store there are just not enough employees to handle tasks.", "advice": "Hire more employees"}, {"title": "Part time assistant", "text": "Pros JLP discount was very useful Competitive salary Cons Lack of extra shifts, predominantly on sundays", "rating": 5, "pros": "JLP discount was very useful", "cons": "Lack of extra shifts, predominantly on sundays", "advice": null}, {"title": "Cashier", "text": "Pros Able to block some shifts Cons Given on the job training", "rating": 5, "pros": "Able to block some shifts", "cons": "Given on the job training", "advice": null}, {"title": "Customer Services", "text": "Pros Good pay for students Some nice staff Cons Senior management issues Sometimes staff constrained Advice to Management Listen to those who have to actually carry out the jobs...", "rating": 5, "pros": "Good pay for students", "cons": "Senior management issues", "advice": "Listen to those who have to actually carry out the jobs..."}, {"title": "Supermarket assistant", "text": "Pros Good pay Nice environment Nice staff Good bonus Cons Long hours Management annoying Hard to move up Advice to Management Good job keep it up", "rating": 5, "pros": "Good pay", "cons": "Long hours", "advice": "Good job keep it up"}, {"title": "Great for at school", "text": "Pros Nice staff, good pay, bonus Cons Some senior management a bit up themselves", "rating": 5, "pros": "Nice staff, good pay, bonus", "cons": "Some senior management a bit up themselves", "advice": null}, {"title": "Supermarket assistant", "text": "Pros Good pay Good management Good for students Cons It's a job in retail. It has its flaws. But it's a job in retail what do you expect?", "rating": 5, "pros": "Good pay", "cons": "It's a job in retail. It has its flaws. But it's a job in retail what do you expect?", "advice": null}, {"title": "Not as good as reputation perceives", "text": "Pros Good pay, discounts and benefits are good, Good opportunity’s to get overtime Good company to work for Most customers and stores are nice Cons Being under 20 I feel that the management really push you and put too much stress on you. Also human mistakes are not well expected, I work in reductions and have occasionally missed a few on the products, this ‘mistake’ resulted in me getting disciplinary action which is ridiculous considering that it has been no more than £10 missed... Also as well a huge lack of staff in my store there is a lack of managers that actually understand how reductions, I am often running my department on a Saturday evening as the other managers haven’t got a clue what they’re doing! I am doing this on under £8 per hour and have requested a pay rise but said that I don’t have enough responsibility for it.... Advice to Management Employ more people, 30+ more per branch Get rid of modern Waitrose More trained full time staff Train managers and senior staff about mental health in young employees", "rating": 3, "pros": "Good pay, discounts and benefits are good,", "cons": "Being under 20 I feel that the management really push you and put too much stress on you.", "advice": "Employ more people, 30+ more per branch"}, {"title": "my experiences in retail", "text": "Pros good staff working conditions. good prospects Cons none that I can think off", "rating": 5, "pros": "good staff working conditions. good prospects", "cons": "none that I can think off", "advice": null}, {"title": "Good place to work for students", "text": "Pros -Bonus - Friendly colleagues - Opportunity for overtime Cons - Routinely understaffed - Too many managers", "rating": 5, "pros": "-Bonus", "cons": "- Routinely understaffed", "advice": null}, {"title": "Positive Experience, especially for young people", "text": "Pros Very good pay, sociable and friendly work environment. Cons Not overly flexible on time off", "rating": 5, "pros": "Very good pay, sociable and friendly work environment.", "cons": "Not overly flexible on time off", "advice": null}, {"title": "Customer Assistant", "text": "Pros The Pay is good and most partners are friendly attempting to give the best service they can Cons Management. The Management at Waitrose is pretty awful. Some Managers are on top of it but mostly are not and just lazy. If you want a day off paid as a student, good luck getting. Advice to Management Don't treat your student workers like you can wipe them away - actually listen to them (we like working there and enjoy the business and want the best for our branch) We need days off too.", "rating": 3, "pros": "The Pay is good and most partners are friendly attempting to give the best service they can", "cons": "Management. The Management at Waitrose is pretty awful. Some Managers are on top of it but mostly are not and just lazy. If you want a day off paid as a student, good luck getting.", "advice": "Don't treat your student workers like you can wipe them away - actually listen to them (we like working there and enjoy the business and want the best for our branch) We need days off too."}, {"title": "Not the best but not the worst", "text": "Pros - Good pay - Good benefits (such as pension scheme, holiday pay, annual bonuses, discounts on Waitrose & John Lewis, etc.) - Well established - Flexible - Nice working environment Cons - Staff can be unfriendly or condescending to new staff - Customers tend to be upper-middle class and supercilious as a result - Poor micromanagement", "rating": 3, "pros": "- Good pay", "cons": "- Staff can be unfriendly or condescending to new staff", "advice": null}, {"title": "No support for part time staff", "text": "Pros Ticket subsidies, John Lewis discount, trips Cons Will offer opportunities to newer staff if they have more flexibility during the week. Staff at other stores are rude. Managers can be rude Advice to Management Reward all hard workers", "rating": 3, "pros": "Ticket subsidies, John Lewis discount, trips", "cons": "Will offer opportunities to newer staff if they have more flexibility during the week. Staff at other stores are rude. Managers can be rude", "advice": "Reward all hard workers"}, {"title": "Supermarket Assistant (Operations)", "text": "Pros Good insight into the logistics of working for a nation-wide company (a position I held as a student) Cons Poor management and too much work for a job that only paid minimum. Advice to Management Stop worrying less about where you are on the leaderboard of stores and start caring about the staff more", "rating": 3, "pros": "Good insight into the logistics of working for a nation-wide company (a position I held as a student)", "cons": "Poor management and too much work for a job that only paid minimum.", "advice": "Stop worrying less about where you are on the leaderboard of stores and start caring about the staff more"}, {"title": "Counters", "text": "Pros Pleasant people - staff and customers alike. Cons Poor organisation by members of management. Advice to Management Plan rotas in advance.", "rating": 5, "pros": "Pleasant people - staff and customers alike.", "cons": "Poor organisation by members of management.", "advice": "Plan rotas in advance."}, {"title": "Working at Waitrose", "text": "Pros They value their employees to the maximun Cons Not enough consideration for time off of working, especially when considering outside commitments.", "rating": 3, "pros": "They value their employees to the maximun", "cons": "Not enough consideration for time off of working, especially when considering outside commitments.", "advice": null}, {"title": "Good pay", "text": "Pros Good pay and bonuses and they care about the staff, Cons Some management staff can be patronising", "rating": 5, "pros": "Good pay and bonuses and they care about the staff,", "cons": "Some management staff can be patronising", "advice": null}, {"title": "Good place to work", "text": "Pros Nice place to work, good work ethics, loads of overtime Cons Managers are biased, and expect you to do alot without being trained Advice to Management Train us on tasks so we are more versatile", "rating": 5, "pros": "Nice place to work, good work ethics, loads of overtime", "cons": "Managers are biased, and expect you to do alot without being trained", "advice": "Train us on tasks so we are more versatile"}, {"title": "Part time job at Waitrose", "text": "Pros The shifts that I would be working on usually had a low average age so you were working around people your age. I feel this made the shift more enjoyable as you could have more of a laugh and time would pass faster. Cons Heavily under staffed pretty much every shift, resulting in almost zero job satisfaction as every task had to be rushed and things would get missed out. Advice to Management I feel that the management interfered with the day to day jobs too much. You knew exactly what you had to get done and how you were going to do it but a manger who hasn't done the job for 10-20 years thinks they know better.", "rating": 3, "pros": "The shifts that I would be working on usually had a low average age so you were working around people your age. I feel this made the shift more enjoyable as you could have more of a laugh and time would pass faster.", "cons": "Heavily under staffed pretty much every shift, resulting in almost zero job satisfaction as every task had to be rushed and things would get missed out.", "advice": "I feel that the management interfered with the day to day jobs too much. You knew exactly what you had to get done and how you were going to do it but a manger who hasn't done the job for 10-20 years thinks they know better."}, {"title": "Working at southbank", "text": "Pros Hours , team and location Cons Small store, work not clearly shown Advice to Management Need to be a bit more organised", "rating": 5, "pros": "Hours , team and location", "cons": "Small store, work not clearly shown", "advice": "Need to be a bit more organised"}, {"title": "Cafe Assistant", "text": "Pros Good pay, friendly team and understanding management to personal needs. Cons Cafe was always extremely busy so work was always hard. Advice to Management Hire more members for busy roles", "rating": 5, "pros": "Good pay, friendly team and understanding management to personal needs.", "cons": "Cafe was always extremely busy so work was always hard.", "advice": "Hire more members for busy roles"}, {"title": "Not what it used to be...", "text": "Pros Great benefits Fantastic partner discount Cons Not as accommodating as they used to be Head office do not take into account how they affect stores when they make decisions Management tend to unnecessarily micromanage Advice to Management Acknowledge hard work Stop micromanaging", "rating": 3, "pros": "Great benefits", "cons": "Not as accommodating as they used to be", "advice": "Acknowledge hard work"}, {"title": "Very Good", "text": "Pros Excellent Benefits PartnerVoice scheme works well for suggestions Pay is good for part time Management are flexible and approachable Cons Discount is not great within the company Price of some products is crazy Some working practises are old hat Some branch systems are out of date", "rating": 5, "pros": "Excellent Benefits", "cons": "Discount is not great within the company", "advice": null}, {"title": "Fantastic working environment", "text": "Pros Great bonuses, very friendly working environment with lots of bonuses to do and sufficient training, and well paid for the job! Cons Senior managers can be clueless, and there aren't many opportunities to take initiative", "rating": 5, "pros": "Great bonuses, very friendly working environment with lots of bonuses to do and sufficient training, and well paid for the job!", "cons": "Senior managers can be clueless, and there aren't many opportunities to take initiative", "advice": null}, {"title": "Waitrose part time employee", "text": "Pros Loads of overtime opportunities, supportive teams Cons Long unpaid breaks and heavy workload", "rating": 3, "pros": "Loads of overtime opportunities, supportive teams", "cons": "Long unpaid breaks and heavy workload", "advice": null}, {"title": "Nice part time job", "text": "Pros They have great benefits - give you shares/bonuses etc even when you are part-time. Opportunities for more hours if you want but they do not push you to do them. Cons Could tell they had favourite members of staff. Gave you work which couldn't be completed in your shift. Advice to Management Don't be so harsh to some people", "rating": 5, "pros": "They have great benefits - give you shares/bonuses etc even when you are part-time.", "cons": "Could tell they had favourite members of staff.", "advice": "Don't be so harsh to some people"}, {"title": "Operations", "text": "Pros Great bonus scheme Professionalism Partner status Reputable company Cons Work can be tedious Customers IT training is repetitive and unhelpful Advice to Management Listen to partners mroe", "rating": 5, "pros": "Great bonus scheme", "cons": "Work can be tedious", "advice": "Listen to partners mroe"}, {"title": "Excellent employer", "text": "Pros Good pay, fair bosses, lots of benefits Cons None to note, maybe more work diversification Advice to Management None", "rating": 5, "pros": "Good pay, fair bosses, lots of benefits", "cons": "None to note, maybe more work diversification", "advice": "None"}, {"title": "Great part time work", "text": "Pros Great benefits, really good bonus, generally a nice employer Cons Management can be iffy, but that's the same with every company Advice to Management If you're leading a shift, chip in with the work and give the staff a hand when it's a tough shift.", "rating": 5, "pros": "Great benefits, really good bonus, generally a nice employer", "cons": "Management can be iffy, but that's the same with every company", "advice": "If you're leading a shift, chip in with the work and give the staff a hand when it's a tough shift."}, {"title": "Was good, now appalling...", "text": "Pros Its warm and dry (unless you're working in the freezer, chillers, behind meat and fish/deli counters or out in 'the yard'. Food in the dining room/canteen is subsidised. Senior management are skilled but hampered by inept 'middle managers'. Cons Discount is not great considering the price of the food No union representation Poor rate of pay compared to other retail jobs (used to rely on the annual bonus to make it up - that bonus has been declining rapidly - this year chances are it will be between 0 and 3%) Pension fund is in a shambles Whole business being propped up by John Lewis sales They now expect you to do five jobs in the time given for one Section managers generally appear to have little training in leadership or management before being given an ipad, an air of authority and a total disregard for the welfare of their staff. They're implementing 'modern Waitrose' whereby you just keep getting pulled from doing a job on one section to do a job on another (whether you're trained or not) because the section managers can't plan. You then return to your original job (eventually) to find yourself getting a telling off for not having done it quickly enough (or at all). One branch rota. There isn't space for me to tell you all that's bad about that! Suffice to say, its not working. To save money they don't recruit until people leave (school age heading to Uni - happens every year at the same time and they know it does) so you end up short staffed, underpaid and overworked. Turnover is 80% plus in an industry where the average is 33% - and they wonder why? Advice to Management Review the selection process and training for Section Managers - many don't have a clue, are floundering and you can't advise them because they 'know it all' and you're just a 'supermarket assistant'. Most couldnt lead a dog let alone a team.", "rating": 3, "pros": "Its warm and dry (unless you're working in the freezer, chillers, behind meat and fish/deli counters or out in 'the yard'.", "cons": "Discount is not great considering the price of the food", "advice": "Review the selection process and training for Section Managers - many don't have a clue, are floundering and you can't advise them because they 'know it all' and you're just a 'supermarket assistant'. Most couldnt lead a dog let alone a team."}, {"title": "Supermarket Assistant", "text": "Pros 15% discount after 3 months of employment. Cons Low wage with hard work. Advice to Management Correct the wage when applying on the site, When I applied it said I was too get £9.21 hourly. But when I started they told me it wasn't correct it was actually £7.60 hell of a difference too what it was advising. I wouldn't of left my job if it was that low. I worked in Eldon Square, Newcastle store. Whilst interviewing the person, you should mention too them that Waitrose has no staff parking and that the cheapest parking is eldon gardens at £120 month. I was furious at this as I wasn't getting much money too begin with.", "rating": 3, "pros": "15% discount after 3 months of employment.", "cons": "Low wage with hard work.", "advice": "Correct the wage when applying on the site, When I applied it said I was too get £9.21 hourly. But when I started they told me it wasn't correct it was actually £7.60 hell of a difference too what it was advising. I wouldn't of left my job if it was that low."}, {"title": "Great place to start work", "text": "Pros Good bonus Looks great on CV Instill great values Cons Very few, good place to work", "rating": 5, "pros": "Good bonus", "cons": "Very few, good place to work", "advice": null}, {"title": "Good job to accompany studies", "text": "Pros Decent pay for an under 18y/o, lovely colleagues and a great bonus in March due to the partnership structure of the company. Cons Holiday is a little inflexible - you have to decide at the beginning of each tax year when you want time off over the next 12 months Advice to Management Maybe be a little more flexible regarding shift-swapping as it would ease up the pressure of having to decide on holiday dates for the whole year", "rating": 5, "pros": "Decent pay for an under 18y/o, lovely colleagues and a great bonus in March due to the partnership structure of the company.", "cons": "Holiday is a little inflexible - you have to decide at the beginning of each tax year when you want time off over the next 12 months", "advice": "Maybe be a little more flexible regarding shift-swapping as it would ease up the pressure of having to decide on holiday dates for the whole year"}, {"title": "Cafe Assistant", "text": "Pros Friendly team and enjoyable work Cons Could get quite busy at times.", "rating": 5, "pros": "Friendly team and enjoyable work", "cons": "Could get quite busy at times.", "advice": null}, {"title": "Good hours. Poor Management", "text": "Pros - Overtime available - Extra Pay on Sunday - Friendly Staff Cons - Poor Management - Understaffed and the newspaper duty may be very difficult", "rating": 3, "pros": "- Overtime available", "cons": "- Poor Management", "advice": null}, {"title": "Supermarket Assistant", "text": "Pros - Bonus -part time - good pay -young workers -overtime Cons - managers can be difficult - company is changing, making cuts on wages, bonus etc", "rating": 5, "pros": "- Bonus", "cons": "- managers can be difficult", "advice": null}, {"title": "more job satisfaction when you are a partner", "text": "Pros Waitrose was a lovely company to work for i got a great bonus and half price festival tickets and training oportunities great customer service reputation Cons awful uniform! the regulations on personal appearance were to much. I was told off for wearing white socks", "rating": 5, "pros": "Waitrose was a lovely company to work for", "cons": "awful uniform!", "advice": null}, {"title": "Supermarket Assistant", "text": "Pros Good Pay and Benefits Yearly bonus Cons Poor Management Unrealistic expectations Poor treatment for younger workers", "rating": 3, "pros": "Good Pay and Benefits", "cons": "Poor Management", "advice": null}, {"title": "Team Leader-Hospitality", "text": "Pros Bonus share, good work life balance, living wage and pension scheme. Cons Poor management structure (branch specific) no real accountability with higher management and they do not share best practice to develop the brand further, irregardless of experience.", "rating": 5, "pros": "Bonus share, good work life balance, living wage and pension scheme.", "cons": "Poor management structure (branch specific) no real accountability with higher management and they do not share best practice to develop the brand further, irregardless of experience.", "advice": null}, {"title": "practically perfect in every way", "text": "Pros Really look after you amazing benefits (12.5% john lewis and 15% i think for waitrose) Cons hours are longer in you work in a shopping centre over christmas can be hard to get time off sometimes as you need people to cover your shift if there is staf shortage Advice to Management keep up the good work", "rating": 5, "pros": "Really look after you", "cons": "hours are longer in you work in a shopping centre over christmas", "advice": "keep up the good work"}, {"title": "Great job", "text": "Pros Friendly atmosphere Good pay Mostly nice managers Cons Long hours Short breaks Sometimes boring as the jobs are repeated", "rating": 5, "pros": "Friendly atmosphere", "cons": "Long hours", "advice": null}, {"title": "Team manager", "text": "Pros Treated with respect Good work/life balance for retail Good pension and benefits inc discount and subsidised tickets, etc Real sense of team spirit at work Profit sharing bonus Cons Not a lot of opportunity to move up in the company at the mo due to the axing of many department manager jobs, meaning many are stepping down to team manager or equivalent roles and any new department manager jobs that do come up are snapped up by those who lost their old role. Bonus - not been great for a few years, reflecting the food retail industry's current state of affairs.", "rating": 3, "pros": "Treated with respect", "cons": "Not a lot of opportunity to move up in the company at the mo due to the axing of many department manager jobs, meaning many are stepping down to team manager or equivalent roles and any new department manager jobs that do come up are snapped up by those who lost their old role.", "advice": null}, {"title": "Boutique Manager", "text": "Pros Great Hours and lovely boutique to work in. The Head Office team are amazing and have helped me progress so much over the last year. Cons It does involve working weekends and the commission is very low as well as the salary.", "rating": 5, "pros": "Great Hours and lovely boutique to work in. The Head Office team are amazing and have helped me progress so much over the last year.", "cons": "It does involve working weekends and the commission is very low as well as the salary.", "advice": null}, {"title": "Shop floor assistant", "text": "Pros Good discount with other benefits and opportunity for over time hours Cons Poor management style - micromanaged frequently with a rigid and outdated style from shop floor managers Advice to Management Be more open to advice from shop floor workers on how to dynamically adapt to customer preferences, they are the closest to the customers and their issues", "rating": 3, "pros": "Good discount with other benefits and opportunity for over time hours", "cons": "Poor management style - micromanaged frequently with a rigid and outdated style from shop floor managers", "advice": "Be more open to advice from shop floor workers on how to dynamically adapt to customer preferences, they are the closest to the customers and their issues"}, {"title": "Waitrose supermarket assistant", "text": "Pros Good pay Good benefits Nice environment Cons Management lacking Cross training sub standard", "rating": 5, "pros": "Good pay", "cons": "Management lacking", "advice": null}, {"title": "Great Company to work for", "text": "Pros -Strong Teamwork ethic -Variety to work in different areas of the shop Cons -Not very flexible with holiday -Sometimes a lack of communication", "rating": 5, "pros": "-Strong Teamwork ethic", "cons": "-Not very flexible with holiday", "advice": null}, {"title": "Absolutely perfect company to work for", "text": "Pros They include everyone in company decisions Cons I cant think of any downsides", "rating": 5, "pros": "They include everyone in company decisions", "cons": "I cant think of any downsides", "advice": null}, {"title": "Waitrose Welwyn Garden City", "text": "Pros Good Pay Discount Card Flexible Hours waitrose is a good employer with lots and lots of benefits would definitely recommend Cons it is a very physically demanding job management is not very understanding of school work and keeps pushing for extra hours Advice to Management management is not very understanding of school work and keeps pushing for extra hours  a a a a a a a a a a a", "rating": 5, "pros": "Good Pay", "cons": "it is a very physically demanding job", "advice": "management is not very understanding of school work and keeps pushing for extra hours"}, {"title": "Supermarket Assitant", "text": "Pros They train and treat you so well. Great discounts and opportunities within your role. Cons Couldn't fault my job at all", "rating": 5, "pros": "They train and treat you so well. Great discounts and opportunities within your role.", "cons": "Couldn't fault my job at all", "advice": null}, {"title": "Poor management", "text": "Pros Staff discount Overtime Customers are polite well to do people. Cons Rude managers Managers have favourites Managers is a private school elite sniffing Coke is the norm in the office. Often bullied by other co workers Advice to Management Fix up", "rating": 1, "pros": "Staff discount", "cons": "Rude managers", "advice": "Fix up"}, {"title": "Great Company", "text": "Pros A very fair workplace and clear goals. Cons Very few to thing of.", "rating": 5, "pros": "A very fair workplace and clear goals.", "cons": "Very few to thing of.", "advice": null}, {"title": "Interview in food sales department", "text": "Pros First a group assessment which made you feel relaxed followed by one to one which asked you about situation you have had in your life contacted to work or outside of work, I was made to feel very comfortable and found it very easy to talk to the interviewer, there is a friendly feel from all the staff you meet which helps you from the moment you walk in. Cons I did not really see anything that was wrong maybe access to water as we all got there very early and not everyone brought a water bottle I did.", "rating": 5, "pros": "First a group assessment which made you feel relaxed followed by one to one which asked you about situation you have had in your life contacted to work or outside of work, I was made to feel very comfortable and found it very easy to talk to the interviewer, there is a friendly feel from all the staff you meet which helps you from the moment you walk in.", "cons": "I did not really see anything that was wrong maybe access to water as we all got there very early and not everyone brought a water bottle I did.", "advice": null}, {"title": "Great company -Negative changes for <21 hour employees", "text": "Pros Employee Benefits + Company Culture/Values Cons Inflexible working + Awkward holidays Advice to Management Stop making it harder for students to work around their studies, increase flexibility with holidays and shift swapping. Recent management structure changes seem to have made career opportunities much harder to achieve too. Understandably the company needs to become more competitive and these changes have been made in spite of this, but not ideal for some staff and is pushing away a lot of the key workforce with other commitments,", "rating": 3, "pros": "Employee Benefits + Company Culture/Values", "cons": "Inflexible working + Awkward holidays", "advice": "Stop making it harder for students to work around their studies, increase flexibility with holidays and shift swapping."}, {"title": "Solid Company", "text": "Pros Friendly staff. Flexible with hours if needed. Good rate of pay. Cons Understaffed, meaning there is often a large backlog of jobs that haven't been done. Advice to Management Hire more staff on longer contracts.", "rating": 3, "pros": "Friendly staff.", "cons": "Understaffed, meaning there is often a large backlog of jobs that haven't been done.", "advice": "Hire more staff on longer contracts."}]