[{"title": "Actuarial Analyst", "text": "Pros Value career growth as well as personal growth Cons March to October is quite busy", "rating": 5, "pros": "Value career growth as well as personal growth", "cons": "March to October is quite busy", "advice": null}, {"title": "First-year", "text": "Pros Our team is very flexible and willing to help me learn throughout my experience here. Cons I have experienced no cons.", "rating": 5, "pros": "Our team is very flexible and willing to help me learn throughout my experience here.", "cons": "I have experienced no cons.", "advice": null}, {"title": "Review", "text": "Pros Strong health and retirement package Cons Lack of leadership visibility into many of the businesses, especially Talent", "rating": 5, "pros": "Strong health and retirement package", "cons": "Lack of leadership visibility into many of the businesses, especially Talent", "advice": null}, {"title": "permanent positions are slim", "text": "Pros good benefits and time off Cons chaotic at times and unorganized", "rating": 3, "pros": "good benefits and time off", "cons": "chaotic at times and unorganized", "advice": null}, {"title": "Consultant", "text": "Pros Relaxed office attitude and flexible work schedules. Company will always have offices in major cities. Cons Poor review process/structure. Big company so exposure to higher management is difficult.", "rating": 5, "pros": "Relaxed office attitude and flexible work schedules. Company will always have offices in major cities.", "cons": "Poor review process/structure. Big company so exposure to higher management is difficult.", "advice": null}, {"title": "One Exchange", "text": "Pros A great reason to work at One Exchange is the opportunity to assist retirees of large corporations to select and secure individual Medicare supplement coverage to fit their situations, needs and budgets, when their employer of so many years decides to not offer direct retirement health benefits going forward. Cons IMO, Workgroup assignments (to supervisors) are random, and some supervisors are ill-equipped to act/perform like leaders. Promotions are apparently based on prior year production rather than possession of or training in people management skills. Also, at end of enrollment season, a large percentage of employees are laid of, while top producers are retained in the off-season. Worker discipline is strict and too many occurrences will get an employee walked to the exit. Advice to Management Implement some kind of process improvement system, so employees can contribute to a better work environment; teach supervisors to treat all employees like valued assets.", "rating": 3, "pros": "A great reason to work at One Exchange is the opportunity to assist retirees of large corporations to select and secure individual Medicare supplement coverage to fit their situations, needs and budgets, when their employer of so many years decides to not offer direct retirement health benefits going forward.", "cons": "IMO, Workgroup assignments (to supervisors) are random, and some supervisors are ill-equipped to act/perform like leaders. Promotions are apparently based on prior year production rather than possession of or training in people management skills.", "advice": "Implement some kind of process improvement system, so employees can contribute to a better work environment; teach supervisors to treat all employees like valued assets."}, {"title": "Advisory Lead, Knowledge Management", "text": "Pros Flexible work schedule, 401K match, great colleagues. Cons Difficult merger - lack of future-state planning.", "rating": 3, "pros": "Flexible work schedule, 401K match, great colleagues.", "cons": "Difficult merger - lack of future-state planning.", "advice": null}, {"title": "Be Careful", "text": "Pros Initial compensation for new hires is good to excellent. There is a strong flexible work arrangement for many locations, where you can work from home some days, and then be in the office other days, ideal for working parents. Cons Normal bonus and salary progression doesn't meet rate of inflation for most non-managerial positions. The company is, at best, unconcerned for retaining employees. Advice to Management Invest more into your career employees instead of consultants, share buybacks, and Senior Leadership compensation. You have lost many long-term employees over the past several years, and you can expect to lose many more this year.", "rating": 3, "pros": "Initial compensation for new hires is good to excellent. There is a strong flexible work arrangement for many locations, where you can work from home some days, and then be in the office other days, ideal for working parents.", "cons": "Normal bonus and salary progression doesn't meet rate of inflation for most non-managerial positions. The company is, at best, unconcerned for retaining employees.", "advice": "Invest more into your career employees instead of consultants, share buybacks, and Senior Leadership compensation. You have lost many long-term employees over the past several years, and you can expect to lose many more this year."}, {"title": "Consultant", "text": "Pros -Work/life flexibility. Accommodating if you need to work from home or need to take care of personal things that come up (child care, doctor appointment, etc.) -People are friendly and smart. The brightest consultants in the industry Cons -Pay is not very competitive for the hours expected to work -Lack of training as you grow - Work is not equally distributed among teams Advice to Management Take action on the feedback provided in the all employee engagement surveys. Practice what you preach - implement the ideas and solutions that you sell to your clients. The Willis merger is creating challenges on certain teams; need to do a better job of integrating legacy colleagues and harmonizing processes", "rating": 3, "pros": "-Work/life flexibility. Accommodating if you need to work from home or need to take care of personal things that come up (child care, doctor appointment, etc.)", "cons": "-Pay is not very competitive for the hours expected to work", "advice": "Take action on the feedback provided in the all employee engagement surveys. Practice what you preach - implement the ideas and solutions that you sell to your clients. The Willis merger is creating challenges on certain teams; need to do a better job of integrating legacy colleagues and harmonizing processes"}, {"title": "All about the numbers", "text": "Pros Smart, professional colleagues focused on client service Cons Though professing interest in employees, the only thing that really matters is the numbers. You can be a bad actor, but if you make money, you're okay.", "rating": 3, "pros": "Smart, professional colleagues focused on client service", "cons": "Though professing interest in employees, the only thing that really matters is the numbers. You can be a bad actor, but if you make money, you're okay.", "advice": null}, {"title": "Vice President", "text": "Pros Able to work from home; great clients and colleagues; autonomy; good pay and benefits Cons At times, it still feels as if Willis and Towers Watson are two separate companies Advice to Management Continue to work towards an integrated company", "rating": 5, "pros": "Able to work from home; great clients and colleagues; autonomy; good pay and benefits", "cons": "At times, it still feels as if Willis and Towers Watson are two separate companies", "advice": "Continue to work towards an integrated company"}, {"title": "Quality Assurance Specialist", "text": "Pros Satisfying work, plenty of opportunity to grow skills. Cons Long hours Limited room for professional growth", "rating": 5, "pros": "Satisfying work, plenty of opportunity to grow skills.", "cons": "Long hours Limited room for professional growth", "advice": null}, {"title": "Analyst", "text": "Pros -Casual Dress -can work from home sometimes -flexible schedule Cons -Paying for Parking -low pay -LOTS of people who slide under the radar and don't work at all, while everyone else picks up the workload. If you work hard, you're given more work, if you don't, you just keep sliding. -lack of professionalism -no advancement based on merit, only based on tenure. -boring work -a lot of turnover -outdated processes (I.e. Using word docs as \"procedures\") Advice to Management Adopt a more professional atmosphere. Interview for advancement and make it employee driven rather than driven by a manager that fights for you via hearsay. Pay attention to and get rid of those that don't work. You will never maintain good talent if you don't.", "rating": 3, "pros": "-Casual Dress", "cons": "-Paying for Parking", "advice": "Adopt a more professional atmosphere. Interview for advancement and make it employee driven rather than driven by a manager that fights for you via hearsay."}, {"title": "Laid Back Professionals", "text": "Pros A beautiful view in the Seattle office. Casual dress code (no holes in jeans) Managers and admins have good overall relationships. Team culture, no micro-managing. Salary and benefits are fair. Opportunity to grow within the LOB or in another LOB. Cons Definitely need to take, bus, train or light rail. No parking.", "rating": 5, "pros": "A beautiful view in the Seattle office. Casual dress code (no holes in jeans) Managers and admins have good overall relationships. Team culture, no micro-managing. Salary and benefits are fair. Opportunity to grow within the LOB or in another LOB.", "cons": "Definitely need to take, bus, train or light rail. No parking.", "advice": null}, {"title": "This was not a merger of equals. Don't kid yourself legacy Towers Watson calls the shots.", "text": "Pros More resources and potential for stronger brand recognition. Cons Perception is reality regardless of intent. Legacy Towers Watson leadership runs the company and have been appointed in most leadership roles for Health and Benefits. At the time of the merger LTW leadership conveyed the message they had tried to enter the middle market before the Willis and TW merger, but failed. We wonder if history is repeating itself. Over the past two years since the merger, many talented legacy Willis employees have left, including those in key leadership positions. Morale is not where it could be given the potential strength of this merger, instead employees are wondering when the other shoe will drop. The perception (fair or not) is hubris and arrogance of the current leadership is creating a pathway for more legacy Willis employees to leave. Maybe this is what leadership wants. The general consensus is legacy WIllis employees do not feel valued or appreciated, with many questioning their future, and feeling they will be forced out. We wonder is this the culture the company intended to create? If so, they're succeeding. Advice to Management The company preaches employees are their most valuable asset. Practice what you preach with all employees, not just legacy Towers Watson employees.", "rating": 1, "pros": "More resources and potential for stronger brand recognition.", "cons": "Perception is reality regardless of intent. Legacy Towers Watson leadership runs the company and have been appointed in most leadership roles for Health and Benefits. At the time of the merger LTW leadership conveyed the message they had tried to enter the middle market before the Willis and TW merger, but failed. We wonder if history is repeating itself. Over the past two years since the merger, many talented legacy Willis employees have left, including those in key leadership positions. Morale is not where it could be given the potential strength of this merger, instead employees are wondering when the other shoe will drop. The perception (fair or not) is hubris and arrogance of the current leadership is creating a pathway for more legacy Willis employees to leave. Maybe this is what leadership wants. The general consensus is legacy WIllis employees do not feel valued or appreciated, with many questioning their future, and feeling they will be forced out. We wonder is this the culture the company intended to create? If so, they're succeeding.", "advice": "The company preaches employees are their most valuable asset. Practice what you preach with all employees, not just legacy Towers Watson employees."}, {"title": "Senior Analyst / Consultant", "text": "Pros - Good resource and training program - The company tries to be innovative by organizing various surveys - Flexible schedule Cons - Long work hours - Limited support on actuarial exams, majority of the analysts give up on continuing with exams; besides a bonus, passing exams won't help with promotion - A handful of manipulative people in the leadership team, intoxicating the work environment and making it political - low retention", "rating": 3, "pros": "- Good resource and training program", "cons": "- Long work hours", "advice": null}, {"title": "Senior Consultant", "text": "Pros Growth opportunity Great benefits Pension plan Great reputation Cons Stress Large organization; get lost in the shuffle", "rating": 5, "pros": "Growth opportunity", "cons": "Stress", "advice": null}, {"title": "Customer Service Representative", "text": "Pros Benefits package is great and there are plenty of opportunities for career advancement. Cons As with any customer service job, dealing with certain clients or customers can be stressful.", "rating": 5, "pros": "Benefits package is great and there are plenty of opportunities for career advancement.", "cons": "As with any customer service job, dealing with certain clients or customers can be stressful.", "advice": null}, {"title": "Customer Service Representative", "text": "Pros Good opportunity for growth, no need for experience to get hired there, very personable management. Cons Pay is decent, can be stressful at times.", "rating": 3, "pros": "Good opportunity for growth, no need for experience to get hired there, very personable management.", "cons": "Pay is decent, can be stressful at times.", "advice": null}, {"title": "Actuarial Analyst", "text": "Pros Lots of opportunities, intelligent and driven coworkers, team atmosphere, fast paced, client facing experience, fast knowledge growth, flat level structure, study program Cons Long hours frequently, 55+ hour weeks during busy season, can be stressful, quick turnarounds to meet client needs, competitive enviornment, very high standards Advice to Management Hire more junior associates to avoid high turnover early on in careers", "rating": 3, "pros": "Lots of opportunities, intelligent and driven coworkers, team atmosphere, fast paced, client facing experience, fast knowledge growth, flat level structure, study program", "cons": "Long hours frequently, 55+ hour weeks during busy season, can be stressful, quick turnarounds to meet client needs, competitive enviornment, very high standards", "advice": "Hire more junior associates to avoid high turnover early on in careers"}, {"title": "Customer Service Representative", "text": "Pros Good opportunity for growth, no need for experience to get hired there, very personable management. Cons Pay is decent, can be stressful at times.", "rating": 3, "pros": "Good opportunity for growth, no need for experience to get hired there, very personable management.", "cons": "Pay is decent, can be stressful at times.", "advice": null}, {"title": "Actuarial Analyst", "text": "Pros Lots of opportunities, intelligent and driven coworkers, team atmosphere, fast paced, client facing experience, fast knowledge growth, flat level structure, study program Cons Long hours frequently, 55+ hour weeks during busy season, can be stressful, quick turnarounds to meet client needs, competitive enviornment, very high standards Advice to Management Hire more junior associates to avoid high turnover early on in careers", "rating": 3, "pros": "Lots of opportunities, intelligent and driven coworkers, team atmosphere, fast paced, client facing experience, fast knowledge growth, flat level structure, study program", "cons": "Long hours frequently, 55+ hour weeks during busy season, can be stressful, quick turnarounds to meet client needs, competitive enviornment, very high standards", "advice": "Hire more junior associates to avoid high turnover early on in careers"}, {"title": "Making Strides", "text": "Pros Talented, dedicated local associates are supported by solid industry resources. Cons Continuous initiatives focus their best brokers inwardly. Client work and face time with clients suffers. Advice to Management Hire the best and let them do what they do best. Go easy on introducing new initiatives. Too many initiatives leads to inward focus and lost clients, which leads to poor morale.", "rating": 3, "pros": "Talented, dedicated local associates are supported by solid industry resources.", "cons": "Continuous initiatives focus their best brokers inwardly. Client work and face time with clients suffers.", "advice": "Hire the best and let them do what they do best. Go easy on introducing new initiatives. Too many initiatives leads to inward focus and lost clients, which leads to poor morale."}, {"title": "Account Manager - National Accounts/Casualty", "text": "Pros Great opportunities for advancement Great Mentorship program Loyal to its employees Cons Big corporation where sometimes you may feel lost in the shuffle", "rating": 5, "pros": "Great opportunities for advancement", "cons": "Big corporation where sometimes you may feel lost in the shuffle", "advice": null}, {"title": "Incentives and success of segment disrupted by mergers and transformation of management model", "text": "Pros It's a global company with a strong footprint all around the world. Upward opportunities from high turnover. Cons Near-term focus and overly tight / slow decision making. The hiring took place too late in the cycle which caused additional turnover when staff was over-worked. Incentives to build/own consulting initiatives very thin and disrupted by mergers and confused messaging around software offerings. Advice to Management Decentralize decision making to make segments more agile.", "rating": 1, "pros": "It's a global company with a strong footprint all around the world. Upward opportunities from high turnover.", "cons": "Near-term focus and overly tight / slow decision making. The hiring took place too late in the cycle which caused additional turnover when staff was over-worked. Incentives to build/own consulting initiatives very thin and disrupted by mergers and confused messaging around software offerings.", "advice": "Decentralize decision making to make segments more agile."}, {"title": "Tempe Willis Towers Watson Insurance", "text": "Pros Does not age-discriminate like most large employers, competitive wages, humane \"workforce\" which allows scheduled days off for doctor appointments, etc. Cons 30-somethings rule despite a lack of life experience. Advice to Management Get contract work that will allow seasonal insurance agents to stay on-board.", "rating": 3, "pros": "Does not age-discriminate like most large employers, competitive wages, humane \"workforce\" which allows scheduled days off for doctor appointments, etc.", "cons": "30-somethings rule despite a lack of life experience.", "advice": "Get contract work that will allow seasonal insurance agents to stay on-board."}, {"title": "Its not worth it", "text": "Pros The money is good for a call center. Cons Literally everything else. They will lie to you, give you time off then disapprove it while you're on vacation, not pay you your bonus for made up reasons, won't pay you your full wages, lay you off every christmas, and make you wait 4 years to get insurance! Your boss will not only be some punk kid, he will have zero experience in your department because Pod managers pick their friends to be supervisors. I was there for 7 years, have management experience, but was passed over for the position in favor of someone who was the correct religion of the area and a friend of the hiring manager but had never done the job, not even once. Advice to Management Stop promoting your friends and promote people who will be good supervisors and Pod managers.", "rating": 1, "pros": "The money is good for a call center.", "cons": "Literally everything else. They will lie to you, give you time off then disapprove it while you're on vacation, not pay you your bonus for made up reasons, won't pay you your full wages, lay you off every christmas, and make you wait 4 years to get insurance! Your boss will not only be some punk kid, he will have zero experience in your department because Pod managers pick their friends to be supervisors. I was there for 7 years, have management experience, but was passed over for the position in favor of someone who was the correct religion of the area and a friend of the hiring manager but had never done the job, not even once.", "advice": "Stop promoting your friends and promote people who will be good supervisors and Pod managers."}, {"title": "Actuarial Analyst", "text": "Pros WTW has a great study program for those interested in an actuarial track Cons not your typical 9-5 job", "rating": 5, "pros": "WTW has a great study program for those interested in an actuarial track", "cons": "not your typical 9-5 job", "advice": null}, {"title": "Business Analyst II - Health", "text": "Pros - Flexibility with hours - Ability to work from home three days a week - Starting pay is very good if you come from one of the firm's benefits administration competitors - Mostly a 40~45 hours/week job Cons - Baptism by fire, in every meaning of the word - Very redundant training process that takes 6 weeks - Almost zero communication - Everyone is always busy that, starting out, you will never be able to get any help unless you nag continuously for days - Things get put on the back burner for far too long - Expected to be available during PTO even if someone else can take care of the issue - Never knowing whether you'll need to work late or even the weekend - Mostly a 40~45 hours/week job. Very rarely will it be exactly 40 hours, and during busy season it will go up to 55+ hours/week Advice to Management Please work on communication and making the on boarding process better. A little client exposure during on boarding would go a long way as the interface is extremely customizable to the point that no two clients work the same way, effectively making the training useless.", "rating": 1, "pros": "- Flexibility with hours", "cons": "- Baptism by fire, in every meaning of the word", "advice": "Please work on communication and making the on boarding process better. A little client exposure during on boarding would go a long way as the interface is extremely customizable to the point that no two clients work the same way, effectively making the training useless."}, {"title": "Decent Call Center Job", "text": "Pros Great training and amazing people who work there. Company was easy going about down time. Boston deli inside for food options (you have to pay but food was good) competitive pay Cons Many seasonal/temporary employees, lay off season was dreadful. Despite making it through 2 seasons, company would not make our department employees full time/permanent to receive benefits. Learning the ins and outs of medicare was no joke", "rating": 3, "pros": "Great training and amazing people who work there. Company was easy going about down time. Boston deli inside for food options (you have to pay but food was good) competitive pay", "cons": "Many seasonal/temporary employees, lay off season was dreadful. Despite making it through 2 seasons, company would not make our department employees full time/permanent to receive benefits. Learning the ins and outs of medicare was no joke", "advice": null}, {"title": "Respected in the industry, large and well supported company", "text": "Pros lot of smart managers and colleagues. hard work does not go unnoticed. great company to have on resume Cons Open floor plan in Arlington office is different and hard to get used to", "rating": 5, "pros": "lot of smart managers and colleagues. hard work does not go unnoticed. great company to have on resume", "cons": "Open floor plan in Arlington office is different and hard to get used to", "advice": null}, {"title": "Application Data processor", "text": "Pros Mon-Friday Schedule, overtime available. Cons Temporary position, layoff at anytime. Season is October 15- December 7", "rating": 3, "pros": "Mon-Friday Schedule, overtime available.", "cons": "Temporary position, layoff at anytime. Season is October 15- December 7", "advice": null}, {"title": "Review", "text": "Pros Okay company. But With Willis coming in things have changed. Cons Schedule bidding. I went from 9:30 in to 12:30. Very poor way to treat employees. Advice to Management Why is Willis changing the environment so aggressively?", "rating": 3, "pros": "Okay company. But With Willis coming in things have changed.", "cons": "Schedule bidding. I went from 9:30 in to 12:30. Very poor way to treat employees.", "advice": "Why is Willis changing the environment so aggressively?"}, {"title": "Executive Assistant", "text": "Pros Get to work from home Cons In the world trade", "rating": 5, "pros": "Get to work from home", "cons": "In the world trade", "advice": null}, {"title": "Fulfilling", "text": "Pros I can honestly say I love my job. I am paid a fair wage and there is an emphasis on solid management. Cons Busy seasons can be stressful if you do not plan accordingly, especially January and September. Advice to Management Pay close attention to the people you are thinking of hiring, and seek those who are humble, hungry, and smart.", "rating": 5, "pros": "I can honestly say I love my job. I am paid a fair wage and there is an emphasis on solid management.", "cons": "Busy seasons can be stressful if you do not plan accordingly, especially January and September.", "advice": "Pay close attention to the people you are thinking of hiring, and seek those who are humble, hungry, and smart."}, {"title": "lT", "text": "Pros It was a pretty good job Cons I don't like to work Advice to Management please manage", "rating": 5, "pros": "It was a pretty good job", "cons": "I don't like to work", "advice": "please manage"}, {"title": "good place to get general business experience", "text": "Pros good collaboration & colleagues, training oppportunities, Cons very financially oriented, lacks diversity", "rating": 3, "pros": "good collaboration & colleagues, training oppportunities,", "cons": "very financially oriented, lacks diversity", "advice": null}, {"title": "Head of Strategy and Client Support", "text": "Pros Innovative organization with incredible opportunities for growth globally, top notch intellectual capital and a culture of collaboration, integrity, and excellence Cons Still going through some growing pains as part of the recent merger between Willis and Towers Watson, and catching up with the top player in the industry as it relates to technology Advice to Management Need to best figure out how to operate effectively with a dual value proposition, one serving our large corporate accounts and another serving our middle market accounts", "rating": 5, "pros": "Innovative organization with incredible opportunities for growth globally, top notch intellectual capital and a culture of collaboration, integrity, and excellence", "cons": "Still going through some growing pains as part of the recent merger between Willis and Towers Watson, and catching up with the top player in the industry as it relates to technology", "advice": "Need to best figure out how to operate effectively with a dual value proposition, one serving our large corporate accounts and another serving our middle market accounts"}, {"title": "CSR/ADP Seasonal", "text": "Pros Great work environment. Supervisors and managers are helpful, friendly, and encouraging. WTW has amazing values set for every employee. Company offers bonuses every month that are very attainable. Great pay rate for starting out. One on one coaching is available every week, which is great if you really want to push yourself to do better and succeed, and learn how you can personally improve where needed. There are so many resources to gather information and answer questions, as well as assist you in your work. Also the company is always asking for feedback and opinions from the employees to make for a better learning and work experience. Feedback and opinions are encouraged. Everyone is given the opportunity to show and prove their worth and abilities every work day, it's up to the employee to put in the effort! There are a lot of opportunities for growth, and WTW does hire from within first. Work hard, and reap the benefits! Cons It is made very clear that the job position is seasonal! However I love working here because it truly is a rewarding job in many ways, and so being that my job can end at anytime without notice is a con. Advice to Management Maybe consider a week's notice before laying off the seasonal workers in order to arrange finances. Other than that, you all do an amazing job at WTW!", "rating": 5, "pros": "Great work environment. Supervisors and managers are helpful, friendly, and encouraging. WTW has amazing values set for every employee. Company offers bonuses every month that are very attainable. Great pay rate for starting out. One on one coaching is available every week, which is great if you really want to push yourself to do better and succeed, and learn how you can personally improve where needed. There are so many resources to gather information and answer questions, as well as assist you in your work. Also the company is always asking for feedback and opinions from the employees to make for a better learning and work experience. Feedback and opinions are encouraged. Everyone is given the opportunity to show and prove their worth and abilities every work day, it's up to the employee to put in the effort! There are a lot of opportunities for growth, and WTW does hire from within first. Work hard, and reap the benefits!", "cons": "It is made very clear that the job position is seasonal! However I love working here because it truly is a rewarding job in many ways, and so being that my job can end at anytime without notice is a con.", "advice": "Maybe consider a week's notice before laying off the seasonal workers in order to arrange finances. Other than that, you all do an amazing job at WTW!"}, {"title": "Make sure you have another job lined up at all times", "text": "Pros Good entry into insurance because they pay for your exam and keep your license current. Pretty good trainers and training. Cons No stability, constant changes in protocol, favoritism strongly exists, not very good at assuring job security, no flexibility in hours, not enough parking to accommodate number of employees", "rating": 3, "pros": "Good entry into insurance because they pay for your exam and keep your license current. Pretty good trainers and training.", "cons": "No stability, constant changes in protocol, favoritism strongly exists, not very good at assuring job security, no flexibility in hours, not enough parking to accommodate number of employees", "advice": null}, {"title": "Company Culture", "text": "Pros Great company with a strong culture. Everyone is friendly and genuine. Cons As an intern, more work could be assigned. From time to time, I felt there was minimal work for me to do.", "rating": 5, "pros": "Great company with a strong culture. Everyone is friendly and genuine.", "cons": "As an intern, more work could be assigned. From time to time, I felt there was minimal work for me to do.", "advice": null}, {"title": "Health Care Business Analyst", "text": "Pros Salary + Bonus, Remote work PTO Ability to transfer to any U.S office which are located in most major U.S cities Cons Little to no recognition of your hard work. Very bad new hire training which consists of boring web ex videos and SQL labs. Your trainer who is responsible for helping you most likely will be in the same office and unwilling to work since they have their own client work. Horrible work life balance your expected to work 50 to 60 hours per week during open enrollment. Ongoing training that is offered is also web ex sessions that are pretty much sleeping sessions. No upward mobility and no career path given to employees. Advice to Management Bring all employees back into the office or work from home. Work on training employees better.", "rating": 3, "pros": "Salary + Bonus,", "cons": "Little to no recognition of your hard work. Very bad new hire training which consists of boring web ex videos and SQL labs. Your trainer who is responsible for helping you most likely will be in the same office and unwilling to work since they have their own client work. Horrible work life balance your expected to work 50 to 60 hours per week during open enrollment. Ongoing training that is offered is also web ex sessions that are pretty much sleeping sessions. No upward mobility and no career path given to employees.", "advice": "Bring all employees back into the office or work from home. Work on training employees better."}, {"title": "Executive Compensation Consultant", "text": "Pros Friendly colleagues Good work-life balance A variety of projects Cons Work is repetitive and not always intellectually stimulating Limited opportunities for promotions Management's long-term vision is vague and unappealing Advice to Management Individuals have little control over bonus payout since funding is based on corporate and BU performance", "rating": 5, "pros": "Friendly colleagues", "cons": "Work is repetitive and not always intellectually stimulating", "advice": "Individuals have little control over bonus payout since funding is based on corporate and BU performance"}, {"title": "Great place to work", "text": "Pros Competitive compensation, great office location Cons Work life balance, but manageable", "rating": 5, "pros": "Competitive compensation, great office location", "cons": "Work life balance, but manageable", "advice": null}, {"title": "Favoritism, reverse discrimination", "text": "Pros Nobody cares where you are, low level assistants come on late, long lunches, leave early Cons Over-correction of female discrimination from past issues. Female buddy network in place. Managers are close friends with those they supervise, promote them without warrant. Advice to Management don't throw money at semi-qualified people from the outside, reward people on the inside first!!", "rating": 3, "pros": "Nobody cares where you are, low level assistants come on late, long lunches, leave early", "cons": "Over-correction of female discrimination from past issues. Female buddy network in place. Managers are close friends with those they supervise, promote them without warrant.", "advice": "don't throw money at semi-qualified people from the outside, reward people on the inside first!!"}, {"title": "human resources", "text": "Pros Flexibility with work schedule offered Cons Opportunities can be limited if not in client-facing roles", "rating": 3, "pros": "Flexibility with work schedule offered", "cons": "Opportunities can be limited if not in client-facing roles", "advice": null}, {"title": "Sr. Software Engineer", "text": "Pros The projects are interesting to work on and use up to date technology so developers don't fall behind in industry knowledge. The company has a good moral compass and tries to keep both employees and clients happy with respectful values and fun company events. Cons There are some off hours phone meetings to handle the global team interactions, but the flexibility of work hours mostly offsets that inconvenience.", "rating": 5, "pros": "The projects are interesting to work on and use up to date technology so developers don't fall behind in industry knowledge. The company has a good moral compass and tries to keep both employees and clients happy with respectful values and fun company events.", "cons": "There are some off hours phone meetings to handle the global team interactions, but the flexibility of work hours mostly offsets that inconvenience.", "advice": null}, {"title": "Producer", "text": "Pros Great resources, products, and people Cons Disorganized leadership since merger has led to loss of people and momentum Advice to Management If you can figure out how to sell the intersection of people and risk as a differentiator you will have a strong value proposition.", "rating": 5, "pros": "Great resources, products, and people", "cons": "Disorganized leadership since merger has led to loss of people and momentum", "advice": "If you can figure out how to sell the intersection of people and risk as a differentiator you will have a strong value proposition."}, {"title": "Profits come first, employees optional", "text": "Pros This is an apolitical company with decent benefits and a casual dress code. Cons Since the merger between Towers Watson and Willis there has been large changes ,mostly negative. You are expected to work ridiculous hours. Many finance jobs have been outsourced to India. After months of training and working with the people in India they were still disorganized and unprepared to handle the job responsibilities. There has been a large amount of people leaving due to office closings, consolidations and general frustration by employees", "rating": 3, "pros": "This is an apolitical company with decent benefits and a casual dress code.", "cons": "Since the merger between Towers Watson and Willis there has been large changes ,mostly negative. You are expected to work ridiculous hours. Many finance jobs have been outsourced to India. After months of training and working with the people in India they were still disorganized and unprepared to handle the job responsibilities. There has been a large amount of people leaving due to office closings, consolidations and general frustration by employees", "advice": null}, {"title": "N/A", "text": "Pros It's a really good company Cons Pay progression can be slow", "rating": 5, "pros": "It's a really good company", "cons": "Pay progression can be slow", "advice": null}, {"title": "Pension Analyst Intern", "text": "Pros - Great Team - Flexible hours Cons there is a high turnover rate", "rating": 5, "pros": "- Great Team", "cons": "there is a high turnover rate", "advice": null}, {"title": "Client Service Representative", "text": "Pros Flexibility, Freedom, Money, Open Space to work, computers Cons People, long hours, money, travel 80%, Advice to Management n/a", "rating": 1, "pros": "Flexibility, Freedom, Money, Open Space to work, computers", "cons": "People, long hours, money, travel 80%,", "advice": "n/a"}, {"title": "Senior Actuarial Analyst", "text": "Pros Exam program in place for actuaries Cons No balance between work and life; salary levels are not appropriate compensation for time and energy and are not able to be more competitive", "rating": 3, "pros": "Exam program in place for actuaries", "cons": "No balance between work and life; salary levels are not appropriate compensation for time and energy and are not able to be more competitive", "advice": null}, {"title": "Willis Towers Watson WorkReview", "text": "Pros Good people overall working for the company. Cons To much focus on analytics and not the brokering process. Advice to Management Cut back on all the diversity stuff. I know my values, management does not need to tell me how to deal with individuals", "rating": 3, "pros": "Good people overall working for the company.", "cons": "To much focus on analytics and not the brokering process.", "advice": "Cut back on all the diversity stuff. I know my values, management does not need to tell me how to deal with individuals"}, {"title": "Wonderful people, horrible practices.", "text": "Pros Wonderful training staff Beautiful Company building Free Coffee and water daily New and clean training supplies Knowledgeable leadership Great staff (cleaning, facilities and security) Cons The ONLY issue I have is an issue that occurred due to a payroll discrepancy. I was not offered solutions or answers for my issue. I was given excuses and fingers pointed in every which direction. Advice to Management You guys are doing wonderful. Empathy is taught to the csr but it should also be used amongst peers.", "rating": 5, "pros": "Wonderful training staff", "cons": "The ONLY issue I have is an issue that occurred due to a payroll discrepancy. I was not offered solutions or answers for my issue. I was given excuses and fingers pointed in every which direction.", "advice": "You guys are doing wonderful. Empathy is taught to the csr but it should also be used amongst peers."}, {"title": "Great atmosphere", "text": "Pros Environmental and people are great. You need to work hard but worth it. Cons Low pay when starting career", "rating": 3, "pros": "Environmental and people are great. You need to work hard but worth it.", "cons": "Low pay when starting career", "advice": null}, {"title": "Great employer", "text": "Pros Willis Towers Watson makes its employees a priority and offers a good work / life balance. Cons The organization is so large that it can be confusing to understand the various departmental structures.", "rating": 5, "pros": "Willis Towers Watson makes its employees a priority and offers a good work / life balance.", "cons": "The organization is so large that it can be confusing to understand the various departmental structures.", "advice": null}, {"title": "Health and Benefits Analyst", "text": "Pros Great upward mobility, transparent feedback Cons The company has gotten much more bureaucratic and less transparent since the merger, less of an emphasis on employees and development opportunities", "rating": 5, "pros": "Great upward mobility, transparent feedback", "cons": "The company has gotten much more bureaucratic and less transparent since the merger, less of an emphasis on employees and development opportunities", "advice": null}, {"title": "Actuarial Analyst", "text": "Pros people are easy to work with Cons workload can get very tight", "rating": 5, "pros": "people are easy to work with", "cons": "workload can get very tight", "advice": null}, {"title": "Account Manager", "text": "Pros - Good work life balance -Great people to work with -Ability to move-up in the company if initiative is shown Cons -Poor medical benefits -Only going to get a 3.5% salary increase regardless of performance Advice to Management -Keep up the good work on engaging employees. -Provide additional professional development", "rating": 5, "pros": "- Good work life balance", "cons": "-Poor medical benefits", "advice": "-Keep up the good work on engaging employees."}, {"title": "Good company", "text": "Pros Solid, brilliant people working here toward a common goal. Cons Innovation on the software front has been lagging but looks to be improved over the next year.", "rating": 5, "pros": "Solid, brilliant people working here toward a common goal.", "cons": "Innovation on the software front has been lagging but looks to be improved over the next year.", "advice": null}, {"title": "WTW Review", "text": "Pros WTW has a very entrepreneurial work atmosphere Cons The firm lacks the ability to execute their business plans", "rating": 3, "pros": "WTW has a very entrepreneurial work atmosphere", "cons": "The firm lacks the ability to execute their business plans", "advice": null}, {"title": "summer intern 2017", "text": "Pros The consultants are very nice and friendly. Cons For some cases, the consultants just want to extract useful information from data to satisfy the customer, which weakens their objectivity about analyzing the data.", "rating": 5, "pros": "The consultants are very nice and friendly.", "cons": "For some cases, the consultants just want to extract useful information from data to satisfy the customer, which weakens their objectivity about analyzing the data.", "advice": null}, {"title": "Pension Analyst", "text": "Pros WTW was flexible when it came to days off and the need to work from home. Cons The bonus and pay increases hovered right around the average inflation percentage. PAG also had some nepotism which brought down moral amongst younger employees.", "rating": 3, "pros": "WTW was flexible when it came to days off and the need to work from home.", "cons": "The bonus and pay increases hovered right around the average inflation percentage. PAG also had some nepotism which brought down moral amongst younger employees.", "advice": null}, {"title": "Senior Consultant", "text": "Pros Fabulous, smart, and focused colleagues; focus on excellent work product and client results to the detriment of work/life balance Cons Travel required was daunting; competitive for advancement; open office concept not a good change for many", "rating": 5, "pros": "Fabulous, smart, and focused colleagues; focus on excellent work product and client results to the detriment of work/life balance", "cons": "Travel required was daunting; competitive for advancement; open office concept not a good change for many", "advice": null}, {"title": "Strattegy", "text": "Pros Progressive Company with good strategy Cons Long hours, too much focus on cost cutting", "rating": 5, "pros": "Progressive Company with good strategy", "cons": "Long hours, too much focus on cost cutting", "advice": null}, {"title": "Business Analyst", "text": "Pros The paycheck is nice! There is free food quite often! Covered parking. Nice building and piano music when you walk in! Great food near by! Cons Everything else! Unrealistic expectations, terrible work life balance, slave labor. Mixed messages from leadership. No real direction year over year cause everyone gets fired or leaves. Turnover is insane on all levels. Run by intimidation! Advice to Management So much drama from leadership it’s hard to get work done!", "rating": 1, "pros": "The paycheck is nice! There is free food quite often! Covered parking. Nice building and piano music when you walk in! Great food near by!", "cons": "Everything else! Unrealistic expectations, terrible work life balance, slave labor. Mixed messages from leadership. No real direction year over year cause everyone gets fired or leaves. Turnover is insane on all levels. Run by intimidation!", "advice": "So much drama from leadership it’s hard to get work done!"}, {"title": "Junior Analyst", "text": "Pros Easy work and fun environment Cons Low pay, no opportunity for growth Advice to Management Be more professional and recognize effort and talent", "rating": 3, "pros": "Easy work and fun environment", "cons": "Low pay, no opportunity for growth", "advice": "Be more professional and recognize effort and talent"}, {"title": "Benefits Customer Service Representative", "text": "Pros Ok benefits and good supervisors in my pod. Cons My position used to be paid 37,500 for new hires before Towers Watson merged with Willis. Now new hires make 35,500 for doing the same work. This exemplifies a company culture that is driven by the top to perform but works its employees to burn out on a day to day basis for ever shrinking rewards. The company exploits contractors. Advice to Management Boost salaries for CSRs and stop adding more to their work load while trimming benefits spending. They are the reason the TAS segment is successful.", "rating": 1, "pros": "Ok benefits and good supervisors in my pod.", "cons": "My position used to be paid 37,500 for new hires before Towers Watson merged with Willis. Now new hires make 35,500 for doing the same work. This exemplifies a company culture that is driven by the top to perform but works its employees to burn out on a day to day basis for ever shrinking rewards. The company exploits contractors.", "advice": "Boost salaries for CSRs and stop adding more to their work load while trimming benefits spending. They are the reason the TAS segment is successful."}, {"title": "Finance", "text": "Pros Pay Wage Independence Outings Free Coffee Sometimes Free Food After Company Meetings Cons No Training Belittling Back Backing Treating co workers as if they are children Favoritism Advice to Management I worked here through a temp agency. The first three weeks was okay. I went through quote on quote training which was basically calling companies who owed money. This was the only training I received. The supervisor (still fairly new herself). Was the most disrespectful supervisor I have ever encountered. She is an Indian woman who works in the Philadelphia Office in the Finance Department on the 21st floor. Since I worked through a temp agency, I couldn't work from home, I would get the cold shoulder from management, and received no support or guidance from the supervisor or manager. Everything I learned I mean everything I learned came from my wonderful co workers. My advice to Mangement would be for them to go through some kind of customer service training. The belittling, lying, and nit picking at that Department is real. I wish someone would really monitor these managers. This company left a sour taste in my mouth and I would never reapply to anything there ever again.", "rating": 1, "pros": "Pay Wage", "cons": "No Training", "advice": "I worked here through a temp agency. The first three weeks was okay. I went through quote on quote training which was basically calling companies who owed money. This was the only training I received. The supervisor (still fairly new herself). Was the most disrespectful supervisor I have ever encountered. She is an Indian woman who works in the Philadelphia Office in the Finance Department on the 21st floor. Since I worked through a temp agency, I couldn't work from home, I would get the cold shoulder from management, and received no support or guidance from the supervisor or manager. Everything I learned I mean everything I learned came from my wonderful co workers. My advice to Mangement would be for them to go through some kind of customer service training. The belittling, lying, and nit picking at that Department is real. I wish someone would really monitor these managers. This company left a sour taste in my mouth and I would never reapply to anything there ever again."}, {"title": "Great place to work & learn!", "text": "Pros Very open and welcoming environment. Everyone within the department seems to be friends and get along well outside of work. People were very willing to teach, which as an intern was extremely helpful, but also every project worked on was challenging. They give you so much knowledge and help you grow tremendously. Such a great place to work! Cons As an intern it took longer for me to complete projects over analysts so at times it felt as though people would rather do things themselves when a project needed to be done quickly", "rating": 5, "pros": "Very open and welcoming environment. Everyone within the department seems to be friends and get along well outside of work. People were very willing to teach, which as an intern was extremely helpful, but also every project worked on was challenging. They give you so much knowledge and help you grow tremendously. Such a great place to work!", "cons": "As an intern it took longer for me to complete projects over analysts so at times it felt as though people would rather do things themselves when a project needed to be done quickly", "advice": null}, {"title": "International Benefits Consultant", "text": "Pros Access to big name clients. Cons Lots of senior consultants and directors.", "rating": 5, "pros": "Access to big name clients.", "cons": "Lots of senior consultants and directors.", "advice": null}, {"title": "Nice place to work", "text": "Pros Salary, benefits and pension plan, work from home and flex time Cons Opportunities are few and limited", "rating": 5, "pros": "Salary, benefits and pension plan, work from home and flex time", "cons": "Opportunities are few and limited", "advice": null}, {"title": "Marketing", "text": "Pros client focus, excellence, team work and opportunities Cons Long hours, strong personalities, work load", "rating": 5, "pros": "client focus, excellence, team work and opportunities", "cons": "Long hours, strong personalities, work load", "advice": null}, {"title": "Senior Investment Analyst", "text": "Pros Good work/life balance and good professional development opportunities Cons Compensation is below market, especially annual bonuses Advice to Management Bring up compensation to market to retain talent", "rating": 5, "pros": "Good work/life balance and good professional development opportunities", "cons": "Compensation is below market, especially annual bonuses", "advice": "Bring up compensation to market to retain talent"}, {"title": "Good Company", "text": "Pros Great benefits, generous PTO, opportunity for flexible work environment, friendly coworkers Cons Poor executive leadership, compensation is not particularly aggressive, work/life balance could be much better", "rating": 5, "pros": "Great benefits, generous PTO, opportunity for flexible work environment, friendly coworkers", "cons": "Poor executive leadership, compensation is not particularly aggressive, work/life balance could be much better", "advice": null}, {"title": "Good colleagues, good market", "text": "Pros Autonomy, given lots of freedom and responsibility Cons Long hours during busy season Advice to Management Hire more analysts for the busy season", "rating": 5, "pros": "Autonomy, given lots of freedom and responsibility", "cons": "Long hours during busy season", "advice": "Hire more analysts for the busy season"}, {"title": "Great place to work", "text": "Pros Great benefits including active Pension Plan. Strong commitment to diversity. Client devotion. Depending on manager, great support. Flexibility of working remotely. Cons Competitive environment. Too great of importance placed on meeting hours and sales goals simultaneously.", "rating": 5, "pros": "Great benefits including active Pension Plan. Strong commitment to diversity. Client devotion. Depending on manager, great support. Flexibility of working remotely.", "cons": "Competitive environment. Too great of importance placed on meeting hours and sales goals simultaneously.", "advice": null}, {"title": "great company", "text": "Pros Its a great company that cares about their employees. Cons In the future they should offer a at home position", "rating": 5, "pros": "Its a great company that cares about their employees.", "cons": "In the future they should offer a at home position", "advice": null}, {"title": "Bed Bugs", "text": "Pros Willis Towers Watson is a great place to work for the amount of money. I was there for 2-years as a seasonal worker. Cons They have a major issue with Bed Bugs and because they are not treating the entire building at once, then the bugs keep coming back and it is say to be a on going issue. Advice to Management N/A", "rating": 1, "pros": "Willis Towers Watson is a great place to work for the amount of money. I was there for 2-years as a seasonal worker.", "cons": "They have a major issue with Bed Bugs and because they are not treating the entire building at once, then the bugs keep coming back and it is say to be a on going issue.", "advice": "N/A"}, {"title": "Great place to work", "text": "Pros Great benefits including active Pension Plan. Strong commitment to diversity. Client devotion. Depending on manager, great support. Flexibility of working remotely. Cons Competitive environment. Too great of importance placed on meeting hours and sales goals simultaneously.", "rating": 5, "pros": "Great benefits including active Pension Plan. Strong commitment to diversity. Client devotion. Depending on manager, great support. Flexibility of working remotely.", "cons": "Competitive environment. Too great of importance placed on meeting hours and sales goals simultaneously.", "advice": null}, {"title": "great company", "text": "Pros Its a great company that cares about their employees. Cons In the future they should offer a at home position", "rating": 5, "pros": "Its a great company that cares about their employees.", "cons": "In the future they should offer a at home position", "advice": null}, {"title": "Bed Bugs", "text": "Pros Willis Towers Watson is a great place to work for the amount of money. I was there for 2-years as a seasonal worker. Cons They have a major issue with Bed Bugs and because they are not treating the entire building at once, then the bugs keep coming back and it is say to be a on going issue. Advice to Management N/A", "rating": 1, "pros": "Willis Towers Watson is a great place to work for the amount of money. I was there for 2-years as a seasonal worker.", "cons": "They have a major issue with Bed Bugs and because they are not treating the entire building at once, then the bugs keep coming back and it is say to be a on going issue.", "advice": "N/A"}, {"title": "License Benefits Advisor - One Exchange", "text": "Pros Diverse population of work environment. There are more departments offering remote opportunities. Cons General call center atmosphere. There is little room for growth. Very strong politics and favoritism. Choose your allies carefully.", "rating": 3, "pros": "Diverse population of work environment. There are more departments offering remote opportunities.", "cons": "General call center atmosphere. There is little room for growth. Very strong politics and favoritism. Choose your allies carefully.", "advice": null}, {"title": "Client Services Representative", "text": "Pros Flexible hours, work from home, casual dress code, knowledgeable brokers, great group of coworkers Cons Unreasonable work load, lack of management, uncompetitive salary, poor (almost non-existent) bonus structure, lack of training, lack of growth, lack of communication Advice to Management Initiate useful training, communicate with your employees, hire when needed, spread workload fairly, actively listen to concerns of employees", "rating": 3, "pros": "Flexible hours, work from home, casual dress code, knowledgeable brokers, great group of coworkers", "cons": "Unreasonable work load, lack of management, uncompetitive salary, poor (almost non-existent) bonus structure, lack of training, lack of growth, lack of communication", "advice": "Initiate useful training, communicate with your employees, hire when needed, spread workload fairly, actively listen to concerns of employees"}, {"title": "Don't Waste Your Time Here", "text": "Pros I work with some of the most dedicated and professional people out there. Cons Since the merger of Towers Watson and Willis, it has become apparent that employees are the least important members of this company. Advice to Management Quit cutting our benefits and act like you value your employees before they all leave.", "rating": 3, "pros": "I work with some of the most dedicated and professional people out there.", "cons": "Since the merger of Towers Watson and Willis, it has become apparent that employees are the least important members of this company.", "advice": "Quit cutting our benefits and act like you value your employees before they all leave."}, {"title": "fast pace working culture", "text": "Pros 1. open communication with align project-based working styles 2. you can always get someone to ask for, willing to share knowledge 3. can get exposed to various industries Cons 1. overtime work 2. dress code", "rating": 3, "pros": "1. open communication with align project-based working styles", "cons": "1. overtime work", "advice": null}, {"title": "Rankist, but casual, office environment", "text": "Pros The office is jeans casual. Flexible work schedule, and the office makes an effort at creating a friendly environment. Care about what their employees think, but changes are slow to come in such a large organization. There are some really great people. The company is trying to be more progressive in their office culture, which is great, but it seems to only be happening from a physical aspect and not in terms of many of the people in the office. Cons Rankist environment. Office makes an effort at creating a friendly environment, but only because of the lack of interaction and some unfriendly associates. Analysts and consultants do not treat their admin, or any admin, with the respect they should. Harassment is not taken seriously if it will affect a relationship with a client. Diversity efforts need a makeover. They have failed to realize diversity starts by educating the majority on biases and how to welcome and celebrate the differences of others. Instead, they provide networks for minorities for support...Minorities should NOT need to gather to support one another because their white colleagues expect them to assimilate as opposed to integrate. I would expect a company in this industry to know this, and I am sure they do, but hey, that's institutional and inherent racism for you...They want diversity in ways that is convenient for them: having their minorities find other minorities. Pay is not very competitive. Health insurance options could be better, especially if you have children. My wife works for a school system and has better health insurance than I do. Advice to Management Create an enhanced approach to increase and retain diverse hires by educating everyone. Provide more enhanced leadership training at all levels. Socialize the importance of collaboration with associates to complement the work space enhancements.", "rating": 3, "pros": "The office is jeans casual. Flexible work schedule, and the office makes an effort at creating a friendly environment. Care about what their employees think, but changes are slow to come in such a large organization.", "cons": "Rankist environment. Office makes an effort at creating a friendly environment, but only because of the lack of interaction and some unfriendly associates.", "advice": "Create an enhanced approach to increase and retain diverse hires by educating everyone."}, {"title": "CSR", "text": "Pros Good Experience about health benefits Cons No room for growth -too much favoritism Advice to Management Be honest", "rating": 3, "pros": "Good Experience about health benefits", "cons": "No room for growth -too much favoritism", "advice": "Be honest"}, {"title": "Good growing company to work for.", "text": "Pros Willis has had 3 mergers in the last 4 years creating many opportunities for jobs and upward movement. They are a forward thinking company that is willing to listen to their employees. Cons The front line employees are disciplined with fear. Advice to Management Look at what has made other companies have done to empower their front line employees.", "rating": 5, "pros": "Willis has had 3 mergers in the last 4 years creating many opportunities for jobs and upward movement. They are a forward thinking company that is willing to listen to their employees.", "cons": "The front line employees are disciplined with fear.", "advice": "Look at what has made other companies have done to empower their front line employees."}, {"title": "Consultant", "text": "Pros I had a good manager. I can't think of much. Cons Where to begin? WTW was never a great company to begin with, and it got even worse since the merger. There is simply too much micromanagement, expectations to work at odd hours, extremely bad benefits and pay, but most importantly an obsolete product that I don't believe in. This is certainly not a place for young people looking to make a mark in this world. Employees are not rewarded for their hard work, and even if they are, its more like a shoutout or a $50 gift card for tens to hundreds of hours of work on a project. Joining this company was certainly the biggest mistake that I made during the course of my career and I just wish I could turn back time NOT to take the offer or at least have left earlier than I did. Stay away and look for something better.", "rating": 1, "pros": "I had a good manager. I can't think of much.", "cons": "Where to begin? WTW was never a great company to begin with, and it got even worse since the merger.", "advice": null}, {"title": "Decent Place to Work", "text": "Pros Work place flexibility, retirement benefits Cons Compensation is less than competitors", "rating": 5, "pros": "Work place flexibility, retirement benefits", "cons": "Compensation is less than competitors", "advice": null}, {"title": "Analyst", "text": "Pros Great company culture. Help is always there if you need it. Cons Some of the Work can get repetitive at times", "rating": 5, "pros": "Great company culture. Help is always there if you need it.", "cons": "Some of the Work can get repetitive at times", "advice": null}, {"title": "Retirement Consultant People Leader", "text": "Pros Flexibility in working environment Great people Excellence in work product Smart people Innovation Ability to reinvent themselves within organization. Cons Not all roles should have billable hours Some colleagues should be more internally focused on growing colleagues. Advice to Management All more opportunities to grow colleagues. Allow some to spent more time internally focused instead of being revenue focused.", "rating": 5, "pros": "Flexibility in working environment", "cons": "Not all roles should have billable hours", "advice": "All more opportunities to grow colleagues. Allow some to spent more time internally focused instead of being revenue focused."}, {"title": "One of the better options if you want to work in this field", "text": "Pros Mostly smart, competent co-workers, flexible schedule/work from home Cons Constant organizational and operational changes, senior leadership of certain segments doesn't seem to care beyond making money, relatively low pay which leadership refuses to meaningfully address.", "rating": 3, "pros": "Mostly smart, competent co-workers, flexible schedule/work from home", "cons": "Constant organizational and operational changes, senior leadership of certain segments doesn't seem to care beyond making money, relatively low pay which leadership refuses to meaningfully address.", "advice": null}, {"title": "Great benefits, bad management", "text": "Pros Great benefits, PTO, opportunities for junior people Cons The company is bleeding. Management needs to be trained.", "rating": 3, "pros": "Great benefits, PTO, opportunities for junior people", "cons": "The company is bleeding. Management needs to be trained.", "advice": null}, {"title": "Good place to work", "text": "Pros If you show up, be on time and follow the rules for quality you can have a solid career here with every opportunity to move into new roles or new departments Cons Pretty strict to-the-minute time in/time out. Thats the nature of the business and not exactly a ding at WTW. Also, scheduling is done off-site and its a process to request time off.", "rating": 5, "pros": "If you show up, be on time and follow the rules for quality you can have a solid career here with every opportunity to move into new roles or new departments", "cons": "Pretty strict to-the-minute time in/time out. Thats the nature of the business and not exactly a ding at WTW. Also, scheduling is done off-site and its a process to request time off.", "advice": null}, {"title": "Good place to grow into consulting", "text": "Pros Good preparation for client-facing sales role; by and large, decent people Cons Typically ambivalent to employees and stingy with pay increases/incentives Advice to Management ...won't be heeded anyway", "rating": 3, "pros": "Good preparation for client-facing sales role; by and large, decent people", "cons": "Typically ambivalent to employees and stingy with pay increases/incentives", "advice": "...won't be heeded anyway"}, {"title": "Disorganized and lacking culture", "text": "Pros Knowledgeable coworkers (who will eventually get poached). Cons I am a legacy Willis employee (prior to the WTW merger) and have always been shocked at the utter lack of structure. The only thing they truly value is revenue production. The leadership is mostly arrogant and incompetent. Too much dependency on external consultants. Very limited benefit package. They also stopped providing employee stock options... Advice to Management Stop feeding the employees lip service", "rating": 1, "pros": "Knowledgeable coworkers (who will eventually get poached).", "cons": "I am a legacy Willis employee (prior to the WTW merger) and have always been shocked at the utter lack of structure. The only thing they truly value is revenue production. The leadership is mostly arrogant and incompetent. Too much dependency on external consultants.", "advice": "Stop feeding the employees lip service"}, {"title": "worst ever", "text": "Pros no pros to report here Cons very poor structure culture and values Advice to Management reconsider structure, culture and values", "rating": 1, "pros": "no pros to report here", "cons": "very poor structure culture and values", "advice": "reconsider structure, culture and values"}, {"title": "Good place to grow into consulting", "text": "Pros Good preparation for client-facing sales role; by and large, decent people Cons Typically ambivalent to employees and stingy with pay increases/incentives Advice to Management ...won't be heeded anyway", "rating": 3, "pros": "Good preparation for client-facing sales role; by and large, decent people", "cons": "Typically ambivalent to employees and stingy with pay increases/incentives", "advice": "...won't be heeded anyway"}, {"title": "Disorganized and lacking culture", "text": "Pros Knowledgeable coworkers (who will eventually get poached). Cons I am a legacy Willis employee (prior to the WTW merger) and have always been shocked at the utter lack of structure. The only thing they truly value is revenue production. The leadership is mostly arrogant and incompetent. Too much dependency on external consultants. Very limited benefit package. They also stopped providing employee stock options... Advice to Management Stop feeding the employees lip service", "rating": 1, "pros": "Knowledgeable coworkers (who will eventually get poached).", "cons": "I am a legacy Willis employee (prior to the WTW merger) and have always been shocked at the utter lack of structure. The only thing they truly value is revenue production. The leadership is mostly arrogant and incompetent. Too much dependency on external consultants.", "advice": "Stop feeding the employees lip service"}, {"title": "worst ever", "text": "Pros no pros to report here Cons very poor structure culture and values Advice to Management reconsider structure, culture and values", "rating": 1, "pros": "no pros to report here", "cons": "very poor structure culture and values", "advice": "reconsider structure, culture and values"}, {"title": "Technology and Administration \"Solutions", "text": "Pros Initial Pay and Benefits, Humanitarian Functions, Telecommuting Capability Cons NO management structure. Passive aggressive environment. Little opportunity for growth. Work/Life balance is terrible and demand to work long hours and weekends just gets worse as you progress. Little to no acknowledgement of your contributions. Advice to Management My last manager literally got angry when I addressed to him the hours and weekends I was working and immediately reported my \"bad attitude\" to the TAS lead. I had little to NO recourse to what I was trying to say. I went from being a \"great asset\" the first year, to being terminated the next. I've only had three employers in 20 years, and only this one has had a negative impact on my life.", "rating": 1, "pros": "Initial Pay and Benefits, Humanitarian Functions, Telecommuting Capability", "cons": "NO management structure. Passive aggressive environment. Little opportunity for growth. Work/Life balance is terrible and demand to work long hours and weekends just gets worse as you progress. Little to no acknowledgement of your contributions.", "advice": "My last manager literally got angry when I addressed to him the hours and weekends I was working and immediately reported my \"bad attitude\" to the TAS lead. I had little to NO recourse to what I was trying to say. I went from being a \"great asset\" the first year, to being terminated the next. I've only had three employers in 20 years, and only this one has had a negative impact on my life."}, {"title": "An experience", "text": "Pros This company is the leading edge of benefits. I enjoy working for them. Cons I can think of is that the pay should be higher especially in comparison to other companies. However they are working on that. Also I think they they need a daycare for employees. If you are a parent of a young child its harder to work here with the closing shift being 8pm. They do have late shifts and shift bids.", "rating": 5, "pros": "This company is the leading edge of benefits. I enjoy working for them.", "cons": "I can think of is that the pay should be higher especially in comparison to other companies. However they are working on that. Also I think they they need a daycare for employees. If you are a parent of a young child its harder to work here with the closing shift being 8pm. They do have late shifts and shift bids.", "advice": null}, {"title": "Actuarial Analyst", "text": "Pros You will have chances to work with a lot of experienced actuaries Cons expect you to work overtime every week; micro management on people instead of projects; impossible to have communications Advice to Management Don't overdo diversity; some of the employees cannot do the job", "rating": 1, "pros": "You will have chances to work with a lot of experienced actuaries", "cons": "expect you to work overtime every week; micro management on people instead of projects; impossible to have communications", "advice": "Don't overdo diversity; some of the employees cannot do the job"}, {"title": "Good First Job", "text": "Pros Pay, People, Challenge of job Cons High Stress, Repetitive work, Can be long hours", "rating": 5, "pros": "Pay, People, Challenge of job", "cons": "High Stress, Repetitive work, Can be long hours", "advice": null}, {"title": "Former", "text": "Pros A lot of good people Cons Centralized and lack of individuality", "rating": 5, "pros": "A lot of good people", "cons": "Centralized and lack of individuality", "advice": null}, {"title": "Solid, but not spectacilar", "text": "Pros Talented colleagues, growth opportunities, entrepreneurial culture Cons Politics, multiple layers of leadership Advice to Management Get back to the basics in terms of client focus, eliminate internally focused distractions", "rating": 3, "pros": "Talented colleagues, growth opportunities, entrepreneurial culture", "cons": "Politics, multiple layers of leadership", "advice": "Get back to the basics in terms of client focus, eliminate internally focused distractions"}, {"title": "Great company; horrible compensation philosophy", "text": "Pros Relaxed working environment, good work/life balance, good vacation time Cons Management does not work with you on career goals and a path to achieve those goals. Competitive compensation is a serious issue, and everyone top to bottom knows it. Most employees know they are underpaid, and the philosophy of getting a raise after you are in a job for x amount of time is something that is said, but not seen in practice. I don't think they understand the negative work environment this creates. As a company that provides competitive compensation tools, they should be embarrassed that their own employees feel this way. What's more, employees are hearing excuses from upper management. Actions speak louder than words, and every employee is watching this unfold. Advice to Management Pay your employees what they're worth, and stop making excuses not to.", "rating": 3, "pros": "Relaxed working environment, good work/life balance, good vacation time", "cons": "Management does not work with you on career goals and a path to achieve those goals.", "advice": "Pay your employees what they're worth, and stop making excuses not to."}, {"title": "Great", "text": "Pros Opportunity here is very good Cons Unorganized at times but improving Advice to Management continue to integrate two companies", "rating": 5, "pros": "Opportunity here is very good", "cons": "Unorganized at times but improving", "advice": "continue to integrate two companies"}, {"title": "Shoemaker's children", "text": "Pros Flexibility, smart colleagues, often interesting work, interesting field, opportunity to shape role and work Cons Billable hours goals take precedence over everything else and leave little time for development other than OJT or networking or just plain down time to refresh and have creative thoughts. Expectation to be always on, answer emails at night. Guilt for taking vacation days. The new workplace with an open concept is not appreciated. Reorgs, changes to direction and unclear vision, poor technology, products that can't compete in the market Advice to Management It's beginning to feel like employees are just bodies in the seats to bill hours. And the amount of work asked of people needs to be balanced by some perks that you would typically expect of a large and esteemed consulting firm. So many cutbacks, so many reorgs, with little attention to employee experience is not going to provide the EVP that keeps people with us. We are the shoemaker's children. We sell great products and advise on best practices and we don't use them for our own people. We even use competitors' products. Eventually that begins to erode goodwill and loyalty. We have just been asked to make a huge change in the way we work and were given little to NO details, information or discussion. Horrible and felt disrespectful to people who have been working hard for decades in many cases. The employee survey once again showed that development and career are areas of concern. That's because there is NO TIME provided for anything other than billing billing billing. No time for conferences, mentoring, people management or training. It's very tiring. Consulting is built on relationships - with clients AND internally - and that feels like it's being forgotten.", "rating": 3, "pros": "Flexibility, smart colleagues, often interesting work, interesting field, opportunity to shape role and work", "cons": "Billable hours goals take precedence over everything else and leave little time for development other than OJT or networking or just plain down time to refresh and have creative thoughts. Expectation to be always on, answer emails at night. Guilt for taking vacation days. The new workplace with an open concept is not appreciated. Reorgs, changes to direction and unclear vision, poor technology, products that can't compete in the market", "advice": "It's beginning to feel like employees are just bodies in the seats to bill hours. And the amount of work asked of people needs to be balanced by some perks that you would typically expect of a large and esteemed consulting firm. So many cutbacks, so many reorgs, with little attention to employee experience is not going to provide the EVP that keeps people with us. We are the shoemaker's children. We sell great products and advise on best practices and we don't use them for our own people. We even use competitors' products. Eventually that begins to erode goodwill and loyalty. We have just been asked to make a huge change in the way we work and were given little to NO details, information or discussion. Horrible and felt disrespectful to people who have been working hard for decades in many cases. The employee survey once again showed that development and career are areas of concern. That's because there is NO TIME provided for anything other than billing billing billing. No time for conferences, mentoring, people management or training. It's very tiring. Consulting is built on relationships - with clients AND internally - and that feels like it's being forgotten."}, {"title": "Run From The CDA Group", "text": "Pros Staff, Benefits, Dinner&Learn, Free Parking, Monthly Employee Celebrations Cons Some Acclaris Management placed in positions based on tenure and loyalty only - in some cases skill and leadership experience are non-existent System and reporting issues Training Advice to Management I hate to give only two stars but it is a reflection of the old Acclaris culture and leadership. WTW still has some cleaning up to do. Individuals with leadership titles should carry themselves as leaders, treat their staff with respect, and interact with team members. A good leader does not sit on her lofty throne in a dark cave pretending to know everything.", "rating": 3, "pros": "Staff, Benefits, Dinner&Learn, Free Parking, Monthly Employee Celebrations", "cons": "Some Acclaris Management placed in positions based on tenure and loyalty only - in some cases skill and leadership experience are non-existent", "advice": "I hate to give only two stars but it is a reflection of the old Acclaris culture and leadership. WTW still has some cleaning up to do. Individuals with leadership titles should carry themselves as leaders, treat their staff with respect, and interact with team members. A good leader does not sit on her lofty throne in a dark cave pretending to know everything."}, {"title": "jack of a few trades. You can do better", "text": "Pros You can learn new skills without experience. Pay is ok. You meet all kinds of people Cons No benefits for seasonal employees (not permanent) until after 12 continuous months of service. After that dental was the only affordable option. Permanent offers are not abundant. Work culture hasn't yet made it to the actual company values. Advice to Management Listen to your employees more carefully. Pay attention to the skills people come into the building with instead of assuming everyone is there because they are that inadequate. You can avoid a lot of infantile decisions if you listen to others that may not always agree with your decisions.", "rating": 3, "pros": "You can learn new skills without experience. Pay is ok. You meet all kinds of people", "cons": "No benefits for seasonal employees (not permanent) until after 12 continuous months of service. After that dental was the only affordable option. Permanent offers are not abundant. Work culture hasn't yet made it to the actual company values.", "advice": "Listen to your employees more carefully. Pay attention to the skills people come into the building with instead of assuming everyone is there because they are that inadequate. You can avoid a lot of infantile decisions if you listen to others that may not always agree with your decisions."}, {"title": "Would not recommend", "text": "Pros Receive insurance designation of CISR and state licenses Cons No accountability for performance or room for growth", "rating": 1, "pros": "Receive insurance designation of CISR and state licenses", "cons": "No accountability for performance or room for growth", "advice": null}, {"title": "Benefit Advisor", "text": "Pros Great place to work and great coworkers! Cons Uncertainty about company growth and getting harder to advance", "rating": 5, "pros": "Great place to work and great coworkers!", "cons": "Uncertainty about company growth and getting harder to advance", "advice": null}, {"title": "Senior CSR Client Lead", "text": "Pros Great people to work with. Cons Not enough shift variations.", "rating": 5, "pros": "Great people to work with.", "cons": "Not enough shift variations.", "advice": null}, {"title": "San Diego Service Center", "text": "Pros Once converted to full time associate, position is very secure Cons Poor pay and benefit structure, which continues to get worse year to year with the merger Negligible room for actual advancement or promotion based on merit, people are more often promoted who are not deserving/qualified due to favoritism (i.e. people leave the company and return later with a promotion) Too much time wasted on meaningless PE process Advice to Management Focus on taking care of your employees with better pay and benefits., in turn the employees will be happier and do a better job of taking care of your clients.", "rating": 3, "pros": "Once converted to full time associate, position is very secure", "cons": "Poor pay and benefit structure, which continues to get worse year to year with the merger", "advice": "Focus on taking care of your employees with better pay and benefits., in turn the employees will be happier and do a better job of taking care of your clients."}, {"title": "Customer Service Representative", "text": "Pros Great company to get knowledge of Medicare Ins and supplemental ins industry Cons They offer your insurance but its too expensive. If you come on board as Benefit advisor you make more money. They will help you get your ins license Advice to Management Make ins affordable to all employees", "rating": 1, "pros": "Great company to get knowledge of Medicare Ins and supplemental ins industry", "cons": "They offer your insurance but its too expensive. If you come on board as Benefit advisor you make more money. They will help you get your ins license", "advice": "Make ins affordable to all employees"}, {"title": "Business Analyst", "text": "Pros The acquisition of Acclaris by Willis Towers Watson. Cons benefits are basic with HDHP, work from home option is not applied in a standard manner Advice to Management Focus on career pathing and promotion opportunities for everyone.", "rating": 3, "pros": "The acquisition of Acclaris by Willis Towers Watson.", "cons": "benefits are basic with HDHP, work from home option is not applied in a standard manner", "advice": "Focus on career pathing and promotion opportunities for everyone."}, {"title": "Customer Service Representative", "text": "Pros Self motivated, easily adaptable, optumistic. Cons New to the line of work. Advice to Management N/A", "rating": 5, "pros": "Self motivated, easily adaptable, optumistic.", "cons": "New to the line of work.", "advice": "N/A"}, {"title": "Customer Service Representative", "text": "Pros Associates are offered great benefits. Cons Extremely low pay for work done.", "rating": 3, "pros": "Associates are offered great benefits.", "cons": "Extremely low pay for work done.", "advice": null}, {"title": "wtw", "text": "Pros retirement benefits, flexible work arrangements, people. Cons management, multiple mergers, review process. Professional excellence process is a time waster Advice to Management do a better integrating sales teams with business lines. Way too much attention and wasted time on the PE process", "rating": 5, "pros": "retirement benefits, flexible work arrangements, people.", "cons": "management, multiple mergers, review process. Professional excellence process is a time waster", "advice": "do a better integrating sales teams with business lines. Way too much attention and wasted time on the PE process"}, {"title": "Actuarial Consultant", "text": "Pros Lots of variety of work Cons Company lost a lot of the Towers feeling when they merged with Wyatt", "rating": 5, "pros": "Lots of variety of work", "cons": "Company lost a lot of the Towers feeling when they merged with Wyatt", "advice": null}, {"title": "Administrative Assistant", "text": "Pros Benefits are great Has pension plan Technology is above par Cons No upward mobility in current practice Culture not ideal", "rating": 3, "pros": "Benefits are great", "cons": "No upward mobility in current practice", "advice": null}, {"title": "Opportunites", "text": "Pros They provide ample opportunities to develop and promote employees. Cons Egoism in upper management has developed a disconnect in some employees based upon whether they were Willis or Towers Watson employees before the merger. Advice to Management Further emphasize key employee retention", "rating": 5, "pros": "They provide ample opportunities to develop and promote employees.", "cons": "Egoism in upper management has developed a disconnect in some employees based upon whether they were Willis or Towers Watson employees before the merger.", "advice": "Further emphasize key employee retention"}, {"title": "New to the Company", "text": "Pros Very nice people - always friendly and willing to help Cons Benefits are expensive and slightly below market", "rating": 5, "pros": "Very nice people - always friendly and willing to help", "cons": "Benefits are expensive and slightly below market", "advice": null}, {"title": "So much potential, so little regard for performance", "text": "Pros Flexible and inclusive culture (some locations more than others), interesting work, fantastic colleagues, good benefits, including pension Cons Sub-par base pay, cultural clash due to recent merger, distant leadership", "rating": 3, "pros": "Flexible and inclusive culture (some locations more than others), interesting work, fantastic colleagues, good benefits, including pension", "cons": "Sub-par base pay, cultural clash due to recent merger, distant leadership", "advice": null}, {"title": "Management Guidance", "text": "Pros Good work atmosphere. Managers provide opportunities if you are working for it. Supervisors can be kind hearted and leading if given the opportunity. Cons Managers provide NO training to their supervisors. New software rollouts occur and the supervisors have to teach their managers how to use them. Advice to Management Learn your job and the supervisors job before giving out instructions to do things. Hire directors who have actually worked in a call center before!", "rating": 3, "pros": "Good work atmosphere. Managers provide opportunities if you are working for it. Supervisors can be kind hearted and leading if given the opportunity.", "cons": "Managers provide NO training to their supervisors. New software rollouts occur and the supervisors have to teach their managers how to use them.", "advice": "Learn your job and the supervisors job before giving out instructions to do things. Hire directors who have actually worked in a call center before!"}, {"title": "Merger Changes", "text": "Pros The company is very diverse and supports diversity. Allows for flexible hours and work from home. The benefits have changed with the merger and now offers a pension plan as well as a 401K and 19 vacation days at the start of your hire. Friendly atmosphere. Cons Not necessarily cons, as much as growing pains. The merger has created leadership inconsistencies, too many chiefs and layers. Still 2 separate entities on many levels and trying to merge as one. I would recommend once the merger has settled and the company is established. Advice to Management Need to be MUCH more transparent on the direction the company is going and employee's careers.", "rating": 5, "pros": "The company is very diverse and supports diversity. Allows for flexible hours and work from home. The benefits have changed with the merger and now offers a pension plan as well as a 401K and 19 vacation days at the start of your hire. Friendly atmosphere.", "cons": "Not necessarily cons, as much as growing pains. The merger has created leadership inconsistencies, too many chiefs and layers. Still 2 separate entities on many levels and trying to merge as one. I would recommend once the merger has settled and the company is established.", "advice": "Need to be MUCH more transparent on the direction the company is going and employee's careers."}, {"title": "Senior Consultant", "text": "Pros Collaborative environment, highly engaged coworkers, culture that supports career development Cons Larger company now runs risk of becoming less connected to workforce", "rating": 5, "pros": "Collaborative environment, highly engaged coworkers, culture that supports career development", "cons": "Larger company now runs risk of becoming less connected to workforce", "advice": null}, {"title": "Great momentum to be there.", "text": "Pros New opportunities coming from the merge between Willis and Towers Watson. Highly technical people and great team work. Cons No cons I can think about. Advice to Management Focus on the skilled and technical people of your team as they are the future of the brokers and consultants industry.", "rating": 5, "pros": "New opportunities coming from the merge between Willis and Towers Watson.", "cons": "No cons I can think about.", "advice": "Focus on the skilled and technical people of your team as they are the future of the brokers and consultants industry."}, {"title": "If you are reading this, and you have the ability to forward this feed back, do the right thing.", "text": "Pros The best part of about my time at Willis towers Watson is learning a industry that I had no experience in. The work load is heavy so it teaches you how to adapt. Cons The culture of Willis Towers Watson \"Service center \" is very unprofessional. My onboarding class was lead by a woman who stated \"I don't need to know your name because most of you won't be here long\" . She was completely correct. They hire to fire, I came in with a class of 12 and they fired them all in a four month span. The hire for open enrollment and then once you are not needed they build a file of every error you've had to fire you. Unfortunately I was a asset, so I have kept my position. But only by a thin string. If you are a minority you will have to be twice as good as your peers. And don't you think about challenging authority because you will shamed through the whole service center. This is a environment where you have to stroke you manger or team leads ego for advancement. Your skill has very little to do with it. They all make you feel replaceable and always promoting a dirty fight between peers for advancement. Advice to Management To be more responsible for actions, and take ownership. The managers in the service center definitely need a make over. Be professional and lead by example. Most were handed their jobs because the company was so small. But they expect for you to be perfect and do things they have any Idea how to do.", "rating": 1, "pros": "The best part of about my time at Willis towers Watson is learning a industry that I had no experience in. The work load is heavy so it teaches you how to adapt.", "cons": "The culture of Willis Towers Watson \"Service center \" is very unprofessional. My onboarding class was lead by a woman who stated \"I don't need to know your name because most of you won't be here long\" . She was completely correct. They hire to fire, I came in with a class of 12 and they fired them all in a four month span. The hire for open enrollment and then once you are not needed they build a file of every error you've had to fire you. Unfortunately I was a asset, so I have kept my position. But only by a thin string. If you are a minority you will have to be twice as good as your peers. And don't you think about challenging authority because you will shamed through the whole service center. This is a environment where you have to stroke you manger or team leads ego for advancement. Your skill has very little to do with it. They all make you feel replaceable and always promoting a dirty fight between peers for advancement.", "advice": "To be more responsible for actions, and take ownership. The managers in the service center definitely need a make over. Be professional and lead by example. Most were handed their jobs because the company was so small. But they expect for you to be perfect and do things they have any Idea how to do."}, {"title": "Good Place to Work", "text": "Pros Honest efforts for inclusion and diversity. Good people. Actively striving to do good work. Decent PTO package. Cons Low pay for work done. Frustrating bureaucracy. Some poor team leadership. Advice to Management Take a closer, harder look at some of the leadership and weed out the bad eggs.", "rating": 5, "pros": "Honest efforts for inclusion and diversity. Good people. Actively striving to do good work. Decent PTO package.", "cons": "Low pay for work done. Frustrating bureaucracy. Some poor team leadership.", "advice": "Take a closer, harder look at some of the leadership and weed out the bad eggs."}, {"title": "Analyst", "text": "Pros Nice environment to work in Cons No room for growth in department Advice to Management Allow room for growth within the company", "rating": 5, "pros": "Nice environment to work in", "cons": "No room for growth in department", "advice": "Allow room for growth within the company"}, {"title": "For the industry, it's a top tier firm", "text": "Pros WFH highly encouraged, flexible work hours Cons not very interested in the career development of employee", "rating": 3, "pros": "WFH highly encouraged, flexible work hours", "cons": "not very interested in the career development of employee", "advice": null}, {"title": "Review of WTW", "text": "Pros Great teamwork; good computer systems Cons Very structured; uncertainties due to merger", "rating": 5, "pros": "Great teamwork; good computer systems", "cons": "Very structured; uncertainties due to merger", "advice": null}, {"title": "Consultant", "text": "Pros Excellent teams and company resources. Opportunity for personal development. Cons Slow to implement changes due to size of company. Advice to Management Provide clear personal development plans to associates.", "rating": 5, "pros": "Excellent teams and company resources. Opportunity for personal development.", "cons": "Slow to implement changes due to size of company.", "advice": "Provide clear personal development plans to associates."}, {"title": "Great people", "text": "Pros Really smart and kind people! Fun teams to be a part of, interesting work! Cons Difficult to see sustainable growth path there - particularly as a female. Shifting focus away from work I used to do toward insurance/reinsurance. Advice to Management Be clear about your direction, or employees will assume.", "rating": 5, "pros": "Really smart and kind people! Fun teams to be a part of, interesting work!", "cons": "Difficult to see sustainable growth path there - particularly as a female. Shifting focus away from work I used to do toward insurance/reinsurance.", "advice": "Be clear about your direction, or employees will assume."}, {"title": "Good job", "text": "Pros Great training, great PTO package, relatively easy workload Cons Nothing really, my life requires more money, though. Advice to Management rotate shifts so random people aren't stuck working the night shift", "rating": 5, "pros": "Great training, great PTO package, relatively easy workload", "cons": "Nothing really, my life requires more money, though.", "advice": "rotate shifts so random people aren't stuck working the night shift"}, {"title": "It was a good experience, friendly management and good team work", "text": "Pros The training and frequent, the facility is well kept, there are alot employee activities to enhance team work and friendly management Cons Difficult to move within the company from one department to another despite having the qualifications. Advice to Management Have a better talent retention policy", "rating": 3, "pros": "The training and frequent, the facility is well kept, there are alot employee activities to enhance team work and friendly management", "cons": "Difficult to move within the company from one department to another despite having the qualifications.", "advice": "Have a better talent retention policy"}, {"title": "Nepotism Reigns", "text": "Pros Amazing tools available to help customers. The programmers and web developers have created an amazingly symbiotic system to make the job easier. Cons All management is related. Its a Mormon thing. You can never crack the inner circle of management. Jobs are rarley advertised but just handed over to favorites. The company has been bought out by WTW but this division is treated like a piston in the engine of the Titanic..No one cares. High high staff turnover. No set criteria on firing people at end of season. Its all about who grovels the most to management. Advice to Management This place needs a clean sweep of management because for long it has been run as a partisan polyarchy. Your acquisition has turned this job into a sales job and beneficiaries do not like the pushy tactics. Beware", "rating": 1, "pros": "Amazing tools available to help customers. The programmers and web developers have created an amazingly symbiotic system to make the job easier.", "cons": "All management is related. Its a Mormon thing. You can never crack the inner circle of management. Jobs are rarley advertised but just handed over to favorites.", "advice": "This place needs a clean sweep of management because for long it has been run as a partisan polyarchy. Your acquisition has turned this job into a sales job and beneficiaries do not like the pushy tactics. Beware"}, {"title": "Admin Asst", "text": "Pros Flexible work hours and being able to work from home. Cons Advancement opportunities limited and culture does recognize talent of admins. Advice to Management Recognize your talent because the great talent is leaving. Start from the top down for accountability of performance.", "rating": 3, "pros": "Flexible work hours and being able to work from home.", "cons": "Advancement opportunities limited and culture does recognize talent of admins.", "advice": "Recognize your talent because the great talent is leaving. Start from the top down for accountability of performance."}, {"title": "Human Resources", "text": "Pros The WTW team puts their team members first, hosting various events to engage team members and assist in the work-life balance. Senior team members were supportive of staff growth and continued education. Cons Difficult to move around within the Company, despite the various champions for continued success. As WTW moves to new processes, there is continued resistance from some internal teams/managers, making getting on-board with changes difficult. Advice to Management Remember the value of your team members, thank them for the things that they have done and do what you can to assist them in their career growth. WTW is a great company and it is a shame to lose team members because management stifles their growth.", "rating": 5, "pros": "The WTW team puts their team members first, hosting various events to engage team members and assist in the work-life balance. Senior team members were supportive of staff growth and continued education.", "cons": "Difficult to move around within the Company, despite the various champions for continued success. As WTW moves to new processes, there is continued resistance from some internal teams/managers, making getting on-board with changes difficult.", "advice": "Remember the value of your team members, thank them for the things that they have done and do what you can to assist them in their career growth. WTW is a great company and it is a shame to lose team members because management stifles their growth."}, {"title": "Finance Manager", "text": "Pros Paid well for performance Nice bonus program Cons Watson Wyatt people very kind. Towers Perrin management are cut throat and rude! Advice to Management Customer service training for Towers Management", "rating": 3, "pros": "Paid well for performance", "cons": "Watson Wyatt people very kind. Towers Perrin management are cut throat and rude!", "advice": "Customer service training for Towers Management"}, {"title": "A strong learning experience but without doubt serious reservations before joining.", "text": "Pros From a legacy Willis perspective the merger with Towers has increased brand recognition on your resume. Some very intelligent people and you will learn here. Cons It's difficult where to start. A Benefit Associate at legacy Willis for the majority of my team. It'll be hit and miss depending on the team you're placed on. Some easy-going, others simply terrible. BAs at legacy Willis start off at $40k with zero room for negotiation regardless of experience. You can make between $50-$55k with OT and you will certainly do a lot. The $40k is based on 37.5 hours per week. With the merger they bumped it to 40 hours per week. Naturally, they 'increased' the salary to around $43k. Don't be fooled, this is not a true increase as there is zero chance you'll be doing the base 40 hours a week. Fundamentally this is a wash but they'll pitch to you the $43k nonetheless. They will tell you it takes 1-1.5 years for promotion. Again, I saw one person make it within that time frame. More likely, 1.5-2 years at least. Applicant be warned on the rose tinted image they will be portray. This is simply 'real talk'. Best of luck! Advice to Management They clearly know what they're doing.", "rating": 3, "pros": "From a legacy Willis perspective the merger with Towers has increased brand recognition on your resume. Some very intelligent people and you will learn here.", "cons": "It's difficult where to start. A Benefit Associate at legacy Willis for the majority of my team. It'll be hit and miss depending on the team you're placed on. Some easy-going, others simply terrible.", "advice": "They clearly know what they're doing."}, {"title": "Long term employee", "text": "Pros Being a legacy Willis employee, the company has done a great job of becoming more inclusive and offering a less rigid, flexible work environment than what I was used to in 10+ years with Willis. For the most part, the people are great. Cons As always seemed to be the case at Willis, advancement into more senior positions in the US seems to be based on who you know. Moving within the company is not actively promoted in practice so be prepared to initiate those conversations on your own. Investments being made in the business are focused on what will sound good to prospects and not enough on what will actually help clients make decisions or get better deals. Advice to Management With such a diverse service offering, make a better effort to ensure that some associates get to understand the whole business, and not just their area of expertise. Don't go so far overboard on the diversity and inclusion messaging that you forget about clients.", "rating": 3, "pros": "Being a legacy Willis employee, the company has done a great job of becoming more inclusive and offering a less rigid, flexible work environment than what I was used to in 10+ years with Willis. For the most part, the people are great.", "cons": "As always seemed to be the case at Willis, advancement into more senior positions in the US seems to be based on who you know. Moving within the company is not actively promoted in practice so be prepared to initiate those conversations on your own. Investments being made in the business are focused on what will sound good to prospects and not enough on what will actually help clients make decisions or get better deals.", "advice": "With such a diverse service offering, make a better effort to ensure that some associates get to understand the whole business, and not just their area of expertise. Don't go so far overboard on the diversity and inclusion messaging that you forget about clients."}, {"title": "Showed Favoritism", "text": "Pros Great pay and flexibility on taking off. Great benefits if you make it fulltime. Cons Managers shows favoritism and pay is not fair but it is good pay Advice to Management Stop showing favoritism & make decisions based off performance", "rating": 3, "pros": "Great pay and flexibility on taking off. Great benefits if you make it fulltime.", "cons": "Managers shows favoritism and pay is not fair but it is good pay", "advice": "Stop showing favoritism & make decisions based off performance"}, {"title": "Client Manager", "text": "Pros Great people to work with. Competitive health benefits and PTO. Flexible schedules. Cons The company culture is just okay. Often people don't participate in company events. The only things that is consistent is that things are always changing in regards to systems we use, or leadership, or policies. We are always training for something. Development and a clear path for opportunities for growth are lacking.", "rating": 3, "pros": "Great people to work with. Competitive health benefits and PTO. Flexible schedules.", "cons": "The company culture is just okay. Often people don't participate in company events. The only things that is consistent is that things are always changing in regards to systems we use, or leadership, or policies. We are always training for something. Development and a clear path for opportunities for growth are lacking.", "advice": null}, {"title": "Customer Service Representative", "text": "Pros It is a great company to work for but it is only seasonal. Cons It is seasonal and you could wait for 1 or 2 years before you are a permanent employee.", "rating": 5, "pros": "It is a great company to work for but it is only seasonal.", "cons": "It is seasonal and you could wait for 1 or 2 years before you are a permanent employee.", "advice": null}, {"title": "Win some....", "text": "Pros Beginning to offer cultural events, working from home, pension plans, etc. Cons Some departments are run totally different than others. Many of the employees agree the morale has decreased, however, I believe the company is working to make it better. Advice to Management Be mindful of nepotism and give everyone a fair chance. Actually have the opportunities available to all and not just to some.", "rating": 3, "pros": "Beginning to offer cultural events, working from home, pension plans, etc.", "cons": "Some departments are run totally different than others. Many of the employees agree the morale has decreased, however, I believe the company is working to make it better.", "advice": "Be mindful of nepotism and give everyone a fair chance. Actually have the opportunities available to all and not just to some."}, {"title": "great", "text": "Pros Best intern experience i have ever had Cons There was nothing bad i could report", "rating": 5, "pros": "Best intern experience i have ever had", "cons": "There was nothing bad i could report", "advice": null}, {"title": "Client Service Specialist", "text": "Pros Good entry level positions with training and opportunity for growth for new college graduates Solid Teams Telecommuting available Decent Benefit selection Cons Merger growing pains with layoffs Working hard doesn't bring rewards or job security", "rating": 3, "pros": "Good entry level positions with training and opportunity for growth for new college graduates", "cons": "Merger growing pains with layoffs", "advice": null}, {"title": "Pension Analyst", "text": "Pros Work / Life balance is pretty good Cons Pay is criminal for what is expected Advice to Management Make pay more competitive", "rating": 1, "pros": "Work / Life balance is pretty good", "cons": "Pay is criminal for what is expected", "advice": "Make pay more competitive"}, {"title": "Declining Morale", "text": "Pros The opportunity to work with talented & highly skilled colleagues. Great learning experience in the beginning of your career or for someone new to the industry Able to work from home occasionally Professional work environment Offers bonus program Cons Team structure has changed since the company merger. As a result, my reporting manager is now in a different location, has little to no direct knowledge or first hand experience into my prior or ongoing responsibilities, which does not help much at the moment for annual review process. With many changes all at once, it's hard to buy into the new \"team\" structure when prior work environment provided the luxury of senior experienced leaders providing knowledgeable direction into both personal growth and professional development. Need to fully train new \"Managers\" to be proactive and provide relatable opportunities for those who are serious about moving up in the company. Otherwise no clear direction or career path, even with recent change roll out. \"Managers\" need to make genuine effort to be more involved with newly acquired direct reports. Pay is low and under market. Work hours are overload during AE. Advice to Management Pay associates close to their overall level of experience. Would prefer not to be paid the same as some kid out of college with no direct industry experience. More focused training at all levels and for new managers.", "rating": 3, "pros": "The opportunity to work with talented & highly skilled colleagues.", "cons": "Team structure has changed since the company merger. As a result, my reporting manager is now in a different location, has little to no direct knowledge or first hand experience into my prior or ongoing responsibilities, which does not help much at the moment for annual review process. With many changes all at once, it's hard to buy into the new \"team\" structure when prior work environment provided the luxury of senior experienced leaders providing knowledgeable direction into both personal growth and professional development. Need to fully train new \"Managers\" to be proactive and provide relatable opportunities for those who are serious about moving up in the company. Otherwise no clear direction or career path, even with recent change roll out. \"Managers\" need to make genuine effort to be more involved with newly acquired direct reports.", "advice": "Pay associates close to their overall level of experience. Would prefer not to be paid the same as some kid out of college with no direct industry experience. More focused training at all levels and for new managers."}, {"title": "working at WTW", "text": "Pros The pay is great and they also pay for u to become licensed Cons There is no job stability, No benefits and some of the managers need a reality check! The Richardson location also is infected with bed bugs they have been trying to get rid of them for several months now", "rating": 5, "pros": "The pay is great and they also pay for u to become licensed", "cons": "There is no job stability, No benefits and some of the managers need a reality check! The Richardson location also is infected with bed bugs they have been trying to get rid of them for several months now", "advice": null}, {"title": "Senior Client Services Mgr", "text": "Pros Flexible schedule, pay is good, co workers are friendly to work with and try their best to assist new employees with the lack of management guidance Cons Lacking a team atmosphere. There is no guidance for new employees as it relates to the policies and procedures of Willis Towers Watson as an organization. Without the knowledge of resources available to our clients it is almost impossible to work effectively and efficiently or to be successful in your position. There is a lack of communication between producers, account managers and senior management", "rating": 3, "pros": "Flexible schedule, pay is good, co workers are friendly to work with and try their best to assist new employees with the lack of management guidance", "cons": "Lacking a team atmosphere. There is no guidance for new employees as it relates to the policies and procedures of Willis Towers Watson as an organization. Without the knowledge of resources available to our clients it is almost impossible to work effectively and efficiently or to be successful in your position. There is a lack of communication between producers, account managers and senior management", "advice": null}, {"title": "Work flexibility", "text": "Pros - Promotes work life balance - People in the organization are supportive and you will feel you're part of the team - Has work flexibility especially for employees with kids Cons - There's no clear path on career growth - Hard to promote even yearly rating performance are always Exceed or Far Exceed", "rating": 3, "pros": "- Promotes work life balance", "cons": "- There's no clear path on career growth", "advice": null}, {"title": "Sr. Client Services Specialist", "text": "Pros Work/Life balance, flexibility, great leadership, and great co-workers Cons Salaries and bonuses are not comparable to competition", "rating": 5, "pros": "Work/Life balance, flexibility, great leadership, and great co-workers", "cons": "Salaries and bonuses are not comparable to competition", "advice": null}, {"title": "Growing Company", "text": "Pros Since the recent merger there are a number of opportunities for growth within the company. Cons Need for improved defined roles and improvement of employee structure", "rating": 3, "pros": "Since the recent merger there are a number of opportunities for growth within the company.", "cons": "Need for improved defined roles and improvement of employee structure", "advice": null}]