[{"title": "Whirlwind", "text": "Pros -Decent Pay -Fast paced environment -Good management in the US. Cons -As a start up there are bound to be a lot of changes. In my year of employment at Wimdu there were 2 massive lay offs. First was a national lay off to centralize operations in SF, shortly after the CEO decided to close down US operations altogether. -No transparency from upper management to employees -No Equity -Seems like Upper Management have to direct plan in place and constantly change direction. Advice to Management Stick to one course of action and see it out. Trust your employees more and give them information. Don't close down the most profitable countries operations...", "rating": 3, "pros": "-Decent Pay", "cons": "-As a start up there are bound to be a lot of changes. In my year of employment at Wimdu there were 2 massive lay offs. First was a national lay off to centralize operations in SF, shortly after the CEO decided to close down US operations altogether.", "advice": "Stick to one course of action and see it out. Trust your employees more and give them information. Don't close down the most profitable countries operations..."}, {"title": "Freedom + Chaos", "text": "Pros -Freedom to do whatever you want -Flexibility to work in other projects -Amazing, international team. A lot of (often) wasted talent Cons -Chaos, no clear direction since the acquisition by Novasol -Lack of transparency -Some cases of nepotism -Salary is below the average Advice to Management -Find a clear direction before starting any project -Manage using your brain and not your guts -Huge lack of understanding of the digital market", "rating": 3, "pros": "-Freedom to do whatever you want", "cons": "-Chaos, no clear direction since the acquisition by Novasol", "advice": "-Find a clear direction before starting any project"}, {"title": "Fresh company", "text": "Pros Profesional but fun at the same time, it is the place where I enjoyed the most working. Cons I worked 10h per day and it was never enough!", "rating": 5, "pros": "Profesional but fun at the same time, it is the place where I enjoyed the most working.", "cons": "I worked 10h per day and it was never enough!", "advice": null}, {"title": "No meritocracy in Wimdu Portugal", "text": "Pros Salary paid for 14 months. Cons If you are not Portuguese is hard get a good position even if you work better then others Can't complain about your working evaluation if you don't want to have a cut on your salary At the end of your contract your holidays are not paid Advice to Management Paying the holidays of the people didn't have during the years Don't be racist with the non Portuguese. Everybody have the right to comment the working evaluation without having the salary cut", "rating": 1, "pros": "Salary paid for 14 months.", "cons": "If you are not Portuguese is hard get a good position even if you work better then others", "advice": "Paying the holidays of the people didn't have during the years"}, {"title": "Great people but no vision", "text": "Pros - great people - interesting insights - personal development - nice office - low hierarchy Cons - management without a - no vision - communication between departments - no vision or goals Advice to Management The management should overall show more engagement and have a vision. Focus more on employee and customer needs.", "rating": 3, "pros": "- great people", "cons": "- management without a", "advice": "The management should overall show more engagement and have a vision."}, {"title": "No longer a Start-up and not a company", "text": "Pros nothing, this company is a joke Cons lowest salaries even for Portugal standards. incompetent and arrogant leadership. no improvements to product in YEARS. Advice to Management start looking for employment, the Web Tax is going to give you the last hit", "rating": 1, "pros": "nothing, this company is a joke", "cons": "lowest salaries even for Portugal standards.", "advice": "start looking for employment, the Web Tax is going to give you the last hit"}, {"title": "Ok for internship", "text": "Pros young team, lot of events Cons very repetitive tasks, interns taken not really serious by higher management", "rating": 3, "pros": "young team, lot of events", "cons": "very repetitive tasks, interns taken not really serious by higher management", "advice": null}, {"title": "Fantastic colleagues, terrible company and management", "text": "Pros Great people and social working environment. I learnt a lot from my colleagues and felt supported by them. Cons Extremely badly managed. Zero transparency and little respect for employees - including those loyal to the company for years. Focus from top management was always on making money - not on creating a good product for customers or a positive work environment for employees.", "rating": 3, "pros": "Great people and social working environment.", "cons": "Extremely badly managed.", "advice": null}, {"title": "All hype no product", "text": "Pros Start up environment fast paced, meeting some great guys from all over the world Cons Not realistic targets, product has no identity and constant back end issues with the website. Management straight out of UNI and seemed to be employed by their mates and fairly arrogant about it. No real support. Advice to Management Support your staff dont scold them.", "rating": 3, "pros": "Start up environment fast paced, meeting some great guys from all over the world", "cons": "Not realistic targets, product has no identity and constant back end issues with the website. Management straight out of UNI and seemed to be employed by their mates and fairly arrogant about it. No real support.", "advice": "Support your staff dont scold them."}, {"title": "Online Marketing", "text": "Pros - Flexible - Ever changing - Fast pacing Cons - Uncertain at times - Lots of changes in a short period of time", "rating": 5, "pros": "- Flexible", "cons": "- Uncertain at times", "advice": null}, {"title": "Wimdu", "text": "Pros Decent pay, great atmosphere. Some things can´t be paid. Cons Have to work in shifts. Advice to Management some more perks would be nice.", "rating": 5, "pros": "Decent pay, great atmosphere. Some things can´t be paid.", "cons": "Have to work in shifts.", "advice": "some more perks would be nice."}, {"title": "Good place to work", "text": "Pros - Good work environment and colleagues - Stability - Fun team-building events - Good salary Cons - Needs more feedback and transperancy from managers Advice to Management Work on the people skills as well as keeping a nice atmosphere.", "rating": 5, "pros": "- Good work environment and colleagues", "cons": "- Needs more feedback and transperancy from managers", "advice": "Work on the people skills as well as keeping a nice atmosphere."}, {"title": "Lawyer", "text": "Pros Self-employed law firm, my ownership. Cons No CONS to be entered. Advice to Management Not applicable. ---", "rating": 5, "pros": "Self-employed law firm, my ownership.", "cons": "No CONS to be entered.", "advice": "Not applicable. ---"}, {"title": "Fun company", "text": "Pros I enjoyed working here alot Cons the weather was very cold in berlin", "rating": 3, "pros": "I enjoyed working here alot", "cons": "the weather was very cold in berlin", "advice": null}, {"title": "Product Department Review", "text": "Pros The team is great and led by an experienced Product Owner. I was given a lot of freedom to do my job and at the same time felt like I was part of a supportive, positive team. Cons The company is quite big and it is sometimes a little difficult to move some projects forward as fast as we wanted to. Overall though, the atmostphere in the Product department is quite positive.", "rating": 5, "pros": "The team is great and led by an experienced Product Owner. I was given a lot of freedom to do my job and at the same time felt like I was part of a supportive, positive team.", "cons": "The company is quite big and it is sometimes a little difficult to move some projects forward as fast as we wanted to. Overall though, the atmostphere in the Product department is quite positive.", "advice": null}, {"title": "Second Level Support", "text": "Pros - Enviroment and amazing people - Fruits basked twice per week - Company and team activities Cons - Wrong persons for the middle management positions - Middle management has a lack of knowlege regarding leading people Advice to Management Hire the right people for the relevant positions to motivate and engage the good people", "rating": 3, "pros": "- Enviroment and amazing people", "cons": "- Wrong persons for the middle management positions", "advice": "Hire the right people for the relevant positions to motivate and engage the good people"}, {"title": "Varied experiences at a company in decline", "text": "Pros The people, an awesome international workforce. Opportunities to develop and take on more responsibilities than you would be able to in most companies. Cons High turnover. Poor c-level management. Little concern given to employees and often rash actions are taken, only to be reversed 2 months down the line. Advice to Management Develop a longer term strategy and set employee expectations accordingly. Remove incompetent c-level employees.", "rating": 3, "pros": "The people, an awesome international workforce. Opportunities to develop and take on more responsibilities than you would be able to in most companies.", "cons": "High turnover. Poor c-level management. Little concern given to employees and often rash actions are taken, only to be reversed 2 months down the line.", "advice": "Develop a longer term strategy and set employee expectations accordingly. Remove incompetent c-level employees."}, {"title": "Lead Designer", "text": "Pros Great teams work within a very collaborative environment. Most people embrace a can-do attitude, and fix processes if they're broken. Atmosphere between employees usually very harmonious and productive. Cons Company too focused on revenue and not as much on company philosophy or employee benefit. Advice to Management Connect more with employees, determine a reason to inspire others and follow it.", "rating": 5, "pros": "Great teams work within a very collaborative environment. Most people embrace a can-do attitude, and fix processes if they're broken. Atmosphere between employees usually very harmonious and productive.", "cons": "Company too focused on revenue and not as much on company philosophy or employee benefit.", "advice": "Connect more with employees, determine a reason to inspire others and follow it."}, {"title": "It all depends", "text": "Pros - many interesting areas to work in - interesting industry with growth potential - operations in many countries -backed up by Rocket Internet Cons - Management did make rash financial decisions that turned out unsuccessful -Management did make rash hiring decisions that turned out to be unplanned and many got fired for that sole reason shortly after -Management seemed less professional and serious than necessary at that phase of stark growth Advice to Management - Hire responsibly (not in bulk just to fire a bunch just 2 weeks later) - Make financial decisions responsibly and do not brag about it - Trust more in your work force", "rating": 3, "pros": "- many interesting areas to work in", "cons": "- Management did make rash financial decisions that turned out unsuccessful", "advice": "- Hire responsibly (not in bulk just to fire a bunch just 2 weeks later)"}, {"title": "Software Developer", "text": "Pros Good salary, code quality, nice atmosphere. No one is pushing developers so they can focus on deploying fully tested code. Cons Velocity is too low. Not too much perks & benefits. Management sometimes doesn't understand IT needs and problems. Advice to Management Remember that IT product - website - is the most important thing. Company need to improve it more.", "rating": 5, "pros": "Good salary, code quality, nice atmosphere. No one is pushing developers so they can focus on deploying fully tested code.", "cons": "Velocity is too low. Not too much perks & benefits. Management sometimes doesn't understand IT needs and problems.", "advice": "Remember that IT product - website - is the most important thing. Company need to improve it more."}, {"title": "Good company to start a new life in Lisbon", "text": "Pros International atmosphere, great colleagues, lots of benefits and team buildings. You will laugh a lot. Cons The company itself is still very young, so procedures and almost everything changes very quickly. Wimdu should focus more on what they wanna become and go for it. Advice to Management Continue working on long term strategy and pay more attention to customers feedback. Make some little changes if necessary, but focus on the long term plan. Fix every little detail that is bothering the users and just make it perfect. Plus renovate bathrooms in the office in Lisbon and do something with those attacking ants!", "rating": 5, "pros": "International atmosphere, great colleagues, lots of benefits and team buildings. You will laugh a lot.", "cons": "The company itself is still very young, so procedures and almost everything changes very quickly. Wimdu should focus more on what they wanna become and go for it.", "advice": "Continue working on long term strategy and pay more attention to customers feedback. Make some little changes if necessary, but focus on the long term plan. Fix every little detail that is bothering the users and just make it perfect."}, {"title": "Good experience to learn how to manage stress", "text": "Pros Good work environment Fun team-building events Amazing product Good place to start your work-experience at Cons Overall lack of 'knowhow' in most Management positions Very poor use of Data-Analysis Most management decisions are not evidence-based Lack of vision, typical Rocket top-down Management Poorly articulated Inter-Departmental communication Advice to Management Make an effort to base your decisions on 'verified' data and hold on to your best collaborators", "rating": 3, "pros": "Good work environment", "cons": "Overall lack of 'knowhow' in most Management positions", "advice": "Make an effort to base your decisions on 'verified' data and hold on to your best collaborators"}, {"title": "Beware of the good reviews. They're a lie!", "text": "Pros International vibe. Colleagues are overall cool. With caos comes opportunity, which is good and bad. Cons There has been a trend in fake good reviews for Wimdu in the last months. The last good reviews have been put to fool you into thinking Wimdu is a great place to work. They're not true. Wimdu is a place, where developers run away from and only mediocre people stay and thrive. There's a culture of \"averageness\" that pervades everything. There is nothing else to learn here, so if you're looking for a company to develop your abilities, forget about it. Advice to Management There is no course and everyone knows it.", "rating": 1, "pros": "International vibe.", "cons": "There has been a trend in fake good reviews for Wimdu in the last months.", "advice": "There is no course and everyone knows it."}, {"title": "Lost in the enterprise", "text": "Pros Wimdu has one of the best teams around: young, broad and competent. Relaxed working environment. Good wages. Cons The management has no clear plan to achieve success: everybody just seem to do meetings all the time and piling new features on that add little value to existing product. Too much focus on little details, like A/B testing and behavioural optimizations, and too lazy product design. It's a copycat that survived too long the initial phase and know can't differentiate. Advice to Management Management should focus over building a great product to acquire new customers", "rating": 3, "pros": "Wimdu has one of the best teams around: young, broad and competent.", "cons": "The management has no clear plan to achieve success: everybody just seem to do meetings all the time and piling new features on that add little value to existing product.", "advice": "Management should focus over building a great product to acquire new customers"}, {"title": "Opportunities are yours for the taking", "text": "Pros During my interview process I was asked 'what do you want to get out of this job?' - this was a surprise as normally interviews can often be more about 'what can you bring to us?'. And it was not just a passing comment, in my time here I have been allowed to develop and pursue my own ideas/solutions to problems that interest me, that I have been able to research and identify. This is a very rich experience for future career. The team here are now settled, positive and growing with people who are committed to making a great product. Of course not everyday can be roses and this will take a lot of hard work, but in general, it's a great place to develop your career while working with some very talented people on a product that you have direct impact on. I have also found management to be approachable, enthusiastic and happy to discuss your ideas and thoughts. Cons Office is not exactly in the funnest of locations in terms of local shops and bars. Seats and desks are quite basic. Sound system for big meetings needs some work. Advice to Management Develop and share the longterm plan further.", "rating": 5, "pros": "During my interview process I was asked 'what do you want to get out of this job?' - this was a surprise as normally interviews can often be more about 'what can you bring to us?'. And it was not just a passing comment, in my time here I have been allowed to develop and pursue my own ideas/solutions to problems that interest me, that I have been able to research and identify. This is a very rich experience for future career.", "cons": "Office is not exactly in the funnest of locations in terms of local shops and bars. Seats and desks are quite basic. Sound system for big meetings needs some work.", "advice": "Develop and share the longterm plan further."}, {"title": "An amazing future ahead", "text": "Pros Wimdu is a company with great opportunities to grow. New departments are created, new positions are open, new goals rise and that's the beauty of working in an online business and a start-up company! Everyday at Wimdu is a new day - I feel excited to come to work. The colleagues are as good as they could be, one could imagine that having such different nationalities and cultures could create issues but actually it just enhances the free spirit and the constant brain storming that we live at Wimdu. Besides this motivating environment, a lot of events take place - lasertag, summer party, etc - and also there are a lot of protocols that give real discounts and opportunities to Wimdu's employees. Just because I work at Wimdu I get gym membership for the lowest price ever, as well as special menus at restaurants, and even great discounts at high-end hairdressers! One of the most important things to keep me motivated is having feedback and the management here always wants me to tell my ideas and to know how I'm feeling towards this or that. It's like I really belong and my opinion matters - I feel like a valuable piece of the Wimdu family. I just hope to continue to grow! Cons Some employees always leave the kitchen dirty and it's lack of respect for the others. Advice to Management Keep giving feedback and concerning about employees' feelings - that's what engages us!", "rating": 5, "pros": "Wimdu is a company with great opportunities to grow. New departments are created, new positions are open, new goals rise and that's the beauty of working in an online business and a start-up company!", "cons": "Some employees always leave the kitchen dirty and it's lack of respect for the others.", "advice": "Keep giving feedback and concerning about employees' feelings - that's what engages us!"}, {"title": "Good Opportunities for development in Product and Dev", "text": "Pros - Great team of friendly colleagues and a very informal culture - The management recognises talent and allows self development in a direction desired by the employee - Opportunities to generate own ideas and implement them when clear business case is created - The organisation has demonstrated it is capable of success and is moving in the right direction Cons - Certain internal processes are ill defined or non existant sometimes resulting in confusion during projects Advice to Management Continue working on long term strategy and customer value", "rating": 5, "pros": "- Great team of friendly colleagues and a very informal culture", "cons": "- Certain internal processes are ill defined or non existant sometimes resulting in confusion during projects", "advice": "Continue working on long term strategy and customer value"}, {"title": "A great place to work", "text": "Pros Working at Wimdu has a lot of perks. The best one is that it is easy to come to work always with a smile, because the environment is very friendly, really good, very international, and you feel that you work for a common goal. Although it is no longer a start-up, the working, growing and developing feeling still exists, which makes your day very dynamic and every day is a surprise. There is still space for learning, which makes it very rewarding. I always felt and also feel that I am recognized for my work, and fairly treated. I started in Supply department, then had the opportunity to start working in Customer Support. An internal position opened to the Quality Department and that is how I started working as a Quality manager and trainer. Learned a lot, still do. Wimdu not only allows, but promotes growing inside the company. The company also offers a lot of protocols with a wide range of companies; and last but not least team events that actually are fun and fruitful. Cons Sometimes, there is quite a fair gap between new tasks you work on and recognition in your salary. There is also space to improve with a more eco-friendly attitude.", "rating": 5, "pros": "Working at Wimdu has a lot of perks. The best one is that it is easy to come to work always with a smile, because the environment is very friendly, really good, very international, and you feel that you work for a common goal. Although it is no longer a start-up, the working, growing and developing feeling still exists, which makes your day very dynamic and every day is a surprise. There is still space for learning, which makes it very rewarding. I always felt and also feel that I am recognized for my work, and fairly treated. I started in Supply department, then had the opportunity to start working in Customer Support. An internal position opened to the Quality Department and that is how I started working as a Quality manager and trainer. Learned a lot, still do. Wimdu not only allows, but promotes growing inside the company.", "cons": "Sometimes, there is quite a fair gap between new tasks you work on and recognition in your salary.", "advice": null}, {"title": "Great work environment! Bad management!", "text": "Pros The working environment is really something. All the people are nice and they're friendly with everyone. You're able to express yourself more and be at easy when working. The industry is different but it's worth knowing it specially when you work behind the curtains. Cons The lack of transparency is a major bad point. As a subsidiary the company is under the ever-changing rules of the company and there's nothing one can do, even when we're right and we have to clean their mistakes. The ever-changing rules are also tiresome for the agents and they are not motivated to take a further step to improve, as everything can change in seconds. Short term decisions are incredibly short. Like one week or two and everything changes again. Long term and mid term strategy is an utopia. Advice to Management Pay more attention to the company and the data given by the low level managers in order to see what is really going on in the company. Apply long term strategies instead of extremely short term strategies which are not efficient and it costs the company a lot of money. Keep to the rules the company crates and if it's going to change, please advise all the necessary employees. No one was born with a crystal ball. Policy changes and procedure changes need to be informed. Precognition is not real.", "rating": 3, "pros": "The working environment is really something. All the people are nice and they're friendly with everyone. You're able to express yourself more and be at easy when working. The industry is different but it's worth knowing it specially when you work behind the curtains.", "cons": "The lack of transparency is a major bad point. As a subsidiary the company is under the ever-changing rules of the company and there's nothing one can do, even when we're right and we have to clean their mistakes. The ever-changing rules are also tiresome for the agents and they are not motivated to take a further step to improve, as everything can change in seconds. Short term decisions are incredibly short. Like one week or two and everything changes again. Long term and mid term strategy is an utopia.", "advice": "Pay more attention to the company and the data given by the low level managers in order to see what is really going on in the company. Apply long term strategies instead of extremely short term strategies which are not efficient and it costs the company a lot of money. Keep to the rules the company crates and if it's going to change, please advise all the necessary employees. No one was born with a crystal ball. Policy changes and procedure changes need to be informed. Precognition is not real."}, {"title": "Best office to work in! Fresh and new perspective", "text": "Pros Since I started working at Wimdu, I have felt very much at home, due to the tremendous support received from the management as well as from colleagues. The job is very fulfilling, as it is possible to learn new things every day. The management gives me the autonomy and independency needed to perform my job as well as possible. The office atmosphere is what makes me eager to go to work every morning, since the interaction between all employees is in a good and informal manner, not having the need to get into too many formalities to get things done. I couldn’t be happier with the way the day-to-day goes on in the office. Cons The salary could be a little more in match with the responsibilities and duties one has in the company, as well as reflect the antiquity of the employee and the performance. Advice to Management Overall, Wimdu is a very pleasant and respectable company to work for, and in general terms, the positive sides do outshine the negative ones.", "rating": 5, "pros": "Since I started working at Wimdu, I have felt very much at home, due to the tremendous support received from the management as well as from colleagues. The job is very fulfilling, as it is possible to learn new things every day. The management gives me the autonomy and independency needed to perform my job as well as possible. The office atmosphere is what makes me eager to go to work every morning, since the interaction between all employees is in a good and informal manner, not having the need to get into too many formalities to get things done. I couldn’t be happier with the way the day-to-day goes on in the office.", "cons": "The salary could be a little more in match with the responsibilities and duties one has in the company, as well as reflect the antiquity of the employee and the performance.", "advice": "Overall, Wimdu is a very pleasant and respectable company to work for, and in general terms, the positive sides do outshine the negative ones."}, {"title": "Great Opportunity within Fast paced dynamic environment!", "text": "Pros Working at Wimdu has been a very interesting and pleasant experience. From the very beginning I felt comfortable with everyone, having received great support from high management and co-workers alike. The concept of the business is very interesting, and the implementation of processes and procedures is quick and efficient. The company focuses a lot on the employees and their well-being, making the office a very enjoyable and productive workplace. Because it is still a young company, changes are a very common part of it. I love the new success-driven spirit the company got after the new CEO’s joined the company, with a motivating and encouraging attitude towards everyone, so that we can all achieve the highest success possible. Cons Despite all the positive aspects, like every company, there are certain things that can be improved, for instance, better communication between different departments, so that everyone receives information at the same time, and from official sources. One of the advantages of working in a start-up environment is that because it is a young company, there are big opportunities to grow and to prove your worth. However, because with great power comes great responsibility, it is also a very high demanding environment, which also drives employees who have a high level of vision of success.", "rating": 5, "pros": "Working at Wimdu has been a very interesting and pleasant experience. From the very beginning I felt comfortable with everyone, having received great support from high management and co-workers alike. The concept of the business is very interesting, and the implementation of processes and procedures is quick and efficient. The company focuses a lot on the employees and their well-being, making the office a very enjoyable and productive workplace. Because it is still a young company, changes are a very common part of it. I love the new success-driven spirit the company got after the new CEO’s joined the company, with a motivating and encouraging attitude towards everyone, so that we can all achieve the highest success possible.", "cons": "Despite all the positive aspects, like every company, there are certain things that can be improved, for instance, better communication between different departments, so that everyone receives information at the same time, and from official sources.", "advice": null}, {"title": "great opportunities there for the taking", "text": "Pros there is a lot of freedom given to people who see business opportunities and go for them based on a business case Cons it would be great to have more vacation days", "rating": 5, "pros": "there is a lot of freedom given to people who see business opportunities and go for them based on a business case", "cons": "it would be great to have more vacation days", "advice": null}, {"title": "Fast paced and great IT setup", "text": "Pros - Great IT setup - Learned a huge amount as a career starter - Forward thinking technologically - Great sales setup - Met some great people there Cons - Long hours - Impersonal Mgmt - No feedback", "rating": 5, "pros": "- Great IT setup", "cons": "- Long hours", "advice": null}, {"title": "Do not go there", "text": "Pros Nice people, nothing else really Cons -Lack of vision, upper management has zero clue of how to run a company and how to motivate people. -No career growth opportunities in an industry that is heavily dominated by Airbnb. -There are little incentives for employees to put in that extra effort because the atmosphere in the company is so bad. -Worst company to work for if you want to learn and develop yourself. The only thing that you will learn is how not to manage a company. Advice to Management Get your act together and stop focusing on short-term growth and think of a way of how to survive an European onslaught by Airbnb instead. Either way, you might as well give up because the company is already going downhill with the way you manage the company. Perhaps, also read a book about general management theories.", "rating": 1, "pros": "Nice people, nothing else really", "cons": "-Lack of vision, upper management has zero clue of how to run a company and how to motivate people.", "advice": "Get your act together and stop focusing on short-term growth and think of a way of how to survive an European onslaught by Airbnb instead. Either way, you might as well give up because the company is already going downhill with the way you manage the company. Perhaps, also read a book about general management theories."}, {"title": "Wanna-be big company, managerial joke, slowly sinking ship", "text": "Pros Really talented and amazing people that obviously only stay for a short time as it's easy to find something better. If you're looking for a job to make new friends, then this is the place for you. Also potentially good as a first job, but then again, there's plenty of those out there. Cons No focus. Roadblocks all over each and every step. The feeling of working in a slowly sinking ship. Turn over of staff is huge, from management to employees. Poor employee retention. Poor communication. Poor managerial decisions. Lack of social skills by most of the management. Poor pay. No career development in sight. Have spotted some misogynist attitudes. Advice to Management Know and understand the value of the people that you already have. Nurture them.", "rating": 3, "pros": "Really talented and amazing people that obviously only stay for a short time as it's easy to find something better. If you're looking for a job to make new friends, then this is the place for you. Also potentially good as a first job, but then again, there's plenty of those out there.", "cons": "No focus. Roadblocks all over each and every step. The feeling of working in a slowly sinking ship. Turn over of staff is huge, from management to employees. Poor employee retention. Poor communication. Poor managerial decisions. Lack of social skills by most of the management. Poor pay. No career development in sight. Have spotted some misogynist attitudes.", "advice": "Know and understand the value of the people that you already have. Nurture them."}, {"title": "Great co-workers, bad management", "text": "Pros - very good environment with coworkers Cons - bad management - bad communication among departments - high turnover - changements of processes almost every day without proper communication - decisions from high management often turn out to be bad decisions - almost all motivated, hard working and smart people (from bottom to the top) leave at some point - very low salary since the bonus system changed (again) Advice to Management - start making informed decisions - your employees are the foundation of your company and human beings, stop acting as they where interchangeable at will", "rating": 3, "pros": "- very good environment with coworkers", "cons": "- bad management", "advice": "- start making informed decisions"}, {"title": "Good people, nice work culture.", "text": "Pros a) International team b) Skilled co-workers c) Good pay d) Lot to learn Cons a) Little lack of transperency", "rating": 5, "pros": "a) International team", "cons": "a) Little lack of transperency", "advice": null}, {"title": "Mitigated", "text": "Pros - Good team spirit at department levels - Nice Office with good amenities - The Company can play a major role and drive sustainable innovation - be a role model - in the industry Cons - Lack of a clear Corporate Vision - Lack of Corporate Identity and clearly define Corporate Values - Lack of interconnectivity among the teams - this is kind of obvious when there is such a lack of corporate identity. - The Management pays very little attention to providing a \"good\" not to say High standard quality service - Employees are treated like nothing else than disposables that the company can play with at their ease. Advice to Management While it is obvious that, the priority for a Companies' Management is to ensure that the business is profitable, I would think what is even more important is to ensure the long term profitability, especially in an industry context that is so volatile and more and more competitive. Employee Engagement, Customer Care and Corporate Identity are areas that needs to be promptly addressed if this new management wants to sustain the improved job that are already doing. That can be done without geopartizing the focus that they place in profitability; on the contrary restructuring these areas of the business will certainly boost the profitability index.", "rating": 3, "pros": "- Good team spirit at department levels", "cons": "- Lack of a clear Corporate Vision", "advice": "While it is obvious that, the priority for a Companies' Management is to ensure that the business is profitable, I would think what is even more important is to ensure the long term profitability, especially in an industry context that is so volatile and more and more competitive. Employee Engagement, Customer Care and Corporate Identity are areas that needs to be promptly addressed if this new management wants to sustain the improved job that are already doing. That can be done without geopartizing the focus that they place in profitability; on the contrary restructuring these areas of the business will certainly boost the profitability index."}, {"title": "Still nothing more than a Rocket clone of Airbnb", "text": "Pros There used to be positive aspects like the atmosphere, the level of trust and the general team spirit in the development team and the whole Product & Development department. You could work with a lot of talented, caring and motivated people who were really trying to push this company forward and make it a great place to work at. It also seemed like the previous CEOs were at least trying to establish a good culture and a set of core values within the whole company. Cons None of the positive things mentioned above are true anymore. A series of management changes over the last few months revealed the true face of the company. The new management only needed 3 months to establish an atmosphere of fear, uncertainty and doubt. People were fired without notice for \"questioning authority\" after they gave the wrong kind of feedback. Others were threatened and told that their only job is to follow orders and not question their superiors. The whole Product & Development department got lectured on which kinds of feedback are allowed and which can get you fired. Most of the people in the development team have already left or are in the process of leaving. There seems to be some interest in rebuilding the team from scratch, but it's questionable whether the people currently in charge of that effort will manage to find adequate replacements for all the people who are leaving, at least within the foreseeable future. In general, there seems to be no empathy left for employees, and the rest of fun and exciting startup atmosphere has vanished. Plus now there's even less of an idea how to become more than a clone of Airbnb, which the company has been struggling with for the last three years. There's no innovation, no interest in improving the product, no vision and no leadership. The most valuable thing I learned here is: Don't work for a company that doesn't have a convincing genuine idea at its core. Wimdu definitely doesn't have one. And what's worse, it isn't even trying to find it (anymore). Advice to Management Treat people with respect, value feedback (yes, every kind of feedback), establish an atmosphere of trust and encourage people to take initiative. Being \"professional\" and post-startup doesn't have to equal top-down hierarchical management and process overkill.", "rating": 1, "pros": "There used to be positive aspects like the atmosphere, the level of trust and the general team spirit in the development team and the whole Product & Development department. You could work with a lot of talented, caring and motivated people who were really trying to push this company forward and make it a great place to work at. It also seemed like the previous CEOs were at least trying to establish a good culture and a set of core values within the whole company.", "cons": "None of the positive things mentioned above are true anymore. A series of management changes over the last few months revealed the true face of the company. The new management only needed 3 months to establish an atmosphere of fear, uncertainty and doubt. People were fired without notice for \"questioning authority\" after they gave the wrong kind of feedback. Others were threatened and told that their only job is to follow orders and not question their superiors. The whole Product & Development department got lectured on which kinds of feedback are allowed and which can get you fired.", "advice": "Treat people with respect, value feedback (yes, every kind of feedback), establish an atmosphere of trust and encourage people to take initiative. Being \"professional\" and post-startup doesn't have to equal top-down hierarchical management and process overkill."}, {"title": "Bad management, super high turnover, no career prospects (but nice coworkers)", "text": "Pros Very good environment with coworkers: this is almost the only pro I can think of. Cons bad management, super bad communication among departments, high turnover, no hopes of learning something new or of career advancement, decisions from high management seem to be made arbitrarily and often turn out to be bad decisions: this reflects badly on the whole company although a lot of people working here are motivated, hard working and smart (in fact, almost all of them leave at some point). also, new CEOs want it to move from a startup to a \"profitable company\" which means all of the advantages of startup have been taken away suddenly, while none of the advantages of a big corporate company are anywhere in sight. Advice to Management I hope the management will start making informed decisions, and start giving a chance to their employees.", "rating": 3, "pros": "Very good environment with coworkers: this is almost the only pro I can think of.", "cons": "bad management, super bad communication among departments, high turnover, no hopes of learning something new or of career advancement, decisions from high management seem to be made arbitrarily and often turn out to be bad decisions: this reflects badly on the whole company although a lot of people working here are motivated, hard working and smart (in fact, almost all of them leave at some point). also, new CEOs want it to move from a startup to a \"profitable company\" which means all of the advantages of startup have been taken away suddenly, while none of the advantages of a big corporate company are anywhere in sight.", "advice": "I hope the management will start making informed decisions, and start giving a chance to their employees."}, {"title": "Lack of focus", "text": "Pros Great people. Open climate between co-workers. Nice working hours. Cons Lack of direction. Crappy CEOs that does a lot of micro managing.", "rating": 3, "pros": "Great people. Open climate between co-workers. Nice working hours.", "cons": "Lack of direction. Crappy CEOs that does a lot of micro managing.", "advice": null}, {"title": "Worst working experience ever.", "text": "Pros Nice co-workers ( glassdoor says you must enter at least 5 words for pros but I can't think of another one) Cons Pay was low but decent. However, the worst is that I learned NOTHING during a year. Also dealing with arrogant, unethical and EXTREMELY incompetent managers and C-level executives made the experience much worse. I would not recommend working or supporting this company or Rocket Internet's copycats. Advice to Management YOU ARE NOT MARK ZUCKEBERG NOR STEVE JOBS. Stop acting as if you were. Realizing that you could not even create a profitable company in more than 4 years (with more than 90 million euros of initial funding) and that most people who have worked in Wimdu disapprove of you, should make you a bit more humble.", "rating": 1, "pros": "Nice co-workers ( glassdoor says you must enter at least 5 words for pros but I can't think of another one)", "cons": "Pay was low but decent. However, the worst is that I learned NOTHING during a year. Also dealing with arrogant, unethical and EXTREMELY incompetent managers and C-level executives made the experience much worse. I would not recommend working or supporting this company or Rocket Internet's copycats.", "advice": "YOU ARE NOT MARK ZUCKEBERG NOR STEVE JOBS. Stop acting as if you were. Realizing that you could not even create a profitable company in more than 4 years (with more than 90 million euros of initial funding) and that most people who have worked in Wimdu disapprove of you, should make you a bit more humble."}, {"title": "Stay away from this company and his arrogant managers.", "text": "Pros Good atmosphere, good company events and international environment. Cons Really bad management with the worst values - not ethical at all. Literally they were stalking people from Airbnb through Facebook and by phone (Google Forbes' article \"Is This Airbnb Knock-Off Google-Stalking Potential Hosts?\"). They fired me one month after they renewed my contract (after three years) together with twenty colleagues because \"strategical grounds\". Advice to Management Be more humble and start treating your employees as people and not as garbage.", "rating": 1, "pros": "Good atmosphere, good company events and international environment.", "cons": "Really bad management with the worst values - not ethical at all. Literally they were stalking people from Airbnb through Facebook and by phone (Google Forbes' article \"Is This Airbnb Knock-Off Google-Stalking Potential Hosts?\"). They fired me one month after they renewed my contract (after three years) together with twenty colleagues because \"strategical grounds\".", "advice": "Be more humble and start treating your employees as people and not as garbage."}, {"title": "Cool and ambitious people, stay away!", "text": "Pros - Young company although no longer a start-up - International environment and offices Berlin (HQ, where the management is) and Lisbon (Customer care) - Cool business based on Internet and shared economy Cons - You can be cut with little (1 month) or no notice just because strategy has changed like, every month or two (just read other comments by other \"Wimdudes\" for further confirmation). And merit won't help you out. I personally assisted to a big cut of people who had been working there for 4 years and since day one. Also assisted at a colleague being offered a promotion and getting cut 1 week later (during her training) because of \"business reasons\". Unfortunately there are more, and relevant one. I guess the first argument should anyway have already helped you realize this is not a Company to work for. Advice to Management Don't always accept and try to please people above you. Those below you are also important and deserve to be treated fairly. Pay more attention during the recruiting process. \"Business reasons\" is no good excuse to cut somebody hired because of wrong planning. And it should definitely be the Company paying for its mistake. I know you actually realize the working environment is important. Nonetheless having a personnel turnover of 80% in a year won't make any better..", "rating": 1, "pros": "- Young company although no longer a start-up", "cons": "- You can be cut with little (1 month) or no notice just because strategy has changed like, every month or two (just read other comments by other \"Wimdudes\" for further confirmation). And merit won't help you out. I personally assisted to a big cut of people who had been working there for 4 years and since day one. Also assisted at a colleague being offered a promotion and getting cut 1 week later (during her training) because of \"business reasons\".", "advice": "Don't always accept and try to please people above you. Those below you are also important and deserve to be treated fairly."}, {"title": "Wimdu's ugly face", "text": "Pros There is great diversity at Wimdu, you will work with people from all over the world. At the time I worked there, the engineering and product department was full of experienced, talented and friendly people. I guess that at the time you are reading this, most of them will be gone though. Cons Multiple people in the engineering and product department have been let go (without notice!) for \"questioning authority\" after giving (constructive) feedback to the new CTO (formerly CTO at Groupon Germany), who has taken away all authority for decision–making from the teams. He started to shout at a colleague in front of the whole department for quitting. As result of this the company sided with the CTO and handed out warnings and contract terminations to people. It looks as though there is a new company culture now – employees are treated as resources, not like human beings and experts at their job.", "rating": 1, "pros": "There is great diversity at Wimdu, you will work with people from all over the world. At the time I worked there, the engineering and product department was full of experienced, talented and friendly people. I guess that at the time you are reading this, most of them will be gone though.", "cons": "Multiple people in the engineering and product department have been let go (without notice!) for \"questioning authority\" after giving (constructive) feedback to the new CTO (formerly CTO at Groupon Germany), who has taken away all authority for decision–making from the teams. He started to shout at a colleague in front of the whole department for quitting. As result of this the company sided with the CTO and handed out warnings and contract terminations to people. It looks as though there is a new company culture now – employees are treated as resources, not like human beings and experts at their job.", "advice": null}, {"title": "I was working your Wimdu, and I wouldn't say it's a healthy company.", "text": "Pros People are lovely, helfpul and are great to work with. Work- life balance - OK. HR is disorganized, the same as CEOs, CTOs and higher management in general. Cons Everything that was promised on the interview, was pretty much a lie. Company is going into the wrong direction and I would not reccomend working there. It's a waste of time. This may vary, depends in which department you've been working in. Advice to Management Listen to people, they have valuable thoughts about the company. And they are your greatest value. If you stick to the one plan, don't change your plans after two months.", "rating": 1, "pros": "People are lovely, helfpul and are great to work with. Work- life balance - OK. HR is disorganized, the same as CEOs, CTOs and higher management in general.", "cons": "Everything that was promised on the interview, was pretty much a lie. Company is going into the wrong direction and I would not reccomend working there. It's a waste of time.", "advice": "Listen to people, they have valuable thoughts about the company. And they are your greatest value."}, {"title": "Great experience and a lot to learn", "text": "Pros Strong support from upper managers to improving education with 10% time for Marketing and 20% in Product&IT A lot of opportunity for growth, some exciting projects and a very supportive environment from my managers. There are frequent team events and social parties. The company is young and growing. Cons You will have a very difference experience depending on which department you work for. Operations is still a factory churning through people and the work look very repetitive. Advice to Management Stick with a strategy for a period of time to get a reasonable results. A great amount of false positives and false negatives simply because the CEOs need momentum at the cost of results.", "rating": 5, "pros": "Strong support from upper managers to improving education with 10% time for Marketing and 20% in Product&IT", "cons": "You will have a very difference experience depending on which department you work for. Operations is still a factory churning through people and the work look very repetitive.", "advice": "Stick with a strategy for a period of time to get a reasonable results. A great amount of false positives and false negatives simply because the CEOs need momentum at the cost of results."}, {"title": "typical rocket top-down-management", "text": "Pros free drinks fruits etc big initial learning for junor people 8 hours tops / day in IT, rather less Cons no passion no trust in future projects and the typical hire & fire as well as top-down management", "rating": 3, "pros": "free drinks fruits etc", "cons": "no passion", "advice": null}, {"title": "Great Experience, Low Salary", "text": "Pros Great environment, amazing coworkers and a lot of great parties. It's a start-up so you keep changing positions and that's great because you learn a lot more. You don't need a lot of expertise from the begging and you'll get training from time to time. Cons Low salaries. In time you'll get more responsibilities and you'll keep the same paycheck as if you're an intern. Management is not very good or precise and needs working on it. Advice to Management Keep doing some surveys to get what's going wrong in the company. Pay the employees better. Acknowledge that you have people with diverse skills in the company - take advantage of that!", "rating": 3, "pros": "Great environment, amazing coworkers and a lot of great parties. It's a start-up so you keep changing positions and that's great because you learn a lot more. You don't need a lot of expertise from the begging and you'll get training from time to time.", "cons": "Low salaries. In time you'll get more responsibilities and you'll keep the same paycheck as if you're an intern. Management is not very good or precise and needs working on it.", "advice": "Keep doing some surveys to get what's going wrong in the company. Pay the employees better. Acknowledge that you have people with diverse skills in the company - take advantage of that!"}, {"title": "Love the start-up culture but dont think its meant for everyone", "text": "Pros Perfect place to help you realize your own entrepreneurism Cons Might not have the benefit you can get at the same level of job elsewhere Advice to Management Consider better fringe benefits for employees", "rating": 5, "pros": "Perfect place to help you realize your own entrepreneurism", "cons": "Might not have the benefit you can get at the same level of job elsewhere", "advice": "Consider better fringe benefits for employees"}, {"title": "Efficient but relaxed work environment. Family like atmosphere with a flat hierarchy. Hours are reasonable", "text": "Pros Colleagues were all very nice, gives autonomy to employees Cons Pay could be a little bit better", "rating": 3, "pros": "Colleagues were all very nice, gives autonomy to employees", "cons": "Pay could be a little bit better", "advice": null}, {"title": "SEO internship", "text": "Pros - Great people, great atmosphere. Cons - Job is not that interesting, pay is decent for Berlin Advice to Management Detect interns with potential and make them work on more interesting projects.", "rating": 5, "pros": "- Great people, great atmosphere.", "cons": "- Job is not that interesting, pay is decent for Berlin", "advice": "Detect interns with potential and make them work on more interesting projects."}, {"title": "Rocket Internet startup, therefore very tough, challenging, and not always good working conditions", "text": "Pros it's like working for a startup bootcamp, so you can learn how to ramp up a company within just weeks, though you may question whether or not you're willing to use the same strategies if its your own company Cons german headquarters run the company often by threats, they ramp up the office really quick so the quality of colleagues may not be great", "rating": 3, "pros": "it's like working for a startup bootcamp, so you can learn how to ramp up a company within just weeks, though you may question whether or not you're willing to use the same strategies if its your own company", "cons": "german headquarters run the company often by threats, they ramp up the office really quick so the quality of colleagues may not be great", "advice": null}, {"title": "unhealthy company", "text": "Pros I had overall a nice experience at Wimdu because I've been working a lot, I was willing to learn and I show dedication. My 2 years at Wimdu allowed me to grow professionally and get the required experience to go further. Cons So many things are wrong in that company. How can people believe in what their doing and the product if the CEOs don't believe in the product? CEOs have no clear vision, they just want to sell the company as soon as possible to cash in their shares. It lacks a clear vision and it's truly a shame. It could have become something great but management has done a terrible job. Advice to Management Management would definitely win by respecting employees and being more transparent. Believe in what you are doing. Listen to you employees, they are your best asset", "rating": 3, "pros": "I had overall a nice experience at Wimdu because I've been working a lot, I was willing to learn and I show dedication. My 2 years at Wimdu allowed me to grow professionally and get the required experience to go further.", "cons": "So many things are wrong in that company. How can people believe in what their doing and the product if the CEOs don't believe in the product? CEOs have no clear vision, they just want to sell the company as soon as possible to cash in their shares. It lacks a clear vision and it's truly a shame. It could have become something great but management has done a terrible job.", "advice": "Management would definitely win by respecting employees and being more transparent. Believe in what you are doing. Listen to you employees, they are your best asset"}, {"title": "Fantastische Online-Marketing-Erfahrung in einem dynamischen und wachsenden Start-Up.", "text": "Pros - Junge und dynamische Atmosphäre - Internationales Umfeld mit mehr als 30 verschiedenen Nationalitäten - Deutschkurse, Sport, Aktivitäten und Lieferservice für Essen - Passionierte und zielorientierte Menschen - Freiheit, Verantwortung vom Management - Man lernt von Menschen mit außergewöhnlichem Hintergrund und jeder Menge Erfahrung - Weiterbildung und persönliche Entwicklung - Berufliche Chancen und interne Aufstiegsmöglichkeiten - Gute Abteilungsleitung - Anspruchsvolle und interessante Vorgaben und Ziele - Geräumiges und geselliges Büro - Kostenloses Obst, Essen und Getränke - Young and dynamic atmosphere - International environment with more than 30 different nationalities - German courses, sports, activities and food delivery - Passionate and result driven people - Freedom, responsibility from management - Learning from some people with exceptional backgrounds with lots of experience - Training and personal developement - Career and internal promotion oppertunities - Good department leadership - Challenging and interesting targets and goals - Spacious and social office - free fruit, drinks and food Cons - Abteilungsübergreifende Kommunikation und Transparenz - Bessere Übereinstimmung bei Aufgaben und Projekten - Stärkerer Fokus auf langfristige Vorgaben und Ziele - Cross department communication and transparency - Better consistency in tasks and projects - More focus on long term goals and targets Advice to Management - Noch größere Transparenz und frühzeitige Kommunikation von der oberen Geschäftsführung - Größerer Einsatz, wenn ein neues Projekt begonnen oder ein Vorhaben angekündigt wird - Ganz allgemein bessere abteilungsübergreifende Übereinstimmung und Kommunikation - Even more transparency and early on communication from upper management - Follow more through when starting a project or stating a plan - More overall cross department consistency and communication", "rating": 5, "pros": "- Junge und dynamische Atmosphäre", "cons": "- Abteilungsübergreifende Kommunikation und Transparenz", "advice": "- Noch größere Transparenz und frühzeitige Kommunikation von der oberen Geschäftsführung"}, {"title": "Super Lernerfahrung:)", "text": "Pros Es ist eine wirklich ausgezeichnete Bildungserfahrung. Gerade, wenn man denkt, man hat etwas raus, dann gibt es etwas neues und frisches, das man zu seinen Fähigkeiten hinzufügen kann. Die Kollegen sind wirklich talentiert, deshalb bekommt man immer wieder eine neue Betrachtungsweise und natürlich lernt man jeden Tag etwas dazu:) Die Atmosphäre ist fantastisch, ich habe hier gute Freunde gefunden. It's truly a great educational experience. Just when you think you've got the hang of things there comes something new and fresh to add to your skills. The co-workers are really talented, so there's always this fresh take on things and of course lots of skill upgrades on a daily basis:) The culture is fantastic, I've made good friends here. Cons Wie bei jeder Geschäftsgründung. Das Tempo ist manchmal überwältigend, wenn man das aber mal überwunden hat, dann bemerkt man es nicht mal mehr. Like every startup. the pace might be overwhelming at times, but once you get past that you don't even notice it anymore. Advice to Management Mehr Team-Aktivitäten wären toll:) More Team events would be great:)", "rating": 5, "pros": "Es ist eine wirklich ausgezeichnete Bildungserfahrung. Gerade, wenn man denkt, man hat etwas raus, dann gibt es etwas neues und frisches, das man zu seinen Fähigkeiten hinzufügen kann. Die Kollegen sind wirklich talentiert, deshalb bekommt man immer wieder eine neue Betrachtungsweise und natürlich lernt man jeden Tag etwas dazu:)", "cons": "Wie bei jeder Geschäftsgründung. Das Tempo ist manchmal überwältigend, wenn man das aber mal überwunden hat, dann bemerkt man es nicht mal mehr.", "advice": "Mehr Team-Aktivitäten wären toll:)"}, {"title": "Ausgezeichnetes und unterstützendes Praktikumsprogramm.", "text": "Pros Viele Möglichkeiten zu lernen und voranzukommen. Möglichkeit, eine bezahlte Stelle im Unternehmen zu bekommen. Harte Arbeit und Ideenreichtum werden honoriert. Der Lohn für die aufgewendete Zeit ist überdurchschnittlich. Lots of opportunity to learn and progress. Opportunity to obtain a paid position at the company. Hard work and ideas are rewarded. The compensation for your time is higher than the average. Cons Das Unternehmen leidet manchmal unter den gleichen Problemen, die andere Start-Ups durchmachen. The company sometimes suffers from the same problems other start-ups experience. Advice to Management Transparenz ist die beste Art und Weise, ein Start-Up zu führen. Transparency is the best way to run a start-up.", "rating": 5, "pros": "Viele Möglichkeiten zu lernen und voranzukommen.", "cons": "Das Unternehmen leidet manchmal unter den gleichen Problemen, die andere Start-Ups durchmachen.", "advice": "Transparenz ist die beste Art und Weise, ein Start-Up zu führen."}, {"title": "Schnell und hektisch, positiv gemeint!", "text": "Pros Viel Verantwortung & mit Tempo! A lot of responsibility & fast paced! Opportunity to work on many different projects across many departments! Friendly environment, people & a lot of parties! Cons Ein bisschen stressig und man bräuchte mehr Zeit, um zu fokussieren. A bit stressful and more time to focus required. Advice to Management Die Angestellten sollten Deutsch lernen dürfen! Allow your employees to learn German!", "rating": 5, "pros": "Viel Verantwortung & mit Tempo!", "cons": "Ein bisschen stressig und man bräuchte mehr Zeit, um zu fokussieren.", "advice": "Die Angestellten sollten Deutsch lernen dürfen!"}, {"title": "Gute Absicht, unprofessionelles Umfeld", "text": "Pros Neue Entwickler können viel lernen. Praktikanten und unerfahrene Entwickler arbeiten mit erfahrenen Entwicklern zusammen und bekommen ständige Bewertungen. There are lots of learning opportunities for junior developers. Interns and junior developers are working along with senior developers and get constant feedback. Cons Das Umfeld ist chaotisch, es gibt auch viele widersprüchliche Entscheidungen, Missinformation und Mikro-Management. Für erfahrene Entwickler gibt es nicht viele Schulungen oder Karrierechancen. The environment is chaotic, plus there are lots of contradicting decisions, misinformation and micromanagement. Not many learning or career opportunities for senior developers.", "rating": 1, "pros": "Neue Entwickler können viel lernen. Praktikanten und unerfahrene Entwickler arbeiten mit erfahrenen Entwicklern zusammen und bekommen ständige Bewertungen.", "cons": "Das Umfeld ist chaotisch, es gibt auch viele widersprüchliche Entscheidungen, Missinformation und Mikro-Management. Für erfahrene Entwickler gibt es nicht viele Schulungen oder Karrierechancen.", "advice": null}, {"title": "Wimdu", "text": "Pros lustiges Umfeld mit tollen Menschen fun environment with great people Cons ineffiziente Vertriebsstrategie und Überstunden ineffective sales strategy and late hours Advice to Management Dreh- und Angelpunkt pivot", "rating": 3, "pros": "lustiges Umfeld mit tollen Menschen", "cons": "ineffiziente Vertriebsstrategie und Überstunden", "advice": "Dreh- und Angelpunkt"}, {"title": "Schlechtester Arbeitgeber aller Zeiten", "text": "Pros Es gibt nichts, was man sagen kann. Warum, wer hört zu There is nothing you can sat why who listens Cons Das Management dazu zu bringen, einem zuzuhören. Es scheint, dass das Management taubstumm ist. getting them to listen to you seems the management is deaf and dumb Advice to Management Leute würdigen. Wie können Sie eigenartig sein, wenn sie UPS erst 3 Jahre später erstellen, wenn das Meiste Ihrer Datenbank ist Homeaway, airbnb oder andere Konkurrenten? Irgendjemand, der es im Sinne hat, hier zu arbeiten, hat falsch gedacht, und ich spreche aus Erfahrung. Ich habe ein paar Jahre hier verbracht und muss im Rückblick sagen, was für eine Verschwendung es war. appreciate people , putting together a UPS 3 yrs later when most of your database is either Homeaway airbnb or other competitors how can you be unique, anyone looking to work here think again and I am talking from experience I spent few years here and must say looking back what a waste it was", "rating": 1, "pros": "Es gibt nichts, was man sagen kann. Warum, wer hört zu", "cons": "Das Management dazu zu bringen, einem zuzuhören. Es scheint, dass das Management taubstumm ist.", "advice": "Leute würdigen. Wie können Sie eigenartig sein, wenn sie UPS erst 3 Jahre später erstellen, wenn das Meiste Ihrer Datenbank ist Homeaway, airbnb oder andere Konkurrenten?"}, {"title": "Finger weg, wenn Sie nicht ausgenutzt werden möchten", "text": "Pros - Gute Team-Bande - Lebenserfahrung - Good Team Bonding - Life Experience Cons Schreckliches Management, oder besser das Fehlen eines Managements. Dem Unternehmen fehlen klare Ziele oder Strukturen. Das Unternehmen ist auf Praktikanten aufgebaut, während mehrere Schlüsselpositionen mit unerfahrenen Angestellten ausgefüllt sind. Während die allgemeine Stimmung unter den Teams als gut beschrieben werden kann, schwankt die allgemeine Atmosphäre im Unternehmen zwischen Frustration und Enttäuschung. Während in der Regel nicht alles mit der Einstellung von Praktikanten falsch ist, heuert sie das Unternehmen doch als billige Arbeitskräfte-Alternative ohne wirkliche Absicht an, sie langfristig an Bord zu behalten. Was zu einem ständigen Zustand der Desorganisation und dem Verlust von Wissen führt. Die meisten Praktikanten, die eingestellt werden, sind sich nicht bewusst, dass das nicht ist, was ein Praktikum sein sollte - zwar ist die Arbeit nicht schwer, aber alles, was man lernt, lässt sich in 2 Stunden erzählen. Arbeit besteht immer und immer wieder aus den gleichen niederen Aufgaben. Das größte Problem könnte sein, dass das Management - vor allem Arne Bleckwenn und Hinrich Dreiling, keine Ahnung haben, wie man mit Menschen umgeht und ein Unternehmen führt. Ihr Mangel an direkter und intelligenter Führung verstärkt nur das Gefühl, dass Wimdu ein Copy-Cat-Klon von AirBnb auf der Suche nach einem schnellen Exit (den sie klar verpasst haben) ist. Sobald das Geldverbrennen von Rocket Internet nachlässt, wird die Firma zusammenklappen. Terrible management, or better the lack of management. The company lacks clears goals or structures. The company is built up on interns, while several key positions are filled by inexperienced employes. While the general atmosphere amongst the teams could be describe as good, the general company atmosphere sways between frustration and disappointment. While there isnt generally anything wrong with hiring interns, the company hires them as a cheap labor alternative with no real intention of keeping them on board for the long term, which results in a constant state of disorganization and loss of knowledge. Most interns who get hired, aren't aware that this isn't what an Internship should be like - and while the work isn't hard, everything that one learns can be summed up in 2 hours. Work consists of the same menial tasks over and over again. The biggest issue might be the fact that the management - especially Arne Bleckwenn and Hinrich Dreiling have no clue how to \"people manage\" and run a company. Their lack of direct and intelligent leadership only enhances the feeling that Wimdu is a copy cat clone of AirBnb looking for a quick exit (which they have clearly missed). Once the burn money from Rocket Internet subsides, the company will fold. Advice to Management Klare Unternehmensziele definieren. Erstellen Sie eine richtige Hierarchie. Setzen Sie Prioritäten. Sprechen Sie ehrlich und direkt mit Angestellten. Entfernen Sie Arne Bleckwenn aus dem Management. Define clear company goals. Build a proper hierarchy. Set task priorities. Speak honestly and directly with employes. Remove Arne Bleckwenn from the management.", "rating": 1, "pros": "- Gute Team-Bande", "cons": "Schreckliches Management, oder besser das Fehlen eines Managements. Dem Unternehmen fehlen klare Ziele oder Strukturen.", "advice": "Klare Unternehmensziele definieren. Erstellen Sie eine richtige Hierarchie. Setzen Sie Prioritäten. Sprechen Sie ehrlich und direkt mit Angestellten. Entfernen Sie Arne Bleckwenn aus dem Management."}, {"title": "SSU - selbst anmelden", "text": "Pros - Kollegen - Kostenloser Kaffee, kostenloses Obst - wöchentliche Abteilungssitzung - Bonus - Team-Events, Jahrestage - colleagues - free coffe / free fruits - weekly department meeting - bonus - team events, anniversairies Cons - sich wiederholende Arbeit - mehr als 40 Arbeitsstunden pro Woche - Stress - extra harte Arbeit, um Bonus zu erreichen - repetitive work - more than 40 working hours per week - stress - need to work extra hard to reach bonus Advice to Management - mehr Mitarbeiter einstellen, die Vergütung gerechter machen - hire more people, make the remuneration fairer", "rating": 5, "pros": "- Kollegen", "cons": "- sich wiederholende Arbeit", "advice": "- mehr Mitarbeiter einstellen, die Vergütung gerechter machen"}, {"title": "Sehr traurige Umgebung", "text": "Pros Lustige junge Kollegen, internationales Team funny young colleagues international team Cons Das Management ist nicht nur unerfahren, sondern auch respektlos und ahnungslos, zwingt Menschen extrem lange zu arbeiten (habe persönlich mehr als 16 Stunden pro Tag über einen längeren Zeitraum gearbeitet) und sogar am Wochenende ohne Bezahlung. Es ist unglaublich, dass diese Art von gezwungener Arbeit immer noch in einem Land wie Deutschland möglich ist. the management besides being unexperienced, disrespectful and clueless, forcing people to work extremely long hours (personally been working over 16 hrs a day during long periods of time) and also weekends without paying. it is unbelievable that this kind of forced labor is still possible in a country like germany.", "rating": 1, "pros": "Lustige junge Kollegen, internationales Team", "cons": "Das Management ist nicht nur unerfahren, sondern auch respektlos und ahnungslos, zwingt Menschen extrem lange zu arbeiten (habe persönlich mehr als 16 Stunden pro Tag über einen längeren Zeitraum gearbeitet) und sogar am Wochenende ohne Bezahlung.", "advice": null}]