[{"title": "Great company to work for", "text": "Pros Great management in the department I worked for Cons Bonus structure doesn't go down the chain far enough", "rating": 5, "pros": "Great management in the department I worked for", "cons": "Bonus structure doesn't go down the chain far enough", "advice": null}, {"title": "Great people to work with and advancement opportunities", "text": "Pros Great people to work with which often times become more like family than colleagues, beautiful offices with open floor plan, good benefits, 401k plan, competitive salaries, and amazing coffee machines. Cons I don't work any cons because I work with an amazing team, and we all get along very well. The only issue we have is that we're not being sold to Vantiv and I will truly miss my position and colleagues.", "rating": 5, "pros": "Great people to work with which often times become more like family than colleagues, beautiful offices with open floor plan, good benefits, 401k plan, competitive salaries, and amazing coffee machines.", "cons": "I don't work any cons because I work with an amazing team, and we all get along very well. The only issue we have is that we're not being sold to Vantiv and I will truly miss my position and colleagues.", "advice": null}, {"title": "Recruiter", "text": "Pros Strong company with excellent benefits and a great inclusive culture. Optimistic about Vantiv-Worldpay partnership and the good that will come of it both for merchants and agents. Cons Limited training and very little assistance finding resources necessary for job success. Advice to Management Continue to build and develop programs and training centered on attracting and retaining agents. Smile and dial may get agents through the door, but without a structured approach to developing and mentoring relationships, including access to new technology, clients will quickly discover the true value of the relationship and seek what is needed elsewhere.", "rating": 5, "pros": "Strong company with excellent benefits and a great inclusive culture. Optimistic about Vantiv-Worldpay partnership and the good that will come of it both for merchants and agents.", "cons": "Limited training and very little assistance finding resources necessary for job success.", "advice": "Continue to build and develop programs and training centered on attracting and retaining agents. Smile and dial may get agents through the door, but without a structured approach to developing and mentoring relationships, including access to new technology, clients will quickly discover the true value of the relationship and seek what is needed elsewhere."}, {"title": "Not One Big Company Really", "text": "Pros Pay and benefits are acceptable, very mixed culture as they have a bunch of companies they have bought over the years that make up the whole environment and they are selling to Vantiv in January so more small companies making up one big company. Cons No sick time, just a PTO allowance.", "rating": 3, "pros": "Pay and benefits are acceptable, very mixed culture as they have a bunch of companies they have bought over the years that make up the whole environment and they are selling to Vantiv in January so more small companies making up one big company.", "cons": "No sick time, just a PTO allowance.", "advice": null}, {"title": "Account Executive AKA Fintech Specialist", "text": "Pros Good sale from recruiter making company sound good along with the pay.....then they take it away from you. Virtual, only thing good. Cons Just run... there is not one good thing about this company unfortunately. They will beat you up everyday no matter how many sales you make. Advice to Management Be honest, just be honest if you can even do that. AND to HR Managers, stop the harassment as it really is annoying and maybe, just maybe have a management harassment best practices policy in place that you actually use.", "rating": 1, "pros": "Good sale from recruiter making company sound good along with the pay.....then they take it away from you.", "cons": "Just run... there is not one good thing about this company unfortunately. They will beat you up everyday no matter how many sales you make.", "advice": "Be honest, just be honest if you can even do that."}, {"title": "hard job", "text": "Pros you can get supportive management and they pay you a salary Cons it's just an incredibly hard sale unless you already have a network of people you can go to or can establish a partner Advice to Management focus more on getting employees a partner", "rating": 3, "pros": "you can get supportive management and they pay you a salary", "cons": "it's just an incredibly hard sale unless you already have a network of people you can go to or can establish a partner", "advice": "focus more on getting employees a partner"}, {"title": "RUUUUUUUUUUUN", "text": "Pros Atlantic station is a beautiful location so you are able to go out during lunch and shop at the local stores Cons Where do I start, no process or procedures in place. The US business has given the company a black eye for constantly not meeting numbers and goals, IT is a mess with incompetent leaders in place, thus the reason the CEO based out of the U.K. decided to sell to Vantiv. US jobs will be impacted, the CEO has already notified US employees and told them that there will be given at least 3 months severance package and the max is 6 months severance The company has to many individuals who have been there more than 10 years and they are part of the problem, Keeping old legacy applications in place. Not using best practices and instead doing your thing. Constantly hiring your friends who are not qualified. Advice to Management My advice to management is to look for another job, once the Vantiv merger is complete, you will be the first to go, I GURANTEE IT", "rating": 1, "pros": "Atlantic station is a beautiful location so you are able to go out during lunch and shop at the local stores", "cons": "Where do I start, no process or procedures in place. The US business has given the company a black eye for constantly not meeting numbers and goals, IT is a mess with incompetent leaders in place, thus the reason the CEO based out of the U.K. decided to sell to Vantiv. US jobs will be impacted, the CEO has already notified US employees and told them that there will be given at least 3 months severance package and the max is 6 months severance The company has to many individuals who have been there more than 10 years and they are part of the problem, Keeping old legacy applications in place. Not using best practices and instead doing your thing. Constantly hiring your friends who are not qualified.", "advice": "My advice to management is to look for another job, once the Vantiv merger is complete, you will be the first to go, I GURANTEE IT"}, {"title": "Challenging, but interesting", "text": "Pros There is challenging work that can have a real, meaningful impact on the business Interesting business There are some really great people that work at Worldpay Woman CEO Cons Completely Open Working Environment impacts productivity Many systems issues that a result of legacy decisions not to invest in infrstructure Being bought by Vantiv Advice to Management Continue to invest in making things better for the customer Revamp the business model Compensate sales for positive customer experiences.", "rating": 3, "pros": "There is challenging work that can have a real, meaningful impact on the business", "cons": "Completely Open Working Environment impacts productivity", "advice": "Continue to invest in making things better for the customer"}, {"title": "Poor Management", "text": "Pros Great place to say you have worked Cons Poor management only one person can help you and they are helping everyone on the floor . Advice to Management SMH", "rating": 1, "pros": "Great place to say you have worked", "cons": "Poor management only one person can help you and they are helping everyone on the floor .", "advice": "SMH"}, {"title": "Train Wreck", "text": "Pros They pay you well and benefits are great. The location is stellar. Atlantic Station is very nice, with many shops and restaurants. Cons Management. Not all educated / degreed people are leaders. Soft skills are something you either have or get the manager the necessary training. Reevaluate performance at 3 and 6 month intervals. You lost a really good person due to a managers inability to lead, without being offensive and making personal remarks. Shame on you for not listening. Parking is a nightmare, far too costly to be sustainable. Advice to Management VP’s: Listen to your employees. Not just your managers. If more than one person is telling you a “leader” is the problem - look into it. Take action. Be accountable.", "rating": 1, "pros": "They pay you well and benefits are great. The location is stellar. Atlantic Station is very nice, with many shops and restaurants.", "cons": "Management.", "advice": "VP’s: Listen to your employees. Not just your managers."}, {"title": "Manager", "text": "Pros Work in Midtown Atlanta. Cons Lack of development for vital Work applications that results in many manual work around processes. Lack of Leadership or direct vision from Executive team Lack of Sales Leadership to understanding needs and wants of customers", "rating": 3, "pros": "Work in Midtown Atlanta.", "cons": "Lack of development for vital Work applications that results in many manual work around processes.", "advice": null}, {"title": "Lead Gen Specialist", "text": "Pros Great environment. Really supportive team. Personable CEO and directors. Cons Lack of full transparency to employees solely from my personal account during my tenure.", "rating": 5, "pros": "Great environment. Really supportive team. Personable CEO and directors.", "cons": "Lack of full transparency to employees solely from my personal account during my tenure.", "advice": null}, {"title": "Developer", "text": "Pros Generally nice coworkers, flexible schedule Cons Old decrepit office, old computers, lack of general direction especially after the Vantiv acquisition Advice to Management Management should realize that people are looking at jobs elsewhere as there is no morale or incentive to stay", "rating": 3, "pros": "Generally nice coworkers, flexible schedule", "cons": "Old decrepit office, old computers, lack of general direction especially after the Vantiv acquisition", "advice": "Management should realize that people are looking at jobs elsewhere as there is no morale or incentive to stay"}, {"title": "Sucks", "text": "Pros Decent pay and bonus Cons No room for growth at all", "rating": 3, "pros": "Decent pay and bonus", "cons": "No room for growth at all", "advice": null}, {"title": "Worker", "text": "Pros PTO which is needed to maintain your sanity Cons Former and/or long-term leaders set this company up for failure, now with a looming acquisition by Vantiv, those that were just hired to help remedy the years of mismanagement and complacent mindsets, will loose their jobs when we could have pursued other opportunities that didn't lead us to the unemployment line. It is truly is sad to witness the current state that was 100% preventable. Advice to Management Purge those that created the disaster of a US based organization, they are underserving of a golden parachute. The new and very qualified employees should not suffer because we desired to help the organization grow and finally meet basic industry standards that is old news as of 3-4 years ago (at least). Tell everyone ASAP that they are loosing their jobs... some don't see the writing on the wall in bold print.", "rating": 3, "pros": "PTO which is needed to maintain your sanity", "cons": "Former and/or long-term leaders set this company up for failure, now with a looming acquisition by Vantiv, those that were just hired to help remedy the years of mismanagement and complacent mindsets, will loose their jobs when we could have pursued other opportunities that didn't lead us to the unemployment line. It is truly is sad to witness the current state that was 100% preventable.", "advice": "Purge those that created the disaster of a US based organization, they are underserving of a golden parachute. The new and very qualified employees should not suffer because we desired to help the organization grow and finally meet basic industry standards that is old news as of 3-4 years ago (at least). Tell everyone ASAP that they are loosing their jobs... some don't see the writing on the wall in bold print."}, {"title": "Great Place to work so far", "text": "Pros Competitive salary, generous vacation days and work-life balance Cons For a technology company need more flexability to work from home, no annual bonuses and very manual processes Advice to Management Be more involved in your employees growth. Invest in tools to help each department be successful and competitive in the market", "rating": 5, "pros": "Competitive salary, generous vacation days and work-life balance", "cons": "For a technology company need more flexability to work from home, no annual bonuses and very manual processes", "advice": "Be more involved in your employees growth. Invest in tools to help each department be successful and competitive in the market"}, {"title": "Account Executive", "text": "Pros My direct supervisor is a great person to work with. Cons A company in transition and from my perspective, it's a very bumpy ride. Advice to Management Be proactive vs. reactive", "rating": 3, "pros": "My direct supervisor is a great person to work with.", "cons": "A company in transition and from my perspective, it's a very bumpy ride.", "advice": "Be proactive vs. reactive"}, {"title": "Great Vision - Lost Voyage", "text": "Pros Innovative company with great benefits and salary is above average for similar positions. Cons Limited mobility within the company as it subscribes to the 'good ole boy' concept. Advice to Management Don't be afraid of letting the boat rock a bit. New ideas aren't always comfortable and shouldn't be a reason to overlook a qualified candidate for someone who is not experienced. It only causes more frustration within the organization.", "rating": 3, "pros": "Innovative company with great benefits and salary is above average for similar positions.", "cons": "Limited mobility within the company as it subscribes to the 'good ole boy' concept.", "advice": "Don't be afraid of letting the boat rock a bit. New ideas aren't always comfortable and shouldn't be a reason to overlook a qualified candidate for someone who is not experienced. It only causes more frustration within the organization."}, {"title": "Constantly raising customer rates. Not good.", "text": "Pros Was better 5 - 7 years ago. Cons I had worked here 7 years. Raised rates on customers almost every 6 months.. Charge largest annual fee in the industry $169. Dealt with many upset customer constantly. Hold times on the phone for customer service can be up to over an hour after the annual fee is charged. Technology is behind. A lot of technical issues. Many management changes. Went public. Advice to Management Add some consistency.", "rating": 1, "pros": "Was better 5 - 7 years ago.", "cons": "I had worked here 7 years. Raised rates on customers almost every 6 months.. Charge largest annual fee in the industry $169. Dealt with many upset customer constantly. Hold times on the phone for customer service can be up to over an hour after the annual fee is charged. Technology is behind. A lot of technical issues. Many management changes. Went public.", "advice": "Add some consistency."}, {"title": "Not a place with integrity or ethics", "text": "Pros - Work flexibility - Insightful C level execs - Motivated and helpful CEO's Cons - a lot of shoe shining management that are lazy - shady ethics - turnaround time for answers and decisions is very poor - promise to deliver something yet never happens - lack of training and guidance - double standards Advice to Management Educate more, look into management for shady practices and cover up like NCR execs, and don't expect double standards to motivate employees.", "rating": 3, "pros": "- Work flexibility", "cons": "- a lot of shoe shining management that are lazy", "advice": "Educate more, look into management for shady practices and cover up like NCR execs, and don't expect double standards to motivate employees."}, {"title": "Account Executive", "text": "Pros Excellent local management, nothing else Cons Cold calling only into a very crowded market, low name recognition, technologically behind the market. Only those with an active P.O.S. partner are making any money. Turnover is outrageously high. National Sales Management team is a joke, does not deliver. Stay clear of WP Advice to Management Need an entirely new sales model.", "rating": 1, "pros": "Excellent local management, nothing else", "cons": "Cold calling only into a very crowded market, low name recognition, technologically behind the market. Only those with an active P.O.S. partner are making any money. Turnover is outrageously high. National Sales Management team is a joke, does not deliver. Stay clear of WP", "advice": "Need an entirely new sales model."}, {"title": "Area Sales Manager", "text": "Pros Work in NYC and sell i NYC Cons Most awful, abusive, humiliating, berating, unethical set of managers I have ever worked for. Advice to Management Get honest ppl to work for the company so you can stay out of court.", "rating": 1, "pros": "Work in NYC and sell i NYC", "cons": "Most awful, abusive, humiliating, berating, unethical set of managers I have ever worked for.", "advice": "Get honest ppl to work for the company so you can stay out of court."}, {"title": "Competitive", "text": "Pros Very good pay and bonuses. Cons Office Support is not available when working remote.", "rating": 3, "pros": "Very good pay and bonuses.", "cons": "Office Support is not available when working remote.", "advice": null}, {"title": "Salesforce Jr Administrator", "text": "Pros My team was amazing! We genuinely all enjoyed one another and had each others back. Our manager was extremely supportive and equipped us to succeed while trusting us to do our jobs effectively even though he was located in another state. Benefits were great! 20 Days PTO, 5 Floating holidays, up to 5% 401k match, health benefits reasonably priced Cons Vantiv just acquired them, so for employees a lot is unknown right now.", "rating": 5, "pros": "My team was amazing! We genuinely all enjoyed one another and had each others back. Our manager was extremely supportive and equipped us to succeed while trusting us to do our jobs effectively even though he was located in another state. Benefits were great! 20 Days PTO, 5 Floating holidays, up to 5% 401k match, health benefits reasonably priced", "cons": "Vantiv just acquired them, so for employees a lot is unknown right now.", "advice": null}, {"title": "Good place to work", "text": "Pros Open collaboration, the executive team keeps employees informed Cons Lack of employee performance reviews, no support from management, UK bosses do not care about your thoughts or ideas. Advice to Management Have US managers report to leaders in the US. Enforce managers to complete employee performance reviews.", "rating": 5, "pros": "Open collaboration, the executive team keeps employees informed", "cons": "Lack of employee performance reviews, no support from management, UK bosses do not care about your thoughts or ideas.", "advice": "Have US managers report to leaders in the US. Enforce managers to complete employee performance reviews."}, {"title": "Good Place to Learn about Payments", "text": "Pros Great training program for new hires, particularly in operations Management works with you on professional development Cons Pay could be better for responsibility", "rating": 5, "pros": "Great training program for new hires, particularly in operations", "cons": "Pay could be better for responsibility", "advice": null}, {"title": "Big Egos With Little Return", "text": "Pros Location, cafe in building, the view, close to the highway Cons Lack of ability to make sound timely decisions. Lack of advancement to a higher position from within. Constant turnover from Executives. Parking. Lack of competitive salaries. Curt and high strung management. Negative morale. Advice to Management Humility. Be open to others viewpoints. Give back to your employees.", "rating": 3, "pros": "Location, cafe in building, the view, close to the highway", "cons": "Lack of ability to make sound timely decisions. Lack of advancement to a higher position from within. Constant turnover from Executives. Parking. Lack of competitive salaries. Curt and high strung management. Negative morale.", "advice": "Humility. Be open to others viewpoints. Give back to your employees."}, {"title": "Its okay...", "text": "Pros Like my team. My manager is easy to talk to and easy to work with most of the time. Cons Sr Leadership is always changing. Not enough parking, and by the way it is $14 per day to park... Leadership took away offices and cubes to bring in a open floor plan. Most people don't like the open floor plan. It is hard to keep things confidential and too many side conversations. We were promised work from home when we moved to the new building but then new leadership took it away. The UK runs the show and doesn't seem to care about US culture, but since the company might get sold in a few weeks to a US company that might change. Advice to Management Don't promise things you can't keep. Invest in better technology/software.", "rating": 3, "pros": "Like my team. My manager is easy to talk to and easy to work with most of the time.", "cons": "Sr Leadership is always changing. Not enough parking, and by the way it is $14 per day to park... Leadership took away offices and cubes to bring in a open floor plan. Most people don't like the open floor plan. It is hard to keep things confidential and too many side conversations. We were promised work from home when we moved to the new building but then new leadership took it away. The UK runs the show and doesn't seem to care about US culture, but since the company might get sold in a few weeks to a US company that might change.", "advice": "Don't promise things you can't keep. Invest in better technology/software."}, {"title": "Good Place for Long Term Work", "text": "Pros Many employees have been on board for multiple years, even 5, 10, 15 and 20 years. Lots of institutional knowledge still around. Bright and cheerful office space in atlanta - very modern and European in style; upper management very receptive to new ideas Cons Open floor plan distracts some; current parking situation not that hot for many Advice to Management Reinstate telework policies", "rating": 5, "pros": "Many employees have been on board for multiple years, even 5, 10, 15 and 20 years. Lots of institutional knowledge still around. Bright and cheerful office space in atlanta - very modern and European in style; upper management very receptive to new ideas", "cons": "Open floor plan distracts some; current parking situation not that hot for many", "advice": "Reinstate telework policies"}, {"title": "NCR Account Manager", "text": "Pros Pay and the people Cons Managers are not knowledgeable", "rating": 3, "pros": "Pay and the people", "cons": "Managers are not knowledgeable", "advice": null}, {"title": "Good Company, not focused on sales", "text": "Pros The company is willing to spend money on sales and leads. very fun culture and team. Cons terrible products to selll; no emv; payroll finds a way to mess something up every other month; too many steps in sales; I've become use to them, but hours can be long. Average sales hours are 8 am to 6:30pm Advice to Management Get a single CRM that speaks to the entire company and get your payroll under control", "rating": 5, "pros": "The company is willing to spend money on sales and leads. very fun culture and team.", "cons": "terrible products to selll; no emv; payroll finds a way to mess something up every other month; too many steps in sales; I've become use to them, but hours can be long. Average sales hours are 8 am to 6:30pm", "advice": "Get a single CRM that speaks to the entire company and get your payroll under control"}, {"title": "Account Executive", "text": "Pros They offer excellent base salary Cons They expect a lot of closing in a very short time. Very competitive industry. Advice to Management Need a lot of guidance", "rating": 3, "pros": "They offer excellent base salary", "cons": "They expect a lot of closing in a very short time. Very competitive industry.", "advice": "Need a lot of guidance"}, {"title": "Current Employee", "text": "Pros I have worked at Worldpay for 5 years. In that time my very small department has lost and gained several ppl. There are a few perks to being a manager, but not many. I do work from home at least once a week. The building is nice, but I miss my cubes from Morgan Falls. My manager is better than most. Not much else to say.... Cons Benefits are the worst! The pits! No pension, no tuition reimbursement, no help for weight loss, yet premiums go up every year. It is very HARD to get new ppl in my dept. I literally have to beg! Even that doesn't work. My staff rarely gets promoted. Then ppl start to leave and the cycle repeats itself. The culture is not good. At BOA, those ppl were my friends. After 5 years I have one possible friend. That's it. Much more... but you get it. It's probably time to dust the resume off... Advice to Management Listen to your ppl! We work hard for you! RECIPROCATE! We feel left out and behind! We are a team! It should never feel like us vs them.", "rating": 3, "pros": "I have worked at Worldpay for 5 years. In that time my very small department has lost and gained several ppl. There are a few perks to being a manager, but not many. I do work from home at least once a week. The building is nice, but I miss my cubes from Morgan Falls. My manager is better than most. Not much else to say....", "cons": "Benefits are the worst! The pits! No pension, no tuition reimbursement, no help for weight loss, yet premiums go up every year.", "advice": "Listen to your ppl! We work hard for you! RECIPROCATE! We feel left out and behind! We are a team! It should never feel like us vs them."}, {"title": "Underwriting Management & Credit Risk Analysis", "text": "Pros Well established company, benefits, PTO Cons Sales structure, lack of bonus", "rating": 3, "pros": "Well established company, benefits, PTO", "cons": "Sales structure, lack of bonus", "advice": null}, {"title": "Strategic Partnerships", "text": "Pros Extremely engaged executive leadership team currently focused on delivering results through your success. Supportive in all the right ways. Cons Lack of transparency in goal tracking has been an ongoing struggle; although there is no doubt this is now a top priority that will soon be fixed to ensure sales teams are properly advancing toward quota obligations. Advice to Management Remain nimble and success will come through good talent focus.", "rating": 5, "pros": "Extremely engaged executive leadership team currently focused on delivering results through your success. Supportive in all the right ways.", "cons": "Lack of transparency in goal tracking has been an ongoing struggle; although there is no doubt this is now a top priority that will soon be fixed to ensure sales teams are properly advancing toward quota obligations.", "advice": "Remain nimble and success will come through good talent focus."}, {"title": "Could be better", "text": "Pros You work at Atlantic Station. Cons When management gives your team a specific goal to meet and you meet and exceed it, they then take away the tools you used to achieve those goals while telling you the goal has been increased. Advice to Management Stop being petty and showing different groups favor. Train the department to be effective and allow the tools that were in place before to be put back in place.", "rating": 1, "pros": "You work at Atlantic Station.", "cons": "When management gives your team a specific goal to meet and you meet and exceed it, they then take away the tools you used to achieve those goals while telling you the goal has been increased.", "advice": "Stop being petty and showing different groups favor. Train the department to be effective and allow the tools that were in place before to be put back in place."}, {"title": "New Leadership will destroy the company", "text": "Pros Great new building, beautiful offices and a few good people left. Cons Horrible compensation, poor service, no training, company is a complete disaster. Leadership lie, than lie some more to cover lies, than lie to UK about the lies that they lied. Unethical practices with their customers and their employees. Advice to Management Find out why people are leaving, why the customers are leaving. Start there.", "rating": 1, "pros": "Great new building, beautiful offices and a few good people left.", "cons": "Horrible compensation, poor service, no training, company is a complete disaster. Leadership lie, than lie some more to cover lies, than lie to UK about the lies that they lied. Unethical practices with their customers and their employees.", "advice": "Find out why people are leaving, why the customers are leaving. Start there."}, {"title": "Vice President", "text": "Pros WorldPay has a terrific brand and talented employees Cons Much at the company centers on direct interaction w either London or Atlanta Advice to Management Keep working closely together on a global basis", "rating": 5, "pros": "WorldPay has a terrific brand and talented employees", "cons": "Much at the company centers on direct interaction w either London or Atlanta", "advice": "Keep working closely together on a global basis"}, {"title": "Amazing company", "text": "Pros The people, the support, the advance in Technology, great customer service, top-shelf training in Field, classroom, and interactive! Cons I honestly have no cons to report Advice to Management Keep doing exactly what you are doing", "rating": 5, "pros": "The people, the support, the advance in Technology, great customer service, top-shelf training in Field, classroom, and interactive!", "cons": "I honestly have no cons to report", "advice": "Keep doing exactly what you are doing"}, {"title": "Sales manager", "text": "Pros Pay, left alone, corporate support Cons Asked to lie, management is good old boys club", "rating": 5, "pros": "Pay, left alone, corporate support", "cons": "Asked to lie, management is good old boys club", "advice": null}, {"title": "Account Manager", "text": "Pros If you work hard expect nice commission checks Cons Get ready to become a road warrior", "rating": 3, "pros": "If you work hard expect nice commission checks", "cons": "Get ready to become a road warrior", "advice": null}, {"title": "Growing pains", "text": "Pros Great people who really care Cons lack of vision or long term plan is not communicated down stream in a convincing manner Advice to Management Be more transparent but also sincere", "rating": 3, "pros": "Great people who really care", "cons": "lack of vision or long term plan is not communicated down stream in a convincing manner", "advice": "Be more transparent but also sincere"}, {"title": "Do not work here, it's not worth it.", "text": "Pros Back in 2016, you would work with great people while dealing with the typical corporate BS that comes with working for acompany. Now, nothing. Nothing is good about this company. Cons They do not care about their employees and this has been demonstrated time and time again. Individual contributors are the ones running the business as a majority of leadership has no idea what’s going on or how to do anything. I'm very surprised the government hasn't shut down the US side of the business yet. The Office is a fun show to watch, but actually working at a place that is so poorly mismanaged is terrible. Save yourself the pain and stress and work elsewhere. Advice to Management Maybe take a look at the employee surveys you have people fill out, because none of this should be new information.", "rating": 1, "pros": "Back in 2016, you would work with great people while dealing with the typical corporate BS that comes with working for acompany. Now, nothing. Nothing is good about this company.", "cons": "They do not care about their employees and this has been demonstrated time and time again. Individual contributors are the ones running the business as a majority of leadership has no idea what’s going on or how to do anything. I'm very surprised the government hasn't shut down the US side of the business yet. The Office is a fun show to watch, but actually working at a place that is so poorly mismanaged is terrible. Save yourself the pain and stress and work elsewhere.", "advice": "Maybe take a look at the employee surveys you have people fill out, because none of this should be new information."}, {"title": "This is only about Worldpay US", "text": "Pros Company name is recognized and decent benefits. If you like to be lazy when working in customer service, this is the one for you! Cons The products at Worldpay for the US market are far behind the rest of top companies in the marketplace therefore you can't really deliver sales numbers or make bonuses. The only teams that are held to a standard of performance are sales teams. The product department doesn't understand the meaning of \"deadlines\" Sales support is decent but customer service is absolutely below par. Both customers and sales reps are treated like they are a nuisance to deal with and absolutely nothing gets done on the 1st request. The underwriting dept has no leadership that can make any decisions, and they treat all customers as a micro merchant applying for square. There is an initiative to do more e commerce accounts but underwriting doesn't have a clue of how that market operates. Advice to Management Get to work on changing the culture at headquarters where people can actually DO THEIR JOB and have consequences for not doing it, it feels like you are dealing with an institution where no matter how incompetent some people are no one gets fired for it! The new CEO promise to be more customer centric but customers are still getting increases within their 1st 6 months of a 3 year contract and several fees are added by \"mistake\" on a regular basis. The new idea to force the sales of NCR silver by SBU will be the death of that channel because these sellers are merchant services reps not pointing to of sales reps. It also has a direct conflict with their partner model because they are now competing with those same so called partners..", "rating": 1, "pros": "Company name is recognized and decent benefits. If you like to be lazy when working in customer service, this is the one for you!", "cons": "The products at Worldpay for the US market are far behind the rest of top companies in the marketplace therefore you can't really deliver sales numbers or make bonuses.", "advice": "Get to work on changing the culture at headquarters where people can actually DO THEIR JOB and have consequences for not doing it, it feels like you are dealing with an institution where no matter how incompetent some people are no one gets fired for it!"}, {"title": "IT", "text": "Pros There are no pros to working at this company. Cons Management has a pathetic, us vs them attitude. Weak salaries but expect 80 hours a week. Constantly ask for more but never increase man power. Terrible open floor work environment that is completely not secure. The management is terrible at communication and will lie right to your face. No integrity at all. Will tell you how great you are at group meetings then give everyone a 2 percent raise across the board, while Director and above get 20 percent bonuses. Management got their bonuses the same year that they were laying people off. They no longer allow people to work from home, which is going backwards compared to most companies. They lie to the City of Atlanta to get the clean air tax break then do not allow folks to work from home as they claimed they would adding to the traffic problem. Do not have enough parking for employees, so new employees have to pay for their own parking. I could keep going on but this company is pathetic. Advice to Management No point in this, their egos would not allow them to listen to advise.", "rating": 1, "pros": "There are no pros to working at this company.", "cons": "Management has a pathetic, us vs them attitude. Weak salaries but expect 80 hours a week. Constantly ask for more but never increase man power. Terrible open floor work environment that is completely not secure. The management is terrible at communication and will lie right to your face. No integrity at all. Will tell you how great you are at group meetings then give everyone a 2 percent raise across the board, while Director and above get 20 percent bonuses. Management got their bonuses the same year that they were laying people off.", "advice": "No point in this, their egos would not allow them to listen to advise."}, {"title": "Caution", "text": "Pros Good benefits and paid time off Cons Hi level of turnover in upper management. Low pay in IT Open floor environment Cannot work remotely", "rating": 3, "pros": "Good benefits and paid time off", "cons": "Hi level of turnover in upper management.", "advice": null}, {"title": "Good place to work!!!", "text": "Pros Truly a great place to work in getting your feet wet in Point of Sales Technology. Cons The training environment in operations needs definite tweaking. Advice to Management The training environment of operations is the first line of defense. someone should look into correcting the imperfections in the training environment.", "rating": 5, "pros": "Truly a great place to work in getting your feet wet in Point of Sales Technology.", "cons": "The training environment in operations needs definite tweaking.", "advice": "The training environment of operations is the first line of defense. someone should look into correcting the imperfections in the training environment."}, {"title": "Completely Dishonest", "text": "Pros Everything sounded stellar in the interview Cons Not much of anything I was promised actually happened.", "rating": 1, "pros": "Everything sounded stellar in the interview", "cons": "Not much of anything I was promised actually happened.", "advice": null}, {"title": "Director of Mid Market Sales", "text": "Pros Work remotely, great base, flexible Cons Competitive market racing to $0", "rating": 3, "pros": "Work remotely, great base, flexible", "cons": "Competitive market racing to $0", "advice": null}, {"title": "If there was 1/2 star to give that would be too much", "text": "Pros i'm sure the whole organization isn't bad, I hope. Cons Almost everyone I have come into contact with this company has lied or miss lead me in some fashion. They do not care about the employees so how can we expect them to clients/merchants Advice to Management Really take a good look at yourselves and what the founder of this company had in mindwhen it was created.", "rating": 1, "pros": "i'm sure the whole organization isn't bad, I hope.", "cons": "Almost everyone I have come into contact with this company has lied or miss lead me in some fashion. They do not care about the employees so how can we expect them to clients/merchants", "advice": "Really take a good look at yourselves and what the founder of this company had in mindwhen it was created."}, {"title": "A company you can be proud of", "text": "Pros The culture is top notch at all levels Cons Really none to speak of...Keep doing what you .are doing folks Advice to Management Keep listening, and moving forward.", "rating": 5, "pros": "The culture is top notch at all levels", "cons": "Really none to speak of...Keep doing what you .are doing folks", "advice": "Keep listening, and moving forward."}, {"title": "Disfunctional organization", "text": "Pros Honestly, I cannot think of any pro's..... Limited product capability..... I was lied about product road-map ..when I joined organization Cons Terrible comp. plan.... You live month to month in regards to quota... HIGH pressure!!!! You are micro-managed!!!!! Advice to Management Listen to employees.... Slim down top mgmt.... Maybe they should start doing a little bit of work!", "rating": 1, "pros": "Honestly, I cannot think of any pro's..... Limited product capability..... I was lied about product road-map ..when I joined organization", "cons": "Terrible comp. plan.... You live month to month in regards to quota... HIGH pressure!!!! You are micro-managed!!!!!", "advice": "Listen to employees.... Slim down top mgmt.... Maybe they should start doing a little bit of work!"}, {"title": "Sales can't make numbers if Product NEVER delivers. Then why are they called \"Product and Innovation\" team?", "text": "Pros There are some old timers who know what they're doing. If you're an old timer too, chances you know them so your life will be easy. Made new lifelong friends. Had one of the best managers from a managerial perspective I've ever had. Cons All statements are about Worldpay US. 1. Product does not deliver a thing. I'm not just taking products to sell which are badly needed to make Worldpay be \"leaders in modern money\" - what a joke. They don't deliver dates and they are not accountable to anyone in order for new (to them; existing in the marketplace) solutions that their existing and prospective client base is demanding. They ignore emails and pawn things off to other departments. And the Product team is enormous. The new US Worldpay Total product is nothing but SecureNet witha new name. No new features. All emperor's new clothes. Like opening a box of air 2. Who's doing development on new products and existing infrastructure? Hell if I know. I know of 3. That's not standard for payments processor dev staff. Or any size of this operational structure. But make sure it's in SalesForce because that a major investment, again poorly implemented by head nodders and unnecessary meeting makers so they look good to the big guys. 3. Test and Production platforms do not mirror each other enough to ensure EMV certifications will work in the field. Not to mention how late in the game they were to get there. 4. Core teams who dealt with client EMV certifications were made up of \"boys\" with NO payment experience (terminals, merchant services, POS solutions) and we're yes men to the upper Super Egos. The sexist environment disallowed any experienced female to voice her opinion as she might emasculate these hot shot parrots. I saw horrific incidents where most places would have had security escort someone out the door for then way he spoke to several females. HR was never involved. 5. Product/Marketing team took personality tests and then all got together in a room to see \" who was what type.\" We kept charts in our mini cubes so we knew where they fell on the spectrum when dealing with them. Thousands on that silliness. 6. And the best - last CEO took all Senior leadership on a multi-million dollar \"Journey\" through Amsterdam and Europe to help them learn to work together. It ended on a yacht cruise on the Adriatic Sea. This is while the rest of us we're back dealing with a quagmire of nothing to sell and no dates. Money well spent - not. Advice to Management New CEO is supposedly cleaning house. There will be 4 people left. Because of the absurd \"No remote\" under a fascist division, those who haven't been laid off are going other places. Of the 4 left you might have 1 who can help you. This was a great place 10 years ago. Sorry people got lazy and ran it into the ground. The writing is on the wall. No products; no sales. My prediction is Worldpay US will be up for the highest bidder by the end of 2017.", "rating": 3, "pros": "There are some old timers who know what they're doing. If you're an old timer too, chances you know them so your life will be easy.", "cons": "All statements are about Worldpay US.", "advice": "New CEO is supposedly cleaning house. There will be 4 people left. Because of the absurd \"No remote\" under a fascist division, those who haven't been laid off are going other places. Of the 4 left you might have 1 who can help you. This was a great place 10 years ago. Sorry people got lazy and ran it into the ground. The writing is on the wall. No products; no sales. My prediction is Worldpay US will be up for the highest bidder by the end of 2017."}, {"title": "Cronyism at its Maximum Expression", "text": "Pros Nice Bathrooms. Steady paycheck every week Cons This is by far the most dysfunctional organization I’ve had the displeasure of being part of. Just thinking about this place a wave of nausea overcomes my body. They have a cluster of disjointed backend systems and no one at the helm with deep knowledge or mental capacity to put forward a cohesive plan. Their Salesforce implementation is a Frankenstein and various analysts have been telling them this but at the end they chose the person with the most political alliances and the least vision to be the leader. Everything is done in an amateurish fashion and because the people at the top of the foodchain only like to be surrounded by head-nodders, it is a self perpetuating situation. They did a Discus personality assessment of the people at all departments and 80% where D personalities- and they were all so proud of it! The fact that this was at the root of most of their problems was totally lost on them. You have a critical mass of people that don’t like to get into the details because they don’t have the capacity and/or patience for deep thinking and spend their time instead playing political games and figuring out who to hobnob with in order to advance their positions. Spend 90% of the time polishing presentations, making big stinks about font sizes and managing upwards and 10% in tactical execution. Meanwhile the company is going up in flames and no one dares to say anything. Their culture is that everyone is disposable and you better have some strong alliances, ethics do not exist in their world Advice to Management Clean house from the top down. Hire technologists for your ELT not just for Engineering roles. Don't confuse confidence with Talent. You are trying to reinvent yourself as an Technology company- guess what, you are not and will never be, specially by hiring dinosaurs to lead Innovation", "rating": 1, "pros": "Nice Bathrooms. Steady paycheck every week", "cons": "This is by far the most dysfunctional organization I’ve had the displeasure of being part of. Just thinking about this place a wave of nausea overcomes my body. They have a cluster of disjointed backend systems and no one at the helm with deep knowledge or mental capacity to put forward a cohesive plan. Their Salesforce implementation is a Frankenstein and various analysts have been telling them this but at the end they chose the person with the most political alliances and the least vision to be the leader. Everything is done in an amateurish fashion and because the people at the top of the foodchain only like to be surrounded by head-nodders, it is a self perpetuating situation. They did a Discus personality assessment of the people at all departments and 80% where D personalities- and they were all so proud of it! The fact that this was at the root of most of their problems was totally lost on them. You have a critical mass of people that don’t like to get into the details because they don’t have the capacity and/or patience for deep thinking and spend their time instead playing political games and figuring out who to hobnob with in order to advance their positions. Spend 90% of the time polishing presentations, making big stinks about font sizes and managing upwards and 10% in tactical execution. Meanwhile the company is going up in flames and no one dares to say anything. Their culture is that everyone is disposable and you better have some strong alliances, ethics do not exist in their world", "advice": "Clean house from the top down. Hire technologists for your ELT not just for Engineering roles. Don't confuse confidence with Talent. You are trying to reinvent yourself as an Technology company- guess what, you are not and will never be, specially by hiring dinosaurs to lead Innovation"}, {"title": "N/A", "text": "Pros It is great to travel. Cons It is difficult being a remote employee Advice to Management N/A", "rating": 5, "pros": "It is great to travel.", "cons": "It is difficult being a remote employee", "advice": "N/A"}, {"title": "Customer Support Specialist", "text": "Pros Wonderful People. Great Environment. Good pay. Free food on occasion. New implementations such as work games, team spirit were fun. Bonuses Cons Calls seem to never stop. Occurrences comes fast. Very stressful when it comes to merchants calling in back to back to back. - Half of bonus taken with taxes (not company fault) Advice to Management Management is great. Processes need to be tuned for higher call volume.", "rating": 3, "pros": "Wonderful People. Great Environment. Good pay. Free food on occasion. New implementations such as work games, team spirit were fun. Bonuses", "cons": "Calls seem to never stop. Occurrences comes fast. Very stressful when it comes to merchants calling in back to back to back. - Half of bonus taken with taxes (not company fault)", "advice": "Management is great. Processes need to be tuned for higher call volume."}, {"title": "Used and Abused", "text": "Pros A paycheck, and a decent commute before HQ moved to downtown Atlanta. Great co-workers who share the misery of coming to work before they themselves decide to leave for better pastures Cons Ever get conned into something that you didn't feel right about? When I was recruited by Worldpay, I was promised that my industry knowledge would make a difference, I'd be promoted quickly, and I would be rewarded for what I brought to the department. I gave 1.5 years to Worldpay and was done. I felt dirty for what I was asked to do, dirty for the lies I was required to make, dirty for the internal and external customers I had to manipulate. Advice to Management Your elevator pitch stops at floor #2. The Sales Team are the revenue generators, treat them with respect, not like disposable paper cups.", "rating": 1, "pros": "A paycheck, and a decent commute before HQ moved to downtown Atlanta. Great co-workers who share the misery of coming to work before they themselves decide to leave for better pastures", "cons": "Ever get conned into something that you didn't feel right about? When I was recruited by Worldpay, I was promised that my industry knowledge would make a difference, I'd be promoted quickly, and I would be rewarded for what I brought to the department. I gave 1.5 years to Worldpay and was done. I felt dirty for what I was asked to do, dirty for the lies I was required to make, dirty for the internal and external customers I had to manipulate.", "advice": "Your elevator pitch stops at floor #2. The Sales Team are the revenue generators, treat them with respect, not like disposable paper cups."}, {"title": "Manager of Business Developement", "text": "Pros This is a large Company Cons Since Bain Capital bought the company it has gone downhill.", "rating": 1, "pros": "This is a large Company", "cons": "Since Bain Capital bought the company it has gone downhill.", "advice": null}, {"title": "Terrible work culture", "text": "Pros It's honestly almost shocking to think they behave the way they do given it's not the 1960s. The top management is terrible and acts as if hiring and firing people is fun, believes themselves to be running a shark tank show whereby they can fire people before the even begin actually working. I saw this done a couple of times - they have people sitin a conference room every day all day for 3 months of training, then before they are able to start actually working, they fire a couple of them (who have not yet been able to work a single day in their role) because 'not everyone will get through'. Nice. Let people know this is your model before they leave their healthy positions. Aside from this the company still has a lot of culture issues and is full of nepotism. It was embarrassing how often I saw junior colleagues disrespect their boss in front of everyone because they were related to someone in the company and could get away with it. You can do better than working here. Cons Because they have a tough time attracting and keeping people, they pay your deductible for healthcare. Advice to Management Get rid of the people who you know to be causing these problems. They are ridiculous.", "rating": 1, "pros": "It's honestly almost shocking to think they behave the way they do given it's not the 1960s. The top management is terrible and acts as if hiring and firing people is fun, believes themselves to be running a shark tank show whereby they can fire people before the even begin actually working. I saw this done a couple of times - they have people sitin a conference room every day all day for 3 months of training, then before they are able to start actually working, they fire a couple of them (who have not yet been able to work a single day in their role) because 'not everyone will get through'. Nice. Let people know this is your model before they leave their healthy positions. Aside from this the company still has a lot of culture issues and is full of nepotism. It was embarrassing how often I saw junior colleagues disrespect their boss in front of everyone because they were related to someone in the company and could get away with it. You can do better than working here.", "cons": "Because they have a tough time attracting and keeping people, they pay your deductible for healthcare.", "advice": "Get rid of the people who you know to be causing these problems. They are ridiculous."}, {"title": "A Lot of work and not enough payout", "text": "Pros You set your own work schedule depending on your manager. You will get mileage and expenses reimbursed within reason. The account executives are all great people willing to help you learn and grow your business. Cons No salary. This is a strictly commission job so you must put in the work in a ton of work in order to receive compensation. The training stipend runs out and you have to sell to make any money. Advice to Management Set up partner programs for the account executives that feeds them leads. So much turn over its hard to understand the direction of the company.", "rating": 3, "pros": "You set your own work schedule depending on your manager. You will get mileage and expenses reimbursed within reason. The account executives are all great people willing to help you learn and grow your business.", "cons": "No salary. This is a strictly commission job so you must put in the work in a ton of work in order to receive compensation. The training stipend runs out and you have to sell to make any money.", "advice": "Set up partner programs for the account executives that feeds them leads. So much turn over its hard to understand the direction of the company."}, {"title": "Account Executive", "text": "Pros Make your ow schedule, unlimited amount of money to be made Cons Must have your own BOB, will not provide with any partnerships Advice to Management Give more training on how to effectively self source business and partnerships", "rating": 3, "pros": "Make your ow schedule, unlimited amount of money to be made", "cons": "Must have your own BOB, will not provide with any partnerships", "advice": "Give more training on how to effectively self source business and partnerships"}, {"title": "Could be a lot better", "text": "Pros Decent payouts if you work the system Regional managers are the face of my division, if it wasn't for their constant positive motivation I would have quit a month into my employment Fun trips Cons Direct managers are slimy, terrible human beings who care nothing more then their own bank accounts No accountability when direct manager has constantly underperformed Unprotected territory Compete against own company partnerships and ISO's Shady commission structure No advancement opportunities for qualified people Promote a clique environment Top 10% AE's get 90% of the deals, other 90% of the AE's are there to make the numbers look good for the stockholders Unstable environment Management and upper management are always telling us they are going to provide more tools and technology to help us sell but never follow through Constant micromanaging from selling managers, spend way to much time on pointless calls listening to others reps talk Selling managers, keep leads, give them to the reps who brownnose the most Shady sales tactics No face to face help from managers Advice to Management Hold team managers accountable for being terrible managers, stop promoting them because they are ruining the face of your company Give people who deserve it room for growth Stop making false promises Provide direct access to commission team for disputing payouts Stop asking for AE's feedback when you know your not going to follow through with any changes Stop letting Stop letting managers sell, it ruins relationships and kills team chemistry", "rating": 1, "pros": "Decent payouts if you work the system", "cons": "Direct managers are slimy, terrible human beings who care nothing more then their own bank accounts", "advice": "Hold team managers accountable for being terrible managers, stop promoting them because they are ruining the face of your company"}, {"title": "Endless growth opportunities", "text": "Pros If you work hard and come from the \"yes\" place, then the opportunities are endless for you. There's always open positions in different departments and it is very easy to transition into something different if you rise and grind every day-including management opportunities. Cons There's a lot of lazy people that cause a lot of unnecessary frustration, but I think that's anywhere you go. We build alliances with different people as our \"go to\" resources to get stuff done. Advice to Management I'm pretty happy with our management team. Maybe we could do a better job at holding people accountable, but I say that with a grain of salt.", "rating": 5, "pros": "If you work hard and come from the \"yes\" place, then the opportunities are endless for you. There's always open positions in different departments and it is very easy to transition into something different if you rise and grind every day-including management opportunities.", "cons": "There's a lot of lazy people that cause a lot of unnecessary frustration, but I think that's anywhere you go. We build alliances with different people as our \"go to\" resources to get stuff done.", "advice": "I'm pretty happy with our management team. Maybe we could do a better job at holding people accountable, but I say that with a grain of salt."}, {"title": "must work mandatory 'core business hours\" as the CEO mandated and have no option for remote work as a tech professional.", "text": "Pros There are flashes of positivity in the rank and file with some great individual contributors who continue suffer through the changes and micro-management. Cons 1.) Moved to midtown in an overpriced location, no parking for commuters, difficult to get to the office via MARTA 2.) Not enough seating capacity in midtown location for all employees to work at desktop location. You often find yourself having to 'hot' seat workstations or working at tabletops or in break areas. 3.) Trying too hard, needs to figure out who they are; the US HQ part of the company does not have a solidified culture - the open floor plan is not working for them. Facilities management is terrible. Too much noise, too much continued construction to make the open floor plan better and force more team work and collaboration. Yet people still dial into meetings at their workstation even though the meeting room is literally right next to their workstation. 4.) Inept managers, directors, and VPs that need leadership and management training. A lot of lazy people and lazy management who simple ignore requests or lie to cover their rear ends. Too much inter department in-fighting, too many attitudes, and egos are huge. Probably why they moved to an open floor plan - so all the giant egos could move around. Many of the current management have simply attrited their way to their current position on the ladder from the days it was a startup company so they project a sense of entitlement and superioity. 5.) Compensation is below regional and national market levels. As a previous reviewer mentioned - if you have tech skills in Atlanta - you are an in demand commodity and yet Worldpay still under pays their tech salaried positions.", "rating": 1, "pros": "There are flashes of positivity in the rank and file with some great individual contributors who continue suffer through the changes and micro-management.", "cons": "1.) Moved to midtown in an overpriced location, no parking for commuters, difficult to get to the office via MARTA", "advice": null}, {"title": "Going Downhill Fast with another CEO", "text": "Pros None anymore other than 401k match, Cons New building is overfilled to the point that you cannot make a client call in silence. No parking and many employees are going thru pain to get to the office as there is no Marta access either. New CEO has also said no more remote work for IT so many are looking to quit ASAP and work at rivals companies who treat employees better and with respect. Advice to Management Do management know that skilled people in IT are in demand in Atlanta. Why would someone work at world pay when then are treated better at other rivals where they can work at home and park safely without spending an hour in traffic.", "rating": 1, "pros": "None anymore other than 401k match,", "cons": "New building is overfilled to the point that you cannot make a client call in silence. No parking and many employees are going thru pain to get to the office as there is no Marta access either. New CEO has also said no more remote work for IT so many are looking to quit ASAP and work at rivals companies who treat employees better and with respect.", "advice": "Do management know that skilled people in IT are in demand in Atlanta. Why would someone work at world pay when then are treated better at other rivals where they can work at home and park safely without spending an hour in traffic."}, {"title": "Sales", "text": "Pros If you lack integrity - you can make a decent amount of money Cons There is constant turnover so you do not have consistent support. Training is not sufficient in setting you up for success. Managers are poor and do not provide the correct type of support to get you to your goals. The industry lacks integrity - so you have to be ok with misleading your customers to get the sale. Advice to Management Train employees before expecting them to be successful in the field. Take more care in gauging the success of your field Managers in helping their teams reach their goals.", "rating": 1, "pros": "If you lack integrity - you can make a decent amount of money", "cons": "There is constant turnover so you do not have consistent support. Training is not sufficient in setting you up for success. Managers are poor and do not provide the correct type of support to get you to your goals. The industry lacks integrity - so you have to be ok with misleading your customers to get the sale.", "advice": "Train employees before expecting them to be successful in the field. Take more care in gauging the success of your field Managers in helping their teams reach their goals."}, {"title": "Don't waste your time,unemployment or McDonalds would be better", "text": "Pros The last day you work there is your last Cons I have never worked for such greedy, self serving, money grabbing pigs in all my life. Disorganized top to bottom, 3 CEO's in US in 3 years. Customer service is a joke, should be called \"Customer Disservice Department\" I've been in merchant service a long time and I have never seen a company raise contracted rates on EVERYONE in 6 months or less. Annual fee? not on the contract, $169.00 stuck to your hard earned customer. Compensation plan? more like constipation plan. Again, I have never been subjected to HUGE paycut in the middle of the year. Latest CEO is just window dressing ...minoirty female (highly intelligent but was bought and paid for) she'll be gone in a year. 100% turnover rate on regional reps 75% on bank alliance. No base pay for regional people 30K for bank alliance. They'll offer you 28K unrealistic goals so the money really sucks. pad your expense report because you'll need the money. work another job at the same time preferably an ISO so you can eat. Advice to Management Keep your resume up to date", "rating": 1, "pros": "The last day you work there is your last", "cons": "I have never worked for such greedy, self serving, money grabbing pigs in all my life. Disorganized top to bottom, 3 CEO's in US in 3 years. Customer service is a joke, should be called \"Customer Disservice Department\" I've been in merchant service a long time and I have never seen a company raise contracted rates on EVERYONE in 6 months or less. Annual fee? not on the contract, $169.00 stuck to your hard earned customer. Compensation plan? more like constipation plan. Again, I have never been subjected to HUGE paycut in the middle of the year. Latest CEO is just window dressing ...minoirty female (highly intelligent but was bought and paid for) she'll be gone in a year. 100% turnover rate on regional reps 75% on bank alliance. No base pay for regional people 30K for bank alliance. They'll offer you 28K unrealistic goals so the money really sucks. pad your expense report because you'll need the money. work another job at the same time preferably an ISO so you can eat.", "advice": "Keep your resume up to date"}, {"title": "Stay in the UK", "text": "Pros What I know now I can share with everyone and tell them not to work for this company ever. Cons Everything! Pay=sucks base and bonus/commissions - low 30ks base and commissions are at the industry low for sure. Mid year 2016 they screwed everyone and most sales reps seen a 30K+ drop in income. Days off=just stay home and dont tell anyone. Get something out of this company cause they are taking everything from you. Customer Service=What is that? From the worthless employees who work in GA and get bused in from the getos so the company can take a very large tax incentive to the management of little boys trying to be GQ and who worked at the mall or Bestbuy or Panera Bread there is no real customer service. Your customers you sign will be billed rate increases within 6 months if not sooner. Yearly fee they dont tell anyone about, even the Citizens Bank partners they contract with. Worldpay knows the fee, when they will charge and will tell no one till it happens. Then lie about it. Of ya here is a good one for you sell reps looking here. Once your customer leaves for a non sell reps issue within 12 months Worldpay will then take 100% of the commissions they paid you right back. Management=like I said what a lack of. After a person named \"Ron\" left the teams all went down hill and fast. Market managers not caring and just waiting to retire, regionals working more then 1 job , ect... Advice to Management Quite and go find another industry to destroy. I like the payment processing industry and Worldpay and current are making less then being a used car salesperson.", "rating": 1, "pros": "What I know now I can share with everyone and tell them not to work for this company ever.", "cons": "Everything!", "advice": "Quite and go find another industry to destroy. I like the payment processing industry and Worldpay and current are making less then being a used car salesperson."}, {"title": "The best of times, the worst of times", "text": "Pros Securenet was a challenging, learning cohesive employer Cons We were purchased by Worldpay. Advice to Management Get your things in order.", "rating": 3, "pros": "Securenet was a challenging, learning cohesive employer", "cons": "We were purchased by Worldpay.", "advice": "Get your things in order."}, {"title": "Great Changes Happening", "text": "Pros New leadership is taking this company to the next level and I am looking forward to great things in 2017. I am excited to be a part of this journey. Cons With change comes pain, so there are currently some growing pains, but that is to be expected.", "rating": 5, "pros": "New leadership is taking this company to the next level and I am looking forward to great things in 2017. I am excited to be a part of this journey.", "cons": "With change comes pain, so there are currently some growing pains, but that is to be expected.", "advice": null}, {"title": "Loved my job", "text": "Pros I loved the freedom and working on my own time. Building relationships with my customers. Great assistance from my manager and the VP for the area Cons You have to get up everyday and work hard so if you aren't a person who takes responsibility it's not a good company.", "rating": 5, "pros": "I loved the freedom and working on my own time. Building relationships with my customers. Great assistance from my manager and the VP for the area", "cons": "You have to get up everyday and work hard so if you aren't a person who takes responsibility it's not a good company.", "advice": null}, {"title": "Worst culture I've seen", "text": "Pros Not a lot. Payments is a great place to be, Worldpay really falls short. Cons The main issue is the incompetent leadership from the ex global collect people. They were out in top positions with apparently zero healthy leadership ability. They are egotistical to a point of comedy and due to this and incompetency in leadership, create a terrible environment and culture. Don't work there. Advice to Management Fire those guys if you want to succeed. They are ridiculous.", "rating": 1, "pros": "Not a lot. Payments is a great place to be, Worldpay really falls short.", "cons": "The main issue is the incompetent leadership from the ex global collect people. They were out in top positions with apparently zero healthy leadership ability. They are egotistical to a point of comedy and due to this and incompetency in leadership, create a terrible environment and culture. Don't work there.", "advice": "Fire those guys if you want to succeed. They are ridiculous."}, {"title": "Senior Account Representative", "text": "Pros Great products for the merchant to be able to make the sale safely and securely every time and earn a living. Cons Anytime I had a problem I was able to clear it up through direct communication with management. Advice to Management It would be a good idea to listen to more customer service recorded phone messages in order to provide the merchant with better solutions.", "rating": 5, "pros": "Great products for the merchant to be able to make the sale safely and securely every time and earn a living.", "cons": "Anytime I had a problem I was able to clear it up through direct communication with management.", "advice": "It would be a good idea to listen to more customer service recorded phone messages in order to provide the merchant with better solutions."}, {"title": "Old School Corporate America", "text": "Pros Solid business model Interested in growth Good benefits Cons Bureaucracy at its worst Too slow to keep up Unable to make big decisions Advice to Management Figure out your plan and then be agile. Move faster. Cut the bureaucracy.", "rating": 3, "pros": "Solid business model", "cons": "Bureaucracy at its worst", "advice": "Figure out your plan and then be agile."}, {"title": "Company in transition", "text": "Pros Due to the large work force benefits are very reasonable. Team members share a closeness that is unique and wonderful. Corporate location is convenient and sports tons of amenities. Cons Company was brought out by European company which has a different culture then the existing one. Transition in blending is difficult on the employees.", "rating": 3, "pros": "Due to the large work force benefits are very reasonable. Team members share a closeness that is unique and wonderful. Corporate location is convenient and sports tons of amenities.", "cons": "Company was brought out by European company which has a different culture then the existing one. Transition in blending is difficult on the employees.", "advice": null}, {"title": "Need Change", "text": "Pros Can work remote. Corporate training is good/ Cons Sales Management is terrible from VP level and down. Advice to Management Repeal and Replace all sales management.", "rating": 1, "pros": "Can work remote. Corporate training is good/", "cons": "Sales Management is terrible from VP level and down.", "advice": "Repeal and Replace all sales management."}, {"title": "Account executive", "text": "Pros Flexibility Great job for those who are self motivated Fair compensation Full benefits Cons Not up to date with most recent technology", "rating": 5, "pros": "Flexibility", "cons": "Not up to date with most recent technology", "advice": null}, {"title": "Many changes", "text": "Pros Worldpay has a bright future. There are many opportunities for employee growth. Cons With the goal of improvement, a lot of changes are happening at Worldpay. This is probably a good thing. Advice to Management When implementing changes, consider the impact on employees (how they feel, etc.).", "rating": 5, "pros": "Worldpay has a bright future. There are many opportunities for employee growth.", "cons": "With the goal of improvement, a lot of changes are happening at Worldpay. This is probably a good thing.", "advice": "When implementing changes, consider the impact on employees (how they feel, etc.)."}, {"title": "The NCR team is a joke that should be so much more", "text": "Pros Great team to work with Cons disorganized structure. Expected to act as an account management team, without an assigned region or client base. Not provided account management wages even though the job description clearly outlines Account Management is the main job description. Expected to wear too many hats of a fully functioning inbound tech support/customer care line, while also acting as an account manager. Expected to also monitor emails with no actual approved time to read and resolve emailed requests (because your always in queue). Horrible management who only advances men, intentionally takes unwarranted disciplinary action against women on the team who attempt to advance. Advice to Management Get new management. Create an actual account management structure and salary that mirrors NACS account management structure and salary", "rating": 3, "pros": "Great team to work with", "cons": "disorganized structure. Expected to act as an account management team, without an assigned region or client base. Not provided account management wages even though the job description clearly outlines Account Management is the main job description. Expected to wear too many hats of a fully functioning inbound tech support/customer care line, while also acting as an account manager. Expected to also monitor emails with no actual approved time to read and resolve emailed requests (because your always in queue). Horrible management who only advances men, intentionally takes unwarranted disciplinary action against women on the team who attempt to advance.", "advice": "Get new management. Create an actual account management structure and salary that mirrors NACS account management structure and salary"}, {"title": "Decent", "text": "Pros Great learning experience. Make your own schedule Cons Not much coaching from upper management or training.", "rating": 3, "pros": "Great learning experience. Make your own schedule", "cons": "Not much coaching from upper management or training.", "advice": null}, {"title": "no comment", "text": "Pros Great compensation, Great people to work with; a company that always strives to do the \"right thing\" when it comes to the customer. Cons No clear direction in the IT space with a lack of product to sell and lack of industry compliance in the field of EMV. Lost all of its partners last year causing huge turnover in sales and BD. Advice to Management Get together and be on the same page. Listen to the field sellers and give them what they need to sell. Quit letting finance run the company", "rating": 3, "pros": "Great compensation, Great people to work with; a company that always strives to do the \"right thing\" when it comes to the customer.", "cons": "No clear direction in the IT space with a lack of product to sell and lack of industry compliance in the field of EMV. Lost all of its partners last year causing huge turnover in sales and BD.", "advice": "Get together and be on the same page. Listen to the field sellers and give them what they need to sell. Quit letting finance run the company"}, {"title": "Bad Management", "text": "Pros Its in Atlantic Station nice new office space Cons The management and supervisors are horrible ...", "rating": 3, "pros": "Its in Atlantic Station nice new office space", "cons": "The management and supervisors are horrible ...", "advice": null}, {"title": "Account Executive", "text": "Pros Autonomy, your time is yours...Very aggressive incentive ratio. Cons No base salary. 6 week turn around for incentive pay out. Advice to Management Too many mixed messages from Senior leadership. Sales Manager's are over worked.", "rating": 3, "pros": "Autonomy, your time is yours...Very aggressive incentive ratio.", "cons": "No base salary. 6 week turn around for incentive pay out.", "advice": "Too many mixed messages from Senior leadership. Sales Manager's are over worked."}, {"title": "The UK is not always OK", "text": "Pros The company provides a great PTO package. My co-workers were top notch people who were more like family. The facilities are beautiful. Cons The UK took over in January and the feeling is that everyone in the US is being punished for the previous CEO's shortcomings. Work Life Balance is no longer valued. Remote work is being taken away with no real reason. People are now treated like numbers and not individuals. Everyone feels expendable. Advice to Management There are cultural differences between the US and UK. Learn them and understand them. You are alienated your US workforce because you do not understand them.", "rating": 3, "pros": "The company provides a great PTO package. My co-workers were top notch people who were more like family. The facilities are beautiful.", "cons": "The UK took over in January and the feeling is that everyone in the US is being punished for the previous CEO's shortcomings. Work Life Balance is no longer valued. Remote work is being taken away with no real reason. People are now treated like numbers and not individuals. Everyone feels expendable.", "advice": "There are cultural differences between the US and UK. Learn them and understand them. You are alienated your US workforce because you do not understand them."}, {"title": "Account Manager", "text": "Pros Relaxed work enviornment Flexible schedule Cons No growth Product is five years behind", "rating": 3, "pros": "Relaxed work enviornment", "cons": "No growth", "advice": null}, {"title": "Marketing Manager", "text": "Pros Offers great pay and benefits! Cons A toxic and political environment - poor morale! Advice to Management It rolls down hill, so it begins with YOU!", "rating": 1, "pros": "Offers great pay and benefits!", "cons": "A toxic and political environment - poor morale!", "advice": "It rolls down hill, so it begins with YOU!"}, {"title": "Good first impression", "text": "Pros Worldpay is a Global company and this gives you clout when selling. The management style is very hands-off and you are allowed to pursue any vertical you wish. Cons No base salary and little to know lead feed.", "rating": 3, "pros": "Worldpay is a Global company and this gives you clout when selling. The management style is very hands-off and you are allowed to pursue any vertical you wish.", "cons": "No base salary and little to know lead feed.", "advice": null}, {"title": "Account Executive", "text": "Pros You manage your time You can make good money If you have a good manager, as I do, you can learn a lot about this grown business Cons No base salary at all", "rating": 5, "pros": "You manage your time", "cons": "No base salary at all", "advice": null}, {"title": "Borderline poisonous", "text": "Pros Important this is for the eCommerce division in SF not WP US (Atlanta). Payments are hot, largely because of FinTech companies disrupting the status quo. They will fool you with talk of 'technology company' but make no mistake - this is still a slow moving legacy payments company with strong remnants of the RBS days. (Google how the former RBS CEO was stripped of his knighthood). They do have a good roster of cool clients largely due to the \"necessity\" to work with an Acquirer. Seriously, if regulations didn't call for it, they would not sign nor keep their clients. They clients hate them. Just see what they recently did for Etsy. Believe it or not there are some good genuine smart people here. They generally don't last. Cons Where do I start. As with any organization the culture starts at the top. Aside from weak technology this is where they absolutely fall down. I would say this is part RBS legacy (the worst bank in the UK) and half Bain sharks/ mediocre former Global Collect 'mafia' who sit in a bunch of cushy jobs to ride the gravy train (see IPO 2015). Management was too busy patting themselves on their backs for merely keeping pace with a fast market (cross border) to care about their employees. This poisonous attitude filtered down to the rank and file and people would straight throw you under the bus and there would be clicks taking behind your back (for anyone) once you walked away. I've been in political orgs before but this takes the cake. Take a look at how the CEO made 50M pounds (like 75M USD before the Brexit debacle) while the non VP/ SVP employees got little more than a Chevy Chase bonus. Doing business in SF/SV who expect speed while you deal with basically government workers in the UK. Advice to Management Seriously this is the problem. This is the most narcissistic group of people I've ever come across. You've made your money just go crawl under a rock.", "rating": 1, "pros": "Important this is for the eCommerce division in SF not WP US (Atlanta).", "cons": "Where do I start. As with any organization the culture starts at the top. Aside from weak technology this is where they absolutely fall down. I would say this is part RBS legacy (the worst bank in the UK) and half Bain sharks/ mediocre former Global Collect 'mafia' who sit in a bunch of cushy jobs to ride the gravy train (see IPO 2015). Management was too busy patting themselves on their backs for merely keeping pace with a fast market (cross border) to care about their employees. This poisonous attitude filtered down to the rank and file and people would straight throw you under the bus and there would be clicks taking behind your back (for anyone) once you walked away. I've been in political orgs before but this takes the cake.", "advice": "Seriously this is the problem. This is the most narcissistic group of people I've ever come across. You've made your money just go crawl under a rock."}, {"title": "Sales", "text": "Pros This is a great place to work. In most corporations you will not see CEO's or any ELT members. here @ Worldpay they're within arms reach and open for conversation. They have GREAT benefits as well. Cons I think they could do a little more for the employees,, they used to have different events at the job for employees but, they really cut back once they went public. Advice to Management They need to hire more experienced managers with a lot of knowledge in the industry.", "rating": 5, "pros": "This is a great place to work. In most corporations you will not see CEO's or any ELT members. here @ Worldpay they're within arms reach and open for conversation. They have GREAT benefits as well.", "cons": "I think they could do a little more for the employees,, they used to have different events at the job for employees but, they really cut back once they went public.", "advice": "They need to hire more experienced managers with a lot of knowledge in the industry."}, {"title": "Experience at Worldpay", "text": "Pros Great Marketing and Brand Name Cons contracts and rate hikes, along with technology needs to be fixed Advice to Management get leaders and not managers", "rating": 3, "pros": "Great Marketing and Brand Name", "cons": "contracts and rate hikes, along with technology needs to be fixed", "advice": "get leaders and not managers"}, {"title": "Field Sales", "text": "Pros Work from home; flexible time Cons No field support; poor commission structure; company changes plans all the time; suppose to get lifetime residual commissions but outbound sales department steals your customers by locking in the clients pricing which in turn eliminates it as your client; Advice to Management Make things simpler; stick to a commission plan; quit the bait and switch", "rating": 3, "pros": "Work from home; flexible time", "cons": "No field support; poor commission structure; company changes plans all the time; suppose to get lifetime residual commissions but outbound sales department steals your customers by locking in the clients pricing which in turn eliminates it as your client;", "advice": "Make things simpler; stick to a commission plan; quit the bait and switch"}, {"title": "Awful place top work. read carefully these reviews before accepting. I wish I did.", "text": "Pros Gas money, work from home Cons Lack of upper management. Lack of support. However sales support you call on the phone in Atlanta GA. are nice. I have done sales for a long time and NEVER have had seen such an unfair system. I do NOT recommend this company. Telephone meetings at 6;45 am. Which is great if you're a military person. Advice to Management A good manager trains and encourages. I bad manager fires you with a lame excuse. Don't drag people down because the manager YOU picked failed the team. Salary in Nashville TN is 24K and drops down every 3 months. So first 90 days its 2000 a month then they take 500 every 90 days. After that you live a residuals. Never again.", "rating": 1, "pros": "Gas money, work from home", "cons": "Lack of upper management. Lack of support. However sales support you call on the phone in Atlanta GA. are nice. I have done sales for a long time and NEVER have had seen such an unfair system. I do NOT recommend this company. Telephone meetings at 6;45 am. Which is great if you're a military person.", "advice": "A good manager trains and encourages. I bad manager fires you with a lame excuse. Don't drag people down because the manager YOU picked failed the team. Salary in Nashville TN is 24K and drops down every 3 months. So first 90 days its 2000 a month then they take 500 every 90 days. After that you live a residuals. Never again."}, {"title": "Account Executive", "text": "Pros Not a bad comp plan Cons accountability on monthly quota - difficult regional managers to work with Advice to Management teach & train managers how to lead and not micro manage", "rating": 3, "pros": "Not a bad comp plan", "cons": "accountability on monthly quota - difficult regional managers to work with", "advice": "teach & train managers how to lead and not micro manage"}, {"title": "Great starter position", "text": "Pros They pay very well Cons The company seems to not care about the people that have to take their calls and deal with all of their service interruptions which can be mentally draining. You can only move if you know someone. Advice to Management Actually listen to the people that work for you.", "rating": 3, "pros": "They pay very well", "cons": "The company seems to not care about the people that have to take their calls and deal with all of their service interruptions which can be mentally draining. You can only move if you know someone.", "advice": "Actually listen to the people that work for you."}, {"title": "They sold me on the job but then it wasn't great at all!", "text": "Pros I think overall the company could be a great company to work for but... Cons The management team wants you to work 10 to 13 hours a day. It's like working for Hilter. Advice to Management Learn to respect your staff and your staff will respect you.", "rating": 1, "pros": "I think overall the company could be a great company to work for but...", "cons": "The management team wants you to work 10 to 13 hours a day. It's like working for Hilter.", "advice": "Learn to respect your staff and your staff will respect you."}, {"title": "Good employer", "text": "Pros Decent benefits, nice work location Cons splintered management, large workload, high turnover Advice to Management value your employee", "rating": 5, "pros": "Decent benefits, nice work location", "cons": "splintered management, large workload, high turnover", "advice": "value your employee"}, {"title": "Good Starter Job But Don't Get Comfortable!!!", "text": "Pros The benefit package is good and if you have no work experience this would be a good entry-level job. Cons If you are applying stay clear of the operations department (mainly the call center). The calls are ridiculous. The call center employees have to deal with the consequences of the company mishaps. It is a norm to get cussed out by the merchants on a dialy basis. There is always something that is not going to work. You are not valued as employee. You are promoted based off favoritism. The job titles were changed so they don't have to pay you more. The turnover is extremely high. When it comes to your yearly review you are rated and it doesn't matter if you receive a high rating or low rating your pay percentage increase is the same across the board. So that means you can work your behind off and you will get the same increase as someone who barely put forth any efforts. Management does some under handed things and will lie about the smallest thing. You can't trust anyone but your yourself. They also resent you if you stand up for yourself and others. Maybe it's the corporate culture or just bad management. Majority of the supervisors are understanding but there is little they can do. They don't seem to get treated any better so I feel empathy for them. Advice to Management Work on bringing back the great moral that was once there. When I started I enjoyed coming to work but there is negative energy now. Happy employees mean more productive employees. We had a awesome VP and management team at one point and now the current upper management is the worse. Management say they value their employees however their actions speak differently.", "rating": 1, "pros": "The benefit package is good and if you have no work experience this would be a good entry-level job.", "cons": "If you are applying stay clear of the operations department (mainly the call center). The calls are ridiculous. The call center employees have to deal with the consequences of the company mishaps. It is a norm to get cussed out by the merchants on a dialy basis. There is always something that is not going to work. You are not valued as employee. You are promoted based off favoritism. The job titles were changed so they don't have to pay you more. The turnover is extremely high. When it comes to your yearly review you are rated and it doesn't matter if you receive a high rating or low rating your pay percentage increase is the same across the board. So that means you can work your behind off and you will get the same increase as someone who barely put forth any efforts. Management does some under handed things and will lie about the smallest thing. You can't trust anyone but your yourself. They also resent you if you stand up for yourself and others. Maybe it's the corporate culture or just bad management. Majority of the supervisors are understanding but there is little they can do. They don't seem to get treated any better so I feel empathy for them.", "advice": "Work on bringing back the great moral that was once there. When I started I enjoyed coming to work but there is negative energy now. Happy employees mean more productive employees. We had a awesome VP and management team at one point and now the current upper management is the worse. Management say they value their employees however their actions speak differently."}, {"title": "WorldPay Rocks!", "text": "Pros The best management, culture, and incentive plan in the payment processing industry Cons Technology and efficient internal processes Advice to Management Keep doing what you're doing!", "rating": 5, "pros": "The best management, culture, and incentive plan in the payment processing industry", "cons": "Technology and efficient internal processes", "advice": "Keep doing what you're doing!"}, {"title": "Awful company", "text": "Pros The only pro was that you did not have to report to an office every day Cons Part of the training includes not being honest with sales representative. When we are in the field and on appointments we are unaware actually lying to the prospects and customers. The pricing is on the old tiered system that only benefits the company Advice to Management Train your employees correctly and ensure that management is trained and held accountable. I was only able to reach my manager a handful of times in the first 6 months of my employment and he only went out in the field 5 times. I was not able to ride with other account executives and there was no additional training after the 1 week training", "rating": 1, "pros": "The only pro was that you did not have to report to an office every day", "cons": "Part of the training includes not being honest with sales representative. When we are in the field and on appointments we are unaware actually lying to the prospects and customers. The pricing is on the old tiered system that only benefits the company", "advice": "Train your employees correctly and ensure that management is trained and held accountable. I was only able to reach my manager a handful of times in the first 6 months of my employment and he only went out in the field 5 times. I was not able to ride with other account executives and there was no additional training after the 1 week training"}, {"title": "Customer Service", "text": "Pros Very little training with although the training is ok, ample time to learn just a lot of information to know in a few weeks of training. Call volumes stay high not good scheduling in the beginning new people get bad shifts. Cons As stated above, in addition to short breaks and lunches. overall the people are great just took some getting used to o my part as all companies are different. they are great to their employees a lot of employee benefits available and great health care program", "rating": 3, "pros": "Very little training with although the training is ok, ample time to learn just a lot of information to know in a few weeks of training. Call volumes stay high not good scheduling in the beginning new people get bad shifts.", "cons": "As stated above, in addition to short breaks and lunches. overall the people are great just took some getting used to o my part as all companies are different. they are great to their employees a lot of employee benefits available and great health care program", "advice": null}, {"title": "Don't get too comfortable", "text": "Pros Incentives for hitting KPIs Other than structured schedules, all of the things that were one Pros for WorldPay are now non-existent. Cons - Micro-Management - No real motivations outside of small incentives - Upper Management has shady tactics - HR is no help to employees, they veer towards upper management. - Good ole boys game. There is no safe place for women who aspire to be anything in Operations - Rapid turn overs in management. (upper and middle) Advice to Management Let's get back to the company WorldPay was in 2011. Operations had a great SVP and CEO; and the company had an overall great energy. People enjoyed coming to work and working hard for the company. Let's make The Operations department trustworthy again; with so many changes and shady antics it's hard to trust anyone without having to look over our shoulders. Job stability is at an all time low here, and from day to day we are left wondering our fate with this company. I've seen one of the best supervisors walked out on a technicality and no one researched to see if the story was true or not. Please remember to play fair across the board. We've seen too many times where this hasn't been the case and because of that, the overall morale of this department has gone downhill.", "rating": 1, "pros": "Incentives for hitting KPIs", "cons": "- Micro-Management", "advice": "Let's get back to the company WorldPay was in 2011. Operations had a great SVP and CEO; and the company had an overall great energy. People enjoyed coming to work and working hard for the company. Let's make The Operations department trustworthy again; with so many changes and shady antics it's hard to trust anyone without having to look over our shoulders. Job stability is at an all time low here, and from day to day we are left wondering our fate with this company. I've seen one of the best supervisors walked out on a technicality and no one researched to see if the story was true or not."}, {"title": "Growth???", "text": "Pros My colleagues were my lifeline! Cons I was there three years and posted out a total of 12 times and NEVER received as so much as an interview. For most, once you're on Helpdesk it's almost impossible to move forward. Advice to Management Allow those who would like to move on to bigger things the opportunity to do so. Allow shadowing of other departments to get an insight on day to day activities.", "rating": 3, "pros": "My colleagues were my lifeline!", "cons": "I was there three years and posted out a total of 12 times and NEVER received as so much as an interview. For most, once you're on Helpdesk it's almost impossible to move forward.", "advice": "Allow those who would like to move on to bigger things the opportunity to do so. Allow shadowing of other departments to get an insight on day to day activities."}, {"title": "Tough Start", "text": "Pros Work from home. Cons Micro Managed. No leads. Complicated Sell. Not much support from management.", "rating": 3, "pros": "Work from home.", "cons": "Micro Managed. No leads. Complicated Sell. Not much support from management.", "advice": null}, {"title": "Sales Exec", "text": "Pros Forwrd company with huge opportunities that it could capitalize on. Cons Sometimes a little slow to the party Advice to Management Improve IT", "rating": 3, "pros": "Forwrd company with huge opportunities that it could capitalize on.", "cons": "Sometimes a little slow to the party", "advice": "Improve IT"}, {"title": "Consultant", "text": "Pros The work responsibilities were reasonable. My peers were pleasant, however, the opportunities to grow with the company were nonexistent. Cons This was a company in the midst of big change. The CEO \"hired to fire\" in his own words. Advice to Management Keep doing what you are doing. This will continue to be a very profitable company for the investors.", "rating": 3, "pros": "The work responsibilities were reasonable. My peers were pleasant, however, the opportunities to grow with the company were nonexistent.", "cons": "This was a company in the midst of big change. The CEO \"hired to fire\" in his own words.", "advice": "Keep doing what you are doing. This will continue to be a very profitable company for the investors."}, {"title": "No money to be made", "text": "Pros No best reasons to work with Worlpay Cons Decrease in stipend, low residual %, difficult to make any money your 1st year. Advice to Management Change the comp plan.", "rating": 3, "pros": "No best reasons to work with Worlpay", "cons": "Decrease in stipend, low residual %, difficult to make any money your 1st year.", "advice": "Change the comp plan."}, {"title": "Some of the best people you'll work with", "text": "Pros - Fun & challenging culture - Constantly changing industry & always something new to learn - Some of the brightest & most dedicated folks to work with - Up-and-coming industry & company Worldpay also provides the most thorough training I've heard of in the industry. As long as you're willing to work hard, and put in the time, you will learn a ton about the international payments industry & how to perform well in your position. Cons Not a 9-5 work environment. Since we are a UK-based, global company, you need to be a little flexible on your working hours. Advice to Management Let's continue to celebrate the small wins, with expectations set that we'll achieve much more. Overall, people want to do the right thing - some just need guidance on how to make that happen.", "rating": 5, "pros": "- Fun & challenging culture", "cons": "Not a 9-5 work environment. Since we are a UK-based, global company, you need to be a little flexible on your working hours.", "advice": "Let's continue to celebrate the small wins, with expectations set that we'll achieve much more. Overall, people want to do the right thing - some just need guidance on how to make that happen."}, {"title": "Challenging work with great people", "text": "Pros Great team and the work is ever changing and challenging. We work hard and we play hard and I've never been happier Cons sometimed long hours and stressful deadlines. Not everyone's cup of tea. Advice to Management Bonuses bonuses bonuses bonuses bonuses", "rating": 5, "pros": "Great team and the work is ever changing and challenging. We work hard and we play hard and I've never been happier", "cons": "sometimed long hours and stressful deadlines. Not everyone's cup of tea.", "advice": "Bonuses bonuses bonuses bonuses bonuses"}, {"title": "Account Executive", "text": "Pros Great trainings, great ramp up. Cons Very competitive environment. Tough with bad management.", "rating": 3, "pros": "Great trainings, great ramp up.", "cons": "Very competitive environment. Tough with bad management.", "advice": null}, {"title": "Technology", "text": "Pros CAN MAKE A LOT OF MONEY IF YOU DO NOT GIVE A DAMN ABOUT ANYTHING BUT MONEY....THE HELL WITH THE CUSTOMERS Cons Boy's Club...Horrible place for women. Managers are untrustworthy and women are abused. If you like catcalls, you will like the environment. If you dress the part (barely there clothes) then you are okay. Technology is antiquated and they do not give a damn about the customers. Remember a time when millions out of balance...Poor VIsa and MC.....untrustworthy...Need to get used to putting out fires ALL THE TIME!!! KNOW IT ALL MGRS who only care about MONEY!! YOU CAN MAKE A LOT IF YOU DO NOT HAVE A FAMILY...Hard to get vacation due to understaffing...OT is available because of understaffing. IF YOU LIKE MONEY...this is the place for you!!! DO NOT BE CUSTOMER SERVICE ORIENTED AND TRUTHFUL to CUSTOMERS!!! Advice to Management Need to hire more managers from outside. Due to too much \"FRIENDSHIP OWNING\" by MGMT", "rating": 1, "pros": "CAN MAKE A LOT OF MONEY IF YOU DO NOT GIVE A DAMN ABOUT ANYTHING BUT MONEY....THE HELL WITH THE CUSTOMERS", "cons": "Boy's Club...Horrible place for women. Managers are untrustworthy and women are abused. If you like catcalls, you will like the environment. If you dress the part (barely there clothes) then you are okay. Technology is antiquated and they do not give a damn about the customers. Remember a time when millions out of balance...Poor VIsa and MC.....untrustworthy...Need to get used to putting out fires ALL THE TIME!!! KNOW IT ALL MGRS who only care about MONEY!! YOU CAN MAKE A LOT IF YOU DO NOT HAVE A FAMILY...Hard to get vacation due to understaffing...OT is available because of understaffing. IF YOU LIKE MONEY...this is the place for you!!! DO NOT BE CUSTOMER SERVICE ORIENTED AND TRUTHFUL to CUSTOMERS!!!", "advice": "Need to hire more managers from outside. Due to too much \"FRIENDSHIP OWNING\" by MGMT"}, {"title": "Chargebacks", "text": "Pros The company has great people to work with. My supervisor was a GREAT MAN.... He wasn't a micro manager, he allowed us to do our work on our on. We had unlimited overtime. Cons The parking SUCKED!!!!!!!!!!!!!!! The team leads under the supervisor were straight unprofessional, and showed favortism. The space was too small for the amount of people.", "rating": 5, "pros": "The company has great people to work with. My supervisor was a GREAT MAN.... He wasn't a micro manager, he allowed us to do our work on our on. We had unlimited overtime.", "cons": "The parking SUCKED!!!!!!!!!!!!!!! The team leads under the supervisor were straight unprofessional, and showed favortism. The space was too small for the amount of people.", "advice": null}, {"title": "Senior Manager ecommerce", "text": "Pros A good work environment and Cons No equity offered to employees", "rating": 5, "pros": "A good work environment and", "cons": "No equity offered to employees", "advice": null}, {"title": "Too many mergers, too few changes", "text": "Pros PTO, benefits, location, commute, work life balance Cons Not a very progressive organization but constant changes for the worse with mergers, attempt at an agile environment, and to be a software company rather than hardware. Advice to Management Need innovative leaders and employees, or at best, proper training for the existing ones.", "rating": 1, "pros": "PTO, benefits, location, commute, work life balance", "cons": "Not a very progressive organization but constant changes for the worse with mergers, attempt at an agile environment, and to be a software company rather than hardware.", "advice": "Need innovative leaders and employees, or at best, proper training for the existing ones."}, {"title": "great", "text": "Pros good work life balance. great company and great people good money Cons no time off, , don't like how vacation is set up sales support no great Advice to Management work on training better", "rating": 3, "pros": "good work life balance. great company and great people good money", "cons": "no time off, , don't like how vacation is set up sales support no great", "advice": "work on training better"}, {"title": "Great potential for growth within the organization, but current executive management cannot be trusted to make decisions", "text": "Pros Flexible schedules, potential to make money through overtime and performance incentives. High performers are recognized and offered opportunities to do more. Cons Communication within departments is lacking. Customer service reps are the face of the company to the customer but are often the last to be notified of updates or potential issues. Executive management rarely communicates to anyone outside of their own direct reports. Over the past year, Worldpay has lost some key managers within the Operations organization and the morale is suffering. Advice to Management Executive management is very hands off with the staff. They rely on reports and numbers to make decisions. Invest time on the staff outside of your direct reports as they are the key to the company's success. Be more visible and interact with your employees outside of quarterly (if that) all hands meetings and once a year employee appreciation weeks.", "rating": 3, "pros": "Flexible schedules, potential to make money through overtime and performance incentives. High performers are recognized and offered opportunities to do more.", "cons": "Communication within departments is lacking. Customer service reps are the face of the company to the customer but are often the last to be notified of updates or potential issues.", "advice": "Executive management is very hands off with the staff. They rely on reports and numbers to make decisions. Invest time on the staff outside of your direct reports as they are the key to the company's success. Be more visible and interact with your employees outside of quarterly (if that) all hands meetings and once a year employee appreciation weeks."}, {"title": "Great Potential", "text": "Pros Large international company that feels like a small company, currently expanding with many opportunities available, new office and pay is suitable for position types. Cons Systems are aged and need to be improved, many procedures are antiquated and management is engrained in the way things 'have always been'... change doesn't seem to be a strong driver Advice to Management Listen to your employees, go for the small wins sometime and show them you are listening. Change is a good thing.", "rating": 5, "pros": "Large international company that feels like a small company, currently expanding with many opportunities available, new office and pay is suitable for position types.", "cons": "Systems are aged and need to be improved, many procedures are antiquated and management is engrained in the way things 'have always been'... change doesn't seem to be a strong driver", "advice": "Listen to your employees, go for the small wins sometime and show them you are listening. Change is a good thing."}, {"title": "Horrible culture and work/life balance", "text": "Pros Pay and benefits are average for area Cons Senior management, work/life balance, culture", "rating": 1, "pros": "Pay and benefits are average for area", "cons": "Senior management, work/life balance, culture", "advice": null}, {"title": "Opportunities to make money", "text": "Pros Good Pay plus monthly bonus opportunities. Alot of Overtime is offered every month. If you are willing to work you can make a good amount of money. You can get a promotion after one year of being at Worldpay. Co-workers are nice and always willing to help. Cons High turnover rate. Position is stressful. Once management no longer likes you they will do whatever it takes to get you walked out the door. Departments do not communicate well with each other. That makes it very difficult to get answers for the difficult calls that you receive on a daily basis. Advice to Management Too much micromanaging and management is useless when needing assistance with different issues that happen.", "rating": 3, "pros": "Good Pay plus monthly bonus opportunities. Alot of Overtime is offered every month. If you are willing to work you can make a good amount of money. You can get a promotion after one year of being at Worldpay. Co-workers are nice and always willing to help.", "cons": "High turnover rate. Position is stressful. Once management no longer likes you they will do whatever it takes to get you walked out the door. Departments do not communicate well with each other. That makes it very difficult to get answers for the difficult calls that you receive on a daily basis.", "advice": "Too much micromanaging and management is useless when needing assistance with different issues that happen."}, {"title": "It's ok", "text": "Pros Fun environment. Free lunch once a month. Contests and incentive program. Cons Lots of calls. Hard to advance within company if you don't \"know\" ppl, qualifications don't really matter. Management team do not communicate with each other.", "rating": 3, "pros": "Fun environment. Free lunch once a month. Contests and incentive program.", "cons": "Lots of calls. Hard to advance within company if you don't \"know\" ppl, qualifications don't really matter. Management team do not communicate with each other.", "advice": null}, {"title": "WorldPay job", "text": "Pros Young, Growing company that has alot to learn. Structure issue across the board but slowly heading in a Better direction . Cons Worldpay has real problems with communication from upper management. Upper management is too disconnected from what work is getting done. Too many meetings. Advice to Management Stop acting so aloof and start getting connected with your employees in the work that is going on. Have more integrity with better communication and transparent management.", "rating": 3, "pros": "Young, Growing company that has alot to learn. Structure issue across the board but slowly heading in a Better direction .", "cons": "Worldpay has real problems with communication from upper management. Upper management is too disconnected from what work is getting done. Too many meetings.", "advice": "Stop acting so aloof and start getting connected with your employees in the work that is going on. Have more integrity with better communication and transparent management."}, {"title": "Program Director", "text": "Pros Great Company, it's what you make it. Great PMO foundation and people. Nice culture with nice new building in Atlanta; in the middle of everything. Cons It's what you make it.", "rating": 3, "pros": "Great Company, it's what you make it. Great PMO foundation and people. Nice culture with nice new building in Atlanta; in the middle of everything.", "cons": "It's what you make it.", "advice": null}, {"title": "Passionate about Employees", "text": "Pros Worldpay is a best of breed payments services provider that continues with rapid growth and an increasing number of opportunities within the company. Employee satisfaction is very important to the company and they are constantly working to ensure that Worldpay is one of the best places to work in the bay area. They focus a lot of time and resources on employee development and map out a clear growth plan within the company. Cons As with any successful business there is pressure for employees to be the best they can be.", "rating": 5, "pros": "Worldpay is a best of breed payments services provider that continues with rapid growth and an increasing number of opportunities within the company. Employee satisfaction is very important to the company and they are constantly working to ensure that Worldpay is one of the best places to work in the bay area. They focus a lot of time and resources on employee development and map out a clear growth plan within the company.", "cons": "As with any successful business there is pressure for employees to be the best they can be.", "advice": null}, {"title": "Account Executive for Worldpay", "text": "Pros If you're well connected you can make hundreds of thousands of dollars and have a very flexible work schedule. It takes a few years to get there Cons Worldpay is very hard to work for because operations aren't smooth for the sales force. Worldpay is behind the times when it comes to onboarding new accounts. Advice to Management Invest in product and sales will take care of themselves.", "rating": 3, "pros": "If you're well connected you can make hundreds of thousands of dollars and have a very flexible work schedule. It takes a few years to get there", "cons": "Worldpay is very hard to work for because operations aren't smooth for the sales force. Worldpay is behind the times when it comes to onboarding new accounts.", "advice": "Invest in product and sales will take care of themselves."}, {"title": "Employed before layoffs", "text": "Pros It was a great place to work before all of the acquisitions. Small, personable, most managers took the hands on approach and were willing to help with responsibility Cons Most people were overworked and underpayed once people were let go. The attitude of management was that you were to be thankful that you still had your job. Advice to Management promote your employees in both pay and responsibilities. More work should equal more pay, and a better title.", "rating": 3, "pros": "It was a great place to work before all of the acquisitions. Small, personable, most managers took the hands on approach and were willing to help with responsibility", "cons": "Most people were overworked and underpayed once people were let go. The attitude of management was that you were to be thankful that you still had your job.", "advice": "promote your employees in both pay and responsibilities. More work should equal more pay, and a better title."}, {"title": "The worst company to work for!", "text": "Pros Having a job, getting a paycheck every two weeks! Cons Unqualified management, prehistoric software/programs, no opportunity for growth, company appreciate employees that show up to work (just need to keep your head down)/ no appreciation based on merit...horrible working conditions! Advice to Management Diversify the work place/ hire qualified employees.", "rating": 1, "pros": "Having a job, getting a paycheck every two weeks!", "cons": "Unqualified management, prehistoric software/programs, no opportunity for growth, company appreciate employees that show up to work (just need to keep your head down)/ no appreciation based on merit...horrible working conditions!", "advice": "Diversify the work place/ hire qualified employees."}, {"title": "Great Place to work", "text": "Pros Great place to work wishing I was still there. Cons I have none I can't say anything bad", "rating": 5, "pros": "Great place to work wishing I was still there.", "cons": "I have none I can't say anything bad", "advice": null}, {"title": "Account Executive", "text": "Pros Remote position; decent marketing collateral Cons Very micromanaged, sweat shop, extremely high turn over, stipend ends in 12mths Advice to Management Stop verbally abusing your team with insults and treating them like preschoolers when they mis the mark a time or two! They're professional Adults!", "rating": 3, "pros": "Remote position; decent marketing collateral", "cons": "Very micromanaged, sweat shop, extremely high turn over, stipend ends in 12mths", "advice": "Stop verbally abusing your team with insults and treating them like preschoolers when they mis the mark a time or two! They're professional Adults!"}, {"title": "Not good - mass layoffs due to the IPO and the possibility of the company being sold", "text": "Pros you get exposure to many different things which means you could definitely build up your resume and get the experience to land a better position Cons I wouldn't recommend anyone giving up their full time permanent position and coming to work for WorldPay, tons of uncertainty and alot of work is moving to the UK from the US which means layoffs are coming soon, the US IT team is not involved in the Datacenter move which is very alarming, the PCI audit proved that there were incompetent people working in the company, I have never been around so many people with lax attitudes Advice to Management not even sure who is in charge to give recommendations to", "rating": 1, "pros": "you get exposure to many different things which means you could definitely build up your resume and get the experience to land a better position", "cons": "I wouldn't recommend anyone giving up their full time permanent position and coming to work for WorldPay, tons of uncertainty and alot of work is moving to the UK from the US which means layoffs are coming soon, the US IT team is not involved in the Datacenter move which is very alarming, the PCI audit proved that there were incompetent people working in the company, I have never been around so many people with lax attitudes", "advice": "not even sure who is in charge to give recommendations to"}, {"title": "Colding Calling At Your Own Expense", "text": "Pros Name is recognizable. Base salary with benefits. Once account get approved the service to the merchant is solid. Interview process is easy. Cons I was promised a ramp up bonus and an monthly expense allowances. It wasn't until after I was hired and on board that I found out there was no ramp up bonus and expense allowance is only paid if you activate 10 accounts. As a result expense came out of pocket were not reimbursed. The commission payout is the lowest I've ever seen in the industry. Your told you get such a low payout because \"you have a partner sending you leads\" - however in practice you get no leads and are expected to cold call for all your business. The micro-management is extreme and hostile. You have to pay to go to training out of pocket and don't get it reimbursed unless you activate 10 accounts. Advice to Management When your employees actually reach out to management, try taking the time to actually listen to them instead of blaming them. Deliver on ramp up bonuses and covering expenses.", "rating": 1, "pros": "Name is recognizable. Base salary with benefits. Once account get approved the service to the merchant is solid. Interview process is easy.", "cons": "I was promised a ramp up bonus and an monthly expense allowances. It wasn't until after I was hired and on board that I found out there was no ramp up bonus and expense allowance is only paid if you activate 10 accounts. As a result expense came out of pocket were not reimbursed. The commission payout is the lowest I've ever seen in the industry. Your told you get such a low payout because \"you have a partner sending you leads\" - however in practice you get no leads and are expected to cold call for all your business. The micro-management is extreme and hostile. You have to pay to go to training out of pocket and don't get it reimbursed unless you activate 10 accounts.", "advice": "When your employees actually reach out to management, try taking the time to actually listen to them instead of blaming them. Deliver on ramp up bonuses and covering expenses."}, {"title": "outside sales", "text": "Pros Great benefits, made some great friend both professional and work environment. Good training programs but a day late and a dollar short. Hr is friends with management never go to them for help if you value your job and privacy. Cons You can't afford the benefits because it takes two months to get your full commission. If you find a large partnership it is either sent to national sales or your managers favorite employee. That say you should work with so and so to get the experience because your always in training to do so called Colombo calls. By the way same as cold calling but take longer. Plan to work 12 hour days sales meetings starts at 7:30am with the bosses kids in the background. Advice to Management None", "rating": 1, "pros": "Great benefits, made some great friend both professional and work environment. Good training programs but a day late and a dollar short. Hr is friends with management never go to them for help if you value your job and privacy.", "cons": "You can't afford the benefits because it takes two months to get your full commission. If you find a large partnership it is either sent to national sales or your managers favorite employee. That say you should work with so and so to get the experience because your always in training to do so called Colombo calls. By the way same as cold calling but take longer. Plan to work 12 hour days sales meetings starts at 7:30am with the bosses kids in the background.", "advice": "None"}, {"title": "Training Specialist", "text": "Pros A good, collaborative sales environment. Cons Product Management is conservative on their product launches..", "rating": 5, "pros": "A good, collaborative sales environment.", "cons": "Product Management is conservative on their product launches..", "advice": null}, {"title": "No Opportunities, very clickish and no advancement unless you are in the inner circle.", "text": "Pros Not sure if there are any; I just come to work to pay my bills. Cons Everything, terrible benefits; no training and development; no advancement for people who have been with the company for a long time; hire from the outside first. Advice to Management Focus on employees, develop management training programs, etc.", "rating": 1, "pros": "Not sure if there are any; I just come to work to pay my bills.", "cons": "Everything, terrible benefits; no training and development; no advancement for people who have been with the company for a long time; hire from the outside first.", "advice": "Focus on employees, develop management training programs, etc."}, {"title": "analyst", "text": "Pros Small company feel and great coworkers. Cons No career growth and a lot of favoritism. Advice to Management Keep good talent...invest in the employees.", "rating": 3, "pros": "Small company feel and great coworkers.", "cons": "No career growth and a lot of favoritism.", "advice": "Keep good talent...invest in the employees."}, {"title": "Customer Care Associate", "text": "Pros Company needs new leadership Cons Horrible Compensation plan and bad management Advice to Management Start creating the human connection it's how Every Company Servives", "rating": 1, "pros": "Company needs new leadership", "cons": "Horrible Compensation plan and bad management", "advice": "Start creating the human connection it's how Every Company Servives"}, {"title": "An Average Payments Processor", "text": "Pros Customer service driven. Friendly people. Lots of vacation time. Some bright people keep the wheels moving in key areas. Cons Bought and sold too many times, creating lots of employee churn and competing visions/culture. Top down, hierarchical nature. Low trust, low innovation, low motivation. Eroding benefits. No common goal other than sales. Sales focused organization, even though this is a technology company. Advice to Management Reinvest in technology and products/services. Find an innovative niche and capitalize on it, rather than chasing the next mid-sized merchant chain.", "rating": 3, "pros": "Customer service driven. Friendly people. Lots of vacation time. Some bright people keep the wheels moving in key areas.", "cons": "Bought and sold too many times, creating lots of employee churn and competing visions/culture.", "advice": "Reinvest in technology and products/services. Find an innovative niche and capitalize on it, rather than chasing the next mid-sized merchant chain."}, {"title": "Drastic Culture Change", "text": "Pros Long term employees are very loyal to the company. Cons Changes in upper management have caused good employees who know the systems and their jobs to leave.", "rating": 3, "pros": "Long term employees are very loyal to the company.", "cons": "Changes in upper management have caused good employees who know the systems and their jobs to leave.", "advice": null}, {"title": "Not a good company to work for", "text": "Pros If you know someone you can advance within your career Cons The company doesn't place qualified people in the higher management positions. Therefore, the organization as a whole is very unorganized and and favor is shown to those that have been with the company 20 plus years.", "rating": 3, "pros": "If you know someone you can advance within your career", "cons": "The company doesn't place qualified people in the higher management positions. Therefore, the organization as a whole is very unorganized and and favor is shown to those that have been with the company 20 plus years.", "advice": null}, {"title": "Not the best company to work for", "text": "Pros Great benefits. There are lots of job openings but not much promotion from within. Cons Management will rarely have your back and there is no loyalty to employees. They don't invest in their talent and retaining them. HR will never have your back. Advice to Management Treat your employees better and try to listen to them when they bring things to their attention.", "rating": 1, "pros": "Great benefits.", "cons": "Management will rarely have your back and there is no loyalty to employees. They don't invest in their talent and retaining them.", "advice": "Treat your employees better and try to listen to them when they bring things to their attention."}, {"title": "research", "text": "Pros online reviews are positive and promising Cons need more salary information and information about moral Advice to Management more entry level positions", "rating": 5, "pros": "online reviews are positive and promising", "cons": "need more salary information and information about moral", "advice": "more entry level positions"}, {"title": "Great Company", "text": "Pros Salary, benefits, promotions, schedule changes Cons Systems are always down hard for employees to service merchants", "rating": 3, "pros": "Salary, benefits, promotions, schedule changes", "cons": "Systems are always down hard for employees to service merchants", "advice": null}, {"title": "Great place to work", "text": "Pros Great place. Good people. I love it. Cons Not to many, great place to work.", "rating": 5, "pros": "Great place. Good people. I love it.", "cons": "Not to many, great place to work.", "advice": null}, {"title": "Sales", "text": "Pros None, company sucks. Not a good company to work for and lacks leadership and support. They do not set you up for success. Cons Everything! Management, support, pay and inferior. Please do not set your career back by working for this company.", "rating": 1, "pros": "None, company sucks. Not a good company to work for and lacks leadership and support. They do not set you up for success.", "cons": "Everything! Management, support, pay and inferior. Please do not set your career back by working for this company.", "advice": null}, {"title": "An ok place to work", "text": "Pros The starting hourly rate is competitive for entry level combined technical and customer support roles. There are a lot of efforts to bolster a positive rapport among the staff. Cons The training program needs to be overhauled and strengthened in the regards of the initial help desk and customer care blending of the agents. Advice to Management Do not undervalue your agents on the floor. We take a lot of flack A little more focus on morale that is not contest or promoter score based would make individuals feel more appreciated.", "rating": 3, "pros": "The starting hourly rate is competitive for entry level combined technical and customer support roles. There are a lot of efforts to bolster a positive rapport among the staff.", "cons": "The training program needs to be overhauled and strengthened in the regards of the initial help desk and customer care blending of the agents.", "advice": "Do not undervalue your agents on the floor. We take a lot of flack A little more focus on morale that is not contest or promoter score based would make individuals feel more appreciated."}, {"title": "Used to be good", "text": "Pros The company at its early stage was a great place to work; Cons Too much of the good old boy network freezing out great talent and ideas from others. Now management does not listen to the lower ranks to others for ideas. you are a true drone Advice to Management Train your managers to be managers through a formal process; every good individual contributor does not make for a good manager", "rating": 3, "pros": "The company at its early stage was a great place to work;", "cons": "Too much of the good old boy network freezing out great talent and ideas from others. Now management does not listen to the lower ranks to others for ideas. you are a true drone", "advice": "Train your managers to be managers through a formal process; every good individual contributor does not make for a good manager"}, {"title": "good for entry level, not for carreer", "text": "Pros work from home good place to start you carreer in the indusrty Cons limited tool are provided to the remote sales rep. Recovering your expenses is a mission Huge disconnect between upper management and sales Advice to Management Listen to your top sales reps. We are on the \"Front Lines\" for the company. Most of the directives coming down seemed tobe out of touch with the stuation on the ground", "rating": 1, "pros": "work from home", "cons": "limited tool are provided to the remote sales rep.", "advice": "Listen to your top sales reps. We are on the \"Front Lines\" for the company. Most of the directives coming down seemed tobe out of touch with the stuation on the ground"}, {"title": "World Pay Nay", "text": "Pros Seemed a good idea at the time Cons They have cliques in management Advice to Management Call in an airstrike and start over", "rating": 1, "pros": "Seemed a good idea at the time", "cons": "They have cliques in management", "advice": "Call in an airstrike and start over"}, {"title": "One of the best companies to work for!", "text": "Pros The benefits are great and kick in after 30 days unlike most companies who have a 90 day waiting period. The bonus program is great too. Management is really down to earth and speak to the employees. They really invest in their people and try to make it a comfortable environment. The opportunity for advancement is abudant. Cons The NPS program can be a pain and can sometimes hurt you if given a low score. The communication of changes.", "rating": 5, "pros": "The benefits are great and kick in after 30 days unlike most companies who have a 90 day waiting period. The bonus program is great too. Management is really down to earth and speak to the employees. They really invest in their people and try to make it a comfortable environment. The opportunity for advancement is abudant.", "cons": "The NPS program can be a pain and can sometimes hurt you if given a low score. The communication of changes.", "advice": null}, {"title": "Great company to work for. Very good benefits.", "text": "Pros Unlimited overtime. Technical Experience. Excellent Pay Cons Strict attendance and quality standards.", "rating": 3, "pros": "Unlimited overtime. Technical Experience. Excellent Pay", "cons": "Strict attendance and quality standards.", "advice": null}, {"title": "Relationship Management", "text": "Pros Great space - ecommerce- fast moving and cool companies to work with. Cons Slow moving legacy company. HQ is in London, and they do not have a technology mindset. As most functions are in the UK the time difference is a real challenge. Advice to Management Show you actually care about your employees. Seems mostly lip service.", "rating": 3, "pros": "Great space - ecommerce- fast moving and cool companies to work with.", "cons": "Slow moving legacy company. HQ is in London, and they do not have a technology mindset. As most functions are in the UK the time difference is a real challenge.", "advice": "Show you actually care about your employees. Seems mostly lip service."}, {"title": "Account Executive", "text": "Pros The pay was okay but not worth it at all. go somewhere else fast Cons Management is unprofessional. they actually said on a daily conference call that the job was sunday through saturday. they expected everyone to respond to emails and text on Saturdays Sundays and even asked for a report on Easter. I received text and emails on Christmas day. One manager asked a saleperson on a call if his wife and kids life depended on it would he make his numbers....they said they expected everyone to be on call all day and that the sales job was 24/7. they sell credit cards for goodness sake. worst job in my entire career.... Advice to Management grow up. figure out how to balance life and work...treat people with respect and respect boundries....everyone does not want to work 24/7. IF I COULD GIVE A 0 I would", "rating": 1, "pros": "The pay was okay but not worth it at all. go somewhere else fast", "cons": "Management is unprofessional. they actually said on a daily conference call that the job was sunday through saturday. they expected everyone to respond to emails and text on Saturdays Sundays and even asked for a report on Easter. I received text and emails on Christmas day. One manager asked a saleperson on a call if his wife and kids life depended on it would he make his numbers....they said they expected everyone to be on call all day and that the sales job was 24/7. they sell credit cards for goodness sake. worst job in my entire career....", "advice": "grow up. figure out how to balance life and work...treat people with respect and respect boundries....everyone does not want to work 24/7. IF I COULD GIVE A 0 I would"}, {"title": "National Sales Executive", "text": "Pros - collaborative work environment -growth opportunities - interaction with top leadership - great clients Cons - internal politics - low employee benefits - no rotational programs Advice to Management work on change management and people management", "rating": 3, "pros": "- collaborative work environment", "cons": "- internal politics", "advice": "work on change management and people management"}, {"title": "Senior Risk Investigator", "text": "Pros Great company. Solid Growth company Cons Subpar benefits they are making me type Advice to Management Trust your ppl more", "rating": 5, "pros": "Great company. Solid Growth company", "cons": "Subpar benefits they are making me type", "advice": "Trust your ppl more"}, {"title": "Awesome company to work for", "text": "Pros They are dedicated to their merchants and their employees. Great training and room for growth. Cons Only con is they are moving to Midtown for some that is a Pro for others it is a Con because homes were bought to work near their current location in Sandy Spring. Advice to Management Management is excellent at working with their teams and into development. Of course with any Corp Job there is management and employees that are there just for the job but there is few of them. Start looking at incentives for your employees it gets hard for them to see the incentives that are given to the Sales Field and they do not see anything for their hard work. A NICE gift card (not $25) once in a while to say thank you for a job well done or a contest would go a long way at corporate. Make it an end of month incentive so it supports the field but Corp works very hard to get those sales boarded and up and running!!!", "rating": 5, "pros": "They are dedicated to their merchants and their employees. Great training and room for growth.", "cons": "Only con is they are moving to Midtown for some that is a Pro for others it is a Con because homes were bought to work near their current location in Sandy Spring.", "advice": "Management is excellent at working with their teams and into development. Of course with any Corp Job there is management and employees that are there just for the job but there is few of them. Start looking at incentives for your employees it gets hard for them to see the incentives that are given to the Sales Field and they do not see anything for their hard work. A NICE gift card (not $25) once in a while to say thank you for a job well done or a contest would go a long way at corporate. Make it an end of month incentive so it supports the field but Corp works very hard to get those sales boarded and up and running!!!"}, {"title": "Good company. Execution is key", "text": "Pros Good place to be in comparison to other companies. Booming every changing industry. Owners will figure out how to make it soar. Cons Allow more across the board involvement in projects and decisions. People other than the SLT have answers and solutions. Develop the project management and brainshare to facilitate that. Advice to Management Large company but long term incentive isn't far reaching so ends up just paying salary and bonus,. If you want people to believe and be vested give them equity.", "rating": 5, "pros": "Good place to be in comparison to other companies. Booming every changing industry. Owners will figure out how to make it soar.", "cons": "Allow more across the board involvement in projects and decisions. People other than the SLT have answers and solutions. Develop the project management and brainshare to facilitate that.", "advice": "Large company but long term incentive isn't far reaching so ends up just paying salary and bonus,. If you want people to believe and be vested give them equity."}, {"title": "There is better out there", "text": "Pros Company is trying to change its reputation, the potential of pay is very good, benefits are great, work life balance is scheduled by you, and you get to expense gas mileage. Cons Corporate tries to outline expectations, but in reality if you produce, they don't care what you do. If aren't producing and need help, good luck. I had a person on my team that was terminated because the sales manager thought they weren't working every day. The person was working because we would go out together, they just needed help. Good work ethic, but every time they reached out to their sales manager or corporate they either received wrong answers or they got 5 minutes. Sales manager was great, just put under a lot of pressure. Very frustrating if you are new and not from the industry. Compensation is very confusing. Even when it is explained 10 times, still doesn't click till you are there a year or so. Company is happy if you just figure everything out on your own, and not ask questions. Also, if you ask a question or complain, you will get cruicified. New hire training is horrible. I had enough when I called the support line to get information on a cost that is on the application, and the person on the other end couldn't even explain it to me and had no clue what it was. Advice to Management Don't pretend to be a company that cares about your growth and development, when you truly just care about people coming in and figuring it out by themselves. If you truly care about people, invest in training and proper leaders, offer courses on development and education, and offer support that actually helps people become better reps. People want to come in and do well, but working at Worldpay is like running uphill on a windy and snowy day. Even if and when you sell, there are so many hiccups with the application and boarding that it can make you very annoyed.", "rating": 1, "pros": "Company is trying to change its reputation, the potential of pay is very good, benefits are great, work life balance is scheduled by you, and you get to expense gas mileage.", "cons": "Corporate tries to outline expectations, but in reality if you produce, they don't care what you do. If aren't producing and need help, good luck. I had a person on my team that was terminated because the sales manager thought they weren't working every day. The person was working because we would go out together, they just needed help. Good work ethic, but every time they reached out to their sales manager or corporate they either received wrong answers or they got 5 minutes. Sales manager was great, just put under a lot of pressure. Very frustrating if you are new and not from the industry. Compensation is very confusing. Even when it is explained 10 times, still doesn't click till you are there a year or so. Company is happy if you just figure everything out on your own, and not ask questions. Also, if you ask a question or complain, you will get cruicified. New hire training is horrible. I had enough when I called the support line to get information on a cost that is on the application, and the person on the other end couldn't even explain it to me and had no clue what it was.", "advice": "Don't pretend to be a company that cares about your growth and development, when you truly just care about people coming in and figuring it out by themselves. If you truly care about people, invest in training and proper leaders, offer courses on development and education, and offer support that actually helps people become better reps. People want to come in and do well, but working at Worldpay is like running uphill on a windy and snowy day. Even if and when you sell, there are so many hiccups with the application and boarding that it can make you very annoyed."}, {"title": "Great place to work", "text": "Pros 5 weeks vocation Very relaxed Friendly co-worker. Cons Requests process speed is extremely slow Hiring standard at some department is very low, so you end up have to work with a few people that's just flat out dumb and can't perform.", "rating": 5, "pros": "5 weeks vocation", "cons": "Requests process speed is extremely slow", "advice": null}, {"title": "I have been working here for a year. So far it's a lot of adjustments", "text": "Pros Great vacation and flexibly, seems  To want to change the current bad culture Cons Not very organized and internal departments takes long time to respond. You need a ticket before someone even talk to you", "rating": 3, "pros": "Great vacation and flexibly, seems", "cons": "Not very organized and internal departments takes long time to respond. You need a ticket before someone even talk to you", "advice": null}, {"title": "My experience as a Level II rep", "text": "Pros Bonus structure allows employees to earn extra income for performance and meeting monthly KPI's. Overtime seemed to always be available also. Cons Bad morale within the Operations Department due to an environment which makes you feel as if your job is always in jeopardy Advice to Management Stop feeling insecure or threatened by ideas that come from subordinates.", "rating": 3, "pros": "Bonus structure allows employees to earn extra income for performance and meeting monthly KPI's. Overtime seemed to always be available also.", "cons": "Bad morale within the Operations Department due to an environment which makes you feel as if your job is always in jeopardy", "advice": "Stop feeling insecure or threatened by ideas that come from subordinates."}, {"title": "High pressure, ineffective, rabbit chasing Management environment", "text": "Pros Large company, so there is a measure of stability (given that in this era, everyone is expendable). Great people to work with, solid professionals. Room for advancement. Cons Bad interdepartmental communications. Irrational, ineffective strategies and inefficient work description and expectations for many job titles in management. Advice to Management Let SVP's be SVP's, VP's be VP's, to do their jobs. They Manage the next level of DIRECT REPORTS, NOT the direct reports 2-3 levels down. IE: No one should expect the President of the company to clean the bathrooms in the building - we hire people to do their specific job duties. WP is confused on this, and there is no wonder that their almighty goal is to get to \"net zero\" profitability! Horrendously top heavy org, needs restructuring.", "rating": 3, "pros": "Large company, so there is a measure of stability (given that in this era, everyone is expendable). Great people to work with, solid professionals. Room for advancement.", "cons": "Bad interdepartmental communications. Irrational, ineffective strategies and inefficient work description and expectations for many job titles in management.", "advice": "Let SVP's be SVP's, VP's be VP's, to do their jobs. They Manage the next level of DIRECT REPORTS, NOT the direct reports 2-3 levels down. IE: No one should expect the President of the company to clean the bathrooms in the building - we hire people to do their specific job duties. WP is confused on this, and there is no wonder that their almighty goal is to get to \"net zero\" profitability! Horrendously top heavy org, needs restructuring."}]