[{"title": "Nice company", "text": "Pros Nice comapny. Good work life balance Cons Nepotism. Evrybody is related to everybody. raises and ranking based on that Advice to Management Be a little managed. Please donot follow favoritism", "rating": 3, "pros": "Nice comapny. Good work life balance", "cons": "Nepotism. Evrybody is related to everybody. raises and ranking based on that", "advice": "Be a little managed. Please donot follow favoritism"}, {"title": "Principal Consultant", "text": "Pros Great environment and team. Rewarded for your work. Upward mobility is available and presented at annual review./ Cons Support was sometimes challenging with staff overseas....time difference had its limitations.", "rating": 5, "pros": "Great environment and team. Rewarded for your work. Upward mobility is available and presented at annual review./", "cons": "Support was sometimes challenging with staff overseas....time difference had its limitations.", "advice": null}, {"title": "Small Fish, Big Pond", "text": "Pros The ability to develop and be challenged in a variety of ways whether on a micro level of technical or analytical skills or in taking on several roles within the company. Cons Underwhelming compensation. Arbitrary at times as compensation doesn't align with market standards for that same role. Advice to Management Take care of your employees. Show recognition in a meaningful way.", "rating": 3, "pros": "The ability to develop and be challenged in a variety of ways whether on a micro level of technical or analytical skills or in taking on several roles within the company.", "cons": "Underwhelming compensation. Arbitrary at times as compensation doesn't align with market standards for that same role.", "advice": "Take care of your employees. Show recognition in a meaningful way."}, {"title": "MM4", "text": "Pros It has been a crazy ride here at MM4 but a few things have stayed true. The senior management team is open with us and that is apparent from the honest conversations and frequent updates on progress. There is still opportunity to learn and grow, thanks to the managers investing in their employees. The culture of MM4 has been tested but remains intact with the fun, energetic, hard-working individuals at this company. Cons The most recent acquisition has been tough on the employees. Advice to Management Keep investing in us and being open about where we stand. Remember what made us great and keep pushing for it!", "rating": 5, "pros": "It has been a crazy ride here at MM4 but a few things have stayed true. The senior management team is open with us and that is apparent from the honest conversations and frequent updates on progress. There is still opportunity to learn and grow, thanks to the managers investing in their employees. The culture of MM4 has been tested but remains intact with the fun, energetic, hard-working individuals at this company.", "cons": "The most recent acquisition has been tough on the employees.", "advice": "Keep investing in us and being open about where we stand. Remember what made us great and keep pushing for it!"}, {"title": "Worked for the MM4 division...stay clear of this company!", "text": "Pros Located in the heart of the Chicago financial district. Cons Senior management team is a joke. Sit through a meeting with the CEO and you'll know what I mean. Advice to Management Be more professional. Get to know your most valuable employees.", "rating": 1, "pros": "Located in the heart of the Chicago financial district.", "cons": "Senior management team is a joke. Sit through a meeting with the CEO and you'll know what I mean.", "advice": "Be more professional. Get to know your most valuable employees."}, {"title": "Associate Sourcing Manager", "text": "Pros Great company to collaborate with entrepreneurial-minded and smart people. Cons There was a disconnect between the North American branch in Chicago and the UK part of the company. There wasn't clear communication about how financially healthy the company was, etc. Advice to Management Provide more details to all parts of the business about the financial state of the company.", "rating": 5, "pros": "Great company to collaborate with entrepreneurial-minded and smart people.", "cons": "There was a disconnect between the North American branch in Chicago and the UK part of the company. There wasn't clear communication about how financially healthy the company was, etc.", "advice": "Provide more details to all parts of the business about the financial state of the company."}, {"title": "Conflicts of Interest in Upper Management", "text": "Pros The place has great benefits at little cost to the employee. Also working with a staff of young professionals made me feel comfortable expressing my ideas. Cons Upper management is lacking- TERRIBLY. They would say one thing about the company being in stable financial stable condition then start with a round of layoffs. When I started working there, I was assured the company was in a great financial state. After not being there more than 3 months the layoffs started. I received glowing reviews from suppliers & my team lead. As a result I was then chosen as one of the layoffs before my 1 year there was even up. There were also tons of conflicts of interest when i came to employee preformance. One employee was barely at his desk running around the office gossiping with other departments but because of his relationship with the manager of my team he was not even spoken to in regards to his performance. Advice to Management Clean the house and start fresh. Like I said, terrible upper management. Needs to be reworked ENTIRELY.", "rating": 3, "pros": "The place has great benefits at little cost to the employee. Also working with a staff of young professionals made me feel comfortable expressing my ideas.", "cons": "Upper management is lacking- TERRIBLY. They would say one thing about the company being in stable financial stable condition then start with a round of layoffs. When I started working there, I was assured the company was in a great financial state. After not being there more than 3 months the layoffs started. I received glowing reviews from suppliers & my team lead. As a result I was then chosen as one of the layoffs before my 1 year there was even up. There were also tons of conflicts of interest when i came to employee preformance. One employee was barely at his desk running around the office gossiping with other departments but because of his relationship with the manager of my team he was not even spoken to in regards to his performance.", "advice": "Clean the house and start fresh. Like I said, terrible upper management. Needs to be reworked ENTIRELY."}, {"title": "Xchanging - Mass Confusion", "text": "Pros Benefits are at no cost to employee. Close to Union Station. Cons Management has no idea what they are doing. Advice to Management Clean house. All upper management needs to go.", "rating": 3, "pros": "Benefits are at no cost to employee. Close to Union Station.", "cons": "Management has no idea what they are doing.", "advice": "Clean house. All upper management needs to go."}, {"title": "Tumultuous times creates opportunity", "text": "Pros In any business there will be peaks and valleys and yes, recently this organization underwent some drastic changes and several staffing loses. However, the changes have created nothing but opportunity for promotion, for people to step up to the plate, and upward mobility. Xchanging provides the opportunities to make a name for yourself and the space and flexibility to show what you've got and how you can develop strategies and execute with outside the box thinking. This IS NOT your typical \"in the box\", cookie cutter, gray cubicle, environment surrounded by stagnant procedures and corporate red tape. And that's a good thing. Cons Change management is lacking, as evidenced by the recent departures, negatively impacting those that remain. However, lessons are being learned, but will take time to implement improvements. Advice to Management Develop contingencies to alleviate the impact on remaining staff when redundancies are inevitable. SOPs for standard procedures and a development or advancement plan to condition and train people to step up to the plate or next level so as to reduce the negative impact that is created when someone leaves the organization and ease transitions into new roles.", "rating": 5, "pros": "In any business there will be peaks and valleys and yes, recently this organization underwent some drastic changes and several staffing loses. However, the changes have created nothing but opportunity for promotion, for people to step up to the plate, and upward mobility. Xchanging provides the opportunities to make a name for yourself and the space and flexibility to show what you've got and how you can develop strategies and execute with outside the box thinking. This IS NOT your typical \"in the box\", cookie cutter, gray cubicle, environment surrounded by stagnant procedures and corporate red tape. And that's a good thing.", "cons": "Change management is lacking, as evidenced by the recent departures, negatively impacting those that remain. However, lessons are being learned, but will take time to implement improvements.", "advice": "Develop contingencies to alleviate the impact on remaining staff when redundancies are inevitable. SOPs for standard procedures and a development or advancement plan to condition and train people to step up to the plate or next level so as to reduce the negative impact that is created when someone leaves the organization and ease transitions into new roles."}, {"title": "Turning things around!", "text": "Pros Sales starting to fly in. New logos being acquired every week. Best parts of Chicago culture still in place. Cons A succession of difficult challenges in the 2nd half of 2015 has led to a significant turnover of staff however there are still some very exceptional people there. Advice to Management Keep up the transparency.", "rating": 5, "pros": "Sales starting to fly in.", "cons": "A succession of difficult challenges in the 2nd half of 2015 has led to a significant turnover of staff however there are still some very exceptional people there.", "advice": "Keep up the transparency."}, {"title": "Open and Honest, but change is coming", "text": "Pros Senior Management is very honest on your opportunities within the organization. The employees are probably the best I have been around when it comes to a great office atmosphere and open mindedness. The skills sets vary, but helps to build collaboration and support. NOTE that this comment is about the Procurement group only. I have no insight into the rest of the business Cons There have been a lot of changes/restructuring over the last year leaving a lot of uncertainty in the employee's minds. This is still enforce in the new year with the potential acquisition of Xchanging by CSC. Lastly, with all the uncertainty, many folks are leaving and it makes me wonder about their ability to deliver. NOTE that this comment is about the Procurement group only. The rest of the business is doing well. Advice to Management Communication is key, especially at the time of restructuring and uncertainty.", "rating": 5, "pros": "Senior Management is very honest on your opportunities within the organization. The employees are probably the best I have been around when it comes to a great office atmosphere and open mindedness. The skills sets vary, but helps to build collaboration and support. NOTE that this comment is about the Procurement group only. I have no insight into the rest of the business", "cons": "There have been a lot of changes/restructuring over the last year leaving a lot of uncertainty in the employee's minds. This is still enforce in the new year with the potential acquisition of Xchanging by CSC. Lastly, with all the uncertainty, many folks are leaving and it makes me wonder about their ability to deliver. NOTE that this comment is about the Procurement group only. The rest of the business is doing well.", "advice": "Communication is key, especially at the time of restructuring and uncertainty."}, {"title": "Director", "text": "Pros Good Work Life balance. Company cares for its employees. Xchanging allows for creativity and the ability to interact with a team on a global scale. At any given time, you could be working on one project and one goal with individuals from Xchanging on almost every continent. Cons I was in a training a few years ago and the Xchanging trainer best described Xchanging as the following. Xchanging is a 14-15 year old company just as a 14-15 year old person goes through growing pains, learns, and develops, as will Xchanging. Be patience.", "rating": 5, "pros": "Good Work Life balance. Company cares for its employees. Xchanging allows for creativity and the ability to interact with a team on a global scale. At any given time, you could be working on one project and one goal with individuals from Xchanging on almost every continent.", "cons": "I was in a training a few years ago and the Xchanging trainer best described Xchanging as the following. Xchanging is a 14-15 year old company just as a 14-15 year old person goes through growing pains, learns, and develops, as will Xchanging. Be patience.", "advice": null}, {"title": "Accounts Executive", "text": "Pros Great place to work at. Cons The company is still growing and so doesn't have advanced tools.", "rating": 5, "pros": "Great place to work at.", "cons": "The company is still growing and so doesn't have advanced tools.", "advice": null}, {"title": "Do NOT Join The Chicago Office", "text": "Pros This review is about the Chicago office and not any other office of Xchanging. Nice and friendly people. Cons The Chicago office is basically a call center with a couple of technology people and senior management. The Procurement division has been moved into Technology division and they are laying off people everyday. Around the mid part of the year, they were laying off the lower level employees and now they the senior management people are getting laid off. The technology platform is a mess and they rely on foreign development agencies to do all the work. These agencies have a lot of leverage on Xchanging and have turned things around to their benefit. I have friends who are still at Xchanging Chicago and they tell me that people are quitting every day. The ones who are still there are looking for something else. Avoid this disaster of a company. Advice to Management Shut shop and cut your losses. This company is beyond redemption.", "rating": 1, "pros": "This review is about the Chicago office and not any other office of Xchanging.", "cons": "The Chicago office is basically a call center with a couple of technology people and senior management. The Procurement division has been moved into Technology division and they are laying off people everyday. Around the mid part of the year, they were laying off the lower level employees and now they the senior management people are getting laid off.", "advice": "Shut shop and cut your losses. This company is beyond redemption."}, {"title": "Terrible CEO and Sinking Ship", "text": "Pros If you are incredibly lazy you would enjoy working here. Cons Terribly run organization with no direction, they change direction and lay people off every 6 months.", "rating": 1, "pros": "If you are incredibly lazy you would enjoy working here.", "cons": "Terribly run organization with no direction, they change direction and lay people off every 6 months.", "advice": null}, {"title": "Good Company to work for", "text": "Pros Good environment, flexible working hours Cons No good projects, not good management Advice to Management None", "rating": 5, "pros": "Good environment, flexible working hours", "cons": "No good projects, not good management", "advice": "None"}, {"title": "Data Engineer", "text": "Pros Innovative, job security, also they are growing very fast Cons Not many expert although they try to attract more talented", "rating": 5, "pros": "Innovative, job security, also they are growing very fast", "cons": "Not many expert although they try to attract more talented", "advice": null}, {"title": "Lack of clear direction and communication. Hostile Work Environment.", "text": "Pros The people are some of the most brightest, hard-working and outright funnest people to call your colleagues and friends. Cons Certain members of management do not appear to be held accountable to the same standards of effective communication, respect and \"a positive attitude\" as lower employees are. There is no room for professional growth: Especially for certain employees based on favoritism, or lack their of, from certain members of management. The company has fired countless employees at random and provides no valid reasons for those terminations. Transparency and HONESTY are values this company does not hold themselves to. There is a lack of direction of where the company is heading. Faulty sale deals and false expectations of what the online platform and employees can do are commonplace and grossly affects the morale and positive outlook of this company's present and future. Advice to Management Take a good look of who is in management positions and why they are there: Ask your employees what can be done better to make their jobs more productive and of benefit to not only themselves, but the company as a whole. Suppress the hostile work environment that has created both fear and loathing of members of management. Create an environment that fosters better communication and accountability between lower employees and management.", "rating": 3, "pros": "The people are some of the most brightest, hard-working and outright funnest people to call your colleagues and friends.", "cons": "Certain members of management do not appear to be held accountable to the same standards of effective communication, respect and \"a positive attitude\" as lower employees are. There is no room for professional growth: Especially for certain employees based on favoritism, or lack their of, from certain members of management. The company has fired countless employees at random and provides no valid reasons for those terminations. Transparency and HONESTY are values this company does not hold themselves to. There is a lack of direction of where the company is heading. Faulty sale deals and false expectations of what the online platform and employees can do are commonplace and grossly affects the morale and positive outlook of this company's present and future.", "advice": "Take a good look of who is in management positions and why they are there: Ask your employees what can be done better to make their jobs more productive and of benefit to not only themselves, but the company as a whole. Suppress the hostile work environment that has created both fear and loathing of members of management. Create an environment that fosters better communication and accountability between lower employees and management."}, {"title": "Trending in the right direction", "text": "Pros Fantastic leadership adjustments have made an impact on the business. It is a long process to right the wrongs of former employees who simply didn’t know enough about how to run or be part of an effective procurement services organization – let alone grow it. Cons No major ones that don't exist at every other big company. Advice to Management Keep it up", "rating": 5, "pros": "Fantastic leadership adjustments have made an impact on the business. It is a long process to right the wrongs of former employees who simply didn’t know enough about how to run or be part of an effective procurement services organization – let alone grow it.", "cons": "No major ones that don't exist at every other big company.", "advice": "Keep it up"}, {"title": "Outside looking in.", "text": "Pros Great people, nice office to work. Cons Weak brand, not the biggest kid on the block. Advice to Management You can't play if you don't invest.", "rating": 3, "pros": "Great people, nice office to work.", "cons": "Weak brand, not the biggest kid on the block.", "advice": "You can't play if you don't invest."}, {"title": "Disorganized, lack of leadership and strategy", "text": "Pros Excellent pay and benefits, agile internal admin processes Cons Lack of product strategy, turnover at senior us management level, inexperienced us management", "rating": 1, "pros": "Excellent pay and benefits, agile internal admin processes", "cons": "Lack of product strategy, turnover at senior us management level, inexperienced us management", "advice": null}, {"title": "Great learning experience", "text": "Pros -Fast growing company -Able to learn a lot about procurement and eSourcing -Very flexible scheduling -Very open and trustworthy work environment Cons The pay was not fantastic and responsibilities were not well laid out. The company is growing quickly and does not have a firm foothold on job responsibilities. I expect that, with time, the company will get more organized into a firm corporate structure that they are currently lacking in.", "rating": 5, "pros": "-Fast growing company", "cons": "The pay was not fantastic and responsibilities were not well laid out. The company is growing quickly and does not have a firm foothold on job responsibilities. I expect that, with time, the company will get more organized into a firm corporate structure that they are currently lacking in.", "advice": null}, {"title": "Procurement", "text": "Pros Hard working people with good intentions. Cons Unrealistic expectations, egos of senior staff and other coworkers, no processess or procedures that are of value, and one main account in the United States. MM4 is a tool and not a long term cure for Xchanging profitability in procurement.", "rating": 1, "pros": "Hard working people with good intentions.", "cons": "Unrealistic expectations, egos of senior staff and other coworkers, no processess or procedures that are of value, and one main account in the United States. MM4 is a tool and not a long term cure for Xchanging profitability in procurement.", "advice": null}, {"title": "Good Company", "text": "Pros Extremely professional and great work life balance Cons Nothing as such. I worked for 2 years and was very satisfied", "rating": 5, "pros": "Extremely professional and great work life balance", "cons": "Nothing as such. I worked for 2 years and was very satisfied", "advice": null}, {"title": "I enjoyed working for this company. I learned a lot.", "text": "Pros good working enviroment to be in Cons not enough resturants to eat at for lunch Advice to Management keep up the good work daily", "rating": 5, "pros": "good working enviroment to be in", "cons": "not enough resturants to eat at for lunch", "advice": "keep up the good work daily"}, {"title": "Future of the company is unknown", "text": "Pros Start-up environment Hard workers at lower levels Cons Low pay Not a lot of executives willing to do any work", "rating": 3, "pros": "Start-up environment", "cons": "Low pay", "advice": null}, {"title": "Claims Examiner", "text": "Pros Good pay and good benefits Cons Management was horrible, controlled by one supervisor Advice to Management Learn how to manage people", "rating": 1, "pros": "Good pay and good benefits", "cons": "Management was horrible, controlled by one supervisor", "advice": "Learn how to manage people"}, {"title": "Are you kidding me? Who wrote that?", "text": "Pros Let me think of a pro.....parking garage is great, exercise room within the building is also valuable, no walls on the cubicle could be a pro to some to be exposed to all to hear and see you all day long. Cons Before the British came in and took over it was a tolerable place to work. After that all went down hill. Brits said \"We listen to the workers and not management cause they know the system and do the work\" . Then what happened to our MSA department? The most experience employees we had were fired after reaching a 1m annual goal. Those that were left were looked over for advancement and continue to be treated as illiterate candidates for growth or advancement. The old Senior Management are fearful for their jobs and therefore tell the Brits what they want to hear. We have not had a pay raise in 4 years and the deductible on our health benefits is so high it is not worth having it. When the new manager of our department was brought in she was never introduced to us by management. No email no anything, just this person who showed up one day. Communication and information is not broad-casted to the employees. Advice to Management Do as you say and listen to your employees, they hold the key to Xchanging future. Bring back those at any expense, that ran our cash cow department that is now being run in Texas by people who do not know how to spell \"MSA\". There has not been any new business here in months and our MSA department is what pays our salaries.", "rating": 1, "pros": "Let me think of a pro.....parking garage is great, exercise room within the building is also valuable, no walls on the cubicle could be a pro to some to be exposed to all to hear and see you all day long.", "cons": "Before the British came in and took over it was a tolerable place to work. After that all went down hill. Brits said \"We listen to the workers and not management cause they know the system and do the work\" . Then what happened to our MSA department? The most experience employees we had were fired after reaching a 1m annual goal. Those that were left were looked over for advancement and continue to be treated as illiterate candidates for growth or advancement. The old Senior Management are fearful for their jobs and therefore tell the Brits what they want to hear. We have not had a pay raise in 4 years and the deductible on our health benefits is so high it is not worth having it. When the new manager of our department was brought in she was never introduced to us by management. No email no anything, just this person who showed up one day. Communication and information is not broad-casted to the employees.", "advice": "Do as you say and listen to your employees, they hold the key to Xchanging future. Bring back those at any expense, that ran our cash cow department that is now being run in Texas by people who do not know how to spell \"MSA\". There has not been any new business here in months and our MSA department is what pays our salaries."}, {"title": "Good company to work for", "text": "Pros Good Projects Great Learning experience Cons Nothing as such They are good in Management skills Advice to Management Nothing", "rating": 5, "pros": "Good Projects", "cons": "Nothing as such", "advice": "Nothing"}, {"title": "Working in Xchanging", "text": "Pros Flexibility in terms of work hours, good Peers Cons Management unstructured, No Long Term plan", "rating": 3, "pros": "Flexibility in terms of work hours, good Peers", "cons": "Management unstructured, No Long Term plan", "advice": null}, {"title": "Work Place", "text": "Pros Balanced Work Personal Life and work ethics Cons No On-Site and hefty hike", "rating": 5, "pros": "Balanced Work Personal Life and work ethics", "cons": "No On-Site and hefty hike", "advice": null}, {"title": "Diversed LOB. Governance approach varies account to account. There is flexibility on how get things done.", "text": "Pros Flexible, opportunity to get creative in getting things done. Quite accomodating to proposal to improve or change. Cons Tend to be slow on certain processes and not transparent. Multiple chaser needs to be taken. Advice to Management In overall is a good place. But could use some standard SLA in getting things completed.", "rating": 5, "pros": "Flexible, opportunity to get creative in getting things done. Quite accomodating to proposal to improve or change.", "cons": "Tend to be slow on certain processes and not transparent. Multiple chaser needs to be taken.", "advice": "In overall is a good place. But could use some standard SLA in getting things completed."}, {"title": "good for learning", "text": "Pros good workplace and friendly people Cons management should be more efficient.", "rating": 3, "pros": "good workplace and friendly people", "cons": "management should be more efficient.", "advice": null}, {"title": "Great team, but people don't stick around long", "text": "Pros The team were fun to work with Cons In terms of progression there wasn't a lot. I was in the marketing team. Advice to Management Listen to your employees more and have other forms of support other than the line manager. The line managers weren't always interested in supporting you.", "rating": 3, "pros": "The team were fun to work with", "cons": "In terms of progression there wasn't a lot. I was in the marketing team.", "advice": "Listen to your employees more and have other forms of support other than the line manager. The line managers weren't always interested in supporting you."}, {"title": "A Great learning experience", "text": "Pros Lots of exposure Abundance of things to learn good leadership high satisfaction level Cons I could not find a trait Advice to Management keep up the good work", "rating": 5, "pros": "Lots of exposure", "cons": "I could not find a trait", "advice": "keep up the good work"}, {"title": "A mixed place to work - some good some bad - and things don't look like improving now part of DXC", "text": "Pros Often interesting work - right at the heart of the London Insurance Market. Cons Often tried to do too much, with too few people and with not enough financial reward. Have lost a lot of good people over the years and not replaced their knowledge. This looks like continuing now part of DXC - and with the additional drag of now being just a small part of a much larger organisation - with all the new processes and bureaucracy that come with it. Advice to Management Don't let size and bureaucracy inhibit an ability to be agile and responsive to customer needs - and value the knowledge and skills of your employees more.", "rating": 3, "pros": "Often interesting work - right at the heart of the London Insurance Market.", "cons": "Often tried to do too much, with too few people and with not enough financial reward. Have lost a lot of good people over the years and not replaced their knowledge. This looks like continuing now part of DXC - and with the additional drag of now being just a small part of a much larger organisation - with all the new processes and bureaucracy that come with it.", "advice": "Don't let size and bureaucracy inhibit an ability to be agile and responsive to customer needs - and value the knowledge and skills of your employees more."}, {"title": "Avoid if Possible !", "text": "Pros Excellent work location. Feels like you are in the centre of plush greenland. Salary is higher than most local companies. Great work to learn new things in the technology world. CEO is always willing to help and open to talk to everyone. Few management people are great to talk to and help you to grow. But not all Cons Too many to list - 1. No matter how right you are, you can’t say anything to your manager. He is the ultimate boss even if he is completely wrong. 2. Food sucks big time in the cafetaria. The guy at cafetaria is innovating on new dishes. But quality sucks. 3. You are a slave to the client. Even if client asks you to dance nude. You will have to. The company's management or manager will not stand for you. 4. Company management only knows to speak. They can't fulfil any of the commitments. Even they don't have control over salary hike of the employees. Many people leave the company because they don't get the salary hike on time. And worst part is that if you resign and next month the hike comes for other employees. It is pure cheating as employee is still entitled to get his/her arrears for the days he has worked. You are told when you resign that even if there is a salary hike happening in your notice period, You will not get the hike. This is purely cheating. 5. You can only survive if you are a Yes master to ur manager. In simple words, if you can lick your manager. You are an exceptionally performing employee. 6. No clear vision or strategy for the company. You are like a sheep in herd. You come, you work, you get paid. Don’t bother about tomorrow. They company is also not bothered about its tomorrow. They say, they are part of two big companies. But nobody has seen one company doing anything at all. We just use the name in our signatures... ha ha. 7. Townhalls are conducted as if management is doing a favour on employees. They give only vague and unrealistic aspirations. If asked about commitments from previous townhalls, they won't have an answer. 8. No idea on what other departments are doing. Absolutely no interconnectivity between departments. Everybody works in silos. 9. Some HODs or Senior management people behave as if they own the department and the people too. Shouting and screaming has become part of their DNA. Also, just by ridiculing an ethnicity or race, you are creating more trouble for yourself outside the office. 10. Last, but very important to consider - Forget that you have a family if you work here. You are made to work late nights and on weekends and holidays without any proper compensations. And dare you don't come to office when your manager asks you to, even if you have a sick child at home or its your anniversary. Forget everything and rush to office. Else for entire year your performance will be rated low. Advice to Management Set the vision for the company. Communicate that vision with clear strategy and roadmap to achieve. Don't give vague and unrealistic aspirations. People get everything. They are not novice as much as you think they are. Stop treating people as money making robots. Once deployed at client and you forget about them. Most importantly stand with your employee. Give him/her confidence that company will support you. Don't just throw the employee to the lion and watch the show.", "rating": 3, "pros": "Excellent work location. Feels like you are in the centre of plush greenland.", "cons": "Too many to list -", "advice": "Set the vision for the company. Communicate that vision with clear strategy and roadmap to achieve."}, {"title": "Xchnaging Malaysia", "text": "Pros Nothing much but a full time job Cons No proper process implementation, internal politics, no technical growth Advice to Management Please treat employees as humans rather than robots", "rating": 3, "pros": "Nothing much but a full time job", "cons": "No proper process implementation, internal politics, no technical growth", "advice": "Please treat employees as humans rather than robots"}, {"title": "Good to work for Fresher", "text": "Pros Learning opportunities are limited, Management is good Cons Not Flexi work hours", "rating": 3, "pros": "Learning opportunities are limited, Management is good", "cons": "Not Flexi work hours", "advice": null}, {"title": "Company Work Culture", "text": "Pros Everyone helps in team in every situation Cons no cons very good envoirment", "rating": 5, "pros": "Everyone helps in team in every situation", "cons": "no cons very good envoirment", "advice": null}, {"title": "All good things come to an end", "text": "Pros Xchanging was one of the best companies to work untill May 2017 when CSC took over the company. As said all good things come to an end one day and did Xchanging. Cons All staff in UK were asked to go. No credits for hard work as entire XCH management is now left and CSC leads do not allow Xchanging team to be rewarded. CSC leaders takes things too personally and hate XCH staff. Infact one of major reason of high attrition is the same taht CSC do not respect employee from Xchanging. We all were demoted on name of designation restructuring and only CSC employees were promoted. We are denied of promotion and increments even if we are top rated employees. No increments since Jan 2016. Advice to Management Be fair, be better and respect your good staff and don;t be gender and entity biased", "rating": 1, "pros": "Xchanging was one of the best companies to work untill May 2017 when CSC took over the company. As said all good things come to an end one day and did Xchanging.", "cons": "All staff in UK were asked to go. No credits for hard work as entire XCH management is now left and CSC leads do not allow Xchanging team to be rewarded. CSC leaders takes things too personally and hate XCH staff. Infact one of major reason of high attrition is the same taht CSC do not respect employee from Xchanging. We all were demoted on name of designation restructuring and only CSC employees were promoted. We are denied of promotion and increments even if we are top rated employees. No increments since Jan 2016.", "advice": "Be fair, be better and respect your good staff and don;t be gender and entity biased"}, {"title": "senior software engineer", "text": "Pros Good work culture, work-life balance, shift-allowance, on-time salary Cons very small canteen, food is little-bit over-priced.", "rating": 5, "pros": "Good work culture, work-life balance, shift-allowance, on-time salary", "cons": "very small canteen, food is little-bit over-priced.", "advice": null}, {"title": "Good but very less pacakage", "text": "Pros Good working environment and management is good Cons Package would have been better", "rating": 3, "pros": "Good working environment and management is good", "cons": "Package would have been better", "advice": null}, {"title": "Good for flatters", "text": "Pros work life balance, less pressure, take leaves as mush as you can Cons * if you are good in flatters this company is good for you * out of clients/project during acquisition and merger. * faulty resource planning. * will focus you on if you are good in Ji Sir, Yes Sir, Yes Sir Advice to Management do proper planning and resource utilization.", "rating": 3, "pros": "work life balance, less pressure, take leaves as mush as you can", "cons": "* if you are good in flatters this company is good for you", "advice": "do proper planning and resource utilization."}, {"title": "It has its Highs and Lows like all companies", "text": "Pros Flexibility and work life balance, salary and some benefits are fair. Cons Lacking in local progression opportunities and with little budget for any training apart from on the job/internal, people either leave or become unmotivated.", "rating": 3, "pros": "Flexibility and work life balance, salary and some benefits are fair.", "cons": "Lacking in local progression opportunities and with little budget for any training apart from on the job/internal, people either leave or become unmotivated.", "advice": null}, {"title": "Career Advancement", "text": "Pros Great Working in Projects . Ability to experiment in many approach to find optimal solution Cons Transitioning tasks to operations are difficult due to managers don't want to own the problem and see the transition thru Advice to Management Need heads to take ownership to ensure transition of duties are carried out effectively", "rating": 3, "pros": "Great Working in Projects . Ability to experiment in many approach to find optimal solution", "cons": "Transitioning tasks to operations are difficult due to managers don't want to own the problem and see the transition thru", "advice": "Need heads to take ownership to ensure transition of duties are carried out effectively"}, {"title": "Nice", "text": "Pros May be confidential or privileged Cons Will not send it back together Advice to Management Nothing", "rating": 5, "pros": "May be confidential or privileged", "cons": "Will not send it back together", "advice": "Nothing"}, {"title": "Getting worse every day since 2015", "text": "Pros Flexibility to work from home, if your team manager doesn't adopt double standards. Adjusters. The work itself. Cons Adjusters bullied into working the rate of 3 people, for no bonus or payrise. Staff are stressed, demotivated, likely to make mistakes due to volumes as management refuse to back fill positions and work load forever increasing. Instead they are sourcing more work? Team managers are Ops people with no claims experience, and think that previously working in a supermarket or selling shoes gives them justification to bully loyal and hard working experienced Adjusters, using crass data measurement systems that will never work, is a waste of time an money, then work from home most of the week forwarding irrelevant emails to make it look they are working. Advice to Management Cull the bean counters. Not wanted. Not needed. They are a hindrance and drain of resource. Use their salaries to bulk up on Adjusters, to increase volumes, increase morale, and give the opportunity to encourage more pipeline revenue. MUST give a bonus to bread winning Adjusters. They will leave and you will lose the business due to relationship those Adjusters have with clients. Be visible to staff. Take on board their concerns rather than ignore them and hope things get better or employ more bean counters.", "rating": 1, "pros": "Flexibility to work from home, if your team manager doesn't adopt double standards. Adjusters. The work itself.", "cons": "Adjusters bullied into working the rate of 3 people, for no bonus or payrise. Staff are stressed, demotivated, likely to make mistakes due to volumes as management refuse to back fill positions and work load forever increasing. Instead they are sourcing more work? Team managers are Ops people with no claims experience, and think that previously working in a supermarket or selling shoes gives them justification to bully loyal and hard working experienced Adjusters, using crass data measurement systems that will never work, is a waste of time an money, then work from home most of the week forwarding irrelevant emails to make it look they are working.", "advice": "Cull the bean counters. Not wanted. Not needed. They are a hindrance and drain of resource. Use their salaries to bulk up on Adjusters, to increase volumes, increase morale, and give the opportunity to encourage more pipeline revenue. MUST give a bonus to bread winning Adjusters. They will leave and you will lose the business due to relationship those Adjusters have with clients. Be visible to staff. Take on board their concerns rather than ignore them and hope things get better or employ more bean counters."}, {"title": "NA", "text": "Pros They are prompt and on time payment cycle. Process they have are good. Cons Management has lot of issues, lot of local unfair politics Advice to Management Please concentrate only on your Job roles.", "rating": 3, "pros": "They are prompt and on time payment cycle. Process they have are good.", "cons": "Management has lot of issues, lot of local unfair politics", "advice": "Please concentrate only on your Job roles."}, {"title": "Not attractive", "text": "Pros Nothing good, Not recommand to join. Cons Can't remember to many. They Cons more that pros. Advice to Management Work towards to make employee friendly.", "rating": 3, "pros": "Nothing good, Not recommand to join.", "cons": "Can't remember to many. They Cons more that pros.", "advice": "Work towards to make employee friendly."}, {"title": "Glad I made the jump to move on!", "text": "Pros People on the floor working were fantastic up to team leader level. Flexible working... when suitable for the company mostly however working at home when agreed was a good perk. Cons Management above team leader level was terrible. Bullying culture and if you have an opinion xchanging is not the place for you! Bonuses removed a couple of years ago and message was left to team leaders to deliver. No senior management present. Led to believe you are working well until near appraisal time when your pdr score is dropped and performance improvement plans are bought in. All to stop any pay rises or bonus payments. I became depressed and so stressed working here. Leaving was the best move ever! Advice to Management Start again! Get people focused managers who don't micro manage.", "rating": 1, "pros": "People on the floor working were fantastic up to team leader level. Flexible working... when suitable for the company mostly however working at home when agreed was a good perk.", "cons": "Management above team leader level was terrible. Bullying culture and if you have an opinion xchanging is not the place for you! Bonuses removed a couple of years ago and message was left to team leaders to deliver. No senior management present. Led to believe you are working well until near appraisal time when your pdr score is dropped and performance improvement plans are bought in. All to stop any pay rises or bonus payments. I became depressed and so stressed working here. Leaving was the best move ever!", "advice": "Start again! Get people focused managers who don't micro manage."}, {"title": "Average Company", "text": "Pros Work Life Balance for flatters Cons No Transport, No Meal, To much politics Advice to Management Keep good guys for work", "rating": 3, "pros": "Work Life Balance for flatters", "cons": "No Transport, No Meal, To much politics", "advice": "Keep good guys for work"}, {"title": "express bdx delegated lead", "text": "Pros flexible hours work from home people are lovely Cons no bonus or rise no tryst in company", "rating": 3, "pros": "flexible hours work from home people are lovely", "cons": "no bonus or rise no tryst in company", "advice": null}, {"title": "Test", "text": "Pros Ok to work with xch Cons Travel policy is not meet Advice to Management Mgmt are active to motivate", "rating": 3, "pros": "Ok to work with xch", "cons": "Travel policy is not meet", "advice": "Mgmt are active to motivate"}, {"title": "Manager - Operations & Transitions", "text": "Pros Great Clients and Opportunities , Methodology Cons Merger & Acquisitions during 2016 & 2017.", "rating": 5, "pros": "Great Clients and Opportunities , Methodology", "cons": "Merger & Acquisitions during 2016 & 2017.", "advice": null}, {"title": "Ver bad Company", "text": "Pros Take leaves as much you want Cons Bad culture ,no working environment ,poor management No promotions and no increment overall total waste", "rating": 1, "pros": "Take leaves as much you want", "cons": "Bad culture ,no working environment ,poor management", "advice": null}, {"title": "Good Company to work", "text": "Pros 1. Work Life Balance 2. Less Politics 3. Good Salary Cons 1. Sometimes management is hard to reach. 2. Policies are not very clear Advice to Management Please make policies clear to employees", "rating": 5, "pros": "1. Work Life Balance", "cons": "1. Sometimes management is hard to reach.", "advice": "Please make policies clear to employees"}, {"title": "good", "text": "Pros very good working culture and good place to work Cons nothing to say anything, no cons at all. Advice to Management nothing to say anything, very good management", "rating": 5, "pros": "very good working culture and good place to work", "cons": "nothing to say anything, no cons at all.", "advice": "nothing to say anything, very good management"}, {"title": "Manager", "text": "Pros Good place to work. Employee friendly. Cons Undergoing merger with CSC and integration with HPE.", "rating": 5, "pros": "Good place to work. Employee friendly.", "cons": "Undergoing merger with CSC and integration with HPE.", "advice": null}, {"title": "positive", "text": "Pros dynamic, challenging, interesting, regional scope Cons too many personnel changes in a short timeframe Advice to Management investment in people", "rating": 3, "pros": "dynamic, challenging, interesting, regional scope", "cons": "too many personnel changes in a short timeframe", "advice": "investment in people"}, {"title": "Big company with startup culture", "text": "Pros Good exposure with abundant responsibility if you are ready to take it. Cons Company lacks vision from senior management.", "rating": 3, "pros": "Good exposure with abundant responsibility if you are ready to take it.", "cons": "Company lacks vision from senior management.", "advice": null}, {"title": "Worst experience I ever had.", "text": "Pros Time to time job, simple life. Nice to have faces. Cons Appraisal process is very bed, even since last two years no appraisal. Working on old technology. There are too many peocess and even HR also not aware important process. Manager does not listen to you. Company provide paid parking in same building they are here to earn from employee. After marger thing are very very bad. For any hardware resources there are too many process, it takes approximately one year. Uncertainty about job safety. And no project, no choice if you want to change team. Advice to Management Kindly make easier to employees communicate high management.", "rating": 1, "pros": "Time to time job, simple life. Nice to have faces.", "cons": "Appraisal process is very bed, even since last two years no appraisal.", "advice": "Kindly make easier to employees communicate high management."}, {"title": "Good Company for a fresher to start", "text": "Pros Nice Environment. Approachable Management. Friendly colleague Cons Less Salary. Less hike. Promotion not dearer to ground level employees.", "rating": 3, "pros": "Nice Environment. Approachable Management. Friendly colleague", "cons": "Less Salary. Less hike. Promotion not dearer to ground level employees.", "advice": null}, {"title": "Comfort zone at it's best", "text": "Pros You will Learn how to Play TT and Ludo, And you can read whatever you want. You can prepare for IAS. Parties are awesome. Cons Technical Learning is quite low. Advice to Management Keep it up", "rating": 3, "pros": "You will Learn how to Play TT and Ludo, And you can read whatever you want.", "cons": "Technical Learning is quite low.", "advice": "Keep it up"}, {"title": "Nice Company to startup your career", "text": "Pros Good Organization with nice infrastructure. Best company to startup one's career. Cons Not easy to get promotions only with hard working ability.", "rating": 5, "pros": "Good Organization with nice infrastructure. Best company to startup one's career.", "cons": "Not easy to get promotions only with hard working ability.", "advice": null}, {"title": "Not a good company to start your career", "text": "Pros If you are under good manager then things will be different. Cons 1. Will not get increments and good salary. 2. Politics everywhere Advice to Management Manager should avoid micromanagement", "rating": 1, "pros": "If you are under good manager then things will be different.", "cons": "1. Will not get increments and good salary. 2. Politics everywhere", "advice": "Manager should avoid micromanagement"}, {"title": "Don't Loose your Legacy Employees", "text": "Pros Great place to work as a fresher. Cons Great that company merged with CSC. But Please Don't Loose your Legacy Employees.. people working since 2 years without any salary increment. doesn't sound good for a Commerce company where employee not paid well when IT is down. Advice to Management Please Hold them they are at the best at work.", "rating": 1, "pros": "Great place to work as a fresher.", "cons": "Great that company merged with CSC.", "advice": "Please Hold them they are at the best at work."}, {"title": "Corporate Development Intern", "text": "Pros Friendly environment, great office, received lots of help and support Cons No clear career progression, lack of direction for the internship programme", "rating": 5, "pros": "Friendly environment, great office, received lots of help and support", "cons": "No clear career progression, lack of direction for the internship programme", "advice": null}, {"title": "Going downhill fast", "text": "Pros Great staff to work with Flexible working which is great for balancing work and children Cons Recently have been bought out by CSC who have now merged with HPE to become DXC - the organisation has gone down hill ever since. Travel ban is in place to stop us working in different offices unless we can charge a customer. All employee extras removed, such as no Christmas lunch allowance, no expensed office parties or gatherings, nothing to help with employee engagement. All we keep hearing is operational costs to be cut and by offshoring, therefore redundancies are looming yet there is no communication about it. Staff are plodding along with no motivation to perform well or exceed anymore. Advice to Management You are going so far with cost saving that you will lose the core knowledge and experience of how to run the business and services. Strategically you may save a few pennies but in the long run poor service will only lead to loss of contracts and customers in which you rely on for your revenue.", "rating": 3, "pros": "Great staff to work with", "cons": "Recently have been bought out by CSC who have now merged with HPE to become DXC - the organisation has gone down hill ever since. Travel ban is in place to stop us working in different offices unless we can charge a customer. All employee extras removed, such as no Christmas lunch allowance, no expensed office parties or gatherings, nothing to help with employee engagement. All we keep hearing is operational costs to be cut and by offshoring, therefore redundancies are looming yet there is no communication about it. Staff are plodding along with no motivation to perform well or exceed anymore.", "advice": "You are going so far with cost saving that you will lose the core knowledge and experience of how to run the business and services. Strategically you may save a few pennies but in the long run poor service will only lead to loss of contracts and customers in which you rely on for your revenue."}, {"title": "Avg Company", "text": "Pros The thing that i like is that the Hours are Flexible , The MNC is Good and it has a Good Atmosphere. Cons No Good Projects are there and No Salary Hikes can be expected. If you have any project you will be only person No Project skills", "rating": 3, "pros": "The thing that i like is that the Hours are Flexible , The MNC is Good and it has a Good Atmosphere.", "cons": "No Good Projects are there and No Salary Hikes can be expected.", "advice": null}, {"title": "Good Company", "text": "Pros Good to work here. Place to learn. Cons Need to be more process oriented", "rating": 3, "pros": "Good to work here. Place to learn.", "cons": "Need to be more process oriented", "advice": null}, {"title": "Great career exposure", "text": "Pros You will be immersed in opportunities to push the boundaries of your capabilities and encouraged to take confidence in learning new skills on the job Cons Concerns about stability of core business model and all event management decisions appears short sighted Advice to Management Be more physically present in key operational locations and provide more hands on leadership with clients", "rating": 5, "pros": "You will be immersed in opportunities to push the boundaries of your capabilities and encouraged to take confidence in learning new skills on the job", "cons": "Concerns about stability of core business model and all event management decisions appears short sighted", "advice": "Be more physically present in key operational locations and provide more hands on leadership with clients"}, {"title": "Good Company Initially", "text": "Pros 1. work life balance 2. Good salary Cons Nothing much to learn. Freshers please refrain", "rating": 3, "pros": "1. work life balance", "cons": "Nothing much to learn.", "advice": null}, {"title": "Insurance analyst", "text": "Pros Good environment. Good for women's as the company have a concern about women issues and problems. Cons Nothing as such to post. Everything is fine. Good going Advice to Management Good management", "rating": 5, "pros": "Good environment. Good for women's as the company have a concern about women issues and problems.", "cons": "Nothing as such to post. Everything is fine. Good going", "advice": "Good management"}, {"title": "Interview", "text": "Pros Friendly work place, amicable atmosphere Cons Little outside city area accessible by shuttle bus only", "rating": 3, "pros": "Friendly work place, amicable atmosphere", "cons": "Little outside city area accessible by shuttle bus only", "advice": null}, {"title": "Company of Gupta Brothers", "text": "Pros Location is good Lot of party Cons Lot of internal politics Gupta Brothers are appriciated Advice to Management Give chance and promote good people.", "rating": 3, "pros": "Location is good", "cons": "Lot of internal politics", "advice": "Give chance and promote good people."}, {"title": "Business Analyst", "text": "Pros Excellent exposure of the role Cons the recent market developments of Merger Advice to Management Do not lose focus on Employees", "rating": 3, "pros": "Excellent exposure of the role", "cons": "the recent market developments of Merger", "advice": "Do not lose focus on Employees"}, {"title": "Appaling company", "text": "Pros Got to go to India - that was about it. Even that trip was horrible due to the pedantic temperament of my \"manager\" Cons My advice to people is DON'T WORK HERE. My manager was ignorant, uncultured and depressed. A product of a city that tells women: \"you can have it all\" and then at the age of 40 - 41, my manager realises she is alone and therefore has nothing. My few months here were awful: no support, no explanations, no mentoring - nothing. I spoke to ex team members who said they would never come back to Group Finance and I could see straight away why. Advice to Management No point advising you. This company is a joke. a bad joke", "rating": 1, "pros": "Got to go to India - that was about it. Even that trip was horrible due to the pedantic temperament of my \"manager\"", "cons": "My advice to people is DON'T WORK HERE.", "advice": "No point advising you. This company is a joke. a bad joke"}, {"title": "Too much politics", "text": "Pros Leadership is clueless so there is no work. Good place for people who don't want to work. Cons Too much politics No growth Clueless leadership Bad paymasters HR is useless Advice to Management None", "rating": 1, "pros": "Leadership is clueless so there is no work. Good place for people who don't want to work.", "cons": "Too much politics", "advice": "None"}, {"title": "Out of the fire and down the pan", "text": "Pros Good people with excellent business logic. Excellent opportunities to learn how the London market operates 'from the inside'. Reasonably accepting of training requirements. Cons No longer has any identity. Taken over by CSC; reduced morale; travel embargo; remuneration well below market; in-house politics are rife Advice to Management I'm not sure any are left... Most of the old Management have left (pushed/jumped - who knows leaving key staff operating with no support", "rating": 1, "pros": "Good people with excellent business logic. Excellent opportunities to learn how the London market operates 'from the inside'. Reasonably accepting of training requirements.", "cons": "No longer has any identity. Taken over by CSC; reduced morale; travel embargo; remuneration well below market; in-house politics are rife", "advice": "I'm not sure any are left... Most of the old Management have left (pushed/jumped - who knows leaving key staff operating with no support"}, {"title": "Good to work and gain experience", "text": "Pros - Environment is good - HR is helpful and good to communicate Cons - no proper career growth - lack of skillful people", "rating": 3, "pros": "- Environment is good", "cons": "- no proper career growth", "advice": null}, {"title": "Manager - Learning and Development", "text": "Pros It was a very employee friendly company Cons Company has been taken over", "rating": 5, "pros": "It was a very employee friendly company", "cons": "Company has been taken over", "advice": null}, {"title": "Overall Good company to work", "text": "Pros Work Life Balance Time flexibility Good culture Cons Quality of work Growth is not good in terms of work and salary After acquisition by CSC, all pros and benefits are over", "rating": 3, "pros": "Work Life Balance", "cons": "Quality of work", "advice": null}, {"title": "Project Lead", "text": "Pros Good Domain exposure in Insurance Domain. Good exposure to products like Genius, Brokasure No extended working hours Cons Un-necessary politics within the team Not many projects, hence bill-ability issues Extremely poor recruitment process - there are experienced technical people recruited for a particular domain with no exposure on that domain. Advice to Management Lack of direction from senior management. You see very often the senior management team getting changed, and each one tries to bring in their perspective.", "rating": 3, "pros": "Good Domain exposure in Insurance Domain.", "cons": "Un-necessary politics within the team", "advice": "Lack of direction from senior management. You see very often the senior management team getting changed, and each one tries to bring in their perspective."}, {"title": "associate", "text": "Pros Working hours, great salary package, good opportunity for freshers to start a carrier... Cons Not much downside, but just a much workload at start, which is everywere.. Advice to Management Management are damm good, no advice right now", "rating": 5, "pros": "Working hours, great salary package, good opportunity for freshers to start a carrier...", "cons": "Not much downside, but just a much workload at start, which is everywere..", "advice": "Management are damm good, no advice right now"}, {"title": "I worked at Xchanging full-time (More than 4 years)", "text": "Pros Location wise it is in center. Cons No-projects,No work balance.No job security", "rating": 3, "pros": "Location wise it is in center.", "cons": "No-projects,No work balance.No job security", "advice": null}, {"title": "Current snapshot of the engagement", "text": "Pros The organization has changed a lot and it is not the same as it was. Cons There is always scope of improvement.", "rating": 5, "pros": "The organization has changed a lot and it is not the same as it was.", "cons": "There is always scope of improvement.", "advice": null}, {"title": "Software Engineer", "text": "Pros I was working for Xuber insurance software as a developer. The company has a very friendly work culture if you are hard working and disciplined. Cons Very less onsite options in Xuber. They allow only a handful of people the opportunity to go onsite and the trips are usually small (Avg. 3 months) Advice to Management Keep up the good work", "rating": 5, "pros": "I was working for Xuber insurance software as a developer. The company has a very friendly work culture if you are hard working and disciplined.", "cons": "Very less onsite options in Xuber. They allow only a handful of people the opportunity to go onsite and the trips are usually small (Avg. 3 months)", "advice": "Keep up the good work"}, {"title": "Process Associates Salary", "text": "Pros This is a good company to start the career. Cons Politics is ruining the organisation. Advice to Management Stop doing this politics in the organisation.", "rating": 3, "pros": "This is a good company to start the career.", "cons": "Politics is ruining the organisation.", "advice": "Stop doing this politics in the organisation."}, {"title": "Who knows whats going to happen", "text": "Pros Local offices have a very supportive atmosphere Local groups work with minimal to no budget to aid in employee morale and engagement Cons Who knows what is going to happen with the CSC intergration. Comms is now so poor (Xchanging had worked hard to improve it and now we have taken 1000 steps back) We are all just numbers, does anyone care? We feel the brunt of our customers when things are not going well due to resourcing restrictions... a customer pays for an FTE, but our new biggest boss Mr L is signing every vacancy off??? In a company of thousands??? micromanaging to the nth degree so that he and others are sure of their bonus, whilst we are working ourselves to the point of being ill, trying to keep things afloat. If VRs are offered in my area I will jump at the chance. Advice to Management What does it matter, the local management are trying but as soon as it goes past our SLT it vanishes because we are not valued. We bring in your bonus payments..... whilst we get nothing.", "rating": 1, "pros": "Local offices have a very supportive atmosphere", "cons": "Who knows what is going to happen with the CSC intergration.", "advice": "What does it matter, the local management are trying but as soon as it goes past our SLT it vanishes because we are not valued. We bring in your bonus payments..... whilst we get nothing."}, {"title": "Good to work at Xchanging", "text": "Pros Flexible timing. Good learning. Recognition. Work environment is good. Salary is ok. Cons As of now no project CSC take over", "rating": 5, "pros": "Flexible timing.", "cons": "As of now no project", "advice": null}, {"title": "Good", "text": "Pros Good for freshers for beginning of their career in operations. Dont switch if getting proper increments and promotions. Cons Might get to work in more big firm with experience in this company. Advice to Management People are good but senior management (manager and above) needs to advice their just below juniors (As. Manager 2016) to speak properly and ethicly to their juniors.", "rating": 3, "pros": "Good for freshers for beginning of their career in operations.", "cons": "Might get to work in more big firm with experience in this company.", "advice": "People are good but senior management (manager and above) needs to advice their just below juniors (As. Manager 2016) to speak properly and ethicly to their juniors."}, {"title": "Good place for work", "text": "Pros Good work life balance, Low work pressure Cons After acquisition by CSC company started cost cutting. Advice to Management Nothing", "rating": 5, "pros": "Good work life balance, Low work pressure", "cons": "After acquisition by CSC company started cost cutting.", "advice": "Nothing"}, {"title": "Senior Software Engineer", "text": "Pros Working as Senior Software Engineer in Xchanging Solution as CSC, Chennai from April 14 to till date Cons Good exposure and Experience Business Advice to Management Opportunity need to give everyone", "rating": 3, "pros": "Working as Senior Software Engineer in Xchanging Solution as CSC, Chennai from April 14 to till date", "cons": "Good exposure and Experience Business", "advice": "Opportunity need to give everyone"}, {"title": "Good company to work with", "text": "Pros Everything is just perfect, you would love the work culture. Cons Nothing as such, as it is a good company to work with. Advice to Management Keep doing the good work.", "rating": 3, "pros": "Everything is just perfect, you would love the work culture.", "cons": "Nothing as such, as it is a good company to work with.", "advice": "Keep doing the good work."}, {"title": "BU Head / Programme Manager", "text": "Pros Great work atmosphere and good AES team Cons Should have foreseen the catastrophe coming.", "rating": 5, "pros": "Great work atmosphere and good AES team", "cons": "Should have foreseen the catastrophe coming.", "advice": null}, {"title": "Associate", "text": "Pros No Work Pressure. For people in the insurance domain, company sponsors for the CII exams. Cons The management in India lacks vision and commitment. People with talent are recognized but not allowed to grow up the ladder as there's lots of office politics. The management is in a mode to save their jobs and roles after the CSC acquired Xchanging. Advice to Management Please make way for the young candidates,", "rating": 3, "pros": "No Work Pressure.", "cons": "The management in India lacks vision and commitment. People with talent are recognized but not allowed to grow up the ladder as there's lots of office politics. The management is in a mode to save their jobs and roles after the CSC acquired Xchanging.", "advice": "Please make way for the young candidates,"}, {"title": "Best place to work for experience", "text": "Pros Best for work life balance Cons slow learning, as it is a product based company.", "rating": 5, "pros": "Best for work life balance", "cons": "slow learning, as it is a product based company.", "advice": null}, {"title": "xchanging", "text": "Pros Good place learn and work good for beginners Cons no work life balance no infrastructure upgrade Advice to Management none", "rating": 5, "pros": "Good place learn and work", "cons": "no work life balance", "advice": "none"}, {"title": "HRBP", "text": "Pros Good reputable company in Fintech sector. Global organisation, some really great people to work with. Big name clients diverse offering. Cons relocating London office away from Leadenhall St was not a good move, when biggest client Lloyds was on the doorstep. Some very poor managers, ill equipped to deal with people related issues. HR relocated to Folkestone, poor decision. Advice to Management HR team sort out your policies and processes, train managers to manage people, equip them with tools and techniques. Managers, embrace global cross matrix working.", "rating": 3, "pros": "Good reputable company in Fintech sector. Global organisation, some really great people to work with. Big name clients diverse offering.", "cons": "relocating London office away from Leadenhall St was not a good move, when biggest client Lloyds was on the doorstep. Some very poor managers, ill equipped to deal with people related issues.", "advice": "HR team sort out your policies and processes, train managers to manage people, equip them with tools and techniques. Managers, embrace global cross matrix working."}, {"title": "It may be a part of CSC , however the company policies are not at all employee friendly. Here are some of the good thing", "text": "Pros Favorable environment for learning and growth. Virtually, no boundaries for interested employee to explore various areas within policy limits Cons System is stagnant because of few employees at top levels who don't deserve to be there Advice to Management Mid management is made of task masters who need to develop strategic thinking.", "rating": 5, "pros": "Favorable environment for learning and growth. Virtually, no boundaries for interested employee to explore various areas within policy limits", "cons": "System is stagnant because of few employees at top levels who don't deserve to be there", "advice": "Mid management is made of task masters who need to develop strategic thinking."}, {"title": "Over all good", "text": "Pros If you are a technical profile, it's a good company and overall work environment is good. Specifically in IT operation it's pretty good to work. Cons Less work life balance and no cafeteria facilities on weekend Advice to Management Nothing to say except few all are very professional and understanding.", "rating": 5, "pros": "If you are a technical profile, it's a good company and overall work environment is good. Specifically in IT operation it's pretty good to work.", "cons": "Less work life balance and no cafeteria facilities on weekend", "advice": "Nothing to say except few all are very professional and understanding."}, {"title": "Fantastic place to start your career", "text": "Pros Good opportunity Supportive managers Will learn a lot Cons Average salary and increment, Free cab only between night 9.00 PM to morning 6.00 AM", "rating": 3, "pros": "Good opportunity", "cons": "Average salary and increment,", "advice": null}, {"title": "A company to avoid working with", "text": "Pros Vast exposure to global environment Plenty of learning experience Flexibility of timing Cons Poor management Too low salaries as compared to level of work load & responsibilities Intense work pressure Full of internal politics No benefits to employees . Even cabs aren't free despite of damm low salaries. Negligible increments or promotions even after 4 years . No place for senior employees No work to life balance Late stays are a part of daily schedule with NO allowances for them . Frustrating work environment. Negligence overtime allowances as compared to industry. Advice to Management The management must need to treat employees as humans than hard-working robots. There is no way the company encourages the employees to work for . What Xchanging looks for is just cost - cutting at the price of quality . Please take note of these", "rating": 1, "pros": "Vast exposure to global environment", "cons": "Poor management", "advice": "The management must need to treat employees as humans than hard-working robots. There is no way the company encourages the employees to work for . What Xchanging looks for is just cost - cutting at the price of quality ."}, {"title": "Overall perception", "text": "Pros Favorable environment for learning and growth. Virtually, no boundaries for interested employee to explore various areas within policy limits Cons System is stagnant because of few employees at top levels who don't deserve to be there Advice to Management Mid management is made of task masters who need to develop strategic thinking.", "rating": 5, "pros": "Favorable environment for learning and growth. Virtually, no boundaries for interested employee to explore various areas within policy limits", "cons": "System is stagnant because of few employees at top levels who don't deserve to be there", "advice": "Mid management is made of task masters who need to develop strategic thinking."}, {"title": "will recommend for quick learners", "text": "Pros good learning for 3-4 year Cons work life balance,pressure Advice to Management credit n balance life cycle", "rating": 3, "pros": "good learning for 3-4 year", "cons": "work life balance,pressure", "advice": "credit n balance life cycle"}, {"title": "Senior Software Engineer", "text": "Pros Learning Opportunities, Leadership team, Compensation, Core values Cons Work life Balance, No clear leadership insights Advice to Management Equal Opportunities", "rating": 5, "pros": "Learning Opportunities, Leadership team, Compensation, Core values", "cons": "Work life Balance, No clear leadership insights", "advice": "Equal Opportunities"}, {"title": "Swallowed Whole", "text": "Pros Global reach Some strong experience and market knowledge Cons No strategic direction Staff churn Inability to attract top talent Red tape at every turn Advice to Management Too late - now been assimilated into CSC", "rating": 3, "pros": "Global reach", "cons": "No strategic direction", "advice": "Too late - now been assimilated into CSC"}, {"title": "Operations", "text": "Pros Flex time Center Milan good location Cons Awful collegue did not give me any formation and pretend me to do Also their job. All were Trying to put you in the worst working condition Advice to Management Manage better Hr", "rating": 1, "pros": "Flex time", "cons": "Awful collegue did not give me any formation and pretend me to do Also their job. All were Trying to put you in the worst working condition", "advice": "Manage better Hr"}, {"title": "Good place", "text": "Pros Great staff and managers do what they can to help and bend over backwards Cons A lot of pressure and an intense worming day Advice to Management Try to think about the employees a bit more and realise we all have a job to do", "rating": 5, "pros": "Great staff and managers do what they can to help and bend over backwards", "cons": "A lot of pressure and an intense worming day", "advice": "Try to think about the employees a bit more and realise we all have a job to do"}, {"title": "Xchanging", "text": "Pros Good Place to work for beginners Cons transport policy is not good", "rating": 3, "pros": "Good Place to work for beginners", "cons": "transport policy is not good", "advice": null}, {"title": "Few good projects and few worst", "text": "Pros As i was part of worst project, yeah i did not find any good things. Cons Very bad management , Few managers screw you even though you do your work", "rating": 3, "pros": "As i was part of worst project, yeah i did not find any good things.", "cons": "Very bad management , Few managers screw you even though you do your work", "advice": null}, {"title": "Senior Analyst", "text": "Pros Good work environment ,plenty of recreational activities Cons Bad management though the company slogan is Simplifying the complex actually it does the other way around, plenty of bad managers aroud Advice to Management take your work seriously not yourself", "rating": 3, "pros": "Good work environment ,plenty of recreational activities", "cons": "Bad management though the company slogan is Simplifying the complex actually it does the other way around, plenty of bad managers aroud", "advice": "take your work seriously not yourself"}, {"title": "not structured, but have the freedom to perform", "text": "Pros allows and encourage ownership to perform at your best Cons no structure, poor HR management, poor salary review process", "rating": 3, "pros": "allows and encourage ownership to perform at your best", "cons": "no structure, poor HR management, poor salary review process", "advice": null}, {"title": "Jobs", "text": "Pros Nice Company to work. Good for seniors or experience person. Cons Management is not good. Not good for freshers. Advice to Management Try to use some managerial skills for management.", "rating": 3, "pros": "Nice Company to work. Good for seniors or experience person.", "cons": "Management is not good. Not good for freshers.", "advice": "Try to use some managerial skills for management."}, {"title": "Not a good company for freshers", "text": "Pros Friendly environment and easy to reach people Cons leadership and management issues, biased managers and senior management Advice to Management Hire right people for right work", "rating": 3, "pros": "Friendly environment and easy to reach people", "cons": "leadership and management issues, biased managers and senior management", "advice": "Hire right people for right work"}, {"title": "Advance Associate", "text": "Pros 1.Best place to work lot of opportunities for onsite. 2. Good policies. 3. Good Shift Timings. Cons 1. Food court is not good. Advice to Management None", "rating": 5, "pros": "1.Best place to work lot of opportunities for onsite.", "cons": "1. Food court is not good.", "advice": "None"}, {"title": "A Great Employer... Until the Take-Over", "text": "Pros Wages for the Folkestone office are above-average for the area. Company has a flexible attitude to work hours in all departments where this is feasible - it's not uncommon for people to work extra hours early in the week and bank time for shorter Fridays, and many people shift their work hours to something like 8am-4:30 or 09:30 - 6pm. Employees regularly run charity fund-raising events in the building for the yearly sponsored charity, and the office has a relatively laid-back approach to dress requirements. Cons The take-over by CSC has been an abysmal experience. Everyone understands that redundancies and restructuring is an expected part of any take-over. But redundancies were communicated extremely poorly to affected staff and their managers, and the effect on staff morale has been staggering. Communications from head-office about impending cuts are issued without any notice to senior staff, leaving managers and team leaders reeling to find information for worried staff. People recently made redundant weren't told their redundancy package until a handful of days before their official end date, or were given conflicting information. The new owner has flat cut the Christmas party, all discretionary budgets, work-related travel expenses *including compensating staff travelling to fulfil contractually-required meetings with customers and clients*. Communication from the new senior management is opaque, jargon-filled and often makes no sense. Staff commonly receive a blanket communication about mandatory training/attendance\" for something that, it later turns out, affects only a specific division of the company. A recent mistake related to bonus pay-outs was handled abysmally, with affected people having their mis-paid bonuses deducted from their next wages with zero notice, not even being told at all until they noticed the discrepancy in their payslip and made enquiries, which resulted in some people incurring rent arrears or struggling to cover travel costs to the office. The various benefits of remaining in this job over others are diminishing rapidly, and it is very clear that the company is no longer a competitive UK employer for London Insurance Market roles. Advice to Management Communicating with staff is not a case of sending out an email once a month. Communication is a two-way process. Being pro-active about contacting staff and taking the time to make sure you phrase communication in simple, clear language can make a huge difference to how secure and motivated staff feel. If a payroll error with bonuses happens, contact all affected people by letter immediately after learning of the issue, especially if bonuses are small enough that most people will spend them on a single splurge rather than invest them. Make arrangements so their team leaders are aware, and make sure they know the timeline for repayment ASAP. Have a structure in place to assist staff who may be adversely affected by the error. When announcing redundancies, contact affected departments before the general comms go out. Make sure that when affected departments are named in an email, you name that department and not *the entire company division the department sits under*. Have a named contact, with a listed email address, staff can refer concerns to if they don't understand any particular comms. Just try to make some basic effort.", "rating": 3, "pros": "Wages for the Folkestone office are above-average for the area. Company has a flexible attitude to work hours in all departments where this is feasible - it's not uncommon for people to work extra hours early in the week and bank time for shorter Fridays, and many people shift their work hours to something like 8am-4:30 or 09:30 - 6pm. Employees regularly run charity fund-raising events in the building for the yearly sponsored charity, and the office has a relatively laid-back approach to dress requirements.", "cons": "The take-over by CSC has been an abysmal experience. Everyone understands that redundancies and restructuring is an expected part of any take-over. But redundancies were communicated extremely poorly to affected staff and their managers, and the effect on staff morale has been staggering.", "advice": "Communicating with staff is not a case of sending out an email once a month. Communication is a two-way process. Being pro-active about contacting staff and taking the time to make sure you phrase communication in simple, clear language can make a huge difference to how secure and motivated staff feel."}, {"title": "Nice place to work", "text": "Pros Open environment. Less pressure and good work life balance. Cons Very less opportunity for off-shore projects.", "rating": 5, "pros": "Open environment.", "cons": "Very less opportunity for off-shore projects.", "advice": null}, {"title": "The grey area of your career path", "text": "Pros 1. You get to experience different kind of projects 2. Runemeration is quite good Cons 1. The projects are most of the time changed, before the completion. You will be assigned new project on last minute notice 2. Grey area of career path. Even you are .NET software developer, you might be assigned to Python project, mobile etc. For 3-4 months, it's good to have change of your projects, but not in short time 3. Worst finance / payroll team I have encoutered. Expect no reply from email / enterprise chat. You need to go to their room if there is any enquiries. There must be something wrong with their team as they act like they are too busy to even reply email. 4. Bad engagement from management to the development team. Advice to Management Have better engagement in terms of project deliverance to the employees, hire better / more employee to payroll team to further improve communication.", "rating": 1, "pros": "1. You get to experience different kind of projects", "cons": "1. The projects are most of the time changed, before the completion. You will be assigned new project on last minute notice", "advice": "Have better engagement in terms of project deliverance to the employees, hire better / more employee to payroll team to further improve communication."}, {"title": "good choice if u want to learn", "text": "Pros have lot of exposure. Good for 2-3 yrs engineers Cons stress weekend works compensation need to complete the work without prior knowledge and analysis Advice to Management ensure quality in all team involved in the development", "rating": 5, "pros": "have lot of exposure.", "cons": "stress", "advice": "ensure quality in all team involved in the development"}, {"title": "Worst company", "text": "Pros Flexible timings, no other benefits Cons Very less salary, growth opportunities nil, over burden of work load.", "rating": 1, "pros": "Flexible timings, no other benefits", "cons": "Very less salary, growth opportunities nil, over burden of work load.", "advice": null}, {"title": "Senior Associate", "text": "Pros The team that i have worked had onsite opportunities alot, but i dont think thats the case with other team. Team was pretty good and the managers are friendly. Cons Salary is very low, this everyone agrees. Advice to Management Not Much other than salary to be revised,", "rating": 3, "pros": "The team that i have worked had onsite opportunities alot, but i dont think thats the case with other team. Team was pretty good and the managers are friendly.", "cons": "Salary is very low, this everyone agrees.", "advice": "Not Much other than salary to be revised,"}, {"title": "Xchanging A CSC Company Review", "text": "Pros The Support Staff is very cooperative Cons Horrible Ethics followed by the management. The employees don't apply for leave even after availing Advice to Management Please follow proper ethics to retain good people", "rating": 1, "pros": "The Support Staff is very cooperative", "cons": "Horrible Ethics followed by the management. The employees don't apply for leave even after availing", "advice": "Please follow proper ethics to retain good people"}, {"title": "Consulting Manager: Business Strategy and Innovation", "text": "Pros Good Carer opportunity Innovative Good Senior Management Competitive salary Work life balance Cons Conflict between Group and Sector Management Reluctance in Change Management at Sector level Misuse of Flexibility at some level Lack of evaluation on strategic road-map implementation", "rating": 5, "pros": "Good Carer opportunity", "cons": "Conflict between Group and Sector Management", "advice": null}, {"title": "BPM in India", "text": "Pros Work-life balance with opportunities for the right fit Support for career development Cons Compensation at junior levels at India BPM seeks improvement to meet complex customer requirements Advice to Management Employee engagement should improve Compensation cannot always be as per industry standards", "rating": 5, "pros": "Work-life balance with opportunities for the right fit", "cons": "Compensation at junior levels at India BPM seeks improvement to meet complex customer requirements", "advice": "Employee engagement should improve"}, {"title": "Good", "text": "Pros Timely Salary Higher Range of Salary compared to other local IT Services Company Cons Customer Oriented Multi tasking is required", "rating": 3, "pros": "Timely Salary", "cons": "Customer Oriented", "advice": null}, {"title": "Xchanging Work culture", "text": "Pros Employee friendly culture ,Good for freshers Cons for freshers bond amount is too high so just make it adjustable.", "rating": 5, "pros": "Employee friendly culture ,Good for freshers", "cons": "for freshers bond amount is too high so just make it adjustable.", "advice": null}, {"title": "Good", "text": "Pros Good Carrier growth in terms of technology Cons No concerns . Iam ok with this company.", "rating": 5, "pros": "Good Carrier growth in terms of technology", "cons": "No concerns . Iam ok with this company.", "advice": null}, {"title": "Softare Engineer", "text": "Pros Lot or Work. People would be able to learn lot of things. Cons Obvious Salaries. Hikes and Environment. Advice to Management Grow Up", "rating": 5, "pros": "Lot or Work. People would be able to learn lot of things.", "cons": "Obvious Salaries. Hikes and Environment.", "advice": "Grow Up"}, {"title": "Xchanging review", "text": "Pros Work - life balance is good. Work environment is relaxed Cons Now taken over by CSC, hence future path not clear Advice to Management None", "rating": 3, "pros": "Work - life balance is good. Work environment is relaxed", "cons": "Now taken over by CSC, hence future path not clear", "advice": "None"}, {"title": "Test Lead", "text": "Pros Amazing place to work with good salaries and encouraging work culture. This motivates all the individuals to be more enthusiastic about their work Cons Nothing as such on my mind", "rating": 5, "pros": "Amazing place to work with good salaries and encouraging work culture. This motivates all the individuals to be more enthusiastic about their work", "cons": "Nothing as such on my mind", "advice": null}, {"title": "Xchanging Shimoga", "text": "Pros Good for Freshers to start a Career.They provide food and accommodation for first 3 months Cons Very tough to adjust in Shimoga Location .Salary is less as they consider it as a 3 tier City.", "rating": 3, "pros": "Good for Freshers to start a Career.They provide food and accommodation for first 3 months", "cons": "Very tough to adjust in Shimoga Location .Salary is less as they consider it as a 3 tier City.", "advice": null}, {"title": "Technical Engineer", "text": "Pros Employee friendly Good Package is given Cons some times it looks like your are not encouraged Advice to Management Need to have an employee skill enhancement training in every 3 or 6 months for all , especially for those working on client places. Also they need to give importance for all instead of those who always keep in touch with the employees.", "rating": 3, "pros": "Employee friendly", "cons": "some times it looks like your are not encouraged", "advice": "Need to have an employee skill enhancement training in every 3 or 6 months for all , especially for those working on client places."}, {"title": "Clan culture", "text": "Pros I have worked in various areas within Xchanging and have always enjoyed. Teams work together, managers are supportive and there is training and progression available if you seek it. Cons Since the CSC take over, I am not sure if training will be so readily available. CSC introduces alot of uncertainty in the workplace. Advice to Management Keep the Xchanging culture if possible - it works.", "rating": 5, "pros": "I have worked in various areas within Xchanging and have always enjoyed. Teams work together, managers are supportive and there is training and progression available if you seek it.", "cons": "Since the CSC take over, I am not sure if training will be so readily available. CSC introduces alot of uncertainty in the workplace.", "advice": "Keep the Xchanging culture if possible - it works."}, {"title": "Overall review", "text": "Pros A good stable place to work Cons Growth opportunities tend to be less Advice to Management Nothing", "rating": 3, "pros": "A good stable place to work", "cons": "Growth opportunities tend to be less", "advice": "Nothing"}, {"title": "Great Place to work", "text": "Pros Well organised members, open to grow and a friendly management Cons Nothing Noticeable,... Company been acquired frequently", "rating": 5, "pros": "Well organised members, open to grow and a friendly management", "cons": "Nothing Noticeable,... Company been acquired frequently", "advice": null}, {"title": "Good to start career as analyst", "text": "Pros To gain knowledge on domineering, people help for your career growth and Manger will take with them. Mainly help full for girls and housewife. Cons Waiting for long term promotion and slow career growth. Slow payment growth. Advice to Management Retain experience people with market value", "rating": 3, "pros": "To gain knowledge on domineering, people help for your career growth and Manger will take with them. Mainly help full for girls and housewife.", "cons": "Waiting for long term promotion and slow career growth. Slow payment growth.", "advice": "Retain experience people with market value"}, {"title": "Good company for freshers", "text": "Pros Lots of things to learn, good exposure, overall good Cons appraisal process is poor, purely politics", "rating": 5, "pros": "Lots of things to learn, good exposure, overall good", "cons": "appraisal process is poor, purely politics", "advice": null}, {"title": "Opportunity", "text": "Pros Good opportunities for engineer graduates and it professionals Cons Senior management is weak with not too much clarity about business outlook...", "rating": 3, "pros": "Good opportunities for engineer graduates and it professionals", "cons": "Senior management is weak with not too much clarity about business outlook...", "advice": null}, {"title": "About company", "text": "Pros Good working environment in the company Cons work pressure is there from team", "rating": 5, "pros": "Good working environment in the company", "cons": "work pressure is there from team", "advice": null}, {"title": "Good not the best company", "text": "Pros Good environment to work for experienced. Cons For freshers they train in different technology and allocate project for different technologies.", "rating": 3, "pros": "Good environment to work for experienced.", "cons": "For freshers they train in different technology and allocate project for different technologies.", "advice": null}, {"title": "Short review", "text": "Pros Good learning and challenging work experience with collaborative colleague Cons Lacks market competative salary structure Advice to Management Better communication", "rating": 3, "pros": "Good learning and challenging work experience with collaborative colleague", "cons": "Lacks market competative salary structure", "advice": "Better communication"}, {"title": "good company", "text": "Pros nice place to work, good oppotunities Cons nothing, salary could be better Cabs can be provided for free", "rating": 5, "pros": "nice place to work, good oppotunities", "cons": "nothing, salary could be better", "advice": null}, {"title": "Xchanging ,best Place to work", "text": "Pros Employee motivation,Good Culture, flexible work hour, One of the best comp that I had worked upon. Cons Nothing, I find nothing except few people who complains about excess work pressure, but this is almost common in every IT comp", "rating": 5, "pros": "Employee motivation,Good Culture, flexible work hour, One of the best comp that I had worked upon.", "cons": "Nothing, I find nothing except few people who complains about excess work pressure, but this is almost common in every IT comp", "advice": null}, {"title": "Xchanging", "text": "Pros Xchanging UK is a great place to work with. The people are fantastic and loving and the company looks after each and every employee which is incredible. The inclination towards Corporate Social Responsibility is appreciable as well Cons There should be a detail level of direction shown by the Leadership team Advice to Management Carry on with the good work. Proud to be associated with Xchanging UK in the past", "rating": 5, "pros": "Xchanging UK is a great place to work with. The people are fantastic and loving and the company looks after each and every employee which is incredible. The inclination towards Corporate Social Responsibility is appreciable as well", "cons": "There should be a detail level of direction shown by the Leadership team", "advice": "Carry on with the good work. Proud to be associated with Xchanging UK in the past"}, {"title": "If you want to lean Politics. @Join Xchanging", "text": "Pros 1- Gets salary on time. 2- Flexible working hour. 3- Hr guys are helpful. Cons 1- Salary below industry avg. 2- Lack or no good project 3- The project has no time- lines. It keep on extending. Till it is over budged. 4-No induction. 5-Improving things in Xchanging like making crime Advice to Management It is a Pvt Limited company not public Limited company. Make decision as per business needs rather as to fulfills your own personal relationship goals.", "rating": 1, "pros": "1- Gets salary on time.", "cons": "1- Salary below industry avg.", "advice": "It is a Pvt Limited company not public Limited company. Make decision as per business needs rather as to fulfills your own personal relationship goals."}, {"title": "Good Company to work", "text": "Pros Good company for who want to learn Cons Work management is not good, those who is having work are overloaded and some are completely free", "rating": 5, "pros": "Good company for who want to learn", "cons": "Work management is not good, those who is having work are overloaded and some are completely free", "advice": null}, {"title": "Ok to work for", "text": "Pros Good people and supportive management Cons Money - very very difficult to increase your wage. No bonus and little benefits", "rating": 5, "pros": "Good people and supportive management", "cons": "Money - very very difficult to increase your wage. No bonus and little benefits", "advice": null}, {"title": "Good experience, have learned new things", "text": "Pros Nice environment to work with, peoples are friends and open to discus thing's Cons Feeling stuck, doing same type of work and not able to enhance my skills Advice to Management NA", "rating": 3, "pros": "Nice environment to work with, peoples are friends and open to discus thing's", "cons": "Feeling stuck, doing same type of work and not able to enhance my skills", "advice": "NA"}]