[{"title": "A great place to work", "text": "Pros Zego really is a great place to work. The team is supportive, ambitious and friendly, and what we are achieving is really exciting! We work hard, but the monthly socials, weekly breakfasts and activities also means we have lots of fun. Zego has that great start-up family feel. The new office is also incredible - it's a great space to be working in. Cons I can't think of any. Advice to Management Keep doing what you're doing.", "rating": 5, "pros": "Zego really is a great place to work. The team is supportive, ambitious and friendly, and what we are achieving is really exciting!", "cons": "I can't think of any.", "advice": "Keep doing what you're doing."}, {"title": "Great place to work", "text": "Pros Great atmosphere and really appreciated Cons Old street location not super", "rating": 5, "pros": "Great atmosphere and really appreciated", "cons": "Old street location not super", "advice": null}, {"title": "Hectic, fun, challenging", "text": "Pros Supportive environment Super smart people Great management team Collaborative working environment New challenges to tackle all the time 'Get things done' mentality Great team spirit Insane pace of work Freedom to work autonomously Opportunities to grow and progress Cons Limited benefits (currently) Can be a bit all consuming at times", "rating": 5, "pros": "Supportive environment", "cons": "Limited benefits (currently)", "advice": null}, {"title": "FANTASTIC WORKPLACE!", "text": "Pros The culture and values that is embedded into this company is exceptional. They're patient, kind and extremely understanding. Cons At the moment, there is no cons working at Zego! Advice to Management Keep the family orientated vibe the same", "rating": 5, "pros": "The culture and values that is embedded into this company is exceptional. They're patient, kind and extremely understanding.", "cons": "At the moment, there is no cons working at Zego!", "advice": "Keep the family orientated vibe the same"}, {"title": "An insurance company worth working for...Finally!!!", "text": "Pros Open to listening to staff ideas and actually implementing them if change is good. A genuinely warm team to work with and supportive in every avenue. Right now, I feel staff are at the heart of Zego and are doing lots to keep up appearances, especially CEO's who get involved. Innovative, educated and inspirational company to work for.. keep it up Zego, never change Cons Office space at the moment but this is being addressed as I type, that truly is only negative at this time and I had to write something. Advice to Management Stay on top of putting staff and customers first. This is key. Never forget the day to day running of the company, front line. Just don't change what you are about and don't become a typical insurance company.", "rating": 5, "pros": "Open to listening to staff ideas and actually implementing them if change is good.", "cons": "Office space at the moment but this is being addressed as I type, that truly is only negative at this time and I had to write something.", "advice": "Stay on top of putting staff and customers first. This is key. Never forget the day to day running of the company, front line. Just don't change what you are about and don't become a typical insurance company."}, {"title": "Finally - A Company that Gets It!", "text": "Pros Inspirational, innovative and experienced leaders who genuinely care about their staff, customers and companies they partner with. A warm, encouraging and inspiring training and support system. \"Inclusion\" is at the heart of Zego. I've never seen anything quite like it before. Staff treat you the way they would like to be treated themselves. Genuinely open to new ideas and will actually alter and change things if it makes sense to do so. A really fresh startup attitude. A phenomenal balance of staff that simply works. Nobody is left on the outside looking in. Groundbreaking product that has mega-legs globally. Hardworking but chilled out vibe in the office, where music plays, the fridge is always filled with snacks and there is always somebody there to help you if you are feeling stuck, or overwhelmed. Just A1 - and I am picky! Cons Other than the small office space that separates CS from tech (which is being addressed in November) I simply cannot think of one. Advice to Management Just keep being outstanding. Keep being different and not like so many other companies where staff get so discouraged by exclusion and nepotism. Keep loving your staff and your customers! Keep being humble.", "rating": 5, "pros": "Inspirational, innovative and experienced leaders who genuinely care about their staff, customers and companies they partner with.", "cons": "Other than the small office space that separates CS from tech (which is being addressed in November) I simply cannot think of one.", "advice": "Just keep being outstanding. Keep being different and not like so many other companies where staff get so discouraged by exclusion and nepotism. Keep loving your staff and your customers! Keep being humble."}]