[{"title": "Awesome", "text": "Pros There are a lot, but the mainly is that the person matters. You're not a number. Cons All the Zenjob company is not in the same office yet (Berlin). That's the only issue. Advice to Management Keep doing exactly the same.", "rating": 5, "pros": "There are a lot, but the mainly is that the person matters. You're not a number.", "cons": "All the Zenjob company is not in the same office yet (Berlin). That's the only issue.", "advice": "Keep doing exactly the same."}, {"title": "Great team solving an ambiguous problem", "text": "Pros The team at Zenjob is great and you fastly forgot that you just joined last week while you are already deep inside the making a difference. Cons Company is still transitioning from a small startup to a middle sized company meaning that a lot of internal processes are not yet that smooth. But there is always someone to help out if its crunches.", "rating": 5, "pros": "The team at Zenjob is great and you fastly forgot that you just joined last week while you are already deep inside the making a difference.", "cons": "Company is still transitioning from a small startup to a middle sized company meaning that a lot of internal processes are not yet that smooth. But there is always someone to help out if its crunches.", "advice": null}, {"title": "fast growing and promising start up", "text": "Pros very friendly, open minded and international team a lot of smart people everyone strives for perfection and improvement of the product and the processes nice and enjoyable working atmosphere Cons With great growth comes great lack of space but there are already plans for a new office :)", "rating": 5, "pros": "very friendly, open minded and international team", "cons": "With great growth comes great lack of space but there are already plans for a new office :)", "advice": null}, {"title": "Rising Start Up", "text": "Pros Great atmosphere, everybody knows eachother and even doing things outside working hours together! Everybody striving for perfection and only the best is just good enough Cons Communication between departments lacking sometimes.", "rating": 5, "pros": "Great atmosphere, everybody knows eachother and even doing things outside working hours together!", "cons": "Communication between departments lacking sometimes.", "advice": null}, {"title": "Great – go zen!", "text": "Pros They have a friendly, welcoming team and an open minded management. Flexible work hours and flat hierarchies are the standard. It is really about providing an environment you are happy with and to work on things you like to work on. No top to bottom only, no code monkeys – they want you to be involved and to take part in the company. Cons It is a Startup –> if you do not like to take the initiative and responsibility and think outside the box you are probably not too happy here. It is not standard 9-5", "rating": 5, "pros": "They have a friendly, welcoming team and an open minded management. Flexible work hours and flat hierarchies are the standard. It is really about providing an environment you are happy with and to work on things you like to work on. No top to bottom only, no code monkeys – they want you to be involved and to take part in the company.", "cons": "It is a Startup –> if you do not like to take the initiative and responsibility and think outside the box you are probably not too happy here. It is not standard 9-5", "advice": null}, {"title": "Great team, great environment!", "text": "Pros - Small team, family atmosphere - Smart founders and management team, focused on sustainable growth - Great to work on a product that is used and highly appreciated by students Cons - Office could be nicer", "rating": 5, "pros": "- Small team, family atmosphere", "cons": "- Office could be nicer", "advice": null}, {"title": "An Amazing Startup in Berlin", "text": "Pros I worked enterprise companies like Turkcell and Huawei before but to be honest I can say that after these experiences, Zenjob was a great decision for me. As a developer they gave me whole responsibility to manage the Android app. Despite of this responsibility, they dont make pressure and I can work as a really free. After looking for a job in Berlin for 1.5 years, Zenjob hired me in 1.5 hours so I feel myself as really luck guy. If you wanna apply to Zenjob, just apply without thinking :D Cons Until now, I have not faced any bad issue with Zenjob, but If I face, I will comment here, promise :D", "rating": 5, "pros": "I worked enterprise companies like Turkcell and Huawei before but to be honest I can say that after these experiences, Zenjob was a great decision for me. As a developer they gave me whole responsibility to manage the Android app. Despite of this responsibility, they dont make pressure and I can work as a really free. After looking for a job in Berlin for 1.5 years, Zenjob hired me in 1.5 hours so I feel myself as really luck guy. If you wanna apply to Zenjob, just apply without thinking :D", "cons": "Until now, I have not faced any bad issue with Zenjob, but If I face, I will comment here, promise :D", "advice": null}, {"title": "Sehr guter Arbeitgeber", "text": "Pros Atmosphäre und Vorgesetzte, lustige Teamevents, faire Bezahlung, flexible Arbeitszeiten Cons Lack of Diversity, chaotische Organisation Advice to Management Bitte mehr Frauen in Führungspositionen, ebenso wie People of Colour, Beeinträchtigte, Trans People, etc.", "rating": 5, "pros": "Atmosphäre und Vorgesetzte, lustige Teamevents, faire Bezahlung, flexible Arbeitszeiten", "cons": "Lack of Diversity, chaotische Organisation", "advice": "Bitte mehr Frauen in Führungspositionen, ebenso wie People of Colour, Beeinträchtigte, Trans People, etc."}, {"title": "Hier wird Startup gelebt!", "text": "Pros - Gründergeist in allen Abteilungen - Tolles Teamgefüge - Inspirierende Gründer - Flache Hierarchien - Innovatives Konzept & revolutionäre Vision Cons - schlechter Kaffee - teils hoher Lärmpegel Advice to Management - weiter so!", "rating": 5, "pros": "- Gründergeist in allen Abteilungen", "cons": "- schlechter Kaffee", "advice": "- weiter so!"}, {"title": "Familiäres Arbeitsklima und tolles junges Team", "text": "Pros Flache Hierarchien, respektvoller Umgang, ganz egal wie lange man schon dabei ist. Super dynamisch, viele Gestaltungsmöglichkeiten. Hier geht man wirklich gerne zur Arbeit! Cons Teilweise etwas chaotisch, typisch start-up eben.", "rating": 5, "pros": "Flache Hierarchien, respektvoller Umgang, ganz egal wie lange man schon dabei ist. Super dynamisch, viele Gestaltungsmöglichkeiten. Hier geht man wirklich gerne zur Arbeit!", "cons": "Teilweise etwas chaotisch, typisch start-up eben.", "advice": null}, {"title": "Super Star-Up", "text": "Pros Keine Hierarchien und kreative/abwechslungsreiche Arbeitsweisen Cons Lofträume, keine Möglichkeit in Ruhe zu arbeiten Advice to Management Mehr Stand-Up-Meetings/ Feedback", "rating": 5, "pros": "Keine Hierarchien und kreative/abwechslungsreiche Arbeitsweisen", "cons": "Lofträume, keine Möglichkeit in Ruhe zu arbeiten", "advice": "Mehr Stand-Up-Meetings/ Feedback"}, {"title": "Klasse Startup mit viel Potential", "text": "Pros Super Startup mit einer ehrgeizigen Aufgabe. Ein professionelles und hilfsbereites Team meistern diese gekonnt. Die Kommunikation im gesamten Team (auch zwischen den verschiedenen Standorten) ist erstklassig. Cons Das schnelle Wachstum hinterlässt Spuren. Das aktuelle Büro ist zu klein und nicht jeder hat mehr den Platz, den er braucht. Advice to Management Macht einfach weiter wie bisher. Ich denke die offene Kommunikation hilft uns allen.", "rating": 5, "pros": "Super Startup mit einer ehrgeizigen Aufgabe. Ein professionelles und hilfsbereites Team meistern diese gekonnt. Die Kommunikation im gesamten Team (auch zwischen den verschiedenen Standorten) ist erstklassig.", "cons": "Das schnelle Wachstum hinterlässt Spuren. Das aktuelle Büro ist zu klein und nicht jeder hat mehr den Platz, den er braucht.", "advice": "Macht einfach weiter wie bisher. Ich denke die offene Kommunikation hilft uns allen."}, {"title": "#GoZen", "text": "Pros Das Team ist top, die Arbeit macht Spaß und wir helfen, und wir arbeiten an einem Produkt, was alle Parteien gleichermaßen glücklich macht :) Cons Es gibt (noch) keinen office-dog :( Advice to Management Weiter so ;)", "rating": 5, "pros": "Das Team ist top, die Arbeit macht Spaß und wir helfen, und wir arbeiten an einem Produkt, was alle Parteien gleichermaßen glücklich macht :)", "cons": "Es gibt (noch) keinen office-dog :(", "advice": "Weiter so ;)"}]